{
  "post content": "\n\n\nMy husband and I have been having a long struggle with infertility. We have been getting treated and trying for a baby since 2017. But nothing worked! My husband is understandably devastated as he'd always wanted kids but never got the chance to be a father.\n\n\nHe's super sensitive aroubd the infertility topic. This my family knows. Days ago, we got together with family for dinner. All of a sudden, my sister and her husband announced that they were expecting. We were stunned, me and my husband I mean. As for the others they were thrilled. As everyone got up to congratulate them. My husband got up, pushed his chair to the side and walked out. They all stared at me but I got up and told my sister she messed up by announcing her pregnancy like this and with 0 consideration for my husband knowing how he feels about this topic. She got defensive saying his \"issues\" with the topic wasn't her problem and that she and her husband were fed up walking on eggshells around him. I called her selfish and cruel but she complained that he ruined their joy and that I made it worse by making a scene. I told her she shoukdn't have chose my parents house but she said I have no place to dictate what she does in our parents house. My mom asked me to go home and I went.\n\n\nIt's been horrible. My parents think I've reacted poorly and should apologize to my sister on both mine and my husband's behalf after the scene we made at their home.",
  "id": 1,
  "comments": [
    {
      "score": 40953,
      "content": "YTA sorry.   Unfortunate situation but where else is your sister supposed to announce that she's pregnant?  Or is she supposed to keep it a secret?",
      "id": 2,
      "comments": [
        {
          "score": 18423,
          "content": "She was probably expected to not get pregnant to keep things “fair.”",
          "id": 3,
          "comments": [
            {
              "score": 6585,
              "content": "Yeah that's sort of the impression I got as well.",
              "id": 4,
              "comments": [
                {
                  "score": 7122,
                  "content": "OP mentions that the sister said that she and her husband \"are tired of walking on eggshells around this issue\", which has been going on for the last 5 years. I get the feeling that the husband is hypersensitive about being infertile, which is why he immediately walked out of the house.  I think the sister feels like she has been very patient and \"walked on eggshells\" for so long, and that they could finally after 5 years, be pregnant without having to hide it.\n\nI also like how OP says her sister \"shouldn't have chosen my parents house\" when it is also the sister's parents house.  Why wouldn't you announce your pregnancy at your parents dinner table?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2512,
                      "content": "Also that the OP says it was bad to do it at the parents house, then proceeds to be kicked out of said house by said parents.\n\nClearly the parents didn’t mind the sister being “selfish”.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1196,
                      "content": "Her calling it \"my parents house\" is very telling of how entitled of a person OP truly is. Sounds like this couple has a way of making everything about themselves with zero regard to how others feel. Both OP and her husband are massive AH's.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 606,
                      "content": ">Why wouldn't you announce your pregnancy at your parents dinner table?\n\nExactly. This seems like a normal place to do this. I mean, it would be super inappropriate if the sister made the announcement at OP's house or something. Then OP may have a leg to stand on. But the parents house is shared neutral territory as far as I'm concerned.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 281,
                      "content": "Exactly!! You are bang on with your assessment.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "This !! \n\nShe’s announcing to family the soon he be grandparents and aunt/uncle but I guess the sister shouldn’t announce anything bc op is the only one who can do what she wants",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "The sister probably put a lot of thought into telling everyone together, so she wouldn't get the grievance of keeping it a secret or withholding the news. \n\nAnd I don't know why it would make it worse for OP's husband that he heard it in his in-laws' house.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Agreed 100%. Sorry OP. YTA. While this is an issue for you and your husband, try to be happy for your sister.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I know, maybe next time take them all to a different venue and tell the whole family?  Would that make it better to OP?  Doubtful since she’s unreasonable!",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "To be fair you could announce it when OP’s husband isn’t there. But the way the whole thing is worded, it sounds like no matter what happened, they would have been assholes about it.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Dead right. Generally the rule to be considerate is to warn the couple who are struggling ahead of time so they have time to process privately. But something tells me the sister had her reasons for not doing that",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 286,
                  "content": "I wonder if OP and her husband realize that if they're that far gone, that they, especially hubby, likely need some mental health assistance.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 89,
                      "content": "This ! Him wanting everyone to walk on eggshells for him like sorry but that’s a you problem and he needs a lot of help to think everyone needs to do thatzz",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Absolutely! After IVF didn't work, I couldn't see a baby without crying, so I went to the doctor to get help, and started antidepressants and counseling! It helped so much and I can enjoy spending time with skal kids again, even if they're not mine.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "THIS! If he still harbors resentment towards non-infertile couples after all these years, then he needs mental health assistance in the worst way. My biggest peeve is when people refuse to get help for their issues, yet expect everyone else to coddle/tiptoe/give trigger warnings. WE are responsible for our own reactions. Nobody else.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "And that kind of selfishness goes along with the attitude.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "YTA omg YTA and you can’t see it? Your sister said she’s been walking on egg shells. Of course she has. This is her happy moment she shouldn’t have to baby you and your husband and keep quiet about it. She has a right to let your parents know. Your husband should also know the world does not revolve around him and if he can’t handle things happening to other people then he needs serious therapy.",
                  "id": 21,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "YTA. Massively. So they should not announce one of their biggest joys in life because you are unable to have that same joy yourself? They don’t need to shrink themselves to make you feel bigger. Grow up, go to therapy, and apologize ASAP.",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2103,
              "content": "Dude wtf that is just not what I get from this at all. It just sounds like a private heads up or doing it when they’re not there would have been more considerate. It blindsided them, as anyone could have predicted.",
              "id": 23,
              "comments": [
                {
                  "score": 2586,
                  "content": "I'd be inclined to vote ESH. Sister should have given OP advance notice. That would have been the kind thing to do. Still, as hurt as OP and her husband were, OP has no business telling her sister she couldn't announce her pregnancy at a family gathering at the parents' house. She should have just excused herself and left with her husband.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 1037,
                      "content": "I agree mildly with esh with op being the bigger one. In my opinion your second sentence should say the sister COULD have given up advance notice, as that would have been the kind thing to do. But she didn't have to, it isn't a 'should' have thing. She might have thought from previous interactions with op that a private disclosure would have been even worse and a bigger deal vs not singling her out and simply telling everyone all at once. She doesn't actually owe op a private announcement, she shared her news the way she felt the best about it.\n\nEdit: Definitely agree with how you describe what op should have done",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 498,
                      "content": "She's supposed to let them know that she was going to tell them that she was pregnant? \n\nYou really only need to tell people the once and it wasn't made a big thing.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 434,
                      "content": "Why would they tell them in advance? It would have ruined the surprise announcement (edit- you know they’d have gone ahead and whined to the family about the pregnancy so then the whole family already knows and the actual pregnant person never got to announce it her way)",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 313,
                      "content": "So she can be bitter and ruin it by complaining to their mom or other family? She and her husband are upset about their fertility issues…but other people get pregnant and it’s not as if sister upstaged or stole an event from her",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 265,
                      "content": "Excuse me but WHY does sister need to give OP advanced notice?? This isn't a case where sister needed to cater to them here. This is a case where an announcement happened, everyone got caught off guard and OP went off the rails. \n\nReally after the announcement OP as you said should have left with her husband and consoled him. But other than that, nobody else did anything wrong here.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 70,
                      "content": "Judging by their reactions, sister likely knew there was no point. It's clear there's been drama from OP in the past. She's awfully entitled.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "Maybe it's just me but no, it's not reasonable.\n\nIt's been 5 YEARS!!! Does he not know other people get pregnant? Does he get triggered seeing babies on the bus? Can he not be trusted around magazines announcing celebrity pregnancies?\n\nThe news is completely irrelevant to the husband beyond discovering pregnancies exist. How would a private conversation have helped, because then he could have excused himself before having to hear \"the P word\"?",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "This is wild. We don’t do this kind of crazy eggshell stepping around any other demo of people going through something hard. It is insane to think that just because you’re struggling to get pregnant, everyone else should also politely decline to get pregnant or talk about it or celebrate it. The idea that you would LEAVE YOUR SISTER’S PREGNANCY ANNOUNCEMENT because *it’s not fair, she knows I can’t get pregnant and how dare she* is one of the most selfish things I’ve ever heard. If you’re in your 20s/30s/early 40s, someone in your social circle is announcing a pregnancy what feels like at least once a month. OP says they’ve been struggling for five years. They should definitely have figured out a way to handle pregnancy announcements with some grace by now instead of making it all about them. Good god.",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "So is sister supposed to warn OP about every child-related topic in the future? With the way OP and husband reacted, I don’t blame the sister. OP and her husband might “slip” and ruin the surprise to the rest of the family. \n\nAn obvious exception to this would be recent pregnancy/infant loss. That would put the sister into actual blindsiding territory and a definite AH.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I’d agree, but I’m curious as to how OP would elaborate on the “tired of walking on egg shells” comment. I wonder if they’re going above and beyond being sensitive? I’m not sure how to word this. Where they’ve been trying to be respectful, but this was the last straw for sister? I’m not sure. That comment just stands out to me.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 377,
                  "content": "OP is acting like they got pregnant *at* her husband. It's understandable for him to feel overcome with emotions and need to leave the situation. OP should have apologized on his behalf and left with him. Not attack her sister for sharing news in the exact same way that OP (and many others) might share it if the roles were reversed.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 20,
                      "content": "This is the first comment I’ve seen that actually might convince me to change my vote. Thank you.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 358,
                  "content": "I don't think a heads up is warranted.  At some point,  these married people were probably going to get pregnant.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 84,
                      "content": "And being pregnant is a happy occasion for many. What better place and time to declare it than a family gathering?\n\nDoes OP's husband storm out of the room every time someone tells him that they are pregnant/expecting a baby? Dude needs to grow up and lose his main character syndrome.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 174,
                  "content": "If hearing the news that someone else is pregnant is so detrimental to hear then you need serious therapy, it’s ironic that OP is calling sis selfish when it is her and husband who expect people to cater to them",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 152,
                  "content": "Here’s the thing: it wasn’t a special occasion, it wasn’t a premeditated dig at OP. This is OP’s sister’s parents  home at a family get-together. It’s her sister’s family too and her BIL’s in-law’s. People are allowed to share happy news with their families without nitpicking about who is going to be offended at their joy. OP is the asshole for assuming she’s the only main character.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 146,
                  "content": "I'm curious how she would do that? I wanted my patents to be the first to know about my pregnancy. If it were me, should I have asked op and her husband not to come to dinner so I could tell my parents? Wouldn't that also have been unkind?",
                  "id": 41,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 117,
                  "content": "So you think it be better to have not invited them. At what point does that end, should they not invite them to the baby shower, to meet the baby, first birthday. I’m sure all hard days for someone struggling with infertility. But at some point you either need to suck it up and happily celebrate someone else’s joy or you’ll find yourself very alone and not invited to things anymore.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Exactly this, no matter how they were told about it the sister is going to start developing, have scans, have a baby shower, give birth! At what point are they going to be ok enough with it to even see her!?! She told her immediate family at a quiet dinner at home. It’s not like she shouted it out in public or anything crazy. It is hard but she can’t just be angry at everyone else having something she wants. Other people still go on with their lives and it feels like this is going to be an issue at every point during the pregnancy so it really will be walking on eggshells for them which is not right.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 77,
                  "content": "F that. While it sucks that  they can't get pregnant  expecting others to not talk about their own pregnancy is selfish, self important and ridiculous.",
                  "id": 44,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 69,
                  "content": "I’m going to disagree bc OP never said they were upset about not being given a heads up. They are upset that they announced it at their parents house while they were present. That means OP and her husband are unreasonable, blinded by their grief and making everyone pay for it. So, do you think two people who behave this way are going to act right if they were given a heads up. No, they wouldn’t, and I bet the sister knew that. They would have blown up in some way, and ruined the announcement before the dinner. Damned if you do, damned if you don’t. At least this way the sister got to announce it to the family on her conditions.",
                  "id": 45,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 67,
                  "content": "Would they also not be blindsided to find out they were the only ones who didn't know when the baby bump is too noticeable?",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 302,
              "content": "The family has been dealing with the couples infertility issues since 2017. As a person who had six miscarriages and did years of trying and ivf. It’s not fair to expect your family to walk on egg shells forever\n\nEdited some autocorrects and a typo",
              "id": 47,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 102,
              "content": "Or give them their baby since they can have more",
              "id": 48,
              "comments": [
                {
                  "score": 35,
                  "content": "Lol! This made me snort out loud!",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "Unfortunately, I wouldn't be surprised if this was true. I was diagnosed with a chronic autoimmune disease as a child. My parents were always about us only doing things if both could do it. That meant when I got sick and could no longer do the things I could do before my sister couldn't either. I always hated this as I felt my sister was unable to enjoy her childhood because of me.\n\nI knew then that I would likely never have kids. My doctor was always very honest about how my illness would affect my ability to have children. I was nine years old. My sister knew this too. She grew up saying she didn't want kids. I honestly can't say if she said it because it was true or if she said it because she knew I likely couldn't. She knew everything always had to be \"fair\" between us.\n\nGuess what? She got pregnant anyway. I didn't get pissed off. I didn't tell her to shut up about it,  get angry at her now ex or my parents for being happy. I can't even imagine thinking I was entitled to take that joy from my sister. \n\nOur pain does not give us the right to take the joy of a moment from someone else. My relationship with my sister and my nephews is ultimately more important than mourning the what might have been.\n\nYTA Op. Your husband walked out. You could have made up an excuse and left without causing an issue. Instead, you destroyed a moment of joy for your family because for that moment they weren't thinking of your pain. You aren't more important than your sister and I have a feeling you've been incorrectly made to feel you are.",
              "id": 50,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Yeah, I do think that while OP and her husband may not have actually thought this, it was subconsciously what they were hoping for. This is the reason they got so upset and husband freaked out. SMH. YTA",
              "id": 51,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Having gone through this myself I understand at least how your brain starts to lead you down this path but YTA OP. Your sister isn’t doing this to you. You need to remind yourself daily that this is a biological issue and others are not at fault because they don’t struggle like this. Get to a counselor and take your husband with you. Your sister has every right to love her life and enjoy it. Making her miserable about having a child isn’t going to make this any less painful for you. If someone in a wheelchair insisted that you never walk around them or make any mention of walking you would find that request absurd. You’re doing the same thing with fertility. Grieve your loss and open up your heart to love your new niece/nephew. It seems like such a hard thing in the moment but you will have your day one way or another.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 670,
          "content": "She has to hide the baby. Maybe build a little secret room in the attic.",
          "id": 53,
          "comments": [
            {
              "score": 178,
              "content": "Just like in everyone’s favorite childhood book, Flowers in the Attic",
              "id": 54,
              "comments": [
                {
                  "score": 97,
                  "content": "Oh gosh my mother let me read that book when I was *faaaaaaaar* too young. It was intense.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 19,
                      "content": "I read FitA when I was 28 and a parent, and I was too young for it LoL.",
                      "id": 56,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Some of the Chris and Cathy scenes probably shocked you.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I reread petals on the wind and was like \"WHAT THE HELL DID I READ AS A KID???\"",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "There was a post where the OP's sister was infertile and she didn't want ANY mention of pregnancy, baby shower, she didn't even want OP to bring baby to family events. This post is giving off those vibes for sure",
              "id": 59,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "In order to bring the baby around to family gatherings they have to dress them as an adult and pretend that the baby's actually just their good friend, Vincent Adultman",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 426,
          "content": "A lot of folks who have family struggling with infertility tell the infertile couple first or at least separately so they can break the news gently.",
          "id": 61,
          "comments": [
            {
              "score": 977,
              "content": "Would that have been nice? Yes. But it has been going on since 2017. At some point they need to get a grip. I always wanted a family and kids, didn't work out. But I'll be damned if I wasn't thrilled for every marriage and baby in the family.\n\nI'm sorry they are struggling on this journey, but not everything is about them. And given how poorly they handled the news, I can understand why she didn't give them a heads up. Probably afraid of getting cussed out on the phone.\n\nAnd for the record, I do think it is okay for them to be bummed and sad and wistful. But together, on their own, and not taking away from her sisters joy.",
              "id": 62,
              "comments": [
                {
                  "score": 320,
                  "content": "Yeah, I dealt with infertility while all my friends/family were having babies every other second. Of course it stung. But that’s not their sting to deal with. You don’t get to put your burdens on everyone else.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Imo if the OP had suffered a loss of an infant/miscarriage fairly recently then I kinda understand being upset by pregnancy announcement....but that is the only case where I could see OPs perspective. And it sounds like that didnt happen....",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "This one is it. It sucks when life gives you lemons, but you/they/other people can be happy for others’ good fortunes because that’s what a loving supporting family does. I’ve never understood the “hey I can’t have kids so the world can’t talk about them.”",
                  "id": 65,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I have a good friend who talked a lot about how he and his wife felt like they couldn't celebrate their first pregnancy bc her best friend had fertility issues. And he felt for the friend, but he just wanted his wife to be giddy about their baby.\n\nI've known a few other folks that felt that way over the years, but I'll never forget him talking about how it went from super happy to tons of eggshells to not offend their friend.\n\nSo yeah, there have been times I've wanted to be bitter or jealous myself, but I've never wanted to shit on someone's joy like that. I think about how he talked about it a lot when I want to get jealous, and it makes it easier for me to let go and focus on being truly happy for someone else.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Tbh I didn't think of it that way. It would've probably been clearer if OP mentioned something like this in her post cause to me it came across in a very different way. \nThanks for the different viewpoint!",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Infertility struggles are deeply personal.  While the sister might know there's issues, knowing how deep they go is pretty much impossible for anything other than the most intimate relationships",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 408,
          "content": "No one was going to win with OP. cause imagine if the sister did announce it privately and OP found out. She would probably be angry she wasn’t informed.\n\nOn top of that, is the baby not allowed at family events cause the husband can’t deal with it? No OP, YTA. go seek therapy.",
          "id": 69,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 240,
          "content": "Totally YTA. Even if the sister and BIL wanted to, the sister wasn’t going to be able to hide this news for long. I’m sure the husband is sensitive about this topic, but it doesn’t take much to be happy for someone and not selfish.",
          "id": 70,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 162,
          "content": "Is she not supposed to have a kid at all? I think your parents house makes the most sense to announce it. I'm sorry you're having issues, but that's no excuse to bring everyone down and expect them to cater to you. It is possible to actually be happy for someone even though you might be hurting. Otherwise you're just being a selfish brat. YTA and so is your husband.",
          "id": 71,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 125,
          "content": "She was supposed to deliver the news in the same manner that you might tell someone that they have a terminal illness.",
          "id": 72,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 82,
          "content": "I think OP wanted a “head’s up” like a text or call.",
          "id": 73,
          "comments": [
            {
              "score": 136,
              "content": "she should say that then!  It is hard to tell whether she is mad about not getting a heads up, or the family dinner announcement, or the news at all?",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Yes, let's ruin the surprise baby announcement by contacting people beforehand to give them a headsup.  Infertility doesn't mean they can gatekeep who can or cannot have a moment to celebrate having a baby.",
              "id": 75,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "But the sister and her husband wanted to tell everyone in person. Revealing a pregnancy is not necessarily the kind of thing you just want to *text* someone about. It was a private dinner at the parents' house with only the six of them there.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "OP, those are your sister's parents too. Where the hell was she supposed to tell them at? Also, was your sister supposed to never be around your husband as she gets further along in her pregnancy? Will her stomach offend him too? You both should look into therapy. YTA",
          "id": 77,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "Over a group text.  Obviously. (Sarcasm noted)",
          "id": 78,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14104,
      "content": "YTA. What exactly would you consider an appropriate way for her to announce her pregnancy? Or did you expect her to keep it a secret until the child was born, until it was old enough to graduate, for the rest of their lives?",
      "id": 79,
      "comments": [
        {
          "score": 3957,
          "content": "She probably expected her not to have children at all. Honestly there would not have been a good time for op or her husband. What they did was selfish. They took what was suppose to be the sisters happiest time and turned it so something about them.",
          "id": 80,
          "comments": [
            {
              "score": 1453,
              "content": "That's how it was with my aunt. She struggled with infertility and was the second wife of a man who had two children young so he had already raised kids and wasn't looking for another go round. She ended up adopting a boy. \n\nIt was cool when my mom had me but when my mom had a second child? \n\nMy aunt freaked out. Said my mom was only supposed to have one. My mom had the girl and my aunt had the boy. And the amount of \"oh you're just like me you can't have babies!\" my aunt said about the miscarriage before me...\n\nIt can get ugly.",
              "id": 81,
              "comments": [
                {
                  "score": 699,
                  "content": "It can get ugly. I sympathize with op. But you can’t expect people to quit living and part of living is having children.\n\nI think it’s very telling of op’s character for her to tell the sister she should not have announced at HER parents house. It’s the sisters parents too.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 281,
                      "content": "And it isn't the husband's parents' house and he's the one with the big reaction!",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I don't sympathize with her at all. If she had cancer and was at the hospital when another cancer patient rang the bell that they are cancer free would she scold them for it? Her and her husband are very selfish and can only think about their feelings",
                      "id": 84,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Yea I'm sure the grandparents to be are happy as well. Why rain on everyone's parade.",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "We have a now EX SIL who became incredibly toxic over it. We had 20 children, six through adoption because she's not the only infertile one in the family, by the time she broke loose and started inviting everyone to childless parties. The niblings already loved them and my brother was still great with the kids but she refused to get therapy and it just degraded into her hating them.  The first 'adult only party' party they had two of my brothers who are parents and me and the other two siblings who are not parents showed up, only for her to absolutely disparage every child she knew and all of the world's parents as being unworthy. When no one showed up to the second one she sent a group text that was one of the gnarliest things I ever saw.  One of the brothers with kids that had showed for the party has the home that we all gather at, enough rooms for all of us, centrally located, on the water. We didn't see my EXSIL or our brother again for a year and I was the only one he really texted even, but it was all shallow weather sure is nice shit. After a long while he just showed up at 4th of July to our surprise and said she was still refusing to get help and that he gave her divorce papers instead. He has since adopted as a single parent but his kid is amazing and he's such a great father.",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "That’s literally horrible.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "And, ironically, imagine if the situation was reversed. You KNOW she would expect them to jump for joy, scream it from the rooftops, hire a sky writer. YTA, OP. Your sister is allowed to live her life, a full life, without your feelings or those of your husband dictating her every move. \n\nHere’s a hot take- you and your husband might have been trying for 5 years, but you’re not ready for kids. That may sounds cruel or harsh, but your individual pregnancy journey isn’t the only one in the whole wide world. You need therapy for your grief, and to BOTH learn that your feelings aren’t always the most important in the room. If you can’t get past yourselves, you can’t show up fully for kids. This is why it’s important to process trauma before having children, to avoid passing down dysfunctional behavior to future generations. Your parents are also tired of your, BS, and, if you aren’t careful with respect to your sister, you may find yourself increasingly excluded in coming years as they won’t alienate a daughter and grandchild to spare your misplaced feelings. Get help.",
              "id": 88,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "My thoughts exactly. It's been 5 YEARS!!! That's way past the range of politeness to keep tiptoeing around this. I get it if they recently had a miscarriage in the past year.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 744,
          "content": "tbh  \nif I knew my sibling struggled with infertility I'd try and give them a heads up before a big public announcement where they have to have their face on and can't go cry in a corner for a bit to deal with the feelings before then being happy for me.",
          "id": 90,
          "comments": [
            {
              "score": 592,
              "content": "While that would be a considerate thing to do, OP and her husband are still in the wrong here. Their experience and pain doesn’t excuse the way they behaved.",
              "id": 91,
              "comments": [
                {
                  "score": 325,
                  "content": "Tbh in the husbands case I think he was fairly understandable: he realised he couldn't deal and absented himself\n\nOp went on the aggressive which is wrong\n\nThis is the kind of thing where emotions are so high that thinking clearly is really hard\n\nOP should apologise to her sister though",
                  "id": 92,
                  "comments": [
                    {
                      "score": 265,
                      "content": "Angerily pushing his chair to the side and storming out hardly sound like politely excusing himself.",
                      "id": 93,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 90,
                      "content": "I disagree. What's he going to do when the kid is born? Not visit anymore? He needs to deal with this in a healthy way.",
                      "id": 94,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 172,
              "content": "but i still think OP’s reaction was over the top and makes them the AH",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 168,
              "content": "I’m a little unclear as to whether this was a “big public” announcement or not. Were there other people there? Or was it just OP, OP’s husband, the sister and husband, and parents? To me that’s still quite small and private. \n\nIf it was a huge family gathering I might see this differently but I’m lacking info.",
              "id": 96,
              "comments": [
                {
                  "score": 106,
                  "content": "It seems like the only people there were those mentioned in the story…so the announcement was pretty private by all definitions of the word. It’s ok for OP and husband to be upset, not ok to be an AH. OP, YTA.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "It’s very clear this was the opposite of a big public announcement. It doesn’t get much more private and intimate than a small dinner between immediate family and a parents house.",
                  "id": 98,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 93,
              "content": "because like if it were me struggling and my sister said it i would be kinda sad but still happy for her and i wouldn’t try to take away from that moment",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 86,
              "content": "But was it a big public announcement? It was parents and them.  I’m not sure a heads up would have helped much either. OP needs some grief counseling.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 81,
              "content": ">a big public announcement\n\nA dinner at their parents' home with no one mentioned outside of the parents, the sister and her husband, and OP and her husband is not what I would call big or public.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "That would have been nice, but not being nice is different from being an ahole.\n\nIn my opinion there is \n\nAhole behavior at negative 1- like directly taunting op/husband for being infertile. Or announcing during a family dinner to celebrate OP/husband news of promotion, new job etc...\n\nThere is neutral behavior at zero- that is what sister did \"normal\" announcement at a regular family dinner, that has nothing else. \n\n\nThen there is nice behavior at positive one- like giving OP/husband a heads up before the dinner. \n\nFrom OP side \n\nNegative 1 is what OP did calling out the sister. \n\nZero is just walking out without saying anything. \n\nPositive one is congratulating sister and then leaving.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "The thing is, it’s not about OP. I get it, I’ve lost two much wanted pregnancies while it seems like every single one of our friends have had easy breezy pregnancies and babies during the time that we’ve been struggling. It’s hard and I feel jealous and sad sometimes. But I love my friends, they are/will be great parents and their babies are much wanted and loved too. Their pregnancies have nothing to do with our struggles. \n\nOP and her husband need to get some perspective and realise that the world won’t bend around their circumstances. Therapy might be helpful because it’s honestly awful but this reaction isn’t helpful. There’s a lot of joy to being an aunt, uncle, godparent, etc too but it seems like they’re too busy being resentful to appreciate that. That is another tragedy in itself.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Wasn't a big public announcement.  It was a small announcement with direct family.",
              "id": 104,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "I would too, but I still don't think the sister did anything wrong. OP and husband were the ones who made this into A Thing. Sister maybe could have warned sister, but I'm sure she just wanted to have a nice normal pregnancy announcement.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "It is common to tell people who you know are struggling with infertility first (some times even over text so they have some privacy) before you formally announce so they have time to process their feelings.\n\nInfertility is hard. Some compassion goes a long way.",
          "id": 106,
          "comments": [
            {
              "score": 157,
              "content": "Would also be good to have compassion for a sister that got amazing news she wanted to share with her family. Instead of trying to guilt trip her and make her feel bad about it.  Compassion goes both ways.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "But they did tell them \"before.\" They got informed at the same time as the parents, who are usually the other first people who get told.\n\nI also don't know that it's \"common.\" Some people probably do it, sure, but it probably depends a lot on who those people are. Are you going to tell distant cousin Annie before you tell your own mom and dad so she can process her feelings?",
              "id": 108,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "I have a feeling if the sister had given OP a heads up it still would have turned into a thing. OP seems like the type that would immediately run to \"her parents\" to tattle about the thing her sister did to hurt her. If I'm right in my theory OP would have ruined her sister's announcement either way so the sister took the option where she actually got to surprise THEIR parents.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "And then she'd be the asshole if her baby was ever spotted by OP because that too would be painful, and why does she need to bring the baby to the parents home, there are other houses she could go to.   Yeah, where does it stop.   OP, YTA.",
          "id": 110,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "Lol, 19 years later ...\n\nWho is this guy?\n\nHe's our son.  Just graduated from HS.\n\nHOW COME WE'VE NEVER MET HIM!?\n\nWell, you and your husband were pretty weird about the whole being infertile thing ...",
          "id": 111,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "THIS RIGHT HERE. While I really do feel for OP and her husband, its been 6 years of others walking on eggshells around them and not talking about babies, pregnancy etc etc. Its on them to work it out and get the support they need and not put unreasonable demands on loved ones. YTA.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Also, maybe, just maybe the sister thought, despite their misfortune, they'd be excited for them... they are family.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9327,
      "content": "YTA\n\nI am sorry for your infertility issues. However, you don't get to take happiness away from other people because of it. \n\nWhere were they supposed to announce the pregnancy? Or were they just supposed to keep it a secret? And what happens when the baby shows up? Will them bringing the baby around be \"rubbing it in your face\" too?",
      "id": 114,
      "comments": [
        {
          "score": 2079,
          "content": "I am going to assume OP would have appreciated a private heads up to avoid a scene like this. Soft YTA to OP. You need to apologize. And sincerely. And be happy for her.",
          "id": 115,
          "comments": [
            {
              "score": 979,
              "content": "You can be happy for her, sorry for your actions, and also sad and not ready to do things like attend her baby shower.  Those things can all coexist.  I am sorry it is not easy.",
              "id": 116,
              "comments": [
                {
                  "score": 7,
                  "content": "Yeah I had to skip a few showers when I was struggling with infertility. I wasn't any less happy for them, but there were just some things I didn't want to participate in.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 629,
              "content": "The people saying the sister should have given OP a “private announcement” are confusing the hell out of me. She announced it at a private dinner with just immediate family. How clandestine does this announcement need to be, exactly?",
              "id": 118,
              "comments": [
                {
                  "score": 205,
                  "content": "OP and hubby have been struggling for five years too. If neither of them have the coping skills to deal with this for long enough to fake being happy for immediate family for a minute or two before excusing themselves they have much, much bigger issues.\n\nThey didn't recently have a miscarriage that OP mentions and if they've been doing failed IVF or something for years their doctor sucks if they've continued the process for this long on with clearly unstable couple. Being upset you didn't get a head-ups on the announcement feels like being annoyed that someone talks about their deceased family members because your grandma died before theirs and obviously they should know it upsets you.",
                  "id": 119,
                  "comments": [
                    {
                      "score": 41,
                      "content": "As a donor-conceived child to a couple who struggled with infertility, *this so much*. I seem to see so many stories where couples discover they’re infertile, skip all the therapy, go right to the clinic and try to get a baby at all costs. I am of the firm belief that “infertility treatment” should actually be referring to therapy. Getting pregnant doesn’t do anything to treat the emotional issues surrounding their struggle. \n\nAlso, the fertility industry is made up of for-profit clinics with virtually no oversight or regulation. Over-treatment is a big issue.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 174,
                  "content": "If sister had done it by phone/text, OP and husband could have felt their own big, valid feelings alone (with each other) and hopefully have time to process enough that they could provide support and pretend happy for sister in person.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 310,
                      "content": "Or maybe she'd be spiteful and tell people. Or call parents. We have no context.  She wasn't owed a heads up",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Pregnancy announcements to family aren't something you do in a text message.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "No dude, this is on OP completely. This happened at their parents house, it doesn't get much more private than that.",
                      "id": 124,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Just with how OP and her husband reacted I can't shake the feeling that if the sister did call/text then OP would have seen it as her sister \"rubbing it in\" or something. \n\nIt's shit about OPs fertility issues but that's not the sisters problem. Why should she have to hold back on her life and happiness just because of someone else? \n\nOP, just be happy for your sister. Apologies. And look forward to meeting your niece/nephew.",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "You'd think pregnancy announcements can only happen inside of a confession booth at the nearest Catholic church, the way people are going on. It's such coddling, unnecessarily infantilizing bullshit. Adults dealt shit hands in life are not entitled to ruin everyone else's joy.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I thought it would be inappropriate to tell my pregnant friends that I'd miscarried recently. But, expecting people to tell me privately that they were having a baby so I could steel myself against a response sounds a bit like making everything about me. And I just don't want to be like that.",
                  "id": 127,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 107,
              "content": "To me it’s a hard YTA because she refuses to apologize and doesn’t think she should. She thinks her parents were unfair on top of it. That’s not a knee jerk reaction followed by remorse, which would put her in soft YTA for me. It’s a doubling down on a toxic attitude filled by her husbands insecurity.",
              "id": 128,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 100,
              "content": "Husband needs also to apologize.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "But why does her sister have to tiptoe around OP over how she loves her own life? It's sister's pregnancy and sister's parents. This was a very natural situation to make a happy announcement and she shouldn't have to subtract from her own joy because of OP’s difficulties. OP can’t give her sister a minute to be happy?",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Not the “Private heads up” lol…. why does the sister need cuddle these grown as people, it’s just so ridiculous how everyone is always expected to walk around eggshells to make sure infertile people don’t spiral out of control, like go get help, the sister didn’t need to do anything, they aren’t children!!!",
              "id": 131,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "I was once in a similar situation as OP. I know news like this can hurt, although I have to wonder how unexpected it really could have been in this case. Either way, causing drama was 100% the wrong thing to do. You and your husband both need to apologize. Life’s not fair sometimes. But still, act like adults. YTA",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4683,
      "content": "Very much YTA\n\nThis is not about you or your husband. Your sister is also her HER parents' house and wanted to share their good news. They don't owe you anything and it's unfair or you or your husband to expect to lessen themselves because of your struggles. They have every right to be excited and share that with the family.",
      "id": 133,
      "comments": [
        {
          "score": 811,
          "content": "It’s HER parents’ house also! Of course, she wants to share the news with her family\n\nYou and your husband - YTA",
          "id": 134,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 465,
          "content": "I don't even fault the husband for walking out. If he was going to burst into tears, then he needs to leave the room. I get it. And I understand OP wanting to protect her husband. But this is ridiculous.",
          "id": 135,
          "comments": [
            {
              "score": 443,
              "content": "I think the sister saying that she and her husband were fed up with walking on eggshells around OP's husband is very telling also.",
              "id": 136,
              "comments": [
                {
                  "score": 14,
                  "content": "OP thinks she called dibs on the topic since 2017. No one else can have it.",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Pregnant sister should go LC with her sister and BIL.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "THIS. I'd understand if OP and her hubby had just found out they were infertile. But its been about 6 years. Plenty of time to work through this horrible event. I'm sure they may always feel sadness, but its important to learn to put those aside and be happy for others. YTA.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Agree. Hard YTA. OP should seriously consider therapy.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4156,
      "content": "YTA\n\nYou took your brother in law and sister's joyous announcement and made it about your and your husband's problems.\n\nEveryone has been tiptoeing around your fertility issues for 5 years. And you couldn't let them have 5 minutes of excitement. \n\nBefore you say something like, \"no one understands,\" my husband and I had miscarriage after miscarriage until we decided to live our lives, happily, child free. And yes, we're happy for our friends who announce their pregnancies.",
      "id": 141,
      "comments": [
        {
          "score": 1933,
          "content": "My SIL gave birth literally days after I had a stillborn baby. It took everything I have to send her a text to tell her that I was happy for her and I was so excited to be an aunt, and I would really love if she still sent me pictures and announcements, but to please be understanding if i struggled to reply. She was so kind and completely understood. \n\nAnd we don’t even like each other all that much.\n\nBut that’s what family does for each other.",
          "id": 142,
          "comments": [
            {
              "score": 540,
              "content": "I am so sorry for your loss, but I am in awe of your kindness, your maturity and your poise. You are incredible!",
              "id": 143,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 234,
              "content": "Wow, that is some serious class.  I'm sorry for your loss.  I admire how kind you are and selfless.  The fact that you text your SIL and put such effort in will never be lost on her.  You are a better person than 99% of people out there.",
              "id": 144,
              "comments": [
                {
                  "score": 154,
                  "content": "It shouldn’t be though! All I did was be honest with her and basically laid out my needs- “I still need to be included in our family, I just need a little grace right now,” and she was so happy to give me what I needed and totally understood. \n\nOP could have done the same thing: “Sister, I’m so happy for you and I love you, but I need a little space to process this, because it hurts that you have what I want. I will be in touch.”",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "I’m so sorry for your loss. I had a very similar situation. My sister gave birth to my niece 3 weeks after I lost my son at 39wks. I still showed up at the hospital and supported her and held the baby. I was so happy for her even though I just wanted to die. OP can’t take people’s joy away just because she is miserable about her own situation. I held many babies and congratulated many new parents before I held another baby of my own. I had to swallow the lump in my throat every time but it’s just what you have to do.",
              "id": 146,
              "comments": [
                {
                  "score": 20,
                  "content": "I am so, so sorry for your loss. You’re good people.",
                  "id": 147,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Heart breaking. I hope you’re doing well now!",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "And this ladies and gentlemen is how real families should act.  Sorry for your loss.  That text you sent your sister in law made you a class act.🏆",
              "id": 149,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I’m so sorry for your loss. ❤️‍🩹",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "So devestating about your precious baby. Very generous and brave that you could still show happiness for your sister. That baby’s very lucky to have you as an auntie ❤️",
              "id": 151,
              "comments": [
                {
                  "score": 19,
                  "content": "Thank you- it was the worst experience of my life, but it wasn’t anyone else’s fault. And honestly, the last thing that a new mom needs is to be worried about is someone else’s feelings.",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Wow. I really like you. Not often you come across a truly good person.",
              "id": 153,
              "comments": [
                {
                  "score": 5,
                  "content": "My SIL gets a ton of credit. We honestly can’t stand each other on a day to day basis. I avoid her, and she judges the shit out of me. \n\nBut when the chips are down, I think we both know that we’ve got each other’s back.",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 184,
          "content": "I'm so sorry you and your husband had a difficult time. You sound like wonderful people. ❤️",
          "id": 155,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 172,
          "content": "It’s not the same at all but something similar happened when I was getting a divorce. My friends eloped and didn’t want to mention it because they didn’t want to upset me. I know marriage is a choice and infertility isn’t but my divorce shouldn’t take someone’s joy. That’s how I feel about this situation. People don’t stop getting pregnant just because someone else can’t",
          "id": 156,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "Also someone who is child free, not by choice. All I can say was that after acknowledging it wasn't going to happen for us and coming to terms with that, it took me a while to learn how to be happy for others who announced their pregnancies, but I eventually got there. I wouldn't wish what we went through on anyone.",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "You’re good people and I’m so sorry you went through so much loss.",
          "id": 158,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "I couldn't imagine stealing the joy from my family or friends pregnancy announcements while we were struggling with infertility.  My feelings were not their responsibility to manage or \"tip toe around\".\n\nYes, infertility sucks.  But you cannot let it steal all of the happiness from your life.  It really sounds like OP and her husband could use some therapy to deal with their emotions.\n\nYTA OP, apologize to your sister and hope she forgives you.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I’m like you, Eclipse. My husband and I cannot conceive and now are ineligible to adopt due to my medical conditions. I was devastated. Does it hurt? Yeah. Is other people’s happiness about us? No.",
          "id": 160,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "That has to be a tough decision to make. I feel for OP and her husband, but they needed a little grace and maturity in the moment, and neither could muster a pinch... and it sounds like the family wasn't surprised based on past behavior.\n\n I'm not sure how OP typed out this post without realizing she and her husband were TA.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "This AND they sucked the fun out the announcement for the grandparents. Sucked aaaaalll the air out of the room for anyone who wasn’t OP and her husband.",
          "id": 162,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "You are incredible.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1964,
      "content": "Hypothetically if you and your husband were to fall pregnant and announce it to your family, would you want your family to be happy and congratulate you or storm out of the room and make it about themselves? Or would your pregnancy be better than others because it’s yours? \n\nYou are fantastically self centred. Your parents were right in asking you to leave. YTA\n\nYou’re getting a niece or nephew and you are blowing up the chance for a relationship with them before they’re even born (and your sister!). I myself am struggling to conceive (not far off giving up), but my nephew is the light of my life, and I will give that child everything I have. Fix your attitude before it’s too late.",
      "id": 164,
      "comments": [
        {
          "score": 283,
          "content": "But it’s different when it’s them 😂",
          "id": 165,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 160,
          "content": "In that hypothetical instance, everyone would be expected to be absolutely filled to the brim with congratulations and overjoyed, no matter their own personal situation.",
          "id": 166,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": ">Hypothetically if you and your husband were to fall pregnant and announce it to your family, would you want your family to be happy and congratulate you or storm out of the room and make it about themselves? \n\nWell put.",
          "id": 167,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Totally agree! Being an Aunt is the coolest and best. There is so much fun that can be had with a niece or nephew.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "This OP is the definition of a hypocrite 💀",
          "id": 169,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1701,
      "content": "YTA\n\nI understand the sensitivity about the topic, but you shouldn't expect other people to hide their blessings. From the lack of context, I'm sure you're sister did not mean it out of spite, but saw the perfect moment to share the news with the most important people in her life. You and your husband took that moment away from her when you made it about yourselves, rather than congratulating her and dealing with your emotions separately.\n\nI do wish you both the best and hope you can one day start a family- be it through surrogacy or adoption.\n\n&#x200B;\n\nSincerely,\n\nSomeone with a shit ton of health problems, a low chance of ever carrying children, watching everyone else around her start a family.",
      "id": 170,
      "comments": [
        {
          "score": 161,
          "content": "I completely agree, OP Is the AH. My husband and I struggled for years before we finally got pregnant with our amazing son. But during the period of time when we were struggling and I, in particular, was very sensitive about it, my younger sister announced she was pregnant. Of course I was happy for her, she’s always wanted to be a mom. I put my sensitivity aside and was sincerely happy for her, and she was so grateful for it because she knew how sensitive I was. Of course in private I sobbed because it was yet another reminder of how I couldn’t get pregnant, but I would never take away from my sister’s happiness, and I especially would not have made a scene like OP did.",
          "id": 171,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Hugs for you and appreciation for your understanding. 💕💕💕",
          "id": 172,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1188,
      "content": "Gently, YTA and your husband is too.   \nIf this happened at your home, I would have a harder time with my judgement... but this was your parent's home. This was your parents child letting them know they were going to be grandparents. \n\nYou and your husband are the ones that acted selfishly. Your fertility struggles do not mean no one else in your family can have children you know...",
      "id": 173,
      "comments": [
        {
          "score": 241,
          "content": "Yeah I mean it would have been incredibly kind for sister to warn OP to prepare her husband for the news but I can understand thinking it would be ok to share with the immediate family at a private dinner. OP and her husband are the AHs, but I understand where OP is coming from.",
          "id": 174,
          "comments": [
            {
              "score": 78,
              "content": "I'm not sure the husband is an AH - but OP is! If he's genuinely hurt and surprised, quietly walking away to cry is reasonable.",
              "id": 175,
              "comments": [
                {
                  "score": 17,
                  "content": "I guess you’re right, emotions come out of nowhere especially with something so delicate and sensitive. I do it’s strange to think that no one else will ever get pregnant around you just because you’re having trouble so that’s why I’m thinking he’s a bit of an AH too. But barely and gently an AH, I just think they all probably need to hug it out",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "it sounds like a very small group, 2 parents, 2 sisters, 2 husbands. this IS a private heads up this is happening. if it had been thanksgiving or christmas with extended family around then sure, that kind of announcement would be more tactless, but this is a small intimate gathering. YTA OP.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I don't. \n\nThe world doesn't resolve around anyone's infertility.",
              "id": 178,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 105,
          "content": "yeah i also didn’t understand why the sister wasn’t allowed to do it at her parents, house… it’s her parents too",
          "id": 179,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Well as for the husband, if you have to leave the room to avoid saying something you regret, it's way better to leave the room.",
          "id": 180,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 685,
      "content": "YTA\n\nI'm sorry you all are dealing with infertility, but your sister is right. She doesn't have to not announce her pregnancy at BOTH OF YOUR PARENTS homes. They are her parents too. You and your husband need to be in therapy if you can't handle others being pregnant. \n\nThere are also plenty of other ways to have children in this day and age.",
      "id": 181,
      "comments": [
        {
          "score": 8,
          "content": "This is almost word for word what I was going to say. OP and husband should really be in therapy to help navigate the emotional pain of infertility issues. Sure, sis *could* have notified them ahead of time, but she 100% did nothing wrong by telling all four of them in the comfort of their parents’ home. They didn’t rub it in their faces. If OP’s husband needed a moment, it’s understandable. But it sounds like he made it really huffy and sour instead of politely excusing himself. And even if he had politely excused himself, OP would still be TA for coming down on sis the way she did. Their unfortunate circumstances are not going to be resolved by other people putting their family plans on hold indefinitely and nobody owes that to them either. The. Ra. Py. And they should prioritize that before the niblings come along because I’d love them to have a wonderful relationship. My aunts and uncles are so important to me I hope OP and husband get some help",
          "id": 182,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 486,
      "content": "YTA Where else but a family gathering, that isn't focused around something else (ie wedding), is more appropriate to announce?",
      "id": 183,
      "comments": [
        {
          "score": 17,
          "content": "This omg. Actually the perfect setting.",
          "id": 184,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}