{
  "post content": "Some info before the post: We are all 14 years old and a realm is basically a server in Minecraft. I am on mobile as well so sorry about formatting. It is currently night here so i might be sleeping if you don’t get a response.\n\nAbout half a week ago i told my friend Adam that i was thinking about starting a realm because me and two other friends were getting into Minecraft again. Adam then proceeds to tell me about an old realm of his that he could start up again. I tell him that that is kind but a bit unnecessary for i was planning on buying one.\nHe then proceeds to buy a 1 month long subscription for a Minecraft realm and invites me to play.\n\nMe, being slightly annoyed of him buying a realm minutes after me saying that i would start one still gratefully accept his invite and  hop on the realm. But here comes the problem;\n\nMy two other friends are not from the same country so we three speak English for everyone’s ease. Adam on the other hand does not like to talk English and we keep our conversations in Swedish.\nNow i started trying to make Adam invite my two other friends so we could play together (after all i wanted to play on a realm with my two other friends not just by myself or with Adam) but he kept on refusing because he didn’t want to speak english. This isn’t the problem in itself because for me it is understandable to want to speak your home language. \n\nThe problem is that I am stuck in a spot where I would feel like an a-hole if I quit his realm to start a new just to invite everyone (including Adam and my two other friends but if I stayed then i would exclude my two other friends which made me want to play Minecraft initially.\n\nSo Reddit. If I were to start a new realm so I could invite my two other friends and everyone who wanted to play, even tho there already is an existing realm that my friend Adam paid for, WIBTA?",
  "id": 1,
  "comments": [
    {
      "score": 2,
      "content": "NAH you might hurt his feelings but no-one is in the wrong here. Also, i need info. I have never heard of realms berfore and i play minecraft. We have to pay for those stuff? What do they do?",
      "id": 2,
      "comments": [
        {
          "score": 1,
          "content": "It's a small multiplayer server so you can play with friends. You pay a subscription fee for it every month",
          "id": 3,
          "comments": [
            {
              "score": 1,
              "content": "Thanks.",
              "id": 4,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited.***\n\nSome info before the post: We are all 14 years old and a realm is basically a server in Minecraft. I am on mobile as well so sorry about formatting. It is currently night here so i might be sleeping if you don’t get a response.\n\nAbout half a week ago i told my friend Adam that i was thinking about starting a realm because me and two other friends were getting into Minecraft again. Adam then proceeds to tell me about an old realm of his that he could start up again. I tell him that that is kind but a bit unnecessary for i was planning on buying one.\nHe then proceeds to buy a 1 month long subscription for a Minecraft realm and invites me to play.\n\nMe, being slightly annoyed of him buying a realm minutes after me saying that i would start one still gratefully accept his invite and  hop on the realm. But here comes the problem;\n\nMy two other friends are not from the same country so we three speak English for everyone’s ease. Adam on the other hand does not like to talk English and we keep our conversations in Swedish.\nNow i started trying to make Adam invite my two other friends so we could play together (after all i wanted to play on a realm with my two other friends not just by myself or with Adam) but he kept on refusing because he didn’t want to speak english. This isn’t the problem in itself because for me it is understandable to want to speak your home language. \n\nThe problem is that I am stuck in a spot where I would feel like an a-hole if I quit his realm to start a new just to invite everyone (including Adam and my two other friends but if I stayed then i would exclude my two other friends which made me want to play Minecraft initially.\n\nSo Reddit. If I were to start a new realm so I could invite my two other friends and everyone who wanted to play, even tho there already is an existing realm that my friend Adam paid for, WIBTA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA. \n\nYou told your friend that you were going to buy your own. Your friend then went and bought his own and invited you to play with him. Kind of annoying, but not too bad from him so far. \n\nHe then refuses to invite your friends so that you could play with them, simply because he doesn't want to talk English even though he is able to? That is where he becomes a bit of an asshole. \n\nIt sounds like your friend was either jealous of you, or trying to control you. I'd just forget about his realm and buy your own to play with your friends, and if Adam wants to play with you, he can join in with you guys and speak English to include your other friends.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA.\n\nRegardless of your friend’s motive for starting the server, if he doesn’t want to invite your other friends then he might be an asshole. I say might, because we lack some information. However, regardless of reason (unless your friends harassed him or anything), you wouldn’t be the asshole for wanting to follow through on the initial plan which you communicated - and a month long subscription isn’t all that long or expensive.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NAH. It could honestly be good, because you and your friends could have multiple worlds to play",
      "id": 9,
      "comments": [],
      "relation": "Support"
    }
  ]
}