{
  "post content": "So my wife (34f) forgets her ID and I (33m) order a drink at a restaurant we frequent often. Obviously they wouldn’t serve my wife a drink because she couldn’t present an ID. We could be considered regulars with how often we are there. Regularly spend $150-200 a night and tip 20-30%. The people working tonight are not the regular staff. My wife has maybe 3 discreet sips of my drink (not in front of the server) and I want to order another drink. The server refuses to give me another drink because he says we are sharing drinks and watching our table like we are little kids. Mind you the whole time he sets up people in the restaurant to police us and watch our table when he can’t. Barely gives any service. Except when we’re done with our food. I have no problem with them not serving my wife because yes the law says no drinks if you don’t have ID, but you deny me a grown 33 year old man with a wedding ring on a second drink. Even if the liquor board is there they check to make sure people who are drinking are ID’ed. They’re not going to make a fuss if someone has a sip who is obviously over 21. None of your business what happens at our table. You’re not top flight security. Left a $0 tip. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 20448,
      "content": "Yta. It's your wife's fault not the server. Alcohol laws are strict and businesses can lose their license over people like you. Then you leave no tip for someone making 3 dollars an hour because your wife forgot her ID.",
      "id": 2,
      "comments": [
        {
          "score": 9187,
          "content": "But he had a WeDdInG RiNg he’s a big boy!",
          "id": 3,
          "comments": [
            {
              "score": 3961,
              "content": "Don’t they know you can’t get married when you’re under 21? 🙄\n\nOP YTA. I work in a senior living community and we have to card guests occasionally. It’s just part of the rules.",
              "id": 4,
              "comments": [
                {
                  "score": 2088,
                  "content": "And it’s absolutely impossible for anyone unwed to wear a wedding ring.  No chance that anyone underage would attempt to get around being IDed by wearing a wedding ring.   That could never happen.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 646,
                      "content": "Oh yeah, I forgot they were made with that unwed-repelling magic.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 277,
                      "content": "Seriously, I'm pretty sure you can get *married* in the US before you hit legal drinking age.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 310,
                  "content": "Girl i went to high school with got married at 17. The summer before our senior year. She and her bf wanted to be married before he went to basic and her parents signed the paperwork to allow it. She did her senior year at our high school and i believed moved to his base with him the summer after we graduated. No idea what happened to her after that. And idgaf. And am sick of the speculations",
                  "id": 8,
                  "comments": [
                    {
                      "score": 139,
                      "content": "My brother did this...ish. Instead of basic....his gf (now ex wife) mother convinced them to get her prego, an then once it was confirmed positive. To go to the court house an get married cause apparently in my state. A teen can ger married at 17 with out a parents signature if the girl is prego (that needs to be changed). My mom couldn't do anything about it as he was a month away from graduation. \n\nHe moved out, had to do school online the last month (we dont know if he ever did, an shame if he didnt he was really smart.) An then ghosted us after her mom feed him more bs lies about our mom (no shes not a saint but the shit his ex wife's mom was saying was so false). All we know now is, he's divorced an lives in a state aboves us, but can't come see us cause \"my ex wife will take away custody of our kid\". 🤦🏽‍♀️ Bro thats not how that works, you went to court, you both have to follow the court order or shit will fly.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "She got drunk at a local restaurant underage because they served her becauee she was wearing a wedding ring. Long story short. Restuarant got shut down...",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Went to school with someone in a similar situation, but I think she might have been a junior when she graduated - she did the hard worked to graduate early.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Wow, and I got crap in my HS for coming in after Christmas break engaged in my Senior year (I was 18). Still married 34 years later.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Yes, and wedding rings are incredibly difficult to obtain unless one is over 21 and legally married. \n\nAlso, marriage means people need to have multiple drinks for any satisfactory meal.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "once had a woman try to get in my bar without an ID but kept trying to show me a picture of her baby as proof that she was old enough, as if teenagers don’t have babies all the time.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I have to ID people here in the UK. Our drinking age is 18. A common one I get is \"But I drove here! Here's my car keys!\".\n\nGreat, you can drive in the UK from 17. That's not proof of being 18. What would be perfect evidence is showing me the driving license you got that allows you to drive, it has your date of birth on it.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Back in the 1960s, when the drinking age was 18 in most states, Massachusetts (at least, I'm pretty sure it was MA) had a law that if you were underage, but married, you could buy alcohol. I knew a woman who got married at 17, and for months, would take her marriage certificate so she could buy beer for herself and her husband.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "If he was really a big boy, he wouldn't be trying to screw over a restaurant where he \"is a regular\", possibly get them in trouble with the licensing board and then stiff the wait staff to boot. Big boys don't act like entitled AHs.  The ring? It probably was a paper band with a picture of a clown on it that OP snuck off of a bubble gum cigar.",
              "id": 17,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Holy shit, this must be why I still get carded in my 40s. I don't have a magic ring.\n\nI even have grey hairs, and I hate that I've been carded at every single age since becoming legal. Know what I do? Make sure I always have my ID on me when I leave my home. Even if I'm popping into the booze shop beside my apartment, because every time they hire someone new, I get carded again.\n\nOP Y(ou and your wife are )TA.",
              "id": 18,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Lmao like my (19F) sister is married and pregnant. That doesn’t mean shit",
              "id": 19,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "🤣🤣🤣 dude was a dick!",
              "id": 20,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1626,
          "content": "My favorite part was “it’s none of their business what happens at our table.” It’s literally their business.",
          "id": 21,
          "comments": [
            {
              "score": 295,
              "content": "I came to say the same. In these 'unprecedented times' this guy wants a business to potentially suffer a huge fine and possibly lose their liquor licence which could then cause them to lose the entire business because his wife can't go one a meal without alcohol?! \n\nI'm 34 this year and I still get carded all the time and even though it's not every single time I don't bother trying to buy alcohol if I don't have my ID with me, it's not worth the argument/embarrassment.",
              "id": 22,
              "comments": [
                {
                  "score": 19,
                  "content": "I’m 43, still getting ID’d is a real pleasure for me 🤣",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "The last time I forgot my ID at a pub the server nervously told me she couldn’t serve me alcohol. I was mad…. At MYSELF for being a dummy and forgetting my license! My dining companion had a beer while I had an iced tea. We obviously still tipped normally bc it’s not the servers fault! Major YTA.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I'm 58 and I got carded because others in my party were drinking.  Even though I wasn't drinking, they gave me a nice plastic bracelet so they knew I was of age, just incase I touched any alcohol.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "They have to be wasted to hang out with each other. But they aren’t alcoholics! They only drink when they’re in Public!",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "The older you get the better it feels. I got carded 2 weeks after my 40th birthday. It was the happiest walk home to grab my ID I'd ever had 🤣🤣\n\n It was a new, fairly young clerk at my local liquor store, the rest of the staff just laughed when they realized what happened (most of them knew me well enough to know I knew they couldn't just vouch for me, and that I wouldn't cause drama over it)",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Agreed -- I hate that, \"We paid for this so we can do whatever we want\" attitude. It's also why Uber drivers hate everyone. So entitled. YTA, OP. And sneaking drinks hardly bolsters the argument for demonstrable maturity.",
              "id": 28,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "That and \"they were treating us like kids.\" Um...I'm sorry but if your wife can't go one meal without a drink and you \"sneak her sips\" you're both acting like kids.",
              "id": 29,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "And I guess she wasn’t very discreet with sipping his drink, as OP claims.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1096,
          "content": "Yep. YTA. \n\n\nBack when I was serving, if the liquor control board found out you served a person who who didn't have their ID, **regardless of how old they looked** you, the server, could face a $15,000 fine, PLUS the business would be fined between $25,000 and $200,000. Per incident ( depending on a few factors, like - is this the first documented occurrence or the 78th? - was the person served actually underage, Or just didn't have their ID? - were they given more drinks after being visibly intoxicated? Etc) as a server, you never know who might be working for the LCB, so it's  best to be safe, since slipping up could equal a fine that will mean you can't pay rent, or put food on the table, or your car might get repossessed. \n\nOP seems to think that this was no big deal, but for his server, it absolutely was a massive threat to his livelihood.  \n\n\n\nOP,  it was your wife's  fault for not bringing her ID with her if she wanted to drink so badly. Your server was just following the law, and you decided to punish him for it.",
          "id": 31,
          "comments": [
            {
              "score": 181,
              "content": "But it was discreet. And they're regulars!! 😂😂😂😂",
              "id": 32,
              "comments": [
                {
                  "score": 81,
                  "content": "Don't think they are gonna be very welcome \"regulars\" anymore.",
                  "id": 33,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 62,
                  "content": "Regulars that dont recognise ANY of the (must be) new hires who were all working that night.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 26,
                      "content": "What bad luck that there was like a full staff turnover just before they came so no one recognized these regulars.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "And he's a grown man with a wedding ring!",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "They will now be known as those asshole regulars who stiffed a poor server out of a tip.",
                  "id": 37,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "It’s always “the regulars” who spend *hundreds* usually",
                  "id": 38,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Regulars I tell you!",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Don’t forget the usually spend so much money and leave a big tip.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "And the wedding ring!",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Right? I had a couple sit at my bar, they were OBVIOUSLY over 21 and since we have the ‘under 30’ policy I wasn’t going to card them. She then says ‘oh, I was gonna get a cider, but I forgot my ID’ and I was like girl now I absolutely cannot serve you anything and I kiiiiinda have to ask that you sit at a table and not the bar. Luckily they were chill",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "In utah cashiers can face jail time for it.\n\nNot worth it people who yelled at me for doing my job at the walmart checkout.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Liquor laws are super anal, but for good reason. I used to work at CVS, the one I worked at sold alcohol, and you had to be at least 18 to be able to ring someone up for alcohol. I was the only kid working there at the time that was over 18, but still a teenager, so I got all the fun shifts… like working nights on the weekends, so I could ring up alcohol. \n\nAnyways, even if I was just looking up a price on the bottle, after I scanned it, the computer would ask for an ID. Before telling me the price etc.. Once a couple dudes came up to my register to ask for a price on a bottle of liquor, and I asked him for his ID, and he flipped out on me for asking for ID for a price. Which I agree was a bit ridiculous, but unfortunately I had no choice. The guy got unnecessarily irate and aggressive with me, because of that, that story has stuck with me. Because it’s like, really? You’re gonna fight with someone, for following rules that are out of their hands?",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "This is heavily dependent on the state, my state would have no punishment as long as the person they served was over 30",
              "id": 45,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "He even says he gets them not serving her, but doesn’t seem to be able to put the dots together as to why he can’t then give her booze. Maybe they need to start staying home more and drinking less",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "It sounds like she “forgets” it all the time too. Does that seem a little off to anyone else?\n\nMakes me wonder if they regularly do this and these servers are the first to stand up to an entitled regular. Or maybe she isn’t of age.\n\nOtherwise why are you regularly not bringing your ID when you clearly want to drink then getting annoyed with the poor servers?",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 955,
          "content": "God forbid you should have to eat an entire meal without an alcoholic beverage!  It's oppressive!",
          "id": 48,
          "comments": [
            {
              "score": 173,
              "content": "It's just against the American way!",
              "id": 49,
              "comments": [
                {
                  "score": 14,
                  "content": "I thought the American way was bottomless soda and coffee?",
                  "id": 50,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Seems more British than American imo, but sure.",
                  "id": 51,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 234,
          "content": "At what age is it ok to stop being carded? I mean, we aren’t carding 50 yr olds, right?",
          "id": 52,
          "comments": [
            {
              "score": 288,
              "content": "TECHNICALLY they are supposed to card every time. Again, it's not because They don't think you're 21 it's the law to card EVERYONE not who you think is 21+ and if they don't follow it the restaurant can get fined, lose their liquor license etc. Are some restaurants more lax when it comes to this rule? Yes, but that's a risk they want to take & if they want to follow it to the T they have that right and you gotta respect that.",
              "id": 53,
              "comments": [
                {
                  "score": 143,
                  "content": "Yeah I had to take (and pass) the 3 hour ABC board exam to be legally allowed to sell alcohol, and in my state at least, we are legally required to ask for ID if any person appears to be under the age of 30. Even if you know them personally, even if you've carded them before, even if they're regulars. OP and his wife would be carded pretty much everywhere here. The store I worked at had it's own policy on top of that law, anyone appearing under 40 must be carded. \n\nAnd HELL YES the ABC board will send someone to discreetly observe how businesses operate under this law, OP. That's literally what they do. That, and trying it themselves. Then the business has their license revoked, has to pay thousands of dollars in fines, as does the individual that served or allowed someone to drink another's alcohol. My store wouldve kicked you both out as per policy just to cover their asses.\n\nEvery business is allowed to make their own rules on TOP of whatever is required by law in that state, so long as it doesn't go against said law. \n\nYTA, OP. If you wanna whine about how much of an *aDuLt* you and your wife are, act like adults and remember to carry your ID. Which is also a requirement of adults, though I can't remember if that's just my state or a federal law. All persons are required to carry proof of their identity, even if (say for young teenagers that can't have a license yet) that's a SS card, or non-driver state ID. PS: Employees genuinely do not care how much \"business\" you bring to their employer. No stranger that wants alcohol is worth my paying several grand in fines and spending time in jail. No one is. Selfish and pathetic behavior.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 19,
                      "content": ">  All persons are required to carry proof of their identity\n\nThat is completely false, just like a majority of the legal information being shared in this thread.\n\n\nIt is required for someone driving a car or if you have committed a crime.",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "I work for a national grocer, they send asset protection under cover (so they’ll borrow asset protection from other stores basically, so we don’t recognize them) and will send them through lines and try to catch cashiers so we’re sure that if the government comes through we won’t get hit with a huge fine. \n\nI know somebody who got in trouble recently because an ID was expired, you legally can’t sell alcohol to somebody who’s ID is expired (I think this is dumb because it still shows how old the person is, but whatever)",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "No, you’re not at all required to carry ID in any state in the US. The only time you legally must carry ID is your driver’s license while actively operating a motor vehicle.",
                      "id": 57,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "No, you absolutely do not have to carry proof of identity in the United States. If you are driving a car, you have to have your driver's license. If you are flying, you must present a government-issued photo ID. If you are leaving or entering the country you must have a passport. If you are buying alcohol, tobacco, or legal marijuana you must present proof of age via a government-issued ID.\n\nBut no, you cannot be stopped and asked for identity papers outside of those circumstances. If a cop legally stops you, you aren't supposed to lie about your identity, but you cannot get in trouble for not having an identification document on you unless you're driving without a license.",
                      "id": 58,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Hell it's such a big thing that a lot of businesses take very seriously that they'll higher secret shoppers to make sure their employees are following it. I work as a secret shopper on occasion and twice I took a job where I had to go to a movie theater and order a drink to see if they carded me and if they did I had to pretend that I left my ID at home to see if they would still make the drink or not.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "This isn’t the same in every state. CT doesn’t have a law that the person has to be 21. “Connecticut has no law against drinking alcohol by anyone of any age under 21. A parent or guardian must provide the alcohol to them. However, they may not buy alcohol.”(alcoholproblemsandsolutions .com)",
                  "id": 60,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Also,  in some states,  if you don't card someone,  anyone ordering alcohol, you can lose your job,  get fined and you can't work anywhere that sells alcohol for a year.  And here in NC,  even gas stations still alcohol.  They also do stings. It happened to me once when a woman who was obviously over 21 ordered a beer.  I carded her.  Just as I was about to walk away from the table to put her drink order in,  she asked to see my manager.  She gave him a green card.  Had I not carded her,  she would've given him a red card and I would've been fired and fined.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 215,
              "content": "I stopped getting ID’d at 40. That made me sad.",
              "id": 62,
              "comments": [
                {
                  "score": 209,
                  "content": "Last time I got carded I was 45. By a child half my age. That made me pretty happy.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 121,
                      "content": "Right? They apologised for IDing me and I just thanked them and told them not to apologise.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 64,
                      "content": "It definitely is flattering, I don’t really\nmind that I’m still getting carded in my forties, I just have a really “open” face which I think makes me look young at first glance. Close up it’s a whole mess tho 😂",
                      "id": 65,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "I'm 40 and was carded recently. I told the bouncer that I appreciated the compliment, and then he replied 'oh I think you went to school with my dad' and I was crushed.\n(I have an uncommon name in a small town)",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "They stopped carding me at 24. Just an occasional “I need a birthday to enter into the register” but just have me tell them, no card. It hurts 😭",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 142,
              "content": "I am in my 40s and get carded all the time. Recently I was denied alcohol for not having my ID. I was with my husband and two children, one of whom is a pre teen. I just laughed it off because life is too short and it IS flattering in a way, but it was also fucking stupid. I have a literal grey streak. And crows feet. And a 5ft tall child. 😂",
              "id": 68,
              "comments": [
                {
                  "score": 11,
                  "content": "From the businesses perspective it isn't stupid. It is definitely not in their interest to risk a giant fine or losing the ability to sell alcohol just so they don't inconvenience you. There is no perfect answer, either way someone will be inconvenienced or kids will be able to buy booze. Personally, I think the drinking age should be 16/18, but we'll never do that. If you are old enough to drive a 2 ton death machine or sign yourself up for war, you should be old enough to have a drink if you want.\n\nAll in all, it's just one of those situations where the law isn't perfect, but we don't really have a better solution yet.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "They don’t think you’re a teenager, they just don’t want to break the law.",
                  "id": 70,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 76,
              "content": "Legally, speaking in most states it's 99 years old, though most states until recently allowed the if over 40 rules to stand, but with technology, most states are now enforcing the 99 rule, requiring a scannable ID for all sales, some restaurants are now going by new federal recommended requiring scanning for each drink. \n\nAlso in most states in $500 dollars per drink fines , AND if they are underage you get criminal charges. Don't blame the guy. Especially if the \"normal\" staff are \"gone\" because they got in trouble for not IDing",
              "id": 71,
              "comments": [
                {
                  "score": 9,
                  "content": "The gas station by my house always scans the ID on the register, but they also sometimes scan the back with an iPad to check that it’s a real ID because it’s only a block off of campus, and they get so many fakes.",
                  "id": 72,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "It depends on the establishment. Some card 100% of people to protect themselves. No card, no alcohol, period.",
              "id": 73,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "My mums 56 and got carded a couple years ago. Some places you need to scan the license in order to sell alcohol. Or else the register locks and refuses the transaction.",
              "id": 74,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "I'm 65. Almost 66. They card me all of the time. Wondering if they will still be at it when I hit 70?  \nEdit: Pretty sure it's the law because although I do look considerably younger than my age, I don't look THAT young.",
              "id": 75,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "When I worked at Walmart the rule was anybody who looked like they might conceivably be \"under 40\" had to be carded for alcohol and tobacco. I carded a few people over 50 before as well. One I remember in particular were two women I thought were sisters and reckoned they were probably in their mid to late 20s. Of course, that's \"under 40\" so I carded them. Turned out they were mother and daughter, with mom being 60 and daughter in her mid 30s. They were pretty happy about it. The mom ended up being a regular, she was pretty nice.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "It really depends. In places I worked, we carded everyone, absolutely no exceptions. The managers were very serious about not losing that liquor license and we were very serious about not getting fined and fired. On the other hand, I've been to places that decided I looked old enough and didn't even ask and I'm 35. I'm clearly not under 21 anymore so I get it, no big deal to me where looks are concerned, but I'm just surprised that the seriousness with which some places take it and some places don't is so variable.",
              "id": 77,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Some places have a policy to card everyone. It makes it awkward when someone is obviously 70+ but I've also met a lot of 17 year olds who look over 30.",
              "id": 78,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 205,
          "content": "Literally. The server & restaurant can get fined thousands each and the restaurant can lose their license for a week. Location based obviously depending on the laws but where I am, this is the case. \n\nI went to a bowling place to play pool with some friends. They didn't want to drink so they didn't come with me when I went to the counter to get a drink. The guy told me if I shared the drink with them, he'd have to kick me out. I understood and guess what? I was polite, kind and did not share the drink. The guy was literally just doing his job, same as the server in OP's post. Definitely YTA especially for not leaving a tip",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 155,
          "content": "Also, the server can face criminal charges",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 130,
          "content": "What's worse is you're mad because the server is enforcing the law when not only can the business lose their alcohol license but the server depending on the location could face fines themselves of up to $10,000. It doesn't matter that you're regular you literally said that it wasn't the regular staff working that night which means this might be a new person who literally just had the training to refuse you drinks. YTA",
          "id": 81,
          "comments": [
            {
              "score": 10,
              "content": "BuT i'M a ReGuLaR!! You have to break the law for me!! 😂",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I don’t care how much of a regular someone is. I’m not risking a fine so they can drink",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 61,
          "content": "And talking about how they could be considered regulars like the wait staff (even if they were the regular staff, which they aren't) should have to remember everybody who eats there often and whether they are of age. Just bring ID with you and this won't be a problem. YTA",
          "id": 84,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "I got refused to be seated in bar section. I’m 40. Ran home grabbed my ID.",
          "id": 85,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5427,
      "content": "YTA. If you forget your ID, you cannot drink. Your wife forgot her ID. You should have either gone back for it or not ordered drinks. The restaurant could lose its liquor license for serving you without an ID.\n\nI wouldn't go back to that restaurant, btw. You made a fuss over your mistake and then didn't tip, and if you go back to that restaurant your food will be 80% spit by volume.",
      "id": 86,
      "comments": [
        {
          "score": 2295,
          "content": "Wow, I get that the OP is an asshole but why are people in this comment section talking pridefully about committing an actual crime (and one that's particularly egregious in an era of an ongoing pandemic) in response to no tip?",
          "id": 87,
          "comments": [
            {
              "score": 1927,
              "content": "As a server I've always found jokes about spitting in food low and disgusting. Have never seen it happen, would quit if someone did that and wasn't fired.",
              "id": 88,
              "comments": [
                {
                  "score": 1404,
                  "content": "As a trained chef, I'd sooner spit in a customer's face than the food. The food didn't disrespect me, they did. \n\nNot that I'd advocate spitting in a customer's face, mind you.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 781,
                      "content": "My petty way of getting back at rude customers (fast food) is just to serve them a teeny bit less or the less desirable food. They probably don’t even notice or realize that I gave them the ugliest tomato or the fries from the bottom of the batch that have been there just a few minutes longer, or that they have just a *teeny* bit less, but I do. I notice and I feel a little better and no health and safety laws are violated.\n\n*villain voice* “Don’t anger me, lest you get a slightly crushed piece of bread, MWAHAHAHAHA!”",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "The worst thing I ever did as a chef was make someone's spicy dish extra spicy. \n\nThey liked it so much the server mentioned it to me, so yeah, my petty revenge backfired.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "cause jar deserve crush shrill label quaint books violet consider\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                  "id": 92,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Same here and I worked at Ruby Tuesday and Olive Garden lmao. If they're not spitting in your food then I don't know who is.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Right? I've spent almost a decade in food service and I've never seen it happen. If I had, I would have immediately reported that employee to management, because that shit is not okay, and the *VAST* majority of food service workers would absolutely never.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Agreed.  We don't do that.  Ignoring them would be more likely but then again probably not even.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Agreed. When I was a server, I’d just have the bartender short pour and when I was behind the bar I’d do it myself. A quick little up/down pop to create an pocket so the pour time still looks the same.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 212,
              "content": "I think it's likely that these people don't actually believe in the pandemic, OP is TA but so is anyone that spits in someone's food.",
              "id": 97,
              "comments": [
                {
                  "score": 187,
                  "content": "Nah. It's just that a lot of people think that another person being an asshole gives them free pass to be criminals. The kind of people who steal from ah drunk clients or destroy property from jerk people.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 89,
              "content": "People like the feeling of admitting they’re immoral assholes with total anonymity.",
              "id": 99,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "As a former waitress: yes, some clients are assholes, but I'm not. Seriously, what's wrong with some people",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Because these people have never worked in restaurants and get all their information from TV shows and movies",
              "id": 101,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "I have worked at restaurants before and it absolutely disgusts me when people act like entitled or rude customers deserve to have their food spit in. I don't care how much you might hate a customer, that is never okay.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 454,
          "content": "Someone help me out here since I am not American. Do 30 year old people also need to carry their ID to restraunts now a days. Cause that's so dumb IMO. You can see they are adults",
          "id": 103,
          "comments": [
            {
              "score": 357,
              "content": "I’m not American either, but frankly think it’s just weird to leave the house often with zero form of ID on you, especially if you know you’re heading out somewhere where you’re likely to consume alcohol. Carding is rare over a certain age but it still happens, so either prepare accordingly or accept that for one mere day you may be declined a drink.",
              "id": 104,
              "comments": [
                {
                  "score": 228,
                  "content": "Non American here. UK. Last ID checked when I was 14 (51 now).  Admittedly times have changed, and I looked old for my age.\n\nI almost never carry ID, and never really have. The idea that a free citizen needs to prove their identity because of some arbitrary rule (and carding anyone obviously way over the legal age of alcohol consumption is arbitrary) seems oppressive and weird to me.  But I guess I don't live in the land of the free.\n\nEdit.  But as I understand the weird rules of freedom, not tipping makes you an arsehole, because serving doesn't pay a living wage, and you're effectively employing the server directly. YTA, not the server's or restaurant's fault the rules are arbitrary and weird.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 64,
                      "content": "Plenty of ID checks done in the UK.",
                      "id": 106,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "[deleted]",
                      "id": 107,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "Yeah Londoner here in my forties. I never carry ID (I don’t drive and no way am I carrying my passport around with me). This whole situation sounds frankly bonkers but they do do things differently over there and this sounds like a situation where the OP is YTA.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I have never been carded for alcohol in the UK but once was for an 18 film. Showed them my credit card. Since you have to be 18 to get one, that sufficed. Today my grey hairs probably suffice.",
                      "id": 109,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "First, America is a driving culture and our main ID card is also our driver's license, so most of us carry that at all times since we're legally required to present it if pulled over.\n\nSecond, what do you carry your cash or bank/credit cards in?  is it just loose in your pocket?  Mine is in my wallet, which conveniently has extra card slots, one of which holds my ID.  I take my wallet everywhere anyway, since part of life is paying for things.  There is zero inconvenience to me, my wallet feeling 1mm thicker is essentially imperceptible.",
                      "id": 110,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 74,
                  "content": "I just make it a habit to carry ID because even if I don't get carded, it just makes me feel safer. I also carry my blood donor card so I have something with my blood type on it and an allergy list. \n\nIDC if I get carded or not. I just think it's a good habit to have identification in case of Emergency.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Prob don't need the blood card. I imagine in an emergency where they can't cross match your blood from a new sample taken they would just use O negative.",
                      "id": 112,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I had a (supposed) 22 y/o try to order a drink and didn’t have his ID when I asked, his mom was like “oh I’ll vouch for him” I was like yeah no you’re not going to pay my fine if the liquor inspector comes in.  Besides what 22 y/o leaves the house without ID and expects to get served?",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 184,
              "content": "Not American, it seems bizarre to me too. In my area the staff are only required ~~by law~~ by suggested industry guidelines to card if someone looks under 25 (our drinking age is 18), and restaurants basically never card anyway (only bars/hotels and bottleshops do). Someone above said they card people at a nursing home... what the fuck.\n\nThink the problem partly comes from their unreasonably high and generally flouted drinking age. It's not too hard to tell if someone might be under 18 or not, much harder to tell for 21.\n\n(And don't get me started on the fact that American servers are surviving on tips therefore tips become obligatory, rather than paying people a living wage and tipping for exceptional service...)",
              "id": 114,
              "comments": [
                {
                  "score": 154,
                  "content": "To me this sounds really weird too. In Germany buying \"soft\" alcohol (beer, wine) is allowed from 16, children who are with their parents are allowed to drink from age 14 in restaurants. \nAsking 34 year olds is extremely weird to me. \nBut that's America. Alcohol under 21, oh my god no! \nGuns, yea, no problem, we like gun violence and school shootings.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 15,
                      "content": ">children who are with their parents are allowed to drink from age 14 in restaurants.\n\nI don't know if this is actually legal here in Australia but it's the common practice in higher end restaurants to give wine glasses to whichever teenage+ looking children the parents want to give wine glasses to. I mean, if you were clearly getting a child inebriated they'd refuse, but French style small servings for teenagers are fine.\n\nEdit - it is in fact legal,\n> Minors must not consume liquor on the premises of an unlicensed restaurant unless the minor consumes the liquor in the company of, and with the permission of, his or her parent or guardian,\n\nand\n> A person must not supply liquor to a minor on any premises other than licensed premises unless—\n(a)  the person is a parent or guardian of the minor or is authorised to supply liquor to the minor by a parent or guardian of the minor, and\n(b)  the supply is consistent with the responsible supervision of the minor.\n\nAlthough that's the 2007 liquor act so part of my childhood fell under the earlier, somewhat stricter one.",
                      "id": 116,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "Exactly! Not only guns but the ability to carry them without a gun license in more and more states.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "If you're in the UK, Challenge/Think 25 isn't law, just very firm shared retail policy. The 2003 Act requires \"an age verification policy\" but the decision to move from 21 to 25 is an industry one. The main difference this makes is that they could all move to Think 30 or Think 40 without any legal changes or much notice, whereas changing a law takes ages.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I'm in Australia, the signs about it (challenging <25) look very legal, but not sure of the exact situation here.",
                      "id": 119,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "American Alcohol cops will send in really old looking 20 year olds to try and catch businesses in the act (gas stations, restaurants, grocery stores, bars, etc.). Then they fine the businesses a hefty fee. It never happened to me when I worked in a restaurant but I’ve seen it happen to friends and coworkers multiple times. It’s real crummy.",
                  "id": 120,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I wonder if it's because it's a great revenue raiser. Or because you have cop departments that are controlled by small towns or counties, and they are more likely to be tasked with things that are rather inefficient in terms of reducing harm, but pleasing to moralising elements in the local governments.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 29,
              "content": "American here, and yeah... It's dumb, but so many people here are happy to sue over dumb things (and the prevalence of fake IDs is astronomical). \n\nI used to work at a coffee bar that was open late and served booze. Company policy was to card absolutely everyone, \"even if they look older than God\", which is what we were told in training. \n\nThe \"well, they *look* over 21\" can be a slippery slope, especially in a big tourist city, with over a dozen colleges and hundreds of people trying to cheat the system every day. I definitely would get some over-60s upset when I carded them, but our managers were all insistent that EVERY person, regardless of age, got carded. And they checked up on us every time. And if they didn't have ID, they were not to be served, period.  \n\nIt does have an element of babysitting, and ridiculousness... But over here, it's the only option we really have.",
              "id": 122,
              "comments": [
                {
                  "score": 31,
                  "content": "As an outsider I find it so weird, some of the dichotomy of American culture, you are allowed to walk around the streets with guns yet at the same time can't be trusted to not ID a pensioner on the off chance they've taken a magic potion of ageing and are actually 15...",
                  "id": 123,
                  "comments": [
                    {
                      "score": 9,
                      "content": "It was designed to prevent underage drinking but I completely agree.  The idiotic laws don't stop there either.  But if you are ever in America and this happens, please don't blame the restaurant or servers because like some others have said, they can literally lose their license to serve by not following these laws.  Even if the person is of age and you don't check ID.  The system is stupid but not the restaurant/staffs fault for covering themselves.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "It seems Americans have stricter laws surrounding alcohol than they do gun laws. Wild.",
              "id": 125,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Alcohol laws vary by state. The federal age is 21, but things vary from there. I moved to Alaska and frequented a liquor store by my house over the years. The staff clearly knew me, but always checked my ID. They also checked the IDs of elderly people. I found it pretty annoying, since I had never experienced this in Colorado when a clerk knew me.\n\nI finally asked one guy, \"Why do you guys ID me every time? You know who I am.\"\n\nI then learned that if you get a DUI in Alaska, you get a marked license that means you cannot be served alcohol. So regardless of age, it could be illegal for you to purchase alcohol due to state laws.\n\nColorado, on the other hand, you can be served alcohol if the server/clerk *thinks* you look over a certain age (40 or something like that). \n\nSome states have much more strict fines, as well.",
              "id": 126,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Most states will card if you appear to be under 40. Yes, it’s kind of silly, but it seems to help in restaurants and bars. Convenience stores, not so much.",
              "id": 127,
              "comments": [
                {
                  "score": 6,
                  "content": " Is not that much silly. I know teenagers who look around their twenties, specially bearded boys.",
                  "id": 128,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "America is still basically a puritanical society.",
              "id": 129,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Basically (when I worked at a liquor store) it was explained to me that the penalties for selling alcohol to anyone under 21 are so stiff (for the business and employee) that we might as well just card everyone.",
              "id": 130,
              "comments": [
                {
                  "score": 10,
                  "content": "It’s the law in Michigan. My daughter works at a gas station. People get pissed when she has to card them. She just smiles and says “if my own father came in here right now to buy beer, I’d have to card him and I know how old he is.”",
                  "id": 131,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I don't understand people that act like this.  I forgot my ID when I ran to the grocery store and I figured it out right before the cashier scanned my alcoholic purchases.  I told them I forgot it and I am the one that felt bad because now they had product up there that I wasn't buying.  I wasn't going to get mad at them for not selling me the drinks, even though I'm over 21 and look like it.  That's not their fault.  Your daughter sounds like she has a great response to idiotic people.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I live in the US. My eldest son told me that he had managed to buy alcohol, while underage, because he looked older. Had that place been caught, they would have lost their license to sell alcohol. This server didn't know them, and it could have been an undercover sting. \nAlso, we have to use id for a variety of reasons.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Bars can get sued here for selling to minors or not cutting off patrons who are too drunk to drive safely. Checking all IDs is just an easy way to prove they've done due diligence. I'd say it's pretty normal for Americans to carry ID when out despite whether they're drinking because most of us drive when we go out.",
              "id": 134,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Anyone who spits in food is an AH.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Oh if that's the case go back, get the spit food, and sue for food tampering.\n\nAs someone that works with food I'm so over this mindset. It's disgusting to do that and if you do that as a server or cook you deserve not to be tipped. If you want to fuck with them give them a bad serving of whatever it is, pack the drink with ice, burn their steak, give them a smaller portion of the side they ordered instead of a full serving. Don't be disgusting and spit in someone's food.",
          "id": 136,
          "comments": [
            {
              "score": 4,
              "content": "I agree, and would take it further.  If you would spit in somebody's food, you don't deserve a job.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "You obviously have never worked in a restaurant before, nobody spits in the food for revenge. Do you literally think the cooks and other servers will be willing to do something so disgusting that could easily cost them their job for petty revenge against a customer?\n\nNo, their server will just tell everyone how rude and entitled this couple were and that they committed the worst sin out their in the eyes of the staff, stiffing their server \n\nThey won’t get spit in their food, but they will also never get good service or a decent table at that restaurant ever again. I hope they really enjoy getting cold shoulders and passive aggressive glances",
          "id": 138,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4075,
      "content": "YTA. For all they know, you’re undercover cops testing them",
      "id": 139,
      "comments": [
        {
          "score": 1427,
          "content": "[removed]",
          "id": 140,
          "comments": [
            {
              "score": 738,
              "content": "Definitely happened at the grocery store in my hometown. They set up a sting with fake IDs and everything and the store got in trouble for not recognizing the fake ID\n\nETA: the store sued the police department and everything settled in the end",
              "id": 141,
              "comments": [
                {
                  "score": 261,
                  "content": "Gas station near me got shut down from the fines they had from selling cigarettes to people without checking Id like this shit isn’t a joke they will rail your ass",
                  "id": 142,
                  "comments": [
                    {
                      "score": 76,
                      "content": "I think that oftentimes people in the EU and UK, which were largely freed from puritan culture and influence centuries ago, seem to have a hard time grasping just how alive-and-well puritanical attitudes are in the US. As a United Statesian, I’m a little envious of that lack of understanding, ngl.",
                      "id": 143,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Same happened in my home town. They had kids flocking with mopeds from all nearby villages though, as they sold anything to anyone (including illegal snus, and sometimes even weed I heard!)",
                      "id": 144,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "I used to frequent a bar in my city that had been busted by the local liquor cops a few years before I started going. Had friends who worked in the neighborhood, we were all on a first name basis with the bartenders and whatnot... still brought my ID every time and expected to get carded every time.\n\nThey almost got shut down the first time and most of the staff who had been there got fired, so I don't blame the people who got hired after for being cautious.",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Once I was 19 and a lady almost refused to sell me cigarettes at a small gas station because I looked twelve. She was sure I was with the TABC as part of a sting. Yes, they do send minors into stores to try and buy alcohol/cigarettes. The only rule there was you can’t use a fake ID (I almost joined the program when I was younger and dumb) She finally did sell them to me but after looking at my ID for 5 minutes absolutely checking to make sure it was legit.",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Worked at a hotel that got their liquor license revoked because the bartender served a cop in uniform without checking his id the cop was only 19. \nYta op your wife forgot her ID she should have either went to get it or found a nonalcoholic option she wanted because the restaurant has the choice to serve you you don’t have a right to eat out they have the right to refuse service tho.",
                  "id": 147,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "One of my neighborhood grocers almost lost her job for not carding a gray-haired man simply because the customer behind him in line was an off-duty cop who had had either a bad day or a power-trip. Fortunately her store has a workers’ union who stood up for her, which is quite rate for retail & restaurant workers in US. These puritan assholes don’t fuck around with their “sin laws” out here. And yup, that’s what they call it…sin laws (and “sin taxes” for the extra tax on booze, tobacco, etc). Wish I was making any of this up.",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Worked at a store where this happened.  Liquor department was shut down for two weeks and we had to card everyone, no exceptions.",
                  "id": 149,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 219,
              "content": "Yup, happened in my hometown a few weeks back. The server is facing jail time and a hefty fine for serving someone under age. It was a police sting. The bar has to reapply for their license and prove they improved their ID training.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 155,
              "content": "And gas stations! I got a $500 bonus once because I was the only cashier in the county that didn’t fail Excise mystery shops at our chain. I just carded everyone as I wasn’t trying to catch a $10k fine and I worked near the IU frat houses.",
              "id": 151,
              "comments": [
                {
                  "score": 20,
                  "content": "I worked in a gas station and was obsessive about checking IDs, like the people buying booze at night through a bullet proof window at a out of the way gas station are never up to anything good, might as well have their ID on camera!",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 103,
              "content": "Not just undercover cops, I have done multiple jobs as a mystery shopper to make sure I'm carded for things at various places. It can get a server fired",
              "id": 153,
              "comments": [
                {
                  "score": 6,
                  "content": "For the love of God, how do you become a mystery shopper? I’ve been trying forever",
                  "id": 154,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Install the iSecretShop app, go to mystery shop forum and they have a list of companies, and the Presto app",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "A fellow server was fired on the spot for not carding a secret shopper in their 30s. We were supposed to card everyone under 40 and the server said they thought the person was 40.",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Ran a restaurant, it does happen every year. To be fair, it's quite obvious when it happens.",
              "id": 157,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "friend of my ex owned a bar... not only does it happen, but it happens rather frequently. And they will go to all the crazy lengths customers do to get you to serve them. One time a lady tried arguing, bribing and haggling with the bartender to be served. She was pretty memorable. I forget how. but they found out a few days later she was with the liquor board testing them.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "It even happened at my grandfather's grocery store in the 90s. One of the cashiers got caught selling alcohol to minors. His store was fined and they couldn't sell alcohol (I don't remember for how long), but he lost a lot of money. He was pissed but didn't fire the cashier.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 164,
          "content": "Not a restaurant but a relative of mine got fired from a drug store and had to do community service because they didn't ID the person who bought beer properly and it was an undercover person. They go anywhere alcohol is sold pretty much. YTA OP, you are not worth losing a job over.",
          "id": 160,
          "comments": [
            {
              "score": 9,
              "content": "When I worked at a grocery store, a “husband and wife “ came through the line with two separate orders, she had alcohol and he didn’t. She forgot her ID but he had his, I refused the sale. They huffed and puffed and left the store. Five minutes later he’s back in line with the beer..  I refused again! Thankfully there was a cop in the store that I grabbed before denying him the second time. He went bat shit crazy…. ” Im 26 years old I have a right to buy it!  I’m a doctor!! ” blah blah  stupid shit like that. I’m glad the cop backed me up.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 81,
          "content": "Yeah. YTA. A place can easily get fined and it’s not just the business that gets fines but also the server. So because you screwed up, you are taking it out on the server who could easily get fired and fined (its like a $500 for the server). There’s tons of laws even when it comes to who can sit at a table with alcohol or not. Like a 21 year old who is married to a 19 year old can not be drinking alcohol unless there is someone over 25 there. And it’s super specific. But nope, big boy couldn’t go home and fix YOUR own screw up. Dropping $200 almost every night on booze and yet you forget your ID.. 👌",
          "id": 162,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "An old coworker got fired because a mystery shopper sent in her 16 year old daughter to buy a bottle of wine and she came back out with it…",
          "id": 163,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "In Singapore they have special ops teams tasked with driving like maniacs/ordering drinks underage/buying cigarettes underage just to see whether the establishment sells it. In regards to driving like maniacs, they intentionally get pulled over and offer large bribes to catch out dirty cops",
          "id": 164,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Yeah exactly. I worked at a restaurant before with a bar and lounge area. The lounge was considered part of the bar so nobody could enter the area unless 21+ due to state laws. I was tasked with IDing people who wanted to sit there so the server wouldn't have to do it. The cop that taught me how to ID people was very strict about IDing EVERYONE who wanted to sit there, no matter how old they looked. The consequences to me if I didn't ID someone and the cops found out made me very strict about requiring legal ID from anyone who wanted to go in the lounge. I'm sorry but I'm not willing to risk a huge fine, getting fired, and possible legal issues because someone forgot their ID. Back then cops in my area did a lot of checks as well as stings to make sure places with alcohol were following the laws. OP is definitely TA.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Exactly. In NYC they would send people into bars, often close to the 40s cut off for checking, to see if you asked for thr ID. You got a bonus if you did. You got fired if you didn't.",
          "id": 166,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Happened all the time at a grocery store in used to work at. Police would come in and act extremely belligerent towards teenaged cashiers, even going so far as to threaten physical violence towards then. Then when they sold them the alcohol out-of fear the cop would pull his badge out.\n\nThis guy's the asshole.",
          "id": 167,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3002,
      "content": "YTA. It actually *is* their business what happens at your table with the alcohol they served you. The only person to blame for your wife forgetting her ID is her. You decided not to tip because they were following the law. Grow up. Learn to face the consequences of your own actions.",
      "id": 168,
      "comments": [
        {
          "score": 456,
          "content": "Also the ‘consequences of their actions’ could just be…having a nice dinner and a coke? Is it really that big a deal to have drinks with your dinner? I drink alcohol and sometimes it’s what I really want, or I’m going somewhere I specifically like the cocktails or whatever. But a lot of other times if I’d forgotten my ID I’d just get some food anyway. Not being able to have a beer with dinner won’t kill your wife.",
          "id": 169,
          "comments": [
            {
              "score": 142,
              "content": "This is what I thought.   A good wine can really enhance a meal, but if someone can't make it through dinner without needing a few sips, then she might have a problem and he is enabling it.",
              "id": 170,
              "comments": [
                {
                  "score": 20,
                  "content": "I wouldn’t necessarily conclude she has a proper drinking problem but there does seem to be either a cultural or personal habit at play here. When you always drink when you get dinner out maybe it’s easy to forget that you don’t have to!",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I mean, regulars and 150-200 a night tells me they're not there not to party...",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I generally choose to have either a drink or an appetizer and 9 out of 10 times, I’m happier with the nacho plate than a drink or two.",
              "id": 173,
              "comments": [
                {
                  "score": 10,
                  "content": "nachos > most other things",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Oh my, now I’m in the mood for nachos! 🤤",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Alternatively, virgin cocktails can be really tasty. Poor choices all around",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Right? I usually have a drink with dinner when I go out. But if I forget my ID and they want to check it, my response is gonna be \"oh man, I forgot it, guess I'll have and iced tea then.\" This is some seriously entitled stuff",
              "id": 177,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1466,
      "content": "YTA. The server and bartender could have lost their jobs and the restaurant could have lost their liquor license if they had served you. Those laws are pretty strict, and the people who check are undercover most of the time. It’s not the server’s fault that your wife forgot her ID, but you decided to punish them anyway for it. Of course they were all watching you, you were blatantly ignoring the rules. Chances are good that if they were all watching you that closely, someone got fired there recently for serving someone without ID or they were due for an undercover visit soon. Totally not worth the restaurant losing their liquor license just because one person or couple feels entitled to drink at a time when it’s against the rules for them to do so. You being a regular doesn’t matter, the restaurant can vouch for you all they want, but if you can’t prove you are of age with ID, they are the ones who bear legal responsibility.",
      "id": 178,
      "comments": [
        {
          "score": 455,
          "content": "If this were a restaurant I worked in, and I caught them letting their wife (who I had refused to serve because they had no ID) sip their drink, I would have immediately kicked them out. Not only could I lose my job and be fined, I could lose my certification to serve alcohol altogether. I would never be able to work in the industry again. Complete waste of all the time and money I spent on my sommelier training and other specialty alcohol courses I'd taken.\n\nWhat an entitled AH that he thinks his wife's ability to sip alcohol on one night trumps other people's careers.",
          "id": 179,
          "comments": [
            {
              "score": 33,
              "content": "Thiiis. If someone did this to me, I'd 100% ask both to leave immediately the first time I heard they'd 'sipped' someone else's drink. Idk if they're in the middle of their meal - yeet. It's not worth losing my qualifications for people like OP and his wife.",
              "id": 180,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "100%. This is the time of behavior that should get a guest on the blacklist.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "All this. Yet they put waitperson and restaurant at risk by sharing a drink, then had the nerve to take it our on waiter. YTA.",
          "id": 182,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 611,
      "content": "[deleted]",
      "id": 183,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 537,
      "content": "INFO: What does wearing a ring have to do with anything? 18 year olds are getting married these days, and people that aren't married also wear rings on their ring finger.\n\nIf its law you need ID to indulge in alcohol, then the server is right. You are not.\n\nYTA for not tipping because you had a tantrum over being denied a second drink.",
      "id": 184,
      "comments": [
        {
          "score": 169,
          "content": "Why \"these days\"? If anything, people are waiting *longer* these days to get married. I'm pretty sure there have been people getting married by 18 since marriage was invented.",
          "id": 185,
          "comments": [
            {
              "score": 77,
              "content": "Every time I see \"These days\" used its always regarding something that has always happened or was much much worse in the past. It always comes off as \"blame the youth because now that I'm older and pay attention to the news the world seems more fucked up\"",
              "id": 186,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "You're right. Folks are waiting longer than literally ever to get married and have kids, statistically. I think this is the first year like, ever the UK has more woman childless at 30 than with children.",
              "id": 187,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 80,
          "content": "I got married before I could drink too. That comment made me pissy too lol",
          "id": 188,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "In some states you can get married at 14 with parental consent. Which is fucked up… but still. You don’t have to be anywhere near 21 to get married",
          "id": 189,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 13,
          "content": "Also anyone can put a ring on that finger. It proves nothing.",
          "id": 190,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "No they don’t!!!……..quietly slips ring off my very unmarried finger………",
          "id": 191,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "I think the big cultural split on this is that in almost every other country, if you're old enough to get married, you're old enough to be served alcohol. Not saying OP is in the right seeing as this took place in the US, just in most countries that would be the logical take",
          "id": 192,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 522,
      "content": "NTA.\n\neveryone saying YTA is acting like he left no tip because they didn't serve his wife that wasn't why he left no tip. did nobody read the part where even after he refused to serve him another drink he stationed others around the room to watch them. why? what did he think they were going to do? and then they barely got the basic service that is expected at any restaurant. I wouldn't have tipped them either",
      "id": 193,
      "comments": [
        {
          "score": 234,
          "content": "I say NTA too. They were treated horribly by the staff.",
          "id": 194,
          "comments": [
            {
              "score": 54,
              "content": "Had to scroll so far to find people who are looking at this objectively and wholly.\n\nI said NTA too.\n\nthey treated the guest with no respect thereafter the alcohol incident for the rest of the time. even if they did break the rules and were so concerned, they'd get no tip for bad service alone.",
              "id": 195,
              "comments": [
                {
                  "score": 12,
                  "content": "Objectively, the server faces massive liability and possibly the loss of their job and thousands of dollars in fines if they allow alcohol to be served to a suspected underage person who has no ID. \n\nIs that a reasonable law? Probably not. Is it an example of hilarious hypocritical puritanism in the US, especially when contrasted against the age you're allowed to sign up for military service or buy lethal weapons? Yes. Is that under the server's control? No.\n\nGiven the state of US alcohol laws and the prevalence of undercover sting operations to check if restaurants and bars are in compliance, this is absolutely, 100%, totally not on the server here, and frankly I'm surprised they weren't kicked out after she was seen sipping his drink.",
                  "id": 196,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 199,
          "content": "I can’t believe I had to scroll this far to read this comment!! Not serving any more alcohol, totally acceptable. Treating them like kids / criminals, absolutely uncalled for. I’d have withheld their tip too.",
          "id": 197,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 150,
          "content": "Reading these comments has made me realise that US drinking laws are a joke, like yta given the context of how hard this stuff is cracked down on, but its ridiculous that that's a law in the first place\n\nI haven't been ID'd since I was 19/20 and I was clearly over 18. The fact a pub can get done for serving a 30-year old is absurd, and *jail-time* for the server?",
          "id": 198,
          "comments": [
            {
              "score": 45,
              "content": "Drinking laws and tipping culture are a joke.  Wayyy too many Muricans up in here thinking you need to tip when you’re abused.",
              "id": 199,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "Its crazy what you're allowed to do before you can drink in America. Get married, buy firearms, kill for your country - all fine. But god forbid you choose what to put in your own body!\n\nIt baffles me how some people get so bent out of shape over having gun laws \"yar takin ma freedoms fram me!\" yet don't go into a secessionist frenzy over the government deeming that a legal adult doesn't yet have the right to consume alcohol.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 84,
          "content": "Yeah, this is wild. Like, *no one* has ever let a legit kid sip a beer to see that they don't like it? Does every family with people clearly under 21 get this watched like a hawk service? They're \"putting the liquor license at risk\" as much or more than OP and his wife. If she didn't want a full drink so didn't show her ID because all she ordered was water, would they also have kept a close eye on their table to make sure she didn't taste her husband's drink? Sure, liquor license, whatever. Maybe OP gives off big cop vibes. But it's not *normal* for patrons to be treated this way.\n\nEdit: The right way for the restaurant to handle this would have been to refuse to serve the first drink. If OP's an inspector, they can't get in trouble. If he's not, he either gets to enjoy his meal as normal sans drink and without an audience, or they leave.",
          "id": 201,
          "comments": [
            {
              "score": 8,
              "content": "YES. I've often not ordered alcohol and therefore not shown my ID, but had a sip of my wife's drink. I've often done it right in front of the waiter. Nobody has ever said shit about it, and probably never will.",
              "id": 202,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "I agree with the NTA, and I find it really depressing that I had to get this far to find this comment. They didn't have to risk a fine, but there are other approaches they could have taken - policing somebody sharing their drink is ridiculous. If you make a customer feel like shit and are combative, then of course you don't get a tip. There are a lot of ways to diffuse a situation like this, and from what OP said, the staff chose none of these. (I wouldn't go back to that establishment either)\n\nI feel like this whole sub is filled with whiney pissed off wait staff.",
          "id": 203,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "[deleted]",
          "id": 204,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 416,
      "content": "YTA. The server, bartender, and restaurant can all get fined for serving alcohol to someone without an ID.",
      "id": 205,
      "comments": [
        {
          "score": 161,
          "content": "Reading the comments I realize I would not be able to pass a valid judgment because of national legal differences so jumping on this comment to learn something new because as a French we dont have those rules and I am curious to know how they work  : does the ID rule really need to be applied to everybody ? I mean, would 60+ people, with white hair and lined faces, absolutely need to present an ID to be served alcoholic drinks?",
          "id": 206,
          "comments": [
            {
              "score": 122,
              "content": "Depends both on local laws and the rules the establishment/corporate set. Have I always been carded? Nope. Do I still have my id on me even at places were I am a regular on the OFF chance I will get carded because someone is new or the cops have been through recently doing compliance checks? Yup.",
              "id": 207,
              "comments": [
                {
                  "score": 78,
                  "content": "Thanks ! So this means the obligation is not \"you have to card everyone\" but \"you have to ensure no minor drinks any alcohol so you better make sure you do whatever is necessary for that \" which would mean carding unknown customers not obviously waaaay over the age limit but letting elder people and regulars drink without ID. \n\nAm I understanding that right ?",
                  "id": 208,
                  "comments": [
                    {
                      "score": 80,
                      "content": "Pretty much. Like my friend works at a gas station and they ID everyone that appears to be under 40 years old (cigarettes and lottery - they don't sell alcohol at her location). She failed a mystery shop once because she didn't ID someone that was 39 because she thought they looked over 40. \n\nThough some places get so much crap from people being offended about being ID'd they make it a rule that everyone gets ID'd instead of people that look over a certain age.",
                      "id": 209,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "In my state, any person has to be able to present a valid ID to be served alcohol. So theoretically yes, if a liquor board person came in and caught an older person drinking without valid ID on them, \n\n\nthe customer could be in trouble\n\n\nthe individual server can be fined (several thousand dollars) and lose their own personal liquor card meaning they can't work at an establishment that sells alcohol of any kind\n\n\nthe business can be fined and lose their liquor license\n\n\n\nIt's certainly not common to card octogenarians but yes, it happens and many larger, more corporate places have policies of carding every single person who orders alcohol, because the cost of getting in trouble could be millions of dollars. A friend worked at a place owned by a local restauranteur and they had to card everyone because theoretically if one restaurant got caught serving people without and ID, the *whole business* could lose their liquor license - meaning five or six restaurants would not be able to serve alcohol for several months and they'd probably go under.",
                      "id": 210,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Some place card everyone regardless of age, some only card those who look under X age say 35. The \"regulars don't get carded\" thing is also case by case as well. It's really comes down to whatever the bosses are comfortable letting happen. My regular bar spot doesn't care me mostly on the fact I've been drinking there for \\*looks at calendar\\* 16 years pretty much every Friday and the staff turn over is low.  At best I'll get carded at the door, but not  necessarily again when ordering drinks",
                      "id": 211,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Most of the time the recommendation is 'if they look under 35' they should be carded. Although, if some obviously older people are also part of a group with some youngsters I will ask the whole group for it so they don't feel like there's any age discrimination. That's usually the recommendation.",
                      "id": 212,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 47,
              "content": "It depends on the state, but where I am, yes.  They check your ID even if you're clearly a gray-haired, elderly senior citizen.",
              "id": 213,
              "comments": [
                {
                  "score": 11,
                  "content": "My kids took me to the local casino to celebrate my 60th birthday. My youngest was 35 but truthfully looks closer to 21, which is how old you have to be to enter the casino. They carded each and every one of us. Because we laughed and cooperated and security saw it was my birthday we had a lovely free dinner. But they were not risking their license. \nAlso the youngest was the DD so she ordered a soft drink with dinner and got carded again just because the server was nervous. And wanted to do their job.",
                  "id": 214,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 46,
              "content": "In Canada we take training courses and are supposed to ID any one who looks under 25! Same things apply, no ID no sale. You also cannot share with someone who forgot their ID.",
              "id": 215,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 30,
              "content": "Yes. My dad loves to tell the story of how he bought a 87 year old strager a beer at a football game because the man did not have a liscence with him because it was revoked 12 years ago when he was 75.",
              "id": 216,
              "comments": [
                {
                  "score": 6,
                  "content": "at least with the New York State DMV, there are nondriver ID's available for people who need photo ID but can't/won't drive, but I can understand someone not knowing or not bothering with this",
                  "id": 217,
                  "comments": [
                    {
                      "score": 4,
                      "content": "This is true in other states as well I think that he must not have brought it if he had one at all. Or it wasn't accepted. Strange lookin ids can be treated like fakes off the bat",
                      "id": 218,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "That's so crazy to me haha jumping on the bandwagon of asking questions cause also European.. In Germany of you visit a restaurant with your legal guardians when you're under 16, you can still get a drink or so (only beer or wine i believe, nothing stronger) if your parents allow it. Of course it's still up to the restaurant to actually serve. I'm guessing there is no such thing in the states, is there? (just curious)",
                  "id": 219,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "I think legally you’re meant to card everyone (correct me if I’m wrong), but it can depend on the restaurant. Where I work, we card if they look under 35.",
              "id": 220,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Yes.\n\nThe degree of flexibility there used to be when I was younger to serve people obviously of legal drinking age has disappeared in many local jurisdictions. The underlying reason is that there are not a lot of places in the US where the customers will be walking home after their drinking, or dinner and drinks. \n\nAll those customers, to a fair approximation, are getting in cars after. That means a much greater risk of alcohol-fueled car crashes. The tolerance for that disappeared when I was in my late 20s/early 30s.\n\nThe result is that often, not always and not everywhere, but enough to make places with liquor licenses careful, there will be someone among the night's customers testing to see if the restaurant or bar is really checking IDs consistently.",
              "id": 221,
              "comments": [
                {
                  "score": 7,
                  "content": "Genuinely curious how checking age prevents DUIs? Also what counts as valid ID?",
                  "id": 222,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Valid ID--most commonly, state driver's license or state ID. \n\nChecking ID makes it rather harder for someone below the legal drinking age to get alcohol to begin with. And yes, raising, and enforcing, the age limit led to a significant drop in DUIs. \n\nChecking IDs also has the less direct but still real effect of making it routine for servers and bartenders  to pay a bit more attention to the drinkers, so they can cut them off when they're getting close to the limit.\n\nAnd finally, it was part of a deliberate changing of social mores around drinking and driving. That's probably the biggest real difference: everyone knows that drunk driving is regarded very differently than it was 30 or 40 years ago.",
                      "id": 223,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 109,
          "content": "Not to mention lose their liquor license",
          "id": 224,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "And fired. You cost the business an abc fine, it’s automatic termination.",
          "id": 225,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 285,
      "content": "You're lucky they didn't kick you out of the restaurant. They are required to verify the age of everyone consuming alcohol, not just the person who orders. Not only does it put the restaurant's liquor license at stake, but the server can have their service permit revoked or even face legal penalties. YTA.",
      "id": 226,
      "comments": [
        {
          "score": 37,
          "content": "I also wonder if there was a recent incident at the restaurant which prompted this strict adherance to the alcohol guidelines.\n\nOP says that the usual team of servers/bartenders weren't there. It is a very real possibility that they may have had a change in staff or gotten fines due to not being strict about alcohol policies?",
          "id": 227,
          "comments": [
            {
              "score": 9,
              "content": "It’s more likely that OP isn’t as much of a regular as he lets on, and recognizes a few staff members but noting more. He seems to think that spending over $100 at dinner and leaving a good tip means he is a big shot that stands out, when that’s really quite standard for the clientele at a nicer restaurant",
              "id": 228,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "> You're lucky they didn't kick you out of the restaurant\n\nThat is what they should have done if this was such a big deal for them that the waiter felt compelled to openly monitor his customers to the point that it made them uncomfortable. \n\nThe sips are either a big deal or they’re not, and either conclusion is totally fine. But if they’re a big deal, then address them properly by asking the customers to leave; behaving in a way that makes their experience unpleasant is the wrong course of action.",
          "id": 229,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}