{
  "post content": "I run a TNR program for feral cats. Non profit, I catch all cats and get them the medical attention they need myself, out of my own pocket. I love helping them. A lot of the cats are not able to be rehomed, so I fix them and release them. Get them their shots and hope for the best. I am not a large scale operation.\n\nRecently I was called to an area overrun with orange cats. They were everywhere and I mostly ended up handing it over to professionals.\n\nI did, however, manage to grab three very sweet cats. Two were terrified, skinny, a little beaten up, but overrall friendly. The third one was a little gent. \n\nHe was tubby, well groomed, fish patterned collar, the works. My plan was to find his parents and drop him off with a warning to keep him in due to the large amount of traps being set. Then the little bastard sprayed the inside of my car to the freakin max.\n\nSo, apparently, he wasn't fixed. I couldn't really tell (longhair) and assumed he was so left my covers off. Big mistake!\n\nI debated taking him home or taking him to get neutered with the rest. He was an indoor-outdoor cat (indicated by his collar tag) and with so many strays I'm certain some were carrying his genetics.\n\nUltimately I took him with me and got him neutered. No chip so I called the number on his tag and informed them where their cat was and gave them time slots to pick him up or have him dropped off.\n\nThe owners went ballistic. They were cursing me out and came to collect their cat not twenty minutes later. Called me a kidnapper, blamed me for their child having nightmares (scared over their cat going missing).\n\nI tried to explain that he needed to be fixed if he was going to be outside but they didn't want to know. They said I should have called immediately regardless.\n\nI spoke to my rescue friend who said I was in the wrong. Even though we know we are technically in the right, we didn't have the legal ground to do that and it wasn't my decision to make. \n\nI did apologise, but have blocked their numbers (the mom is flaming me on facebook and dm'ing people I know). I have a duty to care for stray cats. Me knowing an unneutered male was roaming free and not doing anything about it was a concern for said stray cats.\n\nThings are still tense between my rescue buddy and I and I don't completely disagree. I know I crossed a line even if it was for the greater good. People are finding out and taking sides, so I'm not sure who to really believe was \"right\" here.\n\nSo... AITA?",
  "id": 1,
  "comments": [
    {
      "score": 11823,
      "content": "YTA. You did kidnap their cat and made a (superbly arrogant) decision to have him neutered without the owners permission. You can judge them all you want for letting their cat outside, but the first thing to have done was to call the cat's people and asked \"Hey, I found your cat. Did you know he was outside?\" That's the basic due diligence, right there.(translated: what decent people who are not assholes regularly do.) How a vet decided to neuter the cat means you must have taken off the collar and obscured the owner's information, or they would not have done it without their permission. You just made yourself hella actionable, legally. You don't know if they were planning to breed the cat and he just happened to get out.",
      "id": 2,
      "comments": [
        {
          "score": 9332,
          "content": "I spoke to my vet. She's a tnr vet; she neuters and moves on. There was no address on the collar so my vet said it was fine. I don't know if she tried to call the owners or not though. \n\nI, personally, don't condone the breeding of cats when we have so many dying - literally - for homes. Not three weeks ago I dropped off at least thirty kittens and a couple pregnant mamas at a rescue. Maybe ten will be adopted. The rest will be euthanised. Its horrible. \n\nI don't really care if they had plans to breed, truthfully.",
          "id": 3,
          "comments": [
            {
              "score": 5471,
              "content": "Well, then you shouldn't care if they sue you, I guess. Since you feel you are completely in the right and justified, right? I understand that the cat overpopulation problem is horrible, I'm a cat owner myself. My problem is that you STOLE someone's pet. There is zero justification for that.  And if the vet is that careless, they are leaving themselves open to being sued as well. YOU should have the burden of calling the owner before deciding to permanently alter their pet.",
              "id": 4,
              "comments": [
                {
                  "score": 11190,
                  "content": "Then the owners can keep their frickin unfixed cat in the flippin house where it belongs.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 5398,
                      "content": "Exactly\nWe don’t exist in a vacuum, they can’t just do whatever the hell they want when it affects other cats and people \nThey should’ve kept him indoors",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 766,
                      "content": "Statistically un-neutered free range cats have a hugely reduced lifespan. They are of course an environmental hazard as well.  OP is doing the world a favour.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 544,
                      "content": "honestly though, the owners are so wildly obtuse that I cannot for the life of me get mad at OP even tho I do think what they did could have been handled better or differently. \n\nthat was an indoor/outdoor male cat just tooling around town. the owners were definitely aware of the possibility and the probability that their cat has created tons of kittens. as far as i’m concerned, THEY are somewhat responsible for the stray problem that CAUSED their cat to get caught in the crossfire of this local TNR/animal control patrol in the first place. it’s their own fault for letting their cat contribute to the point where there’s SO MANY ORANGE BABIES that OP even got a call in the first place. \n\nI think ultimately this was a mistake on OP’s part to go about it the way they did, but I can’t argue with their reasoning. I hope OP is able to sweep this under the rug and keep going because it sounds like they’re ultimately doing a helluva lot of good.\n\n.. including (but not limited to) getting this freaking cat fixed.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 92,
                      "content": "Everyone should have to keep their cats inside, they harm the bird populations, but that doesn't give anyone the right to steal and perform a medical procedure on someone elses pet.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Even if fixed it should be indoors.\n\nCats are an ecological disaster in most areas.\n\nIf cats arnt native to your area. Keep them tf indoors.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I love it when the next door neighbor's unfixed cat comes across the street and sprays the wheels of my car, my porch/front door and everything else that little bastard looks at.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "For real. Dunno why this is even a conversation. A lot of bad pet owners outting themselves in this thread.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 930,
                  "content": "Animal control would have done EXACTLY the same thing in 32 states? The cat was running around unsupervised- it woudl be picked up. They would have called when they had a chance. AND CHARGED for the surgery in addition to the fine. \n\nIt is one of the many risks of having an indoor-outdoor cat",
                  "id": 13,
                  "comments": [
                    {
                      "score": 353,
                      "content": "In my area, Animal control will pick up a stray cat, get it neutered and then drop it right back off in the same area. They typically don’t have the space for all those cats but they try to control the growing population of outdoor cats by getting them neutered",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 116,
                      "content": "I’m in one of those states and that’s not how the law works. The law regulates adopting or transferring animals but returning someone’s pet to them doesn’t count as that. In my state, if they get ahold of your intact pet, you have the option of paying the fine for having an intact pet or paying the $50 for the neuter. They still have to get the owner’s consent before surgery. Veterinarians have to get owner consent before putting a pet under anesthesia. The pet owners may have broken the law if they’re in a state with mandatory castration laws but the vet went against state licensing rules and would be subject to a fine if the cat’s owners knew how to report that.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 60,
                      "content": "Animal control is handled on the county level, not the state level.  And the rights of the owners of stray animals are the priority. Animals are property, legally.  It’s literally unconstitutional to deprive someone of their property without due process.  Animal control and even third parties are legally obliged to attempt to contact the owner before disposing of or surgically sterilizing an animal.  Most places in the US don’t even have laws prohibiting people from allowing their cats to roam.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "And I'm sure the police will lock people up who are too drunk. That doesn't mean you have the right to do the same thing as a private citizen",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "This is exactly what happened to my stepbrother.  His unneutered, unvaccinated dog got caught by animal control and they refused to let them get it back until it was fixed and had his shots.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "And animal control has the right to do that. OP does not.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 711,
                  "content": "Please go away with this sanctimonious tripe. There is no need for anyone to possess an intact mutt of a cat. It would be different if it was a pedigreed sire they relied on for money. Yes animals get loose. They did these people a favor honestly. One less horny Tom cat on the prowl to make more feral kittens, tearing down the walls to get to an in heat female.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 398,
                      "content": "Not only that but a responsible cat breeder would not let their cats roam the streets picking up FiV and feline leukemia and all the other possible diseases. That's a quick way to make any animals you produce sickly and ruin the quality of the breeding animals and any offspring.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "THIS! Yes, OP did these owners a fucking favor. She didn't steal their cat, she didn't break into their house and take him and shit, bro was out irresponsibly and got trapped. If they let him outside, wtf is the point of calling the owners? Op said the tag indicated inside/outside. If more rescues did this we'd likely have less of an overpopulation problem.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Not to mention he'll probably live longer without the risk of any reproductive organ complications or riskier behavior while attempting to breed",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 466,
                  "content": "They let their unfixed cat out to impregnate every stray. I bet their house stinks of cat piss too since intact male pee smells even stronger",
                  "id": 24,
                  "comments": [
                    {
                      "score": 192,
                      "content": "No, see thats why they abandoned their cat outside rather than deal with it responsibly. /s",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 356,
                  "content": "No \"theft\" occurred here. OP found the cat, insured it had medical treatment and returned it to the owners. They should be GRATEFUL.",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 300,
                  "content": "She did not steal anyone’s pet. The animal was loose and she sterilized it before calling the owners.",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 241,
                  "content": "Say they sue, what are their damages?  None. The answer is none.  She saved them money, in fact.  And prolonged their cats life.  Anyway, they would not win in small claims.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 21,
                      "content": "How long have you been an attorney?",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 194,
                  "content": "This isn't \"am I legally in the clear\" though it's aita. Causing harm to animals through negligence is arguable a more morally repugnant   than kidnapping. Was op legal or wise, possibly not. But the question at hand is is op the biggest ah here.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Yeah that's what I think. Legally probably in the wrong, morally? Spot on in my opinion",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "You’re right, that makes sense.  I still judge OP the bigger asshole for the following reasons:\n\n•Calling themselves a rescue with no idea what the related laws are in their area\n•putting an animal in danger because they got angry \n• stealing (cats are property)\n•not considering any other party’s feelings\n\nThank you for the reminder.  I should have outlined my reasons this way instead of just answering the legal angle (I am used to the legal subreddits but that doesn’t excuse not answering appropriately for this sub)",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 191,
                  "content": "Man people who let their cats free roam outside *deserve* to get their pet stolen\n\n\nMaybe then itll actually get to live a long happy life",
                  "id": 33,
                  "comments": [
                    {
                      "score": 8,
                      "content": "My dad lets his cat roam around, but I personally really don’t like it. He even got into a fight with a neighbor because the neighbor’s cat and his cat kept getting into fights, but what do expect when you let them roam around? Then many ppl act shocked when they have to pay for medical bills when their cat gets injured or sick when they let them roam freely in the first place. Not only can lead to a surplus in stray cats but they can get into fights with other ones as well. I remember finding a colony of cats behind some bushes, all stray, and people would make houses for them out of old plastic tubs and bring them food. Luckily they all appeared to be adults but it made me very sad to see.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I was feeding a stray a few years ago, but I couldn't bring him inside. So, I left food out, and went out and spent time with him. He stopped showing up after a few months, but it turned out he was also being fed about a block away. Thing is I didnt find out until somebody posted on Facebook that he had been killed by a car... I still feel guilty even though adopting him just wasn't possible.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 94,
                  "content": "At one point we had some really awful neighbors across the street. Like blasting their music at 3am on a weeknight, kids setting off fireworks all night (illegal even during the 4th of July where we live). Like not little fireworks, I'm talking mortars and shrieking whistles and other really loud shit. regardless of what time of night it was. They had a gorgeous siamese that they let roam collarless. One day we talked to them to ask if they would cut back a hedge because it blocked the view of the main road you turned on to get off our street, so you couldn't see if someone was coming in that direction. When I talked to them they said that their siamese had gone missing but then he reappeared with one ear partially clipped and neutered. I said that someone must have TNR him and she was super mad because they intended to breed him. I commiserate with her for a few moments then left to do my own thing. Astoundingly, they did cut back the hedge. Probably cuz it blocked their sight too.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 140,
                      "content": "What a terrible idea to breed a cat that roams outside. I mean, obviously these people had no business breeding anyway, but that’s a good way to pass on the various infections cats pick up outside from their interactions with other cats and wildlife.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 68,
                      "content": "So glad someone saved that cat a life of breeding.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 739,
              "content": "What you personally condone or don’t condone is not legal or morals grounds to stand on. You put your organization at risk by doing this. A simple phone call would have saved all of this. One call: ‘Hi I found your cat this afternoon with a handful of feral cats. I brought them all in for a look over by a vet and to schedule neutering. Your cat is currently at X vet hospital and they can perform the surgery this evening with your permission. Otherwise you need to pick up your pet and consider the danger of an in-tact cat allowed to roam with feral cats.’  Done. That’s all you had to do and likely the family would have allowed the surgery and the child wouldn’t have worried where the cat was and you wouldn’t be a righteous AH",
              "id": 39,
              "comments": [
                {
                  "score": 140,
                  "content": "My cousin's dog died while being neutered. I know it's extremely unlikely to happen, but it can. I'm a big, big, big advocate for TNR programs, keeping cats indoors, and spaying/neutering any pets, but OP is big YTA.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 75,
                      "content": "A friend's cat died by giving birth. This unneutered male cat has possibly caused quite a lot of deaths. \n\nGetting someone's obvious pet cat neutered was a dick move, but so is letting an intact male cat out to create cat colonies. ESH",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "I'm going with YTA as well.  \nFor this specific reason. Justified or not, this was NOT a feral cat, and they did not have the legal right to do what they did.  \nOP, this was *not your animal!!!!*  \nYou had contact information, and they obviously care about their cat if they showed up promptly to pick him up.  \nYou AND your vet waited til *after* the neuter to contact anyone.  \nSo this was not about doing the \"right thing\" for you. This was about what *you* wanted to do and what *you* felt was best.  \nDoing the right thing would have been calling them immediately after seeing their contact number. Then, take steps from there.  \nIf you really cared about furthering your TNR program, you were handed the perfect situation on a platter to teach the importance of spaying and neutering cats. The mom could have been posting all great things about what you do for the cats in your area if you had contacted her *when you found her cat.*   \nBut you got on your holier than thou horse, and now you are in a situation of your own creation.  \nYTA.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 482,
              "content": "BS!  There was a *phone number* on that tag!  Which clearly worked when you finally bothered to use it.  You *and* the vet knew exactly what you were doing, took 0 steps to contact a *very* contactable owner, and while I agree with you in general about the issue of unneutered pets wandering around outside (and tbh outdoor cats generally) this vet should be reported to her licensing board.  Don't be surprised if the owners do report her.",
              "id": 43,
              "comments": [
                {
                  "score": 659,
                  "content": "just like the owner took 0 steps in preventing feral cat overpopulation.\n\nIf you were in the owners position, and your cat just went out and sireed a couple of litters, would YOU adopt all those kittens?  \nNo, right?\n\nYou'd give away what you could, then drop the rest at some shelter. And what the shelter cant home will get euthanized.\n\nThe pointless death of cats arent worth *your* cat's balls, or his freedom to roam.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 208,
                      "content": "And if the owners came on here and asked if they were the assholes for letting their cat sire a bunch of kittens we'd say yes. But the question at hand for OP is are they the asshole for kidnapping this cat and neutering it without informing or asking the owners first. Doesn't matter why. The answer is yes. Frankly I think this is an ESH.",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 54,
                  "content": "I’m sure the owners have already contacted the vet and threatened to do so, and perhaps the police as well.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 115,
                      "content": "It’s a civil matter. Police won’t do anything.",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 418,
              "content": "NTA. I am in the same position with a female cat. Her \"owners\" don't give a crap about her. She is at my door begging me for food every morning. No collar or tag but I know the neighbors claim she is theirs.  Going to get her in soon. Sorry not sorry.",
              "id": 48,
              "comments": [
                {
                  "score": 172,
                  "content": "Absolutely correct. They could have kept the cat in the house. If it's out on public property then too bad.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 79,
                  "content": "\"Sorry not sorry\" sums it up nicely. I don't understand why OP is on AITA. OP seems to have the same attitude as you: Sorry, not sorry.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Although I don’t agree with the owners decision not to neuter their cat, OPs situation is different as the cat had a collar with a number they could use to contact the owner, this other cat does not.",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "And rightfully so in this case! Stray cats are going through so much pain and misery. Noone who owns a unneutered outdoor cat is a cat lover, or animal lover, or has a single shred of empathy in their body. They are AH who don't care.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 322,
              "content": "Shelter worker here. \n\nHow were you not concerned with if this cat had died? Most vets will not preform surgery without an anesthesia consent form. I’m not sure if this applies out of the US but good intention or not, this was super illegal. Had this cat passed because of the procedure you and your vet could be in massive legal bind because you decided to act without owner consent. \n\nWhile I agree that the cat should’ve been neutered, it wasn’t your decision to make. Plain and simple. \n\nYTA.",
              "id": 53,
              "comments": [
                {
                  "score": 87,
                  "content": "\\*Thank you!\\*  The people in this thread who act as though such a procedure carries zero risk is astounding.  Plus, OP didn't even know the cat's medical history.  While it isn't super likely, there's always the chance there is something about the animal you don't know, but the owners do, which the vet should have been informed of.  Talking with the owners is the right move (both legally and ethically).  Taking it upon yourself to abduct someone's pet and have a surgical procedure performed on them is not.  YTA.\n\n\\*Edit: And for what it's worth, I am very much pro-neutering and spaying pets.  But what I prefer and what the OP should have done are not the same question.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "I feel like you are of the few people here offering a voice of reason. What she did was wrong and gives a poor impression of the work that her org is doing. A simple phone call would have solved all of this, but she was pissed her van got sprayed and is being rightfully dragged for what she did.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Yeah, the vet reeeeaaaallly didn’t care about any ramifications did they. I vaguely understand a volunteer not comprehending all the problems with anesthesia and surgery etc, but the vet knew all the possibilities and potential outcomes and still just did it.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I am absolutely convinced OP is lying and the vet didn't know it wasn't a stray.",
                      "id": 57,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "> Most vets will not preform surgery without an anesthesia consent form. I’m not sure if this applies out of the US but good intention or not, this was super illegal. \n\nUnder US law, pets are simply considered property.  There are no emotional damages that flow from the loss of a pet.  Legally, if the cat died, the vet would only be answerable for the cash value of an unaltered male Tabby cat (between $75-$500 depending on the state and the shelter).  \n\nShe may need to answer to her veterinary ethics board, but that is it.",
                  "id": 58,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "What massive legal trouble?  In the US, pets are considered property for the most part.  Their damages would be limited by the actual value of the cat. Emotional damages could be pursued in civil court, but that wouldn't be some huge payout either.",
                  "id": 59,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 256,
              "content": "I want to make another viewpoint clear to you that you may not have considered: You did not know the medical history of this cat.\n\nAs a child, I had a dog that was allergic to anesthesia. He went blind from being neutered and nearly died. An emergency surgery later made matters worse. I believe it contributed to his death when he was attacked by another dog, that someone brought into our house, and they had to operate. \n\nYou had no knowledge of how this cat would react to the anesthesia. TNRing feral cats is one thing, the risk of them reacting badly is an expected one. But the family of that cat didn’t get to make that decision, give vital information on the health of that animal to the vet, or even know that their cat was undergoing surgery. If that cat died on the operating table, it would have been completely your fault.\n\nYTA",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 213,
              "content": "If your vet is fixing obviously owned cats without permission, they are AH'S too.",
              "id": 61,
              "comments": [
                {
                  "score": 301,
                  "content": "In at least 32 states- this is actually MANDATED.  Animal control, rescues, etc are MANDATED to spay/neuter before returning.  So...exactly what is OP doing wrong?",
                  "id": 62,
                  "comments": [
                    {
                      "score": 193,
                      "content": "She’s not animal control, she doesn’t have an actual program. She’s just a random person driving around and picking up cats.",
                      "id": 63,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 58,
                      "content": "Not being animal control and not limiting themselves to rescues instead of clearly owned and taken care of cats who they have literally zero right to do absolutely anything to",
                      "id": 64,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "Do we know if OP is in one of the 32 states? If not, then all of your comments about this are pretty irrelevant.",
                      "id": 65,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "Yeah as someone commented she's not part of a rescue exactly. Just \"volunteering\" a vigilante cat neuter activist",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "They took it upon themselves to act like animal control.  So those states mandate that individuals must neuter a pet before returning it to the owner? OP should have turned the cat in to animal control or called to request an animal control officer to advise them.  Had they done so any neutering and/or consequences to the owner would have been carried out by the agency endowed with those powers.\n\nBare minimum would have been asking the rescue that they represent what to do in this case.  \n\nAny individual crowning themselves moral arbiter of others is a flaming AH.",
                      "id": 67,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "OP isn’t animal control and the cat was neither a stray or a rescue",
                      "id": 68,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Not being animal control, choosing clearly owned cats, and very likely not living in one of those states. OPs ends do not justify their means.\n\nIf they lived somewhere it was mandatory, allahe had to do was surrender the animal to animal control and wash her hands. If she lives somewhere it's not mandatory, she had no right to do it. Either way, her and tis vet doing it without the owner consent is wrong. It's a lowrisk procedure, but not a no-risk procedure.",
                      "id": 69,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "How do you know they're in the US?",
                      "id": 70,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 171,
              "content": "Where would you have ended up if this cat hadn't been neutered because of a medical condition that you weren't aware of? There are plenty of pets who, for one reason or another, can't safely be put under anesthesia. You would've been 110% for killing someone's cat because you ASSUMED a situation, with no real proof of what was actually happening, and decided that your moral high ground was more important than any single piece of information the owner would've given you. \n\nDo I agree that outdoor cat populations are insane, and people should be fixing their pets? Absolutely. Does that give anyone the right to knowingly kidnap someones pet and make that decision for them? Absolutely not. \n\nThe rescue community needs LESS people like you- owners will not learn through brute force. Controlling populations is about patience, education, and understanding. You seem to lack all three. ATA.",
              "id": 71,
              "comments": [
                {
                  "score": 72,
                  "content": "This was my thought exactly. That cat could have had a number of health problems that were known to the OWNERS that prevented it from going under general anesthesia safely. These TNR programs most of the time don’t do any prescreening besides a physical exam. What if it had died? \n\nMy guess is that you didn’t call the number on the collar right away because you KNEW that you were in the wrong and wanted to continue your “mission” anyway. \n\nThe cat shouldn’t have been roaming if it is intact, but that’s not the issue here. You made a medical decision for someone else’s pet when you had no knowledge of the pet’s health status. YTA",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "> There are plenty of pets who, for one reason or another, can't safely be put under anesthesia.\n\nThen they need to be kept inside or on a leash, where the owner can safely monitor them and ensure nothing happens to them that might put them in a situation where they need anesthesia. Not just OP's situation, but what if a loose pet runs into traffic and gets hit by a car? They're going to need anesthesia for the surgery.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "What an out of touch view. Controlling populations is about fixing fucking pets. The only people making a difference are the ones getting pets fixed. OP didn't fix this cat to teach the owners a lesson, they did it to prevent dozens of more cats being added to the overpopulation, preventing more suffering and death and work for people actually making a difference.\n\nEveryone is saying they should have called animal control, but they would have done the same thing, they just would have added sticking the owners with the bill. The owners should be thanking OP.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 135,
              "content": "You commented down below that it’s just you and not a TNR program. Is your vet actually a TNR vet or are you just saying that too? YTA\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/13r1k0r/aita_for_neutering_a_cat_that_was_clearly_owned/jlhzvqd/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1&context=3\n\nEdit: Added a link to the comment where she says it.",
              "id": 75,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 97,
              "content": "YTA, but I’d have done the same thing. \n\nHowever you probably should have taken his collar off first (assuming he is a cat who would just go home as usual). Then you could have claimed you didn’t know he was owned. Microchip your animals people!\n\nPerhaps drop them off some of his starving skinny offspring and see how they feel then.",
              "id": 76,
              "comments": [
                {
                  "score": 15,
                  "content": "She could have just called animal control and they would have done the same thing.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Ah, perfect, let's break the law a bit more while we're at it.",
                  "id": 78,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 718,
          "content": "Half a million stray cats are euthanized every single year in the US. A female cat can have a litter that has litters that have litters that result in a hundred cats in a couple of years, let alone a male. The morality of what OP did doesn’t come anywhere close to the owners leaving an unfixed cat to run around a neighborhood with a stray cat problem.\n\nEdited to add: every city I’ve lived in has a policy where if they catch your animal they won’t return it without fixing them and they charge a fee.",
          "id": 79,
          "comments": [
            {
              "score": 67,
              "content": "Same here. I have never heard of a shelter/rescue that doesn't neuter the animals right away.",
              "id": 80,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 26,
              "content": "And that's before you get into the environmental impact of stray cat populations. It impacts bird, rodent, and native predator populations.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 679,
          "content": "If an owner is letting his cat outside, the  nicest thing that will happen to that cat is getting neutered.",
          "id": 82,
          "comments": [
            {
              "score": 201,
              "content": "This. \n\nSo many worse things could have happened to him.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "This alllllll the way. The owners are the actual AH’s.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Right!",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Agreed. Anyone letting their cat outside willingly is accepting the risk that anything could happen to their cat. Being neutered is one of the least harmful things that could have befallen it. Plus it has the added bonus of harm reduction with less kittens being produced. Keep your cats inside if you want to have a say in what happens to them. \n\nNTA",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I honestly don't really get how people claim such a solid, unquestioned ownership over an animal they literally leave to roam wherever the hell it wants, destroying the local ecosystem.  If it's so precious to you then *keep it the fuck inside where it and everything else stays safe*, you can't have it both ways.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 400,
          "content": "NTA. KEEP YOUR FUCKING CATS INDOOR THEN. NO ADDRESS ON THE COLLAR OH WELL. THE CATS BETTER OFF NEUTERED ANYWAY.",
          "id": 88,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 223,
          "content": "Nah.   \nThat cat was outside, and eventually wouldve fucked some female cat, adding to the feral population.",
          "id": 89,
          "comments": [
            {
              "score": 6,
              "content": "No eventually about it.  He’s probably impregnating a different cat in that colony every day.  Probably has hundreds of offspring by now.",
              "id": 90,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 112,
          "content": "Ah yes those poor irresponsible cat owners",
          "id": 91,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 77,
          "content": "If it was the humane society they also would have taken it and fixed it. I know I used to work at one.\n\nWhat they did wasn't against the law at all.",
          "id": 92,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "She didn’t kidnap the cat. The cat was loose. Kidnapping would be if she broke into their house or yard. There was no address on his tag.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Why don’t you go ahead and imagine a dumpster full of dead kittens?  \n\nBecause that’s pretty much what happens when cats are allowed to roam around without being fixed. Cats being put down because of crappy people like you.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": ">You don't know if they were planning to breed the cat and he just happened to get out.\n\nWhy did it have a collar then? I've never seen an indoor cat that needed a collar.\n\nNTA OP. Good job!",
          "id": 95,
          "comments": [
            {
              "score": 10,
              "content": ".... you give an indoor cat a collar in case they get outside.\n\nHow.. how did you say that so confidently?",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I agree OP’s NTA, but you can’t say it’s not an indoor cat just bc it had a collar. My indoor cat has a collar with my phone number on it just in case he gets out, it states “indoor cat, please call.”",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9092,
      "content": "ESH. The owners for letting an intact pet outside unsupervised to breed, and you for having a surgical medical procedure done to an animal (that you KNEW had owners) without the owner's consent. Regardless of the morality of allowing pets to contribute to the stray population (for which the owner is an AH), making medical decisions for someone else's pet makes you a massive AH. Everyone sucks.\n\nEdit: spelling",
      "id": 98,
      "comments": [
        {
          "score": 1541,
          "content": "This is the best answer. While it sucks that people are allowed to let their pets roam free, especially if they're intact, we do not have the legal ground to stand on to fix them. I do TNR and foster kittens and it's very frustrating to see pet owners who don't care enough to fix their pets, but we have to turn to lawmakers first, not individual pet owners. Had the cat had a reaction to the anesthesia or pre-meds, or the owners decided to sue for you fixing their cat, that would be one less person helping other cats, and could have resulted in the death of the cat. ESH",
          "id": 99,
          "comments": [
            {
              "score": 155,
              "content": "This.\n\nI have an indoor-outdoor cat that isn't allowed outside by himself (my mom's cat had recently died due to rat poison consumption, and I live in an apartment. I'm not letting my cat out by himself.) and leash trained him for his own safety. I kept him intact for a year because 1.) I wanted him to reach maturity, I don't like the idea of just spaying/neutering a cat because it's convenient and not letting them grow, and 2.) We just couldn't afford to get it done. I would have loved to have been able to go somewhere that would have done it for free, but that's not an option where I live.\n\nPeople like OP, unfortunately, are part of the reason *why* I don't allow my cats outside without me or my fiancé.\n\n100% if OP took Pet and Pet died because he couldn't handle anesthesia, I doubt OP would have told the family.",
              "id": 100,
              "comments": [
                {
                  "score": 389,
                  "content": "No cat should be outside without supervision. You are doing the right thing. Cats wreak havoc on their local environments. They decimate bird populations. And their life span is greatly decreased because of increased risk of disease and injury/death.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 220,
                      "content": "Absolutely. Just to give some statistics, the [average lifespan of an outdoor cat is 2-5 years while an indoor cat can live on average between 15-17 years](https://www.petmd.com/cat/care/can-indoor-cat-be-part-time-outdoor-cat). Letting your cat be an outdoor cat can severely shortened its life.\n\nAnd I know that a bunch of irresponsible cat owners are going to spam my inbox with, \"Oh, but my outdoor kitty lived to be 12 and was perfectly healthy!\" Great, I'm glad that they lived to a reasonably mature age. But your little anecdotes are immaterial to the academic findings.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 162,
                  "content": "> People like OP, unfortunately, are part of the reason why I don't allow my cats outside without me or my fiancé.\n\nYour unneutered cat should not be outside unsupervised regardless.   It shouldn't take people like OP to make you actually be a responsible pet owner",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 57,
                  "content": "You shouldn't be letting your cat out unsupervised regardless... so glad you found a reason to do what you should already be doing...",
                  "id": 104,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Right?  Like that comment reeked of 'bad cat owner pretending to be a saint'.",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "there is no proof that fixing your animal affects their growth plates. i don’t understand where people latched onto this belief. and it was always for large breed dogs, now people are worried about their *cats*?",
                  "id": 106,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Because people will latch on to and use anything as an excuse to justify shitty and irresponsible behavior.",
                      "id": 107,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "AND it prevents cancer development. People don't want to get educated, or worse, they act like the vet offered to cut the owners balls off. it's so juvenile. Take responsibility for the living (invasive species) you brought into your home.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "Why don’t you like the idea of being a responsible pet owner who neuters/spays their pet?",
                  "id": 109,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "If you can’t afford to have your pet neutered, then you cannot afford to have that pet. Unfortunate, but that’s the way it is. You should be keeping your cat indoors regardless.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Can you give me some advice? I trapped a young female cat last week and just got her back from the vet spayed. She let me pet her at first, but I think was paralyzed from fear. Now that she’s home she’s been moving a bit more, and I haven’t t tried again since she growled at me this morning while filling her food bowl.\n\nQuestion is, do I return her where I found her (in the basement on an office building on a military base- she’d found an open grate allowing access, but there are cars and people. Do I set her free behind my house where there are lots of woods, but also coyotes? Or do I try to convince my barn owner to take her, even though her dog is aggressive with the cats? I’m having a hard time taking responsibility for an animal then just turning her loose.",
              "id": 111,
              "comments": [
                {
                  "score": 37,
                  "content": "Ask around your local shelters and veterinarians to see if they have a protocol for releasing cats who were trapped from unsafe locations. If your area has an official TNR organization you can talk to them to see if they have a designated safe drop spot. Sounds like a tough situation, thanks for helping her out. ❤️",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Our semi-feral girl was a hissing lump on the floor of our bedroom under a blanket for 2 solid months when she first came home. Now she's a lap fungus who demands treats, attention, and belly rubs 24/7.\n\nI wouldn't necessarily give up yet (though much depends on your personal circumstances and willingness to see if she warms up).",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "If you’re willing to keep her if she becomes friendly then I’d give it at least a few weeks to see if she’s truly feral or just scared and a bit wild.  \nIf she’s just scared she may come around if you sit in the room with her and offer treats, but otherwise ignore her and maybe read a book, or just be on your phone doing whatever.  \nLet her get used to you being safe and predictable. No sudden movements or loud noises.  \nIt can take many weeks, but you should see baby steps of progress.  \nTrue ferals will have virtually no progress in getting friendlier.\n\nIf she doesn’t come around at all then definitely take the other person’s advise to contact a TNR group to find a better release location.\n\nIf you don’t plan to keep her but aren’t certain she’s feral then maybe see if a foster group could take her in and try to socialize her.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "I don't understand this attitude. \"sucks that people are allowed to let their pet roam free\" nothing we can do tho ¯\\\\\\_(ツ)\\_/¯.\n\nI saw this attitude in people's daily lifes. \"sucks that my landlord decided to rise up the rent by 100%, nothing I can do or that would be illegal\", \"sucks that the planet is being destroyed by the wealthy elites, nothing we can do tho except voting harder\", \"sucks that school shooting kill so many people in the US, no legal ground to stop it tho\"... It's offtopic but it's such a problematic attitude.\n\nStray cats are a real problem, the solution to just be frustrated and shrug is clearly not working.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "OP could have offered to pay for the cat to get fixed",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "This isn’t “am I legally in the clear” this is “am I an asshole”. It doesn’t just suck when people let their unfixed cats out, it creates horrible outcomes.\n\nI would have done the same thing. I do TNR in my neighborhood. We don’t live in a vacuum.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 296,
          "content": "Im honestly so grateful the cat was okay too. Like, it’s anesthesia it’s not like they clipped the cats toe nails. They put the cat under without any past history on *someones pet*. \n\nI have to wonder the legal ramifications for both OP and the vet.",
          "id": 118,
          "comments": [
            {
              "score": 148,
              "content": "That was my first thought. It may not be likely, but there may have been a medical reason as to why he wasn't neutered. I can't believe OP had the audacity to do all of that without even trying one courtesy call! I say this as someone with a wildlife conservation background who is not a fan of outdoor cats - a pet is a pet and you need to respect others.",
              "id": 119,
              "comments": [
                {
                  "score": 29,
                  "content": "Ooo yes I just had another thought, since they took this random cat, what if the family was waiting for a certain age or something for the cat to be fixed too! Like just because the cat wasn’t fixed doesn’t mean they didn’t have specific plans to do so.",
                  "id": 120,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Right? When I tried to rescue a kitten I only had her for a few months, but sadly when I took her to be spayed she didn't survive the anesthesia process - I was devastated. Can you imagine doing that to what was clearly a family pet?",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "That said, if your animal isn't fixed, they shouldn't be allowed to roam freely outside.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "True, my parents took in a stray cat and brought him to the vet to have him neutered and were told he couldn’t be neutered. He’s definitely not fixed cause he still sprays, but the vet said there was nothing there for them to remove.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Huh that's interesting, I wonder what the story is behind that!",
                      "id": 124,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "This was my thought. My cat had a bad reaction to anesthesia during a routine teeth cleaning appointment. He had to go through a ton of heart tests to see if we could even give him anesthesia ever again.\n\n While letting a non-neutered cat outside is shitty, they could have done serious damage to that cat. There could be a medical reason the cat wasn't neutered. How awful that they made a medical decision without contacting the owners.",
              "id": 125,
              "comments": [
                {
                  "score": 7,
                  "content": "Yep that’s my problem with it! They *knew* it was a pet so this is malicious because they didn’t know the pets history and made the decision against the owners. For all the knew they was something wrong with it!",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Yeah, vets in my area aren't supposed to proceed with surgical intervention involving anesthesia unless 1) the owner signs a consent form or 2) it's an emergency and the animal will die without that intervention. I agree with OP generally regarding the need for all roaming animals to be neutered, but they have very likely opened both their organization and the vet to liability.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Yeah, this. Look, I absolutely agree that cats should be indoor pets, and if they have to be indoor/outdoor pets they should 100% be neutered, because not only do unneutered cats contribute to the feral cat population, being unneutered, especially in a male cat, is a big risk factor in catching FIV, FeLV, FIP and a lot of other nasty diseases, as well as injuries from fights. Generally bad times for all. \r  \n\r  \nSo I definitely agree that the cat should have been neutered and the owners are AHs for not doing it. \r  \n\r  \nBut! OP knew this was a pet cat, and had their contact information. As much as the cat should have already been neutered, she knowingly stole someone's cat and put it through a medical procedure without permission. That makes her an AH too. It'd be a different thing if she didn't know if he was a pet or a stray former pet, but she had their phone number.\r  \n\r  \nDo I understand why she did what she did? Yes! Is she still an AH? Unfortunately, yes. As is the owners, for letting an unneutered cat roam free, so ESH is the way to go.",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "This whole thing is also terrible optics for OP's program.\n\nWhich OP should be way more concerned about. Frankly I don't think TNR is the type of activism you can do if you aren't prepared to educate/coddle people you don't agree with or think are immoral. Mainly because it's pretty easy for people to do stuff like fuck with your traps if they don't like what you're doing or you pissed them off.",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Yes. This is it, this is the answer",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I 100% agree with this answer. I'm wondering if, in the worst case scenario, the poor kitty reacts badly to anesthesia and died. Would OP still tell the family? Or would the family forever be wondering where their cat is??? \n\nI have had cats my whole life. My 2 current kitties are strictly indoors and don't even care about going outside. I'm team \"don't let your cats free roam outside,\" but what OP did is really arrogant and shitty.",
          "id": 131,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3782,
      "content": "INFO:  You said:\n\n> …The third one was a little gent.   He was tubby, well groomed, fish patterned collar, the works. My plan was to find his parents and drop him off with a warning to keep him in due to the large amount of traps being set. Then the little bastard sprayed the inside of my car to the freakin max.\n\nThis really makes it sound like you changed your mind out of spite.  Can you be absolutely sure you didn’t?",
      "id": 132,
      "comments": [
        {
          "score": 1777,
          "content": "She didn't do this out of spite.  Unneutered male cat urine smells distinctly.",
          "id": 133,
          "comments": [
            {
              "score": 801,
              "content": "A dstinctly FOUL odor.  Just had to pick up meds for my kitties yesterday after an older unfixed male sprayed the whole office.  I about puked and had to go stand outside!!!",
              "id": 134,
              "comments": [
                {
                  "score": 45,
                  "content": "Your right it’s an awful odour. However, this isn’t the same situation. This person CHOOSES to rescue stray cats off the street. In doing something such as that you need to be prepared for all kinds FILTH.",
                  "id": 135,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 214,
              "content": "Indeed she changed her mind because as it says in the post he was long hair so it wasn't obvious he was intact until he sprayed in the car.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "We had a stray bullying us at our apartment. Would go to the 2nd floor to spray our doors because we had an indoor male cat that was neutered. Fucking terrible thing to wake up to your house smelling like piss so strong you can taste it. F people who let their unaltered cats roam outside to just have more strays.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Sounded to me like she assumed he was fixed, until he sprayed.  She didn't change her mind about getting an unfixed cat neutered.  She just learned he wasn't already fixed.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1207,
          "content": "She figured the owned cat was neutered until it sprayed. Not that she made the decision out of spite.",
          "id": 139,
          "comments": [
            {
              "score": 165,
              "content": "She literally went from calling him a little gent to calling him a bastard.  Sure seems like she got angry AT the cat",
              "id": 140,
              "comments": [
                {
                  "score": 390,
                  "content": "Sounds to me like she was just angry with the situation, not the cat. She decided to neuter him based on her opinion that there are many cats needing home and being euthanized very frequently. I agree with her opinion but im kinda on the fence about whether OP is TA or not.",
                  "id": 141,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Oh OP is the AH no doubt about it. \n\nThe AH we all need. \nIf the owners don't want to take responsibility for their pet... well... that has been made for them now.",
                      "id": 142,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "OP can be angry at the cat and also recognise it's not it's fault at the same time. I dropped off a lost male ferret to the vet once that not only bit me when I saved it from my dogs but also caused my car to stink off piss for a good long time, absolutely angry at it but it also wasn't the ferrets fault.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "How dare she be annoyed when something annoying happens! We can't trust a single thing OP says. \n \n.... That's what you're trying to say, right?",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "N Ah I call my cats all kinds of shit but I love them all even when they are assholes.\n\nNeutering a cat is not a punishment that is just silly. \n\nNit saying they were right to do it but they did not do it from anger lmao",
                  "id": 145,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I go from calling my cat Lincoln a little baby to a little bastard, I don’t do it because I'm mad, he's just being a little bastard when I call him that.\n\nI still love and adore him, even if he is, in fact, a bastard lmfao.",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Can’t cats still spray even if they are fixed?",
              "id": 147,
              "comments": [
                {
                  "score": 39,
                  "content": "they can but the smell is absolutely vile from an intact male compared to neutered cats",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 450,
          "content": "How is neutering out of spite? All outdoor cats should be neutered .",
          "id": 149,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2264,
      "content": "ESH you should have taken the cat back when you knew it had an owner and it ultimately wasn’t your decision to have him neutered. But they should have had their cat neutered and not let it outside in an area with feral strays. \n\nAs someone who also works in cat rescue I do find their ranting about the fear of the possibility of the cat not coming back for one night a bit rich, given all the other awful things that can happen to indoor outdoor cats outside (in North America, I do know in the UK this practice is less risky and more common). that fear about their cat not coming back for one night probably won’t change their behaviour and they will keep letting him out.",
      "id": 150,
      "comments": [
        {
          "score": 1040,
          "content": "There are coyotes in the area. I'm not sure why they let him out considering how worried they are about him.",
          "id": 151,
          "comments": [
            {
              "score": 1597,
              "content": "Some shelters will spay/neuter any animal brought in, even if their owners show up to claim them. People who let their cats outside put there cats at risk for things much worse than stolen balls. The kid's nightmares would be a lot worse if they found the cat splattered on the road.",
              "id": 152,
              "comments": [
                {
                  "score": 1406,
                  "content": "Nothing leaves my local county shelter in tact. \n\nI live on a small farm and people dump their cats on us regularly.  We catch and neuter a bunch, and then new ones show up.  Guess whose problem it becomes? \n\nSomeone who doesn't give a shit about spaying or neutering a pet shouldn't have one. And fuck breeders. All of them.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 338,
                      "content": "There's no such thing as ethical cat breeding unless it's specifically for allergies, imo. The cat overpopulation problem is utterly out of control, and so many sweet souls get euthenized each kitten season because there's just. so. many. cats.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Amen!",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 456,
                  "content": "in 32 states that is the LAW, even for rescues like OP (formal, informal, animal control etc all required by law to fix them before release- back to owners or otherwise, as I understand it?)",
                  "id": 156,
                  "comments": [
                    {
                      "score": 200,
                      "content": "I'm not sure about law, but I know the shelter that my mom got her dog from had a rule about this. \n\nThe dog was picked up, family contacted somehow, was told he needed fixed (they fix all animals before releasing) and then they could pay that fee and get him back, they said nevermind we don't want him.",
                      "id": 157,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "According to this article, the animal has to be neutered before releasing to a **NEW** owner.\n\n[https://www.animallaw.info/intro/state-spay-and-neuter-laws](https://www.animallaw.info/intro/state-spay-and-neuter-laws)",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Interesting",
                      "id": 159,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "I would double check if those laws also mandate attempting to contact the owner first",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 142,
                  "content": "The city shelters near me will spay/neuter animals that are brought in. If OP would have dropped the cat off at the shelter as a found pet, the shelter would have had him neutered. It wasn’t OPs decision to make. They should have returned it to the owners or taken to the closest animal shelter as a lost pet.",
                  "id": 161,
                  "comments": [
                    {
                      "score": 7,
                      "content": "By making the decision themselves though, OP guaranteed that the cat wouldn't be put down in a shelter. Shelters neuter, yes, but many also often have to euthanize for space -- especially cats, especially right now (kitten season). Shelter was not the best option, especially for someone who is a TNR specialist.",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 111,
                  "content": "The shelter near my house does this.  Any cat found outdoors will be picked up, fixed and released back where it was found.  They don't fuck around.",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "True, our local animal shelters refuses to release an animal until it is spayed/neutered regardless if it is owned. They’ve had owners claim pets and  be very angry about this but they do not care.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 167,
              "content": "Yup! Coyotes, raccoons, other cats, cars, bugs, infections, other people who aren’t nice, you name it. There are tons of worse things outside than getting neutered.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "To be fair, depending on how far the owners live, the cat could have sprayed on everything in your home if it took a while for the owners to come pick him up. You prevented pregnancies and protected your property. Even if you're technically in the wrong, I would say it was worth it.",
              "id": 166,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Some people truly think cats aren't happy locked inside and that it's inhumane to make them stay in. So in their minds, it's morally better to take the risk than to keep them inside.\n\nETA: I'm not one of those people so don't come at me, just explaining their mindset",
              "id": 167,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2239,
      "content": " NTA. They are irresponsible pet owners and are endangering the community by having an unneutered male cat about. It’s unethical and should be illegal.",
      "id": 168,
      "comments": [
        {
          "score": 1082,
          "content": "I am all for legally enforcing the sterilisation of animals. Unfortunately people don't generally agree.",
          "id": 169,
          "comments": [
            {
              "score": 1226,
              "content": "The owners are contributing to a crisis of unwanted animals. Screw them. They should keep their cat indoors if they don't want him rounded up with all the other strays.",
              "id": 170,
              "comments": [
                {
                  "score": 70,
                  "content": "I mean no matter how you slice it, their cat WAS a stray cat.  The had no idea where he was or any control over their animal.",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Even indoor cats should be neutered. It's got so many health benefits. My cat is a fully indoor boy, and he was done at 6 months old. I love and adore my cat, I don't want him having cancer and if I can get him the snip and reduce his chances that's fine by me.",
                  "id": 172,
                  "comments": [
                    {
                      "score": 7,
                      "content": "My 100% indoor boy was fixed when he was a kitten and lived to be 20. Time comes for us all, but he was overall a very healthy cat.",
                      "id": 173,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 273,
              "content": "I agree with you. Irresponsible owners lead to unnecessary suffering of other animals, and stray kittens. Enforcing sterilization of outdoor cats should be the rules",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "[deleted]",
              "id": 175,
              "comments": [
                {
                  "score": 3,
                  "content": "Couldn’t have said it better myself.",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "I found myself in a similar situation recently. I have a colony of about 20 feral cats outside my house that I'm working on TNR. One day, my neighbor to my left tells me that \"the orange cat\" belongs to the neighbor on my right. There's 5 orange cats, so no way for me to know for sure which one it is. But eventually I trapped all the orange cats and got them neutered, vaccinated and ear tipped. So at some point I got their cat neutered. \nIf they ever say anything to me about it, I'll just tell them \"you're welcome for getting your cat fixed and vaccinated, it cost me $30, if you want to reimburse me\" then probably go on a rant about how irresponsible they are for letting their cat outside in general, but especially with a whole colony of ferals. One of the cats tested positive for FIV. They could be exposing \"their\" cat to so many dangerous things out there. Some people are just awful pet owners. Those same people who own the orange cat tried to come into the humane society that I work at, wanting to adopt a dog. They told me they didn't have any other dogs at home. They didn't realize I live right next door and can see out my window the dog that they keep outside on a chain 24/7/365.  Anyway I got them on the \"do not adopt\" list.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "In Australia it is illegal to not get your cat over 6 months old sterilised due to stray cats killing our endangered wildlife. And rescues don’t release them until they’re sterilised. NTA",
              "id": 178,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "In my country that‘s a law. That’s why we don’t have a lot of stray cats. Thank god thid law was passend!",
              "id": 179,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "If they want him unfixed he needs to be indoors. Period. When he's having tons of kittens that becomes a community's problem.",
              "id": 180,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "It's not just unwanted kittens but diseases like FIV and FELV. An unneutered tom attacked a woman's neutered female cat in her garden, and now the female cat has FELV and is starting to decline in health. It's so cruel.\n\nWe are seeing an increase in FIV and FELV.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "that would be amazing if we could get something like this rolling.",
              "id": 182,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Honestly, in your situation, I would have paid for the neutering and left the clinic to deal with the owners.\n\nYou did your part, just ignore them.\n\nHow did they find your Facebook?\n\nBlock on everything. They are bad owners who are contributing to the number of feral kittens killed on the roads every day, the world does not need more feral cats.",
              "id": 183,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 505,
          "content": "My neighborhood is overrun with feral cats. A guy who lives maybe a half mile away has an intact indoor/outdoor cat who roams free. We have at least a dozen feral cats in my neighborhood now that look just like that guy’s pet. Three ladies spend ridiculous amounts of time and money catching the feral cats and having them spade/neutered. (The vet notches an ear of the fixed cats so the volunteers know not to catch the same feral cats repeatedly.) But the problem persists because the original cat owner has no problem with what his pet is doing and has no care for the problems feral cats cause. We’re probably about to see yet another litter of fuzzy gray kittens any day now.",
          "id": 184,
          "comments": [
            {
              "score": 246,
              "content": "Same here. Our neighbor is a nice guy and laughs about \"old Tom\" but it's not funny in the least, and his place is overrun with inbred cats who scare away our birds and rabbits and defecate in my garden. If they come on our property we trap them and taken them to the pound. But this has been going on for years with no end in sight.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 170,
              "content": "Anyone saying she's an AH has never thought out the logic of where feral cats come from, and learned about how awful their lives are. The owner is an AH for letting their cat breed like crazy. Of course there's a million orange kittens running around, he's probably the great-grandfather, grandfather, and father (all at the same time) to half of them",
              "id": 186,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "This should be illegal everywhere. It is in my city.",
              "id": 187,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "I think it’s time for you to take a page out of OP’s book.  😂",
              "id": 188,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 263,
          "content": "Agreed. NTA - I’m shocked at the people saying otherwise. The cat’s owners weren’t taking responsibility for their cat or the kittens that their cat made. \n\nSo many people are worried about this cat losing his balls, but how many of his kittens will lose their lives because of the owner’s negligence? \n\nIf they actually gave a shit about that poor animal, he wouldn’t be outside in an area with coyotes or cars. He wasn’t on their property, or under their supervision, he was with a bunch of strays. They’re lucky he’s still alive.",
          "id": 189,
          "comments": [
            {
              "score": 19,
              "content": "Yeah all of the YTAs are people who have never worked in animal rescue, and never seen the sheer amount of suffering that is caused to kittens and mama cats from not fixing them. I would have probably done it in a way that didn't tie me to the operation though.\n\nIf your cat is outside and contributing to a colony in the neighborhood, you have no right to decide it keeps it's reproductive ability. For the good of the ecosystem and to prevent suffering and the spread of diseases, he needed to be fixed. God only knows if he has his vaccines up to date of they won't even fix him.",
              "id": 190,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I'm not shocked. Some outside cat owners have a particular entitlement and do not care about the damage their supposed pet creates (I say supposed because why on earth would you risk letting it get hit by a car, etc if you cared for it).",
              "id": 191,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "I seriously wonder how different the consensus would be if most people got a glimpse of how rough feral cats have it.\n\nOnly about 25% of feral kittens survive past 6 months. I fostered kittens for a T&R program for years, and witnessed horrible infections, abscesses, kittens overloaded with parasites, and have had kittens die in my arms from panleukopenia (basically parvo in cats — unfortunately pretty common in feral populations.)\n\nAt this point I simply have zero sympathy for anyone out there allowing their unfixed cat to free range.",
          "id": 192,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "It's irresponsible and endangering to allow cats about.\n\nThe amount of birds they kill annually is unacceptable.\n\nIf you can keep it in your yard fine. But the world isn't your backyard.\nKeep your dogs and cats curbed. The entitlement and audacity of people is astounding.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Agreed. The owners feelings are the lowest priority to me in this situation.",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Agree\n\nnta",
          "id": 195,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1214,
      "content": "Nta bc op says this Tom is out making kittens, meaning he didn't escape one day by accident.  His owners are letting him out, intact, and not taking care of the kittens he is fathering.  They are contributing to the stray cat problem.",
      "id": 196,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1083,
      "content": "Like your not right but personally I think NTA. I agree with what you did. Pets shouldn’t be outdoor animals and he was creating more cats and adding to the problem. They were irresponsible. You corrected an issue",
      "id": 197,
      "comments": [
        {
          "score": 202,
          "content": "Agreed. If I was stupid enough to have a cat and let it go outside not fixed, I wouldn't be mad if someone fixed it for me. If anything the owners were probably worried he was gonna charge them for the procedure. There are so so many without homes and dying on the streets. No one needs an outside cat. Keep them inside where it's safe and warm",
          "id": 198,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 153,
          "content": "I do TNR for a local colony as well with some other folks. Intact cat hits our trap, it’s getting fixed. Owners are not only irresponsible, they are going to end up with a much happier animal. Males get barbs on their penises that are not comfortable to cause ovulation in females in heat. And females in heat will not ovulate without sex. They aren’t just roaming for mates because they just like having sex. They’re genuinely uncomfortable. \n\nThrow the cat population problem on top of that and, yeah, collar or not, an intact cat isn’t going to be if they get into our traps.",
          "id": 199,
          "comments": [
            {
              "score": 16,
              "content": "Not to mention cats going in heat makes it more likely to get cancer",
              "id": 200,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "I think OP is an asshole, but sometimes being an asshole is the right thing to do.",
          "id": 201,
          "comments": [
            {
              "score": 9,
              "content": "Amen.",
              "id": 202,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I don't think OP is the asshole, but what they did is TECHNICALLY not the \"right\" thing to do (aka, the \"right\" thing to do would be to call the owner). Neutering the animal was not an asshole move.",
              "id": 203,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 923,
      "content": "Free roaming cat = feral cat.\n\nNTA, thank you for your service.",
      "id": 204,
      "comments": [
        {
          "score": 246,
          "content": "Yeah honestly was it an asshole thing to do? Yeah I guess but the owners are way bigger assholes and with what OPs doing - all the costs, time and efforts it would be incredibly taxing to her, the environment and the cat population to not get the cat neutered. She would’ve just kept returning to the area because of all the kittens this cat is fathering. The owners are terrible owners for not only letting their cat free roam (which should be illegal and cats should be subject to the same rules as dogs - supervised and leashed) but they are letting a unaltered male free roam like how selfish, ignorant and irresponsible can you be? They shouldn’t have a cat.",
          "id": 205,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 183,
          "content": "That's not what feral means. Feral is an unsocialized cat that can't or doesn't know how to be around people. Free-roaming cats can be feral, but this one was clearly socialized with humans, so under no circumstance is feral. Let's not spread misinformation here.\n\nI honestly agree with OP from a moral standpoint, but it unfortunately wasn't their choice to make, and I wonder if they will face any liability issues should the cat's owners look into that route.",
          "id": 206,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I don't think that word means what you think it means.",
          "id": 207,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 671,
      "content": "YTA. You knew how to get ahold of the owners from the first moment you grabbed the cat. You kidnapped him and had irreversible surgery done on him. \n\nYes, I know the owners were irresponsible about letting their intact cat out, but you could have educated them when you contacted them about their cat you picked up. But there is no law against what they did. Against what you did, yes. \n\nYou risked your entire TNR program over this.",
      "id": 208,
      "comments": [
        {
          "score": 427,
          "content": "If she lives in one of the 32 states that have laws that require exactly this course of action, she endangered it by NOT doing exactly what she did...so?",
          "id": 209,
          "comments": [
            {
              "score": 461,
              "content": "Yeah. I'm going to trust the vet's judgement on this. The vet surely knew all applicable state laws and acted accordingly. People acting like male cats getting their balls chopped is in any way barbaric haven't had to live with an adult cat with his balls. And that cat will probably spray for the rest of his days because the process was so delayed.",
              "id": 210,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "If she lived in one of those states, I'm pretty sure she would have said so. And if she were acting on a legal mandate, her colleague wouldn't be side-eyeing her right now; it would just be...what they do as part of the job.",
              "id": 211,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "The catch is OP’s rescue partner said they were wrong and there’s tension. That doesn’t make it seem like they’re in one of those 32 states or aren’t liable.",
              "id": 212,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I have a feeling that any attempts at ‘education’ would have been met with a spit in the face and the cat being back out not even an hour later.",
          "id": 213,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 501,
      "content": "NTA.  Why even tell the owners Big Red got the snip snip? If they weren’t planning to breed him they never would have noticed, what with his long hair and their general negligence. He’ll live longer but it won t stop him from spraying.",
      "id": 214,
      "comments": [
        {
          "score": 434,
          "content": "He got a lil trim back there lol. It was noticeable. Dude is freakin fluffy.\n\nBut, tbh, I would have told them regardless. It can fuck with future vet care if they dont know.",
          "id": 215,
          "comments": [
            {
              "score": 65,
              "content": "LOL he's a little less fluffy now.",
              "id": 216,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 19,
              "content": ">It can fuck with future vet care if they dont know.\n\nSort of like having a cat unfamiliar to you anaesthetized and operated on without his owners' input and consent?",
              "id": 217,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}