{
  "post content": "My son (4) had a sleepover last night with a friend. This friend's parents were doing my wife and I a huge favor, because my wife's father had surgery yesterday, and we needed to be there and didn't get home until after midnight. So yes, this story begins with us already in debt to them. Anyway, at naptime today my son started freaking out because he couldn't find sleepy Dumbo (his stuffed animal) and he *cannot* sleep without sleepy Dumbo.\n\nI remembered that when I picked him up I didn't see sleepy Dumbo. So I text the mom and dad of the friend. I get no response. My wife is a wreck, so I'm not bothering her with this, but my son is freaking out. So I tell him we will get in the car and go get sleepy Dumbo and he slightly calmed down. So we drive over and I try to call them both on the way.\n\nWhen we get there, I knock, and we wait a bit with no answer. At this point my son starts freaking out more because he is afraid something happened to sleepy Dumbo. I try to reassure him, but he starts crying. I knock again, and the wife of the couple answers. She says she is working and asks what I want. I explain about sleepy Dumbo.\n\nShe again says she is working, and she says she doesn't have time to look for Dumbo and tells us to come back later. My son starts freaking out more. I ask if we can look. She says she needs to focus. I promise to be fast. She lets me in.\n\nWe get to his friend's room, sleepy Dumbo is on the bed. My son gets him, and I hustle us out. I thank the mom, but she is glaring at me. On the way home he hugs sleepy Dumbo the whole time. I remind him to be more careful with sleepy Dumbo in the future, and at home naptime commences peacefully.\n\nAbout an hour ago my wife and I both got this text. I'm going to copy paste it:\n\n{Me} and {my wife} I really don't appreciate the way {me} barged into my house earlier today while I was working. I know you both have a lot going on right now but the world doesn't revolve around you. {Her husband} and I agreed to do you a favor but that doesn't mean you get to just walk all over us. In the future if you call and we don't answer that means it isn't a good time to come over.\n\nI felt very embarrassed and guilty after reading that. My wife, however, is furious. She called the wife of the other couple some indelicate names. I am really grateful to them for agreeing to babysit for us, and I accept that I am to blame for forgetting sleepy Dumbo the first time. I don't know if asking to come in and get him is quite as big a deal as she's making it out though, and my wife is pissed. I don't know how much of that is misplaced fear for her dad though. Am I an asshole, or was this just an unfortunate situation?",
  "id": 1,
  "comments": [
    {
      "score": 9464,
      "content": "[deleted]",
      "id": 2,
      "comments": [
        {
          "score": 8135,
          "content": "Plus always have a spare incase this happens, but at 4 I feel like kids should understand sometimes they can’t get it right away, I know my son at 3 would get really upset he didn’t have his special stuffy but understood and we got him a replacement from his closet",
          "id": 3,
          "comments": [
            {
              "score": 3049,
              "content": "Or just skip the nap that day if kid absolutely won't go to sleep...",
              "id": 4,
              "comments": [
                {
                  "score": 800,
                  "content": "Or even that, my oldest and most kids I know stopped napping at 2/3 unless they really need one. Yelling at the parents who did a huge favour was to much",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1099,
                      "content": "Who yelled at the parents? No one yelled",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 575,
                      "content": "I never stopped napping lol",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Uh, what? Everyone thought my firstborn was off for stopping naps by 3. Even in Pre-K, she was one of two kids that didn’t nap- all of the other 4/5 year olds still napped. \n\nBut yeah, barging into the friends home over a stuffy that the kids simply “cannot” sleep without is a bit much.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1095,
              "content": "From ages 1-4 my daughter had a stuffed unicorn( she called it corn, it was hilarious) she HAD TO have with her at all times. At 2ish it was looking a bit rough and one day I found the tiniest lil hole in a seam. Went online and bought two back ups IMMEDIATELY. I was never going to deal with the hell of missing corn",
              "id": 9,
              "comments": [
                {
                  "score": 459,
                  "content": "We have Duchess Theodora Beatrice the bear. I gave her the lofty title because I’m a peasant in comparison. She has her own chair at dinner. She’s my toddlers lady in waiting.  I would invade another country if she was missing from nap time. To just not deal at that point (she’s two and a tyrant)",
                  "id": 10,
                  "comments": [
                    {
                      "score": 38,
                      "content": "> She’s my toddlers lady in waiting. I would invade another country if she was missing from nap time.\n\nYes but you're not coming into my house at a time that doesn't work for me. We all understand how attached kids get to their special toys - let's be honest, most of us *were* that kid once - but it's still nont necessarily a priority for anyone else to drop everything when your child can't find their toy.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 37,
                      "content": "Duchess Theodora Beatrice (The Bear) having her own chair sounds like she should have a throne.\n\nIs the chair the same size as her or just a regular chair sitting your table?\n\nThe plebeians (me) wish to know.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "My oldest is 21 and I would invade a country for “bunny boy”. That thing was with us through everything. Bunny boy is family.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "A toddler’s lady in waiting! Hilarious.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I personally have a Theodore as well. \n\nI'm 35.",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "[removed]",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "Duchess Theodora BEARtrice\n\nFtfy",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "We had the Fisher Price Laugh and Learn dog in 2007. That ultimately ended up in us having 8 \"talkie dogs\" for my son (bc his parents are scatterbrained idiots and were really good at forgetting them on trips do there were a lot of midnight Walmart runs for replacements on trips.) His bed was quite crowded. And at 16, he still has one in his room. Doesn't sleep with it anymore, but it's nearby on a shelf. From the looks of it, it's the original one.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 126,
                  "content": "Oh yeah from ages 1-4 (before he got obsessed with a certain YouTube channels plush line) he had lucky from 101 Dalmatian’s but he called them Big wa wa and little wa wa and before he wanted both at all times one was to stay at home and one to go to grandmas and aunties and if he forgot both of them it was a nightmare but he also understood they would drop it off as soon as possible (especially if I could give him a time frame)",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 98,
                  "content": "My daughter at 2 is obsessed with “da dog” luckily for us she had multiple stuffed dogs she is obsessed with or else hell would have been paid when we left the original “da dog” at my in laws house two hours away. She still prefers her first da dog but definitely now loves them all.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 5,
                      "content": "What da dog doin",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Our female long haired chihuahua has a small stuffed zebra that she would flip over, turn around, and hump from behind. We named it...Humpy, for obvious reasons. Humping Humpy was her favorite pastime and among our most prized party tricks, because she was not trying to keep that relationship private *at all.* \n\nOnce, 7 years ago, we stayed at an airbnb in New Hampshire for a wedding and when we got back to Brooklyn, realized we had left Humpy behind. I tried other zebras, other similarly sized stuffies, stuffies with a mane she could bite, nothing would work. After a week, I had to email the airbnb host and explain my dog's very, um, special friend had been left behind and I know this is unorthodox, but can they please mail it?\n\nThey did, post haste, with 5 Hersheys kisses (for me). \n\nShe is now 10 and still humping away. \n\nThe world needs more people that understand the importance of a comfort object.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "My mom never fails to tell people about how when I was a child I had a stuffed cat I named Bubba. since I moved around constantly to two different grandmas houses and had naps everyday in preschool, I had 4 Bubbas. One at home, one at each grandmas house, and a school Bubba. She bought four of them so the disaster of being Bubba-less would never occur. I still have all four, but they live in my closet now. Can’t bring myself to get rid of them.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 8,
                      "content": "And you should never have to",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Lol, my longtime friend's daughter has a unicorn named corn, too. She's almost 4 now, but her and her twin sister both have lovies with cute names. I am now reminded I need to get my 20mo son backups of his favorites too so I don't suffer in the future lol.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I went in the other direction. I never let them sleep with the same toy two nights in a row so they didn't get overly attached to one. I probably screwed them up for life, never being able to form emotional bonds.",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "I had a stuffed rabbit growing up and after one mishap my parents ended up ordering spares. They’re still floating around the house- when I left for college I was looking for mine and my dad pulled out a brand new one and tried to play it off like it was my lucky. Turns out my lucky had been replaced long ago and I had been using one of the spares ever since. \n\nI did find the one I was looking for and at 24 he is still with me.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I gave my niece a plushie of Skye from paw patrol years ago and she still sleeps with it and shows it to me whenever i visit! Shes kept it in such good condition it's insane.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "My brother had a stuffed dog called woof woof, then at some point, my sister ended up with him, he went on holiday once we spent days looking for him, called all our family and friends to see if they had him no luck, we were sitting outside eating lunch once and mum had given the dog a bone and we saw her burry the bone then we had a thought so my brother and I had to dig up all yard looking for him, we found him, he had a bath and the next day he was home from holiday. We had no idea who gave us him and couldn't find spares",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "My first kid's The Toy was a handmade cow (called Moo) he got as a gift when he was born. First time it got lost I bought another cow stuffie, nowhere near the same, but I told it was the original cow's cousin that came to keep us company while the original was on a vacation.\n\nMy second kid luckily chose a very generic grey cat toy (called Meow. Not too imaginative names lol). In the end we had like five of those. And then ended up getting a real grey cat.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1025,
              "content": "Pro tip: rotate the spares into use so the stuffies wear evenly. We pulled out our spare stuffed tiger one day for my son, and he was so excited that we had \"found\" Hobbes until he got ahold of him. Then it was a disappointed and suspicious \"WRONG HOBBES, MOMMY,\" because the stuffing wasn't lumpy and the whiskers were all fresh and fluffy.",
              "id": 31,
              "comments": [
                {
                  "score": 159,
                  "content": "My in laws told me to get an extra blanket/stuffy thing for when my daughters in the wash. Well her birthday they went it’s ok we got her one!, it was a giraffe….She absolutely did not appreciate it and wanted Mr.Elephant",
                  "id": 32,
                  "comments": [
                    {
                      "score": 28,
                      "content": "When the treasured item is revealed, you must purchase the exact same item as a stand in.",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "You missed the point.  The ‘extra’ is supposed to be exactly the same item.",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "She knew giraffe had a gambling problem",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 122,
                  "content": "Is your son named Calvin, by any chance?",
                  "id": 36,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Got lost playing Calvinball",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "We had a similar situation with Big Hoo, our daughters stuffed owl. He was hit by a car and destroyed. So he had to go to the Owl hospital. When he came back, he was all fluffy and shiny. She took to him like a duck to water becauae the whole \"owl hospital\" conversation.\nThe things we do for our babies...",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Tried this with our Corn… she originally started with 2, tried to mix in #3 who was new and clean. He was deemed “Yucky Corn”.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "omg 100% me. i'm 23 and didn't ever get rid of my \"käthen\" - kind of blankeys with soft heads. they don't produce them anymore but one only lasts a few years before getting holes. and the newer ones FEEL WRONG. so i bought like 3 old ones when i got a hold of them. (send help)",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "“Mom, dad, stop the car we forgot Hobbes!” was a common refrain on our road trips. We named our dog Hobbes so there was an added bit of mischief in that my mom didn’t read the comics and often forgot we were just making a reference to Calvin and Hobbes.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Of course Calvin didn’t want THAT Hobbes. It probably didn’t come to life when you or his Dad weren’t around.\n\nSay hi to little Spacemen Spiff!",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Learned that from watching my SIL and my nephew. He had Henry the bear. Henry had a backup and she learned to rotate them. At some point, he didn’t care, so long as he had a Henry, who was with him all the time. My sweet little nephew will be 16 this year so I’m sure he’ll be more attached to the car keys but I’m sure the Henrys are still in the closet. My ph",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Helps to wash them together, too. When one gets washed, they all get washed.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "THIS!!! My middle kid got a blanket when they were 2, they LOVES this thing, I could tell after a week they were ALWAYS going to love it. I jumped on to the site and bought 3 more. We have 3 that we try to rotate on a regular basis and 1 saved for when they have kids of their own or if they want it for sentimental reasons later on. It's been almost 5 years, we've yet to lose one, but one got left once and thank God I had spares as it had to be shipped.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 249,
              "content": "I didn't have my stuffy when I was at my dad's house one night, and he made a makeshift \"teddy bear\" out of clean socks and promised we'd get my stuffy the next day. That was enough for 5 year old me.",
              "id": 46,
              "comments": [
                {
                  "score": 65,
                  "content": "Exactly! I don’t know how many times the stuffy was even missing in my own house I tell him it’ll be with him when he wakes up",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "My daughter had to have her stuffed bread with her when she went to bed. One weekend when her mom dropped her off with me for the weekend she didn't bring it with her.\n\nAfter a short conversation I convinced her that her bear at home was safe and well but the stuffed lion that we had here needed to be kept safe and we never had an issue again.\n\nShe is 16 now and still has the bear at home with her mom and the lion on the shelf in her bedroom with me.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "That is freaking adorable. Now I want a sock teddy bear.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 4,
                      "content": "It was really creative; like one of the towel animals you see in some hotels.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 220,
              "content": "Oh yeah. My son is 23 but has profound developmental delays, so there is no understanding. He sleeps with the same toy for over 15 years now. I currently have 3 of them. The toy has been discontinued for over 10 years but I'm able to find it on ebay or mercari sometimes & I snatch it up every time.",
              "id": 51,
              "comments": [
                {
                  "score": 87,
                  "content": "I know some redditors have been able to put out calls here on Reddit and use it’s reach to find other sources of sippy cups and discontinued toys for their kids who have different needs like your child. \n\nThere are so many of us out here who understand the need to have very particular items that are “just so” either for ourselves or for our loved ones or just because we can understand it on a human level. \n\nIf you can think of it there is undoubtedly a Reddit for it, all you need to is ask and someone will help you find it!\n\nr/findareddit",
                  "id": 52,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Aw, thanks for the info! I am also in a group like that on Facebook. I am going to join this sub though because I have many things that someone else might be looking for as well.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I think r/helpmefind is what you’re looking for!",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 218,
              "content": "My friend has 3 for her kid.\n\nOne for home, One for going out and a spare hidden away.\n\nHer husband tends to be a tiny bit forgetful or theres a blackhole following him.\n\nYou can put the tv remote in his hands and 1 min later he can't find the remote again.",
              "id": 55,
              "comments": [
                {
                  "score": 254,
                  "content": "I don't have human kids, but each cat ended up picking a \"special\" toy they can't live without. When Artemis was tiny we had a section of our place flood. Her favorite toy got covered in nasty rainwater and didn't do well getting washed. She looked for her \"sheepie\" for three days before I was able to get another. We always have several on hand because even at 11 she loves sleeping with it, wrapping her paws around it and reading her face on it.\n\nFor Apollo it's a stuffed owl and I really have to find another one because they don't last forever. Especially since he drags it around the house. One time he lost it and threw a fit. We couldn't figure out what was wrong, they had food and water and the box had been done less than an hour before. But I found the owl where a box had been set on it accidentally. When I pulled it out he got all excited and wanted it!",
                  "id": 56,
                  "comments": [
                    {
                      "score": 62,
                      "content": "My blue heeler had a sherpa pillow bed thing when he was a pup. He would knead a certain spot, then suckle on it. It was the cutest thing. As he got bigger, he started dragging the bed around with him, and it started to look pretty beaten up. The stuffing started to fall out of a few holes, and his bed turned into a blanket. He still kneads and suckles on it, and it still goes everywhere with him. I started calling it his \"nookie\" and the name stuck. I really do not know where that came from or why, but I found out that the kneading and suckling behavior is in fact called \"nooking\"!",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Omg same! It was blue mousey or snakey for my one cat who passed a few months ago. Both blue mousey and snakey had been pulled from the dogs mouth multiple times and had stuffing coming out, but he loved them anyway. They now sit with his ashes. For my other cat, it’s yellow or pink mousey or lamby. She gives them to us as gifts. In our shoes, under our blankets, on our pillows, etc. I have totally hunted for replacements online of all of the above said toys and could never find them again. I don’t even know where the originals came from. Therefore, I have even fished their favorite toys out of the vacuum when they’ve accidentally gotten sucked up and given them back to the waiting cat. That’s proof that you don’t own a cat, a cat owns you lol",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "My son's cat Gray has a favorite toy mouse. We've bought him a couple others, but he prefers his first, which is all beat up and doesn't squeak anymore. The funny thing is, he keeps up with it. Even if it vanishes for a little while, next thing you know he's walking around with it in his mouth.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 52,
                  "content": "We got a spare for my son's teddy, and he knew the second he got it that it wasn't his teddy. His looked like a toddler hadn't let go of it for his 3 years of life and the new one looked new. We found real teddy and now we have new fake teddy put away for when he has a kid.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 119,
                      "content": "Yeah, I think the trick is introducing the spare early. It's not a replacement...its just a extra teddy sibling.\n\n\"This teddy likes to stay home\", but \"this teddy likes outdoors\" kind of thing. \n\nShe's only 2 but she I think she understands the concept and is willing to nap with either.\n\nKids will understand so much, it suprised me sometimes.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Can’t spell dad without ADD.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "My kid changes their favorite stuffy all the time. We do not have replacements in the closet. \nBut we are careful to pick up xyz stuffy from preschool, and once in a while it is forgotten. There’s no picking it up. Preschool is closed. the teachers are not there. Stuffy is having a sleepover in the cubby and that’s that. Meltdown ensues but there’s no solution other than to pick a different stuffy and snuggle mommy or daddy. \n\nShowing up at somebody’s house when they don’t answer and then insisting to come in is rude. I know, OP, it felt like an emergency. Instead of reacting to the meltdown, respond to the situation and start teaching coping skills which will last a lifetime.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "To be fair you can’t ALWAYS have a spare. You never know what a child can be attached too. I never knew how much my kids would LOVE these blankets from some random friends of my MIL and they don’t even remember where they got them. There’s been a couple instances like that. I also have a Pac-Man light I was going to get double of but the store I got it from already rotated it out and they don’t sell online..",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I'm not a parent, but it seems like that would've been a really good opportunity to teach the kid that you need to respect other peoples' time. Instead he taught him that it's ok to demand what you want regardless of another person's needs.",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 845,
          "content": "I don’t expect people to be on their phone 24/7 so no reply or answer does not scream ‘not available’ to me, just that they are not using their phone right now.\n\nI can be available to open the door while not replying to a text or a call because I left my phone charging somewhere or whatever while having lunch or working etc.. My phone is on silent 90% of the time so I would have missed it entirely.\n\nDropping by to see if I am home is no problem (IDK why a lot of people think that is a problem and would love an explanation) and if I was really unavailable due to work or otherwise I would not have answered the door.\n\nWhere it goes to AH territory for me is when insisting even after explaining so verdict to OP is YTA and to apologize. EDIT: So here I am agreeing with everyone that OP went to far with keeping to knock after a first try and insisting on coming inside etc.\n\nI just don’t understand why everyone is so upset by people dropping by their houses?",
          "id": 66,
          "comments": [
            {
              "score": 928,
              "content": "He knocked and she didn't answer, then he kept knocking. she is sending lots of messages that she's unavailable and he keeps persisting. \n\nAlso - he is also dropping on on her work, because she works from home. Dropping by, or even calling persistently, during someone's work hours is a bit more intrusive than swinging by someone's house.",
              "id": 67,
              "comments": [
                {
                  "score": 550,
                  "content": "Yeah sleepy Dumbo is not more important than this person's job.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Also plenty of other parents above saying...you should probably get about 10 spares of sleepy dumbo, or teach your kid that sometimes shit happens. I can't believe the audacity of barging in/bothering someone while they work. Then they say please come back later and you say no. For a damn TOY. We're comparing a livelihood and a toy.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Exactly, the title of this post is wrong, it should be \"AITA for bothering a woman **at work**\" ... just because she works from home doesn't mean she has time to deal with a tantrum (either from you or your kid).",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "And beyond that, we don’t know how long he gave them to respond before just showing up. It could have been only an hour since he sent the first text and when he showed up at her door! I would imagine so since he seems really concerned about getting the toy so his son doesn’t miss nap time. All of these people saying “it takes a minute to respond to a text.” Maybe she didn’t get a chance to? Work from home doesn’t mean she isn’t busy and she has loads of free time. My therapist still takes sessions from her home via Telehealth, so I could only imagine how annoying it would be if from the time our session started someone was texting, calling, and eventually just showing up at her door.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Yup.\n\nIt really drives me crazy when people don't realize that I am working when I work from home. It is not my free time, it isn't social time, you absolutely cannot come over. For all you know I might be in a meeting!\n\nI don't want anyone to come over unannounced just to see if I'm home but if you are going to do that you need to come outside of the work day, and you need to take no for an answer.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 657,
              "content": ">I just don’t understand why everyone is so upset by people dropping by their houses?\n\nI absolutely hate people dropping by without me giving the OK first.  In fact I had a boyfriend who used to do this and I had to have a serious talk with him to make him stop doing it.  It's just horrible, I might be asleep, or undressed, the house might be a mess, I might not want to deal with anyone and suddenly there is someone right there imposing on me unexpectedly.  My home is a sanctuary, not a drop-in centre.",
              "id": 73,
              "comments": [
                {
                  "score": 129,
                  "content": "Exactly this. And people who don't think it's a big deal to drop by will never understand. I'm very introverted and had an extremely rough childhood. My house growing up was a war zone. Because of that, I've turned my home now into my safe place. I'm not the hang out house, the hosting house, or the party place. My home is MY space. I do not like having others in it, especially unannounced others. It messes with my whole day. If you've never experienced your current home being your ONLY safe space, ever in your life, you're not gonna understand why it's such a big deal.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Wow, did that ever resonate!  Now I suddenly know why I hate people dropping by.  Thank you.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I call it my Fortress of Solitude. Superman had the right idea.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "Especially with working from home being so common right now. Literally interrupting someone at work.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Exactly.   I work from home.   When I'm busy at my desk, and my SO pops in the office door to just ask \"can you help me find X real quick, then I'll leave you alone\".    Too f'ing late, you've already interrupted me, my train of thought, any chats I was involved with online, etc.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I’m a licensed therapist who works from home. When I’m working, I’m in a conversation I have to legally protect! I’m sure others have similar situations.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "Same. Back in the day before we had cell phones and texting, I get dropping by was probably more common and acceptable. But in todays modern age with all the forms of communication available to us there is absolutely no reason to show up to someone’s house without giving them a heads up.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Same. I don't even answer the door if I'm not expecting someone. I have the additional factor of being autistic and unexpected visitors send me into a tailspin of stress and anxiety",
                  "id": 81,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Bingo. A knock on the door says \"I'm out here and would like to speak to you if you're not too busy and if you feel like it. If not, okay, I'll go away.\"\n\nAnswer the door when and if you feel like it. And never feel bad or guilty for not answering it.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Dropping by unannounced is rude, IMHO, unless it's an emergency.    It forces the \"visitee\" to either ignore the knocks on the door and hope they go away, or drop whatever they're doing to deal with unplanned visitors.   It's an intrusion, plain and simple.   Maybe some people are fine with an open-door policy, but clearly plenty of people are \\*not\\* fine with it.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "My home is my safe space from the world. I agree that I absolutely hate when people randomly drop by without warning, and I'm equally unhappy when I make plans with someone to come over and they just don't show up.  \nThere's a lot of mental prep work that goes into socializing with other people if they're coming into a space where your social switch is usually \"off.\"  \n\nMine is off 99% of the time at home. And I need that time to recharge because a lot of my job is dealing with people.  \n\nSo if you're an introvert or an extroverted introvert(which is what I am, I get it. We need our alone time.)\n\nSo, YTA. She said no, you barged into her home anyway. If that's how you act on a normal basis(pushing your way through and stomping all over people's boundaries), I'd never do another favor for you again.",
                  "id": 84,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "Same here. I have a male friend (I’m female) who years ago decided to drop by. It was a sunny day warm day and I’m outside washing my big dog in my big washtub. I’m in a white t-shirt and braless. It was embarrassing.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Yep, barring work related issues, people barging in uninvited makes me feel very unsafe. People are different, and it is good to err on the side of caution",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Also “dropping by” is a holdover from pre-cellphone days. Sometimes necessary when you couldn’t get to a phone - no longer needed.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I’m the same way. Idk if it’s my introversion or my ADHD (transitioning between relaxing on my own to dealing with an unexpected visitor is extremely jarring) or both.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 306,
              "content": "Where I live dropping by is considered super rude as people inside may be busy (working, showering, fucking, being seconds from going out) so calling beforehand is common courtesy.\n\nI live in a flat, if I'm home and someone rings I look out and answer if it's a truck or the postman, anyone else gets ignored. \nIf someone rings on my actual doorbell and it's not a neighbor I'm not opening.",
              "id": 89,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 240,
              "content": "People's houses are their safe place. You call before just showing up, otherwise is just rude. And after you tried once and there is no answer, that's your sign that 1) they're not in,  2) they can't answer the door or 3) they don't want to answer the door.\n\nThe only people that ever knock on people's door out of the blue are either salespeople or \"missionaries\", neither are exactly welcome. The other option is the mailman delivering a parcel, but usually people are counting on it.",
              "id": 90,
              "comments": [
                {
                  "score": 29,
                  "content": "I have always held the belief that  *I decide when I am 'home'.*  \nI've had friends of 25 years just drop by, and I did not answer the door when they knocked.    \nCar in the driveway, lights on in the house.  If I don't want to have visitors, I won't answer.  \n\\*\\*A close friend once asked me \"I stopped by the other day.  Were you there?\"  \nI said \"Yep.\"  He just nodded.  He got it.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Or people who were alive in the 20th century.  Back when dropping in on people was a huge part of being social.\n\nBut, yeah, even then, if people didn't answer teh first time you knocked, you went home.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "This, exactly. \"I dOnT UnDeRsTaNd PeOpLE bEiNg uPsEt By SoMeOnE cOMiNg By ThEiR hOuSe UnExPeCtEdLy\". 😒. Because it's RUDE.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 181,
              "content": "It is disruptive to be in a work call/meeting/task and have a doorbell ring or knocking. Hopefully she doesn't have a dog like mine who barks like crazy when the doorbell is rung.  And many would either answer the door assuming it's important or because they don't want more doorbell ringing/knocking.\n\nSo yes, it isn't polite to randomly show up to someone's house when they're working just because they haven't answered your calls within a short time frame.",
              "id": 94,
              "comments": [
                {
                  "score": 11,
                  "content": "I have a sign on my front door that says, verbatim, \"sleeping baby and protective dogs inside. DO NOT knock or ring the doorbell. Thank you.\" It seems to baffle people. \"But then how do I get your attention?\" You don't. If I'm expecting you, I will have already asked you to text me when you arrived, so I could meet you at the door. If not? You weren't expected, and I'm not responding to you. I can't tell you the number of times I've had to open the door, the sounds of 3 barking dogs and a crying baby behind me, simply to cut off their spiel and point to the sign. Then I inform them they are not welcome back, I do not need to be sold anything or converted to anything, and if they return, the police will be contacted and I will be filing a report for trespassing and harassment, because they've now been informed they are not allowed on my property. It's amazing how fast it sinks in when there's a firm boundary.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Heck, even delivery people have mostly stopped ringing doorbells when they drop packages, thankfully, at least in my area.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 171,
              "content": "[deleted]",
              "id": 97,
              "comments": [
                {
                  "score": 32,
                  "content": "This right here. My very best friend who lives within a mile from us has my garage code. She texted me one day asking to drop off something and though I saw a message come through, I didn’t have chance to read it because my husband and I were having a pretty emotional conversation (tears were present). She decided to drop by anyway and open the garage to make the drop  which surprised and scared the hell out of us and kind of killed the moment we were having.\n\nDo not assume you can come over without explicit permission! You never know what’s going on in someone else’s home life.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Like how is me not answering my phone or replying to a text NOT indicating I am unavailable? That is legitimately the definition of not available. If I am not available to answer a text or a phone call then why would I be available for you to come to my house??",
                  "id": 99,
                  "comments": [
                    {
                      "score": 9,
                      "content": "My sister may not respond to texts for hours or days on end. She's not busy the whole time, just doesn't pay attention or carry her phone around with her.  If she doesn't answer I may assume she's not home and stop by to drop something off (on the porch) but not to go in.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "My phone is on silent 99% of the time. If I don't answer, well, I'm probably still not doing shit and they could totally stop by.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Yeah, it depends on knowing the person’s phone habits. If you don’t know them well enough, it’s not a call you can make.",
                      "id": 102,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Not necessarily true. If I'm out back, working in my garden for instance, I'm happy to stop and chat with friends or visitors, I just don't have my phone on me, and with a lot of dirt/sweat on me that I don't want to get on my phone.",
                  "id": 103,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "Because dropping by without calling, at least where I live, is one of the rudest things you can do. Our homes are our private personal space. I want to know ahead of time about allowing people into it, period. I also want the chance to choose whether to let them come over or not, it might not be a good time if they just drop in.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "People don’t do that unexpectedly anymore. I’m not sure when it happened but it’s definitely a thing",
              "id": 105,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "It seems to vary from area to area.   \n\n\nI see a lot of threads on here where people agree that it's rude to drop by a house.  I'm in Scotland - it seems to be more acceptable here. Nevertheless, it varies from area to area.   \n\n\nMy late husband moved from the north to central Scotland and he remarked upon the difference - where he stayed previously, you could just drop in for a cuppa, no bother at all; when he moved to central Scotland, there was more of an expectation that people needed to be given warning that you were coming.   \n\n\nThe only times that I ever heard of consternation from DH's area were the stories  about  the Royals just dropping in on folk who lived around the  estate.  The Queen Mother was known to do that when she was hale and hearty.   \n\n\nI'll not reiterate all the stories here, but one of DH's school chums worked on the estate all his working life - so long that he got TWO long-service medals. He never married, and lived with his widowed mother. In the course of his work, he quite frequently saw a certain member of the Royal family.  \n\n\nLatterly, his mum developed dementia. One day, DH's pal got home to find his mum blithely saying: \"There's someone in the sitting room for you.\"  \n\n\nWhen he went through, he discovered Prince Charles sitting there with a cup of tea and a plate of biscuits. Charles looked up at him: \"I believe that your mother thinks that I'm a travelling salesman.\"",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "If you live really close to me then sure, drop by. You don't have far to go back if I'm busy.\n\nIf you've travelled any distance, however, then it's rude of me not to invite you in for five minutes - and similarly if you have brought an upset young child with you. That's manipulative, and nobody likes being manipulated.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 555,
          "content": "Plus kids need to learn that they can't always get their own way. Yes, kid was very upset but parenting requires dealing with that sometimes.",
          "id": 108,
          "comments": [
            {
              "score": 345,
              "content": "Yeah this was a teaching moment that OP mistook as an emergency.",
              "id": 109,
              "comments": [
                {
                  "score": 22,
                  "content": "I was a teaching emergency if the kid hasn't learned that lesson yet by age 4.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "So sad this is almost buried. \n\nI worked with kids. By 4 years old, they actually do understand that they cannot have an item just whenever they want. They WILL fall asleep without the toy. \n\nParents are just the biggest enablers. And hey, we all get it, but even before 2 years old, kids are capable of greater understanding than people give them credit for.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yeah, OP let their kid being upset drive them into a panic, they needed to stay calm so they could help kiddo work through their feelings. You don’t get to disrupt someone’s day over a toy. You text/call and if they don’t respond, it’s time to teach the kid that sometimes you have to go without. OP YTA.",
              "id": 112,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 527,
          "content": "YTA just because she’s at home doesn’t mean you get to disturb her. You wouldn’t barge into her at an office asking about sleepy dumbo.",
          "id": 113,
          "comments": [
            {
              "score": 272,
              "content": "This. If she was at the office doing job interviews or having a board meeting or meeting with a customer, would you walk in to the room \"really quick\" with a crying four year old looking for a toy? Or if she was teaching, taking an exam, talking to a patient or one of the other many things she could be doing in her own home after she clearly signalled that now was not a good time.",
              "id": 114,
              "comments": [
                {
                  "score": 12,
                  "content": "I have work slots where you can't be 'off' like live streaming of lectures, meetings where marks are verified, etc. I would be royally pissed off if someone would not stop knocking at the door. I would not have been as polite as the woman was.",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I agree. My therapist works from home. I’d be mortified if some random dude started walking around in the background. No idea what this woman does for a living, but TeleMed doctors, therapists. Lawyers… all sorts of jobs that legally require privacy are done from home now. OP is the AH.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 180,
              "content": "YES! Just because the location is home and not an office doesn't make the work any less important. \n\nAs a remote worker this annoys the absolute shit out of me. I'm working, not mucking about at home and available to take all the neighborhood parcels, babysit, do laundry, or the million other things folks should do in their time off.\n\nYTA OP.",
              "id": 117,
              "comments": [
                {
                  "score": 9,
                  "content": "So many people now think wfh is not real working where its easy to walk away for ten minutes. And sure, that is one of the nice things of wfh that you can throw in a load of laundry at lunch time. But we would all agree if you had left something in my car it would be wildly inappropriate to show up at my office (after you couldn't reach me) and demand reception pull me out of a board meeting for your \"emergency\" and get that item out of my car.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Ughhhh it took me over a year of working from home to get my father-in-law to understand that he couldn’t just drop by to see my husband during work hours. My home office is set up in the living room, and he would knock loudly and repeatedly until either my husband or I could open the door. No regard for the possibility of us being in meetings or calls. Some people really do assume that working from home equals not actually working, thus thinking it’s okay to cause a major disruption. I finally got him to understand when he dropped by twice in one day (the second being well after my work hours). He asked why I was still working, and I explained that he’d interrupted a work call that I ended up rescheduling and so all of my other work got pushed around. It was an actual lightbulb moment of “oh, she’s actually doing something, and maybe I shouldn’t interrupt”.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This!  I've been working from home for over a decade.  When my kids were little and home with me, everyone thought that meant I was available to babysit their kids as well...and for free, to boot, since I was still making money from my job while their kids were there.  I even have a friend who asked if her kid can come to my house while I'm working from home during the summer so her kid doesn't have to be home with her while she works from home.  I said, um, I work from home too.  Her response?  Yeah, but your work is easier to do with kids in the house than mine.  Grrrrr.  I lost it on that one.",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "I cannot tell you how often the stay at home parent (whether they're working an outside job at home as well or just being a SAHP) is disregarded this way. People would NEVER barge into your place of work demanding a stuffed toy, but if you happen to be a SAHP, people think it's totally fine to drop by or interrupt or call. My mom will take a sick day off work because she \"just could not deal with it today\", call me several times, then when she's finally called enough that I'm wondering if it's something important and decide to pick up, I discover she's just bored cuz she didn't go to work. She will no joke keep me on the phone for 3+ hours if I let her. And people think you can just drop everything if you're a SAHP. They want YOU to be the one to accommodate them, cuz clearly YOUR schedule is more flexible, since you're just \"sitting at home all day.\" It drives me effing crazy.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Judging by OP's behaviour, he totally would do that",
              "id": 122,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 341,
          "content": "Also - what are you teaching your kid? That things have to happen *NOW, RIGHT THIS SECOND, NOW* ? I think the kid will have a hard time growing up and learning that life isn’t fair and we don’t always get our way.",
          "id": 123,
          "comments": [
            {
              "score": 10,
              "content": "> Also - what are you teaching your kid? That things have to happen NOW, RIGHT THIS SECOND, NOW ? I think the kid will have a hard time growing up and learning that life isn’t fair and we don’t always get our way.\n\nThis is where children develop entitlement and it could lead to them becoming a narcissistic adult. \n\nThere are so many parents now who won’t allow their children to experience any hardships or adversity.  The children end up growing up with completely unrealistic expectations of the real world. (News flash: they can’t always get what they want and they may have to deal with feelings they don’t like)\n\nI’ve heard them referred to as Bulldozer parents; a worse version of helicopter parents. \n\nOP YTA. Your “emergency” is not everyone else’s emergency.",
              "id": 124,
              "comments": [
                {
                  "score": 5,
                  "content": "I find that some modern parents are horrible for this. Yeah you don't yell and scream like older parents do but you teach them that they won't always get their way.\n\nBE THE PARENT",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 233,
          "content": "If it was your son's emergency medication or something extremely critical then it is one thing to go up to their house if they have not picked up the phone but for a toy you have disturbed them when they clearly didn't want to be disturbed. You are YTA. You should have spare toys if it's that important and explain to your son that immediate gratification will not be possible every time he want something and needs to wait. \n\nThe worst part you did however is when she told you she doesn't have the time to look but you forced your way in saying that you will look inside the bedroom. \n\nI think most people wouldn't have let you come inside their house at such a time if they are having an important work meeting or anything like that to look for a toy. \n\nPlus your wife maybe in a different state of mind because her father is ill. But you have no excuse you should apologize to her profusely and also make up to them in the form of babysitting for their kid if they want in the future or with the gift for your intrusiveness.\n\nAlso I am happy that she texted you to let you know exactly what she thinks of you so that next time before doing such a thing you will think 10 times.",
          "id": 126,
          "comments": [
            {
              "score": 27,
              "content": "And the text was informative. It was professionally handled.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Yeah I was about to comment on that too the wife has the nerve to be upset what is she upset about because his wife is entitled she believes the world revolves around her guess what it doesn't",
              "id": 128,
              "comments": [
                {
                  "score": 4,
                  "content": "Apparently she believes the world revolves around sleepy dumbo.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I think it also gives him and his wife an opportunity to apologize and send over a nice gift card for dinner. Maybe even in an envelope and with a stamp and everything. Share genuine gratitude and apologize profusely, obtain back-up Dumbo, and let them know how you are aware you owe them big time and look forward to trying to repay her generosity.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 156,
          "content": "This is the simple truth. I have two kids, I get it. But  if you phone and get no answer then turning  up unannounced is a faux pas. to then push to look for it after being told not now, is really crossing the line. YTA. you could have managed your child's nap time without it. What would of happened if it wasn't there?",
          "id": 131,
          "comments": [
            {
              "score": 16,
              "content": "Or the kindly neighbour who will no longer be having your kid sleep over was out? Would OP have broken in?",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Worst case, the kid doesn’t nap that day and is possibly overtired for bedtime. Not really a big deal. It happens. \n\nOP probably looks forward to the peace he gets from nap time and was willing to interrupt someone else’s day to get it.",
              "id": 133,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Yup. Now they’ve reinforced the idea in this child’s head that he *cannot* sleep without the toy, instead of the opposite. Gonna be brutal when it gets actually lost for real or disintegrates, it’ll be worse for the kid and the parents, and it’ll be the parents’ own damn fault.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 78,
          "content": "Yes. You have no idea what’s going on for them not to answer the phone or any contact. That was extremely insensitive and rude. YTA.",
          "id": 135,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "“Mr 4, the way to get what you want is entitlement, tantrums, and incessant demands. Never mind the needs or the boundaries of other people, if you cry loudly enough people will do whatever you want!”\n\nHard YTA, a teachable moment that the OP handled in the worst possible way. Assuming your child isn’t developmentally challenged, they should be starting to understand consequences at 4. So if he forgets his toy and they’re busy, bad luck.\n\nThe wife here owes an ENORMOUS apology. Being stressed is no excuse for being an AH to people helping out.",
          "id": 136,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": "YTA - I think the dad was TA, but I also think he needs to train his kid to understand that you can't always get what you want. Sometimes you have to wait. I would take my kid and explain to them that crying wasn't going to change things and he was going to have to hold himself together. Some parents are different, but I never allowed my kid to throw tantrums like this. I forcefully put a stop to tantrums when she was little because I felt it was important that she learn that the world didn't revolve around her and sometimes things couldn't be the way she wanted them. Parents today rush to solve every issue, but the kid develops unrealistic expectations based on that helicopter behavior. I understand parents do it because it shuts up the immediate crying, but so does redirection, communication and a lot of other things. Sometimes you have to learn that not right now means not right now. This is a lesson that both father and son needed in this case!",
          "id": 137,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 8286,
      "content": "Gentle and kindly, YTA. She told you to come back later and you didn’t accept that answer. That’s not cool, and it’s not her problem that you forgot it in the first place.",
      "id": 138,
      "comments": [
        {
          "score": 3053,
          "content": "\nIt was crazy rude what he did. Demand that they open the door. Who does that?\n\nOP would be furious if someone did that to his wife. Even more so if it’s was a guy beating on the door…embarrassing \n\nYou should send them a gift - you blew this up so terribly.",
          "id": 139,
          "comments": [
            {
              "score": 2544,
              "content": "And After they did him a favor. If the toy is that important, it's on the parents not to forget it. Like they didn't give a shit when they left, but suddenly on their Time they needed to have full Access to the house... And the wife - Always the same story, give people an inch and they want a mile. And OP taught a nice life lesson to his son - when you forget something you Can walk all over a woman yo get it. Her work is nothing compared to your toy. When you really want something And a woman says no just insist and demand. That's what dad taught his kid today. And that Mum is angry because this lady dared Say no to sweetie. People should all bow and fulfill sweetie wish. And son sure need to keep tantrum on it's working so well.... And parents will Ask why teen is so hard, why he can't understand they won't lend him the car.... Lol..\nIt's the life lesson they taught the little one that is thé worst and they don't even see it...",
              "id": 140,
              "comments": [
                {
                  "score": 848,
                  "content": "Yup! Also op keeps referring to the kid being anxious about something happening to sleepy dumbo, which, realistically, wasn’t going to happen. By reacting like this OP reaffirms that fear- “you’re right! We need to go interrupt this woman’s day and invade her house (to look for something which is the most intrusive shit ever) because some vague unnameable terrible thing will happen!”\n\nSo op teaches the kid, not only that he deserves his way, and can go to ridiculous lengths to get it, but also that *not getting his way is something unknown and scary*. \n\nFuckin ripper combo those two",
                  "id": 141,
                  "comments": [
                    {
                      "score": 29,
                      "content": "These were my exact thoughts reading and I don't see many other people mentioning it! He kept repeating that his son was freaking out - so? Little kids can't regulate their emotions, it's your job to help them. If you lean into their panic (like, speeding off to someone's house to find a toy) you're actually enforcing that their feelings of panic are justified. \nKids that age often scream and cry for things that are legitimately impossible are dangerous. It irritates me because weak-willed parents often act like they can't possibly disappoint their kid if it inconveniences someone else, but have no issue shutting it down if it's something they actually don't want to happen.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 148,
                  "content": "Just buy a second sleepy Dumbo\n\nWho doesn’t have a backup toy if OPs child literally can’t sleep without it?",
                  "id": 143,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Always rotate toys!! It’s okay to need a plush to fall asleep, but it being only one is bad news. Rotate toys from infancy so there isn’t a sudden family crisis if one is lost or left behind.",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 47,
                  "content": "100%",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Yeah this kid is 4, you need to do their steps 1, 2, through 100 and if you don’t it’s on you. This kid got a bad lesson",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Whataboutism and exaggerating by saying “beating on the door” when OP said knocked. This is why you don’t take strangers seriously, they do disingenuous stuff like this. It’s okay to just say Op is TA without speculating the what if without any real reason to believe it and exaggerating what they did. But yes OP is in the wrong",
              "id": 147,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Agree with the Yta but apologize & acknowledge that it was rude - send a gift card with enough money for a couples’ dinner & an offer for an overnight babysitting job in return at their convenience. You’re under stress and duress, so hopefully the gesture will not permanently damage the relationship.",
          "id": 148,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7767,
      "content": "[deleted]",
      "id": 149,
      "comments": [
        {
          "score": 4984,
          "content": "Yeah this seems like a perfect teaching moment for the 4 yo.. \"I know Dumbo is really important to you, you are so sad you left it behind. As soon as ----'s parents say it's ok we'll go pick it up, remember these feelings and pay more attention next time you bring Dumbo somewhere.\"\n\nWhen I brought my 4 year old to school this morning and was getting on his gloves for recess, he started a fit because he wanted a different pair of gloves. I told him if it was important to him to pick out his gloves every day, he absolutely should. Tomorrow when we're about to go I'll remind him to pack his backpack himself so he can choose the gloves. Fit over, and now my big boy gets to pack his own backpack and get that extra level of responsibility.",
          "id": 150,
          "comments": [
            {
              "score": 709,
              "content": "Does your son have a special sleep toy? I don't have kids but my sister has 3 boys. Now 11,7,3. The second and last had/have special sleep toys and it was/is fucking mayhem if their soft toy was not found at nap or bedtime! Obviously the 7 year old has grown out of this by now and he wasn't quite as bad as the youngest. The oldest when he was younger was just like \"meh I can see reason and I'll just sleep with another one for now\", but the current 3 year old's entire world and safety net seems to disappear as soon as his bluey and Peppa are not there. Like holy crap he's tired and he just gets distraught like there is no way to talk reason into him, the love and commitment to his sleep toys is like nothing I've ever seen. \n\nAnd I mean all these kids have had the same parenting and nurture so maybe some kids just form much stronger emotion bonds with them? Like if I was babysitting the 3 year old you bet I would be like ninja crawling in someone's window to get his toys back to him. \n\nAlso, after being around a kid with an intense attachment to his sleep toy, I would completely understand if someone turned up at my house and said they need to find their kids toy I would be like WHY DIDN'T YOU SAY! we either need to find this toy or sew a new one for this kid immediately. So I dunno maybe some parents get it and some just don't??\n\nAlso, I'm 32 and child free but a lot of my friends have kids and I've seen fairing levels of sleep toy attachment with them as well. The one thing I could say for all of them though is that none would be pissed off if they babysat and then the parents rushed over to get the toy quickly for nap or bedtime. I mean it would be a different story if someone just turned up and was like \"entertain me!\", But all they're doing is grabbing a toy and leaving? Nah chill.",
              "id": 151,
              "comments": [
                {
                  "score": 1539,
                  "content": "I do have 2 kids, one of whom had a favorite stuffed animal. I make sure I had 3 of them. That way, I didn't have to be an AH like OP thinking that it's OK to just barge over to someone's house who obviously is not available for guests.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 642,
                      "content": "100% it’s wild to me if this stuffed animal is so important why didn’t dad look to make sure they had it? Come on. With my girls anytime we leave anywhere I always make sure they have all of their stuff. My husband is slowly learning this too 😐",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 179,
                      "content": "Our daughter is five and has zero clue there is more than one Tiny the elephant. I swap them out regularly whenever Tiny needs a wash so they get the same level of wear and tear, and I even added some black paint to one of them to match the other when she had a mishap. Having a second Tiny has been a LIFESAVER when she’s been forgotten at school or daycare. Someday we’ll tell her the truth but certainly not anytime soon 🙃 It’s the one piece of advice I tell all my friends - if your kid is attached to a particular stuffy BUY ANOTHER ONE.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 62,
                      "content": "And unfortunately sometimes they don’t choose a favorite til the damn thing is discontinued & it’s impossible to find a back-up…story of my life!",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 50,
                      "content": "My cousin was obsessed with a stuffed toy, so my aunt (smartly, like you) bought another one so there was a backup. Unfortunately, my cousin found out about the backup, and then she had to have *two* special sleepy toys at all times. This is just a warning to any parents who buy a backup special sleepy toy for their kids.\n\nNone of this excuses OP for not checking for sleepy dumbo before he left the friend's house if it's so important that the kid throws a massive tantrum whenever it's not there, or for not just dealing with the tantrum until he can actually speak with the people who had done them a favour. It really really sucks that he would have had to deal with a distressed child, but he could have been barging in on literally anything because he couldn't forward plan or wait.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "When my stepdaughter didn't bring her favourite stuffed animal, (which she has 3 of, but the mother insists they get back to her place after we have SD over the weekend), we had no choice but to cope.\n\nWe told SD that [insert plushy's name] was having an adventure, and he'd be waiting to tell her all about it when they got back together on Monday.\n\nGuess what? It wasn't such a big deal, after all, and she was fine with another plushy. She was 3 at the time.\nChildren also often take their cues from their parents in stressful situations, and if this was dad's reaction to a missing toy, I really don't want to know what his reaction to an ACTUAL problem would be... \n\nI don't like when the Amazon guys ring when I'm working, let alone someone who should have already gotten the message that you're not available.\n\nYTA, OP.",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "We did this for my now 3yo. We tried to rotate it in ages ago, and even at that age she could tell the difference. If she doesn't have the original she is absolutely inconsolable. My 2yo however doesn't really care. \n\nEach child is different and as a parent, I would have no issues with anyone coming over to pick their kid's stuffed animal up, even if I were busy. It's a NTA for me.",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 317,
                  "content": "I disagree. Just because your child may throw a tantrum because their sleep toy is not with them at the moment is not a valid excuse at all to barge into another person’s house. \n\nOne night of potential tantrum saves you the embarrassment of ruining a relationship with people who were already performing you an immense favor.\n\nI don’t blame the kid, I used to have a sleep toy like that. But if he’s not in physical harm, the father shouldn’t have done that.",
                  "id": 159,
                  "comments": [
                    {
                      "score": 169,
                      "content": "Not only that, but things like tantrums can actually be good for kids. They need to learn what it feels like to have those strong emotions and get over it while recognizing that they were actually fine the whole time. If we prevent every meltdown, they become adults who still have meltdowns.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 58,
                      "content": "It wasn't even night bed time, it was nap time!! Geez, OP's kid is gonna grow up to become a spoilt, entitled ass.",
                      "id": 161,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "It amazes me how entitled people are. The world does not stop for YOUR child or their tantrum.",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Especially since this was a daytime nap. Handle the meltdown, get it after work hours in the evening.",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 224,
                  "content": "My 3 year old son has a super strong sleep toy attachment to a tiny Buzz Lightyear and it’s an absolute nightmare when he doesn’t have it for nap or bedtime. But it’s my job as a parent to deal with my kids when they are nightmares. I would never want to let someone in my house unexpectedly while I was working and I would never expect someone to let me in at an inconvenient time just because of a sleep toy. \n\nI think all parents of toddlers want to avoid tantrums when possible but they are still an inevitable part of parenting and sometimes you just have to deal. You can’t make it other people’s problem.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 123,
                  "content": "I had kids who equal parts needed a sleep toy and lost the damn thing every time I turned around. So they learned to sleep without it. It's ok for them to be denied and frankly, it isn't good to go to these kinds of lengths. They did it for themselves to prevent  a meltdown they didn't want to deal with",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 89,
                  "content": "Doesn't matter. You have no right to barge and basically force yourself into someone's home. This is not a real emergency.",
                  "id": 166,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 58,
                  "content": "No. This is why kids can’t recover from disappointment. Parents have to manage these crises better than this.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "But OPs son still needs to learn that he won't always have sleepy Dumbo.  It isn't worth barging into someone's house at an inconvenient time for a child's stuffed animal.  Because children need to learn to grow and adapt and part of that is helping them to understand that they can't always have their stuffed animal, no matter how important.  \n\nI have four so I understand first hand what it's like.  But kids have to learn that mistakes happen, things get left behind, and we have to wait to get the left behind object.  It's just life.",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Shit happens though. Just because a 4yo is having a meltdown doesn't mean that we must give them what they want. What would dad have done if no one was at the house for a few days?",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "My youngest has a sleep toy. As soon as we recognized it’s importance (especially during stressful-to-kid times and illness) we got a spare we hide and rotate back and forth between the two, but we also made sure that during low stress days the toy would go missing or have adventures solo. It takes a lot of effort, but it’s important the nap/sleep is not 100% reliant on any one factor and that children can self soothe more often than not. \n\nThis kid probably knows mom is stressed even if they don’t understand why, but this is what happens when you don’t have back up plans (spare toy, prepare for nap-skipped-grumpy-kid, preparing a child for patience and loss however temporary, etc.).",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "That's not \"all they did\" though, is it? \nThey called relentlessly and when they didn't get an answer, they showed up at the house. When they were told to come back later they insisted on disrupting their work environment to look for a toy. \n\nSo no, they need to chill and teach the child that sometimes things happen and there's a time to deal with them. This child would have survived if they had tow air. Yes. They were upset. They're 4, probably used to getting their own way, and tired. \n\nToy stuff is hell but bein a parent is about teaching your kids reality sometimes.",
                  "id": 171,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I don't know how far OP lives from the family in question, but I can't believe he got in the car and *drove over there* to get the stuffed toy because his son was having a tantrum. This was a teaching moment for the kid, and the lesson was \"if you scream loud enough your parents will do whatever you want\".",
              "id": 172,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "Maybe not in that moment, but add \"He's yours and so he's your responsibility\".\n\nIn all seriousness though, I want to know who packed the son's bag in the morning. Was it the son? (Doubtful at age 4) Was it the Dad? (In that case I blame Dad) Was it the other parents? (In that case surely they are responsible as well.)",
              "id": 173,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 239,
          "content": "He didn’t need the toy. \n\nHe WANTED the toy, little young to understand that but could have been a good teachable moment. Guessing by this interaction that kids gets everything they want at all times.",
          "id": 174,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "> i know your son needed his toy but sometimes you have to teach your kid that you dont always get what u want right away and have to learn to be patient. \n\nExactly. The son is 4, not some non verbal baby. OP and wife coddle the son too much. \n\nYTA for sure.",
          "id": 175,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": ">  i know your son needed his toy\n\nNo, the son wanted the toy, there is a difference.",
          "id": 176,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Would you barge into someone's office and demand they look for dumbo? You also don't know what work she does she could have been in a very important phone call or even possibly with a client and she answered the door because usually when people keep knocking when you don't answer it means there's an emergency. Not that you think you get to dictate when you get to search through their house because you don't know how to teach your kid \"no\" or boundaries for that matter. Literally this dad just showed his kid that \"no\" doesn't need to be respected and you don't have to respect others boundaries. I get there's stuff going on but this is ridiculous",
          "id": 177,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6897,
      "content": "Yes of course YTA. The wife’s note summed it all up nicely, the world does not revolve around your family but you seem to think it does. Extra bad for not wanting to bother your wife but thinking it was ok to bother other people. There are a lot of reasons why knocking on the door could have been extremely disruptive. There are jobs where what seems like a short interruption turns out to be a much longer one because it takes a while to get back into what you were doing. Or she could have been on an important phone call or Zoom, and you made her look unfocused or unprofessional. \n\nWhat would you honestly have done if she worked outside the house and no one was home? Would you have driven to her workplace and loudly demanded her keys? Taken her hostage and made her come home? Or just be a reasonable person and try to find a way to soothe your child for just one afternoon? I think you and your wife had better find a way to figure this out, because I will be shocked if these people agree to do you another favor after this.",
      "id": 178,
      "comments": [
        {
          "score": 2386,
          "content": "As someone who works a high-level corporate job from home, 1000% this. I doubt OP understands they basically barged into the middle of a workplace and demanded a child's toy.",
          "id": 179,
          "comments": [
            {
              "score": 915,
              "content": "it doesn't matter how \"high level\" or corporate the job is.  She could have been watching sports and drinking beer.  it's her house and her time.",
              "id": 180,
              "comments": [
                {
                  "score": 537,
                  "content": "Eh, I think not taking a minute to help a friend and their child if you were just home drinking beer is ABSOLUTELY an asshole move and would make a difference.",
                  "id": 181,
                  "comments": [
                    {
                      "score": 478,
                      "content": "ops problem was how fast he did everything. if he txted \"did my son leave his toy at your house? heres a picture of it. lemme know if you spot it anywhere and ill pick it up sometime\" he woulda been fine. the fact that he immediately started driving to the house, called on the way is the problem, got no response, and banged on the door enough to force a response is the problem",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Except they are not friends. Their kids are friends.\nAlthough this hypothetical situation is not well placed.",
                      "id": 183,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "They gave more than a minute the previous night to help a friend. Even if they were drinking a beer in their own home, no one has the right to demand entry into your home. They did a huge favor already and there was no agreement to meet that night. Why would there be an expectation to have to cater to them all of sudden when you already did your good deed.",
                      "id": 184,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Yes, but you’d also be an asshole to disregard what they said unless you knew they were just home drinking beer on a whim.",
                      "id": 185,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I’m sitting here thinking about how poorly it would go for me if I had to walk away from presenting to my company’s President during our global revenue call in order to help someone find their stuffed animal that they left at my house…",
              "id": 186,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 399,
          "content": "Yeah, any chance of continued favors was mostly gone due to OP’s inappropriate behavior in the afternoon. That door was slammed shut by OP’s wife calling the other wife and cussing her out.\n\nThat level of misbehavior is going to get shared with other parents from wherever the families met.",
          "id": 187,
          "comments": [
            {
              "score": 192,
              "content": "Thankfully, OP’s wife did not call that woman to cuss her out. She said those choice words in response to OP’s description of events.",
              "id": 188,
              "comments": [
                {
                  "score": 67,
                  "content": "Ahh, I see that I misread that part. When he said she called the other wife indelicate names, that his wife had called other wife that in a confrontation, not just when venting to OP.",
                  "id": 189,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I’ve reread it a couple of times and I think you were right the first time, I think she said those things to the other wife’s face. But it definitely is written ambiguously.",
                      "id": 190,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "Honestly the other events of the story are probably enough to make the other set of parents outright refuse future requests or come up with an excuse to say no anytime they get asked in the future. \n\nAt a certain point I don’t care what you have going on in your life, like when you keeping calling me and then show up wanting to start a search of my house for a stuffed animal when I’m trying to work and my husband is not home. Sounds like the parents on both sides aren’t even really “friends” so much as acquaintances because their kids are friends.",
                      "id": 191,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "And I have to wonder if OP would have done the exact same thing if it would have been the husband who answers the door. Would he have taken the husbands “no” as no the first time? Or would have have ignored it as well as assumed it was the opening to the same guilt trip he took the wife on.  Would he have been just as manipulative with the husband as he was with the wife? Cus he clearly thinks that when a woman says no he can talk her out of it, just like he did.  And he seems to see. Nothing wrong with not listening when a woman says NO.",
          "id": 192,
          "comments": [
            {
              "score": 8,
              "content": "I wonder that too. The title asked if he’s an a-hole for interrupting a WOMAN at home. Not a friend. Not a person. Not a neighbor or babysitter. The emphasis was on her being a woman. Maybe it’s a coincidence,  but maybe it’s not.",
              "id": 193,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Thank you. I WFH, but I am on a very tight schedule and I don’t answer doors, etc. I would have been super mad at the interruption. But the wife put the AH cherry on top with the name calling. They won’t be babysitting again.",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Yep real r/iamthemaincharacter vibes from this guy",
          "id": 195,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5085,
      "content": "Seriously, YTA. Not a gentle YTA, or a sorta one, but a big giant one. \n\nYou sent your 4 year old to a sleepover in the middle of the work week with a friend because you needed help. Then you didn't check for this super special stuffed animal that you absolutely cannot live without but absolutely won't pay $50 for on ebay and you left it there. Then you called multiple times and when you didn't get an answer you rang the doorbell multiple times, then didn't take no for an answer when you were told to come back later. \n\nI work from home. Today is Thursday, and I'm over 40 hours in already. Today alone, I interviewed several developers for open positions, had design meetings with 20+ participants, and gave two presentations to senior leadership. Just because I am physically at home doesn't mean I am sitting around watching TV and waiting for my entitled friends to realize they've left their stupid stuffed animals at my house. \n\nYou owe them an apology, a gift card to a really nice dinner, and a sleepover where you take their kid and give them a break.",
      "id": 196,
      "comments": [
        {
          "score": 1263,
          "content": "Exactly! I’m so frustrated with people who think that WFH means being available to everyone all the time. And it doesn’t mean they’re alone—as you make clear, they could be working synchronously with others online or telephone conferencing. I know many call centers now how their employees WFH. OP was very entitled—and his wife…grrrr",
          "id": 197,
          "comments": [
            {
              "score": 232,
              "content": "Yo man I don't have a job outside the home at all, and even I realize that wfh means exactly that.\n\nI miss when landlines and answering machines were the common communication and if they didnt answer, you flicking waited til they called you back on that godforsaken party line.",
              "id": 198,
              "comments": [
                {
                  "score": 9,
                  "content": "There is a special nostalgia I have for going to a party at someones house and the land line would ring and whoever awnsered it would just tell out \"Yo is james here his parents called\" \n\nModern phones are obviously way more convenient and useful, but those memories",
                  "id": 199,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Party line??",
                  "id": 200,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Back in the 80s, when dinosaurs roamed and we used a can of hairspray to elevate our bangs to the sky, we had things called party lines. \n\nImagine a Reddit live chat, only you were sitting in your bedroom wearing spandex leggings and 3 pairs of socks that didn't match and instead of being on a smart phone or laptop typing you were on a corded phone that likely had a 50 foot cord. The actual pho e was probably in the kitchen and you would drag the hadset into your room and your parents would trip over the cord and yell at you while you talked to other teens about oh my God like these parents just don't get me and are you going to the mall tomorrow? \n\nSo an internet chat room on a corded phone basically. We were super high tech.",
                      "id": 201,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 134,
              "content": "Yeah I work from home and I still don’t think my parents have fully wrapped their head around the fact that I’m not sitting around doing nothing and can’t be immediately available to do whatever they request. They’ve gotten better after two years but I first started working from home when my dad got his hip replaced and although I was technically home and could help him, I was not immediately available to go put his wash in the dryer the very second it got done. For some reason he feeds the cats dinner at 3:30 pm which is insanely early and if I got really busy and couldn’t take my 15 min break until 4 he would hobble down the stairs to do it himself and get pissy about it. It was the most frustrating thing ever.",
              "id": 202,
              "comments": [
                {
                  "score": 14,
                  "content": "My wife is kinda the same. Yes I sometimes do have time to do household chores and stuff on the clock, but when I'm busy I sit down at 8 with coffee and literally can't leave my desk for 8 hours.",
                  "id": 203,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "My mom and I were both working from home at the same time and she still did that! She would flip out if the neighbors mowed the lawn while she was working but thought she could interrupt me to vacuum the room, make me unpack (and lysol wipe) groceries, help her move furniture in her office, fold laundry, etc, etc.",
                  "id": 204,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 88,
              "content": "I called customer service for something last week and the agent was obviously at home with a young child wanting Mom’s attention.  She was trying so hard and was so stressed trying to please the both of us.  I felt for her.  I thought her little girl was so cute and it still makes me smile.  Good for Mom.  I’m not that important.  My problems pale to hers.\n\nBTW OP, YTA",
              "id": 205,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "And man, some workplaces are incredibly strict about their WFH rules. What OP did was rude and entitled but also carries the possible consequences of getting that woman in trouble with her job. I would be *LIVID* if I was in that position. I'm a huge introvert and would hate for someone to just drop by in the first place, but I could deal. What I absolutely would not and could not have patience for is if it also possibly threatened how I make a living. \n\nI'll be honest, if I was that woman that would probably be it for the relationship for me. I'd likely have said to not ever contact me again. OP's behavior crosses a line I couldn't come back from.",
              "id": 206,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yeah, I think most of these people saying NTA have never worked from home and don’t understand what it means.",
              "id": 207,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I feel like people feeling entitled to immediate answers started with cell phones becoming a household thing. It seems really unnatural to be constantly available & expected to reply within a couple hours or even minutes, and leads to situations like this.",
              "id": 208,
              "comments": [
                {
                  "score": 4,
                  "content": "It does seem that way. I wonder what would have happened if OP, unsatisfied with an immediate answer to several calls, showed up to her home only to discover he interrupted intimate time between her and her husband. Would he have been as shocked at such rudeness, clearly articulated boundaries defined later that day, and would his wife called them a string of expletives?",
                  "id": 209,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 345,
          "content": "I honestly doubt the family will be accepting anymore play dates or attempts at friendship from them after this behavior. I know I wouldn’t so I doubt that their offer of a sleepover will go very well.",
          "id": 210,
          "comments": [
            {
              "score": 95,
              "content": "They’d be insane to help this entitled AH family again.   This dude made it clear his kid’s stupid toys are more important than this woman’s job.",
              "id": 211,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 155,
          "content": "There are times when I work from home that I could be presenting to 150 people in a meeting.  I can’t imagine how much I would flip out if someone did this to me during one of those presentations.",
          "id": 212,
          "comments": [
            {
              "score": 11,
              "content": "Lol this is me, plus a dog that barks at outside noises. I’d be miffed.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "With a work situation like that, do you disable your doorbell so that it if some inconsiderate person rings multiple times it doesn’t affect the meeting? Just curious, because I honestly think I might.",
              "id": 214,
              "comments": [
                {
                  "score": 6,
                  "content": "My dog is also a doorbell that can’t be disabled",
                  "id": 215,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I don’t.  It never actually occurred to me to do that, but it’s a really good idea!!",
                  "id": 216,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I disabled my doorbell. I live in India and work from home, and people used to ring for silly reasons. I also have a huge sign saying do not knock, but of course some people choose to ignore that. Still not as distracting as the doorbell.",
                  "id": 217,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "This 100%!! I have friends and family who think the fact that I WFH means I’m always available. OP wouldn’t have gone to this person’s place of work to demand they looked for the toy, so why did he think it was okay to interrupt her work just because she happened to be WFH?! Ugh…",
          "id": 218,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Also WFH, and the number of people who just interrupt you in the middle of your day or expect you to drop everything to cater to them because \"you're at home\" is stupidly high.",
          "id": 219,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "[deleted]",
          "id": 220,
          "comments": [
            {
              "score": 8,
              "content": "I appreciate you for doing the truly hard job that I couldn't do, kind Redditor. Sorry people suck.",
              "id": 221,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "<leonardo dicaprio applause.gif>\n\nI'd want to be as helpful as I could if I were in the place of the people whose house the stuffed animal was 'lost' in. But sometimes I'm in the middle of a busy work day, there's no way I'm answering the door or letting anyone in at a time that doesn't work for me. I get that they were upset about their kid but this is terrible behaviour on OP's part.",
          "id": 222,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yes I agree as someone who also works from home a few days a week. I also agree that this could be rectified or at least part way rectified if you send them a gift of some kind to say sorry. \n\nWe do all make mistakes and I know you were stressed and maybe didn’t think clearly. The best we can then do is say sorry and not do it again.",
          "id": 223,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "This is the only way I see OP saving this friendship, a very thoughtful gesture.",
          "id": 224,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3708,
      "content": "YTA.\n\nText - no response\n\nCall - no response \n\nDRIVE TO THEIR HOUSE AND KNOCK - no response \n\nContinue to knock until they answer and ask you to leave - demand to go in and find stuffed animal\n\nAt what point did you think you weren’t the AH?",
      "id": 225,
      "comments": [
        {
          "score": 1055,
          "content": ">Continue to knock until they answer and ask you to leave\n\nThis gets me. Like after they knocked and nobody answered for \"a while,\" what was the plan? If nobody was home to open the door were they just planning to sit outside of the house? Or break in?\n\nIf they're not answering their phone _and_ door, they're obviously busy!",
          "id": 226,
          "comments": [
            {
              "score": 472,
              "content": "Call the police to demand the release of sleepy Dumbo!",
              "id": 227,
              "comments": [
                {
                  "score": 214,
                  "content": "\"Here's a photo of Dumbo's ear. If you don't stop with the harassment, we'll send him back piece by piece.\"",
                  "id": 228,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 179,
              "content": "It’s unbelievable that someone is this much of a jackass. Since they don’t know boundaries, I would completely remove them from my life. No play dates, no favors, no hanging out or even chatting. Maybe just wave as I drive past them but that’s all.",
              "id": 229,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "I was fully expecting a break in.",
              "id": 230,
              "comments": [
                {
                  "score": 10,
                  "content": "Next step: break window and go in to find toy, I’m sure they would understand\n\n🙃🙄",
                  "id": 231,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "You want to know what the plan was? OP *knew* she worked from home and was there and was going to knock until he got what he wanted.",
              "id": 232,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "OP probably would have driven to their place of work, dragged his crying child into the lobby, and demanded that his \"friend\" who did them a massive favor drive home to retrieve the precious stuffed animal so his kid could nap.  \n\nSuch entitlement!",
              "id": 233,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Exactly. OP refused to take no for an answer and invaded that woman's home when she was clearly busy and did not want him there. At that point he wasn't asking - he was demanding. It's not her fault that OP forgot his kid's plush and he was in the wrong. While I have empathy for the wife and understand that stress can be a factor in how people respond to certain situations, that doesn't give her a pass to verbally abuse and take out her frustration on someone else.\n\nOP and his wife both owe this woman an apology.",
          "id": 234,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "You know what at first I was thinking, it’s not that bad, but when you lay it out like this, he really is an AH",
          "id": 235,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I grew up in the 80s in a country where just swinging by each other’s house, optionally knocking and walking in was normal. \n\nI now live in a huge city in another country and people still swung by in the neighbourhood in the early 00s when we were young, carefree and texts were expensive. \n\nI moved neighbourhood and by even the mid 00s that swinging by was seen as odd there or in my home country. My more elderly relatives now find it rude when it was once encouraged. Culture changes and my 90 year old aunt is not WFH!\n\nIn my area the other people who keep knocking are Jehovah’s Witnesses or the cops. Or my neighbours’ social workers because he’s a meth user who is not answering the door and they are checking with me if I can hear anything before they bust the door down.\n\nAll the couriers, postman etc ring once and use the safe place for parcels post lockdown if you don’t come to the door but appear to be in. \n\nSomeone repeating knocking or ringing the bell unexpectedly makes me very fucking nervous now. It is the equivalent of a 3am phone call. My BF WFH and often cannot look at his phone for 8 hours. He is my emergency call and I have had 20 hospital admissions in two years. I am aware he cannot always be reached by phone so I email him when it is life or death (literally) and he excuses himself. He’s dealing with three continents, I can’t just drop by without being self contained as I have a key, text stuff and expect a reply and he gets all his parcels shipped to mine because he can’t answer the door and has no safe place.\n\nThis has been etiquette for quite some *decades* unless you are an outlier or have a pre existing arrangement. YTA.",
          "id": 236,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1349,
      "content": "YTA. As a parent with a kid who has a stuffed animal he can’t sleep with I always make sure it’s with him when he goes/comes back from any overnight visit. \nI’ve also worked at home and just because I was at home it didn’t make me available whenever someone knocked on my door. Leaving my work space for any reason outside of breaks would have gotten me written up. That’s someone’s livelihood. \nMy favourite saying is: a lack of planning on your part does not constitute an emergency on mine. You know this elephant is important to your son, you make sure it’s with him before he leaves.\n\nEdit: darn autocucumber, fixed a mistake.",
      "id": 237,
      "comments": [
        {
          "score": 152,
          "content": "Lol @ autocucumber!",
          "id": 238,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 20,
          "content": "My job is more lenient, I can have a stretch whenever, but interruptions -- even unanswered ones -- can really screw me, or my coworkers, over.\n\nJust a few unanswered rings or knocks can lead to: losing face w/ my colleagues or interrupting their train of thought on a call, getting kicked out of my zone, being unable to read a document... 30s of an entitled person's BS can spiral into 30m of overtime for a coworker or me.",
          "id": 239,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Exactly. This also wasn't an ask on OP's part. This was a demand. OP continued to knock until they became a pest and wouldn't take no for an answer. He had no idea what that woman was dealing with - in her own home no less - but he felt his wants/needs trumped whatever she was tackling.\n\nWhat OP did was no OK, and this probably former friend got verbally attacked by OP's wife for clearly communicating her discomfort. Again - not OK.",
          "id": 240,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": ">My favourite saying is: a lack of planning on your part does not constitute an emergency on mine.\n\nI like this saying. I'm also a fan of a sentence from Scrubs, spoken by Dr. Cox:\n\n\"It sounds to me like you've got a problem that is totally your problem but you'd like to find a way to make that problem my problem, but here's the problem.... it's not my problem.\"",
          "id": 241,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I have 4 copies of the stuffed animal...",
          "id": 242,
          "comments": [
            {
              "score": 5,
              "content": "My son only has one because Monkey was a gift from his big sister. She bought it on a school trip so it’s irreplaceable. This is why we always make sure we know where it is.. and so far so good and he’s 9. He takes it back and forth to his dad’s every other weekend and he’s gone on vacations.  I know the importance of it to my son and I never assume it’s in his backpack when he leaves or comes home.",
              "id": 243,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 982,
      "content": "YTA She let you know not to do it again.  That is all you need to know.  In your friends opinion, what you did was not o.k.  Accept that for her, what you did was not okay.  Apologize.  Move on.",
      "id": 244,
      "comments": [
        {
          "score": 369,
          "content": "Given OPs wife's reaction, sounds like that bridge is burned",
          "id": 245,
          "comments": [
            {
              "score": 185,
              "content": "The wife got mad in private, so thankfully the friend didn’t have to deal with that",
              "id": 246,
              "comments": [
                {
                  "score": 143,
                  "content": "Oh man, I misread that. I thought she called the other lady and called her names. Which seemed pretty ridiculous. Thanks for clearing that up haha",
                  "id": 247,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Yw! I had to read it a couple times, myself.",
                      "id": 248,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "I kind of wish the wife did say all that to the friend so the friend can understand the level of crazy selfish entitlement of op and wife and never dare speak to them again.",
                  "id": 249,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I don’t get why people are so mad about the text message? It needed to be said if she wanted to continue a relationship with OP’s family. Maybe her “the world doesn’t revolve around you” comment was a little harsh but it’s true. She was setting an important boundary. Would OP rather she and her husband just block him and his wife? Like consider all the options here. Aside from just letting it go, which means it could happen again and then OP would be here anyway, what was she supposed to do?",
          "id": 250,
          "comments": [
            {
              "score": 15,
              "content": "I feel like if her story was posted here everyone would be supportive of her text response and the boundaries she’s setting and agree that he’s the AH.",
              "id": 251,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "That's a good point: Even if you think someone's boundaries are wrong, you still respect them. You can tell that person why you think they're wrong, you can stop associating with that person for having ridiculous boundaries, but you don't get to decide to violate someone's boundaries.",
          "id": 252,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 771,
      "content": "Having two of a child’s comfort toy makes things so much easier.  Both in case one gets left or lost but also for washing!!",
      "id": 253,
      "comments": [
        {
          "score": 248,
          "content": "I mean, in theory. When my middle was a baby he had to have his “night night”. It was a knitted baby blanket. He almost lost it once so I ordered another just in case. He never touched it. Only the original would work and, believe me, I tried. I tried over and over and over. He wasn’t having it. That thing was sooo tattered by the time he gave it up at 6. I still have the pieces and he’s now 20. \n\nYTA op. So the asshole. The woman is right, the world doesn’t revolve around your family. My kid needed his night-night but if this had happened I would have explained that we can’t get it right now but we will as soon as we can. This was a life lesson. However, all you taught him was you can walk all over people to get whatever you want. Great lesson dad.",
          "id": 254,
          "comments": [
            {
              "score": 45,
              "content": "I learned, a little too late, that you have to secretly rotate the duplicates from the start so they wear evenly and smell the same.",
              "id": 255,
              "comments": [
                {
                  "score": 4,
                  "content": "THIS. Rotating them in and out is key!\nIdenticals of the favorite item so you have a backup when one is lost, dirty, forgotten etc.",
                  "id": 256,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "I have a blanket like that. It doesn't travel with me or anything, but it was made by someone close to the family and I've had it since before I was forming memories. My mom started making a second once, idk if it was only a replacement or also bigger, or what, but she never finished. Looking at it, feeling the material, it just wasn't the same, anyway. \n\nI tried to leave it home when I went to college. It just felt wrong. I'm about to turn 28, live alone, and do sleep with it every night. Sometimes, there's just that special thing in your life. \n\nI hope to pass it on to my kid one day and they get the same mileage out of it I have",
              "id": 257,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "The kids not supposed to know there is two! lol",
              "id": 258,
              "comments": [
                {
                  "score": 10,
                  "content": "He didn’t! He just figured it out! He’s one smart cookie! 😂",
                  "id": 259,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "I spent three years looking for a second toy to use as a backup. I contacted the company, posted on toy groups, etc. The toy in question was bought six years ago while I was pregnant and came from a seasonal section of Target and was on clearance when I got it. Turns out it's my oldest's favorite thing in the entire world and literally a part of the family at this point. So for three years I searched for a second one. Finally found someone who had one buried in a box somewhere and they sent it to me.  I was so goddamn excited to have a second one. So excited to show my then-4 year old. I wanted him to know it existed so he could take the backup on vacation/in the car because we wouldn't allow the OG one to leave the house for fear of it getting damaged. \n\nThe backup had the tag cut off. FML.\n\nTurns out the toy somehow loses all magic if the tag is cut off. Same exact toy, but the tag on the butt is gone and so, naturally, backup toy has sat unloved for two years now because my kid wants nothing to do with it. OG toy is still around, actually it's right next to me, and I dread the day when it rips or gets lost. I need to pack it away, but my son absolutely adores it and sleeps with it every night and we all talk about this one specific $1.50 clearance toy as if it's a real thing. Cannot believe a tag is the reason why my three year search ended up pointless. \n\nRegardless... OP, YTA.",
              "id": 260,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "When I lost a toy of mine as a kid (IIRC it was a Wishbear teddy, from care bears), it was apparently a pain to replace because that specific toy was no longer being produced, and my dad knew that I was smart enough to not be fooled by a similar yet different toy. So yeah, tracking down one at an actually feasible price was apparently not fun lol.\n\nSo yeah, it's not always super easy to just have a spare for a lot of reasons (purely financial, the toy got discontinued, the kid is just really aware of any inconsistencies, etc).",
              "id": 261,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 114,
          "content": "So much this. \n\nWhen my oldest was little, I took her downtown to dinner and a hockey game. She brought her most favorite toy, a beanie baby dog. She had it at dinner, but after getting to the arena realized it was missing. After the game(wasn’t there), we checked the restaurant, not there either. She was crushed. My BIL who lived nearby said he’d go look for it so we could go home. \n\nMeanwhile, my mom hopped on EBay and found some across the country with 2, and ordered them both. We told her BIL found the dog, and she was so happy, but it was a rough couple of weeks without it. \n\nNew dog got a kitten collar and a pet tag from Petsmart 😂 the things we do for our kids.",
          "id": 262,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 73,
          "content": "We had two.\n\nYou can't fool them, though. They can sense the fake.",
          "id": 263,
          "comments": [
            {
              "score": 130,
              "content": "You have to frequently switch them so they both smell the same and get grungy at the same rate.",
              "id": 264,
              "comments": [
                {
                  "score": 33,
                  "content": "Lol, I tried this. But my son found the second one. Now he sleeps with both! But tiger number one is the one that he really won't sleep without. And he knows.",
                  "id": 265,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Same happened to us. Daughter found the duplicate, and then needed both at all times to sleep 😂",
                      "id": 266,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Have two blankies, switch them every day so they have the same smell",
              "id": 267,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I used to work at a day care. Parents forget kids special blankets, stuffed animals, nuks, etc. I just tell the kids \"sorry mom/dad forgot blah blah at home you're going to have to sleep without it.\" And they are sad and some are really upset but they all eventually go to sleep for nap. Some of these kids are as young as 2. If the 2 year olds can do it this guy's 4 year old can live without for one sleep time.",
          "id": 268,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 707,
      "content": "Yes YTA.  Not even a light one, I think people are letting you off easy in the comments. \n\nI work from home. Them not answering the door is your answer, go away.  I absolutely hate people like you who will just sit there and continue to ring the bell or knock.  Do you understand how rude that is? \n\nLearn to parent your kid",
      "id": 269,
      "comments": [
        {
          "score": 174,
          "content": "YES. It drives me nuts. They’ll assume because there are cars in the driveway that they can just lean on the bell in the midst of my work calls. OP is definitely YTA although his wife’s nastiness definitely trumps his.",
          "id": 270,
          "comments": [
            {
              "score": 10,
              "content": "I have no cars in my driveway and people still won’t leave sometimes. I’ll have to answer the door, say “I’m in a meeting, please leave” and then go back to work.",
              "id": 271,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "This exactly. I'm wondering how often OP takes care of his child by himself. His wife is busy for one afternoon and this man is solving problems by barging into people's homes because his kid having trouble at nap time is too overwhelming.",
          "id": 272,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "If I hear a doorbell while I am working I don't answer unless I am expecting a parcel I have to sign for. But if the doorbell were to ring several times then yes I would go answer because I would worry its an emergency. You ring once and then leave.",
          "id": 273,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}