{
  "post content": "Hi everyone, \n\nUpdate: from what everyone has said I am clearly NTA. Thank you all for your concern and well wishes. Ana and her family have been blocked and I will no longer be in contact with her. \n\nIt was also brought up to me by another user that their was a similar post posted a few weeks ago from a hosts perspective. This is NOT the same post. My situation happened really recently (allot more recent than whatever the previous post was) I’m shocked to hear this has happened befor, but yeah it’s 💯 not related to ours haha\n\n\nFinally I’ve had a few comments about my dog being “certified” that I want to clarify. I am not from the US so I’m unsure what your guys process is like, but all I mean is that Bailey has gone through the required testing, training and registration to ensure she is legally aloud to be classified as a service animal :) \n\n\nI just want to start by saying I’m pretty sure I’m not the A-hole. But my friend and her family are pretty certain that I am. Please bear with me, I’m just wanting some clarity over this situation to make sure I’m not crazy.\n\nI (24 f) have epilepsy. I have a service dog (fully certified) who is trained to help me with my seizures. I have been diagnosed since a child, and I have had my current dog Bailey for 4 years now and she is the bestest girl around. (Before Bailey I had a previous service dog who we had to retire due to age… but having a service animal is by no means new for me). With her being a service dog she is obviously always with me. \n\nI have a core friend group who hangs out quite often. My one friend; let’s call her Anna) (also 24f) always makes really weird and almost passive aggressive comments about me and Bailey? Ex; dogs shouldn’t come to restaurants, I’m inconveniencing people, etc. she doesn’t get that I legitimately need her for my own safety. It’s not just for show.\n\nMy seizures are really regular; for context I actually get two different kinds. My “small ones” are petit Mal seizures. This essentially just looks like I’m zoning out and staring into space. Quite often people who don’t know me wouldn’t even connect this. My “big ones” are my main concern; these are focal seizures where I fully lose consciousness. This can happen a couple times a day for me so it’s obviously really important that I manage it to the best of my abilities. \n\nAnyways. Our friend Anna wanted to host a games night/appy night type thing at her house. When we there she lost it on me. She told me it was increadibly disrespectful that I showed up with Bailey without asking for permission first. That I can’t just assume people will be happy with a dog always being around. That I should have just stayed home if I couldn’t handle being out for a few hours without Bailey. I tried apologizing and pointing out that I assumed she knew I was bringing her since I’ve never gone anywhere without her. That set her off more. The guys were finally able to calm her down but her “compromise” was I had to put Bailey in the backyard.\n\nI was an idiot and said fine because I didn’t want to inconvenience anyone more or continue stirring the pot. Bailey went out side and I returned inside with my friends. \n\nI ended up having a seizure, blacking out and smashing my head on the floor. I had to go to the hospital because of how hard I hit my head. \n\nI guess my friend group absolutely handed Ana her ass calling her hateful, toxic, and a jealous witch. I guess she was trying to say that I passed out for the attention and I got my way like always. Long story short no one wants her around anymore.\n\nSince this happened her, her sister and mom have been blowing up my phone, calling me the ass hole and demanding I fix this situation and it’s honestly getting to me.. so Reddit. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 13453,
      "content": "NTA\n\nShe sounds awful, tbh. Your friend group was right to stick up for you. Her behavior was deplorable.",
      "id": 2,
      "comments": [
        {
          "score": 5824,
          "content": "This makes me feel so much better. Like I feel like I knew deep down I was in the right but with all the hate filled messages it just got to me.",
          "id": 3,
          "comments": [
            {
              "score": 3655,
              "content": "If I witnessed her behavior at the party, I'd be questioning my friendship with her whether or not you and I were also friends. She sounds awful, and it's not surprising that her mom and sister are just as awful.",
              "id": 4,
              "comments": [
                {
                  "score": 1798,
                  "content": "Yeah, unless OP has undisclosed magical powers, there really isn’t anything they can do to “fix” this situation for her former friend. \n\nShe (presumably) can’t just wave her magic wand and force the entire friend group to forget seeing her get forced to put her service dog outside shortly before suffering a serious injury that her service dog could have prevented. \n\nThe former friend deliberately deprived OP of medical aid, and OP was publicly sent to the hospital because of it. That’s not something real friends do, and it’s not something real friends forget seeing done to their friends.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 878,
                      "content": "Well actually there is something OP can do to fix this.  First is to admit she has lied about her medical issues and even having a need for a service dog.  Then admit that Bailey is just a regular pet that is perfectly happy living in the back yard.  And finally admit that she did in fact fall and hurt herself on purpose for all the attention and to make Anna look bad.  I really think something like this is what they expect from OP.  Don't even bother to give these people another second of your time they are not worth it at all.  You know it and so does the rest of the friend group.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "I mean, if OP could wave her wand and fix things, she’d probably fix the seizure disorder first before worrying about fixing a complete AH like Ana.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "and, if OP was more seriously injured, she could be in jail, like she *should be*!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Real friends would’ve whooped some ass. Lol. OK, probably depends on your friends. But putting her on blast is the absolute minimum to stay friends. This calls for scorched earth.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 276,
                  "content": "Right?\n\n> I guess she was trying to say that I passed out for the attention and I got my way like always.\n\nAny \"friend\" who said this about someone who had a seizure would be a friend no more. Anna brought this on herself. Besides never harassing OP about their legitimate service dog to start with, even within the scenario that ended up happening, the only even close to acceptable thing Anna could have done is fall all over herself apologizing. And even with that, I think people would be justified in ending their friendship with her. Given that she doubled down and tried to blame OP in any way shape or form, I would question anyone who does actually stay friendly with her.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 86,
                      "content": "Yeah, I think if I was in that friend group and Anna genuinely felt horrible, apologized, etc (and it seemed genuine), I'd probably wait and see OP's take on things. Doubling down and accusing someone of sending themselves to the hospital for attention?  Nope.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Karma has a way of teaching people like this a lesson. One Of my good childhood friend’s dad had been diagnosed with cancer and their neighbors from hell taunted his dad calling him “dead man walking” and other insults. Also purposely ran over their small dogs (they had it on their security cameras but the cops refused to do anything). One day, my friend started to chase them on foot after they had stopped in front of their house hollering nonsense (the whole thing started over a property  dispute  when a fence was built), they backed up and then ran him down, leaving him in a ditch to die. He recovered but lost his right leg. While the court case was going on, the neighbor who was the one driving was diagnosed with terminal cancer in the same leg my friend lost and died before the he could have surgery or finish the trial. Karma definitely b$tch slapped the neighbor & hope it gets Anna and her flying monkeys too.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 171,
                  "content": "and a 24 year old crying to mommy because her friends are being mean...",
                  "id": 13,
                  "comments": [
                    {
                      "score": 74,
                      "content": "yea that really poked at me. wtf do her mom and sister have to do with anything? were they there? did they see what actually happened? or are they just blindly enabling an awful family member?",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "she was probably a bully in school also.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "This is the wildest bit for me. When I was that age, if I ran to my mommy, she would ask me what the hell was wrong with me and to act like an adult.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "[removed]",
                  "id": 17,
                  "comments": [
                    {
                      "score": 5,
                      "content": "u/Zealousideal_Bat4250 is a bot.",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "[removed]",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -3,
                      "content": "[removed]",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 23,
                  "content": "Completely agree, if a friend of mine pulled something like that on someone I wasn’t friends with/didn’t know well or at all, I’d absolutely end that friendship and have some very choice words. I would be beyond mad to witness something like what happened to OP, ready to raise hell.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I would've vocally called her out! I would have never let her put your service dog outside! Fuck that petulant spoiled brat! NTA!",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Yeah, even if OP was a total stranger, I wouldn't want to be friends with someone cruel and hateful and would cut her off as well. She knew exactly how serious it was and didn't care. She knew OP brings the dog everywhere. She should have explicitly uninvited OP if it was that big an issue. Since she knows OP doesn't go anywhere without the dog. Seems like SHE is the jealous attention seeker. Doesn't give her the right to endanger OP's life.\n\nI own a large dog (golden retriever), I firmly believe pet owners should be respectful and not impose their pet on people. But this is not that. This isn't a pet. This is a medically necessary service dog. She was fully aware of this and chose to behave the way she did, instead of feeling horrible (as she should) that OP got hurt because of her. To directly cause someone serious physical harm and then have the gall to send messages blaming the person you hurt is WILD.\n\nOP has nothing to do with how the other friends reacted. She was freaking unconscious. They saw what happened and (rightly, IMO) got angry and called Anna out. OP can't fix that for her.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 3,
                      "content": "My dad and stepmother are completely obnoxious about their pet dog (and I love dogs). They came to visit me & got a pet friendly hotel room, but wouldn't leave the dog at the hotel at all. Which would have been okay, except:\n\n1) I had 2 senior cats. I told them what time we fed the cats in the morning & they showed up w/ their dog a half hour before that. The dog barked & my dad laughed & encouraged it. Of course the cats ran to hide in the bedroom.\n\n2)The dog kept heading towards the bedroom & I had to police it. My stepmother thought we should shut the door, but I told her no, the cats need access to their litterbox.\n\n3)They let the dog jump on and walk over all the furniture. I had to tell my stepmother to get it off a side table.\n\n4)They fed the dog the food I'd prepared. It ate more roast than I did.\n\nIt's little, so they think the behavior is cute and/or okay. Service dogs aren't anything like their dog (neither are pet dogs with responsible owners).",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Stupid breeds stupid.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Rotten fruit from a rotten tree.",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Questioning? I’d be hurting some former friend’s feelings, real fast.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Questioning like \"Why was I ever friends with her?\" and \"What other signs have I missed?\"",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -4,
                  "content": "[removed]",
                  "id": 29,
                  "comments": [
                    {
                      "score": 7,
                      "content": "u/Ok_Constructgf is a bot.",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 374,
              "content": "I suspect she also told them a very biased version of events, so I would try not to take their messages to heart. I guess you and your friend group have all been shown her/their true colors, and it isn’t pretty. I’m so sorry this happened to you.",
              "id": 31,
              "comments": [
                {
                  "score": 155,
                  "content": "Nag, toxic people will always be toxic. If I told my parents someone did something unfair (so indeed telling lies), they would maybe support me, but they would not send multiple messages to that person and harass them like that. If they felt it was big enough to contact that other person, they would at least hear them out too.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 63,
                      "content": "[removed]",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -4,
                      "content": "[removed]",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 99,
                  "content": "Block all the flying monkeys on social media. \n\nNTA, although I do hope you won't do anything impulsive like that again though. You should have left the party when she asked you to put Bailey in the back yard.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 63,
                      "content": "I know you mean that OP should have turned tail and gone home on this one occasion, but unfortunately, generally speaking, that attitude kept people with disabilities behind closed doors since time immemorial.  Our extra needs are an inconvenience to people like Anna, who think we should just give up and stay at home and stop being a nuisance.  What an insufferable woman she is!",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 245,
              "content": "Let your friend group know that she's sent her flying monkeys to harass you as well, lest they be tempted to overlook this one situation. NTA.",
              "id": 37,
              "comments": [
                {
                  "score": 7,
                  "content": "[removed]",
                  "id": 38,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Bot. Stolen comment.\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/11rocta/aita_for_getting_my_ex_friend_kicked_out_of_our/",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 244,
              "content": "Emphatically NTA!\n\nI have invisible disabilities as well, and some people really can't wrap their minds around it. Ignorance can be understandable, but *willful* Ignorance can be very dangerous.\n\nRight now, Anna can't admit the severity of your disability, and the injury you sustained because of it. To do so would also mean she has to acknowledge that she pressured you to basically remove your medical device. I say 'medical device' to help reinforce the stark necessity of your service dog.\n\nPlease, don't let Anna's hate get to you. Her previous lack of empathy, and compassion, make it obvious you're not losing a positive person in your life. I hope you have a speedy recovery 💙",
              "id": 40,
              "comments": [
                {
                  "score": 117,
                  "content": "Exactly this. Her telling you the dog needs to be outside is like if she told someone they couldn't come inside her house with their glasses, or their prosthetic leg, or their wheelchair.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 54,
                      "content": "\"Sure, come in, but leave your legs at the door!\" 🙄",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "\"You didn't ask if you could wear that insulin pump into my house! I can't believe some people are just too lazy to use their pancreases.\" -Anna, probly",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "\"medical good boi\" is what I'll call the dog 🤭",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I'd add that Anna lacks common sense.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 166,
              "content": "I would file a claim with her homeowners insurance for reimbursement of medical expenses along with pain &  suffering.",
              "id": 46,
              "comments": [
                {
                  "score": 20,
                  "content": "Absolutely.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Excellent idea and one that I never thought of. Hospital stays are extremely costly. Great idea and the \"friend\" needs to learn a lesson.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -5,
                  "content": "She had the option of not going, so sueing will be excessive. But still NTA",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 155,
              "content": "Block her and her family. You don't deserve the hate they give you, and they will never understand they're wrong even if it's explained to them. She literally thought you would put your life in danger to \"prove your point\" - shows what kind of person she is.\n\nYour life will be much easier and way more drama free without her. Unless she sincerely apologizes, she doesn't deserve to talk to you.\n\nAlso; dog tax, pretty please?",
              "id": 50,
              "comments": [
                {
                  "score": 3,
                  "content": "Yeah, where is the Bailey tax?",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 112,
              "content": "Honestly you might want to ask a lawyer if you can sue over this.  This would be similar to you showing up at her house and her taking away your insulin/wheelchair/epipen. \n\nNot saying you should sue but it may help you get your head on straight about how \"making this right\" looks like \"advocating for your health\".\n\nAlso consider working with a therapist seeing as you willingly put yourself at very serious risk of injury just to appease someone who was being cruel to you.",
              "id": 52,
              "comments": [
                {
                  "score": 72,
                  "content": "At least make them pay for your medical bills, go after her insurance",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Came over to say you should look into some legal action.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Doubtful.  OP was not forced to put her dog in the backyard. She decided to do it to smooth over an awkward scenario.  As much as the friend was a total A hole, unless she did something like stole or injured the dog in some way, there is no avenue for compensation. The first question a lawyer would ask OP in court would be something like \"If this is such a necessary medical tool, why would you stay there rather than leaving immediately\".  So I doubt compensation is something that could be pursued but at least the former friend is getting her karmic punishment.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Was about to suggest the same. A lawyer may be very interested in hearing about this.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I wouldn't feel bad about suing her, fuck around and find out",
                      "id": 57,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Anna was 100% the asshole but the rules that apply to businesses don’t apply to homes so she may be able to sue… but not because of the service dog being outside. You can tell anyone, that isn’t a government official operating within their legal jurisdiction, for any reason that you don’t want them in your home. You can be as racist, ableist, homophobic, and otherwise as much of complete asshole as you like. You can tell a diabetic they can’t enter if they have their needles and insulin; that behavior makes you an asshole and a stain on society but it’s not against the law. \n\nNow all that being said, OP could potentially still sue because she received an injury on the property and there is possibly premises liability but unless Anna owns her home it’s not likely to be worth it if OP could even win. It’s really hard to collect on lawsuits when the person you are suing has no assets.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I’ll say it then. She absolutely should sue.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -10,
                  "content": "Why OP would sue? I'm sorry but OP choose this situation. She could have told the host off, turned around and went home. Let's not infantalize OP, she was very irresponsible with her own health",
                  "id": 60,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 96,
              "content": "I don't get how she even got the idea of not letting in a service dog..... People have them for a reason.",
              "id": 61,
              "comments": [
                {
                  "score": 122,
                  "content": "Right‽ We had a service dog accidentally have diarrhea on the floor at my work, and we were like \"No, it's no problem, we know you need him, I'm sure this isn't how things normally go, it's no trouble\" as we cleaned up. These animals are there to save lives. (This particular fella was there to help with an invisible disability too, though I can't recall which one. He was retiring the very next day.)",
                  "id": 62,
                  "comments": [
                    {
                      "score": 44,
                      "content": "You’re good people, not everyone would be so understanding.  :)",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "We had that happen, too.  Poor thing had just switched food brands and was in the adjustment period, and his person needed to go grocery shopping.  She was mortified about it as she explained it, and we were all pretty chill.  Not any worse than your child having diarrhea on the floor!  \n\nTo the original poster, NTA.  Next time hang out somewhere more understanding, and block the flying monkeys!",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "You should have told the pup to grow some opposable thumbs so he could clean up his own mess. I tried that with one of my own dogs once & it got me absolutely nowhere. He didn't even thank me for cleaning up his mess. :>)",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 100,
                  "content": "Because people with fake service animals have ruined it for people in real need like OP. People that put their yappy dogs in shopping carts have ruined it for people like OP. People who let their dogs off leash because \"their dog is friendly\" have ruined it for people like OP.\n\nWhen bad dog owners aren't called out on their bullshit, this is what happens. People that truly need service animals get lumped in with the mess.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 66,
                      "content": "Possibly, but it sounds like Anna has seen OP go plenty of places with her dog without causing any issues. So she ought to be capable of realizing that, even if there are people taking advantage and coming up with fake reasons to bring their untrained pets places they shouldn't be, OP isn't one of them.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -4,
                      "content": "Cute that you think all the very heavily publicized stories about fake service animals aren’t heavily publicized specifically to make using service dogs seem suspect, and force the disabled back behind securely locked and bolted doors so the abled don't have to think about us.\n\nCute that you think those stories are all true, and not a combination of creative writing and right-wing agents provocateurs.",
                      "id": 68,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "The only acceptable reason to not let a service dog into your home is allergies, in my opinion. But you would discuss that with the owner of the dog beforehand to try to come tip with an alternative that would meet both people's needs.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 66,
                      "content": "One alternative would be to not host the group. I wouldn’t be surprised if Anna chose to host deliberately so she could insist on OP leaving her dog outside. And then, if nothing had happened, Anna would have used that to fuel her continued push for OP to leave her dog behind for others meetups as well.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yes. This is what a friend and I have to deal with. I'm severely allergic to dogs. She has a service dog. We try to do things either in public or at her home (so I can leave when I need to). There is no way I would ask her to keep her dog at home.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I could also see if their were other animals in the home that may react badly, like a dog aggressive dog or very skittish cats. It is those animals home as well, so I can see not wanting to invade their space with another animal when it might end badly for either one. But like you said, then discuss it and come up with an alternative!",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "People really do confuse legitimate service dogs with Emotional Support Animals, despite there being a huge difference. I have a friend who recently had to prematurely retire her SD after they got attacked by an ESA in a public space, when the ESA wasn't even allowed to be there anyway.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 2,
                      "content": "There’s a YouTube ad campaign encouraging this shit with ESAs right now and as someone with an emotional support cat prescribed by my actual in person doctor I really hate what they’re gonna do to the already terrible perception of ESAs, and the kind of awful behavior and danger they are encouraging by not even acknowledging that there are behavioral standards for animals to uphold even in places they’re allowed to be. I’m so sorry for your friend, the risks encouraged by huge swathes of the current system especially wrt dogs are ridiculous and should never come down on service animal teams.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -2,
                  "content": "> I don't get how she even got the idea of not letting in a service dog\n\nThere wasn't a dog in the house, she didn't want a dog in the house. The idea is pretty a priori.",
                  "id": 75,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 72,
              "content": "You are the victim here and your dog.\n\nSome people are assholes and your friend group just got rid of one. \n\nThat girl and her family can kick rocks.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "NTA I have both petit mal and grand mal seizures. I had a petit mal while going down the stairs, which caused me to fall and break my back. People don't realize how serious/dangerous seizures can be.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "Honestly I think friend group was wrong not to stick up for her MORE.  Who puts a service dog in the back yard?? \n\nWhat if she had been stolen? Aside from being the bestest girl, that’s a $15-40k resource OP needs to live.  \n\nAlso, they all knew why OP has the dog.  What happened to OP was a very predictable consequence of separating her from her dog.  I find it annoying that they let her be bullied into separating from her dog, then when she needed her dog and it wasn’t there it was a collective surprise pikachu face from the crowd.",
          "id": 78,
          "comments": [
            {
              "score": 28,
              "content": "This was my thought - someone else should have shut those comments down yonks ago. Even just a \"hah well the dog is better behaved than you! Maybe he should have your seat?\" could have killed this nonsense long ago",
              "id": 79,
              "comments": [
                {
                  "score": 2,
                  "content": "This is how a lot of bullies get their way. They bully the whole group. Everyone goes along to get along, and the bully keeps them all off balance, shuts any of them down if they question the bully's decisions. It's THEIR place, so THEIR rules, that sort of thing. Bullies are really good at it. It happens a lot. Bullies push their way around a lot, get a lot of experience at it, keep doing it to get their way. It's just this one time, the bully went too far, and as a consequence, her bullying ways were exposed to all, they all now see that Anna is a mean person.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "Honestly the friend group could have stuck up for you sooner, but I don't blame them",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "For real.  Not a huge fan of dogs in my house, but I would never bar someone from bringing their SERVICE DOG. People have service dogs for a reason. WHO DOES THAT?",
          "id": 82,
          "comments": [
            {
              "score": 3,
              "content": "I do not invite other people's animals into my house because of my own (unfriendly) pets. If someone brought a trained service animal to my home to work with them, I would have to put my pets in a separate area. \n\nIt's not a fucking option. \n\nIf the animal wasn't life preserving I could see asking the person in advance if there was something I could do that would allow them not to bring the animal, but if not, what are you going to do? Uninvite them for having a condition? If I liked them that little they wouldn't be allowed in my home in the first place.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I'm wondering if they stuck up for OP when the \"friend\" was telling her to put the dog in the backyard.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "A service dog is essentially a living medical device. Saying “ you shouldn’t bring your service dog everywhere” is like saying “you shouldn’t always wear your glasses” or “do you really have to bring your walker everywhere you go?” Anna’s an ableist jerk who is experiencing the consequences of being an ableist jerk, and OP is NTA.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Also thank the Lord that you have great friends who were willing and able to stick up for you out of their own volition! Keep them close, they’re real 💕",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Clearly NTA. Absolutely one of the most obvious NTA I ever read. You and Bailey are a package deal for valid reasons. If this \"friend\" can't understand, she is not worth knowing. We don't make people leave their wheelchair in the back yard when visiting and Bailey is a necessary as a wheelchair to someone who needs one.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I kind of wish they had stood up for her when she was being told to leave her service dog outside.",
          "id": 88,
          "comments": [
            {
              "score": 3,
              "content": "Yeah, me too. Better late than never, I guess?",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "NTA",
          "id": 90,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4398,
      "content": "OMG, NTA. She literally caused you to SUFFER A MEDICAL INCIDENT.  She had so little regard for your health and wellbeing that she caused you actual harm. I'd be sending her, her mom and her sister copies of the hospital bill, and then cutting them off completely.",
      "id": 91,
      "comments": [
        {
          "score": 2473,
          "content": "Thank god I live in Canada and my medical is covered 😭 I haven’t been replying to them anymore. I’m taking space. It’s just brutal",
          "id": 92,
          "comments": [
            {
              "score": 935,
              "content": "Seriously, you should just block all three of them. The fact that her mom and sister are harassing you with awful messages shows you where your ex-“friend” got her mean spirit from. If this incident wasn’t a come to Jesus moment for her, then she will *never* learn or be truly accepting. And obviously doesn’t care about your well-being or safety.\n\nI’m glad your friends are decent humans and supporting you, block your ex-friend and her family and never look back!\n\nNTA",
              "id": 93,
              "comments": [
                {
                  "score": 374,
                  "content": "You’re so right.  If “Anna” had any humanity then watching the seizure would have been a come to Jesus moment from her. She would feel terrible about what happened and beg for forgiveness. Instead she has compounded her abusive behavior by adding her Mom and sister. Disgusting. \nI encourage the OP to tell their friend group what is happening so that they can help protect her.  \nNTA",
                  "id": 94,
                  "comments": [
                    {
                      "score": 144,
                      "content": "That's right, I forgot she'd said op was pretending it to be more serious than it was. While it was happening.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "what’s a come to Jesus moment? i can kind of guess, but what does it actually mean?",
                      "id": 96,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": "Exactly, who hears that their family member’s negligence caused someone to suffer a serious injury and starts blaming the injured person?? Obviously they’ve been enabling Anna’s nasty behaviour",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Yeah you're NTA at all. I also have petit mal seizures (don't have a support dog, but still) and I'm thankful that the majority of my friends understand. I'm glad yours do too. That girl is an AH and I'm glad the rest of them stuck up for you. Get rid of her and hang out with the others 🙂\nHope you're feeling better now btw",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Block them.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Block them. they are toxic.  As a mother i would sit my child down and explain the error of her ways and educate her on what seizures can do to a person. She's an ignorant self centered person.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Reply to them with a link to this post",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I hope you just block the whole lot of those folks, OP. Save yourself the mental anguish of their absolute BULL SHIT. You're NTA! Not in a million years would you have been the asshole, in this situation or anything similar. Cut off this person and anyone closely associated with her, because they are NOT good people. The friends who stuck up for you and handed her your ass... THOSE are your people. Keep them, lose the trash. <3",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Block them all and move on with your life. Your friends are right, she's a toxic and obnoxious person",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Op… Please just block them.  You are NTA. I’m so glad you’re ok 💜",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 113,
          "content": "A dear friend of mine died a lot of years ago from hitting her head during an epileptic seizure, the night before her 21st birthday. Fuck Anna.",
          "id": 105,
          "comments": [
            {
              "score": 6,
              "content": "I lost a friend like that too. It sucks SO MUCH.   \n\n\nIf OP wants to drive the point home, that's how Mark Twain's youngest daughter died- seizure in the bathtub.",
              "id": 106,
              "comments": [
                {
                  "score": 2,
                  "content": "Epileptic girl chiming in here; I live with my boyfriend of almost 5 years, and anytime I have a seizure earlier in the day he is extremely wary about me taking a shower or a bath, because he is so worried that I'm going to fall and hit my head. He will deal with me being stinky for a couple of hours to make sure that I am safe.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1842,
      "content": "NTA. I really hope you are OK after the seizure and also hitting your head.\n\nI have to commend your willingness to compromise that you'd risk getting hurt, and then actually getting hurt. I know it's not intentional but it sure got your point across.\n\nIf your \"friend\" was a normal person she would have apologized after the incident, but she doubled down and said you did it essentially on purpose. I think this is where she lost everyone.\n\nTBH, this is the least AH story I've read on the OP. Obviously the AH is this Anna",
      "id": 108,
      "comments": [
        {
          "score": 1238,
          "content": "Thank you so much. I’m okay, I’m honestly used to the seizures by this point. I’m recovering from a pretty gnarly concussion. Also a bit of embarrassment having to explain to the doctors on why I didn’t have Bailey with me lol. But that’s totally my fault. I gave in. But your right. It deffinately got the point across not that I actually intended to have a seizure lol 🙄",
          "id": 109,
          "comments": [
            {
              "score": 589,
              "content": "Can you imagine the thought process it takes to get to \"this person, who needs a service dog 24/7, totally suffered a massive seizure on purpose and made sure they would seriously injur themselves in the process just to spite me!\"...??? Seriously, if you were able to control them, I really doubt you would wake up one day and say \"today seems like a good day for a seizure. I havent had one in a while and I kind of miss the sensation. I think I'll have one!\"",
              "id": 110,
              "comments": [
                {
                  "score": 205,
                  "content": "Honestly it kinda makes me wonder if that's something Anna herself would do. Or at least fake having one. After all she's got a mean streak and likes to be right.\n\nOP, you never gotta apologize for having a service dog. Bailey improves your quality of life, anyone who is uncomfortable with that needs to get over it. It's not like Anna is allergic or phobic, she just doesn't think you should have a service dog, and you don't gotta care what Anna thinks, I guarantee you Bailey is smarter than she is lol.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 106,
                  "content": "I think it’s the way Anna is thinking, because she was being manipulative herself. I wouldn’t be surprised if separating OP from her service dog was a key purpose of the party; as host she forced OP away from her dog, and if nothing had happened Anna would use that in future arguments against OP’s dog being around. So she sees OP’s seizure as a countermove to her own manipulation, instead of the consequences.",
                  "id": 112,
                  "comments": [
                    {
                      "score": 39,
                      "content": "Bingo! \nBesides, the people whose first reaction to some accident or emotion is \"they're just doing it for attention\" are usually the ones that WOULD do something just for attention themselves. I have never in my life saw a friend of mine break down crying and thought \"Ugh, they just want attention\" because, like?? And even if that was true, then I guess they're attention-starved and really need someone to listen to them for once? \n\n\n\nI'll be honest, one person _did_ get me to the point where I would think \"Ugh please not again\" when they had a breakdown, but that's only because I had been his sole emotional support/confidant for 3+ years and I was getting tired of playing therapist while not really having his emotional support in return. If he'd been willing to listen to me maybe I wouldn't have been annoyed, but each time felt like I was talking to a wall and it wore me down immensely, especially because anything I said to calm him down was immediately shot down with \"You're my friend, you're just saying this to cheer me up\".\n\nOn top of that, I did not feel like he could be there for me when I needed it: if I had a breakdown, he would either try to make me smile ignoring the events (like, dance around in a silly way to make me giggle) or he'd downplay my worries, and neither helped. This is not counting all the times he said that seeing me cry was making him ache with helplessness, to the point he'd start crying too and blame himself so the cycle repeated: I would have to stop thinking about my issue and console him about his, mine always ending unresolved. After a few times of that, I just straight up stopped telling him stuff that upset me. And after a few more, I realised that I needed to distance myself from this person.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Astute observation, and sadly quite plausible.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "I bet Ana thinks op is faking for attention. Super not okay.",
                  "id": 115,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Warn them that if they don't stop harassing you you will 1. Make a police complaint for harassment and 2 sue them for the hospital Bill and Trauma suffered. NTA",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "My brother did not suffer from epilepsy, but he still died from falling and hitting his head, while just walking. This is serious stuff. Anna talked you into *risking your life* and is now harassing you about it. \n\nI don’t think she understands just how much legal jeopardy she’s putting herself in if you decide to sue. Which I think you should seriously consider doing, especially if the harassment doesn’t stop immediately.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I know you’re young. But from here on out, for your safety, OP, you should just leave if someone makes a wacky request like this.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Don't compromise your health ever again. As a Canadian taxpayer, we all need to use our health care responsibly and that means not taking unnecessary risks to placate our annoying friends.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Man... With more and more people FAKING service dogs (just buying a service dog vest and slapping it on their dog to bring them everywhere), it just makes it way harder for legitimate people like you who truly has and needs them. \n\nI'm not sure if this plays a role in your ex friend's thinking, but considering she has been your friend for awhile I'd assume she had seen you having seizures before and knows you genuinely need one!",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Is there anything you can do to prevent them once Bailey signals you, or does it allow you to get to a safe space?",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Definitely NTA. And I hope this is not an offensive question, I am just genuinely curious - how would it have helped if Bailey had been with you at the time? But again, NTA.",
              "id": 122,
              "comments": [
                {
                  "score": 11,
                  "content": "I’ve written about this and certain dogs can sense minutes to hours in advance that the person is going to have a seizure and alert them so they can get to a safe place and avoid injury. There have been studies of this but it’s not yet known how these dogs can tell. One theory is that the person may have very subtle changes in their smell or movements before a seizure that the dog detects. It’s also unknown if all dogs have this ability or just some of them.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "If you have had to miss work go after he for lost income.",
              "id": 124,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Your health should always come before any kind of social reward.\n\nAnna was being a bully and you should never feel as though the resource that is your service animal is subject to \"compromise\" - Bailey is a must and an essential.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 174,
          "content": "Yeah, imagine how horrified everyone else must have been to witness OP's seizure, and then there's Anna complaining that OP got her way as usual, that attention hog. Why would anyone want to be her friend after that?",
          "id": 126,
          "comments": [
            {
              "score": 84,
              "content": "Like telling a blind person that they were at fault for walking into a wall when someone took their dog",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "As I understand it, people can refuse to have service animals in private homes. \n\nBut Anna is completely the AH, she didn’t request OP to not bring the dog in advance, and she obviously is stuck up and attention seeking herself if she is jealous that OP has a service dog and thinks she “fainted for attention”. \n\nAnd if some one does agree to not have their service animal, then an accommodation needs to be arranged, like making sure Op just sits on the couch while friends help with everything.",
          "id": 128,
          "comments": [
            {
              "score": 36,
              "content": "It’s legal to refuse entry to a private home. However, this is a clear case of “legal and moral aren’t the same.” It’s morally abhorrent to try to bar a friend’s service dog from your house unless someone in that house has serious allergies. And even then, like you said, it’s a conversation to have ahead of time.",
              "id": 129,
              "comments": [
                {
                  "score": 3,
                  "content": "Absolutely agree. Anna is such an AH",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yep, it is legal to refuse service animals in your home, and reasonable if someone has a severe allergy or phobia of dogs. But a decent friend would work around it if they can't have a dog in the home for whatever reason. Like, not offer to host your friend who needs a service dog and instead choose places can accommodate their needs. Or just, be a decent human when explaining you can't have their dog inside and don't yell at them, berate them for \"not being able to go anywhere without their dog\", and bully them into leaving the dog outside and causing them to have a medical emergency. But clearly Anna has ALWAYS resented OP having the dog around even in other people's spaces.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "_\"She was trying to say that I passed out for the attention and I got my way like always.\"_\n\nI feel horrible for OP; this person is not their friend. This person means her harm....  Her behaviour before the seizure was unacceptable and cruel, but her behaviour after OP's seizure is downright unhinged. I hope OP informs her friend group/family of the harassment, because this woman is not well. And, if it escalates in anyway, make a formal complaint. This woman is not acting rationally and I urge OP to not take this lightly.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1038,
      "content": "She thinks you faked a seizure? One where you injured yourself badly enough to go to the hospital? All so she can keep insisting that your service dog isn't a valid need?  Either she really is this shallow and stupid or she knows she screwed up big time and can't/won't admit it.\n\nIf Anna has this much hostility towards your dog, she and you are not compatible as friends, even in a group setting. It's up to the rest of your friends to decide who they want to hang out with. And it would be okay if they sometimes hung out with her and sometimes hung out with you (not everyone likes dogs; some people are scared, I get it). However, personally speaking, if one of my friends berated someone for having a service animal, forced the animal outside, and then accused the owner of faking a seizure for attention? I'd be seriously rethinking my friendship with that person.\n\nNTA",
      "id": 133,
      "comments": [
        {
          "score": 983,
          "content": "Yeah, I genuinally think she thinks I can just “stop” if I want to. She has zero understanding. This has been going on for years.. at least the passive aggressive comments about Bailey and me which I don’t understand.. I would get it if Bailey wasn’t fully trained but she’s honestly such a good girl. Like she doesn’t react to people or animals, she stays glued to my side unless I release her… idk what more she wants from me. \n\nAna has made comments on how it’s embarrassing to watch Bailey alert me because I inmidiately get to the floor and wait to see if it passes or if I go unconscious… but I’m sorry that my seizures are an inconvenience? If your embarrassed walk away? \n\nBut yes I totally agree. I feel bad because I didn’t mean to “take” her friends away, but they are all pretty done with her. I’m not the only one she’s treated really badly. If they choose to hang out with her in the future that’s totally fine and their decision but I won’t be apart of it. I can’t have a repeat of this.",
          "id": 134,
          "comments": [
            {
              "score": 468,
              "content": "You absolutely didn't take anyone away from her. She shoved them away. \n\nI thought maybe part of it was her having an issue with dogs in general, but it really does sound like she's jealous of any attention she thinks you're getting. \n\nYour friends saw Anna treat you and Bailey terribly, then saw you injure yourself during a seizure as a direct result of you giving in to her demands. Instead of being worried and apologetic, Anna was mad that you \"got your way again.\" I said in another comment, I wouldn't have to be your friend to be horrified by her behavior.\n\nSome people also just resent anyone that needs any kind of extra aid. I care for my great-aunt. She's on oxygen and sometimes needs a transport chair. It's been eye-opening how many people get annoyed by her chair. In one crowded dr's office a woman even crossed the room to squeeze by us after leaving the restroom, complaining the whole time about how much space we took up. Her husband was sitting across the room, saving her seat, but she'd been eyeballing us since we entered the waiting room. As if my aunt wanted to be in the chair. Anna is going to be this woman in another 40 years.",
              "id": 135,
              "comments": [
                {
                  "score": 319,
                  "content": "That’s horrifying with your aunt. I’m so sorry that happened to you guys. She never deserves that. :(\n\nI was wondering if it’s the dog thing but I don’t think so. Baileys a lab, and Ana has her own dog as well (abit smaller then Bailey) but her family has they’re dogs they grew up with. One a husky cross and another one is some sort of little breed. I just can’t see it being this.\n\nBut yes it deff could just be jealousy. She’s a very jealous person so it wouldn’t surprise me.",
                  "id": 136,
                  "comments": [
                    {
                      "score": 182,
                      "content": "Then yeah, I'd bet she's just ridiculously jealous because she thinks you and Bailey draw attention away from her. You're better off without her, and it sounds like your other friends feel the same.\n\nYou should block Anna and her family. They all sound like they're from the same poisonous tree!",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Also since you said that Bailey doesn't react to other people... so therefore won't give Ana any attention, right?\n\nThat's just SO RUDE of the dog, how dare Bailey prefer you over Ana??! She's a dog person, don't you know?!! /s",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "If she's fine with dogs, I wonder if the jealousy comes from you being able to take your dog everywhere with you (rightfully), but that she can't.",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "She kind of sounds like a narcissist tbh. Usually there are big blow outs like this when a narcissist reveals themselves. Just sucks you got so injured :(",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "This was already one of the most clear NTA I've ever seen, and Anna one of the biggest assholes I've ever seen, and then SHE HAS A DOG??? Are you FUCKING kidding me? What a horrible, disgusting, infantile *asshat*. OP, the only thing you should've done differently was not being friends with her in the first place - and I definitely don't blame you for that! I'm glad to see your other friends found this unacceptable, that gives me hope for them. Stay far, far away from Anna (don't just 'take space', say goodbye forever). Good luck, OP. Tell Bailey good girl from me",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "if I had been at that party and didn't know you, my friendship with Ana would have ended that night. fucking period\n\neven if you hadn't got hurt and she just made a stink about a service dog, I would have been like what the actual fuck is wrong with this person   \n\nyou didn't take her friends away, she drove them away as aggressively as possible",
              "id": 142,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Regarding \"taking friends\" - people have minds of their own. I know you pity her, but try to remember she made her own bed, and that your friends decide for themselves who they want to be around. I know it's hard to do if you have people saying someone stole someone else's friends away, but that's not possible to do. People choose how to spend their time, and if they choose not to spend it with Anna, let them choose that.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Anna is the AH who is probably jealous at the attention you get- as if you wouldn’t trade it all to not have debilitating seizures. \n\nI think she has a right to not want a dog in her house, and I think service dogs can’t override a home owners rules. But she is the AH for assuming you wouldn’t have Bailey, bullying you to leave her outside when you weren’t comfortable, or arranging things in the house to help protect you from a seizure.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "No my friend, Anna's nasty behavior and jealousy took her friends away. Not you!",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Good lord. She is infuriatingly ignorant and dumb. It's insane that she seems to think this is just some silly thing you're willfully doing for fun and attention. Seriously, the sheer ignorance of believing your medical condition simply just does not exist!! That's so absolutely ridiculous and I'll never understand how some people manage to think that way. That she genuinely believes you're just doing all this for attention or something and it's \"embarassing\", rather than the very obvious and very believable truth that you have a medical condition and that you'd love to stop if you were able to but you CAN'T. She has a very strange mind... Something is very off with her. I definitely wouldn't wanna be friends with someone who has such an ignorant and distorted and strange view of life and other people. It says a lot about her that she believes someone would be faking something like that for attention.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I would be really careful that they don’t retaliate or try to hurt bailey. People can be horrible- watch out for things like poison in the yard.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Just seeing this thread, and as someone whose ex-friends accused them of faking their disabilities for attention and sometimes still feels like maybe I was in the wrong for being so public/transparent about my disabilities enough that it \"annoyed\" some people.......not only can I agree you are categorically NTA and I'm glad you're blocking them, but you've inspired me to do the same and stop feeling the least bit guilty. They probably would have eventually caused me to get injured too if they hadn't destroyed the friendship sooner. Ableists can fuck off.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I don’t even know how it would be possible to deliberately fake a seizure to the point of smashing your head off of the floor. I don’t think anyone is capable of that except severely mentally unwell people.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 459,
      "content": "Nta make sure your friends know about the continuing harassment from her family. Your friends deserve to know that they did the right thing. Seeing her sick her family on you will reassure them they were right about her",
      "id": 150,
      "comments": [
        {
          "score": 366,
          "content": "I’ll definitely fill them in tomorrow. I wanted to wait until I had some feedback from this post because I didn’t want to slander her with our friends if I was in fact in the wrong. But it sounds like my gut instinct was correct so I’ll deffinately be talking to everyone tomorrow",
          "id": 151,
          "comments": [
            {
              "score": 122,
              "content": "It’s not slander if it’s true. Definitely NTA!",
              "id": 152,
              "comments": [
                {
                  "score": 5,
                  "content": "It’s slander BECAUSE it’s true /s",
                  "id": 153,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "Please give us an update after you block her family and tell your friends about the harassment. If it’s not too much trouble I’d also LOVE to hear more about how they chewed her out. Listening to terrible people getting karma fuels me 😂",
              "id": 154,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "please tell your friends and show them the reciepts. You’re definitely NTA- your service dog is a medical necessity and she denied you access because she doesn’t understand epilepsy, it’s like taking away someone’s wheelchair just because they have legs. And your friends are doing a good job for calling Anna out for being a toxic witch, it sounds like this maybe had been building up from past actions and this was the impetus in everyone finally cutting her out. \n\nTbh i kind of wish your friends would have created more of a stink in letting Anna have her way with excluding Bailey but it also kind of sounds like this was a continuous “don’t rock the boat” type situation with her? But i’m glad they all understand how fucked up this situation is and they need to know how Anna and your family continues to harass you. I know if my friend was being harassed by such toxic and ignorant individuals and dealing with it alone, i would do everything to help that friend out cuz that is not cool at ALL.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "take screenshots of her family's texts and show your friends.  It's not slander, you have proof",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Send them the screenshots.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Also, your other friends sound awesome.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 289,
      "content": "NTA. Man, I have SO MANY UNCIVIL THINGS to say about Anna. But your friends have said some good ones. Please give Bailey pets from us!",
      "id": 159,
      "comments": [
        {
          "score": 281,
          "content": "Haha, they really unloaded on her from what I was told. I couldn’t say all with the character limit but it was brutal. \n\nBailey is getting all the love and cuddles right now 💕 she’s currently passed out beside me on my bed haha",
          "id": 160,
          "comments": [
            {
              "score": 21,
              "content": "r/petthedamndog",
              "id": 161,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "You are NTA in any way - as everyone else has said. Did someone take care of Bailey when you went to the hospital? Hugs.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I have a civil thing to say about Ana: it sounds like she has narcissistic personality disorder. She might need some health care too. Until she gets it, though, and starts working on her issues, I'd stay the fuck away from her.",
          "id": 163,
          "comments": [
            {
              "score": 3,
              "content": "Yeah, seriously. Honestly you're lucky she pulled this in front of a group, not one on one. I'd never trust her around Bailey, regardless, considering the irrational hatred.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 161,
      "content": "NTA, it's like if you told a diabetic person to not bring insulin with them.",
      "id": 165,
      "comments": [
        {
          "score": 92,
          "content": "I mean, am I the AH for trying to stay alive?",
          "id": 166,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 52,
          "content": "Or complaining that someone's wheelchair is taking up too much room.",
          "id": 167,
          "comments": [
            {
              "score": 17,
              "content": "I'm a wheelchair user, youd be surprised how often I hear that.",
              "id": 168,
              "comments": [
                {
                  "score": 11,
                  "content": "Sadly, I wouldn't. I take care of my great-aunt, who is on oxygen and has to use a transport chair if there's too much walking, and it has been very eye-opening to see how people act.",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "I use a walker and the number of people in public places who try to take it away from me because it takes up too much space is wild.",
              "id": 170,
              "comments": [
                {
                  "score": 2,
                  "content": "That's so insane to me. I used the wheelchair example because I take my great-aunt, who is on oxygen and sometimes needs a transport chair, to her doctor's, etc. It's not everyone, but more than should be-especially at a doctor's office where most patients are elderly! And not everyone has a niece willing to glare them into silence or suggest they move, like I do for my aunt. I'm so sorry you experience something similar. I'd be tempted to hit them with my walker.",
                  "id": 171,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I specifically have a rollator that I can sit in at table height, so at places like restaurants I always request a table and ask them to just remove one of the chairs. Literally does not get in the way any more than a regular chair would. They always say something like “oh we’ll have it right over here” but it’s a spot like 50-60 feet away. Ma’am if there is an emergency, how am I going to get out of here?? If I need my medication (in my rollator bag) who’s gonna get it?? Once I requested a handicapped seat in a theatre and they refused to allow me to sit in my walker like a wheelchair user would (even though they had wheelchair users seated in the area) and instead wanted me to walk down some stairs and into the middle of a row? Ummmm. \n\nI’d be lying if I said I never “accidentally” swiped someone with my wheel because they were blocking the only handicapped accessible door/bathroom stall/ramp lol",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 120,
      "content": "NTA and I’m glad your friends are siding with you. She is just embarrassed and instead of apologizing and acting like a reasonable human she is trying to shift the blame to you. Block her and her family, they are way out of bounds here.",
      "id": 173,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 111,
      "content": "Hell naw you ain’t the AH. NTA NTA NTA!! If I had a friend with a service animal they will always be welcome with me. I hope you’re doing well and please, NEVER be without sweet Bailey. Stay safe my dude.",
      "id": 174,
      "comments": [
        {
          "score": 126,
          "content": "Thank you so much! I learned my lesson and will not be sacrificing Bailey being with me again lol. \n\nShe’s truly the best 🥹 she’s been cuddled up to me since the hospital the other day. 💕💕",
          "id": 175,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 97,
      "content": "NTA. Block Anna and her family. The end. She IS a witch and why would you even TRY to be her friend again- she never had been to you. She is dangerous to you and your dog and I can tell you she is no friend to anyone. Your life is difficult enough, drop the drama queen.",
      "id": 176,
      "comments": [
        {
          "score": 2,
          "content": "[removed]",
          "id": 177,
          "comments": [
            {
              "score": 5,
              "content": "A comment so nice, it was stolen twice. \n\nThis is a bot, and the second one to steal this comment.\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/11rocta/aita_for_getting_my_ex_friend_kicked_out_of_our/",
              "id": 178,
              "comments": [
                {
                  "score": 2,
                  "content": "Lol stolen twice? Bingo xD",
                  "id": 179,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}