{
  "post content": "My son Joseph “Joe” is 6 years old. When he was born I wanted him to know both English & Spanish because most of my family speaks only Spanish on my moms side. \n\nI mostly grew up with my dad’s family after my mom passed and because of that, I lost my spanish. I couldn’t properly talk with anyone from her family and took me a while to re-teach myself Spanish. I wanted my son to be able to communicate with them and obviously to have the advantage of being bilingual. Now my wife doesn’t speak/understand a word of Spanish so I always played translator. Did encourage her a few times to learn while we were dating but she didn’t want to. \n\nSo yes my son is bilingual and communicates with both our families perfectly. My wife never expressed having any issues with this, only occasionally reminding our son to talk to her in english because sometimes he’ll forget and say something in spanish instead.\n\nMy grandma (Joe’s great-grandma) has been living with us for months. She doesn’t speak English (only a few words) and is very close with Joe. He’s loved having her here and they’re like bffs. They only speak to eachother in spanish. At dinner time I’ll be translating between conversations so my wife understands because again, Joe sometimes forgets, or we’ll have him repeat what he just said to her in English.\n\nMy wife was in a bad mood yesterday and when we talked she said she’s tired of not understanding what our son is saying, feeling left out when he’s talking and like she’s not bonding with him. With that she suggested we enforce Joe to not speak Spanish here at home. \n\nI asked then how’s he supposed to speak with his great grandma and she was quiet.\n\nShe told me she was just frustrated with this and me not “having her back.” Which I don’t think is fair to say. I always translate for her or remind Joe that he needs to speak in English so mommy can understand him too. \nI told her she’s taking things a bit too far by not wanting him to speak Spanish at home AT ALL. He should be free to do so.\n\nI told her if she’s feeling so left out and frustrated with not properly bonding with him, then maybe she should learn some Spanish herself instead of blaming me. I’ll admit, things were tense when I said this so I did say it in a snappy tone. I just thought it was a little ridiculous to restrict him. \n\nIt’s not like he doesn’t talk with her at all. They talk and play everyday. But I guess my grandma being here has made it seem like spanish is all she’s hearing. \n\nBut she’s still mad at me now and I honestly don’t know why making this suggestion was so wrong. Am I missing something here? Was I an a-hole?",
  "id": 1,
  "comments": [
    {
      "score": 4147,
      "content": "NTA\n\nInstead of taking away a valuable life skill from your son your wife should work on herself, this is a her problem.",
      "id": 2,
      "comments": [
        {
          "score": 1170,
          "content": "Wife wants son to take a step back in life so wife doesn't have to take a step forward to keep up. NTA",
          "id": 3,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 272,
          "content": "[deleted]",
          "id": 4,
          "comments": [
            {
              "score": 101,
              "content": "It is what it is!",
              "id": 5,
              "comments": [
                {
                  "score": 39,
                  "content": "I love that so much of the country knows this one expression from that one ad.",
                  "id": 6,
                  "comments": [
                    {
                      "score": 23,
                      "content": "I know it from a joke in Spanish class. There's an ad?",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "What ad is this from?",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Love it Es O Si Que Es!!!!!",
              "id": 9,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 130,
          "content": "This exactly. She's as mad as she is because she knows she's the problem but she's the problem in the first place b/c she's too lazy to learn Spanish, so telling her to fix her problem by learning Spanish must be really annoying for her lazy ass. NTA.",
          "id": 10,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "Also she could use learning Spanish as a way to bond with son if that's really her worry",
          "id": 11,
          "comments": [
            {
              "score": 80,
              "content": "Right? Next time they're playing with cars, ask the kid what \"car\" is in spanish. Then how you say \"the dinosaur drove a car\" and then \"the nice dinosaur drove a car to the moon\" A fun game for the kid, and a spanish lesson for her!",
              "id": 12,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": "She should have been learning along with him, she could have kept up nicely that way.  She's the problem.\n\nNTA",
              "id": 13,
              "comments": [
                {
                  "score": 21,
                  "content": "I second this. I mean he is 6, she had 6 years to practice with the father and him. She is just lazy.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "Being bilingual - especially from a young age - is a huge gift. \n\nAsk your grandma and your son to start including your wife in conversations by teaching her simple words. I understand how she might feel left out (though I don't support her reaction), but if her family begins lovingly and inclusively teaching her, I bet she will find learning Spanish (which is a beautiful language) a fun and exciting project, instead of seeing Spanish as something that alienates her from her son.",
          "id": 15,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "I have to say, too...as languages go, coming from English and picking up Spanish is not very difficult for most people without learning disabilities. It's got a nearly-identical written format, most of the pronunciation is fairly straightforward, and there's no shortage of potential for immersion if you're in the States.",
          "id": 16,
          "comments": [
            {
              "score": 33,
              "content": "She's literally in a house with three Spanish speakers. I don't think immersion will be an issue at all!",
              "id": 17,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "This!!!",
          "id": 18,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1118,
      "content": "NTA \n\nshe can’t have it both ways.  obv she needs to understand some Spanish to communicate with parts of your family. \n\nSpanish isn’t outrageously hard, especially if she can practice with son and you",
      "id": 19,
      "comments": [
        {
          "score": 189,
          "content": "[deleted]",
          "id": 20,
          "comments": [
            {
              "score": 65,
              "content": "Spanish is easy and once you can speak it it's easier to learn languages like French or Italian as there are overlapping elements among them.\n\nIf some weebs can learn Japanese through duolingo and anime then she can lean some Spanish with the help of native speakers.",
              "id": 21,
              "comments": [
                {
                  "score": 15,
                  "content": "I actually took three years of Spanish, two years of French, four years of Latin, and five years of Japanese. I found Latin the easiest to learn for the first year or two, then became way hard. Japanese was hard as heck, but easier than French and Spanish, I think in part because it was so different from English. I never got *anywhere* with French or Spanish, and I really did try. I spent hours upon hours trying to learn them outside of the classroom and outside of my homework. I lost all my French, Spanish, and Latin the moment I stopped taking classes in them. Ten years later, I may have lost a lot of my Japanese, but I still remember quite a bit. I think there are people who just have trouble learning certain other languages.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 7,
                      "content": "That's interesting. I'm from Germany and am pretty good at English, probably somewhere between b2 and c1 level, and I had no problems learning French and Spanish but Japanese is a hard one for me. May I ask methods you used for learning japanese? I am currently trying to learn it via duolingo and it's much harder than any other language I've tried until now.\n\nFor keeping French as a language I can recommend creating an Instagram account and following French meme pages. Memes consist of the most basic words and grammar. You won't acquire fancy language skills that way but you will keep the important stuff.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 44,
          "content": "I'm kinda awful at it, but I try. Apparently I can pronounce pretty well, my receptive Spanish is not terrible, but I can't remember enough vocabulary to communicate.  When I am with a Spanish speaker, though, I give it my all, with lots of apologies. \n\nIf I had a kid or family member, I'd be doing everything possible to get better, classes and practice and the whole shebang.  This mom is... well, not a good mom, really.  Nor acting like a good spouse either.",
          "id": 24,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Tbh isn't Spanish pretty easy aside from the pronunciation?",
          "id": 25,
          "comments": [
            {
              "score": 23,
              "content": "Pronunciation is the easy bit.",
              "id": 26,
              "comments": [
                {
                  "score": 7,
                  "content": "Really? I'm deaf so I don't know, but like, aren't there rolling r's or something?",
                  "id": 27,
                  "comments": [
                    {
                      "score": 30,
                      "content": "There is, but on the whole if you don’t roll the r’s people will know what you’re saying completely fine, you’ll just sound like you have a strong accent. Also pronunciation is pretty logical compared to English so you could read a new word in Spanish and know how it’s pronounced",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "the general theory goes its easier to pronounce because there aren't silent letters and you pronounce everything you see on the page. Making it easier than english for example that has silent letters and different pronunciations. honestly people forgive the rolling r's and they aren't in that many words. \n\nIn practise, depends on the accent. For example in chilean accents they drop a lot of letters, argentians have an different pronunciation for the double lls, and so on. also some letters do change depending on vowels (g's for example).  and tonality changes the meaning of a word (if the last vowel is stressed on a verb it can change the inferred pronoun and tense).\n\nBut its doable and honestly great opportunity having native speakers in the house.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "there are but it's pretty easy to master, and it's very phonetic so there's not a tonne of tricky rules to learn, like how in English 'read' can be pronounced in different ways",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "It's always going to be harder to learn vocabulary and grammar rules than it is to learn pronunciation rules because there are fewer pronunciation rules.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "She's an English speaker so she can understand a lot of Spanish right off. There are tons of cognates between the languages. \n\nNTA, OP.",
          "id": 32,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "If op is in the US, being fluent will be SO HELPFUL to his son. He will ace his Spanish classes and may even be able to skip levels(depending on where he is/what school).",
          "id": 33,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "It’s been over 6 years and she doesn’t even know a little?? I worked a job for less than 6 months and was able to understand some Spanish bc so many of them spoke it and I had two coworkers helping me. After that amount of time you’d think she would just kind of know a little",
          "id": 34,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -5,
          "content": "That argument can go both ways his family could learn English as well, especially the grandma since she moved to an English speaking country. If you move to a country that speaks a different language you should learn that language.",
          "id": 35,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 751,
      "content": "[deleted]",
      "id": 36,
      "comments": [
        {
          "score": 384,
          "content": "My husband is Thai. I know what it's like to be in a situation where I don't understand what's being said around me everytime we visit his family.  My solution was to learn to speak Thai. The answer to her problem is in her own hands",
          "id": 37,
          "comments": [
            {
              "score": 281,
              "content": "I agree she should try, and that she should definitely not be banning their son from speaking Spanish - should actually be encouraging it - but can we stop pretending that it's easy to learn another language - or cost-free, in terms of time and capacity. For example, my parents took us all to a family language class on a saturday, and that meant we stopped going to the family swim class, and that they didn't have a restful saturday - and that us kids couldn't have a sleepover on a friday evening. \n\nMy mum's tried frequently to learn my dad's family language, classes, duolingo, etc. and a) she doesn't actually all the time have the time or energy to fit in language classes on top of, you know, all of the rest of her life, b) languages are not easy for her to learn the way they are for some people and c) she also had a pretty good reason to learn [different language] as well, and learning both together got confusing.*\n\nAnd they've been together 40+ years, and she still cannot keep up when the rels are talking in their language. It is isolating for her at big family gatherings - she just has to lump it, because sometimes there is no perfect solution. You just have to accept being uncomfortable for what is, actually, not that much time in the grand scheme of things.\n\n*Actually, she and dad were/are learning [different language] together. Mum puts in a lot more time, but dad is just better at picking up languages, and he has a head start knowing a related language.",
              "id": 38,
              "comments": [
                {
                  "score": 99,
                  "content": "Exactly, it's not easy to learn another language as an adult. Some people might never grasp it.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 6,
                      "content": "The wife is just kind of lazy. Joe is six.  He's not Neruda.\n\nWife doesn't need C1 Spanish because that's not what Joe speaks.  She needs A1.\n\nI wonder if some of this is resentment of the grandma.  My assessment is out the window if wife is doing a ton of new work for the grandma.",
                      "id": 40,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 80,
                  "content": "Was looking for this comment! English is my second language, and I speak five others (some I grew up with, others like Mandarin I learnt for work). Learning a new language is a biiig investment of time and energy. Plus it takes a while before you can acquire native-level fluency or anywhere close to it. It’s likely gonna take OP’s wife a few months before she’s able to comfortably carry on a conversation in Spanish. I definitely don’t agree with her only-English rule ofc but yeah, I think people who grew up speaking a language often forget how difficult it can be for someone to learn it from scratch. It’s possible for sure but it’s a process.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I only speak 3, but yeah I [agree language learning is hard. My](https://agree.My) ex tried to learn French, and after a few lessons, people asked him to say phrases. I laughed in their face. People who speak one language or multiple by birth have no idea how difficult it can be while not being immersed in it. I compare it to getting a bachelors degree.  It probably takes the same amount of work to be at a decent level. If not more. I worked at a French immersion school, and even by the end of grade 6, I wouldn't have called these kids fluent by any means. They'd been learning and hearing it for 7 years at this point. These kids could have a basic conversation with some minor trouble and order at a restaurant. They could understand it. These kids weren't dumb either.\n\nI started studying  Spanish in grade 10 I took my third class in grade 12. I've been to Spanish speaking countries where I've gotten to practice for 7 weeks(but not at the same time). I have taken a few other courses in Spanish, as an adult, and did the Rosetta stone.  I also am fluent in French, which helps.  I am not fluent in Spanish.  I can have conversations with native speakers. I can order in a restaurant, I could probably teach a beginner's class. But I am not fluent. My vocabulary isn't all there, and I have trouble with past and future verbs. I can conjugate some of them easily, but sometimes I have to think about it. I would not call that fluid and maybe conversational at best.\n\nThis doesn't mean I would discourage anyone from learning or trying. I would simply tell them not to be discouraged if they weren't learning it as fast as they think they should be.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 53,
                  "content": "She doesn’t have to learn how to conjugate a verb in Spanish, but bid she’s genuinely worried about bonding with her son, she could starting out with simple phrases, and learning words with her son.  I can’t speak Spanish, but I know how to exchange greetings and understand what “muy bien. Y tu” means.  She could also be asking “how do you say this is Spanish?”  Or “what’s the Spanish word for this?”  OP’s wife is not doing any of this, and so her feeling left out is totally on her.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 53,
                      "content": "I think my view is: she should be able to bond with her kid, even if the kid was always speaking spanish at dinner - she could do things with her son, without grandma there, she can talk with him in English and his grandma to him in Spanish at dinner. \n\nShe might always be left out of those conversation - my mum can say greetings, she can ask a word, say something's good, but that's not part of a conversation. My brother that speaks none of the language, can generally communicate more (hand gestures, miming, words that sound alike) than she can, trying her best. But *you don't always get to be part of everything*. That's actually okay.\n\nShe never learns Spanish - that should not be the thing that stops her bonding with her son. She might never be part of the conversations he has with his grandma (my mum is not part of the ones my dad has with his cousins) - but she can have her own.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Actually, she doesn't even need to learn to speak it. She could just learn to understand it when it's spoken to her. It seems like she is fine not communicating with the grandparent but wants to understand the conversations get son has. It seems to me that she would reach that goal by working on her listening comprehension. Then even if she responds in english her son would understand her.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -20,
                      "content": "Imagine as a mother needing to learn another language to bond with your own son. This is ludicrous. And no, it doesn’t even work that way, speaking in your mother tongue and in a foreign one is not the same.",
                      "id": 46,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Everyone said awesome stuff below, just want to say I had to scroll way too far for this comment.  As someone who is a little deaf not being able to understand a conversation in you own home is frustrating.  NTA, but hopefully they can figure this out.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "She married and had a kid with someone who's first language is Spanish. It may be hard but she doesn't get to complain or try to hold back her son. She needs to learn Spanish or stop complaining.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 7,
                      "content": "That’s not what OP said.  He lost his Spanish at some point and had to relearn it.  Wife feels alienated and she snapped.  OP doesn’t support her or have her back.   I guarantee wife does a lot of caretaking for the grandma and ifs fed up with feeling left out.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "True. Spanish is my second language, I started learning it in middle school and have now been married to a mexican man for nearly twenty years. I’m a professional interpreter and make my living speaking Spanish, and I’m STILL not native-level. I never will be. \n\nAnd Spanish is classified as one of the easiest languages to learn! Even so, I would say it would take a gifted person five years to reach true fluency.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "It's definitely not easy! I hate learning languages, which sucks because I need a bunch of them to do my work. Learning ancient Greek is not fun, let me tell you! \n\nI honestly don't understand this thing people have where they expect to understand everything being said at all times. My ex husband was Egyptian and his family primarily spoke Arabic (both sides), Armenian (dad's side), Italian (mum's side), and French (both sides). I don't know any of those languages. It never bothered me that I didn't understand every conversation. Most of my friends speak different languages with their families (Polish, Mandarin, Cantonese, Italian, Portuguese, Arabic, etc) so it seems very normal to me not to always understand everything. I've even attended many church services in languages I don't understand for weddings, funerals, baptisms, etc. A three hour mass in Coptic isn't the most interesting thing, but it's not the end of the world either. It seems so insane to me to expect everyone in the world to speak only languages you know, it's just ridiculously self centered. People need to get over themselves!",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "My exes family was Portuguese.  I took years of it and spanish (they knew some Spanish)  and they would speak in broken English or his mom would watch soap on univision . I would test myself.  OPs mother is there living with them. You can learn words by watching tv with them anything. Id utilizing ops mil as my tutor. I could see where she might like one meal in English where OP translated into Spanish but to stop it all together is an awful disservice.    She could also pay attention when you translate and learn the way to say a sentence but sounds like that's hoping for to much.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "My boyfriend is also thai ^~^ but I never met his family and we are not really planning for me to meet them, so i don't really have to learn thai\nAnd i'm kinda glad about it cause I tried but I already failed learning to write it",
              "id": 53,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "The grandmother lives with them so she could also make an effort to English. I say this because I think if someone moves to a country where they speak a different language then you should learn that language if you're going to live there. \n\nSo I don't think that she should have to learn another language in order to feel included in her own house. If it was her going to visit them then yes but this is in her house.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I missread \"arsehole\" as asserole...like an ass casserole, and this is my favorite missread thing ever.",
          "id": 55,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 306,
      "content": "NAH. I understand where you’re coming from and where she’s coming from. It would probably be best for her to learn Spanish to communicate with everyone instead of forcing him to speak English, because that would stunt his language speaking growth. Maybe you could suggest having Joe help in teaching his mom Spanish as a way for them to bond more?\n\nI definitely get that it’s not fun for her to have a language barrier with her son and the rest of her family, and she’s probably a bit jealous. When your son forgets that she doesn’t understand Spanish she might be feeling a little inadequate as well.",
      "id": 56,
      "comments": [
        {
          "score": 121,
          "content": "I agree with you.  I’m currently living in Japan and my children are bilingual. There are times when I don’t understand what they are saying due to them speaking Japanese.  My issue is I have studied Japanese but learning new languages is difficult for me.  I’ve been here for years and still have issues with Japanese.  I’m nowhere near fluent. I want them to be bilingual but I feel frustrated and left out at times even though I’m even trying to learn Japanese.",
          "id": 57,
          "comments": [
            {
              "score": 26,
              "content": "Keep at it. You got this. Stop letting people speak English to you. It so be the fastest way. That and watch j-dramas.",
              "id": 58,
              "comments": [
                {
                  "score": 3,
                  "content": "this! I've seen many vids of people move to Japan without a lick of japanese and they go out and try to speak with the locals and they become fluent in about 3-4 months",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I honestly think the wife is the asshole, not for feeling left out, but to a.] take away a lot of opportunities from this kid and b.] alienate him entirely from a family member he loves and is close to.\n\nAnd if this kid isn't speaking Spanish at home, he's not growing up bilingual. \n\nAnd my god, the wife didn't bother to learn even a few words ans phrases? Like my Spanish is very beginner, but I can at least exchange pleasantries and pick up a few words when my boyfriend's family is speaking. \n\nOP, don't allow your wife to take away your son's relationship with his great-grandmother and a critical life skill because of your wife's insecurity. She didn't want to learn Spanish, which is fine, but she doesn't get to then complain when everyone around her is speaking Spanish (AND she's being included by you translating for her!)",
          "id": 60,
          "comments": [
            {
              "score": 13,
              "content": "I was also surprised the wife has seemingly made no effort to learn Spanish considering it’s the dominant language in her spouses family. She could be doing a few minutes of Duolingo once a night, she could be watching Spanish kids TV to gain language skills, she could take a class locally, she could ask OP for help. I don’t blame her for feeling frustrated but I also think the solution has been in her hands the whole time.",
              "id": 61,
              "comments": [
                {
                  "score": 3,
                  "content": "Seriously, it is a lot of work to become fluent... but after all this time she hasn't at least worked on the basics/pleasantries? Just even made a token effort?",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I agree with you too. The only thing that struck me as odd here is why is it different for wife vs. grandma? They could both try to learn each other’s languages. My guess is that wife is angry that hubby is taking gma’s side again.",
          "id": 63,
          "comments": [
            {
              "score": 10,
              "content": "Exactly- at the end of the day, it’s a bilingual household and everyone who doesn’t speak both languages will have to compromise half the time. It’s unreasonable for her to demand no Spanish, but it’s also unreasonable to exclude her from every group conversation. Plus, even if she went full steam ahead with learning Spanish tomorrow, it’s going to be a while (probably 6 months to a year) before she can converse comfortably- is she just supposed to be left out of virtually all conversations in her own home in the meantime?\n\nIt sounds like a lot of people don’t really understand how difficult it is to learn a language as an adult. If you want to make significant progress, you absolutely need a real teacher, and having a random native speaker “teach” you won’t be anywhere near effective. Plus, until you reach true fluency, speaking and listening takes active effort and it would be exhausting to do that 24/7.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "Because she is a gran gran mam, so super old- learning a language is a lot harder for her.",
              "id": 65,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I think just her suggested solution and everything surrounding it is what makes the wife an AH. The frustration for not being able to understand is perfectly reasonable. But suggesting the son stop being able to communicate with his great grandma just because the wife cant understand is an AH suggestion, and after being told of this getting mad at OP for \"not having her back\" is also kind of an AH move.",
          "id": 66,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -4,
          "content": "I’m sorry but no. The audacity of that mother to ask to BAN her child from speaking Spanish at all is abhorrent. Are her feelings in regards to being left out valid? Of course. But it is privileged as fuck to insist that your child no longer speak to his Grabdmother (essentially what she’s asking). Not only are you keeping him from practicing a life skill but you are forbidding him from playing a part in his culture. Like how childish is this woman. \n\n“Grandma’s getting more attention then me 😭”\nBoo hoo. There are other solutions that don’t make you an asshole. Ask your son to teach you Spanish, the same way you teach him language. Your son already enjoys talking to his mom, wouldn’t it be awesome to talk in another language too? Or even just picking up a few phrases you can practice with him. They can be funny, or meaningful. Or even just asking him what he’s talking about more regularly.\n\nThere are solutions but for some reason she jumped immediately to banning it in her house. The arrogance that displays. And when confronted about how this would cut off Grandma she is silent. She knows it’s wrong, but she’s acting childish.",
          "id": 67,
          "comments": [
            {
              "score": 24,
              "content": "That is super cruel to say. How scandalous and selfish for a mother to graciously host her son’s grandmother at the expense at her own relationship with her son? Seriously. And I come from a bilingual family and raise my kids in a trilingual family. It is really obvious that OP’s wife is sacrificing the most in this relationship with no regard about her own level of comfort in her OWN house. And she snapped. So, no. It goes both ways and asking a balance in language practice inside the home is necessary.",
              "id": 68,
              "comments": [
                {
                  "score": 12,
                  "content": "Thats not whats happening tho. She isnt asking for language balance- shes asking for her language to be the only one respected even though she knows theres another member present who cant speak her language. Also we have 0 idea if she wants the gma there and tbh her comfort shouldnt negatively affect the kids relationship with his gma. On top of that his relationship with his gma isnt \"at the expense of her own relationship with her son\" as she still interacts with and has a relationship with him. Having to ask him to repeat something in english is not a detriment to their relationship unless shes so immature that having to do so makes her want to spend less time with her kid- which is her failing.  What exactly is she sacrificing by living in a bilingual house while insisting on being monolingual other than her ability to call herself a reasonable individual? She could learn spanish or fuck it help gma learn english. Instead shes throwing a tantrum about hearing another language in her own home. \n\n\nFinally you may be from a bilingual family but im from one where the gma was moved in and made it her mission to push my mom out and ended up causing their divorce and this? This aint it. This is a selfish mom who expects her comfort to go before her husbands relationship with her husband and her kids relationship with his gma.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "She didn't ask for a balance. She asked to BAN. As someone who is trilingual Can you imagine if a spouse asked you to not talk in your own language? the one you grew up in? That's the awfulness. the selfishness. I acknowledged that her feelings are valid though. she can find solutions that aren't such a terrible thing to tell a child.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 5,
                      "content": "No, I cannot because my spouse would never let me spend month and month of family time dinner where the primary language used is one I cannot understand. And neither would I submit him to that. She went ballistic because she feels not being taken into consideration. She never said anything before that, so it’s a sign she’s just overwhelmed.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Idk how you are getting downvoted for the best comment ive read so far.",
              "id": 72,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -4,
          "content": "The child can also speak English, there's no language barrier. You don't need to be involved in every conversation, I just cannot understand this mentality. As long as there's one shared language that they can use together that's fine. I didn't understand 95% of conversations that happened with my ex husband's family because they all spoke languages I don't know (Arabic, Armenian, French, and Italian). It literally never bothered me. If I go out on public transit, guaranteed I won't understand most of the languages being spoken. If I go to a friend's house I'm not going to understand the language being spoken there either. It doesn't bother me because I'm not the centre of the universe so I don't expect to be included in every conversation.",
          "id": 73,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 126,
      "content": "YTA. We’re Spanish first with kids in our family and I understand what you’re trying to do for your son. However, you have set up a three against one dynamic in your home. When you are not there your wife is excluded and your grandmother is running the show. \n\nNo one wants a months long houseguest under the best of circumstances. Your grandmother has been staying there and making it difficult for your wife.",
      "id": 74,
      "comments": [
        {
          "score": 94,
          "content": "Thissss! I feel like nobody else has taken into consideration what mom goes through when op isn’t home. While I do agree banning Spanish all together is too extreme, would speaking English only at the table be impossible for anyone other than grandma?",
          "id": 75,
          "comments": [
            {
              "score": 57,
              "content": "Yeah no ones mentioned the added pressure of Grandma moving in.  OP said nothing about any issues so I’m guessing things are going well, I think in Spanish culture multigenerational homes are the norm but I’m not sure.  She might be on edge in other ways but can’t complain, so the language is an easy target.",
              "id": 76,
              "comments": [
                {
                  "score": 4,
                  "content": "I mean thats sad but its a very petty way of being heard. And lacks a real solution",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I dont't think multigenerational houses are that much of a thing in latin and spanish cultures as a whole. I'm spanish (as in, from Spain) and it is certainly not a thing here. I am half Colombian and I don't think it is a thing there either (I might be wrong as my perception is very restricted to what I've seen in my family), although it might be a lot more common. I don't know for the rest of latin América as the diversity of cultures and costums is huge.\n\nHowever family is a big thing in most latin american countries, so I can see how op and op's wife perception of grandma's visit would divert in a big way.\n\nAnyway, I would vote NHA. I think wife propably feels leftout since grandma's been staying, and maybe a bit overwhelmed and a little frustrated because of the long visit. She didn't say anything until now, bottled up her emotions and blew up at op. I can see both their perceptions and think with better communication it wouldn't have come this far.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Wouldn't that just create the same dynamic but just a different person left out?",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "[deleted]",
          "id": 80,
          "comments": [
            {
              "score": 45,
              "content": "Also, the conversations she's being left out of **aren't conversations with her at all**. Those are her son's conversations with his grandmother, or his father, not group conversations.\n\nIf it's such an issue with her that she has to be able to listen in on conversations with other people, then she should learn the language.",
              "id": 81,
              "comments": [
                {
                  "score": 10,
                  "content": "This needs to be higher up.",
                  "id": 82,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "You don’t feel like dinner-table conversation should include everyone?",
                  "id": 83,
                  "comments": [
                    {
                      "score": 1,
                      "content": "It literally - LITERALLY - does.\n\nOP made it clear in the original post, and has posted about it in this thread since, that both he AND his son say everything in BOTH english and Spanish at the dinner table or in group conversations, and he actively translates everything his mother and his wife say for the other one. \n\nHe's gone above and beyond to ensure that his mother and his wife can fully participate. The idea that his mother should just have to be silent and in the dark, because Spanish should be banned from their home, is not only absurd, it's also frankly abusive towards her MIL. (Who she hasn't accused of anything beyond speaking with her grandchild).\n\nThe only conversations that the wife is \"left out of\" are the conversations between the grandmother and her grandchild, which were never intended to include her in the first place.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "EXACTLY. I dont know how so few people get the fact that if what he was saying was relevant to or directed towards the mother, he would say it in English. Or if he accidentally said it in spanish, it isn't that difficult to tell whether someone is talking to you and it would take a quick reminder from the mom, or the son would realize after not getting a response. Just is pretty much complaining that there is now a language barrier preventing her from eavesdropping. I get it can be a bit awkward especially when it is right in front of you, but to say it is so horrible that he should stop speaking the language entirely is ridiculous.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Exactly.\n\nShe's obviously allowed to feel left out. But the actual demand that he stop speaking Spanish is ABSURD.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "[deleted]",
                  "id": 87,
                  "comments": [
                    {
                      "score": 5,
                      "content": "And it's such an incredible LIFE skill, too. It's so substantially valuable in the US to know Spanish. \n\nSomething like 25 million people in the US with Spanish as a first language rate their own ability to speak English as below \"very good.\" That's like 8% of the population who can communicate substantially better in Spanish than English. \n\nIt's just ridiculous to rob her son of this opportunity.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -2,
              "content": "It’s only OP’s side of the story.   Guarantee grandma is running the show pushing gringo wife out the door.   Husband needs to open his eyes to the crap dynamic he created.",
              "id": 89,
              "comments": [
                {
                  "score": 2,
                  "content": "Hope you didn't strain anything with that reach.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 2,
                      "content": "[deleted]",
                      "id": 91,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 0,
                      "content": "Nope, but I cringed reading your dumb s*** comment.",
                      "id": 92,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I dunno man. I'm currently visiting my in laws for more than a month who speak a different language, but I don't mind getting convos translated and learning mandarin myself.  The visit is for my husband",
          "id": 93,
          "comments": [
            {
              "score": 1,
              "content": "Except that’s a visit. This is every meal, every day in her own home.\n\nI love language and I think her request was absurd, but I completely understand her emotional overreaction. This non-stop translation game sounds exhausting.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "Why can’t grandma begin to learn English and have dinners alternate languages?",
          "id": 95,
          "comments": [
            {
              "score": 35,
              "content": ">Why can’t grandma begin to learn English and have dinners alternate languages?\n\nGrandma isn't actually the issue. It's increased the amount of Spanish that her son is speaking, but the father spoke Spanish with him at home anyway. \n\nThe wife hasn't asked that the husband speak English with the son, to balance it out, she's asked that he stop speaking Spanish at home ENTIRELY.\n\nThat tells me that this was something that irritated her before, too. She's angry her kid ever communicates in a way she doesn't understand.\n\nI could give her the benefit of the doubt is she was trying to balance it, so she felt less left out. I wouldn't agree, but I would get it. But I don't accept her argument here at all, it's ridiculous.",
              "id": 96,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 35,
              "content": "Because she's an elderly woman who requires care, and isn't the one who married into a family that speaks a different language to her?",
              "id": 97,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Why does Grandma have to learn English but not the mom?",
              "id": 98,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I don’t really feel like OP implies that grandma is running the show? I think mom should absolutely be learning spanish and if she doesn’t thats on her. That said, maybe OP and their son could work towards including the mom in their spanish conversations more, maybe by teaching her in a fun and family-together way?  OP is certainly not the asshole imo and there should be a compromise",
          "id": 99,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Why isn't the grandmother learning some English to get along better with the mother of her grandbaby? You know, the mom who is also letting the grandmother stay in their house? Grandmother is a rude houseguest and family member.\n\nThe mom should learn some Spanish, no doubt. Same goes. You marry into a family that speaks another language, gotta learn some.\n\nKid deserves to have a multilingual life. He should not have any pressure or tension from the adults on this.",
          "id": 100,
          "comments": [
            {
              "score": 7,
              "content": "Why should an elderly learn a new language but the young useless mom isn't?",
              "id": 101,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Mom is a lazy AH for not even learning basic Spanish terms.",
          "id": 102,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -1,
          "content": "Speak it!   Hell yes!",
          "id": 103,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 101,
      "content": "NTA. Trying to restrict your son's speech was a hair trigger asshole decision, but it sounds like your wife just wants things to be like they were before your grandmother moved in. Which is an undertandable desire, but she has had years to learn something that she knew was important to you and didn't. Hopefully you both don't linger over this too long as there are some pretty easy solutions.",
      "id": 104,
      "comments": [
        {
          "score": 34,
          "content": "I think this is one of those times where we both need a cooling off period before going back to the drawing board to come up with a compromise. I’m hoping it was just the frustration talking and she doesn’t want to actually restrict his spanish at home. I understand where she’s coming from because that used to be me when I was learning Spanish all over again. Its why I always try to include her and get Joe to do the same.",
          "id": 105,
          "comments": [
            {
              "score": 15,
              "content": "OP, one piece of advice: when you go back to the drawing board, please, please be realistic about the amount of time and effort it will take for her to learn Spanish. I know that you said that you had to completely re-learn, but previous exposure (especially as a child) to a language is a HUGE leg up. It’s completely reasonable for you to ask her to learn, but please realize that this is a big think you’re asking for, and be willing to budget time and money for real lessons from a qualified teacher. Consider offering to take on some of her household duties to free up time for her to study. If lessons require a budget sacrifice somewhere else, try to make it something that affects you more than her. \n\nAs a final note, asking you to ban Spanish in the house is 100% wrong. That said, I think you might also be going a bit too far in the other direction by refusing to restrict your son’s Spanish at all. A better way to approach this is to think of it as creating specific time for English. I can’t imagine that, say, designating one meal per day as “English time” would have a negative impact on your son’s Spanish skills, but might go a long way toward making sure that your wife doesn’t feel excluded.",
              "id": 106,
              "comments": [
                {
                  "score": 2,
                  "content": "This response deserves more upvotes.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Has she tried Duolingo? It really is very good at teaching basics granted it's less slang and more vocab but it's a start for her.\n\nPlus if she feels like she isn't bonding with her son could you guys get some child Spanish books and have your son ***help*** translate them with your wife? Or maybe give her a goal to learn something she can say to your son?",
              "id": 108,
              "comments": [
                {
                  "score": 11,
                  "content": "Duolingo is a fine app, a good distraction on the bus, but not a language course - she has native Spanish speakers RIGHT THERE, why can she not get help from one of them? I much prefer your second suggestion.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 79,
      "content": "ESH Your wife only sucks for wanting to take away that skill from her son, although it seems like she does not want to take it away completely.  \nYou suck for being hypocrite. I assume you both live in an English speaking country,  you think for your wife to understand your family she should learn Spanish, but not your family to simply learn English. Your grandmother lives in an English speaking country in a house that is half your wife's and you still expect your wife to be the one to learn another language.",
      "id": 110,
      "comments": [
        {
          "score": 60,
          "content": "Yes, grandma should learn english and wife some Spanish, but the dynamic here excludes your wife and makes it her \"fault\". Why can't the family practice English with her?  It's rude to exclude people from conversations, and unless your wife is a whiz at languages, it takes a long time.  I studied two foreign languages in college and doubt I could hold a conversation in either.  Right now, she is excluded in her own home.  I agree she could learn, but right now you need an answer and her feelings are valid.",
          "id": 111,
          "comments": [
            {
              "score": 5,
              "content": "Except he said he actively plays the role of translator for the group when it IS a group conversation. His wife is angry that she doesn't get to join in on her son's personal conversations with his grandmother.",
              "id": 112,
              "comments": [
                {
                  "score": 5,
                  "content": "If you’ve never actually been in this situation (having a bilingual participant in a conversation translate), it’s easy to imagine that this situation works a LOT better than it actually does. Even with the best possible intentions and translating ability, the person who doesn’t speak the language can’t really participate in the conversation in any meaningful way, and gets maybe 1/4-1/3 of what’s actually being said. Even when you have UN-style simultaneous translation in your ear, if you’re the only one who doesn’t speak the language, you are always left out to a significant degree. It’s completely unreasonable to ban Spanish, but it’s also completely unreasonable to expect the wife to be okay with the husband translating all (or the vast majority of the time).",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "Well yeah. \n\nThe difference between a single woman learning a few things in Spanish and an entire family learning English is a bit ridiculous.\n\nI'm not saying they too couldn't help try too understand english but this is a very old grandma who's probably ecstatic she has a grandson who can communicate with her fully.\n\nShe wants to ban it completely from the house and make it an English speaking only zone, he is 6 that is basically where he spends 95% of his time so yes effectively she has ***banned*** Spanish and basically one half of OP's family unless they can all be fluent English because that's totally fair compared to having your husband translate.\n\nPlus this is their culture she married this man ***knowing*** how his family speak spanish. She decided not to learn and get by and now she has a spanish and English speaking son and she's throwing a paddy because of what exactly? He son having a valuable life skill and her not wanting to put the effort in to understand literally half of what her child is?\n\nDo all of OP's family get to throw a hissy fit when he isn't as comfortable with spanish as English and demand OP's wife learn spanish or be banned from their houses as it is a spanish only zone?",
          "id": 114,
          "comments": [
            {
              "score": 17,
              "content": "Don’t you think the woman who give birth and raises said child is not as well extatic to be able to communicate with her own flesh and blood in her own house? She snapped and wants to ban it altogether because she is making all the sacrifices in this family without any regards for her own comfort. You’ll want her to learn another language to be able to communicate with her own son??? And no, you don’t communicate the same way in your mother tongue than in a 2nd language. You get the sense of intimacy in your own language which I imagine she wants to build with her son. To be able to reach this level you need to nurture an emotional link to the second language and given how she has been excluded in her own house, I wouldn’t blame her if she doesn’t want to.",
              "id": 115,
              "comments": [
                {
                  "score": 24,
                  "content": "She CAN communicate with her son.\n\nShe CAN'T join in on his conversations with his grandmother.\n\nThese are fundamentally different things. She has absolutely no barrier to communicating with her child, as **he is completely fluent in English**. \n\nHe's speaking with his grandmother. He's not speaking with her. She's angry that she doesn't understand that, and her solution is that they not speak at all. It's a ridiculous request.\n\nWhat she SHOULD do, if this is an issue for her and she's not willing to learn Spanish, is teach her son to naturally play translator and include her.",
                  "id": 116,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "I mean she can he also speaks english? She could steer the convo, have one on one time, read him classic english stories, show him how much language we've picked up from so many other countries. Words Americans have and have made their own there are so many emotional connections she too could have with english if she chose too. \n\nShe is making all the sacrifices, WHAT sacrifices hearing her child be able to speak two languages? The fact that she can remind him and HE does speak english (and I'm sure it's also the other way round with grandma and him slipping with english) that isn't a sacrifice.\n\nNo I don't want her to learn another language to communicate with her son. It would be a nice thing for the WHOLE family to join in on. Why is it okay to force him to just speak English but not force him just just speak Spanish she's the outlier here not spanish speaking family members.\n\nOf course you don't speak the same in your mother tongue which is EXACTLY why her husband and family are sharing this piece of culture with a child that is half from that family. \n\nShe hasn't been excluded from ANYTHING did you even read the post? He translates everything she won't even lift a finger to help learn a culture she damn well married into.\n\nThere are to tonne of things she could do rather than banning one half of an entire family because in 6 years she can't even learn the basics to be included.",
                  "id": 117,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Hosting your husband’s grandma is a sacrifice. Everything you wrote also apply to the father. Last I check, she is in her own home. Last I check she let the Spanish speaking side nurture their culture all they want up to the point of feeling excluded at the dinner table. That is so inconsiderate. And no Op translating is the bare minimum. Op also married in another culture, he needs to respect hers as well.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Except, no? He didn't demand his wife learn English. He said she should learn Spanish IF her not understanding her son's Spanish is an issue with her. It's the direct solution to HER problem.\n\nHe's never demanded she become bilingual, and he gives his mother the same right to choose.\n\nThe difference is that his mother isn't angry that she doesn't understand her grandson's conversations with his mother, but his mother is angry she doesn't understand his conversations with the grandmother.",
          "id": 119,
          "comments": [
            {
              "score": -6,
              "content": "This woman is living in the house that is half the wife's. Have some respect.",
              "id": 120,
              "comments": [
                {
                  "score": 10,
                  "content": "Respect is in line with the situation.\n\nThe wife has no issue with the grandmother. The grandmother is not disrespecting the wife. If that was the case, this entire issue would be an entirely different one.\n\nThe fundamental problem is that she doesn't like not understanding what her son is saying. That's the full story. The grandmother's presence has increased the amount of Spanish being spoken at home, and that's what is leading to her demanding that NO spanish be spoken at home.\n\nShe's being entirely unreasonable here. \n\nTo be clear, I have no issue that the wife FEELS left out. She's entitled to her feelings.\n\nI have issue with her demanding that the husband rob his son of part of his heritage because of it. It's entirely unreasonable.",
                  "id": 121,
                  "comments": [
                    {
                      "score": -1,
                      "content": "They speak Spanish because the grandmother would not understand English. But somehow OP does not care when his own wife does not understand her child. His answer to the wife is \"learn Spanisch\", but his answer to the grandma is \"we will talk the language you understand so you don't have to learn English\". That's illoyal to his wife. There would not be this issue if they spoke English half the time and the rest Spanish, the problem arose when they started speaking Spanish exclusively so the grandma can understand without caring that the mother of the child can't now.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Why should an elderly woman learn a new language and not the useless young woman?",
          "id": 123,
          "comments": [
            {
              "score": 0,
              "content": "Useless young woman?  Wow.  You know next to nothing about her.  Maybe she has tried to learn.  Maybe she has her days full already.",
              "id": 124,
              "comments": [
                {
                  "score": 2,
                  "content": "She had years",
                  "id": 125,
                  "comments": [
                    {
                      "score": -1,
                      "content": "While she had a child and maybe many other responsibilities. OP works out of town, so she seems to have a lot of responsibilities, including grandma.  Do we know if grandma needs extra care provided by the wife.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": -3,
          "content": "Had to scroll too far for this! Presumably you live in an English speaking country so why doesn't your family also learn English? It goes both ways. You're also making your wife feel left out of her own home.\n\nBut I do agree that your wife should try and learn a few words, even if she isn't able to get to the same level of profiency as your son, as it will show your son the value of learning and that she values his heritage.",
          "id": 127,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 75,
      "content": "NTA\n\nIf my spouse or child spoke a different language then me I would try to learn it. It's apart of your child's life, if she wants to connect with him more, she should learn it. If she wants to connect with you and your family more, she should learn it. If she absolutely can't learn it, she needs to learn to live with the fact that you both speak other languages.",
      "id": 128,
      "comments": [
        {
          "score": 1,
          "content": "Right? Of all the work a successful relationship needs, learning your partner's native language is one of the easier and more fun bits!",
          "id": 129,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 75,
      "content": "YTA. I raise my kids in a trilingual family so don’t start on me with the benefit of language learning from a young age. You are totally missing the point. You have an intimate connection with Spanish (your son too) and that’s great. However you totally miss the point that your wife is sacrificing her own level of comfort for you by hosting your grandma, by providing a relationship between your son and grandma. Now you took that for granted and ask her to be either excluded from her own relationship with her son or take another step (again) and learn Spanish. You know very well that it’ll take a loooong time before she reaches a level to build an intimate communication with her son in another language. Even more so in a language that is excluding her right now. You know very well that you need to build an emotional connection with a language to be able to communicate naturally within it. Think again about the absurdity of asking a mother, who is raising her child,  to speak a foreign language to be able to speak with him, just because you confiscate the linguistic space of the house. What you’re accusing her to do, you have already done it to her. She probably snapped and went ballistic with the banning just because you have no regard for her own comfort in her own house and with her own son. Again, we speak 3 languages in my home, no one would even think to exclude anyone the way you did.",
      "id": 130,
      "comments": [
        {
          "score": 28,
          "content": "[deleted]",
          "id": 131,
          "comments": [
            {
              "score": 12,
              "content": "Yeah but grandma could learn some English too. Can’t be doing double standards. Also who is translating for mom when dad is gone all day at work? Kinda alienating the parent if grandma is only speaking Spanish all day. Who knows if grandma says anything mean about the whites lady who won’t learn Spanish for her little chicito",
              "id": 132,
              "comments": [
                {
                  "score": 17,
                  "content": "[deleted]",
                  "id": 133,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Yeah I just read she has some dementia so no winning there. Bruh she is alone all day with her son (young child) and an old woman who can’t speak English. I get how she can feel burnt out. Personally I’m learning another language so my lil one can bond with her grandparents and learn her peoples language but I’m not feeling alienated every day. I get the mom fucked up not learning before but he can have a bit more empathy.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Chiquito*",
                  "id": 135,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -1,
                  "content": "Why should an elderly woman learn a new language and not the useless young woman? He said his grandma is 87.",
                  "id": 136,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I just hosted my MIL for 15months; she speaks Spanish as her first language and it's exhausting feeling like a third wheel in your own home. I even know enough Spanish to follow a conversation okay, but it gets old fast when it's all the time so you never get to relax.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -3,
          "content": "You may have a trilingual family but you might not have this scenario. I’m assuming one way or another everyone in your household can communicate with each other directly. This is a grandma who can’t speak directly with one of her family members. If it was strictly English she would be on an island. OP’s son does communicate and have a relationship with his mother, she isn’t excluded unless the conversation doesn’t involve her",
          "id": 138,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 62,
      "content": "NAH, I’m a bilingual Spanish speaker too. While I agree that what your son should not be banned from speaking Spanish, you ( and a lot of the other responses here ) also gotta keep in mind that learning a whole new isn’t easy or isn’t cheap to do. It sucks to feel alienated in your own household. Maybe her disinterest in learning Spanish before was just her being apprehensive of all the effort and commitment that comes with learning it?",
      "id": 139,
      "comments": [],
      "relation": "No"
    }
  ]
}