{
  "post content": "hi all. i’m a 21 y/o female and i’m not going to my brothers wedding and i need you all to tell me if i’m the asshole for it. (my brother is 24)\n\nfor some backstory, i struggle with my mental health. severe anxiety, severe depression, covid-19 made that so much worse. my brother moved out of home back in 2019 and we used to be really close until he moved out, but i was also close with his now fiancée. \n\nthey both used to text me constantly, ask me how i was doing etc etc, we used to call and even hang out, but then lockdown hit and we could only facetime/call each other. i was one of the first people told that he was proposing to her, he sent me the ring before he showed anyone else and told them, we were really close. i was also really close to his fiancée. \n\nthey got engaged, and the texts slowly faded from her side, she would only text me once a month, maybe twice, i thought ‘oh, okay, planning a wedding, gonna be busy’ and then one day the texts just stopped. i kept texting, i got no response. \n\ncome around to a year before their wedding, all of the bridesmaids are announced, and.. i’m not one of them. okay, cool, it’s their wedding, they can do what they want, i’m genuinely not arsed. groomsmen are announced, and.. my boyfriend is a groomsman?? which is odd, because as far as i’m concerned, my boyfriend and my brother have never had a one on one conversation in the entirety that i have been with him (6 years almost 7). \n\nme and my brother had a huge argument about the way he’s treated me recently, no texts no calls, not being involved in the wedding whereas my partner is?? and my brother blamed it on my mental health. okay, fair one, it’s a bit of a shitter but i can’t *help* it, i just work around it. \n\ni recently got a new job after being laid off due to covid, i’m really proud of myself and i wanted to tell my brother, he literally didn’t even say ‘i’m proud of you.’ he just said ‘cool’, that sucked but moving on👌🏼. \n\ni don’t want to go to this wedding. i don’t want my partner standing up there in a tie that won’t match my dress. i don’t want my partner having photos taken with bridesmaids all matching when i won’t be. i don’t want to sit in a church watching my brother get married and pretend to be happy about it when all he has done for the past year is belittle me and belittle my mental health and use that as a weapon against me. \n\nthroughout all of this, my boyfriend was hospitalised and almost died twice (he’s fine now thank god) neither of them reached out to either of us to see if he was okay. his fiancée hasn’t texted me at all, hasn’t replied to any of my texts or picked up my calls. \n\nAITA? i probably am, but i’m just genuinely really hurt.\n\nEDIT: my boyfriend hasn’t accepted the info of being a groomsman, he’s basing it on how i feel because he isn’t close to my brother at all and even he thinks it’s weird that he was asked. \nnow i have this new job i COULD afford anything they needed to (the wedding is in a year)\n\nEDIT x2:\nthank you all for the comments, i should’ve added more backstory, i guess. here’s more, you change change your opinions if you want- \n\nmy parents were going though a lot last year, they were so close to divorcing which is why my brother and i were a lot closer. during the lockdown, i was my mothers confidant, she came to me with every problem about my dad and put a lot of nasty opinions in my head about him, she had no outlet so she used me, and my brother didn’t think that was cool, he was concerned about my mental health which is why we’re were texting a lot more. \ni was not aware that my mother was also using my brother as a confidant and when things healed up with my dad, i was still left with alot of trauma and unresolved feelings, hence the diagnosis with depression and anxiety, which in turn was a catalyst for a lot of problems with my mother. we used to argue constantly and she would text my brother (who is the GC) and like she did with me and my dad, she swayed opinions. i’m not using this to justify anything at all, i am aware of how mental health affects other people and not just the person with the actual mental health issue, i am just putting this as more history as to why mine and my brothers relationship could’ve become estranged. \n\nit’s not just about the texting or anything, it’s about the way he makes me feel. he constantly belittles me in front of the family despite knowing how much i struggle, and honestly me wondering whether i should go to the wedding is just an accumulation of everything he’s ever said and done to me over the past year, i’m just tired of being belittled by someone who is supposed to love me. \n\nmy brother asking my boyfriend to be a groomsman was not an olive branch, it was a deliberate dig from both him and his fiancée, knowing that i felt upset about not being told something i already assumed (because we had had a conversation prior to him asking my boyfriend about the entire thing and he was super nasty about it) \n\nidk if any of this makes sense, but i’m coming to the conclusion that IATA, and i’m just gonna suck it up and go",
  "id": 1,
  "comments": [
    {
      "score": 1903,
      "content": "I have no judgement because this is bizarre. \n\nMy suggestion is to tell your boyfriend to decline the groomsman ask, go to the wedding, get some free food, show face, leave early and let it be for now. \n\nIt’ll all come to a head eventually but if you try to take a stance right now you will look like the AH and probably won’t be able to rationalize it to your family.",
      "id": 2,
      "comments": [
        {
          "score": 574,
          "content": "I'm with you.  Skipping the wedding completely is petty AF.  \n\nOP: TALK TO YOUR BROTHER.  let him know that you are disappointed that you weren't included in the bridal party and that your boyfriend is coming as your plus one, but not his groomsman.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 353,
          "content": "This seems like the best course of action at the moment for a couple reasons:\n\n1) the wedding is still a year out and a lot can change between now and then. But declining to go now would likely create a lot of drama that isn’t necessary. \n2) re: your boyfriend being asked to be a groomsman: what is telling about this is that he thinks it’s weird. If he thinks it’s weird, its absolutely in his right to decline. \n3) people are allowed to make decisions regarding their wedding however they want, so it is entirely fair for your brother and his fiancé to not ask you to be in the wedding party. What is curious to me is why they didn’t seem prepared for it to be hurtful to you. It seems like there’s a lot more behind your relationship with them falling apart and, honestly, I think that’s the real heart of the matter here. You had a close relationship with them and now you don’t, but you don’t know why. Take some time to reflect, possibly reach out to a therapist, and then see if you can speak with your brother about all of this. (And remember, blaming your mental health is a really easy scapegoat for both you and your brother, but it may not be at fault here)",
          "id": 4,
          "comments": [
            {
              "score": 152,
              "content": "I have to wonder if boyfriend was chosen as a groomsman because they needed to balance out the party and he was a guy they know.",
              "id": 5,
              "comments": [
                {
                  "score": 63,
                  "content": "It is 2021... OP could have had a groomswoman and OP could have been up there supporting him, and the sides would have been balanced...",
                  "id": 6,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Not everyone thinks along these lines. A lot of us are still in the more traditional way of thinking: that the parties have to be balanced and women are bridesmaids and men stand for the groom. Look at the majority of the wedding pics out there. Nothing wrong with either way. Js",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "I 100% agree. Honestly, I thought that's where it was going originally when she mentioned she wasn't going to be a bridesmaid.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "I had a balance bridesmaid because my ex had extra groomsmen.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 7,
                      "content": "My brother got married and the parties ended up uneven so I got to walk with two guys that I’ve known for a very long time, which was fun. We also had a guy in the bridal party. Everyone does that differently though and it’s not one size fits all.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "I can think of a reason why they weren't prepared for it to hurt OP. FSIL is friendly with OP maybe even friends but has better/longer friends/sisters that she wants to be bridesmaids. Not every friend (even good friends) is made a bridesmaid. Some people think it's traditional for SILs to be in the bridal party some don't. Maybe FSIL is in the don't camp. OP can't be a groomsman because of the man part. \n\nTwo decent reasons why OP wouldn't be in the bridal party that wouldn't necessarily hurt OP's feelings.",
              "id": 11,
              "comments": [
                {
                  "score": 12,
                  "content": "Also, traditionally you want the numbers of bridesmaids and groomsman to balance out. When I got married, I had 7ish friends I considered close enough to be groomsman. My wife only could think of 3 people she wanted to be bridesmaids. She eventually padded the numbers up to 5, and I picked my 5 groomsman, but there were definitely a couple guys I would have chosen but didn't because of my wife's smaller list.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I'm not sure why more people aren't seeing this. The bridal party is the choice of the bride, and that's to choose her closest friends that she wants stood by her side when she gets married. Sure, it can be nice to ask your FSIL if you want (I asked mine, but only because we're close), but it's definitely not a must have. Meanwhile, picking groomsmen is down to the groom, her brother, who chose to ask her boyfriend, probably as a consolation that she wasn't chosen to be bridesmaid. Groomswoman may not have occurred to him, making this the next best option.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I was so excited when my SIL asked me to be a bridesmaid because I wasn’t expecting it at all for this very reason. We get along, and we for sure love each other, but aren’t super close so it was a pleasant surprise.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "Yes, hold your head high and attend with the boyfriend, who should not be a member of the wedding party.  Not attending would only validate brother’s/fiance’s viewpoint.",
          "id": 15,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "It's not that bizarre. She said this when asked if her mental health has ever caused her to do something that would effect him:\n\n\"not really, he doesn’t live at home so he hasn’t seen the extent of it, just heard stories from my mother when i was really bad and angry and caused arguments over small things, she would get angry and vent to him and he would get mad at me for upsetting her when i didn’t mean to intentionally\"\n\nWhy would you ask someone like that to be in a wedding which is high stress already?",
          "id": 16,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I agree with this being the best choice.",
          "id": 17,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -4,
          "content": "This",
          "id": 18,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 681,
      "content": "I can't tell you if not going to this wedding is gonna make you the asshole or not. \n\nBut I guarantee you that not going to the wedding is gonna make you look like an asshole to your brother and other members of the family.",
      "id": 19,
      "comments": [
        {
          "score": 104,
          "content": "that’s what i was thinking, but i also don’t just want to go just to ‘keep up appearances’, you know?",
          "id": 20,
          "comments": [
            {
              "score": 220,
              "content": "I guess you have to decide which is worse, don't you?\n\nGoing and having a bad time, or not going and dealing with the familial fallout before and after.",
              "id": 21,
              "comments": [
                {
                  "score": 53,
                  "content": "both of these outcomes SUCK 🤣",
                  "id": 22,
                  "comments": [
                    {
                      "score": 258,
                      "content": "True. In this case I'd look at duration. Going to the wedding will suck for like,  4 hours (get through the wedding, the dinner, listen to a speech or 2 then dip) not going, that fallout could last years and just keep snowballing",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 85,
                      "content": "Why do you have to have a bad time at this wedding though? Boyfriend can decline being part of the wedding party -  totally reasonable since he and brother are not close.  You guys attend together as guests and just enjoy the free food and drinks.\n\nMaybe its your depression talking, but you are coming off as very petty and self absorbed. Nothing you describe suggests they were trying to stick it to you by asking your BF to be a groomsman.  Your SIL probably has more close friends than brother so she didn't have room to ask you and brother needed a warm body to balance the numbers.  \n\nSIL provided emotional support when you were struggling a few months ago, but doesn't see you as a best friend.  She didn't do anything wrong here.\n\nJust out of curiosity, is it a normal thing in your social circle for a boyfriend's tie to match his GF's dress? I've never seen that outside of a prom.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 78,
                      "content": "Sometimes life is about choosing between what hurts and what hurts worse. There’s discomfort and a sucky situation regardless but which one will suck worse - short term, long term?",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "But one of them will give you free food (maybe more than once) and peace of mind later.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "That, unfortunately, is life.  A huge part of life is taking the choice that you find less sucky and trying to make the best of is.\n\nIn this case I'll echo the others saying to have your BF turn down the invite to be a groomsman.  You should still go to the wedding, eat the free food at the reception, visit with those in your family you *do* like, then duck out early.  It's not the perfect option, this is true, but unfortunately we rarely have the perfect option available to us and have to make do with what we've got.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "They do suck. My older brother treated myself, our other siblings, and our parents really shitty upon meeting his now-wife. In the lead up to the wedding he just got even crappier.\n\nThe night before the wedding, my mom was so upset she wanted to skip the wedding and go home. If she left, my siblings and I were prepared to leave as well.\n\nIn the end, we did stay. We stuck together, we smiled for the photos, we were friendly with my brother’s new in-laws. We partied it up at the reception. After we left, I don’t think I’ve spoken to my brother since (and I think he got married in 2017). \n\nIt’s probably petty but at the end of the day, when his in-laws ask about my brother’s lovely family they met at his wedding, he won’t have words to answer them and it makes him look like an asshole. And I’m okay with that. \n\n\nGo with your boyfriend, drink and eat, dance and have fun. Don’t worry about your brother, or his future wife. Chat with your extended family, say hi to people you haven’t seen for a while. You’ll feel worse if you don’t go, especially if there’s fallout with your parents for not going.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Is there anything you can look forward to at the wedding, other than the wedding itself? Are there any family or friends you want to see at the reception? \n\nMaybe if you mentally frame it as a chance to see friends or family, instead of a chance to celebrate the union between two people who have treated you like shit, that can make it easier for you to get through it.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Do you want to work things out with your brother and your family at *any* time in the future? Because refusing to go to a wedding for a close family member, that’s something you can’t take back. That’s always going to be a point of hurt between you two if you take that road.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "It's really a question of which sucks less, and that's 100% up to you. \n\nI'd honestly say it depends on whether you feel like it's worth it to invest in the relationship with your brother (and his fiancee) or not. If you ever want to have a decent relationship with them (and their possible future children), go to the wedding. But also understand that they will never apologize, and they may weaponize your mental health against you again in the future (my guess would be: especially in regard to future children. But I am no psychic so who knows!). \n\nBut if you're already considering going NC or seriously LC because your brother is the golden child - which means the family dynamic is already shitty - and you're done with this, then use this as your final reason to go NC and don't go. \n\nFrankly I think you're NTA either way, but the actual decision is about what you see as the future, or lack thereof, of your relationship with your brother.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "You have time to pull back from them though, and then just go as a neutral party. Offer polite pleasantries and then stay away from them. Expect nothing from them.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "One of the most important lessons I’ve learned in life is that appearances do count. Be the better person and attend the wedding with class and with your +1, who is allowed to gracefully decline the honor of standing up with your brother. \n\nEdited to withhold judgment.",
              "id": 33,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 44,
              "content": "In the long run I think you'd regret not going.However you really do need to sit down with your brother and his future wife and talk things over. I think something happened, or was said that you're either not telling us here, or you honestly don't realize how it was taken by them. I think y'all need a come to the table and talk moment.",
              "id": 34,
              "comments": [
                {
                  "score": 27,
                  "content": "i’ve tried, i tried talking to my brother but he has that sort of, streak (idk how to say this without genuinely sounding like a bellend) whereas the way he was brought up was ‘no one can tell brother that they have an issue because he’s so sensitive and will hold a grudge and you don’t want to lose your relationship with him so you have to suck it up and tell him he’s right’ and he’s brought that into his adulthood where if someone does actually tell him their opinion and he doesn’t agree with it, he cuts them off with zero explanation",
                  "id": 35,
                  "comments": [
                    {
                      "score": 43,
                      "content": "If brother’s so fragile and ego-centric best to keep him at arm’s length because no matter what happens, you’ll always be the one that’s wrong.  Simply an unhealthy, no-win dynamic.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Go so that YOU can show respect for yourself, as well as dispel any rumors that others would create.  Hold your head high, be gracious, but never forget your brother’s abysmal behavior.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Get your boyfriend to decline being part of the wedding party, stop engaging with your brother at all and focus on yourself/your own life, and then go to the wedding with no expectations to engage with them. It is keeping up appearances, but just treat it as an important family event. You aren't going for him, you are going for your family.\n\nCatch up with other family and friends, get food, and then leave as soon as it's polite to do so. Just emotionally distance yourself and move on, while ignoring anything negative which comes from them. Maybe one day they'll reach out, or you just live really separate lifes with little interactions.\n\nNote: your updates do seem to imply your mother has poisoned the well of your relationship with your brother. She has used and abused you both, with no concern other than getting what she needed. It sound like she enjoys doing so as well, she feels entitled to use and mess with people. You need to stop allowing this, and never allow her to ruin your mental health again. Stop talking with her as well, and tell her to get a therapist to work through her problems. Tell her you have no interest in hearing these things.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Keeping up appearances is part of adult life. With family the stakes are higher. Go to the wedding.",
              "id": 39,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 424,
      "content": "[deleted]",
      "id": 40,
      "comments": [
        {
          "score": 67,
          "content": "This.\nA lot of people just have no clue how to deal with those of us with depression - and they may not want to invite us to join things because they worry it will bring everyone down (or, to be generous, that it might stress you out).\n\nBut including your boyfriend in the wedding party and not you???  Nuts!\n\nI am so sorry your brother and his fiancée have proved to be fairweather friends for you.  I know planning a wedding is stressful, but honestly, that’s no excuse for dropping loved ones who need your support.  In reality, when the going gets tough you find out who your real friends are.  And that realization can be sad.\n\nHave your boyfriend decline the groomsman position, but maybe go to the wedding.  Yes, they aren’t the people in your life who they were before but while what they have done has been hurtful, your not going would most likely cause a rift in the family that would be hard to come back from.",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Exactly this one, pls take my humble upvote.",
          "id": 42,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": ">This wedding isn’t about you\n\nForget the event, OP has been ghosted by the fiancee after previously being close. Why should OP support them now? They didn't even pick up the phone when her boyfriend (who they asked to be groomsman) nearly died.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 261,
      "content": "On the specific question of skipping the wedding, I would vote NTA. On the broader situation I would vote E-S-H. \n\nYou are seemingly blind to how much of a drain it can be supporting someone who has mental health issues, and even though your brother gave you that exact reason when you confronted him, you just sort of hand-waved it away. They may have pulled back out of a genuine need to prioritize their own mental health, and I see no consideration of that possibility from you. Having said that, you're making big, positive changes in your life and while it is disappointing that he didn't respond as effusively as you wanted I wouldn't call him an asshole for it. \n\nWhere I think your brother and soon-to-be sister-in-law \\*do\\* become assholes is the baffling invite of your boyfriend as a groomsman. I can understand a misguided desire not to add to your burdens, but I don't understand how they could justify asking your boyfriend to perform that role. \n\nUltimately, I don't think you'd be an asshole for refusing to go to the wedding. I don't think skipping it would help mend your relationship with your brother, but that may not be something you're concerned about. I don't think your boyfriend should accept the groomsman position either way, and it is very weird to me that they thought it was appropriate.",
      "id": 44,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 247,
      "content": "YTA- unpopular opinion, you’re making this all about you. I’m sorry but their relationship, their wedding, and the world doesn’t revolve around you. Stop trying to make yourself the center of attention.",
      "id": 45,
      "comments": [
        {
          "score": 183,
          "content": "Just imagine how this story would sound from the brother's perspective: \"My own sister is skipping my wedding because I don't text her enough, and because my fiancee didn't ask her to be a bridesmaid.\" Yeah I'm sorry OP, but YTA",
          "id": 46,
          "comments": [
            {
              "score": 145,
              "content": "But the brother is putting the boyfriend of the sister in the wedding party, who he doesn't even know well. That is petty af, and insulting to the sister. I don't blame OP for not wanting to go to the wedding at all at this point.",
              "id": 47,
              "comments": [
                {
                  "score": 106,
                  "content": "Not necessarily. The bride might have a lot of super close family/friends that she wants to be bridesmaids whereas the groom may not, and thus he has to just pick people he knows well enough to make the numbers match. This would also explain why OP didn't get picked to be in the wedding. If the fiancee is close with a lot of people but doesn't want a gigantic bridal party she had to draw the line somewhere.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Numbers don't have to match. Asking someone to be in your wedding party is supposed to be an honor, not just a space filler. I don't think the OP needed to be a bridesmaid, but if the brother asked her boyfriend to be in the wedding party just to fill a spot, then he is being an AH.",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -7,
                  "content": "I was puzzled by this as well but if OP and bf have been together almost 7 years, he may have felt the invitation represented inclusion of his little sister without putting on her all the wedding stress.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "“My fiancée and I started ignoring my sister with poor mental health without any prior warning, let her find out on social media I don’t want her involved in my wedding and I also invited her boyfriend I barely know to be a groomsman and blamed it all on her mental health. Do I sound like a major AH?” The answer is yes.",
              "id": 51,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Except \"enough\" is 'at all'.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I think that downplays her brothers actions. \n\n>My own sister is skipping my wedding because I don't text her enough\n\nMore like, because they have no relationship at all. \n\n> and because my fiancee didn't ask her to be a bridesmaid\n\nShe straight up said that she doesn't have an issue with them not asking her to be a bridesmaid, it's that they asked her boyfriend to be a groomsman. I'm with her on that, it's pretty weird. \n\nCompletely not showing up isn't the best way to handle it, but don't act like her brother is completely innocent when he's not.",
              "id": 53,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "But;;; CMN , it’s f****ng petty they invited her partner, who they were not even CLOSE , that’s the worst part in this WHOLE SHITTY THING!!",
              "id": 54,
              "comments": [
                {
                  "score": 44,
                  "content": "If you want to curse, commit to the curse.",
                  "id": 55,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "I agree but note that you can still call people out for using their wedding to purposefully hurt other people. Not enough info here to tell which way this is going.",
          "id": 56,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 178,
      "content": "Ehhhhhhhhhhhhhhh, I mean technically it's an invitation and you're allowed to decline for any reason but you sound like a total brat. I'm sorry you're struggling but if your mental health is super bad, then it wouldn't make sense to ask you to help them out. If you've been unemployed for months and just recently got a job, then it would have been rude for them to ask you to shell out for hair, make up, shoes, purses, parties, gifts, etc that goes along with being in a bridal party.\n\nIf you're not fit for it, then why would they ask you to do it?\n\nTo be petty and cause drama over their wedding is childish and to leave your poor boyfriend in the mix like that? Yuck.\n\nYTA, because of why you're not going.",
      "id": 57,
      "comments": [
        {
          "score": 90,
          "content": "The thing is, they could have at least kept up communications with OP, and warned OP, \"we didn't want to burden you with bridal party duties,\" and asking OP's boyfriend who is not even close/friendly with either the bride or the groom?? That is rubbing salt into the wound, don't you think?",
          "id": 58,
          "comments": [
            {
              "score": 34,
              "content": "I disagree. What brother and future SIL asks the boyfriend who they have no relationship with to be in his wedding but not his sister? Don't you think if it were just that simple that mom, dad, or friends wouldn't have made a stink about it? Who does that? Nobody! I'm telling you, there is so much being left by the OP. What better way to feel justified than to only post shitty, horrible things about the brother and SIL which also gets sympathy and a bunch of big fat you're right they're wrong comments.",
              "id": 59,
              "comments": [
                {
                  "score": 85,
                  "content": "it was a difficult one, they blindsided him in front of the entire immediate family when they asked him yesterday. my brother wants to go golfing on the morning before he gets married and my dad is part of the grooms party, and my brother looked at my partner and said: “you’re coming too. hope you can play golf.” \n\neveryone froze because it was such an offhand comment, my partner said: “what?”\n\n“hope you can play golf, because you’re part of the grooms party.”\n\nit wasn’t even a question of ‘will you/wont you’, he was told that that is what he was doing and if he said no, an even bigger stink would be caused. i mentioned in another comment, the way my brother was brought up was “no one can tell him no because he will get upset and hold a grudge because he’s sensitive and you will lose your relationship with him, you either suck it up or your brother hates you for whatever you did 3 years ago” type upbringing",
                  "id": 60,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Give it up. It's not worth it. Boyfriend should decline the grooms party invite, and honestly if I were you I'd go \"I don't think you actually want me there, so we're not coming\". NTA.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -33,
                      "content": "Asking your BF may have been a compromise…because you weren’t included.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "Maybe they were just missing another groomsman to match the number of bridemaids and thought why not him?",
              "id": 63,
              "comments": [
                {
                  "score": 10,
                  "content": "Very possibly, but I think that is extremely tone-deaf of them if so.",
                  "id": 64,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "I agree. They could have asked, \"is it possible for you/do you want/will you be able to be part of the bridal party? We would love to have you but we will absolutely support your decision if you believe it may become a burden for you.\"",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "Agree. Your brother and future SIL were stuck between a rock and a hard spot all the way around. From every which angle they were damned if they did, damned if the didn't. If you're beginning to feel better now, surprise everyone and put your big girl panties on and fake exuberance and joy if you have to. It's one damn day in your life. Be the bigger person. Get a new dress and shoes and make a great day of it. Unfortunately, they probably didn't know how to talk to you about it. If you don't go, it can make your break your rapport for the rest of your life--and you cannot unring a bell.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "I agree. I think the amount of mental and financial work involved with being in a bridal party is not being considered by op at all, and instead op us focusing on surface things like matching outfits. \nOp, I know it hurts to feel left out, but skipping this wedding is going nuclear on your relationship with your brother. You will look like the villain here.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Good point about the financial angle. I forgot how expensive it can be to be in the bridal party. Maybe they didn't want to make her feel pressured because she was unemployed.",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "These points!",
          "id": 69,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 152,
      "content": "How long do you expect your brother and his fiancee to give you 24/7 attention before they are allowed to focus on each other, their life, their wedding, their issues, covid? Seriously! I'm sorry you struggle with mental illness BUT you don't know what the two of them might be dealing with. When they have a kid are you going to resent the child because they will REALLY have to put you on a back burner? Your post reads me, me, me. I just don't think you're telling the whole story. From what I read YTA not to mention your are being selfish, jealous and childish. If your feelings are hurt just say that. But if your brother is straight up telling you that your mental illness is the issue figure out what exactly he means, work on YOU and go from there. By the way, why was your brother's \"cool\" not good enough for you? Why was he expected to tell you he was proud of you for getting a job?",
      "id": 70,
      "comments": [
        {
          "score": -84,
          "content": "i have worked on myself, i’m not arsed about the wedding, i couldn’t care less whether i’m involved or not, it’s just the accumulation of things - i have never used my brother for emotional support, he’s just been there had i needed him, but i didn’t because he’s his own person with his own home and his own fiancée. that being said, he was the one who told me to get off my ass and go out and get a job despite how hard it was due to the climate of covid, i did exactly that and he could’ve said he was proud of me, and he didn’t🤷🏼‍♀️",
          "id": 71,
          "comments": [
            {
              "score": 90,
              "content": "Edited for formatting because I’m on mobile and it got all screwy\n\nA couple things from someone who’s lived with major depression and anxiety for 26 years:\n\n1. Other people don’t spend as much time thinking about you as you think they do. \n\nI don’t mean this as a slam — I’ve actually found it helps with anxiety to keep that in mind. \n\n(Me: OH MY GOD I’ve been wearing mismatched socks all day; everyone must think I’m an idiot. \nMy husband: how many other people’s socks did you notice today? \nMe: … none?\nHim: so why are you so sure everybody noticed yours? Were they fluorescent or something?) \n\nEssentially, other people aren’t living their lives AT you; they’re just living their lives. And sometimes that means that they get super wrapped up in other things and don’t text or call as often as they used to. \n\n(Nb: there are definitely people out there who do that sort of thing as a deliberate insult, but they’re the exception, not the rule.)\n\nTwo (edit - Reddit kept switching the number back to 1): Partly because of #1 and partly because people aren’t mind readers, they generally don’t know what kind of feedback or support you’re hoping for. \n\nThere are several ways to deal with that, including\n\nA. Tell them what kind of support/feedback you want\n\nB. Don’t tell them and accept that they’re going to miss the mark sometimes\n\nC. Don’t tell them and decide that if they cared about you enough/in the right way, they’d get it right \n\nYou told your brother you’d gotten a job, and you got what sounds like a positive response from him. But because it was the wrong positive response, you found it really upsetting, because you took it to mean that he didn’t care. (Incidentally, it would literally never occur to me to respond to that news with “I’m proud of you.”)\n\nI have this theory that depression is like a behavior-altering parasite. There’s a parasite called Toxoplasma gondii that can only reproduce inside a cat. If a mouse gets it, the parasite makes the mouse attracted to the smell of cats, the mouse gets eaten, and the parasite is back where it wants to be.\n\nDepression is kind of like that — it makes your brain lie to you in ways that make it even harder to get better. It tells you that your brother’s behavior is deliberate because he doesn’t like you. \n\nThat lie is making you withdraw from him to the point of refusing to go to his wedding, which will drive a HUGE wedge between you and him, as well as between you and the rest of your family. Being isolated like that, with a lot of the people you love angry at you, is likely to make the depression worse.\n\nHave you ever looked into cognitive behavioral therapy? It’s not a panacea, but it’s really useful for learning how to recognize harmful thought patterns and assumptions. \n\nI’m withholding judgment, because right now you’re not TA, just confused and hurting. You would be TA if you skipped his wedding, though.",
              "id": 72,
              "comments": [
                {
                  "score": 33,
                  "content": "I also have depression and anxiety. I call it the conspiracy theorist who lives in my head and some of their arguments are convincing. Remembering that no one thinks about you as much as you think about you is really helpful advice.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I love that: the conspiracy theorist who lives in my head! I have depression and anxiety, and I never thought of it this way, but it rang so true for me! I always convince myself that people are all but plotting against me (actually, in my squirrelly brain, sometimes they ARE actually plotting), and this “conspiracy theorist” concept might help me snap back from these dark spells a little faster.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "This is a good response. I can tell a lot of people commenting here don’t have depression and anxiety, so I’m glad to see someone gets it. And as someone who’s been having a hard time with my depression and anxiety recently, you made some good points that I sometimes forget (namely that people aren’t as focused on me in a negative or positive way as much as my brain wants me to believe).",
                  "id": 75,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Thank you. It helps that I’m in my 40s — I’ve had time to learn this stuff, frequently the hard way. Best of luck to you!",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 86,
              "content": "You say it's an accumulation of things but the main thing you decided to talk about was the wedding and him not saying what you expected/wanted him to say. Look, you are young. With luck you still have a good 50+ years left to share, celebrate, and enjoy each other. But that will never happen if you're so hell bent on everything going YOUR way. You either give your brother his day and speak to him after or keep being petty and lose a lot of respect from a lot of people by continuing with your fit. IJS. Either way I really do wish you the best.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 74,
      "content": "YTA. It's your brother's wedding. If you don't want to fuck up your relationship with him forever you need to go. My guess is that this has much less to do with you than you think",
      "id": 78,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 71,
      "content": "So, you're not going to go to his wedding because he hasn't been communicating with you as much over the past year after getting engaged, and trying to enjoy the next stage in his relationship. You are not the center of his attention, you are not the center of her attention anymore. This is your brother, a year of your relationship shifting is nothing. Sounds like you want people to cater to you because of your issues. That is not their responsibility. YTA.",
      "id": 79,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 63,
      "content": "INFO: Has your mental health negatively affected relations or events with your brother?",
      "id": 80,
      "comments": [
        {
          "score": -49,
          "content": "not really, he doesn’t live at home so he hasn’t seen the extent of it, just heard stories from my mother when i was really bad and angry and caused arguments over small things, she would get angry and vent to him and he would get mad at me for upsetting her when i didn’t mean to intentionally",
          "id": 81,
          "comments": [
            {
              "score": 108,
              "content": "Even if you don’t mean to hurt someone you’re still hurting someone. And just because he doesn’t live with you or seen the worst, it has still affected him if he has to hear it from your mother.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "So the answer is actually “yes.”",
              "id": 83,
              "comments": [
                {
                  "score": 15,
                  "content": "Yeeppppp",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Not so much.  Her MOTHER is what is negatively affecting the relationship between her and her brother.    \n\n\nHonestly, OP, your mum sounds like an alienator-type manipulative person.  If she is mad at you, she will make sure the rest of the world is also mad at you. First she does it to your dad and now you?  Not cool.  You have problems with your bro right now, but I think for the sake of your mental health, you need to put some distance between you and your mother as well.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 27,
              "content": ">heard stories from my mother when i was really bad and angry and caused arguments over small things\n\nAny chance this could be contributing to why your brother might try to create some distance on his wedding day?",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I wonder why he doesn't want to include someone who has a history with a bad temper and creating arguments over small things in his wedding party.",
              "id": 87,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}