{
  "post content": "A little background info- I am short. Not incredibly short at five foot 1, but when compared to the rest of my family, it's obvious that I am lacking in stature. And ever since I was 12, it's been a huge \"joke\" at our gatherings. At first it was okay because it only felt like a bit of teasing. But it has constantly been brought up. And when I mean constantly, I mean that I will be sitting in the corner minding my own bussiness, and my cousins or my aunts and uncles will be talking and laughing about me. My grandmother is by far the worst. They don't do this to anyone else, so it sucks when they single me out.\n\nIt's gotten to the point where I am so tired of it. My height was never something I was ashamed of, but with the people I love talking about it, my cousins comparing themselves to me, and my grandmother almost scolding me about it, I just want to grow 5 inches to get them off my back. By now, it has been ingrained in everyone's minds that if they are at least taller than good ol' me, then they're not that bad. It's usually little remarks so I don't want to make a scene, but today I officially mouthed off.\n\nWe were all at my uncle's house this weekend. I was sitting at the table, painting something , when my cousins came in. They were wearing high heels from my grandmother's closet and everyone found it hilarious and adorable. And that was when my uncle said \"Wow, even if OP wore those, she'd barely be bigger than y'all!\" And then my nana said something equally as stupid, something about how I wouldn't even be able to fit in those shoes anyway, with how small everything is about me. Which kind of started mutual \"teasing\" (read- mocking)  That's when I said\n\n\"Yeah guess what, guys? I had a heart condition for the first five years of my life that stunted my growth, and everyone in my dad's family is tiny. At least I have a biological excuse for being short. You don't have excuses as to why you're all a\\*\\*holes.\"\n\neveryone went quiet. My uncle was quick to scold me for the language, and my grandmother said \"We're all trying to be nice, Op. We're teasing you lovingly, giving you attention. Everyone wants attention- would you rather just be all alone, drawing? \" I told her that I would rather be left alone than have to constantly be ridiculed, and then left.\n\nEveryone has been treating me differently and I feel scummy. The youngest person there was eight, and I know I shouldn't have talked like that in front of her. So reddit, AITA ?\n\nedit- I'm a 15 year old girl if that's important",
  "id": 1,
  "comments": [
    {
      "score": 8688,
      "content": "[deleted]",
      "id": 2,
      "comments": [
        {
          "score": 2749,
          "content": "She is freaking 14. Girls that age already have unrealistic expectations of what they are supposed to look like without the entire family chiming in and “teasing them”. Should she have said something before? Maybe, but it is hard to find your voice at that age andthe family needed the kick in the pants. \n\nNTA",
          "id": 3,
          "comments": [
            {
              "score": 831,
              "content": "She says 15 at the end of her post, but your point  stands. NTA whatsoever. I'm 5'1 (shortest in my family) myself & have only been teased about my height a few times by my little brother when he surpassed me. (& it was more of a good-natured '*haha, I'm taller than you now'*, not the sort of ridiculous harassment this poor girl has had to tolerate constantly for who knows how long). There's nothing wrong with being short. \n\nDon't let them guilt you OP, it's ridiculous that they find something so stupid so entertaining that they feel the need to go on & on about it like that. They *know* they're making you feel bad about yourself. I would apologize for using a 'curse word' (you had every right, but for the sake of getting them to listen to you) then tell them that what they've been saying is very hurtful & frustrating to you, & you want them to stop for good. Once you tell them this, that 'teasing' (as they call it) can no longer be excused as 'loving'.",
              "id": 4,
              "comments": [
                {
                  "score": 244,
                  "content": "NTA. Am also 5' 1\". If it was constant, it would drive me crazy. People are fascinated with my height. I was in my 20s and this one guys asks \"what's it like being so short?\" Umm like I know any different. I was feeling like an ass and said \"what's it liking being ugly?\". He shut up.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 36,
                      "content": "NTA I was not aware 5'1 is small enough to be a thing. I met a girl once who is 4'7, wouldn't dare tease her with that, she was fierce. \n\nBetween me and my 4 sisters we make jokes about being 5'1, 2 of them are and the next one is 5'2 and I'm 5'3 so I mainly joke about how small they are compared to my towering height. It's good fun, it's great being small imo.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "It doesn't even matter if she's short, that's no excuse for her family to keep bullying her like that. If someone says no or stop you don't keep doing it! They should apologise.\n\nNTA",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Hey your tall I'm 4'11\"",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "A perfect response! I'm just sorry it got to that point. I just don't get the fascination, it's not even like being short is 'unusual'.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "[deleted]",
                  "id": 10,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Yeah I'm 5'2\" and my brothers are 5'10\" and 6'. I know I'm short and I get teased at work sometimes because next tallest is 5'5\", which doesn't seem like much but it's enough to reach the shelves I can't, or get things from the back of the fridge on the upper shelf that I can't. \n\nGets annoying when certain people keep repeating the same jokes that they've said like a hundred times now over the years I've been there (ok they're not going to get funnier by repeating them dude), but other people will tease and it isn't as bad because not all the time and they're also shorter, and not the same jokes all the time. I'll make short jokes also (like boss will ask someone if they're able to reach something on a higher shelf. I'll make a comment about hope they can because I definitely can't, unless they're ok with me climbing).\n\nBrother's will tease me too, but not constant and mom is also short. I'll tease them back also about their height but also be confused about how some people think my younger brother can be short when his head is already so close to the top of door frames. Like man, let people be able to fit in places. He's tall enough and even if I'm short at least I can fit in the bathtub more easily to be covered by the water better. He has hard a hard enough time fitting in bathtubs as his height.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "The bottom shelf is where they put all the stuff they want kids to bug their parents for!",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "5’2 who is now apparently 5’4 (i dont believe that because my moms supposed to be like 5’3 and i think im a bit shorter). I dont mind being short. I definitely had a problem with it growing up but now i kinda wish i was an even 5 foot. My moms side of the family is short while my dads side has some decent height. I used to really want to be as tall as mu aunt, i was called her twin a lot cause we look alike and acted about the same. Now, im fine with being short, i just need someone there to help with getting things off the shelves lol",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": ">I'm a 15 year old girl",
              "id": 14,
              "comments": [
                {
                  "score": 56,
                  "content": "I apologize! It was a typo. I am mad on your behalf.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "I live in a country where tall equals beautiful. Once, I had two middle aged dudes coming up to me in the street, saying \"you know, you'd be pretty if you weren't so short\". My ex was constantly mad at me for not wearing high heeled shoes, 6 months after my knee surgery, which btw effectively prevented me from wearing them, ever (it's okay, I hate them anyway). I'm 5'3\", I didn't even realize I was SO short until random people started bringing it up on every single occasion. I would be shopping with my tall friends and the clerks would be all over them, while I'd struggle to get any assistance. People would try to cut in lines in front of me or push me off pavements. \"Sorry, I didn't see you\" - dude, you're 15cm taller, I ain't buying it. Being teased about my height had put me on the verge of an eating disorder, because I tried to compensate my \"unattractiveness\" by being skinny. \nSo, what I am trying to say is that even if something is not initially an issue for you, nasty comments will finally drill through your skull and get into your brain, especially when you're young. At 15, I didn't pay attention to those comments. By 17, I was eating a yoghurt per day to make myself appear more \"slender\". OP is NTA, somebody has to put an end to her family's behavior.",
              "id": 16,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 676,
          "content": "Do it once its teasing.\nDo it constantly is bullying",
          "id": 17,
          "comments": [
            {
              "score": 159,
              "content": "exactly! once in a while, and only if the person reacts positively (i.e. genuinely laughing along), is light-hearted. for example, if i laugh super hard, i snort. my mom will always burst into laughter and it will make me laugh harder and probably snort again. OP, you are absolutely NTA!",
              "id": 18,
              "comments": [
                {
                  "score": 27,
                  "content": "I was thinking that it should be pretty fucking obvious OP is not amused, and it made me think of this:\n\n[https://i.pinimg.com/originals/7d/02/c0/7d02c00ae889fe29c85b08b741851861.jpg](https://i.pinimg.com/originals/7d/02/c0/7d02c00ae889fe29c85b08b741851861.jpg)",
                  "id": 19,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Wow, a meme about my family, thanks!",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Very succint.",
              "id": 21,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 202,
          "content": "I'm going to also add on: NTA.\n\nMy family does the teasing thing- one thing gets harped on until someone is an adult, or they speak up about it:\n\nMy grandmother left plastic sheets on the thanksgiving rolls two years in a row? For the last ten years: \"Don't forget about the plastic wrap Ma!\"\n\nI (age 14) ate broccoli that hadn't been cleaned, thus had caterpillars in them that I ate 3.5 of? \"Hey, lets go find those worms for you! You love them worms!\"\n\nMy brother- age 12- (while staying at our maternal grandparent's house for the month) answers the phone \"Hello, this is Ben \\[Maternal Grandparent's Last Name\\]. Who do you want to talk to?\" And it was our Dad- who's last name we have. It was \"Hey Ben \\[Maternal Last Name\\]\" for about six months until he spoke up about it.\n\nMy cousin Aaron whines in a prolonged \"Stoooopp\\~ iiiittt!\" and all the cousins will mock him saying it exactly the same.\n\nMy mother's dog eats my grandfather's hearing aid (approx $1200 to replace) as a puppy. \"You bringing the thousand-dollar-dog with you again?\"\n\nEqual opportunity assholes, that's my whole family. \\*Edit: This ribbing is like 2 to 4 times a year when we meet up- not often.\\*\n\nThis story is not that- this is something no one could help and is not something they should have let go on until OP swore.\n\n(I even have a 'short' side of the family. The Jefferies' are all under 5'3\"- male and female alike. The Taylor Line got a bit bigger; 5'5\" to 5'10\". And by this generation, two more upgrades, my bro and I flirt with 6'+.)",
          "id": 22,
          "comments": [
            {
              "score": 78,
              "content": "the dog thing? kind of funny, the rest of it not so much. sorry you have to deal with a family like this :/",
              "id": 23,
              "comments": [
                {
                  "score": 93,
                  "content": "I'm going to preface this by saying- it's not constant ribbing; think like 2 to 4 times a year for an on-going joke.\n\nAnd I do give as good as I get. The major factor is: if you tell us to stop with a joke, it's done*, buried. No point in it if you're not going to take it as an invitation to join in! My grandma put her foot down on year eleven- she thought the joke had run its course. Great Uncle Jimmy let the worm thing go when I stopped eating his broccoli. Aaron laughs with us (though we don't bring it up anymore).\n\n*Exception on extended family, as the gossip chain may not reach all corners before you meet up again, so a second reminder might be needed.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 25,
                      "content": "sorry i thought you meant in a negative way! hard to tell through just words on a screen lol, i agree there’s a healthy way to tease people as long as everyone’s equally in on it, not in OP’s case where it seems they are the only one getting harped on.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "Yah, we occasionally tease each other in my family, but it's always playful. Like, I'll occasionally remind my cousin of how she got us kicked out of the Easter petting zoo. Or my aunt caused the sink to spray like a fountain a few years ago, and we teased her the rest of the night. Or my other cousin, who opened a giftbox to find clothing, threw it across the room, and said \"Stinkin' clothes!\" when he was a little boy. Or yet another cousin- we had to put the cat food away when she came because she'd eat it as a kid (she always laughs and said, \"You know, it really isn't that bad!\") I get teased occasionally, too-  my family sometimes remind me of the time, as a little girl, I disappeared during a Christmas party and ended up eating all the chocolate kisses off the cookies (I don't remember it but, even if I did, I wouldn't be sorry).\n\nIt's never in a mean way and, if someone was genuinely upset by it, we'd stop for sure. I mean, I have an uncle or two (on each side) that occasionally pushes buttons a LITTLE too much but, even then, it's never too bad.\n\nWhat your family does sounds totally different, OP. They're continuing to... well, basically bully you at this point. It's funny... when the person you're teasing is \"in\" on the joke, and genuinely laughing along. But as soon as they stop, the teasing needs to stop, too. You were NTA at all, OP.",
              "id": 26,
              "comments": [
                {
                  "score": 18,
                  "content": "My gran got caught up in a conversation with my brother and I, the roast she had in the oven burned. She was apologizing at first, but we reassured her that we were fine cutting off the truly inedible bits and not at all upset. At some point she remarked, Look at this mess, I haven't had you stay over for years and on the first night I serve you a crispy critter!\n\nWe lost our shit, stomach-grabbing, tear-streaming laughter. Whenever one of us was done, the other would snicker and we'd both be gone again.\n\nWe have never stopped bringing that up. It's probably what I will contribute to her eulogy someday. She's a damn good sport about it.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I think the big distinction here is these were all silly things your family members did, not inherent and permanent traits. A lot of people here who mention the actual fun jokes their family jas about each other have this similarity. Its not cool to be teasing someone over their inherent state of being.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "This is sharing memories of past good times, and it's important. No one is over-doing it, or poking un-funny \"fun\" at someone who clearly is not laughing.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Height seems to be a \"safe\" mockery for most people. I grew to the soaring height of 4'11\" in a family of mostly 6'+ folks, and the ONLY reason they stopped using my head for an arm rest is because they literally got TOO TALL to reach without stooping.",
          "id": 30,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "NTA Hijacking to let OP know she’s not alone. \n\nI’m a 5’7” tall and 105lb male at 22 years old. The guys at work poke fun at me about it, but they’ve asked me if it would bother me and I gave them the pass so long as it’s not constant. I’m above average intelligence and they know I’m the smartest guy there, so it’s a little back and forth banter. The guy over us, though, takes it to OPs level. He only ever says one of two things to me: do xyz task for work, or a short/skinny joke. Things like he’s going to make me eat peanut butter instead of taking a lunch break, or “it’s windy today, so take a box of tile if you go outside so you don’t blow away”. I really step up to the plate with my other supervisors and even got a raise 3 months early due to how impressed they were. But with HIM I mainly just watch the other guys work because he won’t let me step in. Just last week I had to load 50 boxes of vinyl tiles (50-70lbs each) by myself, which isn’t a problem, but him belittling me while he stands there doing nothing while I work indeed is a problem. Apparently that was so I could get a workout and “put meat on those bones”.",
          "id": 31,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yup, if it comes up again point out that you can't choose what height you are but they sure can choose whether they make you life miserable about it - and that's the bit that's making them the AH.\n\nNTA\n\n5'2\" checking in, I feel your pain.",
          "id": 32,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1559,
      "content": "Nta that’s really shitty of them to pick on you and bully you. Apologise for the swear (edit.to the kids) and that’s it.",
      "id": 33,
      "comments": [
        {
          "score": 450,
          "content": "I wouldn't even apologize for swearing. That wasn't even going that far compared to the teasing OP dealt with\n\nedit: oh I didn't expect this to get a lot of upvotes for a useless reply lol.",
          "id": 34,
          "comments": [
            {
              "score": 72,
              "content": "I meant to the kids xx",
              "id": 35,
              "comments": [
                {
                  "score": 25,
                  "content": "Oh, my bad!",
                  "id": 36,
                  "comments": [
                    {
                      "score": 15,
                      "content": "No worries xx",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "The adults act like kids, focusing so much about height. That shit happens in middle and elementary school",
                  "id": 38,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1021,
      "content": "NTA-glad you spoke up for yourself. And don't feel bad for swearing in front of the kid, she also saw a woman standing up for herself and against bullying, that's also important",
      "id": 39,
      "comments": [
        {
          "score": 122,
          "content": "This. Seems like you're a better example for the eight-year-old than most of the adults in the family, swearing and all. Don't apologize for anything unless and until they apologize for harassing you, and maybe not even then. NTA.",
          "id": 40,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 675,
      "content": "NTA.\n\nWhile you could have brought it up in a non confrontational way, the cursing doesn’t even come close to what they say to you. Plus, they are showing the 8 year old it’s ok to make fun of someone for their appearance if you know them. \n\nHow is teasing supposed to be loving? Is name calling loving? Did they ever think to ask you if it bothers you? And basically your grandmother said they would either tease you or leave you alone- wtf?",
      "id": 41,
      "comments": [
        {
          "score": 162,
          "content": "In my opinion teasing CAN be loving. My family teases out of love, but the main difference is that it's equally distributed and never done with the intention of putting anyone down. What's happening with OP is just downright bullying.",
          "id": 42,
          "comments": [
            {
              "score": 113,
              "content": "Whether it’s loving or abuse is up to the person being teased, not the one doing the reading.",
              "id": 43,
              "comments": [
                {
                  "score": 27,
                  "content": "Yes, that's exactly what I said, that teasing within a family isn't inherently bad. The major difference in my opinion is whether they are willing to stop if someone says they don't like it. My family is willing to do that, because it's always meant as love, but clearly OP's family just like to bully her and disregard her feelings",
                  "id": 44,
                  "comments": [
                    {
                      "score": 22,
                      "content": "I agree with what you’re saying. I was just pointing out whether it is actually bullying or loving isn’t up to the teasers. No matter if they’re pure of thought and mind, they don’t make the decision. And if they get mad about it? Automatics AH",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "And based on her families response, the abuse is the only form of attention they are willing to give her.  It was take the abuse or be shunned.  There was no middle ground of the family not being piles of shit to her.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Maybe teasing can be loving, I don't know. In my experience, teasing is only ever \"loving\" (in quotes intended). I've had two loved ones 'tease' me for things before, and in both cases, they were emotionally abusive, and their \"jokes\" were just thinly veiled excuses to insult me. My mother, my first abuser, would mock me for being girly (I later realized I was a trans woman!) and no matter how high my grades were, would 'jokingly' say it wasn't high enough. \"You got an A? Shame you didn't get that +\". My second abuser, my spouse (who I recently left), would repeatedly joke that I should 'go to wifing school'. Both people slowly chipped away at my self-esteem for years, and I'm still struggling to recover.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 252,
      "content": "NTA\n\n\nyou're not the asshole, they're the assholes",
      "id": 48,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 215,
      "content": "NTA. When I was around twelve or thirteen I went through a sudden growth spurt which put me at around 6'1 (even though I wasn't done growing yet) and it became the subject of casual humor among my family as well. It took me snapping at them before they realized I wasn't appreciative of the constant attention surrounding a physical feature I had no control over in the first place. If you feel like you are being bullied then you are more than entitled to stand your ground. Don't let them invalidate your feelings just because it's convenient for the sake of their own amusement.",
      "id": 49,
      "comments": [
        {
          "score": 8,
          "content": "I almost wish people teased me about being tall more so I could have an escuse to snap at someone lol. A million \"Wow how tall are you?!\" Comments don't really warrent a big reaction but God they're annoying",
          "id": 50,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 160,
      "content": "NTA, and really, at 15 are you sure you're even done growing? Your family members are bullies.",
      "id": 51,
      "comments": [
        {
          "score": 82,
          "content": "I reached my full adult height (5'3\") at 11.",
          "id": 52,
          "comments": [
            {
              "score": 28,
              "content": "Ok, but that's not the case for everybody. And even if it was, that doesn't change the fact that op's family is bullying them.",
              "id": 53,
              "comments": [
                {
                  "score": 48,
                  "content": "Most girls are pretty much done at 15. She won’t grow much after. I",
                  "id": 54,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Luckily there's not really a societal expectation for women to be tall, opposite even. I was reading the post as if she was a boy and could only think to myself \"this is just the start bro...\"",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "[deleted]",
                  "id": 56,
                  "comments": [
                    {
                      "score": 6,
                      "content": "My family must be really weird then.  Most of us got a final growth of a couple inches in our 20s.  I had my first child and 3 years later gained about two inches.\n\nMost of my female friends had their periods by 12 and did not stop growing until at least 18.  It wasn't like they grew half a foot or anything, but a lot of them gained a couple inches.",
                      "id": 57,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "So did I",
              "id": 58,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I think I reached my full adult height (165 cm) when I was 16 or so. But I had my growth spurt later than most girls (around 14 - 15).",
              "id": 59,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 28,
          "content": "I grew 4” between 17-20 years old, was 5’1” as a 15 year old girl - not saying that it will happen for OP, or that there’s anything wrong with her height, but growth spurts can happen late.",
          "id": 60,
          "comments": [
            {
              "score": 13,
              "content": "I was 5’4” at 15, 5’7” when I graduated high school, 5’9” when I was a sophomore in college.  Growth can happen late in females and not in spurts.  Brother is 6’4” and his growth followed the same pattern of bumps here and there.  People grow when they grow.  OP may be maxed out at 5’1” or she may grow a bit more.  Doesn’t invalidate her family being a bunch of stinkers about something she has no control over.\n\nNTA, OP.  Though, I would tell the little ones that you are sorry for using that kind of language when they were around.  Maybe use this as a teaching point - older cousin to younger cousins - about how words matter and you should use your words to treat people with respect.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Girls usually stop growing 1 to 2 years after hitting puberty (aka getting their periods), at least when it come to height.",
          "id": 62,
          "comments": [
            {
              "score": 2,
              "content": "My family have a growth spurt in their early 20's.\nOP might not be at full adult stature yet.\n\nRegardless, this wasn't gentle ribbing, this was them being dicks about somewhat she's not responsible for and you never ridicule a teenage girl's body.\n\nNTA.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Really? \"Are you sure you're done?\" That's what you're going with? Think about what you say before you say it.",
          "id": 64,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "I mean, I hit my full adult height of 4’11” at 12, and I’m pretty sure that at 35 I’m not gonna be doing any more growing.",
          "id": 65,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "She still could grow but it's a low probability because her not growing is most likely due to her medical problems as a child. Same for me, I didn't grow for a whole year when I was 1 due to some medical stuff. You won't get that growth stop back.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "People AFAB *can* have a later growth spurt - my mother had one at 16 - and it's far from uncommon for somebody to gain an inch or two during their first pregnancy, especially if that pregnancy is in their teens or early 20s, but I would assume a 15 year old who already has a period is not going to get much taller.\n\nIt's different for people AMAB - they're more likely to keep growing into their late teens or early 20s.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 144,
      "content": "Wow, a woman who's 5'1\"?!?! Stop the presses! Definitely something worth talking about for years! /s",
      "id": 68,
      "comments": [
        {
          "score": 50,
          "content": "This! I'm 5 feet 1 inch and I'm adorable!",
          "id": 69,
          "comments": [
            {
              "score": 6,
              "content": "NTA, My mom and my sister are both 5’1” pretty normal height.  \n\nIf they change their behavior try to forgive them.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 88,
      "content": "[deleted]",
      "id": 71,
      "comments": [
        {
          "score": 11,
          "content": "This needs more upvotes.",
          "id": 72,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 88,
      "content": "NTA.\n\nCall 'grandma' a wrinkly old liver-spotted prune \\*jokingly\\*, and see how she likes it?\n\nETA: add in 'crone' and 'barren' for more spice, as desired.",
      "id": 73,
      "comments": [
        {
          "score": 4,
          "content": "Tell her that looking at her now, you are wondering if she was ever beautiful or just plain. Follow up: It's just a joke.",
          "id": 74,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Is her favorite movie Crone Alone?",
          "id": 75,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    }
  ]
}