{
  "post content": "I 23F have small boobs. You can’t tell if I’m wearing a bra or not in most tops so when I can, I don’t wear a bra as I find them uncomfortable.\n\nMy friend Kate 25F is getting married and asked me to be a bridesmaid. I accepted and then she texted me privately to ask if I could wear a bra for her wedding as she doesn’t want me to  flash someone. \n\nI tried explaining to her that, the bridesmaid dress she had picked out had full sleeves so you wouldn’t be able to tell as the material is also very thick. \n\nKate got really mad at me and my sister said maybe I should just suck it up and wear a bra. \n\nI just find it to be a weird invasive question as you literally can’t tell if I had a bra on in the first place or not in that dress, and I’m sure no one over there is staring at my chest.",
  "id": 1,
  "comments": [
    {
      "score": 47695,
      "content": "If she’s bringing it up, maybe it’s more noticeable than you think.  Is this really a hill you want to die on? She’s not asking you to color your hair or hide tattoos.  Is this worth threatening a friendship over?\n\nIf that’s much of a burden to you, take it off after the ceremony and photos. \n\nSoft YTA",
      "id": 2,
      "comments": [
        {
          "score": 22735,
          "content": "> If she’s bringing it up, maybe it’s more noticeable than you think.\n\nRight!?\n\n--\n\n^(EDIT: Love it. My highest ever scoring comment was one word, piggybacking on someone else's great comment)",
          "id": 3,
          "comments": [
            {
              "score": 16919,
              "content": "Everyone I’ve ever met who’s said ‘it’s not noticeable’ has been a liar. We can tell. It’s the nips. I’m not here to argue about why men can be braless or how it’s sexist or whatever but maybe your friend just doesn’t want you lookin like you’re smuggling raisins on her wedding day",
              "id": 4,
              "comments": [
                {
                  "score": 10221,
                  "content": "Right? Having small boobs doesn’t mean you have zero nipples. There’s a difference between being unbothered by your nipples peeking through your clothes and them not being visible at all. \n\nYTA in this case OP, your friend doesn’t want your chest buttons exposed at her wedding and that’s reasonable.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 5337,
                      "content": "I think it’s also that it’s a formal occasion, and that’s not a proper look. Man or woman, visible nipples under formal wear isn’t ‘proper’. It’s a wedding, not a hang out or dinner or something where braless wouldn’t matter",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1029,
                      "content": "Pasties exist, it's fine to stick a lil something over them for comfort and to keep nips at bay even if you dont like a full bra.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 627,
                      "content": "Right?\n\n\nIs it absurd that we, as a culture, are somehow prudish about the fact that women have nipples? Yes, especially bc we don't care about men's, and those don't even serve a purpose.\n\n\nBut.\n\n\nWe are. Especially older generations. The bride doesn't want to have a conversation about your nipples with her great aunt Sally ON HER WEDDING DAY. Cover them up so she doesn't have to, ffs. ",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 138,
                      "content": "Ironically, since I’ve gone down in chest size, my nipples show more.  I used to be DD and the constriction of the fabric would flatten my nipples out.  I’m down to a C and wear bras way more often because the nips kinda hang out and poke through.\n\nEdit: spelling.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "I'd bet that this was something pretty stressful for the bride to bring up and she kinda assumed if she was diplomatic (and not like 'hey I don't want visible nipples in my ceremony photos') her friend would immediately accede.\n\nSure some bras can be uncomfortable, but so is basically anything asked of you as a bridesmaid (formal dress, heels, hair and makeup for like 16 hours) and the type of soft bralette, or even pasties!, a small-chested person could get away with isn't even uncomfortable at all. Like meanwhile I'm currently trying to figure out a strapless bra for my 32DDD self for a wedding this spring, lol. It's not explicitly gendered either--my boyfriend would never not wear an undershirt under his button-downs because he doesn't want visible nipples either.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "If the bride had to make this request, i'm guessing nearly every time she sees OP, she also sees her pokey nips.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I feel like a good middle ground might be nipple covers? She's not wearing a bra that might be uncomfortable for her, but still covering visible nipples. If the boobs are as small as she says then nipple covers are perfect.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I had so many friends growing up assume I could go braless whenever because I had small boobs.  Sorry, no.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Yeah, women who think this....\n\n\nIt does NOT matter how small your boobs are. We can tell. TRUST me!!!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Ok. \"chest buttons\" just called to my mind the image of Tim Curry as Dr. Frankenfurter,  then my thoughts did the slow soap opera turn to Nell Campbells famous nip slip. Chest buttons. They do look like half of a snap button. Wouldn't it be hilarious if you knew you found your correct partner because their nipples were like the other half and when you came together you clicked like the front of a western pearl snap shirt?",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1759,
                  "content": "Lol! Every braless girl \"you can't tell\" all the rest of the humans \"yeah we can.\"",
                  "id": 16,
                  "comments": [
                    {
                      "score": 435,
                      "content": "Also \"no one over there is staring at my chest\". Um, yeah. someone undoubtably is.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 192,
                      "content": "I wear undershirts if I’m wearing a dress shirt as a man. If I don’t and there’s even a slight breeze you’ll be seeing my glass cutters.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 93,
                      "content": "In most contexts, I do not care either way. But yes, we often can tell. It is, however, confirmation bias. In case we can not tell, we can not know that we could not tell...",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "It has apparently never occurred to OP that if \"no one can tell\" that she skips wearing a bra often, her friend would have NO reason to request she wear one for the ceremony. I guarantee everyone knows OP as the girl that won't wear a bra, and now she can be known as \"the girl who won't wear a bra to formal events, even when the bride specifically asks\".   \n   OP also needs to stop pretending this stand she is taking is about comfort, there is no part of being a bridesmaid that is comfy.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "Yeah, when I walk my dog first thing in the morning, I throw on a hoodie. But my neighbor can definitely tell I’m braless, judging from the direction of his gaze.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 871,
                  "content": "This reminds me of the time my sister told me she hadn't worn deodorant in months and she swore it made no difference and you couldn't tell.  Now in her defense she has otherwise impeccable hygiene and we live states apart so I had no idea if this was true as I don't see her super often but my BIL's facial expression during this confession definitely said otherwise.  I could not help but laugh at the pained look on his face and that's how my sister found out that only she couldn't smell her.  \nThankfully she has a great sense of humor and very little ego so she laughed pretty hard as well and announced they needed to stop at the drug store on their way home.. apparently. \nWe are often to last to know how wrong we are about these things.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 555,
                      "content": "Every smokers claiming you can't tell that they're a smoker.",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 156,
                      "content": "Her husband did her a favor by making a face. Sometimes all it takes is an 'eeeep' face to get the point across.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "I had a friend who randomly started to be a lil musty sometimes. It wasn't very strong, but it was there. She said she stopped wearing deodorant and no one could tell. I was like ummm actually u smell a little bit like armpit sometimes. She just busted out laughing and was like why didn't u tell me sooner!",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Your sister and brother-in-law honestly sound charming - he was respectful enough not to interfere with her choices about her body, and she was respectful enough to consider his nose once she realised the effect. Aw 🥲",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I wish someone would tell my sister…. And brother…. \nSo bad. Especially cause they go 3+ days without showering.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 634,
                  "content": "ALSO ... I was a bridesmaid and couldn't wear a bra with my dress. Bride was 100% fine with that but I was young and not thinking. Her brother (the photographer) had to photoshop out my nipples from EVERY photo. I love her brother but that's more than I'd ever want him to see of me. Flash photography is not the braless woman's friend.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 146,
                      "content": "OMG! Good point! I had a friend who was in the movies. She wore a dress to Cannes without a bra under it and while she looked fine 99% of the time the flash photos of her on the red carpet left nothing to the imagination.\n\nEdit: \nShe was wearing a black dress by the way so don’t think you can solve this problem with different colors alone.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "THIS!!!^ I am a itty bitty titty committee member in my late 20s and feel like this post screams younger 20s. I am not someone who’s necessarily gotten more conservative with age (maybe just more aware of others?) but I find myself embarrassed over some of the braless choices I made in the past. I was known for always having a nip slip, which i swear was funny to everyone at the time, but looking back it makes me a bit uncomfy and I feel that I definitely I broke some people’s boundaries along the way. I love my body but think it’s more than fair that certain situations call for nipples to be at bay.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 558,
                  "content": "smuggling raisins = HILARIOUS",
                  "id": 31,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Thank you for saying this, the laugh that came out of me when I read that",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "We always said this about my friends mom 🤣",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I did a little chortle",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 354,
                  "content": "And the jiggle, even little ones jiggle when walking and dancing. Nipple pads don't help with that.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 150,
                      "content": "Big boobs jiggle even with a bra on. I’m going to insist that anyone over a C-cup wears a binder to all formal events so we aren’t all burdened with the existence of moving body parts!",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "Jiggle happens even with bras, I am sure the nips are the issue.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Oh no, the jiggle. What ever will the primal males do t the sight of a jiggling tittie",
                      "id": 38,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "So now it’s the jiggle of the boobs that’s distracting ? I could understand nipples but Jesus Christ",
                      "id": 39,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 316,
                  "content": "Yeah unless she’s covering the nips with pasties she will need to wear a bra. A wedding is a formal event: it’s not appropriate to show nipples.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 26,
                      "content": "I have not worn a bra to any wedding or formal event I have ever been invite d to, including my own wedding. And I do not have small breasts. But I was asked by a friend to wear a bra to her wedding in Sept and I will be doing that. If it's important to her, it is important to me.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 254,
                  "content": "And if the dress is long sleeve I would assume it’s cooler out so those nips are popping",
                  "id": 42,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 225,
                  "content": "Smuggling Raisins is gonna be the name of my band.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Cracking me up how many people haven't heard this phrase apparently. This is common vernacular to at least Gen Xers.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 162,
                  "content": "I have small boobs and everyone says \"it must be nice to not have to wear a bra\" but that's the thing, if I don't wear a bra you'll be able to see my nips from a fucking plane when I'm cold😂😂",
                  "id": 45,
                  "comments": [
                    {
                      "score": 12,
                      "content": "YES. Very much same lmao. I actually am attending a wedding this winter and while I could extremely easily not wear a bra, I don't wanna be very obviously hi-beaming 175 people I don't know for like five hours. At least in the winter a sticky bra isn't gonna melt off!",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I have tiny boobs (barely 32AA) and have to wear bras because they're deflated and uneven, thanks to a past pregnancy.\n\n\n\nPeople always assume small boobs mean you don't have to wear a bra, and they remain cute and perky forever.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "And if it’s a long sleeve dress with thick material I’m going to assume it’s a winter wedding, Aka cold",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 528,
              "content": "That was my first thought. If it’s not noticeable, how would she know to ask you to wear a bra?",
              "id": 49,
              "comments": [
                {
                  "score": 173,
                  "content": "Yeah I’m gonna guess OP’s been noticed not wearing a bra by plenty of people in her life, this friend included. Her friend wouldn’t have felt the need to ask if she’d not regularly noticed before.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 350,
              "content": "Yes to this. If she asked you, you can tell. Even with small breasts you can get stretch marks. I worked with someone who did just as you. If you want to be in the wedding wear one. If it's important to not, don't be in the wedding.",
              "id": 51,
              "comments": [
                {
                  "score": 106,
                  "content": "I have a cup sized boobs but you can definitely still see my nipples through certain shirts and materials.",
                  "id": 52,
                  "comments": [
                    {
                      "score": 4,
                      "content": "My nipples are inwards and they still are noticeable with certain clothes ",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 237,
              "content": "Anyone who says it's not noticeable is lying to themselves. There's no stealth. There's no maybe. You can 100% tell when someone is not wearing a bra.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "A lady I used to work with was small chested and introduced all the ladies in the office to pasties. That could be a nice solution. Cover the nips and still braless.",
              "id": 55,
              "comments": [
                {
                  "score": 8,
                  "content": "As a small-boobed lady, this is exactly the move.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I used to slap bandaids over them, and it worked like a charm👌",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Im a male and work in a team thats mostly female. We all get along and have inapropriate conversations fot an office environment all the time and are a very open team.\n\nThis topic came up last week because its been hot and one of the girls who has large breasts announced that she wishes she didnt have to wear a bra because of the heat but didnt want \"her tits hanging out and everyone seeing her nips\". She got a good laugh from us all. Me being a larger guy said i never wear a bra because of that reason l.\n\n2 of the other girls said they werent wearing a bra but because of their small boobs you couldnt tell. Myself and one of the othet guys both said that we could tell, and that most of the time we can tell if they are wearing a bra or not. Its not because their boobs are big and hang down, or that we are specificall lookong at their cans, but working in an office the temp control swings wildly so it can be hot or cold. Its the nips! its always the nips that gives you away. Cold nips get hard,  its science. Womens clothing can also be thinner and or silkier than most mens shirts so sometimes its more obvious.\n\nWe said we thought they knew we could tell as it was so obvious, even the other women said they could tell. We all just assumed these 2 were fine with their nipples being visible erect in a cold merting room. One was quite embarassed and the other didnt care. It was an ongoing conversation all last week.\n\nPeople cant always tell... but sometimes we can. Nobody sbould care but it can be seen as unprofessional to be doing  a handless point in a meeting room.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "My first thought. Honey, it’s noticeable.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Oml girls who like to go without bras \\*always\\* say \"you can't tell\" and they're always wrong!",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2959,
          "content": "Yup, YTA. I'm a medium chested no bra girl. I honestly think my chest looks better without one. I threw a cocktail party at new year's, and I wasn't wearing a bra. \n\nHowever, I'm aware it's noticeable. If a friend said she was uncomfortable, I'd wear one. _Especially_ to her wedding.  You are making this about you, OP, over a tiny request. It's not about you, and your ultimate comfort is not always important. Now is one of those times you suck it up for the people you love. A little bralette won't hurt you.\n\nPlus, like this commenter said, if there's two people on team bra, it's noticeable.",
          "id": 61,
          "comments": [
            {
              "score": 820,
              "content": "Also realistically depending on the dress the issue might solely be the nipples being visible, in which case OP can buy the $10 silicone nipple covers they sell at basically every box clothing store nowadays (or order online) and it would be just as effective without the pain of straps or wires.",
              "id": 62,
              "comments": [
                {
                  "score": 812,
                  "content": "> OP can buy the $10 silicone nipple covers they sell at basically every box clothing store nowadays\n\n\nAs someone who wears them regularly, she should test out how they look on flash photography with the dress!\n\n\nNormay it's fine. *Normally*. But I recently had a photo taken of me in a thin sweater and the silicone pasties reflected the light to give me laser beam boobs. OP should make sure her dress doesn't have that issue!",
                  "id": 63,
                  "comments": [
                    {
                      "score": 257,
                      "content": "Lol laser beam boobs I’m so sorry, I’ve never had this issue but I can imagine how mortified I’d be",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 178,
                      "content": "\"Laser Beam Boobs\" would be the opening act for \"Smuggling Raisins\"",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 73,
                      "content": "More reason to wear them. Who doesn’t want laser boobs? Pew pew… 😆",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Sorry, but I snorted out loud at this",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 193,
                  "content": "that was my thinking too. I'm very much flat-chested and go braless as often as I can, but it's noticeable because nipples exist, nipple covers is a great suggestion",
                  "id": 68,
                  "comments": [
                    {
                      "score": 8,
                      "content": "[deleted]",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 177,
                  "content": "Or even a bandeau bra; then there are no straps or wires.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "This, or a soft sports bra or bralette. I try a bra with underwire once a year to see if I've changed my mind and.. no. I refuse.\n\nSports bras do a great job at keeping everything covered and in place. If it's a relaxed fit, to me it's the same experience as wearing a crop top.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Or if it's a long sleeve dress like she says, one of those tighter tank top type sports bras or undergarments that don't have underwires.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 180,
              "content": ">If a friend said she was uncomfortable, I'd wear one. _Especially_ to her wedding. \n\n\nI think a wedding is the only situation I would wear a bra if my friend was uncomfortable. Outside of their wedding, if my friend said they were uncomfortable with me not wearing a bra, I would just stop being friends with them.",
              "id": 73,
              "comments": [
                {
                  "score": 29,
                  "content": "Agreed. Huge difference between \"hey make sure your nips aren't visible in photos while you're in the wedding party\" and \"seeing your nipples through your shirt at any point offends me\". If I'm out with friends I'm braless. Honestly unless it's an occasion where I want to wear a pushup bra, I'm braless. But if my nips show through my dress at an event like a wedding, yeah I'm gonna fix that.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Generally speaking, nobody should *have* to wear a bra. \"Close friend specifically asking you to cover up for her wedding\" is one of the few exceptions to this rule. Even then, I can't blame OP for not wanting to - but it would be a stupid hill to die on.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "For all the posts we've seen with some requests brides make of their wedding party and/or guests, this is an extremely reasonable one that is not a hill OP should die on if she wants to remain friends with the bride. There's options out there for OP that will be comfortable (like the silicone covers), and if OP values the bride she'll buckle down and do at least that for her.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 732,
          "content": "I agree, otherwise, why would she mention it? How would she even know? Seems it's noticeable.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 425,
          "content": "And it isn't even going to cost her anything, as she clearly owns AND occasionally wears a bra. \n\nNo soft about it. OP is an AH.",
          "id": 78,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 279,
          "content": "THIS. You can 100% tell when someone isn’t wearing a bra. I have a small chest too, but we still have nipples! This is not an unreasonable request from the Bride at all.",
          "id": 79,
          "comments": [
            {
              "score": 7,
              "content": "My nipples are def still visible through lightly padded bras. Wearing the silicon nipple stickers seems to work best, bra or no bra, and either way my nipples are still noticeable. ",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Yeah, sometimes I wish guys wore bras because their nips can blast through their shirts just as easily too.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 266,
          "content": "Yes! I had really tiny breasts and flat nipples untill i had kids. And even though i admire OPs confidence in not wearing bras (i always wore the pushiest of push up bras), you can see the difference even in small breasts. \nI have read about a lit of demanding brides on SoMe, but i feel this is a really small ask of the bride. OP, do as she asks, and maybe you still can save your friendship",
          "id": 82,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 238,
          "content": "I'm flying home from a wedding right now, there was a small part of the wedding that was held outside, after 20 minutes in that cold you could absolutely tell which brides maids were and were not wearing a bra.",
          "id": 83,
          "comments": [
            {
              "score": 16,
              "content": "People’s nips can still show through a bra or two shirts. It’s not that big of a deal. \n\nBut I do think the OP should wear a bra to the wedding/reception. It’s a small ask.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 213,
          "content": "99% of people who claimed you can' t tell they are not wearing a bra, I could definitely tell.\n\nWe all know bride’s request is bout them nips.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 193,
          "content": "Agreed. Also, aren't there a lot of cute bralettes that are super comfy to wear that would hide any \"slips\" just as well as an underwire bra? (which I assume is the part she finds uncomfortable).\n\nI had my boobs reduced from a G-cup to a C-cup 2 months ago, and apart from the obvious relief in shoulders/neck, the bras I get to wear feel so much better now, I have so many more options. Hard to imagine OP isn't able to find one that works. I also have a friend who has small boobs, who prefers to go braless if she can at all because she is super sensitive to tight/scratchy clothing. Even she found some alternatives to classic bras that she's comfortable with.",
          "id": 86,
          "comments": [
            {
              "score": 155,
              "content": "Yup. Small chested lady here and bralettes are my go- to for work. It’s not a full on bra but it keeps certain bits and pieces covered. \n\nYTA OP. At this point it isn’t even a matter of comfort: undergarments for flat chested ladies definitely exist.",
              "id": 87,
              "comments": [
                {
                  "score": 59,
                  "content": "Small chested lady here also and I love Victoria's Secret wireless bras, for me I don't even notice I'm wearing it. I also wear lightly padded sports bras, also super comfy and no nips show through.\n\nI agree OP is YTA. There are plenty of comfortable options to wear for one day. Suck it up for your friend!",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "Yep. I have tiny boobs and all I wear are bralettes. I don't like the feel of bras with underwire or even defined cups. They feel uncomfortable. Bralettes feel like nothing to me.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 153,
          "content": "This. I am sure it is far more noticeable than the OP thinks and the bride is trying to gently bring this up without being hurtful.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 17323,
      "content": "YTA  You might not not realize it, but it is noticeable if your sister is on Team Bra too. There are plenty of inexpensive, comfortable styles out there.  Try not to make this all about you.",
      "id": 91,
      "comments": [
        {
          "score": 3635,
          "content": "She wouldn't have to spend anything, she owns bras, she just prefers not to wear them.",
          "id": 92,
          "comments": [
            {
              "score": 2389,
              "content": "what’s that quote, “we’ve lost the impact of shame on our society”\n\nridiculous that someone could make such an incredibly reasonable request for their wedding and OP just goes “no thanks, don’t feel like it”",
              "id": 93,
              "comments": [
                {
                  "score": 917,
                  "content": "Not wearing a bra shouldn’t be viewed as shameful anyways! No matter the size or type of breasts. We don’t push men with boobs to wear bras. That said, it’s a small request so OP is soft YA if they choose not to.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 1752,
                      "content": "We push men to wear undershirts to hide their nipples during formal events.",
                      "id": 95,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 610,
                      "content": "But as someone pointed out - at a formal event like a wedding, men wear undershirts. So no, men aren't expected to wear bras, but they do have an expected clothing item.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 144,
                      "content": "My husband is training my 11yo son to wear undershirts because it's expected as part of his secondary school uniform and also when he joins the work force. During interviews the panel does take note of your appearance so my husband said it's better to make it a habit from now.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "It’s more that op should feel ashamed for turning down such a small request for someone else’s wedding, not that she should feel ashamed of her body.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "What's shameful isn't not wearing a bra, it's refusing to accommodate a very simple, reasonable request from the bride. The bride has the right to set the dress code, especially for the wedding party, and ignoring that because you want to feel a little more comfy is very entitled behavior. No one would put up with the best man insisting on wearing a T-shirt instead of a suit because it's more comfortable.",
                      "id": 99,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "If she's that small, she could get away with some nipple covers. No bra necessary.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Just because she already owns a bra doesn’t mean it’s one that would necessarily work with the dress. I’m definitely in agreement that she should wear one though.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 489,
          "content": "As a bridesmaid you’re (most likely) already wearing a dress that you wouldn’t choose for yourself as a guest. It’s essentially just part of the outfit you’re asked to wear as a member of the wedding party. \n\nPut a positive spin on it and get some a shapewear bodysuit with cups or something and enjoy looking extra snatched for the day. Or opt for a backless strapless sticky bra. If the bodice is fitted the dress will be doing most of the work anyways, OP will barely notice it’s there.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 127,
          "content": "Exactly, I usually don’t wear bras, but I do wear a thick tank top when I don’t have one on so my nipples aren’t saying hello to the world.",
          "id": 103,
          "comments": [
            {
              "score": 18,
              "content": "Same. I don’t need my nips challenging people to staring contests lol",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "You could even get a bralette with a little modesty padding in it. Problem solved. If you have small blobs then friend isn’t bothered by your boobs sagging. She is bothered by your laser nipples.\n\nEdit: blobs? Keeping it lol",
          "id": 105,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "They have some great sticky ones too that are unnoticeable after a few minutes",
          "id": 106,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10789,
      "content": "you can’t be serious\n\nYTA.\n\nit isn’t a big ask. just wear a bra. why are you even trying to argue against it? she specifically asked for it.",
      "id": 107,
      "comments": [
        {
          "score": 2170,
          "content": "This is what I don't understand. Why is the OP motivated to argue such a simple request.",
          "id": 108,
          "comments": [
            {
              "score": 1949,
              "content": "I wonder if she's really not aware that most people can in fact tell when she is not wearing a bra (and rightfully doesn't care/comment), or if she actually knows perfectly and *want* people to know/notice for some reason; maybe it's a stretch, but this is really a weird hill to die on for someone who simply doesn't like bras but it's indeed able to wear them. Also I can't believe that in 2024 someone can have boobs and not know the existence of nipple pasties, which would be a perfect counter proposal to meet the bride in a middle ground.",
              "id": 109,
              "comments": [
                {
                  "score": 927,
                  "content": "10/10 has pierced nipples",
                  "id": 110,
                  "comments": [
                    {
                      "score": 454,
                      "content": "I laughed out loud at this because I do have those piercings and went from having flat nipples that would barely show in cold weather to \"hey baby 😏\" love buttons who sometimes poke out under my shirt AND bralet! Idgaf and honestly find it pretty sexy, but also make sure to wear something with more coverage for formal occasions because I don't make flashing people my whole personality.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "I had pierced nipples for 16 years and I still wore a damn bra. I didn't want weirdos staring at my tits.",
                      "id": 112,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 375,
                  "content": "She knows everyone can tell, and she welcomes the attention. Which is totally fine and her perogative 99% of the time. But this is one of those 1% times. I don’t understand people that refuse to suck up simple dress codes for a loved ones dress coded event. Literally grow up, OP.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 153,
                      "content": "I had a colleague like that, wearing a lot of extremely skimpy clothes and pretending to be totally oblivious about the attention it would get. Our work place is absolutely informal and no one bats an eye for short shorts or mini skirts, but please wear enough coverage to not flash everyone anytime you sit ☹️",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 112,
                  "content": "Also it's normal to wear stuff you don't necessaraly like on these kind of things. I'm not a huge fan of ties but I gotta do what I gotta do",
                  "id": 115,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I hate wearing dresses and skirts. I still wear them for weddings. I prefer unpadded cotton bras. When I'm doing something more formal, I wear a bra that has shape and a bit of padding to cover my nipples. \n\n\nOP definitely comes off as selfish. She can go braless and commando at her own wedding. More power to her. But don't do it at somebody else's wedding.",
                      "id": 116,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "+1 for \"fuck ties but it's a crime for men to not wear them so we do\"",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I have friends that used to make not wearing bra their personality in uni. They always claimed about how free they are , no one can notice etc. People noticed they were just too polite to point out... They stopped when they joined workforce...",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "To make it all about her, obviously.",
              "id": 119,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 408,
          "content": "If the bride is asking, we can tell. I know you think we can’t tell. But we can. You either believe the truth or not. Doesn’t change what’s true.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 135,
          "content": "Formal dress means discomfort. It’s (unfortunately) just a way of life. Ties, dress shoes, heels, all of it. If it’s a bridge too far for you, don’t go.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "But she would be slightly less comfortable!  /s",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "As a bridesmaid, you’re typically already wearing a dress and shoes that you didn’t pick out for yourself- what’s the difference here? Consider the bra part of the bridesmaid outfit. OP can let the boobies fly free 364 other days of the year.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Right and besides it’s just for one day. You can handle one day.",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Exactly. This is a clear YTA.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7662,
      "content": "YTA\nShe brought it up because usually its well noticeable and you will not die being dressed properly to a wedding.",
      "id": 126,
      "comments": [
        {
          "score": 1903,
          "content": "Yep, OP you may think it’s completely unnoticeable and therefore a weird invasive request - but why would she ask if she couldn’t tell when you’re not wearing a bra? Sorry to say sounds like you’ve had your nips out there for a while and no one has really known how to tell you",
          "id": 127,
          "comments": [
            {
              "score": 411,
              "content": "In private that generally also might not be relevant, but for professional and festive settings...obviously you wear something that doesnt make it obvious you are missing underwear (and even if the cloth is thick and your cherries on the smaller side...its noticeable still.)",
              "id": 128,
              "comments": [
                {
                  "score": 29,
                  "content": "Yeah I’d find it odd if a friend didn’t wear a bra but wouldn’t bring it up. At a formal event where my grandmother was going to be present and I was paying thousands for pictures that would decorate my house for the rest of my life I would. ",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "100%",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "This!",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 550,
          "content": "Not only is it noticeable, but because the bride thought to ask well in advance probably means OP is the “friend that never wears bras and everyone notices” kind of friend.",
          "id": 132,
          "comments": [
            {
              "score": 18,
              "content": "THIS RIGHT HERE! Congratulations on your small boobs, but the fact that you like to show them off so much is annoying.",
              "id": 133,
              "comments": [
                {
                  "score": 2,
                  "content": "This 1000%",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5347,
      "content": "But you can tell. She knows you are not wearing bras, because she can see you're not.\n\nPeople who don't wear bras think no one can tell, but in reality, your nipples poke out and yes, everyone can tell.\n\n  \nBras suck, I don't wear them, I wear 'sports' tops/braletes' and that solves all the problems.  \n\n\nIt's her wedding, just try it. When you're married, you'll have something like that too with someone or something (possibly).",
      "id": 135,
      "comments": [
        {
          "score": 2308,
          "content": "I dont wear bras and i dont go around thinking people cant tell. Its more like i dont give a fuck if you can tell or not. Home girl is gaslighting herself if she thinks people cant tell.",
          "id": 136,
          "comments": [
            {
              "score": 1607,
              "content": "Fun fact, the correct term for “gaslighting yourself” is “delusional”.",
              "id": 137,
              "comments": [
                {
                  "score": 446,
                  "content": "But delusional isn't as much as a buzz word as gaslight /s",
                  "id": 138,
                  "comments": [
                    {
                      "score": 411,
                      "content": "the new buzz word is “delulu”",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 46,
                      "content": "that is just all in your head",
                      "id": 140,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "Just say delulu and it's a buzzword again! 🤩",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "That’s why the kids created “delulu”",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 165,
              "content": "I think you mean she’s lying to herself. A person can’t gaslight themselves.",
              "id": 143,
              "comments": [
                {
                  "score": 66,
                  "content": "A gaslight myself into thinking life is great 😭",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "Exactly. I go braless regularly, of course it’s a different look than wearing bras. You can often tell when someone’s wearing different TYPES of bras, let alone no bra! She’s either playing dumb so she doesn’t have to actually stand up for herself, or like you say she’s delulu.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Agreed. I know people can tell, but oh well, as long as my top isn't paper thin and you can't count the bumps on my areolas, I figure if people have a problem with it they can just look elsewhere. I'll wear layers to work to try and mitigate it (and it's just cold there) but so far no job has paid me enough to wear a bra for 40 hours a week. Men's nipples show through their shirts sometimes, especially when it's cold, if it's not inappropriate for them then it's not inappropriate for me.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Right?? People can tell!",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "This is me. You can tell? Okay? Idk why it matters",
              "id": 148,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "came to say the same thing. i haven't worn a bra in years & i know it's not a secret but i dont give a fuck",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 551,
          "content": "Actually most of us know you can tell.\nIt's that we don't care, it's different. in my daily life there's simply not enough reasons to be uncomfortable for other people's comfort.\nBut on important occasions, like a ceremony, I'm on board wearing one.\nI mean, I suffer more with high heels shoes, so 12 hours with a simple bra won't kill me and it won't alter who I am.",
          "id": 150,
          "comments": [
            {
              "score": 244,
              "content": "Thats very acurate. I am team: \"Yes, you can see it. No I dont care.\" \n\nThe only times I really belive you cant tell is if you wear like a big puffy winter jacket or something like that.",
              "id": 151,
              "comments": [
                {
                  "score": 31,
                  "content": "I'm a girl who tends to go braless as well, but I also glance whenever I see another braless girl's perky nipples. Or if they have a nice ass. I think it's only natural to want to look. The difference is that we just glance once and not ogle or make them uncomfortable haha",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "I agree with the soft YTA for OP, but everyone in here saying you can ALWAYS tell-- I think it's one of those things where you only realize when you can tell, and there are many cases where you can't tell so you don't think about it (or assume they are wearing a bra/pasties).\n\nFor sure certain types of shirts you can almost always tell (thin white tank tops, etc). But with a lot of thicker materials, you can't tell. A lot of formal wear is designed such that you can't wear a bra, a lot of them are structured in the bodice such that you don't need to wear a bra and it's not noticeable. So really it depends on the material and the cut.\n\nBut again reiterating, if the bride is asking it's probably because people can tell, and OP can suck it up for a day.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 17,
                      "content": "It is weird that everyone is acting like \"for a formal event you wear a bra\" when a lot of fancy dresses do not really allow for bras. It's just not true, but this sub is wild because they were also team bridesmaid when the bride wanted her bridesmaid to wear a specific color so it's not a consistent ruling. I would never ask my friend to wear a specific undergarment for any occasion, that's so wild to me. But I truly don't give a shit if nipples poke through or not.",
                      "id": 154,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "It's also highly dependent on temperature. If you feel cold your nipples will poke through even a padded bra. But if you are comfy even a single layer can be enough.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Agree on the shoes! Wearing a bra, especially if it’s wire-free, is not that bad. Unless it’s so hot you’re sweating into it. I hate the feeling of sweating into my bra, knowing it’s just soaking up the moisture.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Agreed. There are only a few places I wear a bra. Work is one of them (granted it's a sports bra). A formal event where I'm in the main party is another. I never wear a bra but if I'm a bridesmaid I'll do it for the bride",
              "id": 157,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 148,
          "content": "Seriously- friend wouldn’t be asking if she couldn’t tell. Friend isn’t asking for a specific bra or a push-up bra, just something so the nips aren’t out.\n\nAnd OP is in luck! Bras without underwires are very in right now. She can wear one for a few hours",
          "id": 158,
          "comments": [
            {
              "score": 6,
              "content": "Exactlyyyyy.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 77,
          "content": "Unless a bra has tons of padding nips can still easily show.",
          "id": 160,
          "comments": [
            {
              "score": 132,
              "content": "Mine go through my bra, my tank top and my tshirt.  My nipples are…*insistant*",
              "id": 161,
              "comments": [
                {
                  "score": 33,
                  "content": "I had this embarrassing realization at work the other day. My bra is lined and has some padding and I noticed when I went into the restroom my nipples were poking through. I thought I was good because it’s padded but somehow my nipples found a way. Don’t get me wrong it was still less nip than if I wore an unlined bra.",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I used to look like I had half a hotdog sticking out from my shirt as soon as there was even a suggestion of a chill.\n\nWhen I got my tits off (FTM) I had the choice to keep the nips on or not. Much happier with my cold-proof Ken doll situation!",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Ever since I had babies mine are the same. Hell, I can see them through some sweaters with a lined bra. But it is less defined than if I go braless. \n\nOP is delusional. as well as helping to disguise nipples, bras change the shape and position of the breast regardless of cup size. As most people have said, if the bride is making this request then she can totally tell when op is braless.",
                  "id": 164,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Same, girl. I have to use the silicon nipple stickers to make them slightly less noticeable. I don’t think the give away for being bra-less is the nipples, it’s the pointier shape of the breasts paired with the movement. If someone has breast implants and doesn’t wear a bra, it’s much less noticeable than someone with natural breasts not wearing a bra. ",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 64,
              "content": "Thank you. Everyone bitching about nipples is crazy. I wear sheer bras because I prefer them and I also have small breasts, but even with padded bras on, you can see me nippin. \n\nThey are natural. It’s not a big deal at all.",
              "id": 166,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "I can tell I’m going to get downvoted in this thread but… who cares if you can see her nipples. Women being forced to constantly shield their nipples is not ok and it just furthers the double standard of men and women. People need to get over breasts.\n\nI also wear sports bras because my jobs are bigger  since having kids and I don’t like the feeling of them flopping around (will likely get a reduction when I’m done breast feeding for good) but if mine were small enough, I wouldn’t wear anything and I wouldn’t let anyone tell me to hide my shameful breasts or any reason. NTA. This is ridiculous of a societal level.",
          "id": 167,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3525,
      "content": "She's bringing this up because you have your tits out a lot more than you are aware, and it's fair to not have your tits out at a wedding.",
      "id": 168,
      "comments": [
        {
          "score": 831,
          "content": "Yup -- I worked with a girl who had small breasts so she never wore a bra. Anytime she wore anything low cut or loose and bent over, her boobs would be in full view. The amount of times I saw that girls chest in the 4 months she worked with us is astronomical. It was pretty uncomfortable for everyone there. Not even because of the boobs, because whatever, but more so because you didn't know if she knew, or if we should tell her. So it just carried on.",
          "id": 169,
          "comments": [
            {
              "score": 216,
              "content": ">Not even because of the boobs, because whatever, but more so because you didn't know if she knew, or if we should tell her. So it just carried on.\n\nI think people don't understand this point. It's not necessarily \"oooo, titty!\" but \"you are exposing a part of yourself normally covered and we don't know what to do about this because it's a no win situation.\"\n\nAnd I say this as a woman. I'm sure it's worse for men who would immediately be labeled as a perv for \"looking.\" But if you don't and she finds out, it could be \"he didn't tell me because he enjoyed the view.\"\n\nRegardless of what you think should be proper titty protocol, the fact remains that society on the whole says female titties must be under wraps. So when that *doesn't* happen, people *will* notice. And it's rude to force people into the awkward position of trying to figure out if/how to tell you.",
              "id": 170,
              "comments": [
                {
                  "score": 26,
                  "content": ">I'm sure it's worse for men who would immediately be labeled as a perv for \"looking.\" But if you don't and she finds out, it could be \"he didn't tell me because he enjoyed the view.\"\n\nIt really is a lose-lose.",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "When I was in high school, no bra with nipples pierced became a trend. I am also a short girl. Most of their boobs were eye level for me. I was uncomfortable everyday. And if I spoke up on it, I was anti-feminist.",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 102,
              "content": "Me too. Office environment. It was so awful to be around.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "Omg you just reminded me of a woman at my friend's wedding. She was pretty flat chested and wore a dress that didn't really work with a bra, but girl we saw it all.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Good god. I am pretty skeletal and I often don’t wear bras unless it’s an important event or the clothing is tight/thin fabric. I’m always very careful to put my hand on my collar as I bend over, because there’s nothing to fill out my shirts and keep them on.",
              "id": 175,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "It's just another thing that's going to draw attention to the OP too. Anyone who's read a single wedding post knows the issues with diverting attention from the bride. We can argue till we're blue in the face about freedom and not being repressed but you're pushing back against millenia of biological urges and media representation.\n\nJust wear the assigned clothes for a couple of hours.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2805,
      "content": "I mean it’s a formal event why not dress…formally ? If it was like a casual day then I’m with you but why not put a little more effort to be a little more put together at someone else’s formal event?  It’s not the hill to die on",
      "id": 177,
      "comments": [
        {
          "score": 431,
          "content": "I mean, I'd argue formalwear at points does actually drive no bra quite a lot so it's a bit of full circle. Kind of depends on the dress",
          "id": 178,
          "comments": [
            {
              "score": 298,
              "content": "I'd say the main times I have gone without a bra have been in formal dresses! I actually can't think of a time I wore a formal dress with a bra. Guess it depends on what style/fabric the dress is",
              "id": 179,
              "comments": [
                {
                  "score": 16,
                  "content": "Pasties. They’re uncomfortable but they do the trick.",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "This exactly. Some dresses like structure underneath. Same reason why in some you maybe can wear full underwear, others you need a thong or seamless. Undergarments are for not just covering up, but structure as well.",
                  "id": 181,
                  "comments": [
                    {
                      "score": 10,
                      "content": "That's exactly all I was trying to say! The last dress I wore was backless, but I had to wear pasties and I hated it bc I felt like you could still kinda see the edge of the silicone part. And then I had to wear spanks on bottom to help smooth everything out just so i looked extra nice. It really just depends on the dress and everything. But it's really just more about how the specific garment looks.",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "I’d argue that the dress that was picked and is being asked to wear a bra with is one of those dresses",
              "id": 183,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Formal attire often has structural garments built into it - especially for items that are tailored to an individual. Otherwise, there are actually specialized undergarments that are typically used with formalwear that wouldn’t allow for a typical bra - like pasties, which actually exist for reasons beyond modesty since they cover a part of the body that’s very sensitive and susceptible to irritation… and  formal attire is not necessarily the most comfortable to wear.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "No bra but something like the silicon petals that are made for brakes dresses",
              "id": 185,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "FWIW I’ve been a bridesmaid three times and I’ve never worn a bra with a bridesmaid dress. And I generally “need the support”, it’s just that formal dresses are often structured enough to not need one.",
          "id": 186,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "Where is the rule saying bras are “formal”\n\nBra culture is fucking weird.",
          "id": 187,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2108,
      "content": "YTA.\nyouve already agreed to be a bridesmaid. The bride asked you to do one thing in order to avoid flashing her gran. Do the thing. \nAlso this: \"full sleeves so you wouldn’t be able to tell as the material is also very thick\" doesnt make sense. \nI have small tits, try boob tape. ",
      "id": 188,
      "comments": [
        {
          "score": 1210,
          "content": ">full sleeves so you wouldn’t be able to tell\n\nPeople won't notice my nipples because my forearms will be covered, or something like that",
          "id": 189,
          "comments": [
            {
              "score": 273,
              "content": "My best guess is they meant the sleeves would cover the bra strap area, and bra straps are the only sign of a bra being worn?",
              "id": 190,
              "comments": [
                {
                  "score": 255,
                  "content": "No, she meant there's no chance of a boob popping out because straps have slid down shoulders, or a strapless dress has slid down. Which is relevant to \"boob making surprise appearance\" but not to \"you can't tell I have a bra on\"",
                  "id": 191,
                  "comments": [
                    {
                      "score": 31,
                      "content": "It doesn't preclude a surprise breast appearance from the cleavage/neckline, especially while dancing, jumping for the bouquet, bending over to adjust shoes etc. Especially not after a few drinks.",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 216,
              "content": "I'll usually try to tuck my nipples down my sleeve so if they become erect I can just pinch them in my elbow a bit to restrict them and no one will notice.",
              "id": 193,
              "comments": [
                {
                  "score": 16,
                  "content": "I’ve lost a lot of weight and my boobs are super saggy from skin, and I reckon I could  get close to actually doing this.",
                  "id": 194,
                  "comments": [
                    {
                      "score": 9,
                      "content": "... say it a little slower and breathier for me though...",
                      "id": 195,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "That's an... upsetting mental picture lol ",
                  "id": 196,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "This made me so happy, lol",
                  "id": 197,
                  "comments": [
                    {
                      "score": 7,
                      "content": "my nipples explode with delight!",
                      "id": 198,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Well that's a brand new sentence if I've ever heard one!",
                  "id": 199,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 91,
              "content": "Full sleeves will keep a dress with no boning or straps from falling down, but they won’t hide the fact that the wearer isn’t wearing a bra",
              "id": 200,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "This is so funny 😂",
              "id": 201,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "I think she was thinking about flashing side or under boob. Which can't be done with full sleeves?  But that's not the only problem",
          "id": 202,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "If she really wants to die on this hill, ask the bride if she'd be cool with those silicone nipple covers. They're like $20 on Amazon, and those suckers stay on. I'm a DD and with tops that aren't bra friendly or on days I really can't deal with a bra but need to wear SOMETHING, they're fantastic.",
          "id": 203,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1633,
      "content": "YTA do you not have nipples? \n\nWhat a weird hill to die on. \n\nAlso as everyone has pointed out, if no one can tell when you’re not wearing a bra *why did she specifically ask you to wear a bra?* \n\nDo you think she’s just asking everyone to wear underwear to her wedding? Either she can tell (it’s probably this one, she can see your nipples) or you go around loudly declaring that you’re not wearing a bra. Either way YTA.",
      "id": 204,
      "comments": [
        {
          "score": 338,
          "content": "\"do you not have nipples?\" 🤓",
          "id": 205,
          "comments": [
            {
              "score": 288,
              "content": "I have nipples Gregg, can you milk me ?",
              "id": 206,
              "comments": [
                {
                  "score": 6,
                  "content": "LOL that was my first thought too",
                  "id": 207,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "I have seen this quote several times on Reddit, and in the correct context. I love it!",
                  "id": 208,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1437,
      "content": "YTA, sorry OP. It’s very obvious when people aren’t wearing a bra, even with tiny titties ",
      "id": 209,
      "comments": [
        {
          "score": 334,
          "content": "i think it’s more noticeable bc with bigger ones (mine at least) my nipples don’t point straight out so it’s just the same two lumps as always lol but with tiny ones their nipples are more likely to be facing straight out???",
          "id": 210,
          "comments": [
            {
              "score": 3,
              "content": "I can spot a braless nipple from 40 yards away to within the tolerance of 1 micron. It's like a 5th sense.",
              "id": 211,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "It really is... When I was young, as in OPs age, I had itty bitties too. I didn't always wear a bra either, no big deal. But I didn't pretend like no one could ever tell in any outfit or that it was appropriate for all occasions. OP is being obstinate.",
          "id": 212,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}