{
  "post content": "My two daughters are vegetarian but my husband and son are not. I'm probably what they would call a \"flexitarian\". \n\nMy son and husband always turn up their noses at tofu or any other meat alternatives - they say it's just \"weird\" that it's made to resemble real meat, so it's really the concept and not the taste. There are no allergies. My family and I often make two versions of dinner - one meat, one real, and twice the amount of pots and pans. There is an equal distribution of cleaning and cooking in this house, thankfully.\n\nMy daughters had a fun prank idea of making two pots of spaghetti sauce, under the pretense that one was meat (they were both the soy ground beef). The goal here was to see if their brother and father actually hated the meat and to see if we could maybe save some dishes and time (in the future).\n\nEveryone loved dinner, both husband and son finished their plates. This was when my youngest couldn't hold it in anymore and told them. They both got VERY upset about being fed something other than what they were told.\n\nReddit, AITA?",
  "id": 1,
  "comments": [
    {
      "score": 26088,
      "content": "This is not really a meat eater / vegetarian issue. Tricking someone into eating something other than what they thought they were eating is a massive breach of trust, the fact that the substitution is harmless is irrelevant. That your aim was clearly to shame or embarass them over their dietary preferences does not help.\n\nWould it really be that different if they cooked meat and fed it to your daughters, telling them it was soy?\n\nYTA",
      "id": 2,
      "comments": [
        {
          "score": 17714,
          "content": ">Would it really be that different if they cooked meat and fed it to your daughters, telling them it was soy?\n\nWell, yes, considering eating meat can be dangerous for long-term vegetarians.",
          "id": 3,
          "comments": [
            {
              "score": 9569,
              "content": "Yeah. My mom has been vegetarian since she was 11, a few years she accidentally ate lasagna with meat in it and was sick for several days. A meat eater wouldn’t have the same reaction to eating something without meat so it’s definitely not a fair comparison.",
              "id": 4,
              "comments": [
                {
                  "score": 4040,
                  "content": "I mean the comparison is fine, because we are assuming they wouldn't get sick and its just a thought experiment.  The point of the comparison is to highlight that its morally wrong, for reasons of consent.\n\nEdit: To those confused, the \"morality\" refers to not respecting consent, not the moral justification each side is using for their choices.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 8476,
                      "content": "Sure, but there's an asymmetry here in that the daughters presumably have a moral issue with consuming animal meat, while the father and son presumably have no moral concerns with consuming things made from plants. Their only issue is that it is \"weird.\"\n\nFeeding animal meat to the daughters would be forcing them to participate in something that goes against their morals. Tricking the husband and son to eat things made out of plants does not go against their morals. They are just against the \"concept\" of it, and not for moral or ethical reasons.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "This is the problem with people using these types of examples. There will always be someone that purposely  twists it to make themselves look right. Completely bypassing the point.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 679,
                  "content": "So you’re allowed to fuck with peoples food as long as it doesn’t harm them? That’s ridiculous",
                  "id": 8,
                  "comments": [
                    {
                      "score": 281,
                      "content": "The gaslighting in this comment section is real",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 25,
                      "content": "almost like saying \"i spit in his food, don't have any contagious diseases so who cares\"",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "This is the hypocrisy of reddit, they're all about values until it doesn't make sense to them, then it's okay to fuck with people's food.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 524,
                  "content": "without meat and a meat substitute are two very different things.  I eat meals without meat all the time but every meat substitute i have ever tried made me sick at my stomach.  No idea why it makes me sick  but I would be very upset with someone who did this to me.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 328,
                      "content": "You could be allergic to soy, as I am.  For the longest time I had no idea why fake meat bothered me so much.  I've found a few meat substitutes that don't have soy in them and I can eat them with impunity.  I'm not trying to denigrate your experience.  I'm just sharing what I've learned works for me.  I hope it is useful to you, or at least not offensive.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 271,
                      "content": "I am allergic to a lot of \"processed\" foods, which let's be real fake meat substitutes are highly processed. You want to make a big roasted eggplant vegetarian dish? Great!  You want me to eat a refined fake meat? No thank you, I'm the one who's going to be trapped in the bathroom for 4 hours after ingesting.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Yeeah I tried some meat free “sausages” for lent one year god my stomach hurt for hours and I just felt tired all day, I would always appreciate being told what I’m eating ahead of time and be able to decide for myself. Being tricked into eating something is a huge breach of trust. My dad made a delicious vegan green bean casserole that we loved—we’re not a vegan family but we really enjoy trying all kinds of recipes and food but even when I was a picky child my parents didn’t *lie* about what we were eating.\n\n(The rule in my house was just to try a few bites every once in a while. Like they could prepare “veggie I didn’t like x” in one way and ask me to have a little bite to try until we found a way I enjoyed it, or concluded we simply needed another veggie to replace it. The veggie test only failed about 2 foods total that I “just don’t like” after several attempts and I still feel it was pretty fair, plus it convinced me there are so many ways to enjoy things. No lying about hiding peas in a mashed potato was needed.)\n\nEdit: Oh yeah don’t lie to people about what they’re eating under any circumstance even if it’s your family, even if they’re omnivores, it just speaks to a huge amount of entitlement and disrespect for the people you’re tricking. Anyone would be upset. YTA op.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "This right here.  My best friend is a pescatarian but loves \"Impossible Meat.\"  One night we were invited for hamburgers with the fake meat, and I was willing to try it.  The food was delicious, but alas, I spent the rest of the night mostly in the bathroom with a very upset stomach.  Friend was aware of my reaction, unfortunately she can be very ditzy and forgetful, even though she has a heart of gold.\n\nI had hernia surgery a month later and the same friend cooked and froze a number of meals to help as I recuperated.  First meal was homemade lasagne, which we just assumed was vegetarian.  It wasn't.  There I was on the day of my surgery barely able to walk with the worst pain imaginable from eating her fake meat. On top of that, because of the anesthesia, my bowels were still sort of blocked and I couldn't so much as pass gas.  I was terrified of tearing stitches.  Needless to say, I don't accept food from my friend anymore unless we cook it together.  \n\nEveryone has the right to know what they are eating and the right to refuse to eat what they do not want for their own reasons.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I've found the common things people can have issues with are soy, gluten, chickpeas and other legumes, and sesame. As I have family members with one or more of those food allergies they can't eat any of my meat substitutes. I definitely agree that meatless and meat substitutes are different things.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "A close friend of mine gets the runs if he eats certain meat substitutes.  Beyond and Impossible were two major instigators.  I took a look at their ingredients, and saw \"methylcellulose\" in them.  I wasn't entirely sure what that was, and googled it.  A particular line in the Wikipedia entry stood out to me: \"It is sold under a variety of trade names and is used as a thickener and emulsifier in various food and cosmetic products, and also as a bulk-forming laxative.\"\n\nSo, yeah, a major component of them is an actual, no joke laxative.  I suppose it doesn't affect everyone the same way, but it made a lot of sense to me that my friend got the runs from it.  And I figured I should avoid it myself, because I'm already kinda prone to that kind of digestive issue.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "My ex-MIL used to make “mock chicken” with some TVP (textured vegetable protein). I used to,have the runs for DAYS after eating it. I can eat tofu when I visit Japanese friends, I don’t particularly like it, but it’s edible, and they’re serving it in their home and they’re vegetarians.   \nOP yes YTA",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "some of those fake meats have nuts in them, and a lot of people have a bad reaction to soy. Make sure YOU read the ingredients\ncarefully. Nuts won't necessarily be noticeable.We eat fake meat, but partner has a nut allergy, so we have to be careful",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I can eat a little soy, but if I eat too much it gives me the runs.",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 299,
                  "content": "They wouldn't get sick over something they normally eat made meatless, but fake meat products can absolutely make people sick.  I have no soy allergy or other food allergies, but fake meat makes me violently ill for days.  Regardless of diet, it's equally wrong to feed anyone anything they don't consent to.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 111,
                      "content": "Same here. Most fake meat substitutes make me sick. I always thought it was a texture thing (they all taste mealy to me) but even when I do eat them I feel terrible for a day or so afterwards.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "same here I've tried them a few times and everytime it's ended badly",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "It is a fair comparison, she accidentally did it. Their food was DELIBERATELY tampered with. Without CONSENT. it's in some ways worse. Her OWN actions caused what happened to her. These guys didn't consent.",
                  "id": 25,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "Some of us are allergic to soy. Meat substitutes often contain soy. It could kill me. But, right, not the same reaction.\n\nBodily autonomy is a thing, for so many reasons (that one isn’t necessarily entitled to know).\n\nYTA op",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "Not always true - some meat substitutes are allergenic. I have a veg friend that can't eat soy or gluten - it limits them quite a bit.",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "Tofu and other soy meat substitutes give me cramps and huge amounts of gas.  Soybeans are the gassiest bean.  People should be aware when they are eating something known to cause digestive issues.",
                  "id": 28,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "I think it depends. My first time trying vegan cupcakes made me sick for days. I thought it was just me until I googled that this can happen to folks who've never had vegan food before.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "False assumption.  Some people can’t tolerate wheat , gluten, dairy, soy, etc.    so it’s the same logic.  I also believe eating soy and any processed plant based “meat” is very unhealthy for me.  I would be upset at OP.",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 632,
              "content": "It’s unlikely they are long term vegetarians. They are still pretty young and changed of their own choice. \n\nBut why do vegetarians get to demand autonomy and respect for their food choices but we’re cool with dismissing those of meat eaters?",
              "id": 31,
              "comments": [
                {
                  "score": 1425,
                  "content": "> But why do vegetarians get to demand autonomy and respect for their food choices but we’re cool with dismissing those of meat eaters?\n\nBecause the situations are not symmetrical. \n\nFeeding someone meat when they don't eat meat is bad. Feeding someone vegetables when they don't eat vegetables would be equally bad. \n\nBut generally what you're calling 'meat eaters' are actually 'meat and vegetable and dairy and everything else eaters'.\n\nThe crucial point is whether you are feeding someone something that is within the overall set of things that they eat; feeding an omnivore vegetables is, feeding a vegetarian meat is not.\n\nThe same logic applies to other exclusions too - if you had a meat eater with a gluten allergy it would be fine to feed them a gluten free veggie burger, but  not a meat burger with wheat in it.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 1046,
                      "content": "It didn’t MATTER if the situations are symmetrical. It’s about lying to people and feeding them food they have openly told you they don’t want without their consent. This is just never ok. \n\nAlso, the argument that meat is bad for vegetarians is based on: how they are from birth and how long they have been vegetarian. These are two children who live in a formerly near eating house. For all we know they’ve been vegetarian for six months. \n\nAnd it doesn’t really matter anyway. Anyone who expects their autonomy respected in some areas of life needs to offer the exact same respect to others and their decisions. The fact that people would argue that this isn’t the same is exactly why people dislike and distrust vegans and vegetarians.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 366,
                      "content": "Why are you, as someone who wants to be able to control what they eat, arguing against people being allowed to control what they eat?",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 261,
                      "content": "Um, no. Soy is one of the top allergens out there. Feeding someone tofu and lying about it being meat has actually hurt people. In OP's particular case, I would think they would be aware of an allergy within the immediate family, so they got lucky this time. But it could have gone downhill easily.\n\nThere is a reason it is literally illegal to lie about what you are serving to someone. Get caught and you'll catch a misdemeanor battery charge. If the person has an allergic reaction (which happens A LOT with tofu) you're going to jail and will likely be on the hook for all medical expenses. \n\nThere was actually a post on here while back asking if the poster was the AH for pressing charges after her college roommate served her tofu bacon and lied about it, with the same mentality as OP here, trying to pull a \"gotcha\" about the taste of fake meat. Well... Poster was hospitalized because of a severe soy allergy, and the roommate was charged with a felony, sent to jail, and expelled from the university. And their parents ended up being ordered to pay all the medical expenses and for the tuition from the courses the poster had to retake because they were hospitalized during finals. The roommate was not aware that the poster had an allergy, and the court decided it did not matter because they had deliberately lied about what was being served, which proved malicious intent.\n\nMoral is, you don't fuck with people's food. Ever.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 225,
                      "content": "[deleted]",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 192,
                      "content": "I feel like you are the opening the door to making dietary choices for other people and lying about food. A vegetarian wouldn't like this, why would anybody?",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 144,
                      "content": "> Because the situations are not symmetrical.\n\nBut they are symmetrical. They both come down to personal autonomy and respect. Either you think people have the right to control their own diets or you don’t. Either you respect people’s right to their own dietary choices or you don’t. YOU are not the food judge and jury who gets to determine whether or not someone else is entitled to that right.",
                      "id": 38,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "Eh I don't know about that. I'll eat veggies all day long, but the chow that is vegetarian/vegan meat replacement barely qualifies as edible to me. I wouldn't mind if someone tricked me into a meatless dish, but would be very upset if I was tricked into vegan faux meat sludge. Stuff's sketchier than a cheap hotdog. I feel like a lot of omnivores feel pretty similar.",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "This situation is entirely about trust, and trust cannot survive asymmetrically.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "You are putting something inside someone’s body without their consent.   It’s shitty.\n\nImpacts vary depending on the circumstances, but it’s despicable however you do it.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Feeding someone fake meat means feeding them processed seed oils and binders. Its not as simple as “theyre just eating veggies”. Never in the history of humanity have we consumed seed oils like this.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Because if it wasn't for double standards, some people wouldn't have any.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": ">Well, yes, considering eating meat can be dangerous for long-term vegetarians.\n\nThis is well known to be pseudo-scientific nonsense. The human body does not lose the ability to digest meat just because you don't eat meat for a few years. If vegetarians get sick simply from eating meat, its psychological.",
              "id": 44,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "So can eating soy. Soy is MSG and can trigger insane migraines and other health issues. I can’t have any soy because it will cause a severe reaction that at best leaves me bedridden for hours or at worst in the hospital for dehydration from vomiting and I once had to be put on life support because I had a heart attack because of the severity of the dehydration and vomiting. Never had any issues prior and it was how I was dx with a msg allergy. You never know how someone’s body will respond.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I thought that was disproven many times",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Fake meat can also be dangerous. Soy allergies are pretty common",
              "id": 47,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Yeah. I had the same experience when I ate a carrot for the first time in 10 years.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "And soy can be dangerous to me!",
              "id": 49,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2520,
          "content": "Parents everywhere are assholes then for putting puréed vegetables into things to get their kids to eat them then. Picky eaters are notorious for disliking something they actually like because it contains something they are adamant that they hate. Having to make two separate meals just because someone refuses to be open to something else is annoying and likely wasteful. I don’t get the comparison to food tampering, at all.",
          "id": 50,
          "comments": [
            {
              "score": 139,
              "content": "Agreed. Honestly I would just make them cook their own meals and wash up after themselves and their silly separate food. Then they would probably change their tune. Imo they are being big spoiled babies by refusing to even try it with an open mind. I do kind of see the point of food autonomy but there is a difference between I don't want to eat this because I just refuse vs there's a moral or health related reason, ESPECIALLY for the son since he is a kid and needs to learn trying new foods by modeling and it will likely bleed into other things. Like right now it's soy but what if it becomes everything but chicken nuggets? The husband is not setting a good example.",
              "id": 51,
              "comments": [
                {
                  "score": 30,
                  "content": "Except, per OP, everybody shares in the clean-up process so they presumably *are* cleaning up after their own meals, and would still prefer to eat their separate meals",
                  "id": 52,
                  "comments": [
                    {
                      "score": 12,
                      "content": "They said there's an equal distribution in cooking too. I'm not sure how that works if OP and kid this time cooked both meals. It's either meat eaters and non meat eaters take turns with cooking both meals each week, or they just cooked their own respective dishes, which either way idk what the problem is... Saving money perhaps? But no, OP didn't mention money. Just dishes and time...\n\nI agree it's strange how they refuse tofu not because of the TASTE, but because of the concept tho. But on the other hand, spaghetti is one of the easiest way to hide ingredients and mask tastes.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "I just think that people should be encouraged to TRY things in all kinds of styles of cooking so that palettes are broadened and the work kid is lessened. I HATE cilantro, BUT my neighbour made Thai amazing salmon with cilantro in and … now I know I can eat cilantro sometimes. That’s how we grow. Sometimes when we are told exactly what’s in something, we decide we won’t like it because of that and it just… shrinks the world a bit",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Tofu isn't an upgrade from meat though, the protein in tofu has a low bioavailability, the phytates in soy can interfere with mineral absorption and isoflavones can disrupt hormone balance. You cannot compare eating Tofu to vegetables, vegetables are essential for health. Tofu is garbage food.",
              "id": 55,
              "comments": [
                {
                  "score": 3,
                  "content": "I can compare them because the sentiment behind them is the same. They don’t want to eat something because they things it’s gross. The healthy content of the food wasn’t up for debate. \n\nTofu is also not garbage. It’s a complete source of dietary protein.",
                  "id": 56,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Declining to make two separate meals to accommodate someone's preferences is ok. \n\nPretending to make two separate meals, lying about what is in one of them, and tricking someone into eating something you know they would not choose to eat is not ok.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "The difference is that parents have more control over a kids diet while they are young enough to not make informed decisions. Though I do personally look down on it a little bit as I'm coming from the angle that not all examples of picky eating are purely being picky. Mostly because I am on the Autism spectrum which can cause certain textures of food to cause actual problems when eating it. Though thankfully for me that mostly comes from texture so while I can't eat chunks of tomato, I don't start choking on ketchup. On the other hand, I'm not a parent, have not raised any kids, and never studied raising kids so my thoughts on the matter overall don't hold all that much weight beyond my own head.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Please, this is just purposely distorting the issue. Kids don't have the mental capacity to understand the repurcussions/consequences of things. That's something they learn as they grow. Their brain literally has not developed fully yet. \n\nYou know who's responsible for making those decisions for kids until they can do it themselves?\n\nTheir parents.",
              "id": 59,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Feeding something to a child that cannot make informed choices or express them clearly is very different than what op did,  and you know it.  This is a spurious excuse.",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 575,
          "content": "I don't see the goal as shame or embarrassment. It's so the cook can stop cooking two separate meals all of the time. I agree op went about it the wrong way though. Op should have told either the meat eaters or the vegetarian eaters THEY have to cook if they want separate food.",
          "id": 61,
          "comments": [
            {
              "score": 263,
              "content": "Perhaps a better way would have been to make both meat and vegetarian spaghetti but not tell them which is which and see if they can guess. Personally I don't see any harm in what they did and I suspect the anger was more over having been not only tricked but also proven that it does taste just as good, pride and vanity being what they are. No cows were harmed in this trick and it certainly wasn't going to harm the men, at least not physically, and maybe, just maybe, they learned something. NTA",
              "id": 62,
              "comments": [
                {
                  "score": 145,
                  "content": "They learned they can't trust the wife and daughters.  Wife is absolutely TA or lying.  She could just flat out said she was only making a vegetarian dish that day and if they wanted something else they could make it themselves.\n\nThe last time someone at work tried the mentality to \"show us\" I could have died from the allergic reaction to almond powder.  You don't lie about food and ingredients.  At best you're an Ahole whose word can't be trusted.  At worst the Wife has introduced  long term contempt for the sisters that may result in a prank where meat is added to their dish.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I actually like some of the meat substitutes.\n\nI make my burgers with one veggie burger patty and one meat patty.\n\nIts cheaper, I like it, an I eat half as much meat.\n\nI have no objection to any of this stuff. I enjoyed a vegan pizza when it was on offer /gasp.\n\nAll that said trick me about my food and I'll never trust you again.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "So the goal in \"only making one meal\" is to force everyone to be a vegerarian...because the vegetarians won't eat the meat. If the roles were reversed and the meat eaters lied about serving vegetarian food, would you still claim it was to create a situation where they only make one meal?",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Op says there is is equal split on cooking and cleaning",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 536,
          "content": "[deleted]",
          "id": 67,
          "comments": [
            {
              "score": 389,
              "content": "So only those with moral/religious reasons deserve consent? \n\nAbsolutely tf not. Nobody needs a reason to have their boundaries respected.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 294,
              "content": "Bodily autonomy is not negated by holding silly religious beliefs. My opinion that all religion is ridiculous wouldn’t make it okay to feed pork to a Muslim against their will. It doesn’t matter how ridiculous I find their dietary choices. You either respect the people in your life or you don’t. This woman had no respect for her husband and son. Neither did her daughters. They have now made it clear that there is no need to respect dietary choices in their household. They have set a precedent for tricking people into eating things they have clearly stated they don’t want to eat. It doesn’t matter if you consider another person’s reasoning sound, they retain the right to choose what is put into their bodies and what isn’t. If you don’t give people that choice then you don’t get to make that choice for yourself either.",
              "id": 69,
              "comments": [
                {
                  "score": 58,
                  "content": "I suspect that the next post will be \"AITA for yelling at my husband for putting meat in my vegetarian daughter's food?\" or \"AITA for allowing my daughters to start a food war?\"  Either way, it's not going to end well.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 139,
              "content": "No, this is absolutely the same thing. You are betraying their trust. Just because there isn't a \"religious or moral\" component to it doesn't mean that this is okay. As others have stated, these foods have increased sodium - that is a health concern for some people, soy can be a health concern for some people. The fact is that they were lied to - that is what makes this wrong, it is also a terrible example to set for her children.",
              "id": 71,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "Consent and personal autonomy  are also aspects of morality. They may not have moral concerns about consuming meet substitutes, but they have moral problem about having their boundaries and consent violated.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Except no where in the op does it say that the vegetarianism is for religious or moral reasons and not a mere matter of preference or taste. If the vegetarianism is a matter of taste or preference, is it any less of an AH move to feed them meat? What if there was no chance of them getting sick because they made the change not that long ago? If you still think it would be an AH move to feed a vegetarian meat, regardless of whether it causes harm or not, and regardless of the reason for doing so, then the opposite is also true. The fact that this was done to try to shame the others is an even bigger AH move. I am all for vegans and vegetarians choosing not to eat meat for what ever reason they choose to do. I am not all for them pushing their choices on others, any more than I would be for a meat eater pushing their choices on a vegan or vegetarian.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "It's about respect for people's choices.  Apparently, the girls do not respect the choice that their father and brother made, and mom allowed them to do it.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I have a moral issue against the fake out meat and the insane amount of processing that goes into it.\n\nIt is literally against my morals, and you don't get to say what my morals can and can't be.\n\nIsn't that neat when the same standards are applied equally instead of allowing your bias in?",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "So its fine to serve someone something they don't want. It's cool to violate them?",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": ">Yes it would obviously be different. There is a difference between having religious and moral reasons for your choices and a mere matter of preference or taste. \n\nActually, no. The reasoning doesn't matter. No is no. Serving someone something else than what you tell them always makes you the asshole. There is no gradient, you're just wrong if you do that.\n\nThe consequences of being wrong can change, but you're not less of an asshole.",
              "id": 77,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 412,
          "content": "This right here. I’m like really? Your husband and son wanting to eat what they eat but not stopping your daughters from being vegetarian is worth betraying two relationships and breaching trust with your husband and son? \n\nWhether vegetarians or meat eaters are right or wrong is irrelevant: You intentionally lied to two people in your life whom you are supposed to love so you and your *daughters* could mock and shame them. \n\nLike what is this going to get you? You think they’ll laughingly conceded that fake meat is fine for some dishes now? Like what did you honestly think the outcome of this would be? And what benefit does it gain you?\n\nNow your daughters have lost respect for their dad and brother because you told them something like this was a fine way to treat their family. You clearly don’t respect your husband and son very much. And they are no longer going to trust or respect any of you… good job.\n\nYTA\n\nPs. I’m now wondering if your husband and son will see this as an invitation to retaliate… and how exactly will you respond if they “get even” by putting meat in your daughters’ food? Will it just be good old fashioned ribbing then? And will it start s battle when you get mad and they tell you you did it to them??",
          "id": 78,
          "comments": [
            {
              "score": 182,
              "content": "> I’m not wondering if your husband and son will see this as an invitation to retaliate… and how exactly will you respond if they “get even” by putting meat in your daughters’ food? Will it just be good old fashioned ribbing then? And will it start s battle when you get mad and they tell you you did it to them??\n\nIf they're the sort of family that does \"pranks\" like this, I'd absolutely not be surprised if this sort of disaster ended up happening.",
              "id": 79,
              "comments": [
                {
                  "score": 184,
                  "content": "I was reading other people’s replies and started thinking, if OP is pushing it was just a prank I could see then deciding to get revenge… even if they don’t “normally” prank each other. And it’s really hard to say “this is a beyond prank boundary” when you *just* did the same thing.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 217,
                      "content": ">when you just did the same thing.\n\nGuaranteed OP and her daughters will be like so many vegetarians in this thread, and will claim its not the same thing at all because their dietary choices deserve special respect that non-vegetarians food choices apparently don't.",
                      "id": 81,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 156,
          "content": "I remember at one point my family gave me Turkey bacon and told me that we were having bacon sandwiches. I hate the stuff to this day because it was a horrible experience biting into something expecting one thing to get something else. Ironically I would have been open to trying it if they hadn't done that and may even have liked it had I not been expecting proper bacon",
          "id": 82,
          "comments": [
            {
              "score": 85,
              "content": "Nah, turkey bacon is gross. Even if you had known it was turkey it still would not have tasted good and you would have wanted a real bacon sandwich",
              "id": 83,
              "comments": [
                {
                  "score": 6,
                  "content": "Surprisingly, the turkey bacon Starbucks uses in their egg white and turkey bacon sandwiches is SO GOOD. It's the only turkey bacon I like.",
                  "id": 84,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "I *like* fake bacon and all kinds of \"healthier\" versions of things. But, turkey bacon? It's a total no go. Weird texture, weird flavor, weird smell.",
              "id": 85,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Yup, my mom did this to me with chicken hot dogs when I was a kid. I was violently ill for two days because of eating them. To this day, unless I know it's a Kosher beef frankfurter, I won't touch it.\n\nI also don't have a pleasant relationship with soy-based products. I'm always willing to try something new, but tell me about it first; so, that if I do get ill, I know how to deal with it.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I still remember when my mom gave me a roast parsnip telling me it was a roast potato. it was disgusting and I wouldnt eat parsnips for years afterwards. I actually quite like them now.",
              "id": 87,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "I expect that things have changed in the 40+ years since my mom would try to stretch a limited budget by mixing hamburger with TVP (texturized vegetable protein) and serving it in things like spaghetti sauce.  But I could smell it just walking in the house.  The sauce disguised most of the taste making it edible, but it just wasn't as good or as pleasant as the real thing.    \n\n\nP.S.  My  husband claims that he doesn't like oatmeal raisin cookies because it's horrible expecting chocolate chips and getting raisins.  LOL.",
              "id": 88,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "I had a friend who had a bunch of white glass cups.  You could never tell if a glass held milk or water. \n\nIt was fucking horrifying to get the opposite one from what you were expecting, even if you'd drink either.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 123,
          "content": "This! YTA. Tricking someone is never ok. Why not have an adult conversation about trying it? And maybe a compromise of 1-2 meals a week being exclusively vegetarian? \n\nAlso… just an fyi soy can cause digestive issues(and more). It’s not just allergy concerns.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 98,
          "content": ">Tricking someone into eating something other than what they thought they were eating is a massive breach of trust\n\nI made a joke once about switching ingredients and my mom still forces me to prove I'm using actual beef. We have a family recipe called buffalo chips, and the first time I bought the stuff and made them myself I acted as though I had used ground bison (because \"buffalo\" chips) and my mom, who is the resident picky eater of the family, refused to eat them despite me assuring her I knew it was actually ground beef until I produced the receipt and the beef packaging.\n\nNow if I make a roast, burgers, tacos, steaks, anything involving beef she demands proof it's actual beef even though I've never actually substituted for it before.",
          "id": 91,
          "comments": [
            {
              "score": 6,
              "content": "That's particularly wild to me considering that beef and bison are really pretty damn similar, and substituting one for the other is easy in just about any recipe.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Can you please share this Buffalo Chips recipe?",
              "id": 93,
              "comments": [
                {
                  "score": 17,
                  "content": "It's a tailgate type recipe.\n\n1 lb ground beef (or bison)\n1 lb sage sausage\n1 lb Velveeta cut into cubes\n2 Tbsp Worcestershire sauce\nHot sauce to taste\nCocktail rye bread\n\nPreheat oven to 350°F. Optional you can toast the bread for 5-7 min. Brown beef and sage sausage, drain and return to pan. Add Velveeta, Worcestershire sauce, and hot sauce and stir until Velveeta is melted completely. Put heaping spoonfuls on top of bread, bake 12 minutes.\n\nEnjoy right away or they freeze well. Reheat in 350°F oven or on a grill until heated through.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Came for the assholes, stayed for the recipe lol ty.",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "That sounds amazing. Will be saving that for the next game. Thanks for sharing!",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 87,
          "content": "This is the best argument I see here… how would it be if roles reversed? Would it still be okay? I highly doubt it! \n\nAsking them to taste two things that seem identical and test if they can tell which is which at least gives you consent to have them eat it. This wasn’t okay.\n\nYTA",
          "id": 97,
          "comments": [
            {
              "score": 8,
              "content": "Absolutely do a blind taste test if you really want a non-biased opinion but let them know what they are eating always before the two dishes are served so they can opt in or out.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "I’m curious how OP would react to her husband pulling the same “prank”. Would it be as funny if dad and brother tricked the girls into eating meat?  Yes OP, YTA",
          "id": 99,
          "comments": [
            {
              "score": 9,
              "content": "My mom eats cheese, but for some damn reason, is put off by the idea of brie cheese(maybe because it's covered in white mold).\n\nIf I hid some brie cheese in a dish and told her it didn't have any, she would rightfully be furious when she found out.  This situation is no different, and it pisses me off all of the people trying to claim \"iT's AsYmMeTrIcAl\".",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15447,
      "content": "I think it would’ve been better if you made a bet with them beforehand to try and see which one is real meat, this way you would’ve had their consent. Then you could’ve made both non-meat and been like haha it’s a prank. But yea they also just seem insecure they weren’t able to tell the difference and reacted immaturely. People react badly when they are forced to confront the idea they were wrong",
      "id": 101,
      "comments": [
        {
          "score": 3384,
          "content": "Ok this would’ve actually been ok and kinda fun.  If they knew they’d be eating the veggie version.  But the way you did it - YTA",
          "id": 102,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 614,
          "content": "YTA, you tricked them into eating something that they would otherwise refuse to it. They don't like it. They don't want to eat that. That's their thing/problem. They shouldn't have been disparaging vegetarian meat. They could politely decline to eat that. I didn't like that. But you can't just lie to people about the food you serve them. Soy also alters the hormone production in some people.\n\nI wouldn't want others to serve me food, and then reveal that it contained some ingredients that I sepise. I would be livid. That's a massive breach of trust. How can they know that you wouldn't pull that again? They'd be suspicious every time you or your daughters cook. How can you subject someone to feeling that? People have their own reasons why they don't eat certain food. What did you try to prove? That the taste resembles meat? Do you want them to do the same for your daughters? Prove that meat tastes like their meat substitutes, and they should just it that. I'm surprised that you played along with that.",
          "id": 103,
          "comments": [
            {
              "score": 356,
              "content": "But they did like it? What kind of childish logic is this? Did they not enjoy the meal? Yes? So how can you say they don’t like it?",
              "id": 104,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 142,
              "content": ">They don't like it.\n\nbut they did like it? they ate it all",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Then they should cook their own food.",
              "id": 106,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 335,
          "content": "This would absolutely have been a better solution. Now there's a good chance the two of them will be even more staunchly against eating meat substitutes, out of anger and embarrassment from being tricked. It's probably immaturity in their case, but you could also make an argument for it being good general policy to *never* reward someone who tricks you by doing what they wanted to trick you into.\n\nI personally think that a purely blind taste-test would have been best, so that there's no trickery involved at all.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 96,
          "content": "Yta This, yeah, just tricking them wasn’t cool. Now they will be even more against any kind of vegan substitutes.",
          "id": 108,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "Or tricked by their family into eating something that was presented as something else. Get real",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I was scrolling to find this. I am willing to bet any £100 they were mad because after years of making fun of daughters, they actually realised it wasn't so bad. Not because they felt their trust was irreparably broken over eating some soy without knowing. I say this say meat eater.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 9379,
      "content": "👏Stop  comparing what op did with feeding meat to vegetarians.👏\nIt is not the same at all.\n\nFather and son eat vegetables, vegetarians don't eat meat. \n\nPlus eating animal, aka things that were alive and  sentient, are way different than eating plants, things that were never sentient/ never felt pain. \nIt is not comparable. \n\nOP may be an asshole but it is *absolutely not* the same as if her husband was feeding her -and her daughters- meat.\n\nEdit : as OP said she is flexitarian I edit my reply to add the daughters as well, as I'm talking about giving meat to vegetarians.",
      "id": 111,
      "comments": [
        {
          "score": 477,
          "content": "Jesus, the clapping emoji.  If anything should stop it's that.",
          "id": 112,
          "comments": [
            {
              "score": 275,
              "content": "Never seen anyone who wasn’t obnoxious and wrong use the clapping emoji.",
              "id": 113,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Took the words from my mouth",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 205,
          "content": "Vegetarians choose not to eat meat. OP's husband and son choose not to eat meat substitutes. \n\nThere's no different here. Its all about choice and consent.",
          "id": 115,
          "comments": [
            {
              "score": 49,
              "content": "The other thing that is weird is I know devout hindus--who eat a traditional vegetarian diet-- that have a similar disgust reaction to eating \"fake meat.\" Maybe a lot of people just find that concept disgusting and rather than trying to trick people--just let people eat whatever they want and avoid the foods they personally find disgusting.",
              "id": 116,
              "comments": [
                {
                  "score": 10,
                  "content": "[deleted]",
                  "id": 117,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I feel like pure vegetable sandwiches would be better received. Like a cucumber sandwich.",
                      "id": 118,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": "It depends on your point of view. I think the comparison is valid because the issue is consent. Everyone deserves consent no matter what they prefer to eat. The reasons behind their preferred diets are completely irrelevant to the issue of consent.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "Whew vegans and vegetarians like to act like they are on some moral high ground. This is the same - not everyone can even eat all the soy based products, it’s rude AF and potentially dangerous to lie about food. I can’t eat soy at all and I eat plenty of animal products, I’d have been sick AF from this “prank”",
          "id": 120,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 30,
          "content": "I really want to know what happens if they ever prove plants are sentient or feel something like pain.",
          "id": 121,
          "comments": [
            {
              "score": 22,
              "content": "This is actually already an existing theory. Plants are much more intelligent than we give them credit for and experience pain and emotions",
              "id": 122,
              "comments": [
                {
                  "score": 11,
                  "content": "Isnt it shown that plants release a chemical or something to let other plants know there is danger?",
                  "id": 123,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Grass does specifically (that’s what “fresh cut lawn” smell is), idk about other plants. But I know they ran an experiment where they would change the lights in the room before doing damage to a tree (breaking the branches, pulling leaves, ripping bark). And eventually the tree started circulating water faster when the lights would change, as if its heartbeat was increasing like fight or flight.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "* [Do Trees Talk to Each Other?](https://www.smithsonianmag.com/science-nature/the-whispering-trees-180968084/)\n* [Exploring The Underground Network of Trees – The Nervous System of the Forest](https://sitn.hms.harvard.edu/flash/2019/exploring-the-underground-network-of-trees-the-nervous-system-of-the-forest/) (expired SSL CERT FYI)\n* [Mushrooms May Communicate With Each Other Using Electrical Impulses](https://www.smithsonianmag.com/smart-news/mushrooms-may-communicate-with-each-other-using-electrical-impulses-180979889/)\n\nWe human's really don't know nearly as much as we think we do.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "If you factor in all of the plants required to raise animals for the meat eaters, then veganism becomes a bit less ethical and non-veganisn becomes substantially less ethical",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 20,
          "content": ">Father and son eat vegetables, vegetarians don't eat meat.\n\nThat is a stupid thought process, people can want/not want to eat certain vegetables. Just because I like broccoli doesn't mean I like or want squash. \n\n>Plus eating animal, aka things that were alive and sentient, are way different than eating plants\n\nThat doesn't matter, if they don't want to eat soy or something, then they don't and shouldn't have to.",
          "id": 127,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "Plants are most certainly alive before being picked, and there is scientific evidence that plants feel emotions and pain, many are theorizing that they may even have a hive-mind like consciousness, so..",
          "id": 128,
          "comments": [
            {
              "score": 8,
              "content": "Really had to dig deep to find this comment. Many theories emerging recently about plants being far more sentient than we realize just in a different way than animals. When these theories are developed at a deeper level/become more mainstream, I’m very curious how this will impact the vegan/vegetarian community\n\nEdited: spelling",
              "id": 129,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "I hope you are aware of the fact that plants ACTUALLY FEEL PAIN! \n\nNumerous studies show that plants gets stressed or said differently. show signs of distress when cut or disturbed. Yeah they can't speak but they are also living. Trees have also shown evidence that old and mature trees can redirect nutrients to new trees to help them grow, through the root network.",
          "id": 130,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "My late husband used to love the seasoning I used on roast chicken, until one day he happened to see I used that chicken flavored msg grit and he was *horrified*, wouldn't touch it after that. I experimented with organic whole foods type alternatives but nothing was quite the same. Finally just put the chicken dirt into an empty can of Tony's and you'd think I saved Christmas. \n\nThis is that. This is absolutely not: testing someone's allergies, compromising their health, violating their personal ethics about animal welfare, or even being unkind. It wasn't done to shame anyone. Frankly who blows up about something like this? If you can't laugh it off when you've gotten in your head about something this benign, I shudder to imagine a significant conflict in that house. Or sharing.\n\nI feel like this is one of those reddit moments where people are trying to see it completely out of context and scale. And intent and consequences and... Like, \"well if the race/gender/age/species/gravity was reversed, everyone would die so to be fair and just that makes you literally Hitler, and that is a crime.\" \n\nThis is a whiff imo, but a damn funny one. Ah well, good luck to OP with that.",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "“It’s ok to feed beef to Hindus and pork to Jewish and Muslim people, they already eat meat.”",
          "id": 132,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5836,
      "content": "ESH \n\nYour son and husband are being ridiculous but you should never mess with people’s food. Besides, when was the last time doing a “gotcha” had a positive outcome?\n\nEdit: Wow thank you so much for the gold!",
      "id": 133,
      "comments": [
        {
          "score": 1470,
          "content": "Scrolled way too far to see this!\n\nOp has to compensate for everyone's tastes and it's ridiculous that her husband and son won't even TRY the vegetarian option to save time and hassle for them. It's stupid and selfish. And father should be setting example for son by saying, \"I can try this to be kind, and if I like it, cool. If I don't, that's okay, too. But at least I tried.\" But messing with people's food is just not okay!",
          "id": 134,
          "comments": [
            {
              "score": 980,
              "content": "THANK YOU! First comment I have seen calling out the father and sons behavior. Forcing whoever cooks to make separate meals all the time because they don’t like the IDEA of fake meat, no mention of taste issues. Dad needs to grow up and be a better example for his son. \n\nEdit-I keep getting comments that seem to assume I agree with what OP did. I don’t know why. I didn’t even include a judgement in my comment. Im not commenting on the whole scenario, if I was I would have made my own parent comment. I’m talking about one part of the big picture. All I’m saying is the dad is setting a bad example for his son about trying new things and being open minded and this childish behavior OF NOT EVEN TRYING the alternatives and forcing everybody to do more cooking and cleaning work is silly. I’m not even saying every meal needs to be vegetarian they just need to be willing to try the alternatives so maybe some nights they can just cook one meal. There are so many different types of alternatives, brands, styles, protein sources they will find something they like if they just try some. They already seem to like whatever soy product was used in the spaghetti.",
              "id": 135,
              "comments": [
                {
                  "score": 21,
                  "content": "But she said there is an equal division between cooking and cleaning, so it sounds like the father/son does the cleaning. So it makes your point moot.",
                  "id": 136,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "I think you missed the part where it says the cooking and cleaning are equally shared. If that’s the case, the father/son are cooking meals that they will never eat just as the daughters are. No matter how you slice it, the only people who were dishonest in this scenario were the mom/daughters. Why try to spin it any other way?",
                  "id": 137,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 354,
              "content": "Yeah I definitely got big-macho-man vibe that husband and son are high and mighty about only consuming \"real meat.\" My dad has some sensitivity to low grade meats, so we always had to buy all beef hotdogs, bologna, etc. He developed a similar mentality.\n\nCompletely blew his mind that hubby and I are very willing and regularly try meat substitutes and vegetarian options at restaurants or at home during COVID when meat protein suddenly became scarce.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I think I have a better solution for not making two separate meals..... just make ONE vegetarian meal. Without meat and without meat supplements. Or add the meat later on. Like I made once a meal where you had to fill a tortilla wrap with corn and stuff. I just mixed what ever goes with the corn, made me some tortillas and then mixed in tuna and used the rest for my boyfriends tortillas. I didn't have more to clean up and everyone was happy.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 213,
          "content": "> Besides, when was the last time doing a “gotcha” had a positive outcome?\n\n[The guy who proved to his girlfriend](https://www.reddit.com/r/BestofRedditorUpdates/comments/w0mpa9/oop_aita_for_being_mad_my_bf_wont_make_noodles/) that the \"essence of sauce\" she felt existed when she washed all the sauce off her pasta, was all in her head.\n\nThis thread is basically that.",
          "id": 140,
          "comments": [
            {
              "score": 133,
              "content": "I read the update that she broke up with him, but I guess she won't get lonely because she still has the essence of her boyfriend on her.",
              "id": 141,
              "comments": [
                {
                  "score": 19,
                  "content": "Oh, would that I had gold to give!",
                  "id": 142,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Thanks for the link, I missed that one!  What a wild ride, lol.",
              "id": 143,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Omg what an exhausting person lol",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "[removed]",
              "id": 145,
              "comments": [
                {
                  "score": 34,
                  "content": "I think that update is BS. They mocked her like crazy in the comments. I think she was just trying to find a way to blame him for everything and for everyone to ignore her and her ridiculous ways.",
                  "id": 146,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 191,
          "content": "I disagree, if she had a problem with how they were acting and didn't want to cook 2 separate meals she should have said \"I am making XYZ with meat alternatives, if you don't like it you can make something yourself.\" Then not liking meat isn't any more valid than them not liking fake meat.",
          "id": 147,
          "comments": [
            {
              "score": 21,
              "content": "That would have been better because at least the husband and son know what they’re putting in their mouths or have the option to make alternative meals. Tricking people into eating food they don’t consent to is not ok.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 122,
          "content": "Although I voted differently, I think you made an excellent point.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "I honestly feel like it wouldve been better to A) make some kind of game out of it, like a bet, so theyre open to trying it. Or B) saying your not willing to make to versions of the same dish anymore, so the father and son can either eat what OP makes, or do dinner themselves.\n\nI honestly dont really think shes an AH as they dont have any allergies or some kind of religious thing agaisnt vegetables, but its kinda rude to do.",
          "id": 150,
          "comments": [
            {
              "score": 15,
              "content": "Or just make a vegetarian version that doesn't use a meat substitute? Just fill it with veggies. Peppers, onions, mushrooms, spinach, squashes. Only recently have meat substitutes been a thing. If dad and son want meat, they can brown their own beef and add it to the sauce on their own.\n\nWhen there's ways to make vegetarian meals that are cool with all parties, do that. Don't trick them into eating the processed meat substitute.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "My wife does this allll the time. \"oh by the way, those are veggie noodles\" \"oh by the way that's soy blah blah.\" literally not a big deal. husband and son need to stop being crybabies. it wasn't poison, it didn't hurt, and it was veggie spaghetti, cry me a damn river.",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "When I was a kid (10?), after dinner one time my mom asked \"how were the sloppy joes?\" We were all \"great\" \"awesome\" etc.\n\nThen mom dropped the bomb it was ground turkey instead of ground beef. It taught me not to dismiss foods outright.",
          "id": 153,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "> Besides, when was the last time doing a “gotcha” had a positive outcome?\n\nThe only time I can think of in my personal experience was when my parents did something like this to me when I was a kid. I could tell the difference, though, and that finally shut them up about it at least.",
          "id": 154,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2171,
      "content": "YTA\n\nTricking people to eat things that they have verbally expressed to not wanting to eat, is a massive breach in trust.\n\nNot only is this dangerous in regards to food allergies and intolerances, but flip the tables here for a moment?\n\nHow would **YOU and your daughters** have reacted if your husband and son decided to cook meat for you guys and lie by stating it's vegetarian? They'll wait until you've finished eating and then laughingly reveal that you just ate a real burger.\n\nYou and your daughters would've **flipped out of your minds.** So how is it that you can do that to them but not the other way around? It doesn't matter that it tastes good, that they enjoyed the meal.\n\nThe moment that you know a person does not want to eat something, no matter what the reason, and you resort to lying to get them to eat it, you are a massive AH.\n\nThis wasn't even a prank. This was, by your own admission, a test to see if you can convert them to being vegetarian so you need to do less dishes.\n\nYou know how you test that?\n\n**YOU ASK THEM TO TRY AND TASTE A DISH.**\n\nAnd if they say no, guess what? You can't force them to taste it.",
      "id": 155,
      "comments": [
        {
          "score": 617,
          "content": "YTA. This is the perfect answer. I have loads of allergies so this sort of thing chills me. There are no allergies *that you know of* but allergies can appear at any moment - even for food you’ve eaten every day of your life. You should always, always know what you are putting in your mouth.\n\nAnd yes, if the tables were turned your daughters would be furious if your husband had done this to them, so what gives you the right to do it to them? I have to cook 4-5 different meals in my house every single meal because of various allergies, autoimmune diseases and vegetarianism but you know what? I just do it and sod the washing up. Stop being fucking lazy. No means no!!",
          "id": 156,
          "comments": [
            {
              "score": 169,
              "content": "This is my thought as well. I'm allergic to peas, soy, beans, lentils, chickpeas, basically everything that can be used for fake meat. What if I'd been a friend visiting that night? I could have gotten severely sick. Sometimes I push through and eat too much of something that's causing a reaction even though it shouldn't, because maybe it's just heartburn or something.\n\nI also developed the soy allergy as a young adult and it took several years for a doctor to help me figure out what it was. I haven't liked beans and peas my entire life, and I've always wondered if I was allergic as a kid, too, and my refusal to eat them wasn't because of pickiness, but because they made my stomach hurt. Maybe the dad and son have an allergy that they don't even know about yet.",
              "id": 157,
              "comments": [
                {
                  "score": 35,
                  "content": "I know exactly what you mean! I got so mad reading people saying that you can’t get sick from soy. I was 20 and my friend decided to have us for dinner and didn’t tell us she was using a soy meat sub. About 1 1/2 later I couldn’t stop throwing up and my head felt like I had a jackhammer going to town. Breathing labor got taken to the hospital and in the ambulance had a heart attack because of the dehydration and stuff. It’s not common but for me to find out like that is crazy.",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I played a dumb game as a kid, that fortunately was a good learning experience without being bad. My grandpa had made this chocolate pudding dish thing and I was like oh yum there's walnuts in this I love those 😸😋 and my friend who was over was like wait there's nuts in this?? And I was like why? And she said I don't like nuts. I lied and said there weren't any nuts because as a like 10?? Year old I didn't want her to not eat my grandpa's delicious food because the nuts were really good too. She took a bite was like YOU SAID THERE WEREN'T NUTS IN THIS!! And I asked why she didn't like nuts, and she said IM ALLERGIC TO NUTS!!!! in those .5 seconds after I felt absolute horror and doom, before she fell over and started fake choking, because she wasn't actually allergic to nuts, but I have never once insisted or tried to trick someone into eating something they didn't like since then, because who knows maybe they don't like the food because they're allergic 🤷‍♀️ saying you dont like something is enough and shouldn't be forced.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "In fairness, “allergies developing” is something that could happen at any time. If he developed an allergy to soy, it could’ve been this meal. Or sushi at a restaurant. Or stir fried rice. The food he ate was already included in his diet, just this time without his awareness.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I'm sorry, but what kind of parent simply take \"no\" for an answer when making food for their kids (with exceptions for allergies/intolerances/moral restrictions)? I loved meat as a kid, but you bet your a** if my mom was experimenting with a vegetarian version of a dish, that I was eating it.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1226,
      "content": "[removed]",
      "id": 162,
      "comments": [
        {
          "score": 599,
          "content": "OR, or hear me out..  \n\n\nWhat if instead of doing a stupid prank....she just TOLD them they were in charge of making a meat version of whatever she was cooking instead?  \n\n\nYou know? Talked like an adult.. to her husband?  \n\n\nI think doing the \"LOL PRANKED\" Gotcha move was being the AH in the situation, nowhere in the post does she mention  to them about being tired of having to do so many dishes....  \n\n\nShe can talk to her husband,  they are both adults... reach a compromise instead of antagonizing...",
          "id": 163,
          "comments": [
            {
              "score": 7,
              "content": "Offer the choice between home cooked meatless sauce and the jar of prego in the pantry and see how strong their convictions really are.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": ">There is an equal distribution of cleaning and cooking in this house, thankfully.\n\nShe literally even goes so far as to say the amount of cleaning after the fact is distributed evenly, meaning everyone cooks and cleans (presumably) the same amount.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 215,
          "content": "Their reasons don’t matter. You don’t lie about the food you’re serving to people.",
          "id": 166,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 132,
          "content": "“It was okay for her to lie to them because they didn’t agree with her opinion.” <— your reasoning\n\nWho cares why the prefer meat? I agree they could’ve at least tried it, but their refusal doesn’t give her a pass to secretly tamper with their food. Being vegetarian can sometimes mean putting that extra work in if not everyone in your household is one. Whether it’s that OP needs to accept that, or cooking as a chore needs to be shared, or each party is responsible for their own meals, there’s a solution there. Lying to husband and son about what they’re eating isn’t it.",
          "id": 167,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "right?!? these answers are crazy to me lol. fake meat is just vegetables. its not like its made out of horse dung",
          "id": 168,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1103,
      "content": "NTA as a one-off.\n\nYour husband and son claimed they didn't like vegetarian \"mock meats\". You and your daughter carried out a blind taste test in which you established that they don't have a problem with anything about soy \"meats\" but the idea of them.  \n\nNow it's really up to your husband and son where they go with this information. They're entitled to still eat meat rather than soy.",
      "id": 169,
      "comments": [
        {
          "score": 410,
          "content": "I would absolutely make them cook it for themselves at that point.",
          "id": 170,
          "comments": [
            {
              "score": 223,
              "content": "> there is an equal distribution of cleaning and cooking in this house\n\nIt’s not like only she cooks two separate meals everyday everybody cooks two separate meals on the days they cook",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "Then the vegetarians can cook for themselves when it’s the the dad cooking. Or better yet they continue sharing cooking as they have been since it seems to work well.",
              "id": 172,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "As a wife of a vegetarian (who routinely eats vegetarian, if my husband did this to me, it would the last time he cooked for me, and the last time I cooked for him. YTA",
              "id": 173,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "just because they couldn’t tell a difference doesn’t mean that they should be forced into being vegetarian. you’re acting as if it’s wrong for them to still want to eat meat regardless if they could tolerate the fake meat. it’s personal preference. i’ve had vegetarian burgers before and they were actually\npretty good, it was a solid meal and i didn’t think anything bad of it… but i would still rather have a normal burger any day. nothing wrong with that.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 114,
          "content": "Yeah. Everyone is being dramatic af about this. My food is not sacred, if someone served me vegetables instead of meat it’s not the end of the world.",
          "id": 175,
          "comments": [
            {
              "score": 70,
              "content": "Right? All these people talking about \"breach of trust\" as if being fed a dinner you liked but didn't think you'd like (and have no moral/health reasons not to eat) means you can't trust your wife/mom and this family is now broken forever. Wtf?",
              "id": 176,
              "comments": [
                {
                  "score": 28,
                  "content": "yeah these people are hilariously out of touch lmao",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Yeah honestly this thread is bonkers to me. Aside from allergies, there is literally no harm in eating a vegetarian substitute for meat, and OP states they have issues with the concept, not anything else. If they’d said before “I hate lentils.” Or “I think soy tastes like garbage.” Or “Eating this makes me feel sick.” Then sure, feeding them a meat substitute when you know that info is a huge AH move. As it stands, they just refused to even try it, and they’re mad they got shown up. If OP continues to do this, then that’d start breaching into AH territory. But seriously, most of this thread needs to get a grip. \n\nAnd for the record, I once fed my husband vegetarian taco meat because even though we’re both meat eaters, we had some leftover from a vegetarian friend that visited. After we ate, I told him it was the veggie meat and he was like, huh that wasn’t bad I wouldn’t have expected that good to know. And that was it. The son and dad’s reaction is way over the top.",
          "id": 178,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 917,
      "content": "Yta I’m a vegetarian and I still think this is wrong\n\nDon’t mess with peoples food, no matter if you think your right, doesn’t matter if you are right\n\nDon’t mess with peoples food, it’s unacceptable",
      "id": 179,
      "comments": [
        {
          "score": 251,
          "content": "Yeah, i will just throw this in: breeching trust, deceiving people, knowingly misleading....what good can come of that?  What did you win here?  But you lost Thier trust...YTA",
          "id": 180,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "It's a really bad precedent to set, and a bad lesson for her kids. Maybe this instance was harmless but what if they start messing with other people's food having been taught it doesn't matter and it's funny, but this time someone gets sick?",
          "id": 181,
          "comments": [
            {
              "score": 79,
              "content": "I came here to see this point because I'll never forget the lesson I was taught in science class. My mother was always the type to trick us into eating things, I have an insanely sensitive digestive system and spent most of my childhood sick for \"unknown reasons\" so I had normalized tricking people/lying to them to try certain foods, pranking them with food, etc. \n\nOne day I took two bags of dried peas to class, and was snacking on them. The class rule was we could eat but without disrupting the rest of the class. One bag was regular peas the other was wasabi peas, after class my teacher asked for some of the peas and I thought it would be funny to pour him some from the wasabi peas. So when he held out his hand I tipped the wasabi peas into it, then stood back to see his reaction. He starts gagging and spat them out and asked me, \"Did you give me *wasabi*?\" And I grinned, so he continues \"I'm allergic to wasabi.\" My face fell and I'm in full panic thinking \"Oh no oh no oh no.\" So as I start to apologize and incoherently ask what I should do he took a deep breath and told me very sternly, \"I don't have any allergies. However, I saw you switch the bags and I imagine that if you're willing to do this to your science teacher then you're likely to do this to another student, someone who might actually have an allergy to wasabi. Yes, I tricked you, as you tricked me, before someone got seriously hurt. I hope you're more considerate of the risks of such things from now on, okay? Go.\" \n\nI'm older now than he was then and that incident is still burned into my brain, I have never pranked anyone else with food since. It's a matter of consent and trust.",
              "id": 182,
              "comments": [
                {
                  "score": 21,
                  "content": "This is the lesson OP needs to learn.",
                  "id": 183,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I'm vegan and if anything, I think that makes me more sensitive to this issue. There was a time when I wouldn't have thought twice about what I put in my mouth (as an omnivore) and so I wouldn't seen the big deal of what OP did. \n\nBut now I do understand the value of knowing what you consume and the right to be in full control of what you put in your body. I once was fed ham thanks to a careless waiter who gave bad information and when I suddenly realized I'd been eating it, I got very emotional. I was so embarrassed at my own reaction and ran to the bathroom because logically, I felt that I shouldn't care that much. When I went back to the table, I apologized and said I have no idea what came over me and my dad said, \"it's because it's almost like a violation.\" It sounds dramatic, I know. But it did make me see that what we put in our mouths is what we are choosing to let into our bodies. Even when we choose to take risks or consume something foreign or even play games about not knowing what you're eating, you're doing so with full agency.\n\nThere's a reason there's so much legislation around nutrition labels and listed ingredients. People have a right to know what they let past the gates.",
          "id": 184,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 762,
      "content": "YTA.\n\nWhile I agree that their snooty attitude about meat substitutes is silly, it is always an asshole move to lie about a person's food. \n\nI imagine your daughters would be livid if their father or brother sneaked meat into their meal to prove a point. And they would be justified.",
      "id": 185,
      "comments": [
        {
          "score": 196,
          "content": "That's the main point. You and your daughters shouldn't have served them food they don't want to eat. Some people don't like meat substitutes. Some people even think that soy is bad for them, or interferes with their hormonal cycle. So it was plain wrong.",
          "id": 186,
          "comments": [
            {
              "score": 27,
              "content": "My family has a nasty habit of developing Kidney stones, and I structure my diet accordingly. So if someone were to sneak me a soy based meat product I’d have a heart attack. Soy is one of the big things I refuse to eat because of this, due to its oxalate content.\n\nObviously her husband and son are resistant to the idea for mental reasons rather than anything else. But the point is that you shouldn’t make a habit of tampering with food to prove a point. It’s not cute, and you just might mess with someone who has an actual reason for not eating something.",
              "id": 187,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 695,
      "content": "Slight YTA, as a parent sure, doing this to you kids is fine since your are wholly responsible for them but not to your husband. He is a person with agency and testing people like this unless they specifically consent and understand the parameters of the test is an AH move. \n\nMaybe your husband thinks that you and the girls spend too much on shampoo so he starts refilling the bottles with cheaper product to see if you can tell the difference? Would you be pissed?\n\nHe supposed to be your partner and shit like this is how you ruin the trust you have between you.",
      "id": 188,
      "comments": [
        {
          "score": 216,
          "content": "This! Perfectly stated, YTA. It's not respecting the autonomy of the husband as a human being. Society generally views kids a bit differently, so that's a bit less of an issue.",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 118,
          "content": "I don't agree with the \"slight,\" but other than that, thank you for giving an example other than \"what if they pranked the girls into eating meat\".\n\n\nThe claim the guys have is that meat is better and they don't like soy. The girls never claimed that they don't like the taste of meat, or that they could tell the difference....they don't want to eat it for probably moral reasons. And eating it after not eating it for awhile could mess with their digestion.",
          "id": 190,
          "comments": [
            {
              "score": 22,
              "content": "I completely agree. Happy to see another comparison that is a bit more equivalent than forcing vegetarians to eat meat.",
              "id": 191,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I thought it was that they found the concept of imitation meat weird?  Not that they didn't like the taste or anything but that the idea of taking something to try and make it mimic something it isn't/let it serve as something else was weird/off putting to them.",
              "id": 192,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "This is a really good example! I was struggling to put into words how I was thinking about this. Because yes, feeding omnivores vegetables is different than feeding vegetarians meat. But it’s the way that you’re looking down on the person that you supposedly love, making a joke about what they do and don’t like. \n\nHonestly, this reminds me of shit like waiters or other food staff giving people Diet Coke instead of the regular they ordered, or vice versa. It’s the “I know better than you” mentality that rubs me the wrong way. I try to eat a couple meatless meals a week. A lot of the meat substitutes are hit or miss. I love some and gag when I try others. The son and husband have every right to say they don’t feel like trying it. It doesn’t sound like they are talking down to the daughters and wife for eating vegetarian, trying to convince them to eat meat, it sounds like they just don’t want to try vegetarian food. And that’s fine!\n\nLike some others suggested, OP could have made both recipes and told her son and husband about it and they could have CHOSEN to try both and see how they compare. Because maybe then they would have been pleasantly surprised about how good it was and would be open to trying more, but that is definitely not  going to happen now. In fact, since OP tried to say it’s just prank, they might prank back. And while again I see how it’s apples to oranges with feeding vegetarians meat and omnivores veggies, the son and dad probably wouldn’t consider tricking them into eating if they hadn’t been pranked first.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Wait so are your kids just .. not people with agency or? They can make their own choices, including to and not to consent, and if they say they don't want to eat something specific, that's their decision. Just because you're the parent doesn't mean you get to choose that for them. Your kids trust you, too. I think that trust is more important than your partner's.",
          "id": 194,
          "comments": [
            {
              "score": 12,
              "content": "Right?? I completely agree OP is TA, but this person's insinuation that it would have been completely okay to \"just\" trick the son into eating something he didn't want to eat is...ick. Children are people, full stop.",
              "id": 195,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Maybe I should have said \"complete agency\" but the point being is that kids don't get to decide everything about their lives while they are in their parents care. Parents choosing what their kids eat for dinner is fine and normal and accepted, just like parents choosing where their kids go to school, the after school activities they get signed up for or the clothing they wear because they are providing it. Yes kids are people but while they are kids their parents are in charge and if that mean sometimes eating meat substitute spaghetti, thats ok.",
              "id": 196,
              "comments": [
                {
                  "score": 6,
                  "content": "It would be fine if they had known beforehand and consented. If op had them blind taste test the soy with actual meat, and they actually ended up liking the soy, it totally would be a different story. But op lied and didn't give them a safe option at all. It's not an everyday \"they didn't like this but I made them eat it anyway\", it's a deliberate action op and her daughters took against them and op's son & husband are valid for being upset about it, especially since they were lied to",
                  "id": 197,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Thanks for providing an example other than “what if he tricked the girls into eating meat”! Yours works a lot better for the moral debate.",
          "id": 198,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "To be clear, the children are people with agency too. It's more that tricking young kids into eating stuff can be considered a situation that potentially benefits them and they're terribly difficult to reason wirh.",
          "id": 199,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}