{
  "post content": "My sister is getting married next month to my best friend. She always wanted a nice snow wedding in the cabins we used to go to when we were in school. Everything was going fine until she told me it was a child free wedding. Now, that would be fine with my wife and I because we would just drop of my son and daughter at my wife's parents or with their godparents, but my sister had asked them to be the ring bearer and the flower girl. Apparently, they want the kids to perform their duties at the wedding but then not attend the reception. That means either my wife or I will have to be there with them alone in the cabin while everyone is \"partying it up\", but wait, I'm the best man and will be conducting the reception so it's just going to be my wife. What about food? My mom will give my wife 20 minutes to come in, grab some plates with food and come back because the mother of the bride can't be missing for too long. \n\nSo, they expect me to abandon my wife with our kids who are under the age of 7 in a tiny cabin that is not child proof, where the source of heat is a fireplace and there is barely any cell signal. This is the day after driving for 7 hours with said kids. Not only do I think this is not a safe idea considering it would be the middle of winter, my wife has never been to these cabins and the lack of ability to properly communicate, but also, I think it's incredibly rude to invite someone to a destination wedding where they are only allowed to attend the wedding. Although my wife says she can manage (she's really gullible sometimes and is a little bit of a people pleaser), I refuse. She's not being treated like a guest but as the babysitter for the ring bearer and flower girl.\n\nI tried to talk to my sister and the jack\\*\\*\\* I call my best friend, who always preaches about being there for friends, loyalty and whatnot, but they are not conceding or willing to compromise. I asked if my kids could attend until the toasts, games and food then all four of us would retire to the cabin and let them party, no. If we could go completely child-free and leave the kids behind, no. If I just attend the wedding and retire to the cabin after the wedding, no. My sister is against all of these ideas while the jack\\*\\*\\* has taken a temporary vow of silence. \n\nSo, I'm pissed and said I'm not coming. Which in turn, began the messages and calls from everyone. My family, the groom's family and their/our friends. My wife has openly said that she can manage this, but I know that's to keep the peace. My kids are also upset because before asking us, my sister and jack\\*\\*\\* asked them first to participate in the wedding and they were really excited because they're close with both of them. \n\nWith all these calls and messages, I feel I'm going crazy and maybe I'm the a\\*\\*hole instead. So, AITA?",
  "id": 1,
  "comments": [
    {
      "score": 15183,
      "content": "NTA\nIf she wants child free then she does not need your kids as props.\n\nAs a parent you have the right to not attend a child free wedding without guilt.  \n\nTell her she should hire some local children for the gig.",
      "id": 2,
      "comments": [
        {
          "score": 5477,
          "content": "I am so confused by the request! Aren’t most child-free weddings child-free so the ceremony goes off without a hitch? Who requires children as props for the ceremony and then ban them from the reception? If these children can be trusted with key roles in the wedding, why not trust that they can behave for the reception or at least a part of it?",
          "id": 3,
          "comments": [
            {
              "score": 2194,
              "content": "Some of it is because of concerns about child disruption at the ceremony. Some of it is because of similar \"disruption\" concerns at the reception.\n\nBut some of it, imo, has to do with people who just want to have a party where they can get absolutely trashed, and don't want kids around because they feel it will inhibit the type of party atmosphere they want.\n\nI also have opinions that the \"disruption\" concerns can be tied more to adults than anything about the kids themselves. (but thats its own opinion piece for another day)\n\nAny way you go about it, people should treat child-free weddings in the same vein they should treat destination ones. It's fine if you want to have one. Just don't complain when other people don't want to attend.\n\nOP is NTA. And you're right. His sister is treating those kids as props.",
              "id": 4,
              "comments": [
                {
                  "score": 813,
                  "content": "These are the reasons we opted for a child free wedding: disruptions, freedom to drink, and the atmosphere. We paid for the wedding ourselves….our day our choices. This is also why we didn’t have a flower girl/ring bearer. I thought that would cinch all whining at the get go. The last thing either of us wanted on our wedding day was to hear a screeching child during our vows, pay to serve chicken nuggets and tator tots, or arrange kiddie entertainment during the reception. Out of the many couples with young kids, only one duo made a fucking scene about it (not at all due childcare; entitlement “my kid is special” reasons). But, they still showed up, and our wedding was a blast!   \n\nAnywho, NTA. The bride/groom certainly did their best to make it impossible for OP. If they want child free, go all the way with it. If they really want a ring bearer/flower girl, they should at the very least be paying a rental fee to OP since the kids are supposed to magically disappear when they’re no longer needed. Or, the happy couple to-be could hire them a local babysitter, considering OP is in the wedding party. How OP is expected to make this work is mind boggling.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 575,
                      "content": "In my family everyone just drinks in front of the kids.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 67,
                      "content": "I completely respect people's wishes for child-free weddings. I have a son (and a daughter on the way) and I just have either set of grandparents watch the kids or don't go. One of my best friends is getting married when my daughter will be only 3 months old (and the wedding requires us to fly). It took some creative thinking but we're making it work. But if not my friend wouldn't be mad. She'd be sad I wasn't coming but would understand.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I’ve been to one “child-free” wedding/reception with close relative kids as ring bearers/flower girls … and it made enough sense because they were local.  Ie, it wasn’t far to bring the littles home for bed, whereas others who were traveling wouldn’t have that option.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I've also seen \"child free except immediate family\", and I think most adults are going to be understanding of that, and the ones that aren't are likely to have the \"problem child\" anyway. The understanding ones will either decline or get a babysitter. \n\nThat said, I think most disruptions \"caused by\" kids are the fault of their parents, or at least their parents are shirking their responsibility to handle their children. Irresponsible parents give kids a bad rap.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "We had a child-free wedding, but we also hired a certified babysitter and paid for a kids’ playroom during the reception so the parents could relax and enjoy themselves. Any chance of something similar happening as a compromise?",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "See my wedding was the opposite. We were really relaxed, at a state park thing, and when the flower girl didn't want to wear her dress, and wanted to walk with the groom, and all that I just DIDN'T CARE. Because my friends kid was my flower girl, and that was great. I wanted kids at and in my wedding and was 100% prepared for the realities of it.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 190,
                  "content": "\"people should treat child-free weddings in the same vein they should treat destination ones. It's fine if you want to have one. Just don't complain when other people don't want to attend.\"\n\n100% this.  It's your right to have whatever wedding you want, and it's the invitees' right to choose not to attend.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 136,
                  "content": "This is why you set a cutoff after which the kids will go to bed. My aunt at her wedding very cleverly had the DJ play a song my little cousin liked at the time the kids needed go to bed, so their parents could say \"okay we can wait for this song to play and then it's time for bed!\" And after that song played they started playing songs with swearing etc.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 49,
                      "content": "It was Tupac's Hit 'Em Up wasn't it? Kids love that song.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "I always thought having kids at a wedding was part of the joy. Kids disruptions aren't really as big an issue as people make out and catching up with family and friends is one of the main draws. What's next banning old people because they smell?\n\nI'm not sure when weddings became so hyper focused on the bride and groom at the cost of everything else.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 91,
                  "content": "But the thing is… it’s a **child free** *and* **destination** wedding. But they still want to use these kids as PROPS during their ceremony and refuse to let the husband leave during the reception because they won’t allow his kids there which in turn means his wife can’t come in a snowy cabin with only a fireplace for heat with kids under 7. He tried asking for multiple options before saying he’s not going another one of them being that the kids be there just to eat and do the games then leave for the party but no the MIL HAS TO GET THE FOOD FOR HIS WIFE AND KIDS and only be gone for 20 min. Which means the kids can’t go get their food, neither can the wife and they don’t want MIL to keep wife company because it’s such a staple that mother has to be there and so does brother. It’s not even like he didn’t try giving bride and groom different options they just said fuck his kids. They are such assholes it’s not even funny. Op is NOT TA",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 73,
                  "content": "I went to a wedding like this. It was all ages and trust me, every family with children left long before the drunken part( the kids were bored and tired) We left at 10 pm, only one sleeping child was left and they were getting ready to go. I guess having a curfew would be rude wouldn’t it?\n\nI heard about it later since I’m an early to bed person and left early. They literally partied all night.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Agree with this. I've never been to a child-free wedding. The parents with kids usually leave by 9:30-10, because by then it is long past the kid's bedtime, and even if the kids are still away and having fun, the whole family will pay for it the next day when the kids are crabby. Of course, I also grew up in a farming community, and the cows wait for no one. Doesn't matter how hungover and tired you are the next morning, you still have to get up and get going by 6 a.m.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "At my own wedding i left at 10. Tbf I was also 5 months pregnant so I was super tired.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "There's nothing at all wrong with wanting a party where you can let rip, even if that's because you want everyone to get rip roaring drunk or you just don't want people to feel uncomfortable talking about things with kids around during a relatively tame party.\n\nWhat's fucked up is wanting kids as props then demanding the parents of said props just fuck off with the kids right after and how they do that isn't any concern of those. You want the kids for hte wedding then you make arrangements to handle it. \n\nIf they were going to leave the kids with the parents, then the bride/groom should offer the parent $500 or something to drive up for the ceromony then take the kids home.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 4,
                      "content": ">There's nothing at all wrong with wanting a party where you can let rip, even if that's because you want everyone to get rip roaring drunk or you just don't want people to feel uncomfortable talking about things with kids around during a relatively tame party.\n\nThere was this one AITA when this wasn't the case. To sum it up the Grooms kicked out all the kids/family at like 7 PM to take poppers and have an orgy. That one was ruled a resounding YTA.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I'm more concerned about how they all want to treat his wife, because the kids won't care one way or the other. (Because you don't have to tell them anything.)",
                  "id": 22,
                  "comments": [
                    {
                      "score": 3,
                      "content": "This.  It’s like everyone is trying to not have his wife there.  They should have just come out and told OP that his wife was not invited, and for her to stay home.  In my family it would not look good for the couple if the entire bridal party to be at the reception, especially if children are part of the wedding party.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 242,
              "content": "My bil had a \"child free except for wedding party\" wedding. His niece (my oldest) and her niece were flower girls,  they were the only kids allowed at the wedding. My mom watched my at the time middle one. It didn't bother me the younger one couldn't come,  who wants to chase after a toddler at a wedding. I would have been mad however if they only wanted my oldest to be a prop as another poster commented. I probably would have stayed home and not allowed my daughter to participate.",
              "id": 24,
              "comments": [
                {
                  "score": 152,
                  "content": "Our wedding was \"no kids except our nieces and nephews\" (three of whom were in the wedding) and got zero complaints. \n\nI couldn't imagine asking the kids to be in the wedding and then excluding them from the party.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 96,
                      "content": "Seriously, the wedding is the horribly boring part that kids hate.  So they have to be in this stuffy wedding bored out of their minds, but god forbid they get to go to the party.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "My brothers wedding is going to be no kids except their nieces and nephews and I was like okay but can I still my toddler behind?",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 20,
                      "content": "I agree. Now here's my personal dilemma, I don't necessarily want a child free wedding but would not like my nieces and nephew to be there. They are really misbehaved and my brother can be enough to handle with his lack of reading a room. Idk how to have navigate that w/o hurting someone's feelings so we are honestly considering just going to the courthouse to avoid drama.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "My wedding was a Fuck Yeah Bring yo Kids! And only the flower girl, a cousins 12yo, and another cousins pregnany belly, was the extent of our kids. \n\nOf course, we had moved just months before the wedding so every guest was traveling from 2+ states away, and it was middle of the school year, in April, in Colorado with unpredictable weather (blizzard the weekend before and after but beautiful for our weekend!). So I don't blame anyone lol. But I was all prepped to make plenty of kid friendly plans if any RSVPd.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 119,
              "content": "100% as gastro stated. They want cute, instagramable props and then they want OP’s wife and the kids to F off so they can pretend they don’t exist.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 101,
              "content": "It seems to be a common thing (at least from what I've read on AITA) that even in child-free weddings there's often a flower girl and a ring-bearer. But I agree with the comments, that child free weddings are fine, but no one should be surprised if couples with kids decline to participate. NTA",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "exactly?  the ceremony is the key thing you don't want ruined, the reception is just a party, who cares if a hyper kid is getting down on the dance floor?",
              "id": 32,
              "comments": [
                {
                  "score": 52,
                  "content": "At our good friend's wedding, it was the kids who kept the dance floor going for most of the night. It was an absolute hoot to watch.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 23,
                      "content": "At my BILs wedding, my 3 year old slept through the reception. He only woke up once to barf up the chocolate cake. \n\nMy almost 2 year old daughter danced her little heart out. She was one of the last ones still on the dance floor. At the end, she took of her diaper and mooned everyone.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "I didn’t want kids at my wedding reception for the same reason I wouldn’t want to go drink in a bar with kids running around. It’s just too much potential for something to go wrong.\n\nNow that I have kids, I prefer kid-free weddings so we can go out and party without worrying about being responsible for keeping a toddler safe. For example, with a kid present either I or my husband will have to forgo drinking - I won’t drive my kids even if I’ve had just one drink, and trying to Uber with a kid who needs a car seat is too much of a gamble. If we’re invited to a wedding with the kid, we will usually stay for dinner and leave shortly after. Much like a vacation with kids, a wedding reception can still be fun, but it’s a *very different* kind of fun compared to going child-free.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Exactly. We had my little toddler niece as the flower girl at our child-free wedding, but it was local, so her grandma (on the other side of the family was able to grab her for the ceremony. This scenario is totally ridiculous!",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Plot twist: the reception is going to be an orgy.",
              "id": 37,
              "comments": [
                {
                  "score": 3,
                  "content": "I remember that post. Yikes!",
                  "id": 38,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Most of the ones I’ve been to have been child free because they don’t want them running, wild all over the reception and knocking things over. Because, you know, parents don’t parent sometimes especially if alcohol is involved.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Sometimes it is about the insurance or about the price or about the legal issues with alcohol license when children are there. I was told, child free receptions are lot of cheaper. But i agree, this is TARFU to make child-demanding wedding and child free reception, this with the topping of destination wedding.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I could understand if it was local. They could go to the ceremony then home for reception. I did this as a kid. Actually I even did it when we went to the family in another province but that was their home and my mom was from there so we went to one of my cousin’s house and the big cousin babysat us. I also did it locally with my daughter. But a destination place? This is rude. And makes no sense. OP is Nta at all.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 322,
          "content": "As I have told many of my friends regarding this subject \"you have every right to have the exact wedding you want- and your guests have every right to tell you 'no' and not attend. So you will get the wedding you want but be aware that there are costs\". Particularly when family is invited to the wedding and family is who watches your kids.\n\nInviting the kids, using them as props, and then dismissing them and OP's wife after they're no longer useful for pictures is pretty fucked up though, especially since it's your niece and nephew.",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 205,
          "content": "Local children are better for the environment anyway. It's greener",
          "id": 43,
          "comments": [
            {
              "score": 66,
              "content": "Local children, in season.",
              "id": 44,
              "comments": [
                {
                  "score": 29,
                  "content": "Free range, too. No steroid jacked, hormone doped, caged kids.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Organic, and heirloom breed, obviously.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 129,
          "content": "Totally agree. Want a child-free wedding? Fine. Adhere to these simple rules:\n\n1) your wedding should not be a wedding that includes children in the ceremony.\n\n2) you have to accept that some parents will have to pull out because of logistics, and just be ok with that\n\nNTA OP",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 125,
          "content": "It is very much a calculated move to keep SIL from the reception. They only want OP, but want to inconvenience his wife and kids by making them drive 7 hours and then hole up in a cabin by themselves except for the command (demand?) performance. That's why they set you up by asking the kids first. They are trying to blackmail you into leaving your family alone during the reception. She's being a bully and I wouldn't drive 5 feet to attend her wedding/revenge extravaganza. NTA.",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "NTA\n\nOP Kudos to you for standing up for your wife and children. You rock.\n\nI find that people are very consistent with their behaviour traits.  I have a hard time believing that your sister was kind and considerate to you before she was planning her wedding and us only now being a d*ck. What is more believable is that she has had her whims indulged throughout her life, enabled by your mum.\n\nYou didn’t state who is paying the cost of your sisters dream wedding. Even if the costs were covered, her demands are still unreasonable. If you’re paying the travel and accommodation costs, then the question is ‘what planet is your sister orbiting’\n\nIt’s your sisters dream wedding, not yours. Personally I’d take my wife and children and have a nice weekend away at a different location, far far away.",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "And that enormous jack*** has won the 'no best man' prize. Play stupid games will stupid prizes.",
          "id": 50,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "Brilliant",
          "id": 51,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Besides, every wedding I’ve ever been to, if there are little kids as flower girl and ring bearer, everyone wants to talk to them at the reception and dawn over them and tell them how great they were and how lovely they looked, etc.. If they weren’t there, everyone would be constantly asking where they went.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I bet you could do that too! Hire some ransom’s kids to be the ring bearer and flower girl. I wouldn’t be surprised!\n\nAlso… NTA!",
          "id": 53,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6576,
      "content": ">She’s not being treated like a guest but as the babysitter for the ring bearer and the flower girl.\n\nYou are an *awesome* husband. I like where this is headed. \n\nWhen it comes to Mr. Asshole and Mrs. Asshole-to-Be, they want to bestow the honor of making you their best man, but unfortunately that “honor” comes at a hefty price. In order to fulfill your duties, you’ll have to alienate your family for the reception, so of course, it’s totally reasonable and absolutely 100% expected of you to tell your wife and kids to go screw themselves while you’re living it up at their reception.\n\nTotally sarcasm btw.\n\nYou asked for compromises, and they told you no. You even asked to *leave* after the ceremony- they said no. They left you with *no options* but to tell them, “Congratulations. You are officially shit out of luck.”\n\nIf this was a test to prove to your sister and her fiancé who your loyalty was with, you passed. You showed them that your family comes first and you won’t be throwing them to the wolves while you cower to the pack.\n\nCongratulations and a toast to **Mr. and Mrs. Asshole**. May they have a lonely and miserable future ahead of both of them.\n\n**NTA.**",
      "id": 54,
      "comments": [
        {
          "score": 755,
          "content": "Damn you're a great writer. I thoroughly enjoyed your comment.",
          "id": 55,
          "comments": [
            {
              "score": 177,
              "content": "Thank you! 😊🍾🥂",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yes! I love this!",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 423,
          "content": "Let me take a break from grading math and statistics finals to give you an A+ on your very well worded answer to this years essay question 🤣 seriously though, I wish I had students who could write a conclusion like you!",
          "id": 58,
          "comments": [
            {
              "score": 127,
              "content": "Thanks so much! I really appreciate that, this means a lot! [I’m a very, very proud smartass right now lol] 😁",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 271,
          "content": "If Mr. & Mrs. asshole ever have kids, they are going to be the first entitled spawners to bitch and moan about anything child free.",
          "id": 60,
          "comments": [
            {
              "score": 105,
              "content": "Sounds like my Sil, who had her wedding at an adults only resort in Mexico when another Sil and I had one year olds, but now takes her kids everywhere and bristles at any suggestion that they stay at home with their dad.",
              "id": 61,
              "comments": [
                {
                  "score": 37,
                  "content": "There's no one as sure of their parenting skills as someone who hasn't had children yet.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Very wise and true words. 🏆👍👏👏👏",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "OMG! That was me when I was young and newly engaged!  I always loved kids and wanted to have a family.\n\nOne day my fiance and I were shopping  and there was a small child crying and carrying on. I muttered to my fiance that someone 'should shut that kid up.'\n\nFast forward 5 years -- there's me leaving the mall with a screaming 2 year old under my arm! \n\nI've always said you eat a lot of crow when you become a parent!",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Please tell me you all remind her of this every so often.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 163,
          "content": "This! Also how the bride expects her SIL to not attend the reception with you is incredibly rude. Why would does she think inviting a married couple but insisting one spouse hides in a cabin through the reception is socially acceptable?!?!?!  I think you need to ask all her flying monkeys this in a group text..... then block them all! Go on a nice vacation with your children & wife instead of the wedding!",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 81,
          "content": "Can you give the speech at my wedding? This was glorious",
          "id": 67,
          "comments": [
            {
              "score": 31,
              "content": "Absolutely. Sign me up! Lol",
              "id": 68,
              "comments": [
                {
                  "score": 23,
                  "content": "But don't bring your kids to the reception,  um 'kay?",
                  "id": 69,
                  "comments": [
                    {
                      "score": 25,
                      "content": "*whispers*\n\n*Hey, between me and you, if Mr. & Mrs. Asshole are invited, I’m **definitely** bringing my kids.*",
                      "id": 70,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "My fiancé wants to know if you'll write his vows for him.\n\nOn a completely unrelated note, I let the dog have my fiancé's spot on the bed.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Lol! I’d love to. My husband and I wrote ours for each other, and I cried like a baby when I read mine. We still have ours in a wedding box we keep in our closet.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "This was awesome.",
          "id": 73,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Have a few poor man's gold\n🏅🏅🏅🏅🏅",
          "id": 74,
          "comments": [
            {
              "score": 8,
              "content": "Why, thank you! 🙏🏼",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "\\*dings glass\\* cheers!!!",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Agree. You are an AWESOME husband and NTA at all.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "NTA. Please share this post with them. They deserve to see it.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1628,
      "content": "NTA\n\nYour kids are part of the family, not hired talent. If the bride and groom want them to perform in the ceremony (let's be honest, that's what it is) then they need to accommodate your family's needs.",
      "id": 79,
      "comments": [
        {
          "score": 148,
          "content": "She basically told OP that his kids are use and throw for the wedding. The goddess of a wife he has is willing to \"manage\" but that Mrs.Asshole to be (the name kind of stick around thanks to the top comment) doesn't even have a shred of humanity, and although i agree that this was her day but that doesn't mean that she can bitch around about OP not letting her use his kids and then dump them after the ceremony. Like what? TOTALLY NTA",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "they need to provide some sort of childcare if they expect op and his wife to jump through all of these hoops",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I'm engaged and planning a childfree wedding with my fiancee. Sister is being completely unreasonable. Either make your wedding CF or not, it's not fair to the people who are already making arrangements to be there. NTA.",
          "id": 82,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1463,
      "content": "NTA\n\nNope, nope, nope. \n\nBridezilla and groomzilla are being incredibly obtuse and rude to family.\n\nKudos to you for prioritizing your wife and kids over family pressure. \n\nHow the bleep does someone have the gall to have a destination wedding, demand kids in the ceremony but ban them from the reception?\n\nAre they going to pay for three days of 24/7 nanny service so that you and your children can be at their beck and call?",
      "id": 83,
      "comments": [
        {
          "score": 221,
          "content": "Ask everyone who's giving you a hard time now much babysitting time to put them down for",
          "id": 84,
          "comments": [
            {
              "score": 98,
              "content": "Oh and they aren't allowed to get drunk so let's hope their shift is nice and early..",
              "id": 85,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "This. Send them a link to a google sheets spreadsheet with 2 hour babysitting slots they can sign up for.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Exactly. Say if all the other guests can completely and soberly cover child care during the reception then you'll go. Otherwise you're unable to attend. NTA and you're awesome for standing up for your wife.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "You just know this couple-zilla aren’t even paying for the kids’ outfits to give the ‘gram worthy vibe they are invited for before being banished like the Cinderella family to the cabin once they turn back into regular furry not so keen to see them in the kitchen mice after the talking mice spell wears off.\n\nThis is so rude on so many levels. NTA. Insulting people is a whole thing but asking them to pay for the insult is always another ball of wax entirely.\n\nI would take the kids somewhere snowy or Christmassy that weekend instead and tell them Santa or Elsa or whoever had an even more special task and auntie said of course and make a weekend of dress up and family memories based on the four of you. Send some really glittery cards from the kids to say they miss aunt and uncle but Peppa Pig invited them so soz…\n\nI might even gift the happy couple a snow shovel to make a themed but pointed dig about it all but honestly I’m peak AH at times. And from a country with no snow :)",
          "id": 88,
          "comments": [
            {
              "score": 5,
              "content": "nailed it 🙌🏼",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "You know what this reminds me of?  Victorian stories of “Children should be seen & not heard.” How TF is OP supposed to be a part of this wedding when his wife and kids a shunted off to a distant cabin?  How will the kids feel?  JFC, bride & groom are the worst.  NTA",
          "id": 90,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1052,
      "content": "NTA. Since your sister will not bend in anyway, she has to accept that there will be no best man, no ring bearer or flower girl. She better get moving to replace your family.",
      "id": 91,
      "comments": [
        {
          "score": 121,
          "content": "sheet pen fine summer one concerned agonizing humorous kiss oil ` this message was mass deleted/edited with redact.dev `",
          "id": 92,
          "comments": [
            {
              "score": 58,
              "content": "Probably a higher rate due to short notice.",
              "id": 93,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 940,
      "content": "I think it's fine for your sister and her fiancé to have a childfree wedding, but I don't understand why they're objecting to you not bringing your children at all? They want them as part of the ceremony, but children aren't decorations or props that you can just shove in a cupboard once you're done with them. You've tried to come to a compromise and they're not listening. NTA",
      "id": 94,
      "comments": [
        {
          "score": 221,
          "content": "I hope OP mentions this: kids are not props that you can shove into a cupboard when you're done with them.",
          "id": 95,
          "comments": [
            {
              "score": 18,
              "content": "it sums up this situation so perfectly 😭😭 sounds like they just want them in the photos to paint the picture of the “fairytale”",
              "id": 96,
              "comments": [
                {
                  "score": 6,
                  "content": "Yes, and I sincerely hope bridezilla couple never have kids.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "Yes they are! They are dear little toys, not human beings. It’s perfectly fine to pop them into a cupboard for a few hours, they will find something to do in there. \n\nHonestly, I wouldn’t even do that to my cat and he loves cupboards.",
          "id": 98,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 689,
      "content": "Hold strong.  Negotiations haven’t ended.  NTA",
      "id": 99,
      "comments": [
        {
          "score": 1561,
          "content": "I think they have cause I'm not going anymore, and neither are my kids. I tried working with them for weeks and have been passed around between them or told to talk later or just been told no. This is my little sister who, I'll admit, I've spoilt for years because I used to love her the most. Unfortunately for her, I love my wife way more and there is no way I'm exposing her to my kids under these circumstances. They will go from my angels to absolute monsters. My wife despite claiming so, will not be able to handle this.",
          "id": 100,
          "comments": [
            {
              "score": 511,
              "content": "I'm glad you're putting your wife and kids first.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 408,
              "content": "Hold your head high, sir!  \n\nYou have your priorities straight: while your wife may be a people pleaser, deep down inside, you just reaffirmed and reassured her that your cherish your vows and earned some major brownie points as well.  I KNOW my wife of 12 years now (known for well over 20) would never say she wanted me to skip such an event, but she would definitely let me know how much it means to her in private--and I have done the same.  You and me, my dude, know who our real family is and who needs to be the priority.  Happy wife.  Happy life.\n\nP.S. that last part is only for normal adults who can communicate and work together--not most of the kids on their 4th+ marriage.  LOL!",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 371,
              "content": "> Unfortunately for her, I love my wife way more\n\n\nWell god damn aren’t you just a panty melter. Your wife picked good. My husband is the exact same.",
              "id": 103,
              "comments": [
                {
                  "score": 123,
                  "content": ">Well god damn aren’t you just a panty melter.\n\nI almost choked when I read this, you cheeky so and so lmao 😂😂😂",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 122,
              "content": "You are NTA OP, and thank you from this stranger for how you handled everything and stood up for your family. Not just your wife but the kids also- it’s a dick move to all 3 of them for them all to be excluded like this. \n\nIt seems like your sister and the fiancé are bending over backwards to make this inconvenient for you and to refuse all possible solutions. It is possible that sister dear is trying to pull some power stunt to have her loving brother focus back and prioritize her one last time? Maybe she’s feeling some sort of way that she’s not #1 anymore?  Like this is her one day for you to spoil her and you didn’t?",
              "id": 105,
              "comments": [
                {
                  "score": 8,
                  "content": "This is 1000% it. Total power move ATTEMPT. Nice to see it didn't work!",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "You could be on to something with this.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 77,
              "content": "Seems as if they don’t want your wife there as all the options of you leaving early we’re shot down too",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "And the husband of the year goes to u/Humble-Village-2053!",
              "id": 109,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 33,
              "content": "You’re an absolute legend.",
              "id": 110,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "You’re a great husband. Hold strong, NTA.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I wonder if your sister resents your wife for taking you away from her. Sure seems like it.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I love how you understand your wife even beyond her words. That amazing and important skill to have.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 655,
      "content": "NTA. You sound pretty cool 🙂. Don’t listen to your wife (I’m totally the sort that would agree like her but you’re right, it sounds awful), your family are being horrid and really showing they couldn’t care less for her company or her comfort and they’re wanting to use your kids like props essentially.",
      "id": 114,
      "comments": [
        {
          "score": 837,
          "content": "I mean I love her and she's a great mom, but she has trouble keeping up with them at home for more than 4-hrs without help. Now imagine kids who sat in a cramped car for 7 hours the day before, wearing uncomfortable fancy clothes for about 3 hours with restrictions so the clothes don't get dirty and then another 5 hours in a tiny cabin with unsafe items around them so even more restrictions. My kids are great but after this they will be monsters. This will be proceeded by another 7-hour cramped drive in 2 days. I'm not exposing my wife to that. I'm driving, she's the one who'll be in the backseat with the kids",
          "id": 115,
          "comments": [
            {
              "score": 460,
              "content": "As a mom, I’m cringing just reading this",
              "id": 116,
              "comments": [
                {
                  "score": 482,
                  "content": "wait till they start fighting over who's playlist we'll play in the car. I made playlists for both of them individually because we drive each kid individually often. So, I sat with them and started cycling through songs they like and made 80-90 song playlists for both. The playlists are literally almost identical. it doesn't matter whose playlist we play but no, it has to be theirs.",
                  "id": 117,
                  "comments": [
                    {
                      "score": 231,
                      "content": "You're driving, so you play Dad's playlist!",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 58,
                      "content": "the more I read from you, the more likeable you are OP! (a true rarity on AITA)  \n\n\nThe fact they didn't automatically realise the error of their ways in suggesting that your kids come at all given the long drive, unsuitability of the cabins etc is bad enough./  \n\n\nBut that they've doubled, tripled, QUADRUPPLED down on their insane and selfish idea despite you offering all manner of compromises and options is mind boggling.  \n\n\nI've never understood why one overpriced party sends otherwise sane people into a whirlpool of selfishness and bride/groomzilla insanity but this has clearly happened to your ass-sis and best-jack-ass. (Due to how sensible everything else you are saying is, I will take your word for it that they are not usually entitled and completely objectionable human beings so their being infected by wedding-itis is the only explanation).  \n\n\nPersonally I would not attend at all unless they grovel and beg at this point (and the only acceptable outcome is that you and your wife go as normal guests while the kidlets stay at home bothering grandma with their 90 song mixed playlist hahaha)  \n\n\nNTA obviously",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 57,
                      "content": "You need to look up “ reasons my son is crying “. It’s nothing but kids having meltdowns over stupid stuff. \n\nMy personal favorite is the day my daughter had a screaming temper tantrum and slammed her head on the table because I wouldn’t give her another cracker…… and she had 4 on her plate already",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Do what we did and make another combined playlist and put it on shuffle.  Put some songs for you on there too!  If more than one kid is in the car, the combined playlist is it.  \n\nAlso, NTA regarding your original post.  You’re a good husband.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "This is when you combine both playlists, add some things you and wife like that the kids hate and delete the duplicates and call it “mommy and daddy make the children suffer” playlist.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Driver chooses the music, shotgun shuts their cakehole",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 26,
              "content": "I have been the partner left to take care of the kids like this … it was a funeral, not a wedding, and it stands out as one of the most miserable experiences I’ve been through. I did it, so my wife could focus on her family, but I decided I’d never put the kids and myself in that position again (we also got stuck in a primitive cabin with spiders and no bedding and not a lot of heating).   Once we talked through it, it turns out she’d really rather have not gone (she didn’t know this uncle well) and we later ended up going NC with her family because of past emotional and physical abuse (and they’re homophobic and we’re both female lol). Anyway, NTA and you’re awesome for not letting your wife do it alone.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Yeah and what about them being upset about not being allowed to come to the party, its going to be a nightmare imo",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I've been withholding my judgment until reading this, because I didn't think you were listening to your wife.  Turns out you were, but aren't letting her do the nice thing at her own expense.  Good on you.   NTA.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Send this paragraph to anyone giving you grief about not going.",
              "id": 127,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "What you describe is what I will be living when I die and go to hell (and I say this as a mother myself because I know *exactly* what you are describing...)",
              "id": 128,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Nevermind that it's downright rude and exclusionary to force her to miss the festivities when the whole rest of the family and guests are partying",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 340,
      "content": "NTA at all\n\nThey want the children there, but then expect them to vanish when they don't need them anymore which means your wife is excluded.\n\nPeople really shouldn't be surprised when people don't want to attend their weddings when they make demands like this.\n\nI think your wife was being kind by saying that she would put up with this for your family - and you are being a great husband by not making her have to put up with this",
      "id": 130,
      "comments": [
        {
          "score": 276,
          "content": "My wife is very much a people pleaser and trying to keep the peace. I would be a hypocrite if I said I never used that against her to get out of the occasional chores of washing dishes or changing a few diapers, but this is way too far. At least I more than make up for it and unless they are gonna buy her a giant boat, this isn't happening.",
          "id": 131,
          "comments": [
            {
              "score": 55,
              "content": "A boat is a boat but the mystery box could be anything, it could even be a boat",
              "id": 132,
              "comments": [
                {
                  "score": 7,
                  "content": "You know how much we’ve always wanted one of those!",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 203,
      "content": "NTA.  Yeah, the bride and groom need to realize your kids are not props.  If their presence will only be tolerated for the length of the ceremony, *and* no one’s willing to help you out with childcare so you and your wife can attend the reception, then this wedding’s just going to have to do without a flower girl and ring bearer.  And if *that’s* not an option for them, either, then you *should* get yourself out of this best man deal before they force any more ridiculous demands on you.",
      "id": 134,
      "comments": [],
      "relation": "Support"
    }
  ]
}