{
  "post content": "I am Indian , so is my friend Rohan. Both living in North America and have known each other for fifteen years.  \nI wrote an article on how I been trying to stay active during COVID. I sent him the link. I sent the link to few other friends too. Just link. Nothing else. He responded “lame”.  \nI said, “way to support your friend”. He said something on the lines of “friend is the one that is honest with you”.  \nI responded “go fuck yourself”.  \n**I am now left wondering if I acted or reacted disproportionately? <-- This is the action I need you to assess and tell me if I was being an a\\*\\*hole for saying this?**   \nIf it were a random article written by a stranger, that response might be okay. But he knew that I wrote that. If he didn’t find it great writing, he could have shared feedback instead of being so cold. Or if the topic was not of his interest, he could have said that.  \nIronically , he was severely offended by my words in the above exchange. There was period of silence for several weeks after this.  \nPS: *mention of nationality was important to provide cultural context because some people tell me that I have become too white or snowflake for taking offense on such little things .*",
  "id": 1,
  "comments": [
    {
      "score": 5669,
      "content": "“Lame” isn’t helpful or constructive in any way. If he feels that was “honesty”and not simply rudeness for the sake of being rude, then maybe he’s not the friend you think he is. \n\nNTA",
      "id": 2,
      "comments": [
        {
          "score": 813,
          "content": "I am an artist. Whenever I ask someone their thoughts on something I have created, the worst 2 replys I can receive are \"good\" & \"bad\". \n\nIt's an opinion, but it doesn't help me in the slightest, either way, why is it good or bad....",
          "id": 3,
          "comments": [
            {
              "score": 343,
              "content": "It's not really their fault, they usually don't have the tools to offer substantive critique and don't know if you want actual criticism or just validation. You probably use electronics all day but if I asked you to critique my circuit design you wouldn't have anything to say either.",
              "id": 4,
              "comments": [
                {
                  "score": 67,
                  "content": "It depends on the person too. I've gotten into digital art as a hobby a few years ago and made a lot of friends who are veteran and beginner digital artists, and there's a lot of variance in between who can and can't handle certain criticisms. Some people respond well to criticism, others get very temperamental even if you give constructive criticism. Some people want to improve and want educated criticisms and get upset with hearing \"that looks cool\" from the same person over and over, some are kind of shy and sulk if you aren't as enthusiastic about their work as much as they are. My 2 friends who got me into digital art are polar opposites and one prefers brutally honest criticism so she doesn't even ask close friends for opinions because she assumes all of them will just coddle her no matter what she draws, and the other prefers only showing art to her friends because she's quite shy about posting and being judged publicly.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Okay but we're talking a friend here. You should have some idea how a friend would respond to criticism and whether they want it in the first place. Otherwise you weren't really friends in the first place.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Agreed to an extent. But I also wouldn't say good or bad.  If i did, I would have a reasoning: The sodering looks clean or is a mess. You're right. I have a limited clue about a circuit design other than a computers mother board. So, if it were designed for something else, I would not say good or bad. I would say I don't know what makes a good circuit design. How could I say yes or no, good or bad?\n\nBut everyone has an opinion if they like the looks of something. I like the subject matter (a dog in the image), I hate the expression on that person, I like those two colors together.\n\nIf I had a technical issue, I could ask an artist. Non artists are typically my clientele, however. Like OP, when he asked his friend, and his friend said it's \"lame.\" Well, great, but he is still in the same boat before he asked, not knowing why it is lame. Maybe his friend just wanted to be rude, but I'm sure he knows why he thinks it's lame and could have said so. Doing so, his friend might not have felt so bad about his friends remark.",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I could definitely comment on the aesthetics of the design even if I didn't understand what it was for.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I'd honestly answer \"I have absolutely no idea what any of it means, but it's really awesome that you did that and I'm proud of you for being able to do it\". And in the case of OP's article, I think that it seems to be a topic \"common\" enough for one to offer some perspective even if not in the field. I know absolutely nothing about fitness, but I'd still be able to give some criticism on it, and you can always try to gove feedback on something you might now, even of not dorectly related to the topic (like grammar, structuring, etc). \n\nAnyway, I thibk that friends should support friends and, if you can't even be a$$ed to read it you can at least give a \"hey, I'm really busy right now, but I'm proud of you and will check it out later\".",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "But he was deliberately rude and insulting. No friend at all. GFU is being honest with him, ha ha.",
                  "id": 10,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": -5,
                  "content": "Well, I mean, if they aren't in a position to critique someone's work well, they shouldn't critique it in the first place.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 51,
                      "content": "Ah, ok. So the next time an artist friend of mine shows me, someone without much artistic talent, some of their work, my reply should be, “This is certainly work. I am however not in a position to call your work good, as I am not in a position to critique your work well.” \n\nThanks for letting me know, Jude! How embarrassing that I’ve been complimenting friends on their work for years.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Ever had the 'That's nice dear' kiss of death?",
              "id": 13,
              "comments": [
                {
                  "score": 1,
                  "content": "Right up there with, “Bless your heart.” (frequently heard in Southern USA).",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "For what it’s worth, I always get anxious when an artist asks me of their opinion because you all know your craft 10x better than I ever will. What could I possible tell you about this song or picture that you probably haven’t already spent much more time agonizing over the details about than I even did trying to articulate my response.\n\nSo I usually just try to throw out some key word I know works in the context and say that I really like that aspect of it, and then try to get out of the conversation as quickly as possible.\n\nAsk me to read your screenplay? I’m down. Ask me if your painting is good? I have absolutely no idea what makes a good painting or even how to describe about one that I like",
              "id": 15,
              "comments": [
                {
                  "score": 20,
                  "content": "Here’s the thing though, the hours we spend pouring over an artwork also can make us blind to it, so fresh receivers are important.  I can’t tell you how many times I’ve ended up laughing with some of my visual artist friends because of accidental genitalia references or other things they just didn’t see or think about.  We know not everyone consuming our work is an expert and we’re not looking for that.   \n  \nBut if you find yourself in that position in the future, you could always say something like,”well I’m not really familiar with art terms, so I can’t comment on that, but here’s what looking at your painting makes me think of/feel; hopefully my response will help you determine whether you were successful there.”  \n  \nI personally like knowing my art is effective at communicating with others.  Even if I’m just making “something pretty”, it’s not just about that- it’s about connecting someone with a moment of brightness and delighted surprise at the discovery.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "As an artist, if I ask for your opinion on something (and know you haven't studied the arts). Usually, it's because you are my target audience. \n\nWould you hang this painting on your wall? Would you pay for this painting?\n\nBut you might be my only human contact in a few days, haha. If you do have someone (an artist) asking for your opinion more than once. More than likley that person values your viewpoint. You don't have to humor me with what sounds like a proper \"artistic\" response. Because some artists spend hours looking at the same works. It's good to have fresh eyes looking in some cases. Where another artist might see the same technical mistakes, you having a different background might spot something I would have never seen.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 6,
                      "content": "“Would you hang it on your wall?” Is an absolutely valid question I think. I paint and I love going to art exhibitions (even just by local artists). My friends and family are not art experts by any means but we often discuss our favourite paintings at each exhibit by saying things like “it reminds me of a holiday we took” or “it makes me think of a summer afternoon and feels calming”. If it’s a painting we keep coming back to look at while at the exhibition it stands a good chance of us buying it!",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "As someone who writes in his free time, let me tell you what I want to know most when I let someone read a draft: how they felt reading it. And I think that's probably true of most forms of art. I don't know that I want to speak for everyone, but I suspect that's what most artists set out to do. They have a thought or an image or a feeling or a story they want to share with the world.\n\nBut how you felt doesn't have to be in technical terms. For writing, it's simple. Did you feel sad? Did you feel happy? Did you feel anxious? Were you excited to keep turning the page? Did some event in the story affect you deeply? For music, did it make you want to dance? Drive really fast? Did you feel like you had to keep listening to it over and over? You could look at a painting and feel awe, pain, a sense of beauty, whatever.\n\nFor me this serves a couple purposes. If they feel what I wanted them to feel, sure, it feels good. It means on some level I succeeded. If they feel something different I didn't intend or have a reaction I didn't expect, that gives me the chance to be reflective about it. Do I like that someone felt that way? Do I need to change something, or alter what I'm doing in the future to try to avoid producing that feeling? Is it an added bonus to what I intended? Is it getting in the way of what I intended? Etc.\n\nDon't be so hard on yourself just because you're not an expert in something. Sure, maybe you don't know enough to critique someone's brush work, but I doubt that's what they're after when they ask what you think. If someone asks you what you think of something they made, they're probably sharing something that is personal and meaningful to them, and they just want to gauge how you experienced it.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I don't understand this at all.  I have no art training. I'm still fully capable of telling if I like something or not and examining why. I was reading an article about modern opinions on Renoir being sexist. It was interesting. \n\nI googled his art, and there's one painting he did of a young girl. To me, it looks like she has kind of a blank stare. I'm imagining this girl bored to death during the sitting for this painting, and Renoir is annoyed at having to paint this instead of naked chicks.\n\nI have no idea the actual story behind the painting. I liked it because this is what it put in my head, and it made me laugh. Everytime I see it now I get a little chuckle. \n\nIf Renoir asked me what I thought about it, I'd say I liked it because this is what went on in my head, and it made me happy.",
                  "id": 20,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "\"Wow, it's really good!\"\n\nUh, thanks, but can you elaborate?\n\n\"I don't know, it's just good!\"",
              "id": 21,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Art is subjective. It either appeals or doesn't and what appeals to one might not to another. Writing is much less so, especially non fiction and an article as described would be informative or lacking, factual or not, insightful or not, etc.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I honestly don't know what to say other than \"This is amazing!\", because I don't know how to critique art. My sister is an artist and she sends me work my responses range from 'oooh! I like it!' to 'I love it!', which is true. But also not very helpful to her I imagine. XD\n\nAsk me to critique a written piece of work however, and I'm much more helpful.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I’m a hobby fiction writer and I deliberately tell people when I ask them to read something I wrote that I only want to know if the story captures their interest and flows well, not to fix my grammar etc. I can hire an editor for that stuff",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "My wife is an artist, I am not equipped to determined to say what exactly is wrong with the lighting or why that angle feels off. I’m not sure I can answer why it doesn’t invoke the kind of response she’s looking for. \n\nWhen I do like it, I have a hard time describing why. It just looks… good.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I feel like both of those mean “bad”/ not interested in critiquing your art.",
              "id": 26,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "I agree 100% its pretty shitty.\n\nI had a guy at work and we were pretty good work friends.  He sent me a rap song he wrote and recorded asking for feedback.\n\nAfter listening to it I told him I am no fan of rap but the song was well polished and musically solid.  If I just told him I am not into rap that would be a dick move.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 167,
          "content": "While you're right that just saying \"lame\" doesn't provide feedback, all OP did was send a link with no context...\n\nOP, idk if I'd say yta, but don't expect lengthy critique and feedback from friends if the only thing you do is send a link to something and don't even bother saying \"what do you think?\"\n\nTbh, idk about Indian culture, but I can say if I send a friend a random link, there's a 50/50 chance they don't even open it.  Ppl are busy after all and half the time it's some meme, tiktok, or interesting news article I found.  If I don't add any context they're likely to think it's not super important.",
          "id": 28,
          "comments": [
            {
              "score": 123,
              "content": "This. Also am I the only one who read this and then thought to myself like \"hmmmmm did OP's friend even actually realize it was written by OP?\" Because personally I couldn't tell you who wrote most of the articles I see online because thats not what I look for unless I know for a fact that I should be looking for it. \n\nMy boyfriend will sometimes tell me things I send him are lame if he just is like 'nah man I think that reddit post is dumb I don't wanna read it\" so I mean maybe op's friend just straight up didn't even realize it was written by op especially without any context lol.",
              "id": 29,
              "comments": [
                {
                  "score": 23,
                  "content": "But then there wouldn't be a double down on it after the \"way to support a friend\", at most a confused \"which friend, wdym?\"",
                  "id": 30,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Not necessarily.\n\nFriend could have just thought that the 'support' meant OP was going to be using the article as advice and start following the ways to stay active.",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "I think there's a good possibility that op's friend was being sarcastic and thought they were bantering and so he was caught off guard when op told him to go fuck himself. This is likely a case of tone getting lost in translation via text",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "I got really embarrassed one time because I read an article my friend posted and responded like \"The author uses some word choices that are big red flags for me but overall he made some good points, not to mention that blah blah,\" only to realize later that the author was in fact the friend who posted it. Oops.",
              "id": 33,
              "comments": [
                {
                  "score": 14,
                  "content": "Off topic but my favorite variation of this is when people try to say my avatar is some Disney cartoon so who cares what I think and I get to go \"I actually drew that - you really think it's Disney quality?\"",
                  "id": 34,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "I mean, at least he got your honest, calculated opinion on it because of that, and not just validation  \nIf anything that's a good thing lol",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Much better more constructive feedback then they would have probably gotten…",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "i feel like online, people either assume you're the one who made a thing or they assume you're posting something by someone else. It's kind of interesting to see which way someone goes.\n\nIt can be one of the best ways to get unfiltered feedback, though. At one point i was getting into photo editing and i was trying to add some contrast to make the skin pop a little bit, as it was sorta dark and murky. One of my friends saw it and said \"i don't know why they brightened it. It looks like someone's boomer dad learning Photoshop,\" And i was like \"ouch. but okay!\" a bit brutal, perhaps, but good and useful feedback!",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "It actually pisses me off when people send a link with nothing else said or a friend request without even speaking to me first. I'm more likely to block that person more than anything else.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "the least he could have done is say congratulations, he doesn't need to critique or sing praises",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Also, \n\n> I wrote an article on how I been trying to stay active during COVID.\n\nI'd feel a bit resentful if I thought I was expected to read and provide constructive criticism of someone's brag-blog, even if they were a friend. It's great that OP tried to stay active, but I don't need to hear about it and neither does their friend.",
              "id": 40,
              "comments": [
                {
                  "score": 4,
                  "content": "Yeah. Sometimes that’s just not my thing, especially if it’s q about a topic i don’t fin interesting. \n\nI’m feeling this isn’t the first one they’ve sent either.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Thats a really weird take, how is he bragging? If hes not supposed to post about it and his friends shouldnt have to hear about it then why does anyone ever say anything? Why dont we all just keep everything to ourselves? If you cant listen to a freind talk about what they've been doing lately how are you friends?",
                  "id": 42,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Talking to friends about stuff you've done is fine! Maybe it's just me, but writing a blog about stuff you've done, and then expecting critique on it has a different vibe than just catching up in person.\n\nThat said, without actually reading the blogpost myself, I'm for sure making a bunch of assumptions about it. It could be that it focuses on something more interesting than just that OP stayed active during COVID, or he draws a life lesson or some other kinda point from his experiences. Or maybe it has a bunch of nice pictures throughout.\n\nJust going by the way OP described it and their friend's reaction (which, I think ESH - it would've been kinder not to say anything at all!), it does sound like the article could've been very dry and a bit self-absorbed. I can't quite put into words the difference between chatting about things you've done informally in person, and linking an article listing your recent achievements to your friends and expecting them to take time out of their day to read it in silence, but I do still feel like they're not the same thing, somehow.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Still OP should have been aware that it is always possible that people do not like what someone wrote. Yes, \"lame\" is neither nice nor helpfull, but maybe the friend did not even notice it was OPs Text. OPs answer wasn't helpfull either as it  did not say at all if he wanted a more detailed answer or if he was proud of his work and thus disappointed for not being praised enough.\n\n\nWhy did he not stay professional and ask back like \"that was not what I expected, I would appreciate it if you gave me more input\"? If this was what he wanted the best way would have been to call the friend about it, as writing down a more detailed critique takes a lot of time compared to talking. \n\nI leen towards  YTA here, for to me it seems OP was diaappoinred and lashed out on a friend that probably did not even understand why.",
          "id": 44,
          "comments": [
            {
              "score": 5,
              "content": "Maybe OP wrote a legitimately lame article (like super misogynistic or something).",
              "id": 45,
              "comments": [
                {
                  "score": 3,
                  "content": "Yeah, exactly. If he wants to improve he really should be professional about it.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "So are your friends required by law to provide you with useful feedback or you tell them to fuck off?",
          "id": 47,
          "comments": [
            {
              "score": 3,
              "content": "lol right? Little harsh",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Ableist as fuck too\n\nNTA",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "It’s the “It’s not bad” of the cooking experience.",
          "id": 50,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "[removed]",
          "id": 51,
          "comments": [
            {
              "score": 1,
              "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
              "id": 52,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "NTA, it's odd that your friend can dish out \"honesty\" but not digest it when it's given back to him.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "> “Lame” isn’t helpful or constructive in any way.\n\nNeither is sending a bare link with zero explanation or context.  So, at best, this is NAH.",
          "id": 54,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -811,
          "content": "[removed]",
          "id": 55,
          "comments": [
            {
              "score": 362,
              "content": "[removed]",
              "id": 56,
              "comments": [
                {
                  "score": -361,
                  "content": "[removed]",
                  "id": 57,
                  "comments": [
                    {
                      "score": 183,
                      "content": "Old enough to not get upset if my friend sent me an article without asking permission first. Trying to insinuate someone must be too young to have judgement just because they disagree with you isn't exactly the height of maturity btw.\n\nIf he's not obligated to say anything nice then neither is OP. You can't have it both ways. Insulting something your friend has put work into is a shit thing to do.",
                      "id": 58,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 71,
                      "content": "Usually, friends like to support one another. Showing things you made to your friends is not abnormal.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 57,
                      "content": "You don't have many or any real friends do you? Otherwise this wouldn't seem abnormal",
                      "id": 60,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 42,
                      "content": "Just so I'm clear, the reader has a right to be an asshole about an article, but the OP doesn't have a right to be an asshole back. Am I getting gist of your argument right?",
                      "id": 61,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 29,
                      "content": "Sure he's not obligated to do anything but...friends do things for each other and support each other?",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "[removed]",
                      "id": 63,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": ">He’s not obligated to say anything nice. \n\nWell, neither was OP. Why are you holding 2 different standards here? \n\nAn insult was thrown, and 1 returned.  Sounds like you don't like accountability or being called out for behaviors. \n\nOP in NOT the asshole..\nBut it's smells like their are some in this thread.",
                      "id": 64,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "How the fuck do you exactly view being \"friends\" with someone?",
                      "id": 65,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "They’re friends? He wasn’t “obligated” to say anything nice, but he didn’t have to be inflammatory about it either. If he didn’t like it he could have said something constructive, or if he didn’t feel like doing that much he could’ve said nothing at all.",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "100% None of your friends like you.",
                      "id": 67,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 62,
              "content": "It's absolutely appropriate to tell people off when they're acting like asses",
              "id": 68,
              "comments": [
                {
                  "score": -20,
                  "content": "That’s not telling someone off. That is a straight up tantrum.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Grow up. If someone wants to act like trash they can get talked to like it, they get what they get",
                      "id": 70,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "How do tell social media that you refuse any kind of accountability for your words and actions ----and that you think those that provoke people with ignorance should NEVER have any accountability.... the damage is here is blantant.",
                      "id": 71,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "How is it a tantrum?\n\nWhat do you think a tantrum consists of?",
                      "id": 72,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "OP didn't lash out, he was just being honest with his friend! Oh wait, you think that it's possible to be honest *and* rude? Yeah I thought so.\n\n>unsolicited article\n\nYou sound like you're from twitter",
              "id": 73,
              "comments": [
                {
                  "score": 28,
                  "content": "\"unsolicited article\" is taking me out, like sharing your achievements and accomplishments with friends is only okay if you get explicit written permission, signed and dated.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Not that it's not okay but like it's a favor so the 'friend' who responded lame shouldn't be expected to automatically do a big effort. \n\nI don't know why you guys don't get that.",
                      "id": 75,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "Telling someone to GFY is definitely lashing out. But I agree that he was being honest. He was candidly admitting that he has an entitled mindset and is emotionally immature and cannot handle the slightest bit of criticism.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Why does it feel like we found the so-called ‘friend’…? 🤔",
              "id": 77,
              "comments": [
                {
                  "score": 2,
                  "content": "[removed]",
                  "id": 78,
                  "comments": [
                    {
                      "score": 1,
                      "content": "And people HAVE used that snarky reply before, just more successfully and with better grammar",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "There’s giving an opinion and then there’s shutting someone down with an insult. “Lame” is an insult. OPs response was at the same level. Friends generally don’t give each other unsolicited constructive criticism, but even then, “lame” isn’t constructive. Had OP said “be honest, what do you think of this article,” a friend-level response would be something along the lines of “I like how you concluded it but the middle felt like it rambled on a bit,” not “lame.”",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Are you the friend?",
              "id": 81,
              "comments": [
                {
                  "score": 2,
                  "content": "Are you the OP?",
                  "id": 82,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Your friend group must LOVE you.",
              "id": 83,
              "comments": [
                {
                  "score": 1,
                  "content": "Irrelevant.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Yeah you're probably right, you don't have any real friends that find any value in the relationship. Sorry to hear bud, I'm sure you will come right and fix everything about you.",
                      "id": 85,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1656,
      "content": "NTA. Just tell him you were being \"honest\" with him since he seems to value that.",
      "id": 86,
      "comments": [
        {
          "score": 247,
          "content": "Also, if anyone is telling you that you are being 'too white' or a 'snowflake', they pretty much are the AH. Both are attempts to demean a person and invalidate their feelings.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "OP, is it possible your friend has not been active since that time and thought your text was targeted? I don’t support the response at *all*, but based on his second response that seems possible. \n\nThat he wasn’t saying he’s a good friend for being honest, but instead thinks you should’ve been honest with HIM? It’s a bit left field but left me wondering.",
          "id": 88,
          "comments": [
            {
              "score": 1,
              "content": "Should’ve been honest with him about what?",
              "id": 89,
              "comments": [
                {
                  "score": 7,
                  "content": "Oh, I was saying that in the context of his “friend” being offended that OP didn’t tell him that he wasn’t being active and that had an impact on the way he looks, if that makes sense.",
                  "id": 90,
                  "comments": [
                    {
                      "score": -3,
                      "content": "Wasn’t being active? The way he looks? \n\nThat makes no sense to me.",
                      "id": 91,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "You beat me to it!",
          "id": 92,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 653,
      "content": "NTA, saying something is lame is vague and not at all helpful in this context. Your friend sucks for his unhelpful critique.",
      "id": 93,
      "comments": [
        {
          "score": 30,
          "content": "Seriously. It kind of seems like he didn’t actually read it or did and didn’t really care.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "But OP immediately responded with FU! Somewhere between lame, FU and sending links without proper introductions is the communication needed among friends.",
          "id": 95,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "He never asked for criticism or helpful context. He simply sent a link with zero additional info then expected his friend to open it figure out he wrote it then FUCKING grade it for him like he's a school teacher or something? He's lucky the friend opened the article at all I wouldn't have, I'm not clicking some link, just random link no other information nah not going to happen.",
          "id": 96,
          "comments": [
            {
              "score": 24,
              "content": "This right here is why some folks are friendless",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 346,
      "content": "Nta - it's highly inappropriate to just say \"lame\" to something your friend worked on.",
      "id": 98,
      "comments": [
        {
          "score": 5,
          "content": "OP never told his friend he was working on it though. He just randomly sends him a link and expects what? He didn’t ask for critique or his thoughts. OP did like no sort of communicating but gets upset when his friend is just as vague as he is.",
          "id": 99,
          "comments": [
            {
              "score": 6,
              "content": "Did you read the post. \"He knew I wrote that.\"",
              "id": 100,
              "comments": [
                {
                  "score": 1,
                  "content": "is OP making an assumption there or did they explicitly tell the friend prior to the exchange they wrote it? Was there maybe an author section at the top of the article with a photo and OP \"reasonably\" assumed the friend would have seen that, forgetting that a large chunk of people just glaze past the byline and go straight into the article?",
                  "id": 101,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -2,
          "content": "Unless it's a painting of FDR.",
          "id": 102,
          "comments": [
            {
              "score": 1,
              "content": "Classic",
              "id": 103,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 280,
      "content": "He definitely started this and was an AH first. You did kind of over-escalate. It would've made more sense for you to say what you said in this post, \"If it were a random article written by a stranger, that response might be okay. But he knew that I wrote that. If he didn’t find it great writing, he could have shared feedback instead of being so cold. Or if the topic was not of his interest, he could have said that.\"\n\nI don't care what culture you're from, your friend was rude, dismissive, and offensive. You're right to be offended. The only thing is I think \"Go f\\*ck yourself\" was over the top. So soft ESH, but he is the main AH here.",
      "id": 104,
      "comments": [
        {
          "score": 35,
          "content": "Yeah, this is the same reason I would go ESH.",
          "id": 105,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 30,
          "content": "He didn’t even ask for feedback tho just sent a link and nothing else",
          "id": 106,
          "comments": [
            {
              "score": 6,
              "content": "I didn't even clock that. That's a great observation.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 179,
      "content": "INFO did you clarify that you a wrote it, or was your name in big bolded letters at the top? You said you just sent a link, this seems like a regular response to an random article a friend sends. Also what does you both being Indian have to with this",
      "id": 108,
      "comments": [
        {
          "score": 10,
          "content": "This. If all they sent was a link to an article, I totally wouldn't have looked at the author.",
          "id": 109,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 105,
      "content": "NTA - I think your response was a bit over the top, except it gets validated by him stating \"friend is the one that is honest with you\" because that is your honest, unfiltered opinion.",
      "id": 110,
      "comments": [
        {
          "score": 13,
          "content": "People who \"tell it like it is\" sure don't like being told how it is, do they?",
          "id": 111,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 104,
      "content": "INFO: Did you ask for his opinion? And did he know you wrote it?",
      "id": 112,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 98,
      "content": "INFO: How are you sure that he knew you were the writer? You said you sent a link, and only the link.",
      "id": 113,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 69,
      "content": "You just sent the link. You didn't ask for feedback. So how should he know that that's what you wanted? \n\nAlso, why is culture important in your post? Is it normal in your culture to give elaborate feedback without having to ask for it?\n\nIf not:\n\nPlay stupid games, win stupid prizes.\n\nYTA",
      "id": 114,
      "comments": [
        {
          "score": -14,
          "content": ">You just sent the link. You didn't ask for feedback. So how should he know that that's what you wanted? \n\nIf your friend sends you a link to an article they've written, and you can't infer on your own that they want you to read it and tell them what you thought, then you are undoubtedly on the spectrum.",
          "id": 115,
          "comments": [
            {
              "score": 15,
              "content": "Are we sure the friend even realized it was written by OP? If I got a random link without context, I might click it and skim what it's about. If it doesn't seem interesting, I won't read it.",
              "id": 116,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "I would not open a message that had only a URL, sent to me by someone without context. Even if it was my best friend, if the message had no words and only a link, then depending on the message medium, I might think they'd been hacked and the link is some kind of phish bait, and just ignore it. They'll bring it up later if it was 1) actually them and 2) it was important.\n\nWhy?\nBecause it's rude as **** and friends don't do that. OP wanted feedback or was proud of their article, yet couldn't use a dozen words to talk about it to their friend when asking them to take time to read it? I even roll my eyes when a person has clearly copy-pasted a message along with some content they're trying to get some support on. OP is supposed to be a friend, not a cold caller.\n\n(ESH. Friend moreso, since he could have just said nothing. But OP started low-key AH then escalated.)",
              "id": 117,
              "comments": [
                {
                  "score": -5,
                  "content": "[removed]",
                  "id": 118,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Not everyone who disagrees with you is autistic, my friend. Be better.\n\nHave a good day.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
                      "id": 120,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}