{
  "post content": "Throwaway because friends on Reddit.  My (27F) husband (35M) have been married for 2 years.  Until the last year, I would have said that things were great. My husband has had an ADHD diagnosis since he was a child and has always done well with medication.  He took meds through school and has managed to hold down a good job with only some mild symptoms.\n\nAbout 6 months after we got married, I noticed that he started to change.  He was a lot more forgetful, irritable, and he started doing a lot of impulsive spending.  I’m a medical resident and knowing he had ADHD, I asked if his meds were giving him trouble. He said that he had stopped taking them.  I tried to reason with him, but he had been reading some blogs and become convinced he didn’t needs meds.  He said that ADHD was his “superpower” and that I should love him the way he is or not at all.\n\nThings have gotten worse quickly over the last year.  He used to help out with chores and now can’t even load the dishwasher without losing focus and wandering off.  We keep our money separate and even with a good amount of expendable income, he’s gone through a lot of his savings and has trouble paying his section of the bills.  He explodes verbally sometimes and has alienated one of his best college friends over a silly argument in a way that’s not likely to be forgiven.  He won’t acknowledge any of this is happening and gets angry when I point out that I’ve been covering the lion’s share of the expenses for the last four months and trying to take care of the entire house while also doing my residency.\n\nI reached the end of my tether when he asked me for money to cover his car payment for the third time.  I told him that I would keep the utilities on, but his car, insurance, and other expenses were on him and there would be no more handouts.  I also told him that I couldn’t keep burning the candle at both ends, so his laundry and meals were now on him to prepare.  This lasted for less than a week before he started asking for help with his car again.  I told him the only condition on which I would help would be if he started back on some treatment for his ADHD.  Not necessarily the same meds if he didn’t like them, but something, because this was unbearable.\n\nWe had a fight about it and he told me that I should help him because he has ADHD so he can’t help it and needs support. I told him that he had spent the last year telling me that ADHD is his superpower, so he can superpower his way into regular car payments and laundry then without my help or get treatment and receive help. He called me an ableist b!tch and stomped off.\n\nI talked to a psych friend who says that the quip might have been a little unkind but the boundaries are reasonable.  My SIL is angry and says I shouldn’t force him to take meds if he doesn’t want them.  All I know is that it’s exhausting and as much as it hurts the next step is leaving him.\n\nUpdate: I messaged him this morning and asked if we could talk about the state of things this evening over dinner since I’m off call and he said not until I apologize and accept that my attitude is the problem not him.  So, I’ve made arrangements to stay in an AirBnB to clear my head for the next few days so I can at least relax properly between call shifts, and I’ll reevaluate when I’m not feeling so worked up.  This is impacting my work and health too much and reading these replies I’m starting to realize that.  I hope he comes around, but I’ve worked too hard to go down with him.\n\nUpdate #2: We’re separating, I don’t think this is a salvageable situation anymore.  I dropped by the house while I knew he was gone to grab something and it looks like a war zone. There’s a hole in the drywall that looks like he punched the wall. I took pictures and I’m meeting with a lawyer today.  I have housing already lined up.  It’s going to be a fun Christmas this year.",
  "id": 1,
  "comments": [
    {
      "score": 1,
      "content": "NTA. He needs some kind of treatment as you have said, it doesn't have to be meds, but it has to exist, for him to have a functional life, and for him to be tolerable or enjoyable to interact with. It's his right to not seek treatment or manage his symptoms if that is what he so chooses, and unfortunately, he may stick to his guns on this. But then it is also your right to leave because he is driving you up the wall and has turned into someone completely intolerable to be around. Like, you love him, but you can't stand being around him, which sucks.\n\nEven if he were to turn around at some point in the future, would you want to still be with him, knowing he put you through all this and refused whenever you asked? That you asking wasn't enough of a reason for him to do it even though you said it was unbearable? And there's a possibility this is just the start of the spiral and he's not gonna reconsider for years. I don't think you can wait that long.\n\nYou've tried to set boundaries. You've tried to tell him things aren't working like this. You have tried. You are allowed to say 'I tried to make this work for as long as I could, but it no longer works for me'.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "I can't take meds, what if I lose my sparkle?\n\nSparkle= Inability to function in polite society. \n\nIt's not his fault, but it is his responsibility. No one should feel forced to put up with unchecked mental illness. NTA",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Superpower huh?  Well Superman's power comes from the sun, he probably doesn't sweat and can fly through rainclouds to get clean.  Batman is a billionaire and can afford to hire a butler and probably other servants.  And Wonder Woman is an Amazon and doesn't have a man creating mess behind her as she cleans up.\n\nNTA, OP.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. I work in an ADHD specialized clinic. Meds are super helpful but not the only treatment available. He needs to see a psychiatrist to build a treatment plan that works for him. If he is adamant against meds then he needs to make some lifestyle changes to help manage his symptoms.\nEdit: spelling",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Checking in to see how things have been going. Any updates?",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA he HAD the help for his ADHD and he stopped taking it. He's being an unreasonable asshole. If he continues to refuse to take his medication and actually help himself, then I'd suggest separating.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA\n\nHe is CHOOSING to be this way. So you can CHOOSE to not want to live like that. Having ADHD is not a pass to be an AH.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. When he asks for handouts or for you to be his surrogate mother you should point out that maybe the blogs he’s been reading are full of shit. You married a functioning adult, and what he’s devolved into is not functional.\n\nI’d write him up a side-by-side comparison of everything he used to do (career, chores, paying his own bills, saving rather than spending excessively, etc) beside how he acts now for every item on the list. Spell it out for him and put the scale of the problem right in front of him.\n\nYou are not the problem. Encouraging him to take meds and get his shit together is how you support him in a situation like this. You are right to not enable him.\n\nADHD doesn’t mean that he’s incapable of grasping these concepts. He’s willfully doing this, and he understands what he’s doing. Even if he doesn’t want to admit to himself of others that he needs to be on medication.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "I am sorry he unilateral decided to stop his meds and thus change the way he can funtion in daily life. I would probably if he doesn't get back on his meds ASAP separate from him.\n\nNTA",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Big oof. \nFirst of NTA. As the ADHD spouse you are totally fair in asking him to do something to deal with his “superpower”. It is not fair for you to take on all the burden while he gets to just squirrel out. \nYou may have to except that this may be the deal breaker for your marriage, but don’t feel guilty about that. No one would fault you for standing your ground if he was a drug addict or alcoholic or had another major disorder that requires medication to function “normally”.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    }
  ]
}