{
  "post content": "So I’m deaf in one ear, and sometimes I’ll find myself waking up sleeping on my one good ear, so I won’t be able to hear my alarm. So in order to fight this, I set 3 alarms in case I don’t wake up to the ones before it. I have class at 9:15am so I set the alarms for 8:30-8:45. The problem is when they go off, my roommate will call my cellphone and hang up immediately to put the phone into snooze mode. He does this with every alarm that rings and today I missed my class because of it (I also woke up and eventually found my phone in my desk drawer). And it isn’t that he needs sleep and needs to wake up later, because he has class the same time as me. I could ask him to wake me up when he gets up but that would make me feel like a burden. When I confronted him about him making me miss class he went silent, told me to stfu and that I move when the alarm goes off (he thinks that I’m awake and that I ignore the alarm? Which I have no recollection of because if I was awake I would turn it off) and he left the room. Do I need to sleep earlier so I don’t require an alarm in the morning? Or just set a singular alarm? Though he would just end up turning that one off, and I’d have nothing to wake up to.  Am I in the wrong here?\n\nEdit: Apparently I’m Patrick Star because I never knew vibrating alarm clocks existed. Thank you for letting me know!\n\nUpdate: He’s planning on moving out in two weeks or so. Sucks we couldn’t get along, but it’s for the best considering my third roommate and I think he’s a snake (for other reasons). ",
  "id": 1,
  "comments": [
    {
      "score": 139,
      "content": "ESH, multiple alarms are incredibly annoying if you have a roommate. Why not set your ringtone to really loud so your friend's call functions as an extended alarm? ",
      "id": 2,
      "comments": [
        {
          "score": 39,
          "content": "He calls my phone and immediately hangs up. It just acts as a stopper that stops the noise",
          "id": 3,
          "comments": [
            {
              "score": 35,
              "content": "Why don't you tell him to get up and shake you? I'm genuinely curious how deaf people wake up now on time. Why not get a vibrating alarm or some flashing lights to jolt you awake?",
              "id": 4,
              "comments": [
                {
                  "score": 18,
                  "content": "I can hear in one ear, usually I eventually roll over to my good side in time before class and hear the alarm. So I can understand why it would be annoying if the clock would keep ringing. \n\nAnd I asked if he could just wake me up and he said yes but he was clearly angry at me for telling him I was upset. \n\nAlso I never heard about vibrating alarms till now, so I’ll look into investing in one",
                  "id": 5,
                  "comments": [
                    {
                      "score": 39,
                      "content": "Get a vibrating alarm that’s what deaf people use. Multiple alarms is super annoying for other people. ",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Get a vibrating alarm.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 98,
      "content": "YTA.  You are sharing space with another person and you need to show consideration.  Hearing someone's alarms go off over and over again is fucking annoying.  Get an alarm that doesn't depend on you hearing it.  ",
      "id": 8,
      "comments": [
        {
          "score": 9,
          "content": "Yes. As someone who lived with a multiple alarm roommate it was torture. Half the mornings I wouldn’t need to wake up until 9:00 AM but would always hear a bunch of loud alarms from 7:00-7:30AM. I told him to get another wake up system but he insisted it worked (it didn’t). \n\nI ended up unplugging it a few times during the night so he finally switched to vibrating phone alarm (I know this definitely makes MTA)",
          "id": 9,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Agreed.\n\nAlso, being deaf in one ear is not a reason for having the alarms going off at different times. There's no reason not to set them all for the same time, which would be significantly less annoying.",
          "id": 10,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 53,
      "content": "Edit: NTA pending the purchase of a non audio based alarm\n\nIf you know alarms that are audio based don’t work well then you should consider investing in a non audio based alarm. Maybe one that shakes your bed. That way you don’t need to set multiple alarms that may or may not work \n",
      "id": 11,
      "comments": [
        {
          "score": 19,
          "content": "ESH? And huh, I never knew about no noise alarm clocks! I will definitely consider getting one now. ",
          "id": 12,
          "comments": [
            {
              "score": 15,
              "content": "I guess I was under the impression that you knew they existed and did not bother to get one. Will update verdict!",
              "id": 13,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Does your phone not have a vibrating alarm?",
              "id": 14,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 48,
      "content": "YTA, but just barely\n\nHaving to listen to several alarms every morning would be incredibly annoying.  Your school should have made special arrangements for you to have a room where multiple alarms wouldn't be a problem.\n\nI think Fitbit smartwatches have a silent alarm where the watch vibrates.  You could try one of those out but I would bet that Google searching \"alarm for deaf people\" would yield some product that would work.",
      "id": 15,
      "comments": [
        {
          "score": 5,
          "content": "just a bit on the smartwatches - idk if he’s a heavy sleeper but I’ve had a Fitbit and an Apple Watch and neither wake me up whatsoever. I’d recommend a bed vibration alarm or a smart light alarm kit - they simulate a sunrise and the alarm sounds are birds or waves.",
          "id": 16,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 22,
      "content": "I'm close to say YTA, but not for having multiple alarms. \n\nEach alarm, if you don't hear it, will go off for a set amount of time. How do I know this? Why, I used to have a roommate like you. She'd set multiple alarms to make sure she got up. But she wouldn't wake up to the first few, leaving several minutes of just her alarm going off. The ring continuing, and loud enough to hear it through a wall. \n\nAfter three weeks of it, I asked her to stop and she complained that she couldn't. She doesn't live with me anymore, because I started doing what your roommate does. However, mine was because her earliest day (6:45 am), was the only day I could sleep in. I can't express how frustrating it is when you've planned a sleep in day to be woken up every week by an alarm that keeps going for FIFTEEN MINUTES. \n\nI don't think you are doing this to be spiteful, I believe that you are trying to get to your class. But just because you don't hear the alarm doesn't mean that your roommate also doesn't. Find an alarm that doesn't need sound. \n\nEdit: three weeks not days ",
      "id": 17,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "ESH. Setting multiple alarms that you sleep through is rude to your roommate. Your roommate is rude for not waking you up.\n\nDude, just ask your roommate to wake you. Multiple alarms (which I assume you have set very loud) are *way* more of a burden than waking you up when he's already up. Have you considered getting a watch with a vibration alarm?",
      "id": 18,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "NTA you have a clear reason to have the multiple alarms, and while I can understand your roommate getting slightly annoyed by the noise in the morning, they could handle it a lot better. There's no reason for them to snooze your alarm for you, that's totally unnecessary. Not that you need to accommodate them at all, but if it would make you feel better you could try a vibrating alarm that doesn't produce sound and see if it works to wake you up?",
      "id": 19,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NAH,  multiple alarms is very annoying.  You can buy an alarm that is essentally a light bulb on a timer.  In the meantime, drink a full glass of water before you go to bed, it'll help you wake up naturally,  using your internal alarm (your bladder).\n\n((I'm assuming you roommate knows you are partially deaf, and understands WHY you have a multiple alarm system))",
      "id": 20,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA although I do agree that getting a non-audio alarm is probably the best thing to here. I don't think the time period for your alarms are that bad, especially considering the fact that your roommate also needs to get up at around the same time. Waking up 30 minutes before a class starts does not seem unreasonable. Plus your alarms are only set within a 15 minute period so it's not like your roommate is hearing it go off every half and hour for 2 hours or anything.",
      "id": 21,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "ESH. You for putting more than one alarm in a shared space, him for preventing you from walking up. ",
      "id": 22,
      "comments": [],
      "relation": "No"
    }
  ]
}