{
  "post content": "So let me start by saying that everyone is entitled to their thoughts and opinions and I don't begrudge anybody for what they think.\n\nSo recently I've been living with a group of new-age types (we're all late 20s) who often offer eachother medical advice in terms of ayurvedic, spiritual and various other alternative medical ideas. I don't think these ideas are helpful in terms of reality and will often join in the conversation by explaining how experimentation and science works and always cover myself with the knowledge that I don't know everything - they seem to be offended by my mere mentioning of the fact that for example. candida, which most everybody has in their gut, can be treated with anti-fungal cream when causing thrush in the mouth or... you know where - then I further explained that if it was in their blood that it would be a legitimate medical emergency.\n\nThis is where the potential assholery comes into play. Last night one of my housemates (the most spiritual one) had a word with me about it, basically saying that although I'm entitled to my opinion, I'm no more right than anybody else and that everybody is getting upset with my \"trying to one up them\" when from my perspective I'm just (non-aggressively) giving the general scientific medical reason for things and saying to look up peer-reviewed studies and the like to get a less biased view. I've started just asking questions about their superstitions etc to see if I can get them to see the errors in their logic and clearly they've picked up on this as an attack.\n\nSo, AITA? Should I just keep my mouth shut and let them reinforce eachother's distrust of science and ignorance of how it works or should I go about it in a different way? If so, what way?\n\n&#x200B;\n\nEdit: Thought I'd add that we often have philosophical discussions where there is no right answer as well and we all get by fine, plus we're all quite good friends. I'm not sure if it was the one housemate speaking for the others or if it was the one housemate speaking for the way they see things. I'm still going to offer my opinion in a room full of shared opinions but I'll definitely try to go about it in a way that's more calm. Sometimes I can't help laughing though.  \n\n\nEdit 2: It's never turned into an argument or anything actually shouty or aggressive, which is why I found it kind of odd. Of course it's good to be self-critical but I was having a hard time seeing exactly what I was doing wrong to them. Cheers guys I think everyone sucks I suck they suck we all suck a big butthole when the time is right.",
  "id": 1,
  "comments": [
    {
      "score": 18,
      "content": "ESH\n\nYour roommates are assholes because they can't accept scientific fact or cannot back up their own opinions with objective studies.\n\nYou are an asshole because you keep imposing a viewpoint onto your roommates you know they are not going to accept and have no interest in.",
      "id": 2,
      "comments": [
        {
          "score": 2,
          "content": "I understand. I do get concerned about one housemate not washing their hands and saying it's fine though. Though, I held my mouth shut on that one.",
          "id": 3,
          "comments": [
            {
              "score": 8,
              "content": "No, that's a public health concern, to you. I'd tell them to wash their hands. At this point though, you might want to consider getting new room mates.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 18,
      "content": "[deleted]",
      "id": 5,
      "comments": [
        {
          "score": 3,
          "content": "Fair enough. I do try to not say anything but sometimes I can't just be silent.",
          "id": 6,
          "comments": [
            {
              "score": 2,
              "content": "[deleted]",
              "id": 7,
              "comments": [
                {
                  "score": 14,
                  "content": "Slow your roll. Sometimes you do not just \"grow up and learn to be silent\". If they're giving each other faulty medical advice, no problem. If they're giving others faulty medical advice, that's how we got anti-vaxxers and moms who think putting bleach in their child's rectum will cure autism.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I concur. ",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -3,
                      "content": "[deleted]",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "> but sometimes I can't just be silent.\n\nIf you can't grow out of this behavior, you're going to have a bad time later in life - trust me. While in college and for my first few years out of it, I had strong opinions on nearly everything and I almost always felt the need to share those opinions whenever a conversation steered towards something I felt strongly about. However, I learned it's often just not worth it. A big part of this is reading a room/audience, and knowing how the are going to feel about/react to your opinions. But more often than not, you are much better off just keeping your opinions to yourself unless someone specifically asks you for them.",
              "id": 11,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "Idk man, infections from shitty \"medical\" advice would probably make them more uncomfortable. If you're gonna sell snake oil, be prepared to be called out on your bullshit.\n\nTheir discomfort in no way trumps someone else's right not to suffer thanks to their bad decisions.",
          "id": 12,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "NTA - this is how these kind of topics become echo chambers, rather than them being willing to consider other perspectives. I think you probably know you're wasting your time trying to educate them, people who believe in woo-phuckery do so because they want to believe in jt, not because they want understand how anything works.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "ESH - you, because you are probably not \"just (non-aggressively) giving the general scientific medical reason for things\" to the point where one had to say something to you about it and them for being idiots.  So rarely is someone \"just asking questions.\"  There's an art to confronting this sort of woo-ism, and I'm betting you're going about it poorly. ",
      "id": 14,
      "comments": [
        {
          "score": 3,
          "content": "I must be going about it poorly, because they see it as an attack. I just give the information I know when it's relevant.",
          "id": 15,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA. If nobody had debates, we would learn absolutely nothing. Different perspectives are necessary in some discussions. \n\nJust don't chime in with your opinion *JUST* because you know it will piss them off - that would make YTA. ",
      "id": 16,
      "comments": [
        {
          "score": 1,
          "content": "Yeah I'm not trying to piss them off at all and it's not all of the time, I'm literally just trying to add my viewpoint to the conversation as a whole. I'll try to be more conversationally considerate in the way I add to discussions.",
          "id": 17,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "YTA, they specifically asked you to stop, they don't seem interested in discussing and/or believing in what you say on this topic, it's a waste of everyone's time to continue trying.",
      "id": 18,
      "comments": [
        {
          "score": 1,
          "content": "Do you say the same to people who argue with flat-earthers, anti-vax people, young earth creationist and people with other completely delusional point of views? This is no different. If they're giving medical information which isn't correct he is right for trying to safe them, even if it makes them uncomfortable. His roommates are assholes for having uninformed opinions, he isn't one for trying to help them see their bullshit positions.",
          "id": 19,
          "comments": [
            {
              "score": 1,
              "content": "At some point I think it's best to let it rest, for a while at least. They're obviously not responsive to his information and pressing the issue every chance he gets will just make them less responsive. If he only brings it up every now and then he is much more likely to be succesful in getting them to use proper medicine.\n\nWhile OP might mean well, the only thing they achieve here is making their roommates annoyed.\n\nAs to your example of flat-earthers, it would depend on how often you argue, I think it's good to try to inform them and/or discuss with them on occassion, but not every time you see them, that's not productive and there's better uses of your time.\n\nIt might be interesting to note that that science dude got criticised for even attempting to debate the christian dude on tv*.\n\n*I think it was Bill Nye vs Ken ham",
              "id": 20,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "YTA. You know that they don't want your opinion and you keep throwing it out there. They aren't looking to change and you aren't helping your cause any. Just wash your hands of them and let them stay in their own little thought bubble.",
      "id": 21,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***This is a copy of the above post. It is a record of the post as originally written, in case the post is deleted or edited.***\n\nSo let me start by saying that everyone is entitled to their thoughts and opinions and I don't begrudge anybody for what they think.   \n\n\nSo recently I've been living with a group of new-age types (we're all late 20s) who often offer eachother medical advice in terms of ayurvedic, spiritual and various other alternative medical ideas. I don't think these ideas are helpful in terms of reality and will often join in the conversation by explaining how experimentation and science works and always cover myself with the knowledge that I don't know everything - they seem to be offended by my mere mentioning of the fact that for example. candida, which most everybody has in their gut, can be treated with anti-fungal cream when causing thrush in the mouth or... you know where - then I further explained that if it was in their blood that it would be a legitimate medical emergency.  \n\n\nThis is where the potential assholery comes into play. Last night one of my housemates (the most spiritual one) had a word with me about it, basically saying that although I'm entitled to my opinion, I'm no more right than anybody else and that everybody is getting upset with my \"trying to one up them\" when from my perspective I'm just (non-aggressively) giving the general scientific medical reason for things and saying to look up peer-reviewed studies and the like to get a less biased view. I've started just asking questions about their superstitions etc to see if I can get them to see the errors in their logic and clearly they've picked up on this as an attack.   \n\n\nSo, AITA? Should I just keep my mouth shut and let them reinforce eachother's distrust of science and ignorance of how it works or should I go about it in a different way? If so, what way?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 22,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, put one of the following abbreviations in your comment. Include ONLY ONE of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 23,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "I think you're very mildly YTA here. some alternative medicine has a decent amount of both anecdotal and experimental evidence behind it. are you making sure to \"intervene\" only in cases where actual harmful misinformation is being spread? in any case, your roomates have asked you to stop, and you're not their parent or their teacher, so if I were you I would stop trying to \"teach\" them, as they are not interested.",
      "id": 24,
      "comments": [
        {
          "score": 1,
          "content": "I don't disagree with your point about the experimantal evidence. I also don't intervene it's more in the flow of conversation. It's never an argument.",
          "id": 25,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}