{
  "post content": "As you've seen from my previous post, I was sent to my aunts place desoite ne begging my parents not ti sebd us and it sucked Caterpillar balls. They were making us pick up horse manure and I bent over and my underwear was slightly showing and my aunt gave me this long ass lecture about how inappropriate it was and unlady like and I need to change pants because other teenage boys were nearby and they shouldn't see it. \n\nI told my aunt to fuck off and I'm not doing shit. She was so pissed cursing me out and calling me a whore and other obscenities. Fucki g hell",
  "id": 1,
  "comments": [
    {
      "score": 50,
      "content": "[deleted]",
      "id": 2,
      "comments": [
        {
          "score": 3,
          "content": "Well said.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 31,
      "content": "YTA weren't you supposed to have run away with some cute guy at a cafe by now? Please get better at trolling.",
      "id": 4,
      "comments": [
        {
          "score": -36,
          "content": "[removed]",
          "id": 5,
          "comments": [
            {
              "score": 24,
              "content": "I can see why your parents shipped you off to your aunt.",
              "id": 6,
              "comments": [
                {
                  "score": 15,
                  "content": "Thank you! Many people on the other post are leaning toward her parents are assholes, this is borderline abuse. \n\nHow the fuck a 17 yr old acts like a brat and thinks it’s cute is beyond me. Writing checks with her mouth she can’t cash. I bet if she gets kicked out, she’d whinge about it too. 🥴🥴🥴\n\nGlad I’m not the parents, honestly.",
                  "id": 7,
                  "comments": [
                    {
                      "score": -3,
                      "content": "How do grown adults call kids whores and slut shame them is beyond me. Glad you're not the parents too. You'd probably have CPS called on you as you seem to be fine with forced physical labor and emotional abuse. As for getting kicked out and whining op seems to.be proactive and have no problem finding herself alternative living situations but go off I guess.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
              "id": 9,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 23,
      "content": "ESH. Have you tried not yelling and cursing at people. I hear that works pretty well.",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 13,
      "content": "I wish I could say that you’re not TA, I do; however, you seem to have constant issues and a foul mouth. So a very soft YTA or hard ESH.",
      "id": 11,
      "comments": [
        {
          "score": 1,
          "content": "She does have a foul mouth but the aunt did call her a whore so isn't it ESH?",
          "id": 12,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "INFO: So you went back to the aunt and uncle's house from the cute guy's house?",
      "id": 13,
      "comments": [
        {
          "score": 4,
          "content": "I wonder the sex traffickers' are going to have to say about her underwear.",
          "id": 14,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -20,
          "content": "No I'm at the cute guys house.",
          "id": 15,
          "comments": [
            {
              "score": 17,
              "content": "😂😂 Im done. Here’s hoping you grow up some before you hit legal adulthood or you’re in for a rough ride. I’m sure you’ve heard of parents who called the cops on their abusive kids once said kids became legal adults. So, maybe watch the potty mouth and the unnecessary sass. You may think you’re being edgy with all the response of “fuck you” to any adult who dares to say something you don’t like/ want, but it gets old after a while.",
              "id": 16,
              "comments": [
                {
                  "score": -3,
                  "content": "I mean you think it's ok for the aunt to call her a whore because some of her underwear accidentally showed when she bent over?",
                  "id": 17,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": -3,
                  "content": "you're really saying that a teenager cursing makes her an abusive kid who'll have the cops called on her? Interesting. \n\nAlso why are you bothered by a teenager cursing but your not bothered by the aunt calling a teen girl a whore?",
                  "id": 18,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Where did I say that? Please read that again. \n\nWhat I said was IM SURE YOUVE HEARD OF PARENTS WHO CALL THE COPS ON THEIR ABUSIVE KIDS. \n\nReading comprehension is a skill. Please learn it. And anecdotally, I know of two people who did just that. One was a single mother whose son always wanted to fight her or will swear at her when she asked him to help around the house or scolded him for neglecting his studies. She called the cops on him after he smashed in a wall and scared his little brother(5 at the time to this man’s 17). He spent 2 weeks in juvie and kept calling his mum to come get him. Sadly for him, he turned 18 in juvie and the mum told him he had to get out of her house because his little brother would just cry when he came into the room where the 5yr old was. Last I heard, he crawled back home begging for forgiveness recently because it took him 6 years to get a college degree and this is the worst possible time to be in the job market. \nSo, yes it happens.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "Ugh. How delightful.",
      "id": 20,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "Uhm....what?",
      "id": 21,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA It's pretty ridiculous to try enforcing standards of ladylike behavior when picking up horse shit, and if the teen boys are driven wild by a quarter inch of underwear waistband, that's not your problem. You shouldn't have said what you did, but her response was wildly over the top.",
      "id": 22,
      "comments": [
        {
          "score": 8,
          "content": "To be fair, I shadowed my vet once as a 15 year old girl. He works on farmlands with farm animals. I showed up wearing long sweatpants and a baggy t-shirt, thinking I would get dirty (I did), and he commented that he was glad I dressed that way because farmhands are usually very rough people and he didn't want me being exposed to rough behaviour. Not saying that OP's terrible for accidentally showing a strip of underwear, but some caution is generally good when on farmland. Not because the teenage boys will fall to sin, though.",
          "id": 23,
          "comments": [
            {
              "score": 6,
              "content": "[removed]",
              "id": 24,
              "comments": [
                {
                  "score": 4,
                  "content": "Exactly. And if you've never worked on a farm then you wouldn't know what would be appropriate.",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 26,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAs you've seen from my previous post, I was sent to my aunts place desoite ne begging my parents not ti sebd us and it sucked Caterpillar balls. They were making us pick up horse manure and I bent over and my underwear was slightly showing and my aunt gave me this long ass lecture about how inappropriate it was and unlady like and I need to change pants because other teenage boys were nearby and they shouldn't see it. \n\nI told my aunt to fuck off and I'm not doing shit. She was so pissed cursing me out and calling me a whore and other obscenities. Fucki g hell\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 27,
      "comments": [],
      "relation": "No"
    }
  ]
}