{
  "post content": "Me and this girl have been friends for the best part of out lives. We went through a lot together and we’re like each other’s safe space. I do love her a lot and honestly I’m so so grateful to have her as my friend.\nBut lately things have been getting.. weird, in a sense?\n Usually, we go out together a few times a week, mostly during the weekends. We’re together at school all the time, so I think it’s normal we don’t go out every day. \nHere’s where I’m starting to feel like an A-hole. It’s not something that’s been going on forever, but the past few months we aren’t hanging out as much because of her brother. Idk what tf her parents tell her to do or how they’re using this poor girl but she’s basically taking care of him all the time. She calls me to hang out, but it has to be with her little brother because “it was her turn to take care of him”.\nHer brother’s a great kid, despite being nonverbal and autistic. But going out with a little kid that is so unpredictable is very stressful. It’s a whole responsibility. Her mom’s a SAH mom, so what’s the problem in her doing her job as a mum and taking care of her own kid?? \nSo that goes on for months and months. Don’t get me wrong, I like that kid, but it’s so restring and even a bit embarrassing being a young girl and going out everywhere with a kid (he’s 5). He throws random tantrums, he’s very stubborn and strong on top of that. We can’t pull our phones out around him because he’ll cling onto them. \nThe weirdest part is that my friend never brings him with her when she’s with her other friends. I don’t know why honestly. Why is she doing that to me? I don’t have siblings so idk how to take care of little children, especially in his case, communication is restricted so its even harder.\nToday I asked her if she wants to hang out tomorrow, just us two, shopping or doing whatever she wants. Of course, she denies. Idk why, she gave a bunch of weird excuses like that she had a lot to study, but few minutes later said that studying wasn’t really an issue. Honestly, wtf is going on?? I just want us to be girls together again, not feeling like single mothers to this kid who actually has both a mum and a dad.\nYou’ll probably call me an A-hole, but whatever. Honestly, I love my friend, but I don’t want to have to deal with this huge responsibility and embarrass every time I want to go out with her.",
  "id": 1,
  "comments": [
    {
      "score": 83,
      "content": "NAH- have you thought that since you're each others safe space, she feels more comfortable bringing her brother around you and not the other friends shes not as close with?\n\nAnyway just talk to her about what you're feeling. No point in bottling it anymore than you already have.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 64,
      "content": "NTA\n\nExplain to your friend that you no longer want to hang out with her while she has her brother, and if she thinks she'll still have time for you two to hang out as friends. If not, you can move on.\n\nShe definitely shouldn't be tasked with watching her brother, so I hope you have some sympathy for her situation there, but given that she's able to hang out with other friends without her brother she could find time to include you when he's not around as well.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 41,
      "content": "NTA\n\nTell her how you feel. \n\nMake it clear that you want to spend time with your friend and not her little brother as well.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 22,
      "content": "NTA\n\nTalk to her, share your thoughts and ask her why she is doing this.\n\nI would theorise that since you're close, you might be the one she trusts most with her brother but that doesn't mean she should always bring him along.\n\nYou're not angry at the brother, you're angry at your friend and possibly her mother for allowing this. I can understand it being hard so your friend may see you as a great help when dealing with the kid.\n\nTruthfully, I don't think he should be with two teenagers unsupervised. Sure, his sister may know how to deal with him, but the same can't be said about you.",
      "id": 5,
      "comments": [
        {
          "score": 2,
          "content": "This is what I was thinking. But the fact that she brings her brother EVERY time makes me think that possibly the mom is telling her to.  Maybe because it’s just the two girls and not a group?   Mom thinks it’s easier to care for the boy? NTA tho.  OP deserves to have time with her friend without the other kid.  So does the friend.",
          "id": 6,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 19,
      "content": "NTA - You need to have a talk with her. Obviously something has changed for her if she’s making a point of only taking her little brother around you. And if she is using her brother as a way to get out of hanging out with you…that’s a jerk move to you *and* her brother. Though obviously if she’s actually being parentified, that’s concerning for her and her brother.\n\nBe honest about how you’re feeling. Tell her that you sense something has changed in your relationship with her and it’s left you feeling hurt and confused.",
      "id": 7,
      "comments": [
        {
          "score": 2,
          "content": "I agree but I don't see the friend reacting well to this",
          "id": 8,
          "comments": [
            {
              "score": 9,
              "content": "If she doesn’t, then that tells OP that he isn’t really a friend anymore and the friendship is over. Talking to her is the way to know if there is an issue to be resolved, or to know once and for all if the friendship needs to be ended. Confronting it is really the only way to know one way or the other.",
              "id": 9,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "NTA The big problem here is that she only takes her brother out with you and not her other friends. It sounds like she’s trying to end the friendship by using her brother as annoyance to  you. It’s a weird passive aggressive behavior choice on her behalf. At least that’s what I’m getting from your post.   \n\n\nMy advice, it’s time to move on and find other friends. If she calls you to hang out without her brother, then consider it. \n\nNow his disability is really not important to your post, in my opinion. If you left that part out completely, I would have surmised the same thing. Teen girls do not want to hang out with little boys regardless of their abilities. \n\nDo not be so hard on yourself. This is an awful lot to handle and the addition of his disability causing you concern shows your level of empathy for others. You are allowed to have boundaries and feelings as well as empathy.",
      "id": 10,
      "comments": [
        {
          "score": 3,
          "content": ">It sounds like she’s trying to end the friendship by using her brother as annoyance to you.\n\nOr OP is the only friend she trusts to have her brother around.",
          "id": 11,
          "comments": [
            {
              "score": 4,
              "content": "It's sweet that she trust OP enough with her brother, but to refuse hanging out without him leaves a bad taste in my mouth. She might as well be trying to turn OP into brother's new babysitter.",
              "id": 12,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "That might be true if she hung out with her friend at other times too.",
              "id": 13,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NTA OP.  Having a family member along on what is supposed to be fun time for you and your friend is awkward.",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NAH, she likely doesn't have a choice.\n\nYou talk about how she doesn't bring him out with her other friends, but you also talk about how comfortable you are with each other.\n\nIt sounds like she is being parentified, and she has to bring him if she wants to have a social life at all. It is not your responsibility to take care of him, and I imagine that she's going to need to lean on you and vent. Unfortunately,  it sounds like her parents suck.",
      "id": 15,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": ">The weirdest part is that my friend never brings him with her when she’s with her other friends.  \n>  \n>\\[...\\]  \n>  \n>I just want us to be girls together again\n\nWhy do I get the feeling that you look a bit older than the rest of the friend group, and may attract Boy Attention; so Mum is throwing a 5-year-old into the mix to keep her little girl from being influenced and acting like she's a teenager or something!\n\nNTA",
      "id": 16,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA OP.\n\nYou didn't ask to be a caretaker any more than your friend did. All you can do is tell her exactly that.\n\nTo me though, I think she already knows:\n\n>she gave a bunch of weird excuses like that she had a lot to study, but few minutes later said that studying wasn’t really an issue\n\nShe doesn't have to study, she probably has to watch her brother, and she's probably already picked up on the fact that you don't want to do that.\n\nIt's not your responsibility, but you know that she's going to need a friend more than ever if she finally stands up to her parents and isn't tasked with this role anymore.",
      "id": 17,
      "comments": [],
      "relation": "Support"
    }
  ]
}