{
  "post content": "Wife and I (late 20's) got invited to a Super Bowl party yesterday.  We have a 15 month old.  I assumed with the invite our kid was invited too.  It was a text invite saying this is happening at this time and this place.  No other details.  \n\nIn my history of going to super bowl parties they've always been family friendly. So I didn't think twice about bringing my kids to my buddies house.  We are on the West Coast and its over by 8.  So its a day thing and not really a late night.  \n\n  \nApparently, my kid was not invited and my buddy who hosted wasn't happy he was brought over.  We had a discussion that turned into an argument and we left.  He never mentioned no kids.  But am I the asshole for assuming he could come?  ",
  "id": 1,
  "comments": [
    {
      "score": 27462,
      "content": "Lemme just say, your title is massively misleading. A baby can be held in your arms, can be comforted with a bottle or a paci or a small toy. A baby is generally cool as long as someone is holding him and looking at him. A 15 month old is a TODDLER. A walking, “talking”, ball of potential catastrophic destruction. Very different things at an adult party. \n\nSigned, a mother of four.\n\nETA:  Verdict - YTA. You should have verified that your toddler was welcome. Barring that, you should have accepted with grace that your toddler was not welcome when informed by the host.  Should the host have stated\n“no children” in their invitation?  Emphatically, yes. However, it is your responsibility, as the steward of your child, to ensure that they are welcome and properly behaved in the given circumstance.",
      "id": 2,
      "comments": [
        {
          "score": 3267,
          "content": "Smart mom",
          "id": 3,
          "comments": [
            {
              "score": 699,
              "content": "Clever girl. ",
              "id": 4,
              "comments": [
                {
                  "score": 531,
                  "content": "I can never read this without thinking, \" shoot her! Shootout heeerrr!\"",
                  "id": 5,
                  "comments": [
                    {
                      "score": 40,
                      "content": "Haha I always read it in the actor’s voice and accent too 😂",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "Same.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Ahem…it’s: SHHHOOOOOOTAAAAH!",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 198,
                  "content": "That's when they get you. Not from the front, but... whoooosh... from the side. From the 2 moms you didn't know were there.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Marv: Shoot her!\nHarry: I’m trying’ to shoot her!!!",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "Really more toddlers. The moms are too tired to stop the carnage.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "🦖",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Que linda",
                  "id": 13,
                  "comments": [
                    {
                      "score": 30,
                      "content": "This Lady MOMS",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I literally had to stop reading the comments to go watch that scene again.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "🤭",
                  "id": 16,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Name checks out. ",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "They should all be destroyed! (in Aussie)",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2080,
          "content": "This was my first thought as well. It's likely that the host knew this also. Hence, OP was asked to leave.",
          "id": 19,
          "comments": [
            {
              "score": 2614,
              "content": "My thought is the home wasn’t baby-proofed if they don’t also have little ones. Maybe breakables or dangerous items were out (electric outlets not protected, cleaners not locked away, knives in unsecured kitchen drawers, steps with no gates, etc) and the homeowner wasn’t prepared to worry the entire party about the safety of OP’s mobile toddler.",
              "id": 20,
              "comments": [
                {
                  "score": 2719,
                  "content": "Plus kids are annoying, lol\n\nEDIT: In situation where they don't belong.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 1285,
                      "content": "Agreed. I have kids and I’m annoyed by other people’s kids when I leave mine at home to hang out with other adults. If it is family friendly, cool. But if it’s just adults, I also want to enjoy adults and being kid free.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Oh kids can be annoying even when they are in places they do belong. Signed - mother of a sometimes annoying 15yo. Lol",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Agree. No one wants your kid running around. Only you think it’s cute after 5 minutes.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": ">Plus kids are annoying, lol  \n>  \n>EDIT: In situation where they don't belong.\n\nAnd even in situations where they do.",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "Toddlers especially can be annoying. I’m a mom of 2.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "No, you were right the first time...before the edit, and I have 3 of my own.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "And throw in adults yelling at the game can be upsetting to a 15 month old.  Also, an entire game is a long time for a little one to not sleep.  Think they are going to nap with all the yelling the goes on while watching a game?   I can see the host not wanting children there.  You should have clarified before assuming.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "and drool all over the nachos",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I got three kids under five (includes twins). That edit is not necessary at all.",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 913,
                  "content": "I was at a housewarming party not too long ago.  The host had set up a huge appetizer display on the table for people to snack on.   It looked catered, probably northward of $800 worth of food. \n\nAnother family arrives with two kids, one was about 1.5-2yrs old.   Kids immediately gravitate to the table with the food.  Hands all over everything, no hand washing, don't use tongs, etc.   From the other side of the room, my GF and I watched the kid pick a large green olive off the table, pop it in his mouth, make a sour face, spit it back into his hand and put it back on the table display.  \n\nNot sure how many other adults noticed this, however my GF and I both agreed that we were done with the food at that point.   \n\nAnyway, the host didn't have kids, so the condo was not in any way kid-friendly let alone childproof.   If you have kids, you should ask before bringing them to a party.  The one exception is if you know the host has children the same age as your own kids, but even then, it is still polite to ask.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 418,
                      "content": "I am still mad about the time I spent time and effort making nice appetizers for a party, and a couple of parents set the entire tray in front of their toddler because it was finger food.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "I had a wedding cake on display for a wedding fair. It was a real 4-tier naked cake, which means minimal frosting. A toddler walked up and ran his finger right into the frosting where the layers joined. I was so pissed. WTH are you bringing a toddler to a wedding fair?",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "My parents hosted a lot of family holiday events and the like because we had a decent house and my dad loves to entertain. One time, we had some chips and a couple dips on a low coffee table. One of my cousin's toddlers took a chip and kept dipping it into a couple dips, licking the dip off, and the redipping the same chip. Like, well over a dozen times. I made sure to throw out the contaminated dips. He then dumped a bowl of guacamole onto our beige carpet, which left a stain until we got it professionally cleaned years later. I moved everything to a table he couldn't reach.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Because the host may have a designated sister at another house.",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "This happened at a party I attended, except it was a work Christmas party and the toddler was the hosts’ kid.  Kid had snots running down his nose, was picking at both his nose and feet and then playing with the food, including licking celery and putting it back and helping himself to dip with his fingers.  \n\nTold my wife and coworkers what I saw and to avoid the food on the low table.  ",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "That's just bad parenting. My kids (4 of them under the age of 7), know not to do that. If we are at someone's house and they see something they want to eat, they come and ask me and I put it on a plate for them.",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Whew, I thought your story was gonna go another way when you said the toddler put a choking-hazard olive in its mouth.",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 414,
                  "content": "Also, food and drinks might be left on low tables accessible to a toddler, and toddlers love sticking stuff in their mouths.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 355,
                      "content": "> toddlers love sticking stuff in their mouths.\n\nThere was never a gunslinger in the Old West that had faster hands than a toddler. It's frightening how quickly they can grab something and either make a mess or put something in their mouth they shouldn't.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 120,
                      "content": "And they’re on the west coast, so there may have been edibles around. Or people smoking weed.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 207,
                  "content": "Yeah my house is fine if they’re still in the “potato” stage and aren’t very mobile/can be easily corralled, but once they start walking it’s no longer a friendly environment. \n\nIdeally, the host would have specified on the invite and OP would have reached out to confirm, but given the circumstances I think this is a NAH situation best resolved by better communication going forward.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 24,
                      "content": "To me it's a low stakes YTA on OP, unless the hosts have young children. If they do, it's fair to assume that they are set up for children, although still wise to check. If they don't, it's not fair to assume that children are welcome and that it would be appropriate for a toddler. Of all children, toddlers are the hardest to accommodate - because they a mobile, touching everything, putting whatever in their mouths, and can't be reasoned with to not do that.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Same here. My house is not kid friendly and I like my stuff. \n\nKids are not safe for my home and my home isn’t safe for kids, especially toddlers.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Crawling is enough to wreck havoc.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 182,
                  "content": "Agreed. Makes sense to have a kid friendly party IF the household is already prepared for toddlers running around. If the house isn't safe, I wouldn't allow kids at the party.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 362,
                      "content": "See I think it’s the other way around, if you are invited to a party that doesn’t specify if your kid is invited, at the home of someone without kids, you ask not assume.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "My household is toddler safe after our toddler started to peel the non-peel wallpaper off the walls, and ate it.\n\nWe had to remove the wallpaper in several spots of the house.\n\nHe also managed to get the floor blinds off, and disassembled half of the heater (European model).\n\nHe frequently eats my earplugs.\n\nI trust nothing around him. There are two safe spots in the house, everywhere else someone has to *watch him*. Actually keep watch.\n\nHe's 13 months old now.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 133,
                  "content": "Not just the house either, you also have to worry about the snack situation. If the hosts didn't plan for a toddler being around, the snacks could include a lot of choking hazards out on a coffee table (aka toddler eye level). The chips and dips might be fine, but a bunch of raw veggies or some whole grapes or cubes of cheese?\n\nOP definitely should have asked because not all hosts are prepared to host a toddler (especially with no advance warning).",
                  "id": 49,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I saw a toddler at the chip and dip bowl double dipping away ( triple, quadruple etc.)\n\nThe mom was right there pointing out how clever her kid was and laughing over it.\n\n🙄😐😠",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 105,
                  "content": "Salsa, Wasabi, and hot food are all hazards to a 15 month old. So are drunk screaming people jumping around with flailing arms.\n\nThe knives in a drawer are the least of the worries here.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "In this case the host is in no way obligated to deal with the kid and it is a distraction for everyone. There are events that should be child free.  When I was a child invitations absolutely did not include children, except specifically mentioned. A super bowl party? Absolutely not.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "As a host, this is a nightmare. I had people bring a toddler and my home is not baby-proofed nor is our outdoor two level patio/pool area that has stone pavers. The parents decided they wanted to relax and enjoy the festivities so I was left chasing after the kid the whole time, scared to death he was going to fall down the steps to the pool, fall in the pool, or do something where he would hurt himself. Ruined my party for me.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Even if the house *is* baby proofed, what are the chances it stays that way with a bunch of people likely drinking and milling around for 4+ hours? I wouldn’t want to spend my party cleaning up after everyone to make sure a toddler doesn’t get hold of a cheese knife or breakable glass.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Also OP says it's \"family friendly\" what does that mean? Because family friendly and kid friendly are different. Assuming your very young kid can come is a stretch if the family is 90% preteens and teens. Because saying family-friendly means they can expect a group of kids that can entertain themselves or might even like the game. It could also just mean \"we're not getting shitfaced so keep it classy\" It could mean it's not just the gang that's into football, their wives and husbands and partners can come too. When regarding babies, kids and parties (especially sports parties) you always ask. Always always always always even if it's a kids party you always make sure they are welcome before you show up. Also, in my experience, you have to REALLY fuck up to be asked to leave over bringing a kid, as unless some serious offensive shit goes down, people will just sit silently annoyed and bitch when people leave. So I wouldn't be surprised if OP left out some pertinent info.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1144,
          "content": "Correct, this is not a baby. An infant at a party is a delight. A toddler at a party is an agent of chaos.",
          "id": 56,
          "comments": [
            {
              "score": 202,
              "content": "So very true. A baby can be held and remains contained to whoever is holding him,  the car seat they are placed in, or the blanket they are laying on. Teens and preteens, really kids from about 8, can entertain and look after themselves. It is that toddler stage that needs constant attention, stimulation, and vigilance. A toddler becomes a hazard at an event like this, it common sense that bringing him would 100% impact the vibe of the party and everyone enjoyment in some form, which is why especially at that stage in childhood you ask if it is an event that children are invited to.",
              "id": 57,
              "comments": [
                {
                  "score": 91,
                  "content": "Very important distinction right there.  YMMV but it has tiers to it - \n\nNon-crawling infant: adorable potato\n\nCrawling baby/toddler: agent of chaos, boogers, uncovered sneezes, coughing in your face, grabby hands, stains, smells, you name it\n\nPreschool to \"self-entertained\": will not let adults focus on anything but themselves; single kid = \"every adult must pay attention to me\"; multiple kids = fighting/arguing/\"she took my toy\", \"he said I smell like poop\", \"they touched the TV\", on and on and on and on\n\nAny invite to anything that we get that falls during our time with my SD = immediate query as to whether or not she is also invited.  Period.  That's on parents, not the person who sent the invite.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Yeah you got until they are ~6 months old before they will try to kill themselves in the most creative ways.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 114,
              "content": "I cackled at this. Spot on.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 82,
              "content": "Omg this!!!  The scariest thing in the world is a quiet toddler.  That means they are up to something baaaaddddd.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": ">An infant at a party is a delight. \n\n...they are neutral AT BEST! LOL",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "This is literally the nickname my toddler has currently.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 780,
          "content": "I’m pretty sure taking a toddler to a friend’s place without asking can be considered a war crime lmao.",
          "id": 64,
          "comments": [
            {
              "score": 230,
              "content": "Amongst our friends and family, if you know they have kids,  it's always assumed everyone is invited and you have to stipulate no kids if it is adults only so they can arrange a sitter.  And we STILL double check if kids are invited.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Little known fact, it’s actually how the American Revolution started. When Paul Revere shouted “The British Are coming!” He meant with toddlers. Also the Boston tea party? someone’s toddlers. that’s how all the tea ended up everywhere in the harbor.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 433,
          "content": "Doesn't matter. This is a non-argument. The age of the baby/toddler/kid/teen isn't the damn issue, it's the lack if communication on BOTH parties:\n\n1) His buddy should've specified \"no children\"\n2) OP shouldn't just assume. He should've asked his buddy if it was okay.",
          "id": 67,
          "comments": [
            {
              "score": 271,
              "content": "Late 20’s isn’t always a friend group that has any other kids, if OP is one of the first to have one then that’s not a normal thing to bring up. It didn’t become normal for my friends until there were 3 or 4 kids around.",
              "id": 68,
              "comments": [
                {
                  "score": 30,
                  "content": "OP says their core friend group is 17 people, including 3 couples with kids. So it does seem like kids are the exception, not the rule.",
                  "id": 69,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Agreed.\n\nIf I was inviting a friend who had a kid I would specify to them.\n\nBut the parent should have asked anyways.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Naw, I wouldn't expect kids at a party I throw. You know your audience. This dude took advantage",
              "id": 71,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 371,
          "content": "As I read OP’s post, this is what I thought, too!  “You brought a ***toddler*** to a Super Bowl party where adults might be drinking and whooping and hollering, where there are snacks everywhere, and people generally distracted by watching the game…are you **nuts**?!”\n\nEDIT:  some of the replies to my original post were compelling.  All the Super Bowl parties I have ever been to were wildly drunken affairs that there is NO WAY I would bring my kids to.  Some people mentioned their experiences were that Super Bowl parties were more like family barbecues.  \n\nSo, I am changing my judgment to ESH because both OP made assumptions, and could have cleared any confusion with a simple text or phone call BEFORE the event.",
          "id": 72,
          "comments": [
            {
              "score": 301,
              "content": "Regardless of whether or not the OP is an AH this take is....weird? I've been to just as many super bowl parties that children attended as I have been to adults-only ones. Like it's not uncommon to have a super bowl party with children in any way shape or form and calling it \"nuts\" is really bizarre (the one I went to last night had 4 children who sat in the other room watching kids movies and behaving very nicely for example....).",
              "id": 73,
              "comments": [
                {
                  "score": 115,
                  "content": "lol right? There were 3 kids at our “party”. It was hubby, son and I, 2 brothers in law, 2 nieces and my in laws. So scandalous that children were exposed to adults watching football and commercials. Just depends on your season of life. No one is wrong to bring their kids with them as long as they are welcome. It just takes a little communication.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Not to mention....some kids enjoy watching football ? My 3 and 8 yr old watch soccer with me lol.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "It depends entirely on the friends, doesn’t it?  \n\nIf you’re the only married couple with a toddler in tow, but you know everyone else there is single and sans-children, then you bringing your toddler without first clearing with the host that it’s okay is totally unexpected and weird.\n\nWhen my own kids were little, I never presumed they were welcome everywhere that I was invited.  I always asked if the host was down with them coming before I showed up!  \n\nSuper Bowl parties can be family-friendly or decidedly NOT family-friendly events.  It’s never right for parents to suddenly believe that their precious angels are welcome everywhere, and then get their nose out of joint when a host is taken aback that they didn’t get a babysitter.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Super weird take lol\n\nI’ve never been to a Super Bowl party that didn’t have children and it’s never been an issue",
                  "id": 77,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Oddly, I’ve never been to one with kids.",
                      "id": 78,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Exactly. The party we went to yesterday, the kids under 7 outnumbered the adults. ",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Agreed, the one I went to last night had an 18mo & a 9mo and the hosts aren’t parents",
                  "id": 80,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "I remember growing up our Superbowl parties always included kids ranging from infant/toddler to teens.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Seriously, it's laughable because the halftime show has always been judged as being offensive because kids are watching. To me the host sucks because they kicked OP out so they super didn't want kids there. They should have made that clear, it's not that hard.  I wouldn't be friends with someone who has to be informed my kid is coming with me constantly. I always assumed my friends kids were coming with them unless they told me otherwise or I'd say let's plan for this to just be us. I'm not paying for their sitters.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "The only Superbowl event I'd ever even *heard of* before this post that *didn't* have a bunch of children there is the one I attended in college that was hosted by a fraternity.",
                  "id": 83,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "you're making a massive assumption that OP was planning on showing up with his kid and then deciding to immediately stop being a parent. Why is everyone assuming that because they've met a toddler off of SuperNanny, that OP's kid is a total fucking disaster of a toddler and OP won't be *parenting* him?",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I've been to about 40 Super Bowl Parties and almost all of them were big family friendly events.",
              "id": 85,
              "comments": [
                {
                  "score": 4,
                  "content": "Me too. And a child was never seriously injured or intoxicated at any of them. Oh, and the snacks were fine, too 🙄",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "God forbid anyone woops or hollers around a child during a football game... lol.  \n\n\nAnd the snacks! Did Noone think of the snacks?!?!\n\n\nThis take is absurd and so is this entire discussion.  \n\n\nYou can come over to watch the game but only if you find some rando to deal with your kid, i dont want him around my snacks.....   that's a real friend right there lol. ",
              "id": 87,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "I went to dozens of those parties as a kids. Along with countless other children. It was generally assumed that these parties were family events. Yes, some of the parents were drinking. But they did at summer barbecues, too. So what? \n\nWe kids mostly watched the commercials and played our own games.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Huh? I've seen babies, toddlers and young kids at Super Bowl parties many times and it's never been an issue. What is \"nuts\" about that? \n\nOP's friend clearly wanted a kid-free event, and that's fine, but there is nothing about a football watch party that makes it *inherently* anti-kid.",
              "id": 89,
              "comments": [
                {
                  "score": 3,
                  "content": "You’re right!  The host should have clarified with the invitation, but single people without kids don’t always consider that, so it’s on the parents to make sure that kids are welcome.\n\nLiterally a 10 second text could have avoided this whole conflict.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "I guess people have different expectations. We went to a super bowl party yesterday. No mention of kids. My 2 year old was one of 7+ kids there. If you invite someone over who has young kids, id assume the kids are coming, especially it's a daytime event. ",
              "id": 91,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "The super bowl is on a Sunday.  Save for a watch party at a bar, I've rarely been to a SB event where people are getting shit-housed.  The vast majority of us are planning to still go to work on Monday morning and moderating our alcohol consumption accordingly.  I've honestly never been to a super bowl party at someone's home that wasn't a family-friendly event.",
              "id": 92,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 342,
          "content": "If your toddler is causing catastrophic destruction you are not doing your job as a parent. Signed another mom",
          "id": 93,
          "comments": [
            {
              "score": 214,
              "content": "Lol, of course, that’s why I said potential. A baby can be corralled with relative ease, a toddler must be monitored constantly.  I have a two year old whose only speed currently is fast and headlong. I wouldn’t take him to a gathering like this because I wouldn’t get to have any fun.",
              "id": 94,
              "comments": [
                {
                  "score": 10,
                  "content": "This. Keeping them from causing catastrophic destruction is the problem and the fun killer for everyone",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Big difference in mobility between a 15 month old and a 2yo though - my 14 month old wasn't walking yet, just crawling, standing & 'cruising' furniture, by 2yo their default was running at full steam.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yes, but who wants to be at a party with a parent constantly disciplining their kid. Toddlers don't sit still for long.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 286,
          "content": "Thank YOU!! My sister calls her 28 month old a “baby” all the time and it grates on my every nerve (I have 3 also-I’m not childless, but mine are older than her child). I have yet to say anything, but I can feel myself pulling away so I don’t say anything.",
          "id": 98,
          "comments": [
            {
              "score": 184,
              "content": "I wonder how long she'll continue counting the age by months, 36 months? 58 months? 112 months? Where's the line when she's still counting to 28?",
              "id": 99,
              "comments": [
                {
                  "score": 126,
                  "content": "I was like 28 months old, that's 2 years and 4 whole months! Ma'am that is a toddler. When ever my wife and I were around people with small children and you ask them and they say \"Oh little johnny is 32 months old\" as my wife would put it, I would have the WTF roll my eyes face! Kind person just round it up and say they are 3!!!",
                  "id": 100,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I feel like months should only count over 1 or under 2 but that's just my opinion.",
                      "id": 101,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I mean, I’ll be celebrating my 541st month birthday in a few days.",
                  "id": 102,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Mine is 19 months and I'm really awkward when people ask. Should I round it? I'm looking forward to when he's two and I can leave the months behind.",
                  "id": 103,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "28 is A LOT.  This is where we simply our fractions, people.  \n\n28/12  = 2 years and 4 months.  \n\nRounding is also great.  So like 2.5ish.  Or just 2.",
              "id": 104,
              "comments": [
                {
                  "score": 3,
                  "content": "2 and a third",
                  "id": 105,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Please stop counting  a two year old’s age in months now.",
              "id": 106,
              "comments": [
                {
                  "score": 3,
                  "content": "I’m not the one counting my niece’s age in months. My sister is, because she still thinks she’s a baby.",
                  "id": 107,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 235,
          "content": "An “adult party” is very different than a Super Bowl party. \n\nSigned, a person with critical thinking skills.",
          "id": 108,
          "comments": [
            {
              "score": 92,
              "content": "It would depend. Is the host child free, or do they have kids themselves?",
              "id": 109,
              "comments": [
                {
                  "score": 167,
                  "content": "I'm child free but if I didn't want a couple to bring their young toddler, I sure as hell would make that clear.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yea same tbh 😅 ig my family is a different case bc no one drinks and most Pakistanis don’t really have a concept of “baby proofing” but for my family stuff or even events w my former coworkers, kids are always welcome (sometimes for space issues, it’s specified no kids for the latter but generally it’s implied they’re welcome)\n\nBut yea, I plan on remaining child free as well but if I were hosting something that kids were not welcome at, I would defo specify that w everyone invited. Ig it’s good for guests w kids to ask too if kids are welcome but personally I feel it’s on the host to specify",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Exactly….if it was an important enough issue to have an argument over, it was important enough to make specifically clear.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Doesn't matter. If you're extending an invitation to a family with kids, you expect the whole family to show up. Don't want the kid? Then you need to specify the event is adults only. And be prepared for them not to come, because new parents can't afford sitters all that often, especially on Super Bowl Sunday, when their go-to folks (grandparents, aunts and uncles, other members of the friend group) have their own plans",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Not everyone who’s child-free is into ragers or heavy smoking and drinking parties.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "100% what are people doing at these Super Bowl parties??? You drink a little, snack a lot, and watch the game.",
              "id": 115,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 173,
          "content": "In a house that will not be baby proof if the host is childless. Idk when you’re invited to a party and the host doesn’t have kids of their own, it sounds like a basic politeness to double check if you can bring your child, because the presence of a kid, especially a young one, will change the dynamic",
          "id": 116,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6428,
      "content": "ESH. He should have been clear about kids or no kids, and you should have asked for clarification. Especially in your 20s, when likely a smaller percentage of the group has kids.\n\nMost Super Bowl parties I’ve been to in my 30s are family friendly, and tbh if they were not, I’d expect that to be stated upfront. We are all in our 40s now. I do not have kids but just assume others will bring their kids to any gathering we have unless otherwise specified. Two couples are child free and all the others have kids, so it’s not practical to not invite them, the way it might have been fifteen years ago.",
      "id": 117,
      "comments": [
        {
          "score": 1222,
          "content": "I think it depends on your social circle. I'm nearly 50, and in all my friend groups in all my years, I think I've been to maybe two Superbowl parties that had kids at them.",
          "id": 118,
          "comments": [
            {
              "score": 210,
              "content": "Oh absolutely. I think it very much depends on your social circle and their overall approach to family friendly gatherings. In the group I’m referencing, when people get together at someone’s house, that’s generally code for feel free to bring the kids (my house is the exception for various reasons). Same with stuff like baseball games or orchestra concerts now that the kids are old enough to really enjoy them. Dinners out, non-classical music concerts, and weekend trips are adults only.",
              "id": 119,
              "comments": [
                {
                  "score": 14,
                  "content": ">think it very much depends on your social circle\n\nSame! \n\nHonestly, I'm kind of the opposite with these things than some people. I just assumed my kid isn't welcome unless said otherwise because I don't want people upset at me lol. I'm not pushy when it comes to bringing my kid or anything like that, but I'm super lucky that literally all of my friends adore my kid, show up without him. Or if I ask they act surprised that he's not there or that I think he's not invited lol Even when it comes to wedding's, birthday parties etc they always answer \" why wouldn't he be invited?\" \n\nTo add to this, only me anv one other have a kid.",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Agree.  I'm 40s, but superbowl parties are not kid friendly with my friends.  It's like taking a kid to a bar",
              "id": 121,
              "comments": [
                {
                  "score": 3,
                  "content": "Kids are always at our Superbowl party, but most of our circle has kids all around the same age who have known each other their whole lives and are teenagers now. So while there are \"kids\" around they're all 13-15 and do their own thing. There is one younger kid and he kept farting on people last night and it was quite annoying, eventually my wife yelled \"if you don't fuckin stop farting on people I'm gonna fuckin fart on you\" and since kids fear my wife like the wrath of Zeus he stopped. My son was like \"I told you she was getting mad at you\" lol.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Definitely depends on social circles.  All of the Super Bowl parties I’ve attended included kids once we all started having children. It’s been that way for close to twenty years.",
              "id": 123,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I’m also nearly 50, and any Super Bowl party that I’ve been to that was held in someone’s home, kids were welcome. Including the one I went to yesterday. I agree that it depends on your social circle.",
              "id": 124,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "And on the flip I've never been to a Super Bowl party w out kids there! My family and friends circle consists mostly of ppl w kids. Now if this was a friend who didn't have kids, and the other ppl that were going were like oh yeah we got a baby sitter , then I would've assumed NOT to bring my kid.",
              "id": 125,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 866,
          "content": "I don't get why this is a hill for some people to die on.\n\nSimple text, \"Kids allowed or no?\"\n\nDef ESH. If it was so important to the host that they had an argument with their guest about it, they should have said not kid friendly.",
          "id": 126,
          "comments": [
            {
              "score": 480,
              "content": "Just as simple: “adults only”.\n\nWhen you invite a family with kids somewhere, it is on you to specify if you only want to invite part of the family. Especially for events that are quite often family activities.",
              "id": 127,
              "comments": [
                {
                  "score": 226,
                  "content": "Disagree completely, especially if everyone is in their twenties and you’re one of the few people who has a child\n\nAs someone in their early 30s in a major urban area, every super bowl party I’ve been to in the last 5 years has been *very* not family friendly (gambling, heavy drinking, often even open cocaine use)\n\nAs someone else mentioned earlier in the thread, this varies a lot from one social circle to another, and if you’re the only one your age with kids, you can’t expect anyone to say “no kids” when half of them haven’t even seen a child at a party in ten years",
                  "id": 128,
                  "comments": [
                    {
                      "score": 142,
                      "content": ">half of them haven’t even seen a child at a party in ten years\n\nYou mean since they were children? At parties?",
                      "id": 129,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "I don’t have kids, but I know the kind of parties I host, I think it’s polite to let my parent friends know when it’s adult only aka “we’re gonna be drinking a lot, get a sitter or I’ll just see you next time” \n\nOther times, sure we’ll be in the yard, BbQ, kids are welcome to run around. \n\nAs a host I like to set the expectations, but I also have equally polite friends who would never assume their kid is automatically invited just bc they are",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "Yeah, I’m curious how the invite was phrased. If it was like “do you guys want to come over for the Super Bowl” I would probably assume that meant the whole family. If it was “do you and husband want to come over” I would assume the kids weren’t included and would definitely clarify before bringing them.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I mean, my husband and I have been together for nearly 20 years, and if I get invited to a party, I still clarify whether he is invited (even though he always is). Because you don’t assume an invitation and/or invite people to other peoples’ parties without the host okaying it. That includes children and spouses. It just seems like basic manners to me.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 203,
          "content": "Every single friend I have that has kids will always ALWAYS ask \"is it okay if I bring my kid with me?\" when I'm hosting. Most of the time I say yes, unless there's some safety reason.",
          "id": 133,
          "comments": [
            {
              "score": 32,
              "content": "For every group of friends where people with kids always ask if they are welcome, there is a group of friends where it is assumed to be okay. It seems this group hasn't established their norm yet.\n\nThe real problem to me is the fact that this turned into a big argument. It was a simple misunderstanding, I don't know how friends can get into a huge argument for something like this.",
              "id": 134,
              "comments": [
                {
                  "score": 30,
                  "content": ">I don't know how friends can get into a huge argument for something like this.\n\nAt the end of the day the host didn't want there to be a toddler running around, and OP should have respected that decision and left. The proper response from OP would be \"that sucks but I get it, I'll see you later\".\n\nBut you and I both know OP didn't do that. They stood there and fought their friend because in their mind the kid should have been allowed at the event. OP assumed kids were okay (without checking first), and then OP acted angry when their assumption was incorrect they acted up because they felt entitled to stay at the event with their child.",
                  "id": 135,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 179,
          "content": "Agreed. We got invited to a SB party. The host has 4 kids ages 13-5. I still asked if our 2yo could attend.",
          "id": 136,
          "comments": [
            {
              "score": 22,
              "content": "I agree. There’s a big difference between a 5 year old and a 15 month old.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "My daughter is 14, and I still ask.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Exactly. You don’t want to be one of those parents who show up with a kid when the host wasn’t expecting it. Usually a host will allow it because they don’t want to ruin the gathering for anyone. But it makes you a bad guest. \n\nAsking clears everything up!",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "This is basically my experience as well. I agree with your conclusions.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "Definitely something that would've been easily avoided with a simple text to clarify instead of assuming. I'm more curious how it turned into an argument.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Another factor is does the host have kids. If they do, I’d assume kids are welcome unless they’ve stated it’s adults only.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "We are in our early 40s, no kids. Some of our friends have kids, some don’t.\n\nWe hosted a party for the conference championships with friends and neighbors. We made it clear to people with kids, in a nice way, that it was a party for grownups. Our house is not really kid proof, we have 2 medium to large dogs, everyone was drinking, and the main tv room is down a flight of stairs. I did invite one person who is a breastfeeding mom with a 5 month old baby and we discussed that the baby was welcome but that it wasn’t a great scene for her other young kiddos.\n\nIn the end, one parent came kidless, mom and baby couldn’t make it, nobody’s feelings or children were hurt and no misunderstandings happened.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "It really depends. 30’s in like NYC is very different from 30’s in Utah. Just like etiquette varies city to city. USA is huge and kinda hard to make a judgement without cultural context.",
          "id": 144,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4432,
      "content": "YTA\n\nI think as a parent it’s your responsibility to ask if your child is welcome, especially when the child is a baby. \n\nA Super Bowl party is likely an event with open alcohol and loud noise (cheering and shit). These don’t seem like baby-friendly events. \n\nI think this is on you for assuming everyone wants to be around a baby while at a party.",
      "id": 145,
      "comments": [
        {
          "score": 1038,
          "content": "As a host, it’s the friend’s responsibility to communicate his expectations and rules of his home and party.",
          "id": 146,
          "comments": [
            {
              "score": 1249,
              "content": "If you bring any additional guest to an event, it is always correct to ask first.  If I was expected someone to bring their entire family, I would say \"Hey OP you all should come to my event.\"  If the text says, \"Hey OP, you should come to this event\"! OP should say, \"Great, can I bring my wife and child?\"  \n\nEven if the expected response is of course, it's always correct to ask for situations like this.",
              "id": 147,
              "comments": [
                {
                  "score": 649,
                  "content": "If a guys sends a text and says “You guys are invited to my Super Bowl party” anyone with a family would assume that’s their whole family. Since we don’t know how the hosts asked, we can’t decide if names were listed",
                  "id": 148,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 330,
                  "content": "So then OP should ask if he can bring his wife?\n\nETA: if you’re a host and your guests have to ask a bunch of questions about your party then your invitation clearly sucks and lacks communication.",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 171,
                  "content": "Lol bringing your kid isn't bringing an additional guest unless it's a formal invite with an RSVP (like a wedding.)",
                  "id": 150,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 133,
              "content": "I'd be interested to know how the invite was phrased.\n\n\"OP, do you and [partners name] wanna come over to watch the game? We're throwing a party\"\n\nOr\n\n\"OP, do you guys wanna come over to watch the game? We're having a party?\"\n\nA) is clearly excluding the toddler, B) isn't.",
              "id": 151,
              "comments": [
                {
                  "score": 48,
                  "content": "Honestly I wouldn't say A is clearly excluding the infant necessarily. It depends on context and I'd think OP would probably want to clarify after receiving invite A, whereas invite B seems to imply the toddler is invited.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 27,
                      "content": "honestly i wouldn't say most people neurotically analyze invitations and try to decode all of the tricky semantics in order to get to the bottom of the truly implied meaning according to the wording. \n\ni swear to god a lot of people on here acting like they're doing brain surgery 24/7.",
                      "id": 153,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "It's on both, from what we know.\n\nIf the host was adamant enough about no kids being there that he is willing to argue and send his guest home, he should have been clear.\n\nBut the OP not clarifying is still a mistake on their part.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "This.  I'm not a damn mind reader and my friends are actually my friends so they know I have kids.  If their intent is guys night or something we make it known.  If not, I do tend to ask and its usually a \"hell yea the whole family is invited\"",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I wonder if it was a day-of invitation. If so, how would OP have found a sitter? And if it was ahead of time, OP shoukdve asked if kids were ok or not. I assume and Super Bowl party with people in their 20s is drinking, cheering, loud yelling, and everyone focused on the food and game, not kids in the area",
              "id": 156,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 165,
          "content": "Eh, if someone sends me a personal invite they should take the extra step to clarify it’s adults only. In my opinion it’s the same as inviting me but not my partner and expecting me to know that. We are a unit now, and the invited should be specific.",
          "id": 157,
          "comments": [
            {
              "score": 100,
              "content": "As a childless person, I 100% agree. I have friends with kid's and I look at them as a package deal, a family unit, to not look at them that way, would I even be a good friend? No, no at all.   But then again, these people are in the their 20's and haven't matured to that level yet.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 107,
          "content": ">I think as a parent it’s your responsibility to ask if your child is welcome, especially when the child is a baby.\n\nIf you invite someone to an event, knowing they have a young, dependent child, it's 100% on you to communicate to them that the invite is not inclusive of their child. People aren't mind readers. You know what their circumstances are, they don't inherently know that you have an expectation of them to adjust to your parameters if you don't tell them what they are.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "It’s not a baby it’s a toddler. 15 month olds are walking and talking and require much more work and close watching than a newborn.",
          "id": 160,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Yeah agreed.  I went to a superbowl party, mine are middle school but I asked ahead of time to be sure.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1449,
      "content": "INFO\n\nHow did the argument go down?",
      "id": 162,
      "comments": [
        {
          "score": 1205,
          "content": "Also…\n\nINFO: are parties with this friend usually family friendly?\n\nSuper Bowl party’s can go a lot of different directions and it’s not always family friendly.  When I host, kids are welcome 9 times out of 10, so if it’s an adult only affair, I make sure to specify that.",
          "id": 163,
          "comments": [
            {
              "score": 539,
              "content": "I have never been to a Super Bowl party with kids. ",
              "id": 164,
              "comments": [
                {
                  "score": 575,
                  "content": "Do you have any friends groups or a big family with kids? Because if you don’t, that’s the reason why. The Super Bowl is known as a family event. Even by the nfl and about every damn food commercial the week leading up to it lol.",
                  "id": 165,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I used to work in the inpatient pharmacy of a Children's Hospital. The number of patients went WAYYYY down over Christmas because even the very, very ill kids often went home to be with family for Christmas if it was at all possible. The number of patients would go back up for January and then drop again the beginning of February. Every year. No one else ever seemed fazed, but every year I would marvel that patient numbers dropped for the Super Bowl the same way they did for Christmas. So I agree with you that the Super Bowl is a family event, absolutely.",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 339,
                  "content": "I love hearing about other people's experiences. I've never been to a Super Bowl part that didn't have at least 2 kids, usually decked out in team gear. Now I'm curious what one without kids would look like.",
                  "id": 167,
                  "comments": [
                    {
                      "score": 85,
                      "content": "Lots of shots, loootttts of shots.",
                      "id": 168,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Like a college house party lol.",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "This is kind of wild to me that you’ve never been to one! Now that I’m in my 30s, I’ve been to super bowl parties with kids, but in college or my early and mid 20s there were never kids around. But none of my friends had kids until their very late 20s, early 30s. Different friend groups, different experiences for sure! ",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 159,
                  "content": "I've never been to a Super Bowl party without kids. The normal host has 4 kids",
                  "id": 171,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 101,
                  "content": "And I’ve never been to a Super Bowl party without kids. I just think it has to do with the circle of friends and if everybody has kids or not. I myself do not, but I don’t mind kids. But I would not bring mine without asking.",
                  "id": 172,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 87,
                  "content": "I have not been to a super bowl party *since* I was a kid, if that changes your perspective at all.",
                  "id": 173,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 68,
                  "content": "I have never been to a superbowl party WITHOUT kids.\n\nClarity matters. The host should make the parameters clear in the invite.",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": "I have never been to a Super Bowl party without kids",
                  "id": 175,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 26,
                  "content": "I loved super bowl parties as a kid. We literally went to every single one from when I was probably 6-13.",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "I have never been to one that didn't have kids",
                  "id": 177,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Possibly they are the only ones who have a kid in their group of friends, though.",
                      "id": 178,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Conversely, I’ve never been to one without kids. Social circles are interesting that way— I love seeing the differences.",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "That and do they have the same definition of “family friendly”? There are plenty of folk who have no problem leaving open alcoholic drinks on coffee tables and would still call the gathering family friendly, while other people aren’t comfortable drinking an adult beverage with kids present at all.",
              "id": 180,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 371,
          "content": "Took me in another room and asked me to leave and told me I was an asshole for bringing my kid.  Thats the gist of it.",
          "id": 181,
          "comments": [
            {
              "score": 688,
              "content": "> Took me in another room and asked me to leave and told me I was an asshole for bringing my kid. Thats the gist of it.\n\nHonestly, that sounds harsh as hell for a friend to approach you that way.",
              "id": 182,
              "comments": [
                {
                  "score": 426,
                  "content": "My own assumption, of course, but I’m going to say that this was an interpretation rather than something stated verbatim.\n\nMaybe the friend was like, “Why’d you bring your kid? No one here has their kids and there’s alcohol and stuff,” and OP surmised that the friend was implying they were an AH.",
                  "id": 183,
                  "comments": [
                    {
                      "score": 122,
                      "content": "The friend told him to leave. I don’t think you can get more clear than that.",
                      "id": 184,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 78,
                      "content": "> Maybe the friend was like, “Why’d you bring your kid? No one here has their kids and there’s alcohol and stuff,” and OP surmised that the friend was implying they were an AH.\n\nElsewhere, OP indicated they were the first guest to arrive, and that their friend pulled them aside (not sure why, if they were the only guest there at that point), told them off, and then OP left the house.",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "Right?! I’d be annoyed but I wouldn’t get mad at my friend.",
                  "id": 186,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Doesn’t sound like they’re going to be friends now.",
                      "id": 187,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Yeah I’m wondering if the friend actually outright said “you’re an asshole for bringing your kid” or if that’s just their interpretation. Cause that would be a bit much",
                  "id": 188,
                  "comments": [
                    {
                      "score": 18,
                      "content": "It doesn’t really seem like a realistic situation to me, either. “You’re an asshole for bringing your kid, get out.” \n\nI mean it’s possible but it seems more likely that it was something like “you brought your kid? Sorry man but everyone is going to be drinking and smoking, your kid can’t be here running around” and then OP pushed back and maybe things got a little tense.",
                      "id": 189,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Ex-friend",
                  "id": 190,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 193,
              "content": "How does that turn into an argument, unless you pushed back and demanded to stay with your baby? \n\n\nI'd think most normal people's reaction to being told that showing up with a baby to a party that wasn't child friendly would be along the lines of \"Sorry man! I didn't realize that you wouldn't have wanted a fussy toddler, toddling around while you're trying to watch the game. Obviously I shouldn't have brought them, I'll get out of your hair\". The only way it turns into an argument is if you decided to be a d*ck about it.",
              "id": 191,
              "comments": [
                {
                  "score": 22,
                  "content": "It could turn into an argument if OP said they didn't realize the kid wasn't welcome and the host called him an asshole for it -- which is what OP described. \n\nIf someone calls me an asshole over a simple miscommunication I'm going to have some less-than-pleasant thoughts to share with them.",
                  "id": 192,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Agreed. Sure, both had a miscomm about informing as host, and verifying as guest, but when you're in their house and the host isn't happy with someone you brought along with you, I would think the proper reaction would be the above, quick apology or just explain you thought it was a fam-friendly affair, then leave as requested, not argue back and double down. \n\nOP's the AH not for mistakenly bringing the toddler along, but for escalating to an argument.",
                  "id": 193,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "[deleted]",
              "id": 194,
              "comments": [
                {
                  "score": 11,
                  "content": "I assume to have the conversation out of mom and baby’s earshot.",
                  "id": 195,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 40,
              "content": "How did you respond?",
              "id": 196,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "Still sounds weird. \nLike, were you letting your kid run wild, or asking for a kid’s area, or asking people to be quiet or something? \n\nI’d let a kid hang out if the parents were watching them and not bothering others.  Maybe the guy didn’t really want kids there (which I suppose is fair), but I feel like most people would just eye roll and let the kid be there if the parents are handling it.",
              "id": 197,
              "comments": [
                {
                  "score": 6,
                  "content": "Agreed, I want to know this answer. ",
                  "id": 198,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "This sort of sounds like missing missing reasons OP. I find it hard to believe that a friend would pull you aside and kick you out so crudely without them feeling like they had to be so crude for you to get the message. I myself have had to be similarly blunt after a select few friends & family members have played dumb to previous conversations around social etiquette and expectations (esp around children and alcohol/drugs). Have you brought your toddler to events before without asking? Are you the only person in your peer group that has a young child?",
              "id": 199,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "How is that an argument?",
              "id": 200,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Does he like, not KNOW you have a kid?",
              "id": 201,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 118,
          "content": "I’d also like to know if OP is the only person invited with a kid.",
          "id": 202,
          "comments": [
            {
              "score": 170,
              "content": "Our friend group has 3 couples with kids.  I was the first to arrive and then left before anyone else showed.  I don't know if they went.  The core friend group is 17 people.",
              "id": 203,
              "comments": [
                {
                  "score": 220,
                  "content": "I'd love it if you'd ask them if they brought their kids, if so what happened, were they told no kids... Might give you some insights.\n\nI think NTA, simply because your friend seemed aggressive about it when it wasn't that serious. \"Hey I didn't specify but I wanted this adults only.\" \"OK no problem, we will head home\" done.",
                  "id": 204,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 137,
                  "content": "I always assume kids will be coming to a party that doesn’t specify no kids. Especially the Super Bowl which was always treated as a family event.",
                  "id": 205,
                  "comments": [
                    {
                      "score": 58,
                      "content": "[deleted]",
                      "id": 206,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "I’d ask for a late night party. I wouldn’t ask for a Sunday afternoon get-together. ",
                      "id": 207,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 43,
                  "content": "What did the invite say? Was it generic like \"you and the family\" or did it name you and your wife?",
                  "id": 208,
                  "comments": [
                    {
                      "score": 40,
                      "content": "I THINK they said it was on a group text thread and didn't mention no kids. but could be wrong.",
                      "id": 209,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "This clears some things up for me because if there are 17 of you and only 3 couples with kids, the other friend group members without children are the majority and perhaps not yet adjusted to y’all having children. \n\nI’m assuming the host doesn’t have children, so remember they don’t live with kids every day and probably forgot to mention that in the invite (since it’s not on their mind). It’s a failure on their part to not mention it, but considering the kid-having parents are the minority, I think it was a failure on your part to not clarify as well. I wouldn’t have assumed I can bring my kids (or that the environment would be kid friendly) in that kind of group. \n\nHitting that age where some people become parents and some don’t (or just haven’t yet) can totally split up a friend group because not everyone is on board with having kids around.\n\nEdit: spelling",
                  "id": 210,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "The age of these other kids is an important detail I suspect.",
                  "id": 211,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "I feel like you should put that there are kids in your group in the post- tons of people are assuming that because you’re in your 20s, kids might not be the norm yet. Since this a specific group with kids- do you all normally take your kids places or no? I think the precedent / norm for your group matters but in general think Super Bowl parties are assumed as kid friendly",
                  "id": 212,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Right? Assuming OP wasn’t complaining about things not being childproofed, or people swearing/drinking, or letting his kid run wild, or demanding people be quiet so the kid isn’t disturbed, I don’t see an argument developing.\n\nLike, yeah, maybe it’s weird being the only one with a kid there, or maybe the host feels obligated to do something for the kid when he’s there, but I don’t quite understand how it becomes a “we’re leaving” kind of disagreement.",
          "id": 213,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1345,
      "content": "NTA. I don't understand why everyone says super bowl parties are inherently not family events. Sure, that can be kid-unfriendly, but every super bowl party we've hosted has had yelling, alcohol, and kids. It's not like everyone is drunk and throwing fists.",
      "id": 214,
      "comments": [
        {
          "score": 716,
          "content": "Yeah most people I know really don't PARTY party like that for the Super Bowl. A bit of beer and yelling at the tv? Sure. But like....a lot of kids grow up with that every football Sunday. A Super Bowl party is not an INHERENTLY kid-unfriendly event. If the host doesn't want kids there, that's fine, but I'm confused by all the comments insisting that anyone who brings a kid to a Super Bowl party is like bringing them to a frat party lol.",
          "id": 215,
          "comments": [
            {
              "score": 391,
              "content": "right... it's a Sunday night before most people have to work on Monday... I've never been to a Super Bowl party that's like a hardcore party where kids shouldn't be. \n\nEat snacks, drink beer, watch the game, watch the commercials. Nothing wrong with not wanting kids there but communicate that....",
              "id": 216,
              "comments": [
                {
                  "score": 157,
                  "content": "[deleted]",
                  "id": 217,
                  "comments": [
                    {
                      "score": 6,
                      "content": "This is the biggest reason why I’d assume kids are allowed! I don’t even have kids and the first person in my friend group just had a baby. \n\nProbably both should’ve specified, but it seems like common sense to assume your friend can’t get a babysitter on what is essentially an American holiday.\n\nI’d also heavily prefer no kids at parties. But Super Bowl parties are never ragers- they’re on Sundays and typically end early, like OP said. Family friendly seems like a reasonable assumption.",
                      "id": 218,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 153,
                  "content": "And, on the West Coast it starts at 3:30 pm.  Even more family friendly.",
                  "id": 219,
                  "comments": [
                    {
                      "score": 3,
                      "content": "East coast, I’d get it, the party starts after dinner, goes until 10 at the earliest, well past bed times.",
                      "id": 220,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "Also, while I don't expect people without kids to think about this, I can't imagine finding and then paying for a babysitter on Super Bowl Sunday.",
                  "id": 221,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "There was a whole post on making the Monday after the SB a company holiday in one of the HR subreddits. Your view was my view, too. If you’re getting so sloshed during a game, you need help, not a day off ",
                  "id": 222,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Sunday evening is definitely NOT my preferred time to party in a \"not kid friendly\" manner.  That damn overtime kept me up past my bedtime!  LOL",
                  "id": 223,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I was already in bed and my mom texted me \"Chief's won,\" lol. \n\nWe didn't get to watch the game because I don't have normal tv, just streaming, and we thought we found it for free. But turns out we just found a stream of some commenters watching the Super Bowl and saying what happened.... 🤦‍♀️",
                      "id": 224,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 170,
          "content": "It’s bc most of the sub is like 20 years old with no life experience.",
          "id": 225,
          "comments": [
            {
              "score": 118,
              "content": "Yeah, again, this is an example of me being extremely confused by the top responses. What kind of host doesn’t clarify that some of your family isn’t invited when they invite you. It’s not like we are talking about a dog.",
              "id": 226,
              "comments": [
                {
                  "score": 45,
                  "content": "If you don’t want kids at your casual not-inherently-adult social gathering, don’t invite people with kids to your casual not-inherently-adult social gathering!",
                  "id": 227,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "I see other posts seriously making this dog to child comparison 🙄... Honestly people get more upset when we don't bring my 2 year old, and my friends are mostly child-free.",
                  "id": 228,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Wait really!? Gahahaha there should really be a minimum age requirement to Reddit. It’s so wild to me how much people have decided that they get to just assume society is supposed to be childfree. What do you think happens to all these children who grow up unsocialized? Like the top comment is a lady saying she has four kids, and toddlers should absolutely not go places because they are destructive???? I’m like holy cow. What a crazy level of nonparenting. I’m one of four, we were all expected to go to people’s homes and behave. It’s not that complicated. Watch your kid. Parent your kid. And bring activities for them.",
                      "id": 229,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 145,
          "content": "I grew up where all Super Bowl parties had kids",
          "id": 230,
          "comments": [
            {
              "score": 5,
              "content": "Same. Lol",
              "id": 231,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Maybe Reddit being Reddit again? People skewing younger who don’t have families of their own or know people with families of their own? \n\nEvery Super Bowl party I’ve ever been to has had children.  It’s definitely not a ‘kids’s party’ but kids can be welcomed if they behave.",
          "id": 232,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "It’s because Reddit - and especially this sub - just hates kids in general.",
          "id": 233,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "This 100%\n\nI mean I probably would have asked beforehand, but whatever. Doesn’t seem like OP brought the kid there to parade it around and/or even ask for help. Unless there were hookers and blow involved where kids really wouldn’t be welcome, I really don’t see the big deal. We were one of the first in our friend group to have kids and we always tried to make sure something like this was cool, but our friends thought we were crazy to not assume that it was a package deal. We would pack food, and be responsible parents.\n\nI do t understand all the YTA comments. Probably people that either want to get away from their kids or those that don’t have any.",
          "id": 234,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "In my 20s we didn't have kids at any Super Bowl parties.  In my 30s we had kids at every Super Bowl party.  Depends on the stages of life I think.",
          "id": 235,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "This year a friend of mine had his guy, friends and their wives and children and stuff over and put on the Nickelodeon broadcast so everyone could understand and enjoy it together. And apparently it was a very good time.",
          "id": 236,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Super Bowl parties are like the most family event that revolves around a decent amount of drinking possible. Maybe other than weddings. ",
          "id": 237,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 920,
      "content": "YTA. You never assume your children are invited anywhere. You always ask. People are saying that the host should have told you directly that kids aren’t invited, but the absence of information is not an excuse for making assumptions. If your child isn’t explicitly mentioned on the invitation, you call the host and ask if they can come.",
      "id": 238,
      "comments": [
        {
          "score": 604,
          "content": "If you're inviting someone with kids and it's a general invite; of course they're going to assume the kids are invited. Children aren't inherently poison. If you don't want kids somewhere you have to let people know it's adults only.",
          "id": 239,
          "comments": [
            {
              "score": 367,
              "content": "This must be a regional or cultural thing. People are confidently answering in both directions lol. It might also be an age thing. Maybe people in their early 20s are in the “don’t assume your kids are invited” camp bc only one of their friends has kids so far. And people in their 30s+ are more likely to assume kids are welcome, because most of their friends have kids now and they are more a part of life? ",
              "id": 240,
              "comments": [
                {
                  "score": 80,
                  "content": "To me, it depends on the event.  My friend group ranges from mid 30s to mid 40s.  \n\nLots of my friends have kids, but there are still plenty of us who don't.  \n\nUsually its kind of clear based on who is having the event whether kids are or aren't invited.  A family with kids sends an invite, its probably a safe assumption that kids are invited.   People with no kids, its usually a safe assumption that kids aren't invited.  Whenever I host people and kids are welcome, I make sure to say that.  But I think most people make the assumption that, since I don't have them, its not a kid friendly event.\n\nIf I send a text to just the guys about coming over for football, none of them assume their 3 year old is included in that.",
                  "id": 241,
                  "comments": [
                    {
                      "score": 24,
                      "content": "BUT OP’s wife was invited, so it definitely wasn’t just a guys’ night",
                      "id": 242,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I'm in my 40s, my kids are teenagers/adults, and I always asked before bringing them to anything. I never assumed, at any age, that kids were invited to a party.",
                  "id": 243,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "I think the smart thing to do is to always check, just to be sure, and to check especially when the host doesn’t have kids. A host who doesn’t have children, doesn’t have children in his/her focus and most likely doesn’t have a child safe home. If you want your child to survive infancy, a good start is to always make sure it’s likely they’ll survive the day. It’s not about being an asshole or not, but more about making sure you’re bringing your child into a safe situation, which is the parent’s responsibility imo.\n\nNAH. Just another case of miscommunication, or rather lack of communication.",
                  "id": 244,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "To me it depends on the nature of the house being visited. Within my various friend groups (mostly late 30s/early 40s and about 2/1 kids/no kids), if the person hosting has no kids, we assume kids aren’t invited unless they are specifically mentioned as being invited. At houses with kids, the kids are assumed as being invited unless it is specified that it is an adult only event. ",
                  "id": 245,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I don’t have kids and most of my friends don’t (early 30s). But I agree it’s generally assumed kids (and partners) are invited, lol how are people saying “you have to ask” for any invite?? Children are not dogs lol. if I invited the one or two friends who do have kids to my house for something like a Super Bowl party, I’m going to assume they bring their kids (even though kids is definitely not the norm in my circle) unless I say otherwise",
                  "id": 246,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "OP said they're late 20s, so that would put them smack dab in the middle. So if this is the case it makes sense that it would be up in the air I suppose.",
                  "id": 247,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 105,
          "content": "It’s always the hosts responsibility to communicate rules and expectations of their home and party. Not the other way around.",
          "id": 248,
          "comments": [
            {
              "score": 3,
              "content": "That's insane.  How many times have you told party guests not to shit on the floor?  There is a huge list of social etiquette that is assumed and does not need to be expressed.",
              "id": 249,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 80,
          "content": "This is so case-by-case because I’ve never invited someone with kids and assumed they wouldn’t bring them? Just like weddings have to be marked as “child free.” Especially in my friend group, I’d assume I could bring my daughter because they know if I can’t there’s no way I’d be coming. If it’s someone I haven’t seen in a while I might say “you know I’m bringing X right?” but definitely not with a regular friend. Especially not if both my husband and I are invited.",
          "id": 250,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Yea I get it. But host knew he had a child and should hsve offered a heads up that kids weren't to come.",
          "id": 251,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "This is the dumbest take I've ever heard. It is on the host to communicate this information. Could he have asked, sure. But if you invite someone with kids it's on you to specify if the whole family is welcome or not.",
          "id": 252,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Kids are not pets, you can’t just leave them alone in the house or in a kennel.\n\nIf your friends are parents, that’s their family identity.  They think through everything as kids are a part of who they are.",
          "id": 253,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Don’t even ask. Just don’t bring your kids to any grown up’s party.",
          "id": 254,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 781,
      "content": "Who tf are these people who think a Super Bowl party is naturally a child-free event? How tf did any of you develop a love for football as children? I have literally never been to a Super Bowl party in almost 50 years that excluded kids. \n\nOne disclaimer though… if I got invited to a child-free friend’s place who historically has never had kids at any parties, and it was a booze/drug fest, well I just naturally know not to bring my kids. \n\nSo unless it’s the latter kinda sitch, NTA",
      "id": 255,
      "comments": [
        {
          "score": 119,
          "content": "All my superbowl parties till date have been kid/ family friendly ones. That being said, my various friend circles have always been people who are drug free,  do not smoke inside the house and while we do have alcohol no one ever gets crazy drunk. we generally have it at the homes of people who have bigger homes or apartments so that if kids are noisy they can move to a different room and the parents are the ones who are responsible to keep their younger kids company (if the kids are very small) if need be. So at this point, I think it is a NTA unless the OP knew that the party wouldn't be kid friendly. It's okay to make it a child free event but the host should have been specific about it.",
          "id": 256,
          "comments": [
            {
              "score": 45,
              "content": "Right. Sounds like overall he had no reason to think it was a no kid zone.",
              "id": 257,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 71,
          "content": "It’s really strange. Growing up there were kids at these events for myself and most ppl i knew. Football is life lmao. We are the only couple of a 12 month old amongst a friend group of 15 (30-40s) with NO other kids and they always assume that our child will be there if it’s a group event like a football game bc they can’t be left alone and especially if my husband and i are both invited. We only ask our babysitter for things that require a child to behave like the theater and expensive restaurant. Screaming and drinking ? Lol toddlers are basically tiny drunk adults 🤣 it’s my responsibility to watch for my kid. \nPeople seem to think this event is akin to high end restaurant honestly.\n\nEdit: NTA\nIf these are your FRIENDS there usually is a precedence established. And if they didn’t specify not to bring the kid THIS time, then why would they assume you’d leave them ?",
          "id": 258,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "I'd also like to point out that some of the assumptions in the top comments make it seem like some of them just don't know what they're talking about either. \"you said baby but you meant TODDLER, a baby will just be held and be chill and do nothing!!\" Suuuuuuure, every infant is just sits in the corner quiet for 5-6 hours without a single peep or distraction....",
          "id": 259,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 14,
          "content": ">Who tf are these people who think a Super Bowl party is naturally a child-free event\n\nEspecially when you're inviting both the mother and father??? What a weird assumption.",
          "id": 260,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "This was the best response. I remember watching the Cowboys in the 90s as a kid and have been suffering ever since. I was at a party last night with kids ranging from 5 to 16. They were all into the game and loved the halftime show.",
          "id": 261,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Obviously they will develop a love for the sport when they are alone at their room browsing tiktok at 13 while their parents attend SB parties\n\n/s",
          "id": 262,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yeah honestly most sports-related parties or gatherings of any kind I've been to where someone has kids, they're typically welcome because most people there remember when they were kids and their parents got them into football or hockey or what-have-you. I'd say this one is a solid NAH tho.",
          "id": 263,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I don't know anything about football, yesterday was maybe the second game I've ever watched in my life, I still went to a super bowl party.",
          "id": 264,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 754,
      "content": "I’m going with NAH. I’ve never been to a superbowl party that did not include kids. Case in point, the one we were just at yesterday had 7 kids there. Two of them were newborns. Plus our host broke out the margarita machine so fun for the parents too! Lol.\n\nIt’s not the same as going to a bar or having a guys night out so in this case I think it’s on the host to inform people if children are included or not. He dropped the ball on that end. I would just keep that in mind for any future superbowl parties he hosts and decide if you want to attend or not.",
      "id": 265,
      "comments": [
        {
          "score": 48,
          "content": "Agree with this.",
          "id": 266,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Yeah, I really think it was just a miscommunication from both. But in the comments OP says the host called OP an asshole, which seems like a rude over-reaction. Maybe the host over-reacted because he was embarrassed to not have specified.",
          "id": 267,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 442,
      "content": "NTA and honestly this was the wrong sub to come to tho. They hate children here.",
      "id": 268,
      "comments": [
        {
          "score": 170,
          "content": "Right. These people act like they just appeared as full adults the day they were born. Its wrong to hate a whole human just based on their stage in life. Besides that, I've never been to a SB party that wasn't crawling with children.",
          "id": 269,
          "comments": [
            {
              "score": 20,
              "content": "Everyone here thinks they were speaking in sonnets by 2 years old, never made a sound unless spoken to, and never dared to cry or interact with any adults or their environment. therefore, any other child is inferior and not deserving to be in society",
              "id": 270,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I was wondering if I had stepped into a twilight zone. So many insane kid takes here that really show that these people just hate kids. Even the ones saying they have kids obviously either hate them or are lying to make it seem like they know better.",
              "id": 271,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 153,
          "content": "These comments are ridiculous, I’ve seen ‘parents and their kids aren’t a package deal’ (what??) and that parents who bring their kids anywhere without explicit permission are entitled. Like, imagine having such obvious animosity towards a certain gender/ethnicity/sexuality etc. it would be called out immediately and rightly so. But there’s such an acceptance for outright hatred for children and an expectation they shouldn’t be allowed to participate in society. Its extremely odd.",
          "id": 272,
          "comments": [
            {
              "score": 26,
              "content": "Exactly. It’s like kids are the one group of people it’s ok to hate. I think it’s partly because people like having someone to hate and bully, and they know kids have no power and can’t speak up for themselves. In my experience, other adults have done me way more harm than any kid has.",
              "id": 273,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 123,
          "content": "I've seen people on this sub suggest parents should hire a sitter so they don't bring kids to the grocery store on here.\n\n\nLike they really think no one should be allowed to interact with society until they're 18 and that they'll just magically be normal lol",
          "id": 274,
          "comments": [
            {
              "score": 37,
              "content": "What a fun society that would make for in 20 years. A bunch of young adults that don't even know how to grocery shop, lol. Instead of Boomers whining because we don't know how to do x,y, or z manual task that they didn't bother to teach us, we'll be the ones whining when the young ones are holding up the check out lines that we never took them to. This is an episode of Black Mirror in the making.",
              "id": 275,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "There's a person in the thread proudly declaring they're the absolutely insane anti child person every normal person thinks is toxic.",
              "id": 276,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 85,
          "content": "I was thinking the same thing. They're calling a 15 month old a +1 to a damn TV watching party 😂",
          "id": 277,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "Which is ironic because most of them are in high school still 😂😂",
          "id": 278,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Yeah. I honestly forgot about that. I’m like what is happening in these comments.",
          "id": 279,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 22,
          "content": "Yes they do! This is a great example of where reddit does not equal real life. Everyone here haaaaates kids.",
          "id": 280,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "Oh that explains it. I’m in awe of the people acting like bringing a kid is the worst thing you can do. Also I’m Mexican and all parties have kids so I truly do not understand what is happening right now.",
          "id": 281,
          "comments": [
            {
              "score": 10,
              "content": "Seriously, I’m white trash, so having a bunch of kids running around has always been a thing with my family/friends. I mean I completely understand not wanting to have them yourself, hell my best friend in the world is adamantly child free, but she can manage to be around my boy, no problem, even if *gasp* beer might be involved 🙄",
              "id": 282,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "I mean, most of America hates babies. It’s part of our culture. Not wanting kids is “cool and edgy”. \n\nI can’t imagine having a group of friends who do not understand that a baby under the age of 2 is not something you can just leave behind when your friends don’t want to deal with it. \n\nIf you invite friends with kids under 3, you should know they cannot attend without the child or without one spouse being left at home with the baby. And it’s not reasonable to expect your friends to get a baby sitter every time you want to hang out because you don’t like kids. You either accept your friends in their new stage of life or you don’t and you move on without them.\n\nNTA. Sorry your friends suck. They’ll grow up when they hit their 30’s.",
          "id": 283,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 387,
      "content": "I mean, did your buddy think you were going to get a babysitter to watch tv at his house for a few hours? \n\nThis seems like a clear NTA to me. I can’t really see why he cares so much about the kid being there that he would ask you to leave, but also didn’t care enough to tell you beforehand not to bring them. I personally wouldn’t bat an eye at a couple with a child bringing their child to watch the Super Bowl. It’s people watching tv, that’s the whole event, I don’t think a kid really impacts anything unless they are screaming/crying/ etc.\n\nAnd to the points of those saying “But people will be drinking and saying bad words! Someone might be on an edible!” I would say so what? That’s on OP if he doesn’t want his kid near any of that. If I’m sitting on a couch drinking beer, a child being within 50ft of me isn’t any sweat off my back. \n\nThe big caveat for all of this is of course whether OP’s kid is well behaved or not. If you’re raising a hellion then it’s all a different story.",
      "id": 284,
      "comments": [
        {
          "score": 90,
          "content": "A babysitter during an event the babysitters probably want to enjoy as well!\n\nPart of growing up and having friends with kids is learning how to reasonably accommodate them. Not every event should be kid friendly. But this is a daytime party to watch football, at a time finding a sitter would be extra hard.",
          "id": 285,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I think the hellion part is the key, but parenting style also matters. There are too many people that assume their toddler is welcome and then ALSO assume that everyone else is going to pitch in and entertain that toddler while the parents kick back and have some fun. You want to bring your toddler to a party full of adults? Ok..... but you and you alone are responsible for keeping an eye on them so they don't hurt themselves or make a mess and make sure they don't annoy adults there to enjoy the game. \n\nHonestly, if I were a host in this situation, I'd wait for an infraction before I asked my friend to leave.",
          "id": 286,
          "comments": [
            {
              "score": 11,
              "content": "Agree 100%. The big thing for me here is immediately asking OP to leave. Unless the host already knows that the kid is awful, that seemed like the biggest AH move.\n\nIf the kid is a hellion than all bets are off, but I didn’t feel like doing an INFO and just assumed the kid was reasonably well behaved.",
              "id": 287,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": ">And to the points of those saying “But people will be drinking and saying bad words!\n\nYeah as someone in Australia this is wild to me that people think this is an issue. Pottering around as a toddler while all the adults drank and laughed and swore was just a totally average Christmas for me haha.",
          "id": 288,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}