{
  "post content": "My son and his friend put up a tire swing in the yard for my grandchild.  I posted a picture of me swinging in it on Facebook.  My Aunt (Dad's sister) commented on it saying  \"I hate skinny people.\"\n\nI'm not one for Facebook drama so instead of commenting back I called her. I basically said that i don't talk about her watermelon ass so she shouldn't be talking about my weight. \n\nNow all my aunts, 5 of them, are mad at me because apparently skinny people can't be body shamed and that I should have told her first that I don't like those comments instead of straight out calling her out on her  watermelon ass like I did. \n\nI don't think I'm the asshole because it's not like I told her that I'm skinny because my sisters and I have always exercised more so we didn't inherit the family watermelon ass, but skinny is also something I didn't have to really work for. It's just how I am.\n\n\nETA: I accept my ESH verdict but I'm going to take that to mean I suck and so do all 5 of my aunts. If I'm going down, they're going down with me.",
  "id": 1,
  "comments": [
    {
      "score": 18821,
      "content": "ESH but I'd upvote twice if I could cause this story is hilarious.\n\nNext time don't go down to her level.",
      "id": 2,
      "comments": [
        {
          "score": 6280,
          "content": "Right?   Hilarious? Yes.  Mature? Not so much.\n\nBut also?  Hilarious.",
          "id": 3,
          "comments": [
            {
              "score": 2380,
              "content": "Hotel? Trivago.",
              "id": 4,
              "comments": [
                {
                  "score": 1039,
                  "content": "Hungry? Grab a snickers.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 742,
                      "content": "Computer not working? Turn it off then on",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 121,
                      "content": "BUT THAT'S HOW I GOT MY WATERMELON ASS!",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 65,
                      "content": "Everything else? MasterCard.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 439,
                  "content": "Watermelon? Ass.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 199,
                      "content": "Watermelon? Sugar.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 144,
                      "content": "Lmfwao",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "Sex? Yes please!",
                  "id": 12,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 569,
              "content": "I dunno I feel like it can get a pass cause it was taken offline and not done publicly",
              "id": 13,
              "comments": [
                {
                  "score": 655,
                  "content": "I feel like what people are overlooking here is the intent behind some of these comments. To be clear: I think the aunt is an AH and I don't agree with those sort of comments at all (I was underweight for a while and got a lot of shit for it and it sucked).\n\nBut I feel like there's a difference between what they said to each other. Like I hear a lot of people say 'I hate skinny people' meaning 'Ugh I wish I could do that/look like that, I kind of hate you lol.' Again, I don't condone it (people should just stop talking about each others bodies seriously wtf), but when OP said 'your watermelon ass' it obviously didn't have that connotation at all and she even said that she avoided it because she 'works out' which is pretty judgmental.\n\nThe big difference between the two insults is 'your body sucks, I wish I had it' and 'your body sucks, gross,' which is (I assume) why the aunt was surprised. ESH for sure.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 372,
                      "content": "I think in assuming that \"I hate skinny people\" means \"Ugh I wish I could look like that\" is assuming too much. At any rate, the skinny person doesn't know if it's the case.\n\nEither way, it's not an appropriate way to deal with those sort of feelings. Making people feel bad isn't nice.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 212,
                      "content": "Except you're assuming that was what aunt meant in the first place. Sorry but overweight people can and do harass skinny people, and why should skinny people put up with harassment?\n\nLike hey maybe OP has an ED or a serious illness that's making her skinny that she just doesn't want to talk about, now that we're making assumptions.But skinny people shouldn't say anything if they're harassed about it because it doesn't mean the same thing?\n\nAnyway, fat people who harass skinny people because they're jealous sucks majorly and need to go mind their own business. If someone tells me they hate me simply because of my weight I'm going to come for them, because they've just declared themselves major assholes and they can live with the consequences.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 68,
                      "content": "That’s an interesting take, I’m almost leaning in the opposite direction though: The aunt literally said she hated her, where OP is just making an unflattering physical comparison. \n\nI know that you’re totally correct in your interpretation of intended meaning, but the “I hate you because you’re skinny” thing just feels so much more personal and hurtful to me.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 64,
                      "content": "Fair play. That does add a different context I didn't fully appreciate.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 56,
                      "content": "But even if you say \"I hate skinny people\" in a \"I wish I had that body\" kind of way, it's still rude AF to say that on someone's completely unrelated post (OP was showing off her new tire swing FFS)\n\nAnd people tend to assume skinny people won't get defensive because they never get negative comments on their bodies, but they do. They very much do. Not to the extent and all pervasiveness as fat people do, but it's still there.\n\nIf you're particularly \"lucky\" you'll get comments about how skinny you are AND about being fat (because our society is that fucked that any amount of body fat is something to tease).",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 41,
                      "content": "The thing is, if you were to reverse the situation and anyone was to say ‘I hate fat people’ it would be a clearly unacceptable thing to say. \n\nI was also underweight for a while due to a medication and I hated it. So many people commented on my body thinking I lost weight intentionally but I was struggling trying to gain weight. The comments made me even more insecure about it. \n\nIt’s gross to comment on other people’s bodies and if you do so in a demeaning way you get what’s coming. I feel like the only acceptable comment to make to someone about their body is a vague sort of ‘you look nice’",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "In my family the women are thiccer. And when they say something about someone being skinny, it’s not about their desire to be skinny, they’re just being judgy assholes. This woman probably was too.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "I disagree. Op is NTA if the person with the watermelon ass can’t handle remarks about her body then she shouldn’t be talking about anyone else’s. Just because someone is skinny doesn’t mean people are allowed to be shitty.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "Aunt made an indirect remark about \"people\" , with envious connotation - still not tactful or empathetic at all and OP went for the big gun, insulting her ass in a passive agressive mode  - pointing directly at a part of her body - and being skinny IS a model and a societal plus, while being fat is not - at all. ESH for me too, Aunt could have said I wish I could do that too, you look like having fun. But OP is the rudest here...",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "If you can stretch your imagination enough to consider \"i hate skinny people\" to be some sort of compliment, im sure you can also take \"watermelon ass\" as a similiar compliment. As in she dummy thicc wish i had that too.",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 135,
                  "content": "I agree- she called the aunt directly to tell her how she felt about such comments. She did the thing her siblings are telling her to do.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "mature doesn't get to these kinds of people",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Being funny doesn’t justify her behavior",
              "id": 27,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Why?  Who of us would be in this situation and not come\nBack with a rebuttal?  Nobody!  Nobody take a the “high road “ when being bullied!  You know why?  Because It does no good.  AH need called out and that’s exactly what happened.  So you are NTA.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Since when has “maturity” been making yourself a doormat to be stepped on with filthy shoes?\n\nMaturity was calling her up instead of blasting her watermelon ass on Facebook.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 258,
          "content": "ESH but you were far more justified than her watermelon ass was.",
          "id": 30,
          "comments": [
            {
              "score": 130,
              "content": "I  disagree because op did it privately  were aunt did it publicly.  It would be an esh if op did it publicly",
              "id": 31,
              "comments": [
                {
                  "score": 35,
                  "content": "Insulting and fat-shaming people privately is _not_ an asshole move?",
                  "id": 32,
                  "comments": [
                    {
                      "score": 93,
                      "content": "But skinny shaming is still *body shaming.* And that was done publicly. \n\nIMHO, talking shit should be done privately. Auntie brought it upon herself. I wouldn't have done the same, but I don't think OP is the AH, maybe a jerk, but NTA.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "you think op's aunt telling them she hates skinny people wasn't an asshole move? honestly, I don't think I'd even call it \"fat shaming\" at this point because it was directly in response to the aunt being an asshole about op's body, and people use that word about literally everything they don't like. op's aunt was the one that brought body size into all this. all op did was post a picture of a damn tire swing. it's not op's fault that their aunt is clearly insecure yet won't do anything about it. \"watermelon ass\" is a low blow, and stooping down to the aunt's level of maturity but you know, sometimes you just gotta fire back with the same level that someone gave you.\n\ndo you think rude comments about someone being fat is unacceptable, but rude comments about someone being skinny is totally fine? making fun of someone's body is always going to be an asshole move, but I can't blame anyone for firing back at someone who did it first. someone can't bitch and moan about how much they hate skinny people and then turn around and get pissed when someone says something mean about fat people. it's a double standard. you're either completely against insults based on someone's appearance, or you have a skewed perspective that anyone who isn't fat is free game to be mocked. \n\nimagine your reaction to someone saying they hate fat people. if that isn't the same reaction you'd have to someone saying they hate skinny people, or hate muscular people, then you've got a fucked up moral compass",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "No the same way punching someone in the face isn't an asshole move if they're attacking you.",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 173,
          "content": "Agreed and kudos on using ESH. \n\nI feel like there are so many posts on this sub these days where both parties are being petty assholes but they get NTA because the commenters take their side. It’s not “who do you like” it’s “am I the asshole”. An asshole is an asshole even if they are justified in their AH behavior. OP had every right to be upset but an adult calling someone else names still qualifies as AH behavior.",
          "id": 36,
          "comments": [
            {
              "score": 2,
              "content": "Can we add a new category for this subreddit?  Call it JAH = Justified Asshole.     It is different from ESH and NTA or even NAH.   Where the response is ducking, but understood and maybe even applauded,",
              "id": 37,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": ">Next time don't go down to her level.\n\nOP kept if off social media, at least?\n\nEdit:: well, then they posted it here though",
          "id": 38,
          "comments": [
            {
              "score": 7,
              "content": ">Edit:: well, then they posted it here though \n\nThis is anonymous though, it won't get back to the aunt in anyway.",
              "id": 39,
              "comments": [
                {
                  "score": 3,
                  "content": "yeah, they already said it to their aunt & it's not like there's a name or image attached of her. there's no public shaming going on when we don't know who the aunt is or even what she looks like. obv it IS public shaming when it's the aunt commenting below a picture of op on a public platform",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 86,
          "content": "I lost it at \"inheret the family watermelon ass\" 😂",
          "id": 41,
          "comments": [
            {
              "score": 15,
              "content": "The mental picture I got in my head after reading this almost made me spit out my morning coffee 😂😂😂😂😂😂😂😂",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "this is definitely a picks or its not real situation. we really can't judge unless we see this \"watermelon ass\"",
          "id": 43,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 40,
          "content": "“Ok, since it isn’t appropriate to call her out in private when she slams me in public, I’ll just slam her back in public too.  Great advice, thanks!”",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "I very much enjoy the fact that “watermelon ass” is mentioned three times in the body of this post, plus the title",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Agreed. And tell your aunts that anyone with a body to feel insecure about can be body shamed.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I’m 100% stealing this insult btw. Or making it a compliment. Some people would kill to have a watermelon ass.",
          "id": 47,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 9782,
      "content": "ESH including me because I can’t stop laughing at “watermelon ass”",
      "id": 48,
      "comments": [
        {
          "score": 2104,
          "content": "Same! And the fact that she doubles down on the name while asking is she's the AH has me rolling!",
          "id": 49,
          "comments": [
            {
              "score": 490,
              "content": "Rolling like a watermelon? 😂",
              "id": 50,
              "comments": [
                {
                  "score": 124,
                  "content": "like a watermelon ass",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 202,
          "content": "Must be one of the best phrases I’ve ever heard! Can’t stop chuckling at that one 😂 ESH",
          "id": 52,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 89,
          "content": "Me too! Watermelon ass is stuck with me forever!",
          "id": 53,
          "comments": [
            {
              "score": 96,
              "content": "I wish I had a watermelon ass! Mine’s closer to a pancake 😕",
              "id": 54,
              "comments": [
                {
                  "score": 20,
                  "content": "Same lol",
                  "id": 55,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "Don’t skip squat day.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 20,
                      "content": "I did squats and I used to do the glute machine. It took 2 years, but I could finally do the whole stack on the ass machine 10 times. I still have no ass.",
                      "id": 57,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Yeah you can tell OP is middle aged, every woman under 40 WANTS a watermelon ass lol 😂",
                  "id": 58,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "I had a manager refer to a shoplifter as \"X-mas tree lady\" because she kinda looked like a Christmas tree in the cameras.\n\nWas it horrible and mean? 100%\n\nDid that kind of talk ever leave the office? Never. \n\nIt was a store with a really bad shrink problem, and my manager was stressed about the hundreds we'd lose on a day when we only did $2.5k in sales.",
          "id": 59,
          "comments": [
            {
              "score": 38,
              "content": "I worked at a fast food place in high school, and there was one homeless woman we called “The Judge” because she always came in wearing a dark mumu that looks like judges robes.",
              "id": 60,
              "comments": [
                {
                  "score": 24,
                  "content": "I just saw your name and I'm laughing.",
                  "id": 61,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "I'm with you, I'm with you. :D",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Lol. Yep. I can add a new term to my repertoire",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Be sure to bring a watermelon to aunties next cookout!",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "And apparently the watermelon ass is hereditary. Asd me to the ESH list.",
          "id": 65,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Same LOL",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "hahahahaha",
          "id": 67,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3442,
      "content": "ESH she shouldn’t be talking about your body, and you shouldn’t be talking about her, you both suck here",
      "id": 68,
      "comments": [
        {
          "score": 2116,
          "content": "I’m a firm believer of “if you can’t take it, don’t dish it”.",
          "id": 69,
          "comments": [
            {
              "score": 943,
              "content": "Don't write a check your ass can't cash is what my.mama said lol",
              "id": 70,
              "comments": [
                {
                  "score": 759,
                  "content": "In this case, a check her watermelon ass can’t cash lmao",
                  "id": 71,
                  "comments": [
                    {
                      "score": 79,
                      "content": "Hahahahahaha",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "I  dont know you but i love you lmaooo",
                      "id": 73,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 132,
                  "content": "I always heard the longer version: \"Don't let your mouth write a check that your ass can't cash.\"\n\nTo bandwagon a bit, I guess the new phrase is: \"Don't let your mouth write a check that your watermelon ass can't cash.\"\n\nAlso, ESH but f it's funny.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 15,
                      "content": "What does he say in Top Gun? Something like, \"son, your ego's writing checks your body can't cash.\"",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "I think one of my family members have said that before. My mom’s favorite is “Play stupid games win stupid prizes”",
                  "id": 76,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "Don’t want shit don’t start shit\n\nChat shit get banged",
                  "id": 77,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "My mom would say it as \"don't let your mouth write a check your ass can't cash\" so basically don't let your mouth get you an ass whooping",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "\"You're writing a check your tush can't cash, little man.\" - Rocket Power gave me that line and I use it far too much",
                  "id": 79,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Um ROCKET POWER !? That was such a good show  - - after further investigation you can watch it on Paramount plus.......",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "Being mature means being the bigger person. Pun sort of intended. It means someone says something mean to you and you don’t have to respond. \n\nOP could have casually told her next time she saw her that it wasn’t nice and why does she have to be mean? Or she could have texted her or called her and been more like, “hey, why did you write that? Kind of mean or uncalled for dont you think?” You don’t have to resort to name calling right away. That’s childish.\n\nPicks up phone to pick a fight and in angry tone says: listen here, that comment on the internet was too far you watermelon ass!\n\nSounds like some hick level petty shit to me",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "Don't let your bulldog mouth overload your chihuahua ass.",
              "id": 82,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "That's a good rule to follow, but that doesn't mean that you should be the one to dish something in retribution.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Right, but the fat aunt didn't say \"you're such a twig\", so \"watermelon ass\" seems a bit unwarranted\" kekw",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Especially when the aunt commented it on Facebook for all to see, and OP said it directly to them as a way of telling them to mind their own business.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "OP isn't in the wrong. They're still an AH tho.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "In the wise words of the venerable poet Lil John, DON'T START NO SHIT WON'T BE NO SHIT",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "This applies both ways and results in a spiral of bad experiences.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Also like these people are old enough to have 2-3 generations beneath them. Tf?",
          "id": 89,
          "comments": [
            {
              "score": 3,
              "content": "My thoughts exactly.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 20,
          "content": "Hey, It’s my first time here, what does ESH mean?",
          "id": 91,
          "comments": [
            {
              "score": 119,
              "content": "Everyone sucks here. Which basically means myself and my aunts all suck.",
              "id": 92,
              "comments": [
                {
                  "score": 23,
                  "content": "Naw i don't see you as TA because you to ain't asides  and told her in private  keep  your name out of her water melon ass mouth",
                  "id": 93,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Nothing wrong with being the asshole from time to time. OP got some vengeance, and justified or not, it's still an asshole move.",
                      "id": 94,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "No, only you and the one aunt, the others did nothing other than rightly tell you not to comment on her body, nothing wrong with that at all",
                  "id": 95,
                  "comments": [
                    {
                      "score": 48,
                      "content": "Yea, except they didn’t tell the original aunt not to comment on OP’s body. Thus making them TA’s because the whole issue started with the original aunt doing the very same thing they are admonishing OP for, yet they are taking the aunt’s side.",
                      "id": 96,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I just want to reply to your comment to say don't listen to them. If you have a body, you can be body shamed. And frankly, I despise these double standards with a passion. You were body shamed, and while you absolutely shouldn't have done it in return, it's not unreasonable to be upset or even angry about it.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 31,
              "content": "There are a few voting options in this sub:\n\n\nYTA: You’re The Asshole\n\n\nNTA: (you’re) Not The Asshole\n\n\nESH: Everyone Sucks Here\n\n\nNAH: No Assholes Here\n\n\nINFO: We need more details to decide.",
              "id": 98,
              "comments": [
                {
                  "score": 7,
                  "content": "Thank you so much!",
                  "id": 99,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Have fun!",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "WAT: watermelon asshole",
                  "id": 101,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "At least OP took it to a private call instead of putting aunt on blast on Facebook.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Why? I think reciprocal insults are ok, just like reciprocal violence is. \n\nIf someone punches you, it’s ok to punch them back. If someone insults you, it’s ok to insult them back",
          "id": 103,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Don't forget about the aunts for saying skinny people can't be body shamed. If you have a body, you can be body shamed.",
          "id": 104,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "But the aunt did it publically, OP did it privately. Dont dish it out if you cant take it. OP returned the same type of comment but in a better way. Not sure if any other method would have struck home how it made OP feel. NTA 1000%",
          "id": 105,
          "comments": [
            {
              "score": 4,
              "content": "No, two wrongs don’t make a right, if OP had simply said I don’t appreciate what you said, and simply left it at that, then he would not be an asshole, at best it’s ESH",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1647,
      "content": "[deleted]",
      "id": 107,
      "comments": [
        {
          "score": 677,
          "content": "They sort of all have the same body type. Dad has 7 sisters but only 5 are still alive. A couple of them aren't overweight but all 7 has or had that watermelon ass. Me and my sisters have always called it the family watermelon ass so it kind of slipped out.",
          "id": 108,
          "comments": [
            {
              "score": 729,
              "content": "Wait, so you started body shaming them behind their backs first? You guys deserve each other.\n\nIf you're in your 40s... this kind of catty behavior is honestly kind of embarrassing. Please stop it.",
              "id": 109,
              "comments": [
                {
                  "score": 441,
                  "content": "Yeah OP has some weird fixation on her family members ass size imo 💀 It would be one thing to have this body type and joke about it, but since OP doesn't even share that trait with them I fail to see how gossiping about their ass sizes and giving it a name makes her any better than the aunt.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 103,
                      "content": "Her aunt is literally Nikki Minaj and OP just outed herself for not being a Barb",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 333,
                  "content": "> If you're in your 40s...\n\nOh damn, I only skimmed over the post and somehow ended up assuming OP was a teenager. Yea, I'd be embarrassed.",
                  "id": 112,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 64,
                  "content": "Anyone who is only in their late 40s and already has a grandson old enough for a tire swing should probably not be so judge-y about other people.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 64,
                      "content": "Yeah no... late 40's is 45+, probably more 47+.. so she had her son at 20-22 and her son has a kid the same age range their grandson would be upwards of 5-9. Of all the things in this post age is the last issue.",
                      "id": 114,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 29,
                      "content": "Now you're just being rude for no reason; she would never say that to her aunt if the hateful comment wasn't there... let's not act like we all don't have any type of joke about our prevalent family features.",
                      "id": 115,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Just what? Found the asshole.",
                      "id": 116,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I mean, it doesn’t have to be body shaming. Big asses run in my family and we’re always cracking jokes on each other. My cousin is flat chested and we’re always on her, but she’s alway on me about big titties",
                  "id": 117,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "All the women in my dad's family have thin hair and are noticeably balding in their 40s. My mum's side has luxurious, thick hair. I've inherited a mishmash and live in fear of being a balding woman and do what I can to take care of my not so fine, not so thick locks. Is this similar to trying to keep the watermelon ass at bay? If so I wouldn't call it talking behind their backs.\n\nHer aunt quite literally said she hated her on FB. Unprovoked. That's so mean!",
                  "id": 118,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Thank you. This is exactly the point I was trying to make.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "What is this watermelon ass? I'm tryna picture it but I just can't.",
              "id": 120,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Lol, wait, so your phone call burn was also a lie.  You've been talking about her \"watermelon ass\" your while life. 😂",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "What is a watermelon ass?",
              "id": 122,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "You have a grandchild so are probably in your forties. Your aunt is probably in her sixties or something like that. Why are you people being so petty? Don’t body shame her and she shouldn’t body shame you. You people are way above the age where this could be seen as childish banter. Set a better example for your grandchild.",
              "id": 123,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 106,
          "content": "Same. Should’ve seen the face when one of my plus sized friends lamented about not being able to shop in person like me and I answered “stores don’t stock XXS either.”",
          "id": 124,
          "comments": [
            {
              "score": 104,
              "content": "I had the same conversation where a plus sized friend complained about finding pants that fit. There are some brands where even their XS is too big for me, but I wasn’t going to say that because she’s sensitive about her weight. Your friend just wanted to vent to a friend. That’s like women saying sexism sucks and men saying, hey I suffer from it too! Like, they’re not wrong but why’d they make it about them? Downvote me if you want but that just doesn’t sound empathetic. My friend was sexually abused and has some genetic issue. These things make her life hard enough, but the resulting weight gain and the way people treat her just make her life so much harder than most. Yes, skinny shaming is shitty and harmful. I’ve been bullied about my weight. But fat shaming is on a whole other level. Like, I don’t get doctors blaming everything on my weight and shaming me.",
              "id": 125,
              "comments": [
                {
                  "score": 19,
                  "content": "I would upvote this more if I could. Spot on",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Also, while I get that XS would be too big on you, you can still wear it. I'm not saying it is okay or that you shouldn't feel uncomfortable. But as someone on the larger side, I literally can't wear clothes if they are too small. If the size is 42 (European standard) it is too small for me. If your size is 30, you can still wear 32. It is not ideal but it is still possible. Thankfully most stores carry clothes in my size as part of their regular collection.",
                  "id": 127,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Yeah, I’ve tailored shirts that didn’t fit. I can barely sew and some clothes are too complicated, but it’s usually an option. I do have other issues, like finding bras with AA cups or just accepting one that’s too big. But I feel like plus sized people having problems doesn’t negate me having problems, and visa versa. And yes, we all have our unique experiences, but in general the magnitude is usually worse when you’re plus sized and we shouldn’t forget that. I don’t know why it has to be an “us vs them” issue. Bullies can suck, doctors can suck, society can suck. And we should all just be there for each other in dealing with that.",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Thank you for taking the time to write this out",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "I feel like it would be easier at the very least for y'all to shop online, though. Maybe? Since clothing companies seem to generally have a better grasp of how slender bodies work than fat ones. So.. there's that, at least. Still sucks not being able to buy things in person",
              "id": 130,
              "comments": [
                {
                  "score": 5,
                  "content": "I return at least 75% of what I buy online because there’s no consistency in sizing and clothing companies seem to think XXS girls will still have D cups so there’s a lot of billowing and sagging or arm holes will show half my bra. I don’t think clothes shopping is easy for anyone of any size tbh",
                  "id": 131,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Even in XL the billowing arm holes are a problem. It's just generally poor clothing design.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Yeah it's a bitch trying to find size 0 jeans around here.",
              "id": 133,
              "comments": [
                {
                  "score": 42,
                  "content": "Heck, I have to suck it up and buy kids 16-18 sometimes for dress pants!",
                  "id": 134,
                  "comments": [
                    {
                      "score": 22,
                      "content": "I just bought a boy’s L shorts the other day because the smallest women’s didn’t fit and the boy’s had bigger pockets",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "trying finding 00 lol. not me, I wear a 6, but my mom used to wear either 0 or 00 because some brands made the 0 too big for her, and just talking about this always made my brain burst a bit, but at the hilarity of it. 00? crazy. she didn't have an ED, though, she was just super petite naturally.",
                  "id": 136,
                  "comments": [
                    {
                      "score": 29,
                      "content": "My mom is one of those people who's still almost model thin as a middle aged woman. \n\nShe once broke a sales person's brain by saying, after trying a pair of jeans \"yeah, they'e too big. I need to go back to the gym, I lost weight\"\\*\n\n\\*She basically has no fat to loose and gains muscles when she exercices, so her weight goes up when she's in the gym regularly.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "There is a difference tho. If youre an XXS, that means that everything bigger than that will physically fit over your body, maybe not entirely correctly, but it WILL fit. An item of clothing that's too small doesnt physically fit over a persons body",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "I’m a large person and even I can understand ‘skinny’ people have a difficult time with their weight. Sometimes there’s a medical condition, and eating disorder, difficult kilos to lose that won’t leave with anything tried. I listen to my ‘skinny’ friends and I get it. Being healthy is work. \n\nWhat the aunt said is wrong",
          "id": 139,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 985,
      "content": "ESH\n\nIt's 2021. Stop Facebook drama, even if you're just dragging it into non-Facebook settings.",
      "id": 140,
      "comments": [
        {
          "score": 201,
          "content": "Seriously!!! That shit is SO childish. Like, are we all 14 here?! I so do NOT get adults who air drama and dirty laundry on social media. So childish.",
          "id": 141,
          "comments": [
            {
              "score": 128,
              "content": "Not to forget OP is a grandparent 😂",
              "id": 142,
              "comments": [
                {
                  "score": 89,
                  "content": "That is SO embarrassing. These grown ass people are acting like shitty teenagers.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "OP is a fucking grandparent in her 30s... NICE.",
                  "id": 144,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Further down she says she's in her late forties. I can only hope so because that would be one zany family were she in her 30's.",
                      "id": 145,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "What? How the fuck? They're in their 40s",
                  "id": 146,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Yeah, that's understandable, but it was perfectly justified in this case because they delt with it privately after someone insulted them publicly, you shouldn't condone bullying because you don't like \"drama\"",
          "id": 147,
          "comments": [
            {
              "score": 42,
              "content": "I didn't condone anything. My judgment was ESH. \n\nIt's not justified to talk about someone behind their back for years (as OP says she did to multiple family members) and then call them and insult a specific body part when they make a general comment about skinny people. The aunt behaved poorly, but OP has been secretly insulting her weight for years.",
              "id": 148,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Imagine thinking her drama was somehow better just because she took it offline.",
          "id": 149,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 451,
      "content": "You guys don't get it. It was a back-handed compliment. It means, \"I'm jealous of you because your weight doesn't prevent you from enjoying a ride on a tire swing.\" She believes that *skinny* is a compliment.\n\nESH - but mostly OP. 70 doesn't understand how times have changed, and that her comment would be interpreted as hateful or shaming. OP went for the jugular.\n\nYes, I know I'm going to get downvoted to hell. Have at.",
      "id": 150,
      "comments": [
        {
          "score": 124,
          "content": "My response for these sort of comments is usually “if that was intended to be a compliment thanks I guess” . I agree a lot of people do not realize these kind of comments are usually offensive.",
          "id": 151,
          "comments": [
            {
              "score": 14,
              "content": "I agree, you can find the compliment annoying, but it’s an AH move to go straight for the jugular by calling them a fat watermelon ass",
              "id": 152,
              "comments": [
                {
                  "score": 6,
                  "content": "It definitely is, I don’t disagree with you at all. I’m just saying that we should normalize not commenting on anyone’s weight. I happen to be the only twig in my family and have heard these comments since I was a little kid, ranging from ‘you’re so skinny I’m jealous’ to ‘you look anorexic!!’ and to this day I struggle with my body image and have been trying to put on weight for years. Never in a million years is it appropriate to tell someone they have a watermelon ass, I’m just saying we should all move in the direction of not making comments about anyone’s weight",
                  "id": 153,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I totally agree. I think comments like that are shitty. People constantly shame others for being “too skinny”, saying they need to gain weight, or that men like curvy women, etc. I wouldn’t expect a 70 year old to be with the times and realize it’s a touchy subject. But I really like the way you worded your response to them. The “IF that’s intended to be a compliment” politely shows that it’s really not one, and that maybe they had good intentions but it’s a cruddy thing to say. The “thanks I guess” kinda takes the thankful response they expect and shows them that you actually don’t appreciate it much.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 99,
          "content": "I honestly think you have the right of it. \n\nIt sucks because older people don't necessarily realize they're being hurtful but... Man oh man, OP took it to another level. And from her other comments it sounds like she'd been calling it that for a lot longer and it just slipped out to her aunt's face.",
          "id": 155,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "This is the one. Nobody got it.",
          "id": 156,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 20,
          "content": "Exactly idk why everyone’s assuming skinny was meant as an insult. She didn’t say “you’re too skinny if you can fit in that swing” or something. Saying “ugh I hate skinny people” has always been a way of saying “I’m jealous you look that good/ can do that, etc”. Why would you respond to someone commenting on your nice figure by calling them a watermelon ass (ie fat)? It’s hateful and body shaming",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "This. Honestly, I'd go so far as to say YTA because you were purposedly hurtful. She was trying to be nice an an obtuse way. There's a way to call that out.",
          "id": 158,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Agreed. I’m a skinny guy, half the time someone mentions my weight they’re obviously saying things in a “wish I was you” way. People who haven’t spent most their life skinny, or who want to be skinny, simply can’t understand what it’s like to not be able to gain weight. Especially in America, where most people you come across have a little extra weight they wish they didn’t have. \n\nI think OP should have explained that, and told her that even though she may think it’s a compliment it’s not something they like to hear or think about. If she tries to play it off, hit her with the “watermelon ass” and ask her how she would feel having something like that said to her publicly.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 411,
      "content": "ESH.\n\nIt probably would've been better to just delete her comment and move on. Not being for FB drama is great and all, but I don't see how calling her aggressively is any better. It's just unneeded drama in a different form. \n\nOf course, she sucks too because her comment and the idea that skinny people can't be body shamed is outdated and silly.",
      "id": 160,
      "comments": [
        {
          "score": 87,
          "content": "Yea plus OP has a grandchild, so they’re not very young themselves, and their dad’s sister would probably be a boomer, or nearing being a boomer. \nThey say weird stuff all the time, sometimes inappropriate stuff even. better to move on instead of insulting them.",
          "id": 161,
          "comments": [
            {
              "score": 67,
              "content": "Yeah I'm accepting that I probably shouldn't have brought up her watermelon ass. Also, she is a boomer. She's in her late 70s and I'm in my late 40s.",
              "id": 162,
              "comments": [
                {
                  "score": 192,
                  "content": "> She's in her late 70s and I'm in my late 40s.\n\nSooooooo first of all, you're much too old to be doing this, then. You darn well knew that your response was the wrong one. I'd assumed you were a teen and she was in her late 20s or early 30s at the *absolute* latest.\n\nSecondly, has she always been like this or is this a recent development? Because a woman in her 70s who has started saying mean or inappropriate things, like her social filter is broken? That sounds like a woman who is in the early stages of dementia.",
                  "id": 163,
                  "comments": [
                    {
                      "score": 52,
                      "content": "I don't know what magical families some of y'all come from but my mom and her sisters are in their 60s and 70s and still act catty.My father called my mother's siblings the Sisty Uglers Until he died in 2011.\n\nI'm in my 50s and my cousins are all just like their mothers.\n\nThat's why I don't do family gatherings if I can avoid it.But seriously, Families do this, there's no magic age that makes people \"Grow up\"\n\nedit:typo",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "My aunts have always been like this. I've just never said anything until now to them. I guess the older I get, the less I want to hear the bs. Dad's brothers are all chill but those sisters can drive you nuts.",
                      "id": 165,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "As someone in her late 20s-mid 30s, I will say this, my mother's boomer (?, they're all 50s-60s) friend groups are way more drama filled than mine ever was or really, ever will be.\n\nIt's like with retirement looming, suddenly they're all reverting back to high school catfights and gossip, and even the language between friends always has subtext and passive aggressiveness. OP's aunt saying that publicly on a photo is VERY much a passive aggressive Boomer Move^(TM).",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 31,
                  "content": "No no -- if she comments on your ass, her watermelon ass is 100% fair game now.",
                  "id": 167,
                  "comments": [
                    {
                      "score": 99,
                      "content": "Well according to her own comment OP and her sisters have always talked about her aunts asses to the point that they gave it a (derogatory imo) name. \n\nAunt sucks for this completely unnecessary rude comment but sounds like OP was body shaming her family members WAY before that.",
                      "id": 168,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "You're one of the \"the only good bridge is a burned one\"-types, huh. Is it that you're unfamiliar with the idea of de-escalation or are you just bad at it?",
                      "id": 169,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 207,
      "content": "INFO: Do you get paid by a third party every time you type the term ‘watermelon ass’ on Reddit?",
      "id": 170,
      "comments": [
        {
          "score": 60,
          "content": "Sorry. I was highly annoyed when I made this post.",
          "id": 171,
          "comments": [
            {
              "score": 7,
              "content": "I’m not complaining! I just see a trend here :)",
              "id": 172,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 193,
      "content": "“I’m not one for Facebook drama”\n\nBut you are one to act like a mean girl in high school instead of communicating like an adult.\n\n\nYTA. You didn’t have to be, but you decided to act like a full hypocrite so now you are.",
      "id": 173,
      "comments": [
        {
          "score": 74,
          "content": "I mean, she did communicate by calling her and addressing it personally rather than writing that comment on FB.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "We're a very close family and I love all my aunts. I'll end up apologizing and that will be that. I just wanted to make sure I was the asshole this time.",
          "id": 175,
          "comments": [
            {
              "score": 10,
              "content": "You and your aunt both are, you intentionally but I’d wager hers was not.",
              "id": 176,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 148,
      "content": "Leaning towards YTA. is there any chance she meant that ironically? I would have read that as a joke. \n\nAlso, sounds like she’s elderly. Probably should have just let it go.",
      "id": 177,
      "comments": [
        {
          "score": 143,
          "content": "I read it as “I hate that skinny people can enjoy that swing but I can’t” not a direct insult to skinny people. OP mentions that the aunt is in her late 70s.\n\nOP is in her late 40s, I would think by now she would learn not to overreact and start fights with her elderly family members. YTA.",
          "id": 178,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "I was wondering the same thing. Did she put the LOL emoji or something?",
          "id": 179,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}