{
  "post content": "My daughter and I were recently on vacation. We spent the day in an area that’s known to have a lot of rich/famous people and towards the end of the day we saw one of my daughter’s favorite celebrities (we’ll call her A) walking out of a store. \n\nMy daughter ran to the store but when she got near A, she was stopped by A’s security. They said that A’s there with her daughter for her daughter’s birthday and wants to focus on her daughter. \n\nMy daughter was very upset because she’s been a fan of A for a very long time so she tried again for a picture but was turned away. \n\nMy daughter was crushed so later that night I made a post talking about my experience with A. How she wouldn’t let anyone go near her and her daughter, the fact that her security was rude, and her not being willing to stop for a couple seconds for a picture. I understand it’s her daughter’s birthday but a 1 minute interaction with a fan isn’t going to ruin her day and if it does, that girl needs to learn that the world doesn’t revolve around her. \n\nThe post ended up getting a lot of attention and a lot of people actually said my daughter and I were being entitled for expecting A to interrupt her daughter’s birthday for everyone that wants a picture. \n\nMy husband also saw the post and said he couldn’t believe that I would bash her for trying to spend the day with her daughter. I’m not trying to bash her for spending the day with her daughter but she wouldn’t be where she is without her fans so I think she at least owes it to them to take a picture. \n\nAITA for making the post about A",
  "id": 1,
  "comments": [
    {
      "score": 76588,
      "content": ">that girl needs to learn that the world doesn’t revolve around her\n\nKinda the lesson I'm thinking you and your daughter need to learn, tbh.\n\nYTA",
      "id": 2,
      "comments": [
        {
          "score": 18020,
          "content": "yea this is some SelfAwarewolves level mental gymnastics",
          "id": 3,
          "comments": [
            {
              "score": 4070,
              "content": "I don’t know if selfawarewolves is a typo…but I hope not, because I’m going to start using it.",
              "id": 4,
              "comments": [
                {
                  "score": 2949,
                  "content": "r/SelfAwarewolves lots of great content on here",
                  "id": 5,
                  "comments": [
                    {
                      "score": 429,
                      "content": "Thanks, just joined",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "r/leopardsatemyface is another good one!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 121,
                  "content": "It’s a subReddit",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "r/selfawarewolves",
                  "id": 9,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "Someone once posted a meme that included the phrase \"selfawarewolf\" and now a race of Buddhist type Lycanthropes are a staple in my D&D campaign.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I guess Hershel Walker would fit into that category now since he said he would rather be a werewolf than a vampire. These are important issues that a congressman must know. S/",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 357,
              "content": "I want to be selfawolf!!!! YTA. You are not entitled to anyone's attention.",
              "id": 12,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "Agreed. Op needs to figure out why she and her daughter are not entitled to a stranger’s time, particularly someone focused on their daughter’s birthday.\n\nOp, YTA. People care about their daughters as much as you do.",
              "id": 13,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "This post can’t possibly be real lmao",
              "id": 14,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 9882,
          "content": "\"How dare this woman focus on _her_ daughter instead of _my_ daughter!\"",
          "id": 15,
          "comments": [
            {
              "score": 2612,
              "content": "Like, how dare they have a life outside their celebrity status *scoffs*",
              "id": 16,
              "comments": [
                {
                  "score": 6100,
                  "content": "OP, YTA \n\nA celebrity's life is packed to the gills with scheduled events. They need to also *schedule* time with their kids in order to make it happen and not get swamped by professional events. \n\nCelebrity A scheduled time with her daughter for her daughter's birthday. Yes, her daughter is more important to her than your daughter is, no matter how big a fan your daughter is.\n\nAnd saying that she could've taken \"a minute\" for your daughter--that's not how it works. That's not what would happen.\n\nFirst of all, she'd be telling her daughter that even during the celebration of the daughter's birthday, a random other girl neither of them has ever met *is more important to her than her own daughter.* Her daughter probably misses out on a lot of time with her mom, because of how heavily her mom is scheduled. Expecting to be able to interrupt the daughter's birthday on demand so your daughter can get a picture, is unbelievably rude and entitled, and reducing both A and her daughter from the status of human beings to mere props for your enjoyment. \n\nSecond--once A did it for your daughter, *people would notice,* and they'd be swamped by other kids each wanting \"just one picture.\"\n\n**The only way they can have their private birthday celebration is to Just Say No to every entitled mom and her golden child. There's no way to say yes to one and no to all the others without causing much unhappiness and bad publicity.**\n\nOh, and her own daughter's birthday ruined, but obviously you don't care about that.\n\nLearn some manners.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 741,
                      "content": "Perfect.. exactly what I wanted to say but was too mad to be able to articulate! Agree completely, OP is entitled af.\n\nYTA op",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 472,
                      "content": "And security has to be rude because it is their job to protect the celebrity and kid.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 260,
                      "content": "THIS.  I go to my area's Comic Con every year, and one thing you hear over and over when celebs are asked \"What's the rudest fan encounter you've ever had?\" it's invariably along the lines of \"I was with my family/doing something with a friend/eating/etc and FAN came up and interrupted/demanded attention/threw a fit when I politely said I was busy, so thanks but no autograph/selfie/whatever.\" I've heard of fans physically pushing between the celeb's family/friends and the celeb to get attention. I've also gone to Sundance Film Festival in years past, so I've had ample opportunity to observe some famous names.\n\nLike, these are real people. If you see them in public and they're obviously busy, think twice about interrupting. (Would YOU like strangers constantly butting into your time with family/friends?) If you DO decide to approach, 1) be polite--don't push your way between people and 2) if they say thanks but no thanks, please leave me alone, RESPECT THAT ANSWER. \n\nIn the end, they owe you NOTHING. Nearly every celeb I've encountered has been kind and if they didn't want to be bothered were equally polite in telling me (or whoever nearby had asked) no. But, you have to respect that answer. \n\nOP, YTA.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 114,
                      "content": "[deleted]",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Yep, you know the score.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I'm surprised this wasn't mentioned before. This birthday celebration is probably one of the few private moments A has with her daughter and this moment should be respected. Say yes to one kid and you will have to say yes to everyone else or you will look like a bad person",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Exactly this. OP demanding that ANY person, much less a likely a fully-booked and oft harrassed celebrity, pay more attention to her daughter than their own *whilst celebrating their own child's birthday*  is extremely rude. And I'd bet the security, if they *were* rude at all, were rude because OP was one of many, many parents/people they have to turn down for the day.\n\nTo then go online and whine about the rudeness of the celebrity without even having personal contact with them is a bit mind boggling, tbh. I think in general, if you're harrassing any celebrity when they're doing *anything* with their children, you should expect that there is a decent chance they're going to be annoyed with you for not allowing them basic privacy and respect, probably depending on how many others have already harrassed them, and how important the outing is.\n\nIf this post of OPs has gained any large amount of traction, they owe A a public apology, imo.  \n\n\nETA: Would have been a grea opportunity to explain respect, privacy, and boundaries to daughter, with regard to celebrities she likes, sure, but also in the grander scheme.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "yes. Celebrity are human beings, too ( i cant balieve i wrote that sentence !)",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1456,
              "content": "She’s one of those people who don’t comprehend that if the celebrity stopped for *one* photo with a fan, she would have to stop for **many** photos with fans! \n\nBeing a celebrity doesn’t mean she has no right to spend a day without having to address fans! How entitled do you have to be to think they owe you something?!",
              "id": 26,
              "comments": [
                {
                  "score": 612,
                  "content": "She also doesn’t understand how busy these celebrities often are. A probably does a lot of things that interfere with being with her daughter. So she’s cleared her schedule for her daughter’s birthday to show her little girl that she’s special to her, not getting shoved aside by mommy’s fans. The world in general doesn’t revolve around “that girl”, but A’s does because A is *her mother*.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Exactly. As I mentioned in a comment above, I go to a Comic Con every year and have heard more than one celeb say something like \"I just got here from X city 6 hours ago, so excuse me if I'm a bit tired/scattered. I'm really excited to be here and when we're done, I have to go shoot tv/film for three weeks.\" Or \"I love doing these events, meeting all of you is great. Please have patience, I haven't been home in three months and have been adjusting to the time change from CITY ACROSS THE COUNTRY/GLOBE.\" Like, more than one celeb has said \"I flew in from London/New York at six this morning/midnight or I have gone from LA to New York to here in three days.\" Their schedules are often completely insane and the busiest ones are often away from home months at a time, so any family time/down time is precious.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 343,
                  "content": "People like this never understand when it’s about THEM. They understand rules, but think THEY should get an exception.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 94,
                      "content": "I’m a school secretary and the number of parents who think we should make an exception to something for them and/or their kid is roughly equal to the number of kids we have (750). Very few seem to grasp why I wouldn’t want to put my job at risk for their personal convenience.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "An exception is now the new rule.",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Thank you for making the point I was gonna make. For OP, it may just be one pic, but for A, it's a lot of fans who want a lot of pics. If A says \"yes\" to one but \"no\" to all the others, people would say she's an AH. If she says \"no\" to them all, she's an AH. If she says \"yes\" to them all, her daughter thinks she's an AH. There's no winning, so she may as well choose her daughter.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "This and imagine how scary it would be having total strangers approaching your child. As an adult and celebrity, you accept a certain amount of risk interacting with fans but your children do not.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "right and if the celebrity is out doing personal stuff. she doesn't have to do anything. leave her alone and let her shop. i can't stand people actually think that just because someone is famous they have to give autograph or get pictures taken when even seen. no they don't especially in their own personal time. if they do give an autograph or take a picture people should be grateful and respectful that they yook the rime out of their life to make fans happy.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Guarantee if you explained this to her she’d say “well, I asked first. Celebrity A should just set boundaries and just say no to all those other moms”.",
                  "id": 35,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Especially on celebrity daughter's birthday. Doesn't she know that random fans made her who she is today? I mean if the celebrity wanted privacy she should have stayed home.. or not gone to anywhere that is frequented by celebrities cause that's where they go for attention right? /s",
              "id": 36,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "\"That girl needs to learn the world doesn't revolve around her\" because *obviously* OP is the one it revolves around. /s",
              "id": 37,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "If this celeb gave a minute or two to every random stranger who wants something from them, they would have no minutes left for the daughter.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "YES. When OP said that about the celebrity’s daughter not having the world evolve around her my first thought was it probably never does. This kid is probably so used to having everything evolve around her mom and her parents having to be absent for events or whatever. The least the kid deserves is a day all to herself.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3943,
          "content": "YTA OP celebrities and famous people are just people who have the same rights and privacy all of us other non people do. I will never understand why people get so bent out of shape on a reaction from one of them as rude when they literally don’t owe us or anyone else a single thing. They have jobs like we do.",
          "id": 40,
          "comments": [
            {
              "score": 2401,
              "content": "Yep. Reading the title, I was thinking it would be the celebrity ACTUALLY being rude -- thinking they can cut in line because they are famous, being shitty to waitstaff, something like that. Simply declining a picture -- on their daughter's birthday, no less -- is not rude, it's just them trying to live their life.",
              "id": 41,
              "comments": [
                {
                  "score": 1099,
                  "content": "And even her security staff wasn't \"rude\" they were doing their jobs. They HAVE those jobs because of annoying people like OP and her daughter.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 396,
                      "content": "Yeah. It sounds like they politely explained the situation and hoped for OP's daughter to show some basic empathy.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 328,
                      "content": "And one minute for this fan...and one minute for that fan...and one minute for another fan.  Unless you're at ComicCon, leave them alone.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Those security guards wouldn't even be where they are today if it wasn't for annoying, pushy fans. They *owe\" her!\n\n(Major /s)",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 741,
                  "content": "At the very least I assumed the interaction was with the actual celebrity, not a member of their staff.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 398,
                      "content": "That's a good point, OP's entitlement to an interaction with this celeb at a very private event is astonishing, it hits both r/entitledparents r/EntitledPeople and r/SelfAwarewolves",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Well when you read why she wrote on social media she made it sound like it was her not that someone else said it. I pointed that out in my comment m",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 109,
                  "content": "Honestly, I thought this too until I read the full story. Wow the pot really doesn’t see the kettle in this huh??",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 99,
                  "content": "Right?? I lived and worked in an affluent area in high school (boomer parents living above their means) and I interacted with a few celebrities. The one that stands out are the Williams sisters--Venus and Serena--because I'd see them at the gas station at least once a month. What'd I do? Wave on my way to/from my car, say, \"Hi, Ms. Williams!\" with a smile, and let them continue their day.\n\nNone of the celebs remember me, and I'm okay with that. They have their own lives ffs",
                  "id": 50,
                  "comments": [
                    {
                      "score": 37,
                      "content": "I feel like I would remember an interaction like that. They may not know your name, but I bet they remember the nice \"fan\" who just gave a passing hello",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "I have had a few people tell me they’re famous. I recall Curt Schilling introducing himself. I said nice to meet you. He said, I’m famous! I said, oh what are you famous for? Baseball!! Oh, I don’t really follow baseball. I later found out he was pretty famous.  It he wasn’t very nice.",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "I grew up in an affluent area (I went to school with Phil Jackson's kids) and seeing Michael Jordan around town was a thing that happened to most people at one point or another. It was cool but we were raised not to bother other people unless it was necessary.",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "People throw out the word rude when someone tells them no. And yes, a picture might take a minute, but how many requests for pictures does a celebrity get in one day? One picture leads to more as people see what's going on.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Also it’s important to not interrupt A’s time with her daughter on her daughter’s birthday. Imagine being the daughter, and finding out that even on your birthday you can’t hold your mother’s attention because *fans*. Yikes.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Right! Lol",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "All the posts on here from entitled people, I just knew it was going to be they didn't get an autograph or photo 😆",
                  "id": 57,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Lol right? Sad how many commenters think what OP and her daughter did was perfectly acceptable because “they owe us.”",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Right. The fact they gave OP a reason (celeb's daughter's birthday) is more than they owed her and I am shocked it was not enough for OP considering she is out with her own daughter. \n\nI'm inclined to think this post is real - it would be too petty to make up.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "same, i thought it would be the mom sharing or posting a genuinely shaming post (like james cordon 💀) and the daughter was upset about it.",
                  "id": 60,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 327,
              "content": "Exactly! I don’t get why people worship and idolize celebrities so much. At the end of the day they’re just entertainers and don’t owe anyone anything.",
              "id": 61,
              "comments": [
                {
                  "score": 420,
                  "content": "There's this one famous actor who summed it up pretty well. He said, \"My work is for the people. My life is for myself.\"",
                  "id": 62,
                  "comments": [
                    {
                      "score": 103,
                      "content": "Yep it’s a job. That’s literally their job. Good or bad. They don’t owe us or anyone else anything because of said job.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Only about 100 years ago, actors were thought of the same way as a lot of people up until recently thought of sex workers. They were considered “low” on the social ladder instead of on the highest rung. It’s kind of interesting that it’s the polar opposite now. \n\n(I am not frowning upon actors or sex workers. As long as the individual is happy in their current situation, they should be allowed to live their life how they want in peace.)",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "1 million percent agree! Let them be people and respect their privacy! Unless you’re paying for a set up meet and greet. Don’t go up after them. Not ok. Specially these days.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 233,
              "content": "Indeed. I have a friend that played pro football and the things people would do just astounded me. Walking right up to our table interrupting our conversation, asking how much he paid for his watch....no boundaries at all.",
              "id": 66,
              "comments": [
                {
                  "score": 249,
                  "content": "Not even a celebrity, but one of my friends is a fairly popular influencer in a niche field that we both work in. We were both at a conference recently, which was exciting, as we work on opposite ends of the country and haven’t seen each other in person in years. I had somebody come up to me at dinner and ask if I would move over so that she could sit next to my friend. She was like “sorry, I’ve just been a fan since the beginning and we’ve collaborated on some content so…” I was like “oh cool, I’ve been her best friend since before Instagram existed.”",
                  "id": 67,
                  "comments": [
                    {
                      "score": 136,
                      "content": "“collaborated on some content” probably meant “I once made a suggestion in my comment and she sort of used my idea.”\n\nSuper rude to suggest to you that you should move. Your friend would have been able to initiate that if she’d wanted to.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "OMG. That sounds like “we’ve kind of met” on her part.",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I was a kid and Clyde Orange from the Commodores took me and my bro to McDonald's. People were all over him. It seemed so weird to me. (My dad was friends with them and did security whenever they were in Tuskegee. We were spending the day on his Yacht. 😅)",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I was bored in Atlanta once so I decided to do the CNN tour.  After it was finished, I came down to the cafe in the main entry way and grabbed a drink.  I sat for awhile enjoying the atmosphere, and a few tables away, Sanjay Gupta took a seat with his lunch and started chowing down.  It was neat to spot him, and I gave him a nod and a smile, he returned it.  However, as he was probably wolfing his lunch down so that he could go back to work, he got interrupted by at least three groups of people requesting autographs.  He was nice and gave them what they were looking for, but c'mon! He has every right to enjoy his lunch in the cafe like everyone else w/o being approached by strangers.  Had he decided to attend an expo, sure, he should expect fans swarming around him.  But eating his lunch on a workday?  Really?  I know there are no rules written about what to do here, but I would think common courtesy is to let the celebrity do what they want to do privately.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "That’s crazy! My partner looked like a college basketball player for a team near where we used to live. Little kids used to run up and ask for a picture and autograph but he had to reason with them that he couldn’t be the guy because he was 7 inches shorter",
                  "id": 72,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 88,
              "content": "Do you mean non-famous people? I agree with your wider point, but I don’t class myself as a non person!!",
              "id": 73,
              "comments": [
                {
                  "score": 120,
                  "content": "Well some of us are non people. As a matter of fact my pronouns are un and non.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 80,
                      "content": "I would love to hear you say that to some traditionalist in real time so they could try to process it.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "My gender is Borg. My pronouns are we/us",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "I live in NYC (Manhattan) and run into celebs all of the time walking their dogs, taking kids to school... whatever. \n\nNYérs like myself nod/smile and LEAVE THEM ALONE (most of the time I don't even realize its them until two blocks later).  Paps and tourists hunt them down. It's disgusting that they can't even take their dog for a shit without people harassing them. This \"A\" woman was trying to be a normal, decent, loving mother. \n\nPeople need to be respectful and be happy to even be able to see their fav celb in-person FOR FREE (not a ridiculously overpriced Ticketmaster ticket)! Acting like a self-entitled psycho will get you nowhere in life.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "The proper time to approach a Celebrity is at a convention or event. These are work hours for these people and they are being paid to put up with you.\n\nNot when they're shopping for their kids ffff",
              "id": 78,
              "comments": [
                {
                  "score": 5,
                  "content": "Exactly. Work events are different then private or personal time. For sure.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "There once was a  soap opera star later went on to work in a prime-time series and talked about a fan following his wife into a bathroom once. The fan wanted to take to the wife about the actor. When you are on the toilet, the last thing you want to do is talk to a fan of your husbands.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Take that girl's picture request and multiply that a couple of hundred people, this is why famous people can't have a normal day out.\n\nFind out if there's a meet and greet and get the picture there.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "OP could have used this as a teaching moment for her daughter but nope. Celeb families face enough challenges, leave them alone. Most people will never see celebs in real life; if you want bragging rights, having seen them in person is good enough.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Celebrities should definitely have a respect and appreciation for their fans. But they're not required to drop everything for them. Even someone who adores their fans and tries to engage with all of them is going to have times when they're busy/tired/just not feeling it. It's normal and HEALTHY to politely decline a fan interaction if you're not feeling it. \n\nAlso a decent fan should know and respect this!!",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3886,
          "content": "This was a chance for her daughter to learn that she's not entitled to other people's time no matter how famous they are. As a woman, she will likely encounter men who feel entitled to *her* time to shoot their shot and this could have been an excellent lesson about respecting boundaries.\n\nThis could have also been a chance for her to learn to respect \"no\" when she was told the first time not to bother the celebrity any more.\n\nInstead, the mother had to make it all about her daughter's disappointment and how the celebrity is responsible for managing that.",
          "id": 84,
          "comments": [
            {
              "score": 655,
              "content": "That was my thought too. Like OP, how would *you* feel if you were just trying to exist in a space eith your daughter and people kept coming up to you and demanding attention? You'd feel upset, violated, and scared. The celebrity has a *security detail*. Why would you or your daughter think it was okay to approach someone who hired professionals to assure their safety in public?",
              "id": 85,
              "comments": [
                {
                  "score": 105,
                  "content": ">Like OP, how would you feel if you were just trying to exist in a space eith your daughter and people kept coming up to you and demanding attention?\n\nwell but it wouldn't apply here because if you're the famous one, obviously you owe your fans your (and your daughter's) time and attention. Otherwise you're rude. /s\n\nNo seriously, these kinds of people, - in these ironic situations where they literally would just have to imagine the exact same situation swapped around, - they always find some weird ass excuse/logic why it wouldn't be the case. Why they are entitled to something and the other is not. To hell with basic human respect",
                  "id": 86,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "I was just reading the memoirs of Cary Grant's daughter (amazing dad btw) and she spoke of how difficult it could be to just have a day out and have him to herself. She was only 20 when he died. She deserved undisturbed time with him.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "My thoughts too. Also many celebrities, when spending time with their children, like to keep out of the public eye, more so to protect their children’s privacy/anonymity. The children didn’t choose to have that lifestyle, and as a good parent they should try and strive for a little normalcy for them. That day was about A making it about A’s daughter’s birthday, not about A bring a celebrity. The child already shares A with the public, so it might have been their bday request. Respect that out in the world there is a time and place, and it’s not on OP to decide when and where that is. \nNo means no OP…",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 155,
              "content": "Right? The only time a celebrity owes you a photo is when you pay for one.",
              "id": 89,
              "comments": [
                {
                  "score": 9,
                  "content": "But they waited four hours in the blistering cold and she still said no!",
                  "id": 90,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Very important lesson on boundaries.  Should children do everything their parents ever want from them (even vicariously living through them) because they'd be nothing without those parents?",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Exactly.\n\n\nAnd where exactly IS the OP now?\n\n\nshe made two measly comments in this thread. She should be here answering our questions.\nHow dare she saunter off and leave.\n\nI'm going to go start a post about how rude OP is. She posted here and expects us to comment on HER post but doesn't stick around to chat with us!!",
              "id": 92,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "I was hoping I would see this comment and glad I didn't have to scroll too far to find it. Perfectly worded and very true.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 329,
          "content": "Lol yes! the lack of self-awareness in that statement was laughable. Damn op, YTA. Celebrities don’t owe you their time, nor should you be that obsessed with any one of them. They’re just people and most aren’t that cool when you do get their time. Whatever happened to ‘never meet your heroes’",
          "id": 94,
          "comments": [
            {
              "score": 12,
              "content": "Especially when they’re with their kids! The damn gall of this woman. Just…wow.  I’m glad nobody is on her side, especially glad her husband isn’t. \nOP one min with your daughter? You realize that if she allowed your daughter then she’d have to allow everyone else then her daughter’s day is ruined. GOOD FOR THE SECURITY!!!",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 213,
          "content": "YTA. Her time with her daughter is more important than having it disturbed by posing for a picture with your daughter. Maybe try using this to explain the importance of family to your daughter.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 137,
          "content": "Right? This couldve been a teachable moment. Yet OP decided to be an entitled ass.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "Well let's be brutally honest here. Nobody in the entire world owes anybody a damn thing. YTA op.",
          "id": 98,
          "comments": [
            {
              "score": 14,
              "content": "I hope you're wrong, my sister is supposed to pay me back some money today lol",
              "id": 99,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "How entitled do you have to be. An exception needs to be made for OPs daughter. After all the celebrity's own children should take a backseat to OP's daughter.\n\nThen you have, if the celeb gives 1m to OPs kid, then they have to give 1m to every other kid.",
          "id": 100,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Lol I came to say the same thing,  like you mean A's daughter or your daughter  ? YTA",
          "id": 101,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 22231,
      "content": "I understand being disappointed but famous people are still *people*. One minute plus one minute plus one minute eventually adds up, especially on their kid's birthday \n\n>My daughter was very upset because she’s been a fan of A for a very long time so she tried again for a picture but was turned away. \n\n>isn’t going to ruin her day and if it does, that girl needs to learn that the world doesn’t revolve around her. \n\nHuh, I wonder if those two thoughts can be tied together in some sort of life lesson that fits this situation...\n\nYTA",
      "id": 102,
      "comments": [
        {
          "score": 2909,
          "content": "Yes, this is exactly what I thought when I read about how the girl needs to learn the world doesn't revolve around her lol. The same applies to OP and her daughter. \n\nAlso, this is why I dislike people who have this crazy fan mentality. I don't understand how people can be so obsessed with celebrities to the point of being intrusive to their personal lives. \n\nAnd then they act so entitled by saying things like \"xyz celebrity wouldn't be where they are today without their fans\".",
          "id": 103,
          "comments": [
            {
              "score": 705,
              "content": "Exactly. Doesn't being a fan imply that you feel generally benevolent toward the celebrity and desire their well-being? And if so, how do you justify harassing them when they are trying to focus on family?",
              "id": 104,
              "comments": [
                {
                  "score": 556,
                  "content": "I'm gonna use myself as an example.  My small town would sometimes have celebs come to take min vacations because it was so out of the way paparazzi never seemed to be around.   Went to a  restaurant, Noticed a TV Celeb who was pretty popular at the time at a table. Saw him, internally freaked and went to my seat at the bar and ordered my burger and onion rings.  A bit later he came up to order a drink and Said Excuse me because the Bartender was right in front of me.  I said no Problem Mr. XYZ.  He looked at me for a sec and said thanks.   When his drink came I told the bartender I'd get it told celeb I was a fan and least I could so was get his drink for him.  Thanked me, patted my back and sat back down.  When he left he came over, shook my hand and asked my name.  Said thanks again and that was it.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 351,
                      "content": "Ugh, I'm so nosy I really want to know who it was, LOL.\n\nI saw Ricky Gervais walking on Hampstead Heath, and we made eye contact and he said good morning, and I said good morning, and we both went on our way. That was nifty.",
                      "id": 106,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 214,
                      "content": "Years ago I was celebrating a friend's birthday at a dessert restaurant. Jim Carrey came in who she was a huge fan of. I waited until he had finished eating and then if he could come by our table to wish her a happy birthday . He declined but did pay for a large cake for our table. We were all thrilled with that it never occurred for us to be angry he didn't give us any of his time",
                      "id": 107,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 92,
                      "content": "And this is how it should be. Regardless of the fact that their job makes them famous, it's still separate from their actual lives, just like our jobs.\n\nNobody is out here flagging down the butcher when they see them at the mall and trying to get a picture and discuss all the cuts of meats he deals with. And they shouldn't be.\n\n\nOP YTA and you're teaching your daughter to be one too. A's daughter probably learned a lesson herself too: just because someone calls themselves a fan of Mommy, doesn't mean they're a good person. I'm sure you made A uncomfortable, and made her daughter feel scared. (Not to mention most celebs try to keep their kids out of the limelight; some outright refuse to tell their kids they're famous...A's daughter might not realize A is famous and OP and her daughter just came at her and her mom out in public and it was probably frightening tbh)\n\nBut that's just that particular action.\n\nYou also went on social media to attack a celebrity who literally does not give a rats ass about you so you could feel superior and justified in your nonsense. Again, showing your daughter exactly how NOT to act.\n\nHighly suggest you do some growing up before you end up teaching your daughter all the wrong ways to be.",
                      "id": 108,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 65,
                      "content": "I remember seeing two of The Backstreet Boys at the mall. I didn’t wanna bother them so I let them be. Later on, They got in line behind me at Hot Dog on a Stick, since we were just standing there, that’s when I spoke to them. Same thing when I was in line behind Neil Patrick Harris at a Hallmark store. The registers went down and we were stuck waiting and we had some nice chit chat. He even gave me a hug before i left. Because I wasn’t interrupting them, nor was I loud or drawing attention, to anyone who didn’t recognize them, we were just stangers making conversation while waiting in line. On the flip side, J Lo ans her kids once came into Build A Bear when i was a manager there. It was Christmas time, peak hours. She was followed by paparazzi. Some people couldn’t even see who it was, they just knew it was a famous person and rushed into the store. We had to kick everyone out and close the gate (costing us our projected sales for the day because she only spent like $100, but we had to close for her to do it). She was just trying to have some fun with her twins for Christmas.",
                      "id": 109,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 20,
                      "content": "I live in a country where at the time it was incredibly unusual to see Hollywood celebs so when one who I was a massive fan of walked into my store I was so shocked I couldn't believe it was them.\n\nInternal freakout and then pulled it together to serve celeb and they were just soooo lovely. Had a really great interaction with them, they said it was nice to be somewhere where they weren't mobbed by fans, where they could go out shopping by themselves without being followed by paps, that it was nice to just be able to be themselves for once.\n\nCoworker and I managed to refrain from asking for autograph which was so difficult lol but celeb asked our names, shook our hands, thanked us for helping them out and then left to continue their day off exploring our city before going back to shooting the movie they were filming here.\n\nNo one believed we'd met said celeb because no one could believe that said celeb was in our country until it was on the news a week later. But that interaction where we didn't fan girl led to another celeb coming in, and then the costume department coming in and buying up a massive amount of stock for the movie so it was a total win for us playing it cool. Just wish we'd worked on commission, it would've been a great payday lol.",
                      "id": 110,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 20,
                      "content": "Yeah, ran into Clint Eastwood at the local grocery many years ago.  Just smiled at him and kept going.  He was just there to get food like an average person, not to be harassed.",
                      "id": 111,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "There was a famous person On our honeymoon cruise. My husband and I ended up on the same tour she and her family was on. When we were in Pisa she and her friend didn’t have any coins for the restroom so my husband paid for them. 😂. She was very nice and my husband even hung out with her one day at the pool",
                      "id": 112,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "That's what s normal person should do, if a celebrity goes to a place where he expect not to be bothered who are you to bother them? When I see somebody who I respect and admire I don't want to bother them, if we make eye contact I say \"thanks\" and smile and that's all.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 270,
                  "content": "It's the same mentality as, \"I'm a taxpayer/customer, I pay your salary.\"\n\nIt's the same mentality as telling random women that they'd be prettier if they smiled, that a professor should drop everything to make time for a student who can't adhere to office hours policy, or getting mad because your seamstress friend won't create a lavish wedding dress for you for free.\n\nIt's the belief that *their* time and opinions and wants are inherently more valuable because they don't actually see the other person as a whole human. It's not quite solipsism, but it's close.",
                  "id": 114,
                  "comments": [
                    {
                      "score": 18,
                      "content": "It’s self-centeredness, that’s what it is.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Recently dealt with someone like this. I’m very involved in my kids’ school and really trying to make the school safer for everyone so I’m trying to get the city and police department involved. I’ve met with both city officials and PD, invited them to the school so they can see for themselves the situation and also get to know everyone at the school. Basically, just trying to build good relationships between school, city and PD. Along comes this lady and says she wants to help so I was very happy to hear more parents want to get involved. She emailed this particular city official and a police captain and proceeded to demand they come to the school because *they work for the city, we pay their salary so they have to do what we tell them to do.* Then she gets upset because they didn’t reply back immediately. I was so embarrassed, I called both the city official and police captain, apologized and told them we appreciate everything they have done so far to help with school safety and that we know they have their hands full (there’s over 30 schools in our district for a very small police department) and we would love to have them over at one of our school meetings. They both agreed to be at our next school meeting and I told the lady we need to build good, long lasting relationships with city officials and PD and that won’t happen by being demanding and entitled but she said I’m wrong 😑",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "they justify it because they inherently do not view celebrities as people. they probably don’t even realize it, but since they consume their work so often, sometimes they legitimately forget that they are human beings with boundaries instead of proverbial dancing monkeys, and that being a fan doesn’t mean you’re not still a stranger. they’re not really supporters of these people and their well-being, they just believe that consuming and enjoying their work means that they’re entitled to their time. it’s an unfortunate way of thinking.",
                  "id": 117,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Great point! Virtual cannibalism in a way.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Right? Like they give their art and their time to their fans, but they aren't allowed to have any life for themselves? They have to give every single second and every part of them because \"their fans made them\"? That's like your boss demanding he join you and your family on vacations because \"he's paying for it\" or something.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I think what happens is that a fan sees a favorite celebrity \"in the wild\" and all she can think about it is *\"This is my once-in-a-lifetime opportunity to meet this celeb!  I HAVE to take it!\"*  That urge sometimes overrides good sense, and it sounds like it did here.\n\nI'm sorry that it didn't turn out the way u/aitarudecelebrity and her daughter would have liked, but as others have pointed out, being a fan doesn't entitle you to intrude on a celebrity's personal time and space.  Plus, a celebrity's security detail is under no obligation to be polite--in fact, sometimes the only way to get through to an enthusiastic fan is to be rude.  \n\n\nYTA",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "[deleted]",
              "id": 121,
              "comments": [
                {
                  "score": 8,
                  "content": "Right? I don't understand how some people continue pestering even after being told no.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": ">And then they act so entitled by saying things like \"xyz celebrity wouldn't be where they are today without their fans\".\n\n\nThis entitled attitude is what turns off so many sane people from so many fandoms. And seriously, it's also super embarrassing and a poor reflection to the celebrity when someone claiming to be their fan acts rude and entitled in public/to the public/to them. Why would you claim to idolize someone then cause them more stress?",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I don't know what OP does for work, but could you imagine if every person that utilizes whatever they do for income felt entitled to run up to OP and insist upon taking a picture? It's so invasive.",
              "id": 124,
              "comments": [
                {
                  "score": 7,
                  "content": "Haha that's so funny to think about. Doing that to celebrities has just been normalised so much that people don't get how weird it actually is to do something like that.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I live in LA, so you do sometimes see celebs in the wild. The unwritten rules here are never approach at a restaurant/store. I have approached at concerts and sporting events and have some good interactions.",
              "id": 126,
              "comments": [
                {
                  "score": 5,
                  "content": "Ooh I didn't know that. It's nice that there are unwritten rules about such things in some places. Although I'm sure some people still wouldn't respect that and do as they feel.",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 482,
          "content": "And we all know it wouldn't have been just one minute. Posing for the perfect pic. Prob asking for an autograph, wanting to chaf. \n\nAnd if people saw that then more people would also want pics, etc.",
          "id": 128,
          "comments": [
            {
              "score": 401,
              "content": "My boyfriend is a musician. \n\nHe doesn’t get recognized *every* time we go out, but when he does it **is** a time commitment and suddenly he’s working and in work mode while we stand there politely smiling or are forced to move on without him. Even if it’s quick it always takes him out of the moment. \n\nIt used to be really hard for my 6yo to deal with, and he still gets annoyed by it sometimes. I can’t imagine how bad it would be if every single family outing were interrupted. \n\nI’m glad whoever this celebrity is takes the time to focus on her child.",
              "id": 129,
              "comments": [
                {
                  "score": 110,
                  "content": "I am sure it must be so hard!!! Not to mention always having to be \"on\", polite, friendly, etc. And for your kid!\n\nHell my husband is far from famous. But he knows a loooot of people. And we tend to run into acquaintances of his in a lot of places. Our kids even get bugged about it, that he always has to stop and chat for a few minutes when we are on vacation, or at dinner whatever.",
                  "id": 130,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Until recently my dad ran a cafe on a main shopping strip and he got to know *so* many people between regulars, other owners/staff and suppliers. For about 15 years it's been a rare occasion that we walk around that area without running into at least one person who knows him and having to stop for a chat. And kind of like a famous person those interactions will slow down now that he's not working but won't stop for a long while.\nI couldn't imagine what that would be like for a famous person out trying to just have some family/personal time. On top of the disruption the interactions aren't even social, they're one-sided and essentially work for them.",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 182,
              "content": "And the celebrity’s daughter would get pushed out of what is likely rare time with their parent.",
              "id": 132,
              "comments": [
                {
                  "score": 34,
                  "content": "I can't help but imagine the celeb promised her daughter that she would not work at all on daughter's birthday, and interacting with fans is work.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "And we've all been the small child, tired and bored, while our parent chats to another grown up about boring stuff. How much worse when that's fifty times a day and it's complete strangers?",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "And of course, if she stops for \"one minute\" for OP's daughter, then she'll have to stop for \"one minute\" for everyone else who wants to intrude on her day. Those \"one minutes\" add up. Unless OP thinks her daughter is a special little flower who deserves it and to hell with everyone else. Which it seems might be the case here.",
              "id": 135,
              "comments": [
                {
                  "score": 12,
                  "content": "Exactly. True she probably wouldn’t mind a quick photo with a fan, but once she opens that door, others will come running. It’s fairer to everyone to just say sorry, not this time- and fair to the celeb and her daughter who just want quality time together. Celebs are still people.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Then posting the picture on social media. Tagging where they were. Then her friends and family are suddenly there. And now A is bombard with attention and her daughter is being ignored.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 176,
          "content": "The post reminds me of that [video where Justin Bieber](https://youtu.be/-Ijbi1Ryyz0) very sincerely asks fans to please not crowd the entrance to his building because it’s his home and he just wants one place he can have some peace and he’ll greet them literally anywhere else. At the end, without missing a beat, one of the girls asks him for a hug. \n\nIt would be NAH if OP asked and was told no (although I’m of the belief you should leave celebrities alone in public, save it for a meet and greet) but the fact that she kept pushing after being told it was celeb’s daughter’s bday alone makes OP YTA. Then she turns around and thinks it’s a good idea to post trying to drag this celeb for wanting to celebrate a bday in peace? Mega YTA.",
          "id": 138,
          "comments": [
            {
              "score": 50,
              "content": "Such a huge fan, now let’s post terrible things about her. If they really liked and respected her, that wouldn’t have happened.",
              "id": 139,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "I remember seeing a photo of Justin Bieber eating at what looks like a cafe in Australia and there are like cops holding off about 200 random fan girls just standing there while the dude is just trying to eat\n\nLegitimately actually felt bad for the dude just trying to eat a sandwich and talk to the people he was having lunch with while being gawked at like a zoo animal by strangers",
              "id": 140,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I remember realizing how hard it would be to be a celebrity way back in the heyday of tumblr. An actor in a very popular tumblr fandom was spotted by fans and explained that he was busy and not doing signings or photos. One girl followed him (because obviously he didn't mean her) and he politely but firmly told her off. \n\nShe then made a post on tumblr about how the show and fandom was the only good thing in her life, she had social anxiety and was now completely crushed, her mental health ruined, and so on. \n\nI just can't imagine being a celebrity and having thousands or even millions of strangers putting that much expectation and responsibility on you 24/7. Like people insisting their lives are ruined because you were trying to get to your friend's dinner on time or go home after work or parent your daughter or whatever.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 138,
          "content": ">famous people are still *people.*\n\nA comedian was signing things, and taking pictures with fans, after his performance. I waited in line with plenty of other people. When it was my turn, I had no intention of taking more of his time than others got. \n\nI mentioned something I knew he'd understand given his stand-up, and I thanked him. This man instantly shifted from being funny, to just incredibly kind and compassionate. He stepped aside to share a little knowledge, and I thanked him again before getting my pic and leaving.\n\nThis guy was literally there as an extension of his job, gave me an extra minute or two, and I still can't get over how kind he was. He didn't owe me that extra time. \n\nMeanwhile, OP's working on some serious entitlement. Celebrities aren't there to perform on cue. That person had every right to set aside their job and just be a parents on her kid's birthday. YTA",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 89,
          "content": "She is sooo close to getting it.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 73,
          "content": "On my wedding day, I had this big plate of food in front of me.  I was starving but I could only get maybe like 2 bites in because every guest kept coming up to me.  It was exhausting, and it's the standout memory of my wedding day.  Not marrying the love of my life, but the anxiety from people pleasing all day. I imagine that's what it's like for celebrities x 100.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "I call this the \"wind chimes\" theory after a section in the contract for the first apartment my wife and I rented. It specifically forbade tenants from hanging or displaying wind chimes. She didn't care as we aren't exactly wind chimes people, but she also thought it was ridiculous to specifically ban.\n\nThe way I explained it is \"sure, if only one person has wind chimes, it's not an issue, could even be nice. But imagine that EVERYONE hangs wind chimes. Would THAT be nice?\"\n\nIt's easy to think \"I'm just one fan, surely they can spare a minute for me\" and they'd probably agree. But it isn't just one fan. It is NEVER just one fan.",
          "id": 145,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Not just the minutes, but for A’s daughter, what message would that send her if her mom stopped celebrating for photos? That she’s not worth her moms full attention for an hour or so?",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Charles Schultz, the creator of Peanuts, talked about how he would get hundreds of letter from people asking for a sketch of Snoopy, since it would just take a few minutes. But he pointed out how all those minutes would add up, and he would never be able to get anything done.\n\nCelebrities are people, and it's so important to remember that they are entitled to healthy boundaries.",
          "id": 147,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "If I *saw* my favorite celebrity out on the street, that alone would make my day. I can’t imagine being this entitled.",
          "id": 148,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13721,
      "content": "YTA. Seriously - you typed all that out and STILL think you are right?",
      "id": 149,
      "comments": [
        {
          "score": 4389,
          "content": "“Not even my husband agrees with me. Surely Reddit will.”",
          "id": 150,
          "comments": [
            {
              "score": 1795,
              "content": "\"A bunch of people on the internet already disagreed with me, but surely Reddit will have my back.\"",
              "id": 151,
              "comments": [
                {
                  "score": 676,
                  "content": "“Everyone I know thinks I’m an entitled AH but surely Reddit, that notorious bastion of support for entitled women and their offspring, will tell me I’m right.”",
                  "id": 152,
                  "comments": [
                    {
                      "score": 17,
                      "content": "🤣",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "What's sad is that this *still* might not be enough of a wake up call for her. She posted about it once, didn't like the reaction that she got, so she posted it again here. How much you want to bet she'll just think \"nah those people are also wrong, let me post it in a 3rd place to see ~~what people actually think~~ if anyone will finally agree with me.\"",
              "id": 154,
              "comments": [
                {
                  "score": 8,
                  "content": "She can try Parler next",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Maybe a diary with multiple pen colors and switching from left to right handed so it looks like different people would be the safer choice for ensuring agreement.",
                  "id": 156,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 159,
          "content": "Twice.",
          "id": 157,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "For real... They even had time to think it through while typing and still didn't see the blaring YTA sign 😭",
          "id": 158,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Yeah, she needs to sit down, take a nap, and re-read what she wrote. Like 15 times. Maybe at THAT point she'll realize how insane she sounds.",
          "id": 159,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7887,
      "content": "Of course YTA. \n\n1) For making the post and 2) for feeling so entitled to someone’s time. Grow up and teach your daughter that the world doesn’t revolve around her.",
      "id": 160,
      "comments": [
        {
          "score": 3240,
          "content": "The celeb wasn't rude. Chances are they didn't even know you were there. They were having a special shopping day with their child. Security rightly stopped you from interrupting them.  \n  \nYou and your daughter then throw an epic tantrum, dragging the celeb online for... being a good mother? Having a good security team?  \n  \nThe only entitled ones in this situation are you and your daughter. But especially you.  \n  \nYou want to see and talk to a celeb? Go to one of their promotional events. Do not stalk them and try to harrass them while out shopping with their kids. YTA",
          "id": 161,
          "comments": [
            {
              "score": 857,
              "content": "I witnessed a famous sportsman at an airport. He was asked for an autograph and he explained he was with his family so please give him 5 minutes to get them settled. He came back to the kid to sign the autograph. If he didn’t need to do that. Travelling with kids can be stressful. It must be even more so when everyone is recognising you. \n\nYTA OP. Celebs deserve their family time. It’s even more precious when they have to travel so often.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 233,
              "content": "Also, celebrities don’t know if you’re just a super fan, or a crazy person who is going to do something harmful. They already expose themselves to a certain amount of risk by doing organized meet and greets.  If the celebrity was with her daughter out in the wild, it’s understandable she and her security detail are going to be extra protective.",
              "id": 163,
              "comments": [
                {
                  "score": 51,
                  "content": "There have been celebs killed at meet and greets.",
                  "id": 164,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Yup, as a die hard Christina Grimmie fan (she's my profile picture) that was the first thing that came to mind.\n\nYou could be a weird stalker for all she knows...",
                      "id": 165,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Pamela Anderson was kidnapped for crying out loud. \n\nI saw a documentary about it!",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "OP and their daughter are the reasons why celebrities need security 😂",
              "id": 167,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Plus it could've been the celebrities only chance to spend time with their daughter without worrying about paparazzi and fans coming in the way and OP ruined it for em! It would be even worse if A didn't chose to become famous, she was just forced to as a child!",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "She confirmed that the celebrity did not see nor hear them in the comments, it was only the security that did.\n\nSo basically she’s made this post about an encounter with celebrity, who didn’t even know it fucking happened. Wtf.",
              "id": 169,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "If OP & her daughter were at a convention or event, or if they had backstage tickets to a concert , or if they were at a meet & greet etc, then I can understand expecting the celebrity to act a certain way & to be receptive of fans. But the celebrity & her daughter were just trying to exist as human beings in a public place. OP has no ability to differentiate between those two concepts - that the celebrity doesn’t need to be “on” as a celebrity every time they need to exist in a public space.",
              "id": 170,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "And then the icing on the cake, she didn't get the response she wanted before so tried again but asked it differently",
          "id": 171,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7838,
      "content": "YTA \n\n> A 1 minute interaction with a fan isn’t going to ruin her day\n\nYeah, it is.\n\nIt’s not just you and your daughter, it’s fans stopping her all day long. It’s not just 1 minute, it’s hundreds of minutes and she just wants her daughter to have a birthday that’s all about her instead of being interrupted by entitled people.\n\nSociety needs to stop treating celebrities like they’re public property, they’re not. They’re humans that deserve privacy and space and some normalcy.",
      "id": 172,
      "comments": [
        {
          "score": 996,
          "content": "This, you're the only one I've seen so far that talks about this part of the post. If you were the *only* fan that stopped her that day then sure she could spare a minute, but I guarantee you're *not* the only person that stopped her that day, and you're *not* the only person that *will* stop her that day. \n\nA just wanted a simple mother-daughter birthday day without interruptions, any other day I bet she would have obliged OP in her request but wanting *one day* to just be a regular person is not the end of the world, there are 364 other das in the year to request a photo (if they see her again in public or go to a show).\n\nAlso, to add to the \"they're humans that deserve privacy\", look at Brittney Spears, she was in the public eye before she had the breakdown and especially after, you know what all that attention did for her? Nothing. Do you know what some privacy would have done for her? Some kind words? A little bit of space to be normal? A FUCKING LOT.\n\nOP YTA, you need to take a step back and really reflect on the situation, if you were put in A's shoes and were bombarded with photo requests on your daughter's birthday, would *you* have stopped for *every* fan who wanted a picture? Would you tell *your* daughter to get over it and that the world doesn't revolve around her? I bet you wouldn't, your own husband brought up that very point to get you to think about it another way, strangers on the internet have pointed out your hypocrisy and you still don't seem to grasp how selfish you are for *demanding* time and attention from a celebrity.",
          "id": 173,
          "comments": [
            {
              "score": 565,
              "content": "I also feel like people are missing where OP said her daughter was told no then asked again. That second time being turned down was 100% on OP for not teaching daughter that no means no.",
              "id": 174,
              "comments": [
                {
                  "score": 68,
                  "content": "Maybe this is because I also live in a city with a ton of famous people/celebrities/entertainers but like, the general etiquette is you don’t bother someone when they’re eating or with their family. And be polite! They don’t know about whatever parasocial relationship you have with them, so keep in mind you’re approaching a total stranger. This all applies regardless of their measure of fame and whether you’re in LA or Omaha. Like let them have some peace when they’re out just trying to live their lives. It’s not like this was a signing event and the woman was nasty to a child. OP’s attitude is so entitled and rude - like how are you not embarrassed?",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Exactly. Imagine having to have a fucking security guard to ensure you aren't constantly being stopped in public while trying to spend time with your daughter on her birthday.",
              "id": 176,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 611,
          "content": "I remember reading a story once - i think it might be in one of Michael Caine's autobiographies - where he was eating in a restaurant with a friend and saw someone approaching, camera in hand. His heart sank - until she said \"Would you mind if I took a photo of those onion rings - ive never seen ones so big\". Didnt seem to have noticed who he was. Lol",
          "id": 177,
          "comments": [
            {
              "score": 181,
              "content": "I would love if this became a thing.  That everyone who ever saw a celebrity asked if they could photograph some object next to them.",
              "id": 178,
              "comments": [
                {
                  "score": 80,
                  "content": "Or if they could take a photo of you and your friends, because you don't have a selfie stick",
                  "id": 179,
                  "comments": [
                    {
                      "score": 88,
                      "content": "I've done this! The celebrity jokingly mocked us for not wanting him in the pic, so we did another with him in front of all of us, spreading his arms wide. (This was at San Diego Comic Con though, so he was fully expecting and wanting fan contact. I don't think I'd ever approach a celeb in normal life.)",
                      "id": 180,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 53,
                      "content": "i once thought about creating an ig page about doing just this, getting celebrities to take pictures of me.",
                      "id": 181,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Apparently some American tourists near Balmoral asked Queen Elizabeth to take a photo of them (several years ago) not realising who she was. She suggested they get one with her and show their friends later 😂",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I went to see Emo Philips stand-up one time and after the show waited in line to get a picture, then I handed him my phone. Dude takes a great photo!",
                      "id": 183,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "\"And this is a photo of some enormous onion rings- and Michael Caine's elbow.\" 😆",
                  "id": 184,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "So they get even more annoying interactions from a thousand memelords",
                  "id": 185,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 252,
          "content": "I'm in the military, so in certain towns I become D-list celebrity. It gets so, so old having people stop to thank me for my service, and sometimes they make scenes to make a political point. One lady held up the parking lot at Trader Joes to yell about how I'm a real hero, unlike all those politicians, ect. I'm always gracious, because I do like their support, and know it comes from a loving place, but sometimes I really just need to get my burger and get back to work. I always remember that if I feel this way, celebrities must just be exhausted.",
          "id": 186,
          "comments": [
            {
              "score": 134,
              "content": "> It gets so, so old having people stop to thank me for my service...\n\nAnd, they get offended and angry if you don't act grateful enough to suit them.\n\n> it comes from a loving place\n\nNot really.  It was always a political statement.  After 9/11, some political TV and radio personalities told their fans to do it, to show everyone that their party is better than the other party.",
              "id": 187,
              "comments": [
                {
                  "score": 52,
                  "content": "The kids and the grandmas are the best. I'll always take a handshake from a kid or a hug from a granny.",
                  "id": 188,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Yes I imagine grannies have a ring of honesty to them. An awful lot of them probably lost husband's or dad's and uncles to war.",
                      "id": 189,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Exactly. They use military as political props. They don’t actually feel grateful for their service. Because these are the same people who vote against the interests of military. Actions speak louder than words. Other countries don’t fawn over our military. That doesn’t mean they aren’t appreciated. It’s just so weird to me.",
                  "id": 190,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 131,
          "content": "But don’t you understand? Her daughter is a *fan.* Security should stop all the other hundreds of people that just want, “a 1 minute interaction.” But not OP’s daughter because she’s a special snowflake.\n\nCan you imagine being the celebrity’s daughter and just wanting a normal outing on your birthday if your mom was the type to keep interrupting the outing to pose for photos? Would probably make you think your mom cares more for complete strangers than she does for you.",
          "id": 191,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 84,
          "content": "A few years back, my husband had a job that made him a sort of local celebrity in a town of 75,000.  Even at that very small-time level, it was astounding the entitlement people had. Most of the time, people would just smile, say hi - no big deal. But other times we’d have complete strangers just sit down at our table at restaurants. People would barricade him with their shopping cart in Costco for a 20 min conversation. He was totally approachable and friendly, especially with little kids asking for an autograph. But there were plenty of days when he just did not want to go out in public. It could be exhausting and it really gave me a whole new level of empathy for “real” celebrities.",
          "id": 192,
          "comments": [
            {
              "score": 14,
              "content": "THIS! \nI call these people \"time hijackers\".\nFor six years I worked a job that was somewhat a zoo cage/ stage.  The last 3 years were often 7 days a week and often 17 hour days. So I was very protective of any/all of my time while off work and became extremely agoraphobic.\n\"I need to go to the grocery store and get something for dinner... but, nevermind... there might be people there.\"\nPeople were brutal. Mean. Demanding of my time. \n\"I see you've made no effort to call me.\"\n\"Yeah, well I have no clean underwear, sorry you're on the back burner. Because I also need to sleep sometimes.\"\nAny time I would give any of my time to someone, on my terms, it was never enough.\nAnd really, I am nobody. I certainly don't have the income for private getaways or security, so it is a free for all. \nI could never approach a celebrity.\nI could never approach a celebrity.",
              "id": 193,
              "comments": [
                {
                  "score": 7,
                  "content": "Man that’s rough. And if you’re even slightly rude to just one person on a bad day when you’re exhausted from it all, you could get branded as a total and complete a**hole. \nFrom my side - because it was happening to my husband and I was invisible - I was just the observer. And even that was exhausting.",
                  "id": 194,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": "Exactly. It’s not just one minute for one fan. It’s millions of minutes Millions of fans.\n\nOP is TA",
          "id": 195,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I was at an elementary school cross country race in which the daughter of a certain popular former governor/VP candidate was running. People were lined up to get their picture taken with the politician.\n\nI happened to be standing next to her facing the course while she had her back to the course taking pictures with people. I turned and asked \"<Politician>, what age group is <daughter> running with?\" She told me and I said, \"well she's going to be running by any second.\"\n\nThe candidate turned around and not 2 seconds later the daughter ran by. If I hadn't said anything, she'd have missed it.\n\nNow this particular person probably didn't mind the attention, but it does illustrate what celebrities have to deal with. Good for the celebrity in the OP for setting those boundaries.",
          "id": 196,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "“Society needs to stop treating celebrities like they’re public property, they’re not.” HAVE AN AWARD BECAUSE PREACH",
          "id": 197,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3787,
      "content": "YTA. Your entitlement is clouding your judgment. The celebrity owes you nothing and she was with her daughter. \n\nInfo: Out of curiosity how old is your daughter?",
      "id": 198,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 2277,
      "content": "YTA. Even though it could've been a simple , 1 minute interaction, a lot of people forget that celebrities are ALSO PEOPLE!! It's actually insane that you believe your daughter was \"owed\" a picture just because \"they wouldn't be where they are without their fans.\" Celebrities deserve some time for themselves and their families. A was respectful enough to decline, I'm sure she apologized to your daughter too, but you and your daughter also need to learn to respect others, including famous people.",
      "id": 199,
      "comments": [
        {
          "score": 346,
          "content": "It would have been a 1 min interaction with OP's daughter, but once A took picture with one fan, it could very well have entirely derailed her evening because then everyone else wanting her attention could be like \"But you interacted with her, why not me?\".",
          "id": 200,
          "comments": [
            {
              "score": 155,
              "content": "Giving in also sends a message to A’s daughter that her mom can’t even give her one full day to herself.",
              "id": 201,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "And also, A's daughter deserves to have a small bit of time hanging out with her mom without having to ignore her to talk to random strangers.",
              "id": 202,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Think about how many annoying one minute interactions we have all the time that we hate like getting hassled by our boss on our day off or getting hassled by someone at the mall trying to sell us something or getting hassled by some random guy telling you to smile or pulling out your earphones because he wants to flirt with you\n\nOne minute interactions are not necessarily not a bother",
              "id": 203,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 213,
          "content": "It likely wouldnt just be a 1 min interaction. \"Oh hey could you just sign this too? Oh I have to tell you I loved you in bla bla bla...\"\n\nAlso your kid isnt special. If she should stop for ops kid then it stands to reason that she should be expected to stop for every  fan that wants something. And then we're potentionally talking hours when we add up",
          "id": 204,
          "comments": [
            {
              "score": 12,
              "content": "Exactly!",
              "id": 205,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 69,
          "content": "If I was out and about and my boss or clients came up and expected me to work on my day off, I’d tell them that whatever it was would have to wait until I got to work. Celebrities should be allowed days off too. They work their jobs and then they also do events where OP and her daughter can pay to see them and get autographs etc. \n\nOP is a huge AH.",
          "id": 206,
          "comments": [
            {
              "score": 11,
              "content": "Exactly! I do think it depends tho on the circumstances id a boss called you over and if they are willing to pay extra, do or give something to make up! I agree tho that I personally wouldn't want to be called on my day off!",
              "id": 207,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Right, most of us wouldn't be who we are without friends family, teachers, medical professionals, neighbors, etc... does that mean ALL those people get to interrupt our lives when ever they want or we are rude?",
          "id": 208,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 944,
      "content": "YTA, celebrities are allowed to go about their day with their family without having to interact with fans. Once you were told no the first time that should have been it.",
      "id": 209,
      "comments": [
        {
          "score": 23,
          "content": "its honestly crazy that it’s even normal to just go up to a random person, which celebrities are because again *we dont know them*, while they’re obviously out doing something in their own personal time and asking them for a photo. And when they’re out with their kids?? Like give them some space and let them enjoy their day with their friends or family uninterrupted like any person would want.",
          "id": 210,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 847,
      "content": "YTA And you even said it yourself that ' that girl needs to learn that the world doesn’t revolve around her.' Except apply it to \\*your\\* daughter. Can you imagine how many times A's family time has been interrupted by people and that, on her daughter's birthday, she wanted it NOT to happen. Just because someone is a celebrity and you like them a lot doesn't give you the right to any of their time or attention. Find an appropriate time for it and if they say 'No, sorry, not right now', accept it and move on.\n\nETA a word I forgot...",
      "id": 211,
      "comments": [
        {
          "score": 225,
          "content": "Let's be honest, OPs daughter was upset because she didn't get the chance to post a photo that checks two boxes on the \"get internet likes so people think I'm cool\" list: fancy vacation, and a photo with a celeb.\n\nBased on her mother's social media habits, I doubt it was about sharing a private moment with the celeb and leaving it at that.",
          "id": 212,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Also, the wording \"that girl\" is just so fuckin snotty and dismissive",
          "id": 213,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 584,
      "content": "YTA- 1 minute for you times 1000 other people is a lot. I imagine it’s exhausting. Let her have a day with her daughter. If you want a pic go to a convention",
      "id": 214,
      "comments": [
        {
          "score": 184,
          "content": "\"Obviously she shouldn't talk to EVERYONE.  Just me and my daughter.  We're the only people that matter in the world.\"  \n   - OP probably.\nYTA",
          "id": 215,
          "comments": [
            {
              "score": 9,
              "content": "r/imthemaincharacter",
              "id": 216,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Came here to say this",
          "id": 217,
          "comments": [
            {
              "score": 6,
              "content": "*But they have to paaaaayyyyy for that*",
              "id": 218,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}