{
  "post content": "My gf wants to host a game night, but one of her friends has a newborn(4weeks old). The parents want everyone to have their flu shots before they bring the kid over. Maybe it's because I(30yr M) grew up before flu shots were a thing, but I don't feel that I should be required to have a shot to hang out with them. If they are worried about their kid they should get a sitter and leave him at home.\n\nMy gf got pissed and said I was being unreasonable because the flu shot was inexpensive and you can easily get them at a CVS. I am all about vaccinations, but I am not a fan of being told I need to do something for someone else's peace of mind.\n\nEdit:\n\nQuick edit, that I thought was obvious. I am not going to go if the baby will be there, and I don't have my shot. I don't want to get a baby sick/possibly die. I may still be the A\\*\\*hole, but I am not heartless.\n\n&#x200B;\n\nUPDATE:\n\nI wanted to let everyone know that I got the flu shot, went to game night, and it was a lot of fun. Thanks everyone for weighing in; even though I ended up being the A-hole, good to know a few people agreed with me.",
  "id": 1,
  "comments": [
    {
      "score": 21529,
      "content": "YTA.\n\n>Maybe it's because I(30yr M) grew up before flu shots were a thing\n\nJust no. Flu vaccines have been around for more than 50 years. I'm a little bit older than you and have got one every year that I can remember.\n\nAnd the vaccine is just as much for everyone else as it is for you.\n\nGet the fucking shot.",
      "id": 2,
      "comments": [
        {
          "score": 6166,
          "content": "[deleted]",
          "id": 3,
          "comments": [
            {
              "score": 1543,
              "content": "Yeah same, in a lot of Europe flu shot is mostly just given go elderly and kids (and parents of young kids probably idk). So I don't normally get them but if at any stage a doctor recommends I have a vaccination or if a friend or something particularly wanted me to for almost any reason I would because I mean its just a vaccination. All it means is arm can be a little sore or tender for a day.",
              "id": 4,
              "comments": [
                {
                  "score": 464,
                  "content": "Yeah, exactly! European too where the flu vax was generally for elderly/at risk people.\n\nI live abroad now and last year as we got into winter season our work had a nurse come in and give everyone a flu shot, some people chose not to do it, but I sure as hell did.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 521,
                      "content": "It's a good idea to get one even if you're not particularly at risk- sometimes when you get a vaccine it just doesn't work. So maybe your grandma gets the vaccine, but it doesnt work for her, and you give her a very bad flu. If everyone gets one, it just has less if a chance to spread, like a system of redundancies and layers of protection. Instead of individuals holding a little shield that doesnt cover all of them, together you all make a roman turtle that keeps everyone safe",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 126,
                      "content": "Yeah if they right there with a flu shot and the offer like why not? Just like when you go holiday abroad you check with doctor if you need any extra vaccinations and have them done.\n\nGetting vaccinated is really not a big deal and I don't get how the people that have posted on here who don't want to do it to put new parents minds at ease can justify there stance.\nThey not even anti vaxxers who think vaccines are bad, they just too lazy.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yeah same, I get it for free at work if I want. Although FWIW I'm pretty sure I can get it free all over the place in my city— any medical clinic, most pharmacies, a pop up at the public library, etc.\n\nI guess that's the thing about about the government paying for your emergency room bill in Canada; it's a no-brainer to buy the vaccine upfront in bulk at a cost of a dollar or two per person.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "My work had the same thing last week. Unfortunately I just got re-immunized for MMR and hep b two weeks ago and you need at least 30 days or something before you can get a flu shot because the immune system is still compromised, so when i got to the nurse i couldn't get one. But they gave me a Cvs voucher good until next February so I can go and get one for free, and I will certainly be taking advantage of that. It's a great service",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "The UK was like this when I was there. I couldn't get one because I was otherwise young and healthy. But a friend of mine, who was less than 6 years cancer free, had to do a lot of arguing with a doctor to get one because he didn't quite believe her that she qualified as at risk.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 206,
                  "content": "I’ve actually had a fairly bad time with flu shots before (like severe muscle aches and fatigue, can’t get out of bed the next day) but I would still say YTA. One or two days of feeling like shit is much easier than the guilt of getting a child sick and possibly risking their life. I have a family friend who was a healthy 40-something year old woman and died from the flu. You never know how bad it can get. Just get the damn shot.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 95,
                      "content": "I get that too. It means you’re having a good response to the vaccine - it’s working well to build up protection. Also OP, YTA",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Last year's flu in America was pretty scary since alot of healthy adults died from the flu. They all had one thing in common: didn't get the flu shot. Well at least the deaths I read about didn't get a flu shot. Same with a bunch of kids that died. My kids get the flu vaccine every year and I've gotten mine this year. They ran out of vaccines around me last year by the time I could get in for an appt. So from now on I'm gonna get mine early every year.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "[deleted]",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 147,
                  "content": "I used to blow it off until the past few years when someone explained to me that the reason they want everyone to get the shot is that the flu mutates very easily so the fewer people get it, or shortening the time anyone has it, helps keep everyone from getting it. You only give the shot to old or babies or immunocompromised folks (which I am now) then “healthy” people can still get it and give it the opportunity to mutate and still give it to the vulnerable even if they’re vaccinated.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I used to blow it off until I actually got the flu. I was completely useless for a week. And then tired and weak for another month after that. Never again!",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": ">You only give the shot to old or babies or immunocompromised folks (which I am now) then “healthy” people can still get it and give it the opportunity to mutate and still give it to the vulnerable even if they’re vaccinated.\n\nYou just made the entire case for herd immunity in one single sentence.\n\nWhat people don't understand is that it's no use only vaccinating the people at real risk, because if they are, it generally also means that their immune system is not good enough for the vaccine to be effective anyway.\n\nBut go explain \"healthy\" people that they need to get stabbed with a needle for the benefit of others when there's basically nothing in it for them personally... yeah.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I need to say thank you for this info.  I wasn't going to get the vaccine,  haven't for almost 20 years because I had a bad reaction once. I am going to get one now. I thought it was only hurting me to not get one, but I don't want to be part of the problem.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I get that, but I do want to just say something. I'm not classified as immunocompromised anymore (used to be) but most shots tend to absolutely wreck me for a few days. I have all of my necessary vaccines, but I had the flu shot two years ago and spent the following three days puking my guts out. The meningitis shot stopped me from moving the left side of my body for two days. For that reason, I get the shots that have a long term effect, but I don't get flu shots anymore. My doctor agrees that it's not worth the havoc it wreaks. I have all my shots, except for the flu shot. \n\nOP should get the flu shot as long as it doesn't otherwise affect him severely, but vaccines can absolutely cause more than a little pain in someone's arms. I'm NOT antivax. I'm very very pro vaccine. But the flu shot is my one exception, depending on the situation.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 9,
                      "content": "If your doctor agrees then of course don't take especially flu ones. Considering those ones most don't take in europe anyway because not recommended if it has a big effect on you that's fair enough.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I teach so I get one every year anyway.  My husband jokes on flu-shot day “Hey honey, ready to go get punched in the arm?”",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "flu shots are available for everyone. the more vulnerable get them at a lower cost/ free depending where you live.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yeah anyone can get them (provided it's not a year of vaccination shortages or something and have to ration them).\n\nI'm in UK so vulnerable people get them for free but couldn't find any info on whether non at risk people would have to pay / pay anything for them as nhs website doesn't really talk about flu vaccines excluding those groups.\n\nI'd imagine either wouldn't have to pay or would be a heavily subsidised cost.",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I feel crummy for a day and usually need to sleep for 10 hours after the flu shot. \n\nComparing that against a 10% of getting the flu for a week multiplied by the 30% chance that the flu shot covers the strain I get exposed too, I usually opted not to get it. \n\nNow I have kids though, so flu shot every year.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": ">in a lot of Europe flu shot is mostly just given go elderly and kids   \n\nI mean yeah same here in the US, but what I'm confused about is saying not getting a flu shot is putting the baby at risk? Why? I've never heard that in my life, and I don't think I've ever been questioned about whether or not I'd had a flu shot before being around a newborn.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 3,
                      "content": "If kid too young to have flu shot then it puts the kid at risk because it's currently unprotected and could easily die if get the flu. It is quite common for people around the kids too young to be vaccinated to have those around them have the vaccinations that they can't. Like parents but really anyone, not all parents do this to people going to see the kid, in fact most don't bit it does protect the baby more and increase its chances.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "That's pretty much how it used to be in the US, and it's still not a mandatory vaccine (you don't need it to register for school or anything), but it's increasingly recommended for people who are otherwise healthy but may come into contact with high risk people... which is pretty much everyone. It's very cheap too. Even without insurance you can have it done at pretty much any pharmacy for like $10-$20.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "In 2017 a pro football player at the peak of fitness got an infection from complications from the flu. Dani Carvajal of Real Madrid.\n\n  \n\n\nI'm in the US but I don't think that matters in this case my primary care provider said get the flu vaccine and live on knowing you won't have that risk, no matter how small",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 58,
              "content": "Where I live is the same, and I've never had one as an adult as a result but you bet I would if I could, not even for a kid, just for me to not get the flu",
              "id": 29,
              "comments": [
                {
                  "score": 37,
                  "content": "In NZ children and everyone over 65 is free. If you have a chronic illness its also free.  Even you do pay its $36.00 NZ dollars.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 86,
                      "content": "Preventive care including vaccines are covered 100% by insurance in the US, so OP can't even use the $30 charge as an excuse unless he's uninsured.",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "And a lot of employers will pay for their workforce to be vaccinated (we have a nurse come in and we all get lollipops) because *if you can avoid everyone getting sick with the flu, why wouldn't you?*",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I'm in Canada, and flu shots are 100% free here. I went to the grocery store and they were giving out flu shots in the pharmacy area. Nurses were just stopping people and saying \"Hey, you want a flu shot? C'mon and sit down.\" All I had to do was sign a consent form and get jabbed in the arm.",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 51,
              "content": "Same, my grandmother gets it for free due to her age, and so do other people considered to be at risk.\n\nThe one time I got to receive it for free, I practically made a run for it. \n\nHowever, if new parent asks me to get it (aka pay for it) to be around their newborn, I'd simply grab my keys and walk to the nearest pharmacy,",
              "id": 34,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": ">yet you can bet your ass if someone asked me to get one for the life of their child I would.\n\n\"bUt i dOnT lIkE bEiNg TolD tO dO tHiNgS\" -OPs whiny self centered ass",
              "id": 35,
              "comments": [
                {
                  "score": 5,
                  "content": "\"Fuck you, stop light, you're not the boss of me!\" [Drives into traffic]",
                  "id": 36,
                  "comments": [
                    {
                      "score": 3,
                      "content": "This is basically his argument in a nutshell, and just about as smart.",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "The shot  is not just for the weak. My 48 year-old farmer brother-in-law and in very good health died of the flu 2 years ago. Get the shot.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "same! i’ve never had a flu shot but i’d get one in this case. it’s a couple bucks and five mins. who cares?",
              "id": 39,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Same in the UK. Flu shots are generally only offered to those either old, young or with compromised health.\n\nI need an annual flu shot because I have a heart condition that in turn caused me to have a stroke in my 20's. \n\nI've got young kids, I'm frequently around pregnant mothers or newborn babies (we know a lot of people with young kids or are expecting) it would be highly irresponsible of me to go around and simply not protect myself or those around me.\n\nIf I could protect myself and those around me from ill health, but chose not to, that would make me an asshole...\n\nSo OP absolutely is YTA.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 646,
          "content": "Right? That point made my eyes roll. I’m in my early 30s and I’ve always gotten them, too.",
          "id": 41,
          "comments": [
            {
              "score": 224,
              "content": "I'm in my early 30s and when I was in college they mass vaccinated us for swine flu specifically because it was hitting young adults hard.  They definitely pushed flu shots before that too.\n\nMy job provides them for free so I've had one every year for a while now.  One year my spouse missed his and he got the flu and was down for a month but I was fine.",
              "id": 42,
              "comments": [
                {
                  "score": 31,
                  "content": "People enjoy pretending the swine flu wasn't a big deal. My aunt died from it, and when I had it, as an 18 year old and very healthy otherwise, I felt like I was going to die from not being able to catch my breath during those coughing fits.\n\n\nPeople don't realize how serious some flus can be.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Agreed, people forget that the right flu strain can kill young adults. The spanish flu killed primarily young people due to the kind of strain it was and how it affected the body, and I'm pretty sure we still don't have that many ways of \"curing\" a flu, even today, some tamiflu, maybe, if you get it at the very start, otherwise, you're waiting it out.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Yup, I’m Mexican so ever since the whole swine flu incident it’s taken a lot more seriously. We all know someone who was hospitalized or died from it that year. And the shot is free, you just have to march your ass to a public hospital and they’ll gladly give you one, or you could go to any private hospital/clinic/pharmacy and pay like 8 usd to get it. They also make public campaigns so you could even run into them. (Actually all our vaccinations are free and we make campaigns all the time, that’s the reason why US antivaxxers haven’t wrecked us).",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I watched an otherwise healthy 36 year old code over and over from ARDS from the flu. I helped bag her too when they finally called it. It's no joke",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "My SO missed his shot last year because he was traveling, and he got nasty sick at the end of flu season whereas I just had a cough. Glad both our jobs offer free shots, though!",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 120,
              "content": "In the US, it's only been recommended that everyone get the flu shot every year since 2010. It existed prior to that, but not as something everyone should always get.\nhttps://www.cdc.gov/flu/spotlights/2009-2010/acip-vaccine-issues.htm",
              "id": 48,
              "comments": [
                {
                  "score": 43,
                  "content": "Yeah I didn’t start getting them until recently but it’s certainly the new recommendation by doctors. OP should get the shot if he can afford it.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 70,
                      "content": ">OP should get the shot if he can afford it. \n\nWhich he probably can because it's very likely he can get it for free. Last year my pharmacy in Target gave me a $5 gift card to get the flu shot. So, not only was it free, but they paid me to get it.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I've gotten one every year since the mandate that health insurance cover the shot 100%! Flu shot's are free and I get it while waiting to pick up a prescription, it's so easy to get",
                  "id": 51,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 41,
              "content": "I'm in my 30s, but I was raised (incorrectly) that the flu was just a really bad cold, so not worth it to get the shot.  They weren't widely available when I was younger, it wasn't required for school or college, etc.  \n\nNow that I'm older and know way better, I get the shot, but just saying that I can see where OP is coming from",
              "id": 52,
              "comments": [
                {
                  "score": 11,
                  "content": "39 here, and always though the flu was NBD and just a really severe cold.... Until I got it. \n\nWoke up, went \"OMG *this* is the flu\" and then tried not to die for a couple of weeks. Weeks more to recover completely. \n\nHonestly that was what changed my mind about the flu shot. I always thought they were unnecessary and overbearing. I honestly cannot imagine a small child or frail older person going through that. I've been an asshole in my thinking.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I'm in my early 30s as well and never had a flu shot until I was in my 20s. But I have niblings now and immunocompromised friends, so you bet your ass I get the flu shot now. My parents are old AF though and even though they're the target demographic for a flu shot, neither of them \"believe\" in it. My sister has a newborn and it stresses her (and me) out knowing that grandma hasn't been vaccinated.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I’m 31, grew up in Canada and got them every year through my childhood on. \nA lot of corporate offices will even bring in nurses to administer them now (I’m now in the US). It’s so easy to get, I don’t know what OP’s problem is.",
              "id": 55,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Same! I get it every year. I work in medicine so I have lots of sick contacts and I cannot even tell you the last time I've gotten the flu. I'll get some colds but never a full blown knock-me-down-for-a-week flu. You lose nothing by getting it.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I spaced out and didn’t get one last year, and got the flu two times. You can be sure I already got my flu vaccine this year.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 388,
          "content": "OP’s comment made me roll my eyes. I’m in my late 30s and I’ve gotten flu shots for many years and received them as a child. \n\nI’m a mom too and made sure everyone who around my kid when she was born in winter had the vaccine.\n\nOP YTA. Get the shot.",
          "id": 58,
          "comments": [
            {
              "score": 14,
              "content": "Same here. I had an awful flu when I was 18. Like I probably should have been hospitalized but we had shit insurance. Since then, I have gotten flu shots every year (in mid 30s).",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I never used to bother, but my friends are starting to have kids and it is such a small thing to do that has such a big impact. \n\nMany insurance plans will completely cover the flu shot or at least make it cheap. You can get them at Walgreens and CVS and other quick care places, and my current job and last job both brought people in to give us the shot if we wanted. It benefits you and can save kids’ lives. Actively refusing to get one when it’s so easy and cheap to get and you’ve been specifically asked for very valid reasons is a big asshole move.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 228,
          "content": "Honest question, does anyone know why flu shoots are so popular in the US but rarley used in the EU (at least to my knowledge)?\n\nBasically everyone here in Germany has all the mandatory shots, but I dont know a single person in my generation getting flu shots. It's something old people do, as a flu could cause more harm to them, but that's about it.",
          "id": 61,
          "comments": [
            {
              "score": 247,
              "content": "Australia here - nearly everywhere I've worked in the last ten years has had a day where they get nurses in and everyone lines up, gets a free flu shot and a lollipop then it's back to work.",
              "id": 62,
              "comments": [
                {
                  "score": 144,
                  "content": "You guys get lollipops? I just get a jab in the arm and a boring flesh-colored bandaid.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 51,
                      "content": "No lollipop, but I did get a scooby-do bandaid!",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "We got an apple this year at my hospital, lol!",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 75,
                  "content": "I’m in the USA, but same. We have flu shot blitzes at my work. And where I work you’re required to get a flu shot (unless you have an allergy) or you face disciplinary action.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 135,
              "content": "Germany also has an anti-vax problem, though.\n\n[https://www.telegraph.co.uk/news/2019/08/08/vaccination-rate-germany-dangerously-low-according-new-study/](https://www.telegraph.co.uk/news/2019/08/08/vaccination-rate-germany-dangerously-low-according-new-study/)\n\nand apparently 1/3 people in Germany don't believe that the flu vaccine is safe. \n\n[https://ec.europa.eu/health/sites/health/files/vaccination/docs/2018\\_vaccine\\_confidence\\_en.pdf](https://ec.europa.eu/health/sites/health/files/vaccination/docs/2018_vaccine_confidence_en.pdf)\n\nMight have something to do with it.",
              "id": 67,
              "comments": [
                {
                  "score": 67,
                  "content": "I used to think it was pointless because it always mutates. To be fair, it is a shot in the dark compared to other vaccines. But, like it’s a 0% chance versus a 50% of staying healthy so I get it now- mostly because I have better insurance.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 92,
                      "content": "It's likely even better odds than that most years. Further, if you do get the flu, not a cold... the actual flu, being vaccinated should make it less severe. Most people don't realize this but the flu/complications arising from the flu killed 80,000 people in the US last year. Get a flu shot.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Even if you get a different strains though, the vaccine helps you to basically have an immune response ready to go, so you're less likely to end up in the hospital or die",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Even if it mutates, flu shot helps shorten the duration and reduce the severity of the Flu.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I always compare it to a seatbelt, sure most of the time you're fine without it, and even with it you can still die, but for those circumstances where it can help, you really want to be wearing it.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Also being vaccinated against one strain of a virus means you're more equipped to fight off its family. Even if the flu vaccine guesses the wrong strain, your immune system is still equipped to help ward off the severity of the illness",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Last year my family got flu shots and we all got the flu anyhow - but it was SO MUCH BETTER than it could have been. Because we had some protection from the vaccine, it was over in 2 to 3 days easy peasy.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Interestingly it isn't a total shot in the dark. They base their guess as to which strain will be the most prevalent off of the most prevalent strain in the opposite hemisphere's winter.\n\nThere's still some guesswork and they occasionally choose wrong though.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": ">Might have something to do with it.\n\nDoubt it given the same is true in the UK.\n\nI got flu shots growing up because I had asthma, but when that started to get better I no longer got flu shots.",
                  "id": 76,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I’m in the UK and it’s the same - only the vulnerable (old, young, I think pregnant people too) are routinely offered the flu vaccine.",
                  "id": 77,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 101,
              "content": "In Alberta Canada the flu shot is free, for everyone. And everyone is encouraged to get it because even if the flu won't kill you it could kill someone who cant be vaccinated like a 4 week old baby as in OPs post or an immunocomprimzed person, as well as of course old people. The flu shot isnt just about protecting yourself. But in the line of protecting yourself, the flu can lead to other serious medical conditions such as pneumonia or meningitis. One year the flu gave me such severe tonsillitis that my tonsils abscessed. Just because a person is young and healthy doesn't mean the flu can't be a serious illness",
              "id": 78,
              "comments": [
                {
                  "score": 7,
                  "content": "I usually always get the flu shot - 3 or 4 years ago I didn't get around to it and ended up getting the flu just after Christmas.  I was in bed for 4 days, couldn't eat, could barely move.  I'm a healthy 30 something and it knocked me on my ass.  I make sure to never miss the shot now.",
                  "id": 79,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I was one of the first people in my city to get the swine flu when it first broke out (I think it was 2009). I worked at IBM so it was a pretty big call center. My kiddos also got it from me. It was a miserable 5 days and would have been worse and longer without tamiflu. When I got better and back to work 90% of the call center was out with the swine flu. There was a shortage of Tamiflu too and I'm kinda grateful we got it before everyone else so there was still some in stock.  Also screw the guy that walked by my cubicle coughing his ass off without covering his mouth.\n\nNow I get the flu shot every year because that was the most miserable sick I have ever been!",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Where is the easiest place to get it in Alberta? Do they have it at places like shoppers drug Mart?",
                  "id": 81,
                  "comments": [
                    {
                      "score": 4,
                      "content": "They do, also AHS has a list of various flu shot clinics in your area.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Yep, Rexall and London Drugs too.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Yes. I walked into the Independent grocers in my small town at 7:40 p.m. last Friday and by 8:03 I was back in my vehicle, groceries bought and bandage over my flu shot site. I got a bit of a bruise this time and in the past I’ve gotten a sore arm or felt punky a couple of days.\n\nI’ve also missed my flu shot once due to surgery and recovery and immediately got the flu when I returned to work. I thought I was going to die. I could barely get tea down and was shaking the bed even with 3 layers of clothes, a heating blanket on fairly high and two heavy comforters.\n\nGet the flu shot.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Most grocery store pharmacies plus london drugs or shoppers will have it as of today I think, before that it was special limited supply.  \n\nEvery year tho i have issues getting it after work because they only put so many out per day and by 5pm they have ran out of the days 'defrosted' supply im always told and to come back tomorrow when a new batch is taken out and prepped for the days usage.",
                      "id": 85,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 72,
              "content": "It probably has to do with things like how our healthcare is organized (with privatized insurance, our doctors aren't overloaded and can easily vaccinate everyone). We generally have horrible work benefits and sick time, so people would rather avoid it. Here's a few different schools of thought on prevention, though. \n\nhttps://www.ecdc.europa.eu/en/seasonal-influenza/prevention-and-control/vaccines/vaccination-strategies",
              "id": 86,
              "comments": [
                {
                  "score": 45,
                  "content": "Do most people get flu shot from a doctor? My impression was that a pharmacy, work place, grocery store, etc. were more typical. It's not like a prescription is required.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 28,
                      "content": "[deleted]",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "I'm in Canada. We have universal healthcare. Flu shots are still a normal thing that most people get. Pharmacies give them, the do it in schools, they hold clinics, the whole shebang. Universal healthcare isn't the issue.",
                  "id": 89,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "I don't get the first part of your answer, do you think that in many countries in Europe people don't get medical care because hospitals are too full? Just trying to understand your point of view.",
                  "id": 90,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "In Canada we have public healthcare, but universal flu shots are also free and encouraged. So I don't think private healthcare/insurance explains it for the US... \n\nMaybe it's just different schools of thought around the effectiveness/cost-effectiveness of vaccinating healthy people?",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Doctors are not the ones giving flu shots. Even if you get one during your physical, a nurse is going to give you the shot while the doctor is not there. You don't need a doctor for a flu shot.",
                  "id": 92,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 58,
              "content": "[deleted]",
              "id": 93,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "We got them when the avian flu was a big concern, I remember getting that one with 0 room for negotiation. This was in Finland. But I also didn’t get it any other time. \n\nWe don’t really have that much of a concern re: the flu to the best of my knowledge. Like, it’s just not as much of a yearly epidemic in Europe as far as I understand it. In the UK they strongly suggest the young, the chronically ill, and the elderly get it every year and it’s 100% covered by the NHS for the demographics that qualify.\n\nEdit: also the recommended/strongly suggested vaccines vary by geographical location, I (and every other uni freshman) was scared into getting the new combined viral meningitis shot when I moved here for university (for free because that’s one of the covered under the NHS demographics). But it’s not something they want us to get everywhere as a young adult.",
              "id": 94,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Yeah, in the UK only the vulnerable have them (young, old, pregnant, immunocompromised, healthcare or social workers). You can pay about £15 to get it done privately at a pharmacy but I don't know anyone who ever has.",
              "id": 95,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Flu shots are only given to specific at risk groups here in the UK, so this post is weird as fuck.\n\nI've never had a flu shot here in Scotland.",
              "id": 96,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "They're not very effective, so a lot of people just don't bother.\nIn the UK in 2017 it was about 12% effective, which is basically useless. And the shot has pretty much never been effective enough to actually create herd immunity. So for a lot of people it's just not worth it.\n\nBut the US tends to have a bigger push for it, and the lack of socialized medicine means there's a psychological push to get it.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yes, in Belgium too! Only for elderly People but otherwise we don't do flu shots.",
              "id": 98,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 195,
          "content": "Good lord. The flu has been around for over a hundred years, the first pandemic I see on wiki is in 1890.  The Spanish flu in 1918 killed up to 20 *million* people. Since the development of the vaccine and widespread vaccination encouragement in the 60s and 70s, we have cut those numbers to a mere fraction. Still, the 2009 flu pandemic only (!) killed an estimated *quarter of a million* people. \n\nIt's worth noting that your loved ones aren't the only reason to get your shots. Herd immunity is a big thing, especially in this day and age when immunocompromised people have the opportunity to live longer and fuller lives. It seems kind of dickish to not care who you might infect on a daily basis simply because you don't know them.",
          "id": 99,
          "comments": [
            {
              "score": 52,
              "content": "It's worth noting that the reason the Spanish Flu was so deadly was because it hit young, healthy people -- like the OP -- the hardest.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "A lot of people conflate 'the flu' with a bad cold, or even a day or two of gastroenteritis.  The actual flu SUCKS.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Immunocompromised person here. People need to get their fucking shots.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 153,
          "content": ">I(30yr M) grew up before flu shots were a thing\n\nyeah this idiotic statement told me so much about OP",
          "id": 103,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "You must never of had the flu. I am 31 and thought I knew what the flu was.. boy was I wrong I finally caught the worst flu ever last year and almost died. Was the worst sickness imaginable.. and alll because I didnt get a shot lol.\n\nGo get that shot.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Exactly, I'm a healthy young adult so the flu isn't going to kill me, but it sure might kill the immunocompromised cancer patients going to the hospital across the street! It's pretty common for the parents of newborns to have rules like these. Even if they left the kid at home they could still bring a virus home with them.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Also, 80K people died from flu complications last year. It was the worst season since the 70s... and the CDC is already saying this season is going to be bad, too.\n\nIt's one thing if you have a medical reason, or don't have insurance and it'd be cost-prohibitive. But \"I don't want to do it just for someone else's peace of mind\" just sounds like an excuse to be lazy. YTA. *Get your shot even if you're not going to be around this particular kid*.\n\nAnd just as a PSA: If you don't have insurance, CVS does have a discount card that will make it $25. If you get it in a CVS inside of Target, you also get a $5 coupon. Please get your flu shot if you can.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "It’s not just for this kid but for everyone else.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9614,
      "content": "Yes, if you refuse, YTA. That baby can't get vaccinated yet, and relies on herd immunity to keep from getting sick. Without it, the baby could actually die from the flu. For real. So, either get the shot or stay home.",
      "id": 108,
      "comments": [
        {
          "score": 1656,
          "content": "Its the refusal that makes OP YTA. Flu shots have always been recommended for ppl exposing at risk individuals. Thats nothing new. But now they have normalized flu vaccines to recommended for all.\n\nEdit: so I was just at the clinic and the pharmacy and I inquired about the flu shot. They give you a checklist and I did not meet any of the criteria. None of the risk factors and none of the qualifiers. I consulted the pharmacist and they said then I don't need it. As in they won't give it to me. I am going to ask my GP next visit in 2 wks why not. Anyway one of the risk factors was proximity to infants. OP qualifies.\n\nEdit2: since this post inspired some discussion, I went back to the pharmacy and [took a photo of the criteria](https://imgur.com/a/LWIYk5y). I also asked the pharmacist WHO he recommends to get the vaccine. He was ESL but said, \"seniors and people who are vulnerable or working with vulnerable people\". That's the official line from retail pharmacy. I then went to the clinic and asked their head nurse. She said \"everyone should get it\". That's the medical point of view. I asked her about the form and she said that is how the province is positioning it but that the clinic is basically giving it to anyone who asks for it. She said the pharmacies are probably being scrutinized a bit more about giving them out.",
          "id": 109,
          "comments": [
            {
              "score": 33,
              "content": "As someone in the medical field, my best guess is shortage. Other than that? Bad pharmacist.",
              "id": 110,
              "comments": [
                {
                  "score": 8,
                  "content": "There is definitely no shortage of flu vaccines here and they are [actively pushing for vaccination rates to go up](https://vancouversun.com/news/local-news/health-authorities-urging-b-c-residents-to-give-flu-vaccines-a-shot), and we have the high dose version too for seniors. I'm expecting to get the flu shot; it's free and available from several places within walking distance from my home. I just wanted to do more research to make sure I wasn't abusing the service.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Go to a different pharmacy. The qualifications for receiving the flu shot, according to ACIP standards, is being a living human being. Literally any other pharmacist will give you the shot.\n\nAlso, you should complain about that pharmacist to their corporate office and possibly your state's licensing board. The practice of turning away patients when supply isn't being reserved is not only unprofessional, it is dangerous.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Pharmacist checking in. Can confirm, bad pharmacist",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "I never comment on these things, but OP sounds like a toddler throwing a tantrum.",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 664,
          "content": "Having the flu shot can protect the baby even if the baby isn't there. It lowers the risk of exposing the parents to it, and even if the parents have the shot, they can still bring it back home to the baby.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 83,
          "content": "I think he is staying home. The baby is coming to his house.",
          "id": 116,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "Also, this flu season is reported to be pretty bad so kudos to the parents for being cautious. \n\nSource: www.nytimes.com/2019/10/04/health/flu-australia-america.html\nEdit: www.cdc.gov/flu/about/burden/preliminary-in-season-estimates.htm",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "They also need whooping cough vaccine besides the flu shot. Had to do this recently for my friend's baby. No hassle at all...we went to CVS and it was covered by insurance 100%.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "His home is where they’re hosting the game night",
          "id": 119,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Yeah also “they should just get a sitter” is so tone deaf. Guarantee the entire group is excited to see/hang with the baby. Op is just being stubborn because he doesn’t like “being told what to do”",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Healthy adults can and do die from the flu as well",
          "id": 121,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5518,
      "content": "YTA.\n\n______________________________________\n\nEDIT:\n\nHi all. I think this thread has been well and truly decided as YTA so I wanted to add an edit to explain to a lot of commenters (and readers) about the influenza vaccine because one topic keeps popping up. \n\nPeople keep commenting with something along the lines of 'it only contains three strains and they are a best guess'. This is true. The vaccine contains 3 or 4 strains depending on which you get and they are decided by scientists from around the world based on data they have collected. To call this a guess is, however, not fair to those that do this.\n\nIf you get the flu and you are admitted to hospital your blood is sent for testing and the strain you are infected with will be indexed. The network of centres around the world that keep track of every circulating strain in every corner of the globe at all times throughout the year is a remarkable thing. This gives scientists up to date information on all strains circulating at all times at all locations.\n\nThis wealth of information is then used to decide on which strains to include in the vaccine. Because of the unpredictability of the flu virus they sometimes don't get it quite right and a strain not included will be doing the rounds during flu season.\n\nTHIS DOES NOT MEAN YOUR VACCINE IS USELESS. The strains you have been vaccinated against still exist. They are still circulating. they are still circulating enough that they chose to put them in the vaccine that means they are putting people in hospital.\n\nOn-top of this it may be a case that you got a circulating flu virus that knocks you out for a week. They couldn't put this in the vaccine because of limited resources. However if you had gotten one of the strains that was in the vaccine you may have ended up in hospital. If you get the flu after having the vaccine it doesn't mean the vaccine hasn't worked it just means flu is being a dick this year.\n\n\nEDIT OVER\n\nEDIT 2: 8 day old account and now i have gold silver and lots of upvotes. Thank you strangers.\n________________________________________\n\nYay flu season i get to talk about my research.\n\nSeriously though people are complacent about flu. We haven't had a really bad pandemic in a while but it can still be deadly to edit:(everyone, it can be deadly to everyone) the young and elderly whilst you just end up feeling like shit in a bed for a few days.\n\nThere are new strains in this years vaccine. If you got last years you won’t have been vaccinated against all of this years.\n\nGet the vaccine if you intend to hang around with someone vulnerable that cannot have the vaccine. That is the whole point of vaccines. A subset of the population cannot be vaccinated for one reason or another and worse may be more prone to serious illness so the rest of the population works together to get vaccinated so the subset that cant never has to worry.",
      "id": 122,
      "comments": [
        {
          "score": 486,
          "content": "And doesn’t it take two weeks for the shot to offer the fullest benefit? (I know that’s the wrong wording... but I understand it takes a few weeks to kick in?)",
          "id": 123,
          "comments": [
            {
              "score": 918,
              "content": "You have increased resistance from day 1. Studies show that it generally takes 2 weeks for your body to have developed enough antibodies to be fully resistant but literally from day one you are in a state where you are more resistant because your body has already started fighting the flu and gearing up to make antibodies. If the flu infected you in those 2 weeks you would feel it, sure, but you body would fight it off significantly more quickly than if you hadn't had the vaccine. This will also reduce your ability to spread the virus.",
              "id": 124,
              "comments": [
                {
                  "score": 84,
                  "content": "Thanks!",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Ooh, thank you for the informative and kind response to that person! That was both beautifully kind and also valued by me more than anything else I've heard so far. Thanks again for being kind and beautiful to yourself and US :)",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Also masturbating can raise antibodies.",
                  "id": 127,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Also sometimes people will get the flu and then get the flu shot afterwards, most people then just blame it on the flu shot without realizing.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 165,
          "content": "I don't generally get the shot, but where I live (UK), it's normally marketed towards people who require additional protection. I.e., all the information about it is \"Book your Flu shot now if you're vulnerable towards the flu\", aimed towards primarily elderly people. \n\nIs it a good idea for me to book it anyway, despite being a fairly healthy 28 yr old?",
          "id": 129,
          "comments": [
            {
              "score": 307,
              "content": "I'm in the UK and I have it every year. I'm not part of the vulnerable section. I have it because I got flu for real once (I was a healthy 23 year old) and nearly ended up in hospital with pneumonia. I was so sick for a month and ended up on mega antibiotics. I never want to feel that way again, so I pay a tenner to get the jab. \n\nYou don't have to be part of the vulnerable group for it to be dangerous.",
              "id": 130,
              "comments": [
                {
                  "score": 179,
                  "content": "Yeah, I got the flu around Christmas this last year for the first time ever at 26 and let me tell you, there is no fucking way that I'm skipping flu shot from now on. It was absolutely miserable and I wasn't even \"that sick\" compared to a lot of others, but I was still out of commission for over a week with every one of the usual symptoms and being unable to move.\n\nI legit felt like I was going to die. Get the fucking shot, OP.",
                  "id": 131,
                  "comments": [
                    {
                      "score": 156,
                      "content": "I think a lot of people who've never had flu think it's just like a bad cold. I know I used to, before I actually got it. Soooo wrong!",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "> I legit felt like I was going to die. Get the fucking shot, OP.\n\nI also got flu for the first time when I was 26 and holy shit I felt the same. Fever, chills, and dizziness like nothing I've ever experienced before. I had trouble making it to my bathroom, which was just down the hall. At one point I thought to myself THIS IS IT FOR ME. I also lost a lot of weight.",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "My mum had it one Christmas, a couple years ago. At one point she was so sick she was hallucinating. We were really worried. She and dad have had the shot every year since then.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "People always say \"oh, I have the flu\" and it's like no....thats a bad cold. Trust me, when you get the flu you'll know the difference.\n\nI had it over a decade ago and I still shudder to remember. And I was a healthy, athletic 25 year old! Sitting at the doctor with my mom, head on her lap because I was too sick to drive myself and too dizzy to sit up.",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Got the flu once 16 years ago and it absolutely wrecked me and I ended up in the hospital for a week. And I was an astonishingly healthy early 30s.\n\nNever missed a flu shot since.  Have gotten the flu after having the vaccine (bad strain match, flu was confirmed by doctor) but it was maybe 3 days aches, pains, and a little fever.  Coughed a bit. But proved getting that shot is totally worth it.",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "I'll be honest, I sometimes procrastinate on getting the shot and end up not getting it, but I know that's bad, because having had the flu and having been very, very sick and miserable, wondering if I should go to the hospital, having had those awful secondary infections, I would N E V E R actually choose not to get it, never mind cross my arms and stamp my feet and vocally refuse to get the shot, insisting it's a free country and \"you can't make me!\" I have a cold right now, and ugh, this is as sick as I wanna get thankyouverymuch. Getting the shot is, for the vast majority of humans, better than not getting the shot.",
                  "id": 137,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Exactly.  I always MEAN TO get it.  When I don't it's because I suck.   I'm prone to pneumonia because I have asthma, and I don't fucking want to go through that again.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Thank you for sharing, this is the sort of info people need to understand the importance of the shot. It’s not about not getting a “cold”, it could actually save your life. Perfectly healthy people in their 20s, 30s and 40s can absolutely die from the flu, usually from pneumonia complications just like what you had.\n\nA late-30s man at my work turned septic after developing pneumonia after the flu and died after a week long stay in the ICU, leaving behind a wife and two small kids. As agonizing as your experience sounds, you were still one of the lucky ones. Too many people still see it as being not that big of a deal or something that only ever effects the elderly.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 5,
                      "content": "That's absolutely tragic. I have no words, so sorry.",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Oh my god yes. Well, I get it because I don’t want to infect those that are weak or can’t get it. BUT the one year I skipped it, I got deathly ill for 3 weeks, couldn’t get out of bed, missed work and class, and ended up in the hospital with an IV drip feeling like I was going to die lol. I was a healthy, active 19 year old at the time. The flu sucks!!",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I did end up in the hospital with pneumonia from the flu. \n\nIT WAS AWFUL, GET YOUR SHOTS!",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 109,
              "content": "The flu went around my office last year, despite us all being healthy adults 20% of my coworkers who got the flu ended up in the hospital. I’m 31 but I get my flu shot every year, I have to travel for work frequently and I’ve gone from getting the flu about every other year to not having gotten it in a decade.",
              "id": 143,
              "comments": [
                {
                  "score": 125,
                  "content": "My sister works in a hospital and had a pregnant patient come in with the flu, within a few weeks she'd lost the baby, developed pneumonia and died. I haven't missed a flu shot since hearing that story. I still can't stop thinking about her poor husband, how do you ever get over that?",
                  "id": 144,
                  "comments": [
                    {
                      "score": 47,
                      "content": "That is horrifying. Anyone who hears that story and doesn't immediately get on board with flu vaccines for the purposes of herd immunity must be a complete asshole.",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "As someone who's pregnant, that is horrifying. My husband has never had the flu shot but I told him that if he or our daughter ever gets the flu and they pass it on to me, the baby and/or I could die. There's a free flu clinic at one of the local libraries next week and I'm dragging their asses there to get shots.",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 69,
                  "content": "This is why I'm so sick and fucking tired of people saying it could kill the old or young. NO, actually, it kills perfectly healthy adults, regularly. I almost died, at 21, from the flu.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 21,
                      "content": "My friend’s perfectly healthy 15 year old died from the flu within 3 days of onset of symptoms. I get my flu shot every year in memory of Allison.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "My friend was 19 years old and got the flu. While he survived, the virus destroyed his pancreas. He's now an insulin dependent type 1 diabetic. He also spent a month in the ICU.",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "Yes. Herd immunity is good for everyone. And flu is actually a fairly debilitating disease for the time you are sick (assuming you dont have a opportunistic secondary infection like pneumonia). People think its a slight worse cold, but its like comparing a 10 year old karate practicer vs fighting connor mcgregor. Same idea, but one is seriously going to knock you on your ass (i have had the flu twice, it was literally exhausting to sit up in bed). \n\nHowever, idk how bad flu season is in the UK, and should follow your health organizations recommendations and doctors recommendations",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "Yes. Historically the idea was to give it to the most vulnerable, and it takes time for the medical community to change guidelines. But modern research shows it is most effective to give it to young healthy folks. In fact in a shortage they should be prioritized as their immunity protects the vulnerable elderly better than directly giving said elderly the vaccine. \n\nThe reason for this is because the flu has a very specific season and serial interval (how long it takes to infect the next person in line). So you can think of it like a board game where the flu has a limited number of turns before the game ends. It \"wants\" to infect as many people as possible, but can only move from person to person. So as far as the flu is concerned, the most valuable people on the board are the ones with a ton of connections to other people (e.g. school kids, young adults, people in public facing jobs) . If it gets them, it has a lot of chances to propagate next turn. If it ends up infecting some old folks who never leave the house, its options are limited. \n\nNow from our point of view, think of a game like Pandemic, or on PC, Sins of a Solar Empire or MOO4. If we protect the most well connected points in the game we're much better off. A lot of defense in a strategic location can protect dozens of other points down the line. Even if those points are more vulnerable or valuable, you'd be crazy not to fortify the choke point.\n\nIRL, young active people with many social interactions are the choke points for the flu. They also respond better to the vaccine, and are harder to infect than old folks. As such getting them vaccinated is critical if you want to confound the flu's gameplan and save lives.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Yes. The flu shot helps to slow the spread of the virus, it's not just to protect yourself.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "You won't be eligible under the NHS (unless you have a medical condition that means you need it but you'd know if you did).\n\nI think you can buy one from some pharmacies and they're not too expensive however.",
              "id": 153,
              "comments": [
                {
                  "score": 7,
                  "content": "£11-12 in Boots, Lloyds, etc. Supermarket pharmacies are even cheaper; £7 at Asda.",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I'm offered the flu jab as part of work, but it's not mandatory. In 2014 I had just started and was going to just never respond to the offer, just because the same as you I was healthy, early 20s, never had flu before and jabs aren't a pleasant experience so why would I want it?\n\nWell my husband caught it and it was hideous. I've never seen him so poorly. He was 24/25, in excellent physical condition and also generally healthy. In fact usually, if I catch something he doesn't despite living together.\n\nI've had the flu jab every year since, just in case! This year's didn't hurt at all. I didn't even ache the next day.\n\nETA: also UK. And I know it's anecdotal but for the discomfort for the moment and maybe a bit of a temperature it's worth the peace if mind.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Generally speaking it is only marketing towards the at risk groups because the NHS will only pay for the at risk groups.\n\nI get it every year because i grow my own flu strains in the same rooms the seasonal flu strains are grown for testing so it makes sense for me to have as much protection as possible just incase.\n\nFor healthy adults i would personally say it isn’t worth it unless you know you will come into contact with at risk groups that can’t get the vaccine OR the news is reporting a strain of flu that is abnormal. Think bird flu, this was abnormal because infection rates were fairly unchanged but it was proving to be lethal to many that would be considered not at risk.\n\nKeep an eye on the news. If flu is particularly bad one year the BBC is pretty good at picking up on it here in the UK.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yes.  Yes it is.  Multiple reasons, but the main one?   Your coworker could have a compromised immune system.  Or your parent.  Grandparent.  Coworkers parent.  Your clients.  Your subordinate.  Your boss.  Your coworkers kid.\n\nYou getting your flu shot protects if any of those people have a compromised immune system.\n\nMaybe I'm biased.  My wife went from healthy 31f to compromised immune system due to her treatment for the rest of her life in under 2 months.  These things can come on fast and out of nowhere.  Sure, you personally may be fine without it.  But...  Why risk it?",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yes, do it. Only £7 in Asda. Also cheap (under £15) in Superdrug, Boots, Lloyds, Tesco, etc.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 111,
          "content": "As someone who can’t get the flu vaccine, everyone who can, PLEASE get it. I can’t spend another fucking flu season in the hospital because people refuse to get one of the safest, most affordable, and routine vaccinations. \n\nAnd thank you for your research, and taking the time to explain this to people. I have to get on my soap box every year to my friends and family about getting it. If they don’t care, I do. So at least do it for me and know that there are so many other people that can’t get the flu shot, but can’t avoid the general population either.",
          "id": 159,
          "comments": [
            {
              "score": 29,
              "content": "Always get our shots cause some of my son's friends are immunocompromised! Kinda like my kids friends not dead.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": "I agree with you. I wanted to add that there are also immune suppressed people: some of us can get the flu shot, but we still have severe risks if we get the flu. Anyone with an autoimmune disease taking immune suppressants is high risk. So get the flu shot for those who can’t, and for those who can, but are at great risk if the people around them do not!",
          "id": 161,
          "comments": [
            {
              "score": 28,
              "content": "Yes, this! I'm immuno-suppressed, and ask everyone I come into contact with if they've gotten the flu vaccine. I'm mostly housebound, but if I'm going to spend any time with someone, I ask. The flu could literally kill me.\n\nPlease, please, even if you're fit as a fiddle, you don't know who you're going to be exposed to that may have a compromised immune system, so get the damn shot. You could save someone's life without even knowing it.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Also the flu fucking SUCKS. I got it first time in a few years last year and it kicked. My. Ass. For two weeks and then some during the recovery period. Now I’m so eager to get the shot when I can.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Thanks for your research and input btw.  Indirectly helps my wife not die.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "[deleted]",
          "id": 165,
          "comments": [
            {
              "score": 3,
              "content": "You are right I wrote too fast and have clarified it in my post. I would argue that flu alone can kill the young and elderly whereas if you die when otherwise healthy it tends to be due to secondary infection. That said this isn't always the case the flu can fuck you up either way.",
              "id": 166,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3145,
      "content": "YTA either don’t go or come up with a better excuse than you don’t want to be told to do something.",
      "id": 167,
      "comments": [
        {
          "score": 2289,
          "content": "\"but I am not a fan of being told I need to do something for someone else's peace of mind.\"\n\nThis is like the asshole manifesto right here - he's basically announcing that he hates helping people.",
          "id": 168,
          "comments": [
            {
              "score": 658,
              "content": "Up until this point, I was on the fence. I thought maybe it was a phobia thing that he didn't want to admit to....but nah. He just *didn't want to be told what to do*. It made me double-check the age, because that was such a fourteen-year-old thing to say.\n\nIt's not even that he hates helping people. It's that he will go out of his way to not doing something *just because someone asked for it*. WTF.",
              "id": 169,
              "comments": [
                {
                  "score": 297,
                  "content": "> It's not even that he hates helping people. It's that he will go out of his way to not doing something just because someone asked for it. WTF.\n\nAh such a good point. Because frankly, he should get a flu shot anyways. And maybe he would've, if someone hadn't *asked him to for the health of their baby*.",
                  "id": 170,
                  "comments": [
                    {
                      "score": 154,
                      "content": "Bingo. This isn't just rebellious. It's vindictive.",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Thank you, I was about to say. It's an asshole move to avoid getting the flu shot for no reason. Forget that one particular baby - you're gonna touch the same doorknobs as lots of immuno-compromized people.\n\nOP was told there's someone at-risk in his immediate social circle, and is gonna make a point of not getting the flu shot \"because [he doesn't] like being told what to do\"? What the hell? Get over yourself OP. Even if you don't go to the game night, there's still ways for you to get the people close to you sick.",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yeah, this is about the maturity level I'd expect from a 12-year-old.  Someone needs to sit OP down and explain to him very gently that actually, Johnny, we live in this thing called a society, and in this society there are other people than you.  Part of living in a society is that we help each other out sometimes, or at the very least we don't stomp our feet and act like petulant babies when someone asks us to do something small that will help everyone around us.",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "same!! I was thinking if it was inconvenient location-wise to do it or he really hated shots, like yeah he should still do it but I'd more understand it. But \"I am not a fan of being told I need to do Something\" good lord. \n\n&#x200B;\n\nHonestly - I don't get this attitude. Why not? What is so offensive about someone else wanting you to help them out? Why are you \"not a fan\" of helping out people in a way that you yourself even admit is not a big deal? Do you never ask others to help you out? If someone was sitting with you and you were closer to a pen, so they said \"hey, could you pass that to me?\" would you say \"no, I'm not a fan of being told to do something?\"",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 182,
              "content": "[removed]",
              "id": 175,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 108,
              "content": "Asshole manifesto! Exactly.",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "This is the same mentality of those people who stuck \"FUCK GRETA\" stickers on their big ass trucks as they go rolling coal down the road.\n\nSo offended at the mere *suggestion* that they're wrong that they go full defensive a-hole mode. Fuck you, I'll be even *worse* just to spite you!",
              "id": 177,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "Yeah, Jesus Christ. The nerve of those parents, wanting peace of mind that their four-week-old isn’t going to die horribly of influenza. /s OP needs to grow up.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Exactly. This is something a child would do",
              "id": 179,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I laughed so hard at that. Major asshole vibes.",
              "id": 180,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "You left out\n\n> I am all for vaccines\n\nHe’s saying he is not opposed to getting the flu shot in any way, but just doesn’t want to because they’re asking telling for the situation. Definitely being the AH, and quite childish.",
              "id": 181,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2157,
      "content": "Yta. It's not just for someone peace of mind. The baby can get seriously sick from you. Is it really hard to get a flu shot ? You either should take that flu shot or just stay home.",
      "id": 182,
      "comments": [
        {
          "score": 1157,
          "content": "Be careful, the \"I'm not obligated to care about other people\" crowd could hear you",
          "id": 183,
          "comments": [
            {
              "score": 442,
              "content": "Which is weird. This sub is inherently about society. You absolutely have the right to not get a shot, but the question isn't \"am I required to get a flu shot\", it's \"am I the asshole if I don't\"",
              "id": 184,
              "comments": [
                {
                  "score": 339,
                  "content": "A LOT of people on this sub confuse requirements with reasonable expectations.",
                  "id": 185,
                  "comments": [
                    {
                      "score": 134,
                      "content": "They also confuse 'being an asshole' with 'am I justified in being an asshole.' Lots of threads here lean NTA because they feel the response or behavior is justified, ignoring that's not really the question.",
                      "id": 186,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Just look at the number of people who use legal obligations as a benchmark for how much of an asshole you are. Too many people already confuse legality and morality. You're not obligated to do nice things for people. Still makes you an asshole if you make no attempts at having manners or showing basic common courtesy.",
                      "id": 187,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "The sub literally had a mod post a few weeks ago being like \"stop being so self-centered and learn more about how actual human interaction works\" and everyone ignored it lmfao.",
                  "id": 188,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Wait are you serious?",
                      "id": 189,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Ya, thiiis. Obvs. there is no legal obligation. And yet...this one's not a difficult AITA.",
                  "id": 190,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 62,
              "content": "Lol, you mean the 'your [blank], your [blank]' shitposters. \n\nYour rainforest, your right to burn it down!",
              "id": 191,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "> You either should take that flu shot or just stay home.\n\nI agree with this, but OP's girlfriend is the one hosting, so staying home might not be an option if OP lives with his girlfriend.",
          "id": 192,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Also... isn't doing things for someone else's peace of mind *literally* what it means to be a good friend? Especially if it's not a big deal for you to do it? There's a difference between being your own person and having unchecked control issues. If I was your girlfriend, I'd see this as a red flag that we need to have a serious talk or potentially end things. YTA.",
          "id": 193,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1730,
      "content": "YTA- I'm 34 and get my flu shot, don't use your age as an excuse. There wasn't an HPV vaccine when we were growing up either but that doesn't mean you shouldn't get it. Also, telling someone they should leave a newborn with a stranger because it's an inconvenience to you to get a damn shot is ridiculous. You're not just affecting the baby, you're potentially affecting everyone else you pass by.",
      "id": 194,
      "comments": [
        {
          "score": 432,
          "content": "We've only had shingles vaccines commercially available since about 2011, hpv vaccine since about 2006 and meningitis b since 2014. They weren't around when I was a kid so of course it's ridiculous for me to get them! Also, being told what to do makes me not want to do it. I think my sense of being right is way more important than a 20 minute stop over at my nearest pharmacy and the risk of killing my friend's newborn baby. Does that make me an asshole?",
          "id": 195,
          "comments": [
            {
              "score": 207,
              "content": "[deleted]",
              "id": 196,
              "comments": [
                {
                  "score": 53,
                  "content": "I got the chicken pox as a child, so obviously people survive! People used to get measles all the time like chicken pox, they survived! Kids these days are WEAK. /s",
                  "id": 197,
                  "comments": [
                    {
                      "score": 16,
                      "content": "UGH. I had the chicken pox my senior year of high school. I would drag my kid every single year to get a shot if it was actually required of that one just to spare him that misery. It was awful.",
                      "id": 198,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "I had chicken pox TWICE... don't ask me how that's possible. Best guess the doc thinks is that I had a very mild case as a 1 year old and then got another mild case when I was 13. \n\nReally sucked. So just watch me get shingles... hmm I actually should check to see if I've had the vaccine or not, I get poked with shit frequently I forget lol",
                  "id": 199,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 67,
              "content": "I had shingles in college. Can confirm shingles mega sucks. I wish there was a vaccine back then. 10 years later I finally don't have random numb spots on one side of my jaw.",
              "id": 200,
              "comments": [
                {
                  "score": 7,
                  "content": "I got it a few years ago all over my back. They don’t give the vaccine to my age group (I was 24 at the time) unless you ask for it. They make it seem like Shingles only hits the elderly.",
                  "id": 201,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I’m in my thirties but the same thing happened to me. Last week. Shingles sucks out loud. While it’s nice to still be too young for something, I don’t understand why the vaccine is only available for older people. \n\nHappy cake day!",
                      "id": 202,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "My bf had shingles that turned into meningitis. He ended up in the hospital for 3 days and was in so much pain despite being on pain medication. A year later and he’s still dealing with severe migraines. I was so upset when I discovered there is a vaccine for shingles but is typically given to the elderly only. Nobody should be at risk for shingles, especially when it has the potential to turn into meningitis.",
                      "id": 203,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "[deleted]",
              "id": 204,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "My sister got HPV which turned into cancer, my sister and her husband wanted kids badly, they had to do a surgery to remove part of the uterus which would make having babies difficult, and if it had spread then they would have to take more making it impossible.\n\nImmediately after it was removed my sister got pregnant as soon as possible and had the baby and everything was fine, but the point is that could have not only caused her to never have kids but if it had been left unchecked it could have killed her.\n\nPlease go get your HPV vaccine especially if you are a woman, its a lot more likely to turn into cancer in woman then men, but even if you are a man you could spread it to someone you love so men should also get it.",
              "id": 205,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 274,
          "content": "Hey fun fact they’ve extended the age range for the HPV vaccine to something like 45 for people with a cervix and it has also been approved for everyone to be able to receive it before I think 30 but my numbers may be slightly off.",
          "id": 206,
          "comments": [
            {
              "score": 203,
              "content": "Upvote for “people with a cervix.”",
              "id": 207,
              "comments": [
                {
                  "score": 20,
                  "content": "Just in case anyone is surprised by that language, a phrase like that is used to avoid excluding trans, gender-nonconforming, or intersex individuals.\n\nMedical language benefits from being super descriptive and inclusive, and sometimes that makes it sound kind of funny or odd, but it's for a good reason!",
                  "id": 208,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I mean as a man with one and someone at a higher than average cancer risk this is one of those topics i really care about",
                  "id": 209,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 104,
              "content": "HPV Vaccine is my area of research! The ACIP recommends for routine vaccination up to 26 years for both males and females, and just increased the age for catch up vaccination to 45 years (both sexes). This was very recently passed, however, so I don’t believe any insurance covers any vaccine past 26 years. On mobile so I can’t link properly, but the updated recommendations can be found here - https://www.cdc.gov/mmwr/volumes/68/wr/mm6832a3.htm.",
              "id": 210,
              "comments": [
                {
                  "score": 59,
                  "content": "Glad we got an expert on the thread! Everyone should read this info. I just don't get why people are against vaccines. I got mine in boot camp at 22, because my mom was against it due to it \"encouraging promiscuity\". Which was cool because I ended up getting a leep later that year, and I'd only had two partners ever.\n\nTouch of irony: same mother calls me in tears about a decade later because she needs a colposcopy",
                  "id": 211,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Well, if your daughter is having premarital sex she DESERVES what she gets (obvious /s) . \n\nNever mind that your kid can wait until marriage...but they aren’t necessarily guaranteed a PARTNER who has done the same",
                      "id": 212,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "People should check with their insurance company/ doctor anyway since I got my first dose last December and was covered. It was soon after the FDA approval I think.",
                  "id": 213,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yes, they should! That’s great your insurance covered it; I hope that’s becoming the norm. I can’t say I have much confidence in insurance companies.",
                      "id": 214,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "A very good friend of mine got throat cancer that was from HPV. He survived after a lot of treatment, but the radiation put him at risk for thyroid cancer. Which he now has. \n\nGuys, get your Gardasil. Please.",
                  "id": 215,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I'm a male and have never had the vaccine (it was never offered to me) I just turned 36. Can I get some version of the vaccine, or am I too old?",
                  "id": 216,
                  "comments": [
                    {
                      "score": 3,
                      "content": "You are not too old! However, I would call your insurance to make sure they will cover the new guidelines. They should (and according to some on this thread, they have) be covering it soon because of the new guidelines.",
                      "id": 217,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "It's not just people with a cervix. It's all adults.",
              "id": 218,
              "comments": [
                {
                  "score": 25,
                  "content": "I'm assuming this is in reference to the strains of HPV that cause cervical cancer",
                  "id": 219,
                  "comments": [
                    {
                      "score": 42,
                      "content": "Men can transmit that—they need that vaccine too",
                      "id": 220,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "The caveat is that a lot of insurance companies aren't yet covering it for the extended age range.",
              "id": 221,
              "comments": [
                {
                  "score": 9,
                  "content": "Yep! I got mine when I was older, then got charged 500 dollars for the first dose. Not a great surprise.",
                  "id": 222,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I think the insurance cut off is something like 26.  I know I was just too old for my insurance to cover it when the new better one came out and it was too much out of pocket.  I had the first generation one though, and I am in my early 30s.",
              "id": 223,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "Right—my mom grew up before car seats—she still used one for my baby sister!",
          "id": 224,
          "comments": [
            {
              "score": 3,
              "content": "I'm only 30 and I think my mom says she used a car seat til we were 1. Then we were back seat with a seat belt across the lap til we were 3. Then it was on the floor board in front of the front passenger seat so she could keep an eye on us while I played action figures on the front passenger seat with my back to the glove box.",
              "id": 225,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "In a lot of Europe they don't recommend you get the vaccine unless in at risk group (they don't recommend the opposite but its seen as mostly unnecessary not to mention some years depending on flu strain there can be limited supplies of shots) so it's not really considered much of a risk by scientific community to not have everyone vaccinated, however there basically no harm to having it (a slightly sore arm for a day) and expecting parents to get 4 week old baby a babysitter instead is absurd.\n\nIf you gonna be around little babies and the parents want you to have flu vaccine for that then just do it.",
          "id": 226,
          "comments": [
            {
              "score": 22,
              "content": "The only reason they say this, as you point out, is rationing. The ideal is everyone gets the shot if the supply is available, so I don’t think it’s accurate to say there’s no risk, it’s more of a harsh reality thing. \n\nIt makes sense to focus on the most at risk population first, but it’s better for everyone if everyone could get it",
              "id": 227,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "So it partially depends on where they are. Europe its fro risk groups. For US its everybody. But i didnt know that, so thanks for pointing it out",
              "id": 228,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Or working with an at risk group. In the UK it is expected if not mandatory for doctor's, nurses and other healthcare workers to get the flu vaccine. These parents wanting other's to be vaccinated around their unvaccinated newborn is completely reasonable.",
              "id": 229,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Im 26 and remember chicken pox parties. Chicken pox vaccine in the US was licensed in 1995",
          "id": 230,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I work in a pharmacy. A good 90% of people who come in to get their flu shot are over 50. Age is no excuse. Also there are a lot of people who come in and are becoming grandparents for their vaccinations to keep the babies safe",
          "id": 231,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "It infuriates me that he expects the parents to leave a small kid with a nanny. It needs to be fed every other hour. The parents are not going out into a fancy restaurant- they are meeting friends. Why should they leave the kid at home for this ? Should every parent hide at home for 7 years without socializing because the kid might be inconvenient for various reasons?",
          "id": 232,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1292,
      "content": "YTA. Get a flu shot, you wiener.",
      "id": 233,
      "comments": [
        {
          "score": 86,
          "content": "This made me laugh",
          "id": 234,
          "comments": [
            {
              "score": 13,
              "content": "Me too ahaha. Wiener is my favourite word.",
              "id": 235,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Legit laughed at that",
          "id": 236,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I would, however, not recommend getting the flu shot *in* the wiener.",
          "id": 237,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1090,
      "content": "YTA. You're objecting on a stupid principle. You're not even against the vaccine (which would be stupid in itself), you're just choosing to be stubborn for no reason.",
      "id": 238,
      "comments": [
        {
          "score": 141,
          "content": "It’s because he’s a control freak and doesn’t want any one telling him what to do.",
          "id": 239,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 906,
      "content": "YTA. She wants her friends to meet the baby. It can be deadly if a baby gets the flu. Why don’t you get over your ego or you stay somewhere else and get a babysitter for your childish self.",
      "id": 240,
      "comments": [
        {
          "score": 360,
          "content": "More than that, if she’s nursing, the baby will need to eat every 2 1/2 to 3 hours. Even if she were to leave the baby home, she might have to excuse herself to pump if she fills up. It’s much easier to throw a shawl over and just let the infant eat.",
          "id": 241,
          "comments": [
            {
              "score": 184,
              "content": "Yeah, baby is too young for a babysitter anyways. This jerkhole just doesn't know much about babies so he doesn't get it.",
              "id": 242,
              "comments": [
                {
                  "score": 13,
                  "content": "Guarantee girlfriend knew newborn would have to come when she invited them too. So it's just op who is having an issue. This must be so embarrassing for gf, maybe she should make an excuse why op couldn't come.",
                  "id": 243,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 116,
              "content": "Just about to say this. At 4 weeks her supply is not well established and may not have introduced bottles yet. It’s more than just hiring a sitter to watch the baby sleep. I had to keep inside the first weeks of my baby’s life because of recovery, flu season, and bad air quality (CA wildfires) and by the time we could go out I was majorly stir crazy.",
              "id": 244,
              "comments": [
                {
                  "score": 60,
                  "content": "Also, very few new mothers are comfortable leaving their newborns. And they shouldnt have to. At that age the bond, amongst other things is still being established. \nOP is TA.",
                  "id": 245,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 69,
              "content": "[deleted]",
              "id": 246,
              "comments": [
                {
                  "score": 23,
                  "content": "Currently on hour 3 of nursing a fussy 4-week-old right now.",
                  "id": 247,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Nursing parents and their poor abused nips deserve all of the awards, I hope someone is bringing you cups of tea and snacks while you’re busy with bub.",
                      "id": 248,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "There’s a good chance the mother is going crazy from having a newborn and wants a chance to get out of the house and feel like a normal person again, even if it’s just for a few hours.",
          "id": 249,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Seriously. He thinks they can just “get a babysitter” for a newborn? Dude has no clue.\n\n1. Needs to feed every hour or so.\n2. Many newborns won’t accept a bottle\n3. Unless they are lucky enough to have very reliable family nearby with lots of availability, good luck finding child care you trust with a baby that small. And if you find it, they had better be loaded or paying for a sitter every game night is going to cut into the budget FAST.\n\nIf you have friends with kids, accept that the kid is going to be around and your hang outs will change. Always getting a sitter is NOT a viable option for most parents.\n\nIf you can’t accept that, prepare to lose that friend.",
          "id": 250,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 715,
      "content": "YTA, you say you're all about vaccinations, but won't get one because you say you're being told to.",
      "id": 251,
      "comments": [
        {
          "score": 219,
          "content": "This is what stuck out to me. If you don't want to get the flu shot because you're a tool who cares more about their pride and not being \"told what to do,\" just say that. Don't lie to us and say you're all about vaccines when you've never had a flu shot.",
          "id": 252,
          "comments": [
            {
              "score": 71,
              "content": "I have a suspicion he’s had the flu shot before, but he’s just deliberately not getting it this time because he “doesn’t like being told what to do” or “doing something for someone else’s peace of mind”.",
              "id": 253,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 49,
          "content": "The argument of choice for children, not grown men. Hell the vaccine is free with most insurance. After the pretty bad 17-18 season I’m surprised most people aren’t lining up for shots \n\nGot mine a few weeks ago. In and out in like 5 minutes cmon OP",
          "id": 254,
          "comments": [
            {
              "score": 11,
              "content": "My brother is like this and he turns 34 today. It's such a middle school mentality.",
              "id": 255,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}