{
  "post content": "I(24m) was a family function with quite a few family members for religious reasons. Now my uncle is very religious and thinks he's the most important one in the room. He pushes his personal views on everyone, and he has a bad habit of doing this at the dinner table.\n\nMy little brother(16) is a very quiet and serious person and doesn't really like to involve himself with my uncle(niether do i). As soon as dinner starts, my uncle starts going off at my brother for dating and not being religious. My brother doesn't really care and ignores him usually, and i do too.\n\n(FYI, my uncle loves tea and would force us to make it for him when we were kids). Eventually my uncle says \"you are going to burn in hell with that sl*t\" and my brother broke his silence and responded with \"well if I do go to hell I'll be sure to bring you a cup of tea\". As soon as he said this, I cough out my food and started laughing uncontrollably. \n\nBut things escalated quickly as my uncle got really offended and started shouting, and his son started threatening my brother. So I defended my brother and basically said both my uncle and his son can go f themselves.\n\nMy brother and I left soon after without finishing the food. My cousins left angry messages calling us a-holes and nasty things.  I just thought it was a funny joke and defended my brother from getting ganged on, so am I or my brother really the a-hole here?\n\n\n\n\n",
  "id": 1,
  "comments": [
    {
      "score": 5360,
      "content": "This sounds like something that happens in Turkey (tea and the over religious extended family members)",
      "id": 2,
      "comments": [
        {
          "score": 3985,
          "content": "We are Middle Eastern, so you are right.",
          "id": 3,
          "comments": [
            {
              "score": 1966,
              "content": "I was thinking that sounds like such an Arab experience lmaooo, good on your brother for putting that uncle in his place, more of our relatives need to learn their noses belong in their own lanes tbh",
              "id": 4,
              "comments": [
                {
                  "score": 178,
                  "content": "I have many desi friends (India, Pakistan, etc) and this also describes that culture as per my friends.  Ha.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 118,
                      "content": "In Europe it would probably be beer instead of tea.. \n\nWe all have these weird, abusive relatives. The specifics may differ, but assholes are basically the same everywhere.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Can't even really play guess the religion cause last week had Ramadan, Holi, and Purim.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 958,
              "content": "just be careful .... religion is a very convenient crutch for those lacking a moral backbone . \n\nPersonally every time religion was brought up to me I just stated the obvious : institutionalized religion does not interest me, my connection to God is from my soul to divinity directly, not through following some dogmas invented by dudes that also believed in bleedings, and humors ... this checkmates everybody.",
              "id": 8,
              "comments": [
                {
                  "score": 512,
                  "content": ">religion is a very convenient crutch for those lacking a moral backbone\n\nPure poetry 👌",
                  "id": 9,
                  "comments": [
                    {
                      "score": 79,
                      "content": "Absolutely, this is beautifully put. Filing away for future use...",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 224,
                  "content": "So correct. My dad got back into Catholicism and asked for my forgiveness, not because he was sorry for what he had done, but because he was required to ask as a stipulation to becoming a Catholic. It took me a few more years to see how fucked up that was.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 143,
                      "content": "I just *love* the way religion distorts forgiveness. Just because I'm no longer mad about something I did to you, you have to forgive me.  Like: I'm sorry I stole your car, I know it was wrong. Does NOT mean you 'll forgive me for stealing it. But you're *supposed* to forgive me because I feel bad now and apologized. \n\nEdit: Then I'm worse than you, for not forgiving you, even though you stole something.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "\"And how does God feel about lying and false repentance?\"",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Forgive the behavior so he's no longer responsible for it...\n\nVery f'd up.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 70,
                  "content": "\"Those lacking the Dao will cling to enlightenment.\nThose lacking enlightenment will cling to humanity.\nThose lacking humanity will cling to morality.\nThose lacking morality will cling to tradition \"\n\nGuess where these types are in this.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Late to the party, not knowing if you believe or not, I have to say I love that attitude. It was similar to what my dad said when I came out (other than when my mum shot him down about not having to pay for a wedding because civil partnerships had just been legalised). I was so scared he would reject me due to him being Roman Catholic, and how hardlined no most of the church was against it. He just said, the bible is made up of stories to teach us morals, but we have to understand it was written by men of the time. \n\nAnd instead God judges us on our character, by how we treat people. As long as we try to live a life with as little hard against others, we'll be accepted by him.\n\nI'm not religious, but it does give me comfort. And the rest of his family has followed suit on accepting me as I am.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Exactly this. Even I reply to people like this (obviously in different words), but it always puts my point across. Now, no one in my extended family even dares bring religion in front of me lol!",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Oh Gosh, this is soo beautiful written   maybe you be blessed",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 53,
              "content": "I hate the part of the culture in the middle east that's just, \"always do whatever someone older than you says, even if they are a despicable person\". Like not everyone is deserving of respect or admiration.",
              "id": 19,
              "comments": [
                {
                  "score": 19,
                  "content": "Absolutely , age does not automatically make a person smarter , wiser or correct . A stupid person just has more experience at being stupid .",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "It’s more than the Middle East, many cultures including some in USA, have this belief of elder worship.",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "I'm sure many people on Reddit won't understand the cultural differences. Most middle eastern families value family and honor significantly more than the rest of the world. Your family and those with similar cultural backgrounds will likely say YTA, while we believe you're NTA.\n\nWhen it comes to religion, I've found the best defense is using their scripture against them. I imagine this could work well for you.\n\n\"Let him who is without sin among you be the first to throw a stone\"\n\n\"Judge not, and you will not be judged; condemn not, and you will not be condemned; forgive, and you will be forgiven;\"\n\n\"There is only one lawgiver and judge, he who is able to save and to destroy. But who are you to judge your neighbor?\"\n\nChristianity has tons of scriptures about not judging others. Most religions do. Find some. Make them appear to be the dishonorable one who is attacking their family.",
              "id": 22,
              "comments": [
                {
                  "score": 20,
                  "content": "I guess OP is Muslim. Especially since currently it's Ramadan, so that's likely the family meeting reason.  But I'm sure there are similar parts in the Quran that could be quoted?",
                  "id": 23,
                  "comments": [
                    {
                      "score": 14,
                      "content": "As a Muslim, there are lots of verses in the Quran that make it clear people’s deeds/actions are between them and Allah only. Not for anyone else to judge let alone say they will end up in hellfire",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "Your brother is the best! I laughed reading this so you are definitely not the ah!",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Tell your brother to just bring tea bags, there's plenty of hot water here😈",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "OP, you’re a good brother. NTA 100%.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Sounds like they were all about dishing it but once it comes back at them they shatter like cracked window in a hailstorm.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Going against middle Eastern family traditions seems to be difficult I'm proud of you, and I'm proud of your brother. Don't for a second think you are in the wrong.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "As a Middle Eastern girl, I commend you (I knew you were Arab as soon as you mentioned tea lmfao).  You’re freaking awesome lol.",
              "id": 30,
              "comments": [
                {
                  "score": 2,
                  "content": "Could also mean desi culture.",
                  "id": 31,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "Not only in Turkey.  \n\nPeople have been pulling this shit with their family members since we were cave men praying to deities.\n\nHumans are hardwired for bullshit.  ❤️",
          "id": 32,
          "comments": [
            {
              "score": 15,
              "content": "I doubt families in the US or Western Europe would care if a boy has a girlfriend. Sure there might be exceptions but def wouldn’t be the societal norm there.",
              "id": 33,
              "comments": [
                {
                  "score": 14,
                  "content": "No, it happens everywhere.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I know it happens everywhere but the rate of it happening everywhere is simply not the same.",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "I literally thought the uncle was an ifb Christian lol",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "So you’re saying we don’t have religious zealots in the West? Really?",
                  "id": 37,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Religious zealots in the west would be considered liberal in middle east lol.",
                      "id": 38,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "You would be wrong, unfortunately. Perhaps not as common, but there are definitely families that would care that way. Even if they were ok with the idea of a girlfriend, there are plenty of families that would care a lot about if she was the right “type” of girl.",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "It could be southeast asian too like Indian, Pakistani,Bangladeshi etc",
          "id": 40,
          "comments": [
            {
              "score": 2,
              "content": "I have known a few hard-core Catholic Filipinos...",
              "id": 41,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "US South, though the tea would be sweet and cold, not hot.",
          "id": 42,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Or England, with some families!",
          "id": 43,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "That’s where I was going also",
          "id": 44,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1374,
      "content": "NTA and brother deserves an award for that comment. These religious types really think they’re top dog but it don’t work like that ! Well done for standing up for your brother - I could have done with one like you years ago in similar situations\n\nIf it ruins the family relationship then so be it - I did the same with my aunt and cousins after she told me I was a useless asshole (and more) for not telling her something about my mom and for standing up to my cousins who constantly bullied me for years and blaming me for stuff they did - that’s when I could have done with a brother like you as I was 17 at the time and never saw my aunt and cousins again because I told them I never wanted to see them again !!",
      "id": 45,
      "comments": [
        {
          "score": 172,
          "content": "I was so shocked to hear my brother, who has never made a joke or talked badly of anyone, say that to my uncle. I guess my uncle also thought he wouldn't say anything, and seeing that my parents weren't there either, he definitely felt too comfortable insulting us. \n\nHonestly, I'm glad that we went and that what happened did happen, because now we have a solid reason not to see them again.. plus, it was hilarious lmao.",
          "id": 46,
          "comments": [
            {
              "score": 25,
              "content": "This is the right outlook. I once made a snarky comment to someone who acts like they're superior to everyone else due to religion, even though I'm generally passive, but when you've had enough it will come out. Years later I have no regrets and it still feels good when I think about standing up to them. I hope this becomes a good memory for you and your brother as well.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I’m confused about the cousins, honestly. Are they young? Do they not see their father treating you guys like crap? I’d stop my parent if they ever made my cousins that uncomfortable at OUR dinner table…",
              "id": 48,
              "comments": [
                {
                  "score": 5,
                  "content": "I figured they're the BullyLite™ version of the uncle, which means they live for a good pile-on against one person.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "You're a good big bro, oh, and maybe bring your brother some tea to share a laugh over. He did good, and it sounds like he needed to snap and stand up for himself against your uncle and cousin (some bullies wont stop until you do), and you having his back showed him he did the right thing.\n\nHe shouldn't have had to stand up for himself, but it's good that he now knows he has the ability to.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "It sounds like your brother wasn't willing to tolerate insults to his girlfriend and that was the last straw. Good on both of you. NTA.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Well done to your brother for sticking up for his girlfriend and to you as well for having your brother's back! You two are Rock stars!  And yes, it was hilarious!",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "It sounds like your uncle is a bully and expects everybody to sit and take it. That your extended family didn’t say or do anything to is intolerable. You should definitely let your parents know what happened and why your brother said what he did, and why you backed him up",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Your brother is an icon for saying what he did, genuinely hilarious.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 147,
          "content": "That comment was absolute fire.\n\nPun not intended, but intentionally left in after I saw.",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "Replying here to add that it's not op or his brothers fault for ruining a family relationship here, it's the uncle's. If others in family side with the uncle, that's also the choosing the side of ruin. They're both kids, they're both absolutely right, and they both seem like the smartest people in the room here",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "> NTA and brother deserves an award for that comment.\n\nAnd not just for the wittiness but also the restraint.  The brother avoided adding more insults to the mix (despite the uncle's inexcusable language) and instead went with something that called the uncle out without sinking to his level.  As an adult, I would have had a hard time keeping my cool in that situation, so I'm all the more impressed that a teenager was able to do so.",
          "id": 57,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 430,
      "content": "NTA, but where were your parents during that?",
      "id": 58,
      "comments": [
        {
          "score": 409,
          "content": "Parents couldn't make it, so we were forced to go in order to show face for our family.",
          "id": 59,
          "comments": [
            {
              "score": 233,
              "content": "Honestly they should say something to the rest of the family about your uncle being in the wrong, and that he should apolgize to your brother, you and them.",
              "id": 60,
              "comments": [
                {
                  "score": 266,
                  "content": "The problem is that all the other families treats him like king because he buys them things. A lot of ass kissing.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 129,
                      "content": "How very pious.",
                      "id": 62,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 57,
                      "content": "That's how religious people are they sell out their morals for money.",
                      "id": 63,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "Ah, so he's the wealthy one who buys everyone's loyalty?? Greaaaaat.",
                      "id": 64,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "Looks like you won’t be forced to go anymore. Win win. NTA. Unc can go fuck himself and the things he buys for everyone.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "NTA. Your brother rocks, perfect comeback.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 388,
      "content": "NTA. Your uncle was harassing your brother. He should expect some kind of defense. This is a case of dishing it out but not being able to take it. In short - your uncle is a bully. And good for you for defending your brother. \n\nAlso, it is telling that your uncle got your cousins to continue the bullying after the event was over by continuing to send messages after it was over. This is the tactic of a coward - outsourcing their bullying.",
      "id": 67,
      "comments": [
        {
          "score": 18,
          "content": "Perfectly said",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Flying monkeys. 😁",
          "id": 69,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 185,
      "content": "NTA.  Your brother is quick witted and funny.  Your uncle is self righteous and not worth engaging with.  ==  Why don't your parents set some boundaries with your uncle. They're of his generation and should be the ones to tell him to rein it, a lot.",
      "id": 70,
      "comments": [
        {
          "score": 3,
          "content": "Yes!!!!",
          "id": 71,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 153,
      "content": "On the plus side his tea will be hot... \n\nNTA. Best reply ever! Your brother rocks! In any case, for heaven sake, maybe your uncle should try practice kindness to others, because I think it is kind of the basic requirements... If not he is up for a hell of a surprise! 😜",
      "id": 72,
      "comments": [
        {
          "score": 24,
          "content": "'His tea will be hot' has me rolling as hard as the 'I'll be sure to bring you a cup of tea' 😂😂😂😂",
          "id": 73,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Nah uncle is a bully & his religion gives him the okay to be that way",
          "id": 74,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 55,
      "content": "No, you’re good and your younger brother will always appreciate you for sticking up for him like that. I’m being serious, even if it wasn’t a big deal he will remember it.\n\nAs a younger brother of two older brothers, I couldn’t thank them enough for looking after me growing up. I feel sorry for only child’s who don’t know what that’s like.",
      "id": 75,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 50,
      "content": "NTA.   \nI have to admit, I would probably also have laughed. Your brother has a very sharp wit.",
      "id": 76,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 34,
      "content": "NTA.  Your uncle and your cousin are nasty, vile people.",
      "id": 77,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 28,
      "content": "I dont get the pushy religious types. Im Christian, but I just dont get how some have to make everything so biblical. \n\nIt takes just a few bad examples to make the rest of us look bad.\n\nAnyway, OP congratulations. You now never have to go back. And why should you? You are a grown adult, and you and now have the perfect reason to tell family that you are not showing up. You are not a part of their flock, and your uncle isnt your shepherd. \n\nAnd if your uncle wants to make a big deal about it to you or your brother, point out that the ten commandments only cover honoring the mother and the father. Uncles are $#!+ out of luck.",
      "id": 78,
      "comments": [
        {
          "score": 6,
          "content": "OP is Middle Eastern, and I'm assuming is a Muslim. So not Christian.",
          "id": 79,
          "comments": [
            {
              "score": 6,
              "content": "We all have our extreme cases. Im not knocking any faiths, just saying some take it too far. \n\nMy ten commandments quip may fall flat, but I only know the Bible. Any body with knowledge of the Quran might be able to come up with some sort of equivalent quip if they were so inclined.",
              "id": 80,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}