{
  "post content": "We came home from the hospital 5 weeks ago with our first child, a boy. For the next 4 weeks, my wife did not let any of my family visit our son. Her mother and sister came over several times a week.\n\nMy wife refuses to let my family see him because she doesn't want to play host. My family understands that being a new mom is stressful and they have no expectations of being treated like proper guests. I told her it's not fair that her family can come & go as they please but my family can't even meet him. She said her family comes over to help her, which is not really true, they just hold the baby a little and if the baby isn't sleeping then I am the one taking care of him while they are here. They don't clean or anything, at most they might bring some takeout on the way over.\n\nFinally I decided I will be taking the baby to see my parents last weekend. My wife doesn't breastfeed so I got all the formula and diapers and everything I would need for a couple days and packed a bag. I thought this was a win-win because my wife could have some time to herself or come along and she would be under no pressure to host anyone. But she got mad when I told her what I would do but I told her this was happening, I am the baby's father and my family has a right to see him just as hers does. She refused to come along and said she can't believe I'm treating a new mother this way.\n\nI left on Friday evening and didn't hear anything from my wife on Saturday, but her sister & mom were over & sent a bunch of texts basically accusing me of \"abusing\" a new mother. Finally on Sunday she started sending me text after text on how I was a terrible husband, how I kidnapped her son, how a baby can't be separated from its mother, etc. It got so bad that I cut my visit short and drove home.\n\nShe was very mad when I got home and refusing to speak to me. The next day when the baby was asleep I sat her down and tried to calmly explain to her that I am the FATHER of the baby so I have as much right to where he goes and who he sees as she does, we are equal parents and she needs to accept reasonable compromises when we disagree, like my family being able to see our son and she not having to host them. She called me an asshole and shouted that she gets more say because she's the one who was pregnant with him.\n\nAt that point I said if she thinks that way & the accusations she texted me, I think she really needs to see a doctor and get assessed for PPD because her behavior is not normal. She called me an AH and said I was abusing my position as the earner (money was never part of any discussion). She has been giving me a near-silent treatment all week, resisting any attempts to discuss therapy, and her sister has texted me saying I should apologize to her for what I said. I told her sister that I had said absolutely nothing wrong in response to being accused of kidnapping and being a lesser parent to MY son.\n\nI am standing my ground but I need an outside perspective, AITA?\n\nEDIT: To clarify, the idea my wife might have PPD did not occur to me until after the visit with my family.\n\nEDIT 2: My wife knew of my plan to visit my family several days in advance. I planned a weekend trip because they are several hours away.\n\nEDIT 3: I want to emphasize this because people keep asking about it. **I DID NOT WANT TO SEPARATE MY SON FROM HIS MOTHER. I WANTED HER TO COME WITH US. SHE REFUSED.** I did not forcibly take my son away from her. It was her decision not to come along and her decision not to allow my family to come to her.\n\nEDIT 4: My wife is not physically handicapped from childbirth. She has been mobile and going out including a 6 hour car ride 2 weeks ago.\n\nEDIT 5: My wife refused any options involving my family coming to us. No hotel or in-town visits.",
  "id": 1,
  "comments": [
    {
      "score": 7127,
      "content": "An overnight visit to your family’s home (over her objections as well) is very different from her family coming to visit for a few hours. You can easily imagine how your equivalency argument would be perceived by a judge if it got to that point.\n\nThe more reasonable compromise was to invite your family over to a porch visit, for which you’d prepare all snacks etc, and give your wife notice so she can plan to (a) stay inside, (b) be elsewhere, or (c) join in on the visit. You have equal say in who is invited onto the property. That would have been a more defensible “compromise” than taking the infant out of the home overnight and away from the mother. YTA",
      "id": 2,
      "comments": [
        {
          "score": 5945,
          "content": "> The more reasonable compromise was to invite your family over to a porch visit, for which you’d prepare all snacks etc, and give your wife notice so she can plan to (a) stay inside, (b) be elsewhere, or (c) join in on the visit.\n\nShe did not want them in town or at the house AT ALL. This was emphasized in my repeated attempts to compromise with her. She felt that no matter what if they were close she would have to host.",
          "id": 3,
          "comments": [
            {
              "score": 2315,
              "content": "Why is everyone acting like she doesn’t have a right to feel how she feels about the in laws? They aren’t her parents, therefore she will never be as comfortable with them as she is her. And she’s at the weakest point of her life right now. Trying to HEAL.\n(EDIT I just don’t believe this guy is telling the truth. He has some kind of excuse or situation as an answer to any and all objections. An insane amount of “oh well she did this so that makes this okay” replies to even seem like a real situation at this point. He took the baby away from her- she never did that to him. There are clearly 3 sides to this story- his, hers and the truth.)",
              "id": 4,
              "comments": [
                {
                  "score": 5948,
                  "content": "> And she’s at the weakest point of her life right now. Trying to HEAL.\n\nShe drove 3 hours to a concert 2 weeks ago with her sister. She is physically mobile just as she was before pregnancy. She had some pain for about 4 days after coming home but none since then.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 10137,
                      "content": "OP you are NTA, you did everything to compromise with your wife. I would have done the same if I were in your situation, the suggestion that she see a therapist is fair if you are concerned about PPD. My only question is did you communicate with your wife while you were away to give her updates and let her know the baby was okay?\n\nEDIT: Thanks for all the Awards, its the first time this has happened to me and really appreciate it!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1674,
                      "content": "[deleted]",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 574,
                      "content": "I'm with you, OP. Your wife needs to be reasonable and treat you as an equal. Does she secretly hate your family?? Why can't they just come over like her  family can? Is she from a culture where the woman is the homemaker, and she'll feel embarrassed if people come over when she can't be the perfect host?  You came up with the best option you could think of to respect her wishes and still be able to introduce your family to your child, who IS part of THEIR family too.  NTA.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 336,
                      "content": "You should have put that in the original post - literally this changed my mind in your favor",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 205,
                      "content": "Unless there was a physical problem, 5 weeks is quite enough. What kicks in is sleep deprivation. There's something weird psychologically and/or relationship with OP and/or OP's family, justified or not going on. This situation is totally out of bounds.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 198,
                      "content": "NTA. Unless you're leaving out something big. There's something going on with your wife. Maybe she's having trouble adjusting to motherhood. Did your family do something, is there a reason for her not to want the baby around them ?",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 116,
                      "content": "I had two kids. Healing from birth was not an excuse to treat others like that.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "NTA and don't listen to all the assholes trying to say you did something wrong. Your wife for whatever reason is being totally unreasonable and sounds like she really needs therapy. Good on you for not backing down on the trip to your parents.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "You’re NTA. You did everything you could to compromise and make her comfortable.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Who cares what YOU think. Do you think her body goes back to normal after a few weeks? Do you consider that her hormones are fluxuating wildly? That, while she may want to get out of the house for a little while, that doesn't mean you get to gaslight her about you taking the baby against her wishes -- out of town -- where you expected she would go since you commanded her to? That being physically mobile doesn't mean HEALED and that her body is still exhausted and recovering from a 9 month ordeal and taking care of a 5 week old? Do you have any empathy at all? \n\nShe wanted her comfort people with her, not your family who, apparently, makes her feel like a servant. That's very different from her mom and sister holding the baby for a little while. HER family is local so it seems you expected her to host them at your house. You didn't seem to care about her feelings at all. I can't tell if you expected them to stay with you but, if so, that would be a triple down on the AH. She is NOT up for entertaining your family for whatever reason. If they came and sat outside and she stayed inside, there WOULD be repercussions. SHE NEEDS SOME TIME BEFORE SHE HOSTS YOUR FAMILY. YOU also should NOT have taken a young baby from it's mother for a weekend without her permission. You COMMANDED and she said no. It also seems like there may be a lot of Missing Reasons she doesn't want them there. YTA and until you push a baby out of your rectum, you get no say in what she is ready for.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1753,
                  "content": "> They aren’t her parents, therefore she will never be as comfortable with them as she is her.\n\nHer family aren't my parents and I will never be as comfortable with them as I am with my family, but I don't use that as a reason to stop them seeing my son.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 566,
                      "content": "NTA. This wasn't the first weekend you bro2the kid home... It's been a month. Yes, pregnancy can be emotionally and physically overwhelming and her comfort is important. BUT she could have compromised, it's insanely selfish to say that only HER family can visit (and appear to do so frequently) while yours can't because she doesn't want to \"host\". She keeps saying what you need to do but refuses to consider what you might need.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 134,
                      "content": "Totally, your wife was being 100% not fair. For perspective my sister’s in-laws live in China. She doesn’t want the kids there without her for long periods so they come here and when they come they are here for months, in her house (formally small apartment) because traveling here is expensive and they have to arrange travel and care for an elderly parent they take care of. \n\nThe first time they came here it was just 10 weeks after my sister gave birth to her firstborn. My sister was not exactly thrilled but there really aren’t a ton of options and she understands her husband’s family has a right to see their grandkids, they love them. \n\nYou gave your wife plenty of options, she wasn’t struggling with physical pain  based on other things she was doing,  she might have PPD and you can work to get her the help she needs but there still needs to be some compromise for your family too. Neither you nor your family are of less importance than your wife’s just because you didn’t physically carry the baby and it sounds like in wanting you to apologize they want you to agree to the statement. I would be careful to make sure that they understand you and your family are both to be treated similarly when it come to the the grandkids.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I'm sorry are you feeling physically vulnerable in your body having grown a child for 9 months in it? Because there's a level of \" comfort\" here that you can't seem to grasp.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 599,
                  "content": "But he's the father and he gets to let his family see the baby HE HELPED CREATE.\n\nEdit since y'all seem to think babies are made by magic: Let me give y'all a basic science lesson. In every person with a uterus is an ovary. That ovary releases an egg. Sometimes, if that person is fertile, they can get pregnant. No, they won't just conjure the child into their uterus. That's not how science works, you can't magic a baby into the uterus. What you need is someone with sperm. Working sperm. Both people need to be fertile in order for this work. Person with sperm will either offer their sperm in a cup or they will create a child the old fashioned way, penis in vagina. When that fated sperm makes it to the egg, it implants into the egg and then life could very well be on its way. Notice how you need sperm AND an egg in order to make a baby? You don't have to like it but cis men and other people with penises are also essential in making a baby. Without sperm, there is no life to be made. You can't magic a baby into the uterus. Repeat this until you get it. You can't magic a baby into the uterus, you need sperm. \n\nLet's not pretend that men don't do anything. I get most are just sperm donors even if they did PiV but you can't let your own daddy issues and hatred for cis men get in the way of unbiased opinions. I don't like cis men either, my own dad wasn't around until I turned 18. But this isn't a case of a dad being a deadbeat. He's actually there for his kid and wants to be there. He also wants to be an EQUAL parent. If you're a \"feminist\" you should be all over this. I'm an actual feminist, I care about equality for ALL genders (or non genders (; ). Female, male, nonbinary, genderfluid, etc. That means I will 100% advocate for men to be equal partners and fathers. Because that's what everyone should want. If you're in my replies, implying men shouldn't get equal say in how his biological child should be raised, you should refrain from speaking to me. I don't wanna hear your selfishness and hatred for a person you literally don't even know. You know this dude off of ONE post. ONE SINGULAR MOMENT IN HIS LIFE. If you are seriously advocating for this man to be a second class citizen and not get any say in his child's care, you need to seek therapy and possibly some higher education because wow. Become a feminist, believe in equality for all. 💜",
                  "id": 20,
                  "comments": [
                    {
                      "score": 153,
                      "content": "I love how this is an argument for child support and financial situation. But when it comes to actual rights of a father so many people here are saying it doesn't count. Hypocrites. \n\nI'm agreeing with you.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 356,
                  "content": "Because she is not willing to comprise at all so that the father can introduce the baby to his side of the family. She didn’t need to even be there if she didn’t want to be. She could have chilled in her room, visited her mother or sister, or done a thousand other things she wanted to do. This wasn’t about her.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 137,
                      "content": "She's apparently so worried about being judged for not being an active 'host' that she's stopping this guy sharing the birth of his first child with his parents. It's an unconscionable act of selfishness and complete disregard for his feelings at all.\n\nMade all the worse by the fact that this was repeated and sustained. Imagine having that conversation every day for weeks. 'Can we please let my parents see our baby?' 'No, I don't want to'\nMust have been heartbreaking.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 257,
                  "content": "you are telling me she couldn't spare like 2h of her life so her in laws could meet the baby? \n\nits not like she is constantly breastfeeding and need help around desperately or bedridden. OP states she was perfectly fine going to a concert hours away with her sister.\n\nshe is just trying to abuse her new position. she is the mother yes but as the father OP should have equal rights too. why can her parents meet the baby but not his? not even for a few hours?\n\nthat to me just means she is trying to be petty",
                  "id": 24,
                  "comments": [
                    {
                      "score": 20,
                      "content": "She didn't even need to spare 2h of \\*her\\* life. OP could have had his family meet the baby without her being present.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 168,
                  "content": "I felt how I felt about my in laws (I didn't feel good about them), I stayed in my room and husband hosted and brought the baby to me when baby was hungry. \nThe baby has two parents, and the mom doesn't get final say.",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 128,
                  "content": "And op will never fully feel comfortable with her parents yet he does t hold that against him. This is the dumbest argument I have ever heard. You support one side but the moment someone mentions how it goes both ways you ignore it? Society is messed up right now. NTA op.\nYou did everything in your power to compromise and she ignored you.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 53,
                  "content": "Why are you acting like OP doesn’t have a right to be upset that his wife is gatekeeping THEIR child from his family but allowing hers access? The home is as much his as it is hers, he could play the same game “I don’t want to host your family, they can’t visit” but he’s not. And if he was playing that game everybody would be like wow, this guy sounds toxic trying to cut you off from your family and prevent your child from meeting them!",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "He said she just went on a six hour road trip two weeks ago. Unless she had a traumatic birth, six weeks should be plenty of time for her to have recuperated",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "why’re you acting like she’s the sole parent? his family deserves to see the baby just as much as hers does, regardless of her opinion of them.",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 150,
              "content": "NAH  I'd say your wife is either experiencing some kind of mental illness, not PPD but something similar such as PPA (A = anxiety -- that your family are irredeemably contaminated somehow) or she just HATES them or hates MIL. That isn't part of your story, but it could be your MIL is an ass, or your wife just resents them for irrational reasons.\n\nWhat is beyond doubt is that your wife is being unreasonable. I mean, ask what will happen when her son's wife cuts her off? Also, have you made clear that you end up indeed hosting her family and you are getting tired of that? Maybe no visits until the child is sleeping through the night ... or in highschool. It IS being taken too far unless there are other issues you have not discussed about your side of the family. \n\nI wish you luck in resolving this crappy situation. I don't know if it's a comfort, but with kids, it's hard and there will always be hard to call situations. Been through it 3 times and now they are adults ... and there's still situations (should I quit this job? should I break up with my boyfriend again?? I failed a college course ... the problems get less frequent but harder to resolve).",
              "id": 31,
              "comments": [
                {
                  "score": 19,
                  "content": ">What is beyond doubt is that your wife is being unreasonable.\n\nI genuinely think OP is leaving something out. Theirs no way that his wife has gone from perfectly reasonable to hating them over night- theirs either something very wrong with her medically (in which case he just made this whole mess worse and more traumatic for her) or they've done something or said something that means she doesn't want them near the baby.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 13,
                      "content": "If my partner had fucked off to his parents with out baby when she was that small I’m pretty sure his parents would’ve sent him right back with a “what the fuck are you thinking?”. My money’s on there being some history with his family.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "I actually get that feeling. Which leads me to believe there is some background here.",
              "id": 34,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Does your family treat your wife well?",
              "id": 35,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "So the thing is, she didn't agree to the weekend trip either where she was forcibly separated from her newborn for days. That can be really traumatic (I know she refused).\n\nOn the flip side, you could have had your family stay in your town anyway, which was also against your wife's wishes, but it wouldn't have forcibly separated baby from mother. You could have said \"tough\" and brought the baby out to me your parents at the park or your backyard where your wife would still have the comfort of being inside her home.\n\nI agree that she's being unreasonable, so I understand you had to put your foot down. But taking the baby away for days was not the answer. You had to go against her wishes somehow because she's being too controlling and uncompromising. You just went too far, so that's why I'll say soft YTA.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "INFO: what was your wife's relationship with your family like before the baby came along?",
              "id": 37,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "I mean you have no problem taking away the kid all weekend in spite of her objections so I don't see why it would have been a problem to have your family come for a porch visit in spite of her objections as well? I think you just chose this extreme method to try to force her in a corner. And it seems like your relationship is going to have to take some recovery from the decision you made.",
              "id": 38,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "There is no way this is the whole story.  OP, how did your wife feel about your family before and during the pregnancy?",
              "id": 39,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "So what?  You took the baby to their house anyways so why not just go ahead and let them come into town and stay at a hotel anyways?",
              "id": 40,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Usually people don't decide to just separate from their in-laws for no reason. So what's the reason here? I think there's a huge detail being left out.",
              "id": 41,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 648,
          "content": "He said he invited her to come along. He said that she didn't want his family over under any circumstances. In front of a judge his wife would look unhinged and over-emotional and in need of therapy. \n\nNTA",
          "id": 42,
          "comments": [
            {
              "score": 317,
              "content": "Also in front of a judge since she isn’t breastfeeding, he would be getting overnights if they were to separate. Not saying that’s what’s goi g to happen here (hopefully) but parents who share custody do exactly this all the time, to suggest it’s such a massive deal, especially when she was invited to come along, is a little on the ridiculous side. What other choice did she leave him?",
              "id": 43,
              "comments": [
                {
                  "score": 27,
                  "content": "Well, the only choice she was leaving him was to never allow the in-laws to meet the baby. And he took a detour, which she didn't like.\n\nNow, I have no idea what makes her act like this, my suggestion is that maybe her family has some influence on this but that's just a baseless gut feeling. But there's a reason behind that reaction. \n\nEither she has a dislike for OP's family or she's using the fact that she is the mother to try to have the sole control in parenting, which, I'm pretty sure, would be abusive. Or maybe PPD like OP suggested. Probably other reasons are possible, but those seem the most likely to me.\n\nOP is NTA in any case. He made his decision clear, gave her tons of options to accommodate to her and she refused everything. As others pointed out, 5 weeks is not a reasonable time to keep refusing to let the family see the baby. Especially when the other family sees him very frequently.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Shit even if she WAS breastfeeding judges will tell her to send milk or dad can do formula!!!!",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 522,
          "content": "A porch visit?  What if they don't have a front porch, does he make his family sit in lawn chairs on the driveway to see the baby?  It's his house too, if his wife didn't want to see them she could stay in her bedroom or go to her sisters or mothers.",
          "id": 46,
          "comments": [
            {
              "score": 63,
              "content": "Thank you!\n\nWife can lock herself in the bedroom if she is so against seeing her inlaws - it's OP's house, too!",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 368,
          "content": "Are you an attorney? I’m curious because I completely disagree that a judge would view the situation negatively. The baby is not breast fed therefore there is no reason he cannot be away with his father. How do you think joint custody works? While some judges don’t allow overnights with the father for a month or so after the birth many do.",
          "id": 48,
          "comments": [
            {
              "score": 158,
              "content": "So… I actually did experience a bit of PPD after my son was born and felt very much like OP’s wife did.  (I didn’t prevent my husband’s family from seeing our child.)\n\nDuring that time, before I realized it was PPD, I did actually talk to a few attorneys.  And all of them told me there was not a judge in our county that would agree to overnight visitation for a newborn baby.   They said that judges typically believe that it is in the best interred of the baby to have short visits with the non-custodial parent multiple times a week, ideally in the custodial parent’s residence.  The goal is to create stability for the newborn.   Overnight visits aren’t ordered because it interferes with the newborns sleep and feeding schedule, even if the baby isn’t breastfeeding.\n\nFortunately my husband understood what was happening and made sure I got help, so we never got to that point.",
              "id": 49,
              "comments": [
                {
                  "score": 52,
                  "content": "[deleted]",
                  "id": 50,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 46,
                  "content": "In your county is the key. Many judges order the opposite.",
                  "id": 51,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Joint custody is much more common lately. Nobody is non custodial parent in a divorce where both parents plan to raise the children equally. If one parent is considered non custodial then it is more common to order daytime visits during early infancy, but it goes alone with other reasons a couple might not have joint custody.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "In my country joint residence is rarely given when a baby is under a year old, unless the mother voluntarily wants it.",
              "id": 53,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 312,
          "content": "yo, for real, fuck this response. ops parents live several hours away, and she was absolutely refusing to let them even come to their house. op is as much a parent as she is, and I'm not happy with the top comment basically calling op an asshole for trying to have some equal say in his *partnership* and as a parent.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 208,
          "content": "I’m actually in awe that this garbage is currently top comment. Where is the reading comprehension?",
          "id": 55,
          "comments": [
            {
              "score": 33,
              "content": "I think it’s a knee jerk reaction following  the Reddit rule that new mothers can do no wrong.",
              "id": 56,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Welcome, hope you enjoy your stay. A father trying to have his family see his and his partner's child is now grounds to call him an asshole.",
              "id": 57,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 101,
          "content": "What? First her denying his family any access would be seen by a judge as her being unreasonable. See on court the try to say the parents are EQUAL! Her family gets yo come and go then so does his, period. You saying he's the asshole is just pathetic. He is the father and his family has ever right to see the child SHE doesn't get to be the only one to set the rules.",
          "id": 58,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 70,
          "content": "It sounds like she would’ve found a reason to shoot that down too.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "This is so dumb. So the man can't let his family see the baby basically unless they stay outside on the porch? The audacity of someone to suggest that. Plus a judge will see it as him being able to do whatever he wants with the baby for at least 2 weekends a month. The mother clearly does have PPD and should get therapy.",
          "id": 60,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 46,
          "content": "No, you're wrong. OP is NTA. His wife is alienating his side of the family. He tried compromising, she refused. And he's right. He has every right to decide who his child sees as she does.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5329,
      "content": "Edit: NTA \n\nAs a woman, and a mother, I totally get not wanting to host guests after birth. I could also understand if she had covid concerns and wanted to avoid visitors until the baby's immune system has had a chance to build up. But I think your position/solution was completely fair, given that she has her own family as do-nothing visitors. You did not 'kidnap' your son - you each are allowed to take him places, she could have come along with you, and you told her exactly what you were doing and where you were going. No subterfuge involved. She may well need to see a doctor about PPD. Her stance on who can see the baby and when is not consistent or fair. \n\nBut... \n\nThe reason I'm going with INFO instead of n-t-a is that I want to check that we're getting the whole picture here. How was your wife's relationship with your folks before the pregnancy? Has she been under pressure from anyone on your side of the family (besides you) to allow visitors? If your wife has been rejected or disrespected by your family in the past, that would put a slightly different spin on things.",
      "id": 62,
      "comments": [
        {
          "score": 2779,
          "content": "> How was your wife's relationship with your folks before the pregnancy?\n\nFriendly but not super close because they live further away.\n\n> Has she been under pressure from anyone on your side of the family (besides you) to allow visitors?\n\nNo, obviously my family have wanted to see him but they respected her wishes not to come to the hospital or to where we live.\n\n> If your wife has been rejected or disrespected by your family in the past, that would put a slightly different spin on things.\n\nNever, they don't talk all that much but there has been no criticism about anything from my family to her that I am aware of.",
          "id": 63,
          "comments": [
            {
              "score": 2023,
              "content": "Then NTA, you're in a rough position and I sympathize. On the one hand, you want to respect your spouse's position, on the other hand, not all positions are rational or fair, particularly when there may be a mental health component involved. Keep pushing for a doctor visit regarding PPD and maybe call her gyno directly and ask for advice. This one is beyond reddit's paygrade. \n\nAnd to your in-laws, if they are criticizing you, ask them how they would feel if you had barred them from coming to visit - wouldn't they find that unnecessary and unfair? Maybe even controlling and disrespectful? Tell them you wouldn't do that, you just want both sides of the family treated the same. It's true your wife did the 'heavy lifting' when it came to carrying the kid. During pregnancy and immediately after birth, I do think the mother's wishes should take priority since she's the one who went through a major medical event, but it's over a month later and it's high time everyone understand that you're just as much a parent (and your family are just as much allowed to see him) as she is.",
              "id": 64,
              "comments": [
                {
                  "score": 509,
                  "content": "NTA. I was reading this and about halfway through I was wondering if she has PPD. \n\nWould you be able to talk to her mom and sister about getting her some help?",
                  "id": 65,
                  "comments": [
                    {
                      "score": 28,
                      "content": "The same mom and sister who screamed at him through text for taking the baby away? Doesn't seem likely.",
                      "id": 66,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Change your judgment up above. It won't reflect in the polls.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": ">Friendly but not super close because they live further away.\n\nSo your saying your wife has had a drastic and dramatic change in behavior after a major medical event and you chose to address it, not by taking her to a doctor but by escalating the situation? Really?\n\n[Do any of these sound like your wife?](https://www.mayoclinic.org/diseases-conditions/postpartum-depression/symptoms-causes/syc-20376617)",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "Nta. You've made reasonable requests to allow your family to visit and she didn't have any reason to deny it.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "So, two points here, even though I am on your side in general:\n\nOne - if you are feeling pressured enough by your own family that you chose to die on the hill of going against your wife’s wishes and bringing your baby to them, imagine how pressured your wife feels around them.\n\nTwo - really, imagine that. Because you were told off by some of your wife’s family and that shit hurt, regardless of whether you felt they were justified, right?",
              "id": 70,
              "comments": [
                {
                  "score": 10,
                  "content": "OP stated that has not happened. His family hasn't put any pressure on her and have a friendly relationship but live too far away for a close relationship and have never gotten into any fights with OPs wife to his knowledge. They just wanted to meet the baby and he wanted them to meet them, and felt it was unfair her family was allowed to meet the baby and his wasn't. The reason she gave were flimsy since she was hosting her family and had nothing against his family. Based on this unless there is missing info OP is definitely NTA",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Is your wife introverted or an anxiety sufferer? I can imagine not wanting any guests like your wife, but your idea seems to be a good compromise so I think PPD is a likely guess as you said.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 242,
          "content": "[deleted]",
          "id": 73,
          "comments": [
            {
              "score": 314,
              "content": "[removed]",
              "id": 74,
              "comments": [
                {
                  "score": 173,
                  "content": "[removed]",
                  "id": 75,
                  "comments": [
                    {
                      "score": 16,
                      "content": "And she is no way is showing any signs of PPD. This sub tends to throw that one out for anything any pregnant/post birth woman is doing. I had PPD, there are actual symptoms of it, none of which this woman is showing. \n\nShe just sounds selfish and a crappy partner.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I agree that OP isn't an AH but PPD *does* make people illogical. That is a huge part of the foundation of what PPD does to people. We obviously don't know these people, but that's just cruel phrasing. \n\nI'm just saying this because I was institutionalized with PPD. It took a very long time to come out of the anxiety of people I don't know well holding my baby. I didn't sleep for months, terrified he'd die of SIDS if I slept instead of watching him while he was sleeing. \n\nIt would have been so much easier to understand what was happening to me then if more people knew and understood it.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "💯 well said 👏🏻\nHer family are also interfering AHs. But no one seems to be highlighting this",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "Don’t understand why first comment says differently \n\nOP is the father. His family is as important as his wife family. I got a 7 month old. 5 week is enough to accept that other people are linked to your kid",
          "id": 79,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "It's more likely post partum anxiety or even post partum psychosis, which is rarer, but not that uncommon. Definitely needs checking.",
          "id": 80,
          "comments": [
            {
              "score": 11,
              "content": "In no way does this indicate postpartum psychosis - which is a rare and a SUPER dangerous situation. As someone that dealt with PPD, I think it gets thrown around on here way too often, as in this case. She is showing no signs of it from everything he has said. Her life seems completely normal, seeing her family often, going to concerts, normal attachment to baby, etc. The only issue is her not wanting her husband to have his family visit. That’s it. \n\nShe just honestly sounds selfish.",
              "id": 81,
              "comments": [
                {
                  "score": 5,
                  "content": "A psychosis can manifest in an abnormal fear of something ( like here his family in the same town), and the rest of your life is normal. But I am absolutely not trying to diagnose anything. I'm just mentioning this as an option that needs a specialist to diagnose this. And one in 500 birth is not particularly rare, just much rarer than post partum depression, which happens in about 50 to 100 in 500 birth.",
                  "id": 82,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Big same, NTA. I’m a mother of 2 with a third on the way…OP’s wife needs clinical help and OP acted completely reasonably given the circumstances.",
          "id": 83,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3875,
      "content": "NTA - in the words of Judge Judy \"Dad's are not second class citizens.\" and \"A father has no less rights to a child.\" \n\nHe is also your child. That wasn't kidnapping, that was a parent taking their own child to see their family. You gave her a perfectly reasonable decison: join or not. Completely her decision and she chose not. \n\nYou're right, she needs to be assessed.",
      "id": 84,
      "comments": [
        {
          "score": 282,
          "content": "This 100%",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 201,
          "content": "First reasonable judgement on this post 🙄",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 80,
          "content": "Agreed, she really sounds to me like she has PPD and I definitely would know as well. She needs to get checked and seen ASAP. Also Dad has every right to the child as the mother. Yes she carried the child, but I'm sure if OP could too, he would have as well. That's what fathers and spouses would do. Help in any way they can. NTA. \n\nOP,  I'd talk to someone about this that is a medical professional and see what can be done about this especially since she refuses. This is bad.",
          "id": 87,
          "comments": [
            {
              "score": 7,
              "content": "No.\n\nJust because he found another way to manipulate her by weaponizing a mental health diagnosis to try and make her reasonable reactions to his unreasonable behavior sound illogical doesn’t mean she has a problem.\n\nWhat’s bad is his behavior here and refusing to see his wife’s points and refusing to disclose them here to try and justify his actions.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Or maybe she’s just an AH? MH shouldn’t be used to excuse shitty behaviour. Also, it’s so easy to make-up BS and play the victim during MH assessments - so many people do this",
          "id": 89,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2154,
      "content": "ESH.  Unless there is more to this story, wife's stance is either irrational or unreasonable.  That said, husband's decision to whisk the baby away for multiple days - instead of perhaps a day or at most an overnight trip - without wife's consent is also unreasonable IMO.   Comment about needing to see a therapist may have been well intentioned but didn't come across that way.  Therapists or lawyers - the husband or wife are going to be talking to one, the other, or both soon.",
      "id": 90,
      "comments": [
        {
          "score": 350,
          "content": "I agree. ESH. the obvious solution would have been to invite the parents to stay at a hotel in town and taken the baby to see them there.  If the wife doesn’t want them “in town”— tough. She cannot control that.",
          "id": 91,
          "comments": [
            {
              "score": 649,
              "content": "His wife didn’t even want them to come stay in a hotel and meet elsewhere. OP gives more detail in edits and some comments",
              "id": 92,
              "comments": [
                {
                  "score": 103,
                  "content": "She didn’t want him to go out of town and he did anyway. Why not just have the family visit anyway since it’s impossible to reason with her? That seems like a less dramatic action than taking the baby out of town over her objections. “I’m taking the baby on a road trip see you Sunday” and “I’m taking the baby to breakfast and the zoo with my mom, see you tonight” are different conflicts to work through. I don’t think he’s the asshole but that’s what I would have advised him if he were my friend.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 20,
                      "content": "This sub would eat this man alive if he opposed her going to a concert after childbirth and before this situation. You know it, I know it, we all know it. Why is it okay for her to go out and do stuff, but not him?  \n\n\nHer not wanting him to go does not make him in the wrong in the slightest.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "At that point I think op probably wanted to get away also.  He did say in some comments that he has planned it all week and she was invited but refused to go. That way she wouldn't be hosting anyone.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "So to hell with his family I guess?",
                      "id": 96,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Wouldn't matter to me at that point, I'd let her know when they will be here and what the visiting schedule is, end of story.",
                  "id": 97,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "The wife refused that option as well, she didn't want them in the same town as her at all.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 120,
          "content": "He got her consent she changed her mind part way through.",
          "id": 99,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 96,
          "content": "I second this. I don't think OP \"stole\" the child, that's a wild take when he's the child's legal guardian too, but I can't imagine how a conversation with my own partner would go if I took our child, against her wishes, and it didn't feel.... messed up.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "He gave her several days notice.",
          "id": 101,
          "comments": [
            {
              "score": 32,
              "content": "And invited her.",
              "id": 102,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Several days... he told her 3 days before and he Told her what was happening. Not that he was Thinking of doing it. \n\nHe already decided and that was that.",
              "id": 103,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "I agree there is probably more to the story. I suspect something has happened in the past that has affected the wife’s desire to have the IL’s around and it was excluded bc OP thought it was “irrelevant.” Maybe she knows they would do things like, for example, giving solids behind her back. (Happened to me.) Maybe they’ve just been shitty to her in the past and having them around in a PP state makes her super anxious.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1136,
      "content": "INFO: What aren't you telling us here? I find it very hard to believe that your wife just refuses a short drop in visit from inlaws. \n\nDo they tend to turn their noses down at your house, or judge the way she does things? Do they overstay their welcome? Do they treat you like a mama's boy and her like the devil?\n\nThe way you wrote it paints a fairly clear picture. but I highly doubt this is all the information we need.",
      "id": 105,
      "comments": [
        {
          "score": 1094,
          "content": "> Do they tend to turn their noses down at your house, or judge the way she does things? Do they overstay their welcome? Do they treat you like a mama's boy and her like the devil?\n\nMy family is further so her interaction is limited. They are not judgy. Before this I always felt that they were friendly but not close.",
          "id": 106,
          "comments": [
            {
              "score": 482,
              "content": "You mentioned they were a few hours away. Would they have expected to stay at your home? That's a very different situation for someone recovering from a major medical event and parenting a newborn than someone coming by for a few hours.",
              "id": 107,
              "comments": [
                {
                  "score": 1016,
                  "content": "My wife did not want them to come to our town at all",
                  "id": 108,
                  "comments": [
                    {
                      "score": 971,
                      "content": "[removed]",
                      "id": 109,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 326,
                      "content": "Jesus that’s a little extreme, she doesn’t own the town.\n\nSo if you had decided to go to the park with the child, would she also have gotten upset.",
                      "id": 110,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 128,
                      "content": "I'm going to say NTA.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 89,
                      "content": "Is your wife the mayor? How can she ban them from coming to your town and staying in a hotel?",
                      "id": 112,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "Have your family ever been invited into your home before? If yes, what happened? Was she made to serve them, either through their influence or her expectations? What did she do when they visited? How long did they stay? Or were they treated like family, and they could make their own cup of tea etc? \n\nThis blanket ban to disallow them into your home, or even into the town is bizarre.",
                      "id": 113,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "That does not answer the question....if they came would they expect to stay with you?",
                      "id": 114,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 169,
                  "content": "He said in another comment that they would’ve have stayed in a hotel, but the wife wouldn’t allow them in the home at all.",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "He said in another comment they would stay in a hotel",
                  "id": 116,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "someone recovering from a major medical event\n\nShe went off to a concert. I would say she is recovered enough.",
                  "id": 117,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 85,
              "content": "OP, have any of your other family members had children that your grandparents, parents, or other siblings have started to police how the baby/child should be raised in the recent past? That’s honestly the only factor I can think of that might make her be acting like this other than the fact that overall her behavior is coming off as someone who is starting to become abusive.\n\nHer refusal to even allow your family to visit town at all is worrisome, and *comes off as her trying to isolate you from your family* and keep them away from the baby possibly permanently. **This is not normal behavior for a new mother, but it is normal behavior for an abuser trying to cut their victim off from sources of help**. Her telling you that you don’t get any say at all over who visits your home, or sees your baby is not normal (literally unless your family or others you want to meet the baby are a bunch of child abusers there’s no reason to keep them from seeing the baby - and nothing you’ve said indicates that they are this, it’s just the most *extreme example* tbh).\n\nHer refusal to even speak to a doctor about not wanting your family to visit or get accessed for PPD is also very worrisome. People who go through PPD are sometimes in denial of it. BUT, I will be completely honest, giving you *the silent treatment*, *refusing to take your legitimate concerns seriously*, and *getting her sister to text you that you’re in the wrong and need to apologize and bend to your wife’s whim* are all things that someone will do *at the beginning of a relationship that is or has become abusive* and not normal for someone dealing with PPD. You said in a comment that *”she’s the one who wanted to have a baby”*, that also pushes me to believe that this might be an abusive relationship too. Her accusing you of abusing her by taking your son to meet his extended family is her projecting. Her having her mother and sister - aka her flying monkeys - text you and accuse you of abusing her by letting your family meet your son is definitely projection. **She literally harassed you and guilted you into cutting your visit with your family short**. \n\nBeing the one who carried the child doesn’t give you more say in who gets to see the baby. Unless there is an *actual valid reason* to not want your family there she needs to let her in laws, **the baby’s extended family** see him. This genuinely just sounds like a poly to attempt to strain your communication with your family in order to isolate you.\n\nYou’re NTA and your wife sounds like she’s showing you who she really is now that you’re essentially “trapped” with her via a child.\n\nI know this take might come off as an extreme  take honestly, but the more I looked back at your post, and the more comments I read about her refusal to make *any compromise* that wasn’t complete alienation of your family in regards to the baby (and by extension you, because god forbid you leave the *”poor new mother alone to fend for herself and the baby”*), the more this comes off as attempts to isolate you from seeing your family, and attempts to keep your son from knowing his father’s side of the family. I can almost guarantee that if you had visited your family *without the baby* you would have received just as many texts about “abusing a new mother” because you “left her alone with the baby”.",
              "id": 118,
              "comments": [
                {
                  "score": 3,
                  "content": "I was thinking isolation as well, it has that vibe.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Dictated how a 5 weeks old baby they have never meet should be raised. How the fuck are they going to dictate anything when they have never even seen the baby?",
                  "id": 120,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I never accused OP’s family of dictating how the child should be raised. **I was asking if there has been a *history* of it happening because that’s the *only* reason based in actual logic left as to why someone wouldn’t want in laws (or others) seeing a baby**.\n\nOverall this looks like an abusive relationship where the abuser has used the *baby trap* method in order to have more control in isolating their partner.\n\nEditing for more clarity: I mean history as in doing it to other family members and how they raise their kids, not how OP and his wife are raising their baby.",
                      "id": 121,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "Are they vaccinated?  Smokers?",
              "id": 122,
              "comments": [
                {
                  "score": 360,
                  "content": "Yes and no",
                  "id": 123,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 95,
                  "content": "She went to concert with her sister 2 weeks before. Do you think she cares covid?",
                  "id": 124,
                  "comments": [
                    {
                      "score": 61,
                      "content": "Listen. We don't care about any of that, ok? We just need to keep digging until we find a reason to be able to blame OP for this.",
                      "id": 125,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "You keep mentioning that _you_ have never seen or heard or noticed any negative reactions. How do you know for sure that she has never _had_ one with them? Did you ask her? _outside_ of a power play argument, if something's ever happened to give her negative feelings about your family or someone in it?",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 934,
      "content": "NTA and saying that she gets more say because she was pregnant with him is idiotic tbh. Shes obviously the one who was pregnant because of biology, but being parents require both of you.\n\nEDIT: Removed part about Doctor comment",
      "id": 127,
      "comments": [
        {
          "score": 588,
          "content": "I am not diagnosing her, I am recommending a doctor assess her",
          "id": 128,
          "comments": [
            {
              "score": 86,
              "content": "That’s smart even if this hadn’t happened.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 246,
          "content": "But she *should* be encouraged to see a doctor.\n\nHer behavior is bizarre and unreasonable and if it *is* a symptom of PPD it could turn the situation into something actually dangerous for her and their baby. If there's any chance that's what's happening she needs to talk to a professional who can properly assess her condition.\n\nThis isn't the kind of thing you just sit on and hope it goes away. At best it could lead to the both of them being unduly miserable for months or a year when they should be focused on taking care of and bonding with their new child. At it's worst PPD can lead to funerals, sometimes with very tiny caskets.\n\nIf it turns out not to be PPD, then... great? That's one less thing to worry about, but it means she's doing something really shitty to her husband for other reasons, and couples counseling would be a good idea to get to the bottom of it.",
          "id": 130,
          "comments": [
            {
              "score": 6,
              "content": "Wait, i think im misinterpreting PPD then, from what youve written i now believe its post pregnancy depression? Because in that case i do see why it might actually be an alright way to tell her to see a doctor.",
              "id": 131,
              "comments": [
                {
                  "score": 33,
                  "content": "Ppd is post-partum depression, which means depression that begins after the baby is born.",
                  "id": 132,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Ahh, thx im wrong regarding the doctor comment then, these abbreviations are creating language barriers hehe",
                      "id": 133,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "There are also post partum anxiety and post partum psychosis, which are less common, but not uncommon either. She needs an assessment.",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 571,
      "content": "NTA. I'm honestly surprised by how many y.t.a.s you're getting. You're not kidnapping this baby out of nowhere, with no notice, no attempt at compromise or reason, and taking him away for weeks, with no supplies, to strangers! You're the FATHER, trying to introduce your child to your FAMILY, who your wife already knows very well. You packed everything the baby needs. You told her with plenty of time in advance to go with you, and asked her to. You gave her EVERY SINGLE CHANCE to come along or have them come here! What the actual fuck are you supposed to do??? Just accept that your own family will never meet your child because your wife has more control over that because she's the one who birthed him?! That's absolutely crackerjacks.",
      "id": 135,
      "comments": [
        {
          "score": 213,
          "content": "Are you really though? This sub haaaaaaates anyone with a penis and takes the stance of “you must have done something to deserve this” \n\nOPs wife is a controlling AH…but OP must have done something to justify her behavior.\n\nMakes me sick to my stomach, some of these people.\n\nMy mother used to say “some of these single moms acted like they alone made the baby…then are shocked when they are left to it”",
          "id": 136,
          "comments": [
            {
              "score": 52,
              "content": "Yup posts like this always make this sub's sexism more than clear",
              "id": 137,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "The casual misandry in this sub is sad and pathetic. I've seen and reported several instances of posters making generalizations and personal attacks, but of course they're always ignored.",
              "id": 138,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 90,
          "content": "So much this. NTA",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "Nothing makes you realize Reddit is full of children like an AITA post. There’s absolutely no way you a functioning adult human could read this and try to pin any blame on OP. \n\nOP you’re not an asshole at all and I’m insanely sorry your wife is doing this to not only you and your child, but to your family as well. She has some serious issues she needs to work out but here’s hoping you guys can figure it out together",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "According to a lot of people he was supposed to kiss her @ss and hope that she'd one day \"allow\" his family to see their grandchild.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "Honestly, the amount of people asking for ‘the real story’ when the poster is male can tell you how bias it is. Yucks",
          "id": 142,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 443,
      "content": "ESH. If it was an afternoon visit I would have said NTA but being gone overnight/for a few days makes you suck too. Only 5 weeks post partum and being without her child against her will is not okay. Your family not meeting the baby is not equivalent to you taking the baby away from it's parent. There is no indication in your post that she ever took the baby away from you, so what you did is worse.",
      "id": 143,
      "comments": [
        {
          "score": 697,
          "content": "I did not wish to take our son from my wife but she refused to let my family see him while her family saw him as much as they wanted. I am a parent too, not a babysitter.",
          "id": 144,
          "comments": [
            {
              "score": 3,
              "content": "Have you actually asked her how she feels about your family? What were the arrangements discussed before your son was born about when and how you would introduce your son to your family? \n\nIt sounds like a lot more is going on with this situation. Either she’s not telling you everything (maybe she doesn’t feel like she can) or she has told you and you won’t listen/accept what she is telling you.",
              "id": 145,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "She had the option to go - it wasn’t against her will.",
          "id": 146,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 308,
      "content": "INFO -was it necessary to spend the night at your family’s place? Like do they live far enough away that if they came to visit you they’d be wanting to spend the night? Because having someone stay overnight is very different from someone staying for a few hours.",
      "id": 147,
      "comments": [
        {
          "score": 521,
          "content": "He mentioned somewhere that they offered to stay at a hotel but the wife refused to let them see the baby. Apparently she only wanted her family around.",
          "id": 148,
          "comments": [
            {
              "score": 399,
              "content": "And didn’t even want his family in the same city as them.",
              "id": 149,
              "comments": [
                {
                  "score": 368,
                  "content": "Yea, you can normally tell by the tone of a post how a person is, I don’t know if I believe this dude is the AH. It sounds like she’s being unreasonable & using being a new mother to dictate the rules.",
                  "id": 150,
                  "comments": [
                    {
                      "score": 339,
                      "content": "Yeah honestly I’m shocked by all the YTA comments",
                      "id": 151,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 233,
          "content": "He's said that his family would have stayed in a hotel but the wife would not agree to that. But I have other questions:   \n(1) Okay, she didn't agree to the family visiting and staying at a hotel. She also didn't agree with him taking the baby away for a weekend. Why wouldn't that more reasonable compromise of a brief visit with them staying at the hotel be the one he insists on rather than driving the baby 10 hours for a weekend trip? The logic is very \"well, she didn't agree to splitting the $10 prize with me, so I had to take $20 from her.\"  \n(2) I would like more info about the family visiting and staying in the hotel. Having your family come over for a couple of hours is one thing. In my family, when people tend to visit from out of town, they tend to hang around your house even when they are staying at a hotel. I would definitely be concerned about that. In which case her concerns about having to host them make sense.  \n(3) It doesn't seem like OP has really communicated with his wife about this--he doesn't really seem to know what she's feeling and why. It's weird. Usually with a situation like this we would hear the spouse give more info on the other spouse.\n\nAll in all, it's kinda weird and seems like information is missing.",
          "id": 152,
          "comments": [
            {
              "score": 151,
              "content": "Going by what you said, doesn't point 2 answer your question in point 1?\n\n&#x200B;\n\n>Why wouldn't that more reasonable compromise of a brief visit with them staying at the hotel be the one he insists on rather than driving the baby 10 hours for a weekend trip?\n\n&#x200B;\n\n>In my family, when people tend to visit from out of town, they tend to hang around your house even when they are staying at a hotel. I would definitely be concerned about that. In which case her concerns about having to host them make sense.\n\nOP's stated many times that taking the baby to his parents was to negate any concerns his wife had about hosting. Because, like you pointed out, it's pretty common even when staying in a hotel to spend the majority of your time at the person's house for whom you traveled. \n\nSo, assuming the above is accurate, going to his parents, so that they're then the hosts, takes the issue of hosting off of the wife entirely - no surprise pop-ins and \"we didn't want to be stuck in the hotel with just the bed and an uncomfortable chair\" -  and allows her to just relax and be a guest while his parents dote on all three of them.",
              "id": 153,
              "comments": [
                {
                  "score": 14,
                  "content": "But he could have had them come to a hotel but not visit the house.",
                  "id": 154,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Right I don’t see why this couldn’t have just been a stated boundary. Our home is off limits unless you’re invited in advance, my wife will not be available to say hello, I’ll see you at the zoo at 10am, feel free to make your own dinner plans.”",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "He explained the situation pretty clearly I thought.",
          "id": 156,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 307,
      "content": "There are a few things to consider. As the dad you should definitely get a say in your child’s life and if your parry have done nothing to warrant your wives refusal then that is a choice you should definitely have a say it.\n\nHowever… taking the baby for more than a few hours when it sounds like your wife is struggling could seriously upset her more. Sje might ne worried now that you will take the kid at anytime She if there is a solution where you can respect and care for your wife as well as including your family. Can you meet out, halve way between your homes of something ?",
      "id": 157,
      "comments": [
        {
          "score": 399,
          "content": "I don't plan on taking the baby anywhere else until my wife sees a doctor but I also don't plan on living my life getting permission from her to do anything with my son and my family",
          "id": 158,
          "comments": [
            {
              "score": 214,
              "content": "Hey OP, this is the part where I think you’re an a-hole.\n\n I think the argument I keep seeing in this thread “wife isn’t respecting husband’s wishes or letting his family see the baby, why should there be a double standard?” Is overly legalistic. Classic “you can be right and still be an asshole” situation, imho. She is clearly in the wrong here. You’re right, you don’t need permission. However, I think the attitude you’re coming at this from is rooted in bitterness + hurt that is leading to an overly legalistic concern with fairness and who has the right to do what, to both of y’all’s detriment.\n\nI think it is pretty clear there might be something going on with your wife mental health-wise. I know you said you didn’t realize that before you left. That’s okay, you realize now. In light of this information, separating her from the child for multiple days was not the compassionate, empathetic, or healthy thing to do in this situation. By doing that, you made a bad situation worse. \n\nAnd before people say “she’s not being compassionate to him, why should he have to be to her?” - they’re married! He loves her! This isn’t about some “motherhood pass” to act however she wants, for all y’all twisting yourselves in hysterics over “anti-father bias.” It’s about recognizing that she is wrong, she is currently failing on some level, AND treating her with support and compassion. Sometimes in a relationship with someone we love, I think we should act with greater grace than they necessarily “deserve” from a tit-for-tat situation. If its always one party being graceful for the other one, then that’s a problem, but I think digging into your empathy reserves here will go a long way. I know you’re tired and confused and probably emotional right now. It sucks to have to be the strong one. But I think for the long-term good of your marriage, treating this situation with love and forgiveness and recognizing your wife is struggling and not her best self rn is the best option. \n\nTLDR: I don’t think lawyering his POV and continuing to dig his heels in about whether he was justified to take the baby is the best move here, for the best outcome for BOTH of them. I think the focus needs to be on getting wife help and making her feel listened to in the moment. \n\nGood luck man, sorry you’re in this situation.",
              "id": 159,
              "comments": [
                {
                  "score": 10,
                  "content": "to be fair, your tldr isn't in the spirit of the sub.  \n\n\nHe asked if he was the asshole in this situation. Even if you lawyer it, he isn't. That's the point of the post, not to determine what the next best outcome is. Obviously, it's admitting the wife with PPD and possibly speaking to a lawyer if she refuses to seek help, as it WILL negatively affect the child for the rest of their life.",
                  "id": 160,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}