{
  "post content": "My (34m) sister gave birth 2 months ago. She brought the baby to mine and my wife's (23f) wedding.\n\nShe breastfeeds whenever she goes. We visit her house? She'll breastfeed in front of us. Visiting our parents? She'll breastfeed. Going out in a public setting? She'll sit on a bench on the park and breastfeed. Go out to a restaurant? She breastfeeds. Every where. I've never spoken on it because I know she'll get mad and offended but when she did that on my wedding I lost my cool.\n\nDuring the reception dinner she just did it again. I kindly approached her and asked her why she didn't bring formula or at least bump milk out and put it in the bottle so she wouldn't have to do all this at that moment. She said \"because I don't have to. I feel comfortable breastfeeding. Getting milk out on my own is more painful\" I said she could just make this sacrifice and compromise for one day instead of doing this in front of 250 guests on my wedding. She then said she can't do much about it now, because the baby has to have her milk. I told her she should be more thoughtful of that then instead of completely embarrassing herself and us by doing this.\n\nI told my wife what the deal was and she said I'm an AH and should immediately apologise to my sister. My parents also sided with my sister and now pretty much everyone thinks I'm an AH since I'm the only person who had a problem with it.\n\nThe only reason I decided to call her out is because I considered it a bad etiquette and tacky to do that at a formal event and that she could just find another solution for that night. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 64712,
      "content": "YTA. Your sister deserves a hug and a thank you for making the effort to attend a wedding with a 2-month old.",
      "id": 2,
      "comments": [
        {
          "score": 28034,
          "content": "YTA.  I'm assuming you fed your guests?  That includes your nephew.",
          "id": 3,
          "comments": [
            {
              "score": 15990,
              "content": "Did the guests at least eat with blankets over their heads? Or maybe they should just take their plates to the bathroom...",
              "id": 4,
              "comments": [
                {
                  "score": 11938,
                  "content": "Stop sexualizing your sisters breasts dude!\n\nWhy you guys gotta make everything weird?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3486,
                      "content": "It’s  certain people not everyone. Maybe I’m just from a major city and have seen it a million times but If someone scorned my partner for pulling her boob out to feed my daughter I’d have a problem. \nThis also may be one of the dumbest aita posts I’ve seen.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1025,
                      "content": "I mean, he's already pretty fucking creepy marrying some chick who's barely out of college and 11 years younger than him. Dude already has weird sexual hangups, not surprised that his fixation toward his infant nephew's food is on the list too.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 74,
                      "content": "This guy is 34 and married someone who is 23. I think that speaks to his level of maturity.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 29,
                      "content": "Seriously! It's like, people are so angry when they can't, or shouldn't sexualize a woman's body. Like, breasts are used to feed babies, and vaginas bleed from time to time, and, women naturally have body hair. You don't need to think about women's bodies like all they are good for is sex",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1420,
                  "content": "Nah, the guests meals were prepared hours earlier with the blood, sweat and tears of the chef, kept in an esky, and then zapped in the microwave for a few seconds before they were served. Sure their meals tasted stale and soggy, but that's the sacrifice the chef and guests should make for OP's big day.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 1228,
                      "content": "your sister didn't do this so everyone could see her breast,  she did it because  she loves her brother and had a 2 month old to attend to.\nsorry my friend but you owe sis an apology  and make it sincere. she could have easily blown off your wedding (intact it would have been easier  for her) but out of love and respect, she came. show her some love and respect back. Hope you to mend your fences!\nfamilies everything to me",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 728,
                      "content": "If I just married someone and within two hours of being newlywed they berated their sister for feeding their child In the most natural way possible , I’d think I just fucked my life up hardcore.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 93,
                      "content": "The baby may have been the only one satisfied with the menu selection.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 21,
                      "content": "I'm sorry I'm still learning how this works but wouldn't 'n a h' count as a vote if we don't put a space between it? \nI thought you voted like that and only realized you just said no sarcastically lol.\n\nAnd OP, YTA. Out of all the people around you, you were the only one to sexualise and feel uncomfortable with your sister breastfeeding and still you don't think you're TA?",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "you shouldn't microwave breastmilk, just an fyi",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 422,
                  "content": "Especially if they ate chicken…. BREAST.  The horror 🫣",
                  "id": 16,
                  "comments": [
                    {
                      "score": 613,
                      "content": "Those tacky chickens have breasts wherever they go. To the farm? Breasts. To the vet? Breasts. Eating? Breasts. Sleeping? Breasts. The least they could do would be to not have breasts sometimes. I mean it’s a WEDDING.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 412,
                  "content": "This. Loved the post where the OP put the blanket over her brother or BILs head.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 292,
                      "content": "I’ve heard fellow breastfeeding moms threaten to squirt milk at strangers who tell them to cover up in public. I’ve not had the opportunity… yet. Almost certainly would if I was angry enough.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 191,
                  "content": "Yesssss!",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "It's just a boob, and in a totally non sexual setting. I don't get the issue people have with seeing that.",
                  "id": 21,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 24,
                  "content": "Anyone who would tell me to use the bathroom would find their meal there as well",
                  "id": 22,
                  "comments": [
                    {
                      "score": 9,
                      "content": "When I came back from maternity leave at my job, they said if one of the offices wasn’t available I could pump in the bathroom (it’s illegal not to provide a place OTHER than a bathroom in my state). I asked my director if she likes eating in the bathroom, and she reconsidered and told me an office would always be available. They’re just lucky I didn’t decide to use the pumping room available in our building, as it would have been a 15+ minute walk for me each direction, two times a shift.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 602,
              "content": "Love this",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 128,
              "content": "The only answer needed. Thread over!",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I legit had the same thought. Why was this kid the only one not allowed to eat?",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I want the baby to ask if he's the assbole for needing to be fed during the wedding and not yet able to chew solid food for his uncle's convenience.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "He doesn’t seem to understand what’s going on. He says his sister is breastfeeding…everywhere. He can’t comprehend that his newborn nephew is eating…regularly. I mean, it’s kinda like his job.\n\nSometimes boobs have jobs.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10356,
          "content": "I can't be the only one who is dying at his \"But she breastfeeds everywhere and ***ALL THE TIME!******!***\" comments. In other words, 34 year-old man exposes himself as not only ignorant of how breastfeeding and breast milk supply work, but also unaware that newborns do indeed require regular feeding.",
          "id": 29,
          "comments": [
            {
              "score": 3944,
              "content": "Wait you have to feed them more than once? That’s where we went wrong!",
              "id": 30,
              "comments": [
                {
                  "score": 2940,
                  "content": "When my son was born I just showed him where the fridge was and to make sure he shut the door behind him\n\nEdit for spelling, though at that age he very well my shit on the door, who could blame him",
                  "id": 31,
                  "comments": [
                    {
                      "score": 1370,
                      "content": "Most would say to shut the door, but I suppose the baby is only a couple months old 🤷🏻‍♀️",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 24,
                      "content": "Huh, usually you would teach them NOT to shit on the door, but you do you",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "Best. Typo. Ever.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I honestly thought for a split second that \"shit the door behind him\" was on purpose and some kind of slang from a culture different than mine....and still practically spit out my wine!",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "You had to show him the fridge? You must have given birth at a subpar hospital.\n\nThey should have made sure your son was capable of making himself a pan of scrambled eggs before discharging y’all.",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "Just throw a sandwich in his crib and tell him to text you if he needs you.",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 902,
                  "content": "As long as you don’t feed them after midnight, they’ll be fine. \n\nAlso don’t let them get wet.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 422,
                      "content": "They are self wetting, what do I do????",
                      "id": 39,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 534,
                  "content": "To be fair, with no babies in their circle my Sis and bil thought a baby needed 3 feedings a day when asked... They were send to parental classes by the doc. They knew everything by basic knowledge like sleeping etc, but feeding, what they can or can't eat until a few years old...blank.\n\nBut if they visited someone with a baby, they would be smart enough to deduct a baby would need many feedings",
                  "id": 40,
                  "comments": [
                    {
                      "score": 238,
                      "content": "That’s tragic and an indictment of the education system. Sounds like the doctor had his head screwed on. Hope your sister and her little one are doing well.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "One of my BILs thought babies were born with their eyes closed like puppies and kittens. Was surprised when the baby came out. The nurse has to leave the room with laughter.",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 23,
                      "content": "When I was younger I assumed babies lived at the hospital for the first year of their life since the idea of just regular people being responsible for a INFANT seemed so weird.",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "This is my Goldfish all over again",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "FEED? You have to FEED babies? OHMYGODINEVERHEARDOFTHATOHMYFUCKINGOHNOOHFUCKOHFUCKOHFUUUUUUUCK!",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I didn’t have to. When my newborns were hungry in an inappropriate place I just explained to them that if I was to feed them now pervy men, who might have issues with their own sisters breast (ew) would be bothered. They understood, nodded, and went right back to sleep. Win win!",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Wait! You mean we have to feed them every day?!",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2803,
              "content": "A 34 y.o man getting married to a 23y.o woman... i dont think op is mature enough to understand much about babies. You are 100% right.\n\nOp YTA. Breastfeeding is a normal and natural part of life. Keep your bad thoughts to yourself.",
              "id": 48,
              "comments": [
                {
                  "score": 1023,
                  "content": "I honestly couldn’t read past that. He’s a jerk based on that alone. \nINFO how long were they together before getting married? I want to know if he’s JUST an asshole, or a skeevy perverted predator asshole",
                  "id": 49,
                  "comments": [
                    {
                      "score": 702,
                      "content": "I feel like we both know which one it is if he's referring to breastfeeding as \"tacky during a formal event.\" I'm 100% sure the only way it could possibly be tacky is if he's sexualized it himself. Someone is tacky but it sure isn't the new mother.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 480,
                      "content": "One of those ones where I read the title and think \"yep\" before even opening it.\n\nThere needs to be a ranking above asshole. Like \"YTFW\" (You're The Fucking Worst)",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 29,
                      "content": "I too would like to know how long he waited to date his wife after she started eating table food.",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Rarely is there a post where a horrendous title can't be mitigated by content and context. THIS is that post.",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 797,
                  "content": "The 23 yo wife is the mature one in the relationship",
                  "id": 54,
                  "comments": [
                    {
                      "score": 417,
                      "content": "The newborn is already overtaking him.",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 456,
                  "content": "Literally EVERYONE in his family has sided against him and he’s still like… I don’t know. I’m not convinced. \n\nYTA OP",
                  "id": 56,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Right, like why does this need further discussion? 💀",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 364,
                  "content": "Yeahhhh that set off alarm bells before the OP even got to the breastfeeding part. I wouldn't think it were a problem if the OPs wife was 33 and OP was 44. But I feel like these ages are a bit disconcerting.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 293,
                      "content": "Well, OP does seem to like to control women (he doesn't blame his nephew for being hungry).",
                      "id": 59,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "OP does not clear the \"half your age plus seven\" rule, and that's the rule of thumb I use to determine if an age gap is creepy.",
                      "id": 60,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 220,
                  "content": "Well at least his wife now knows what to expect from him if she is ever pregnant.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 41,
                      "content": "Waiting for the corresponding r/advice post titled \"I married a controlling jerk 11 years my senior who flipped out on his sister for breastfeeding, what do I do now?\"",
                      "id": 62,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 112,
                  "content": "^(I just hope they didn't date 10 years ago already...) 💀",
                  "id": 63,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 59,
                  "content": "Yeah, as soon as I read that I was like ohhh no... there's something very wrong, and then I read the post and was like ohhh no... multiple things very wrong",
                  "id": 64,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 27,
                  "content": "It’s funny that his wife is 11 years younger but miles more mature.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Yep, OP’a skull is too thick to understand that breasts don’t exist for a man’s sexual pleasure. Stop sexualizing breasts and ESPECIALLY in this context. OP, you’re rude as fuck, a bit dumb and very much selfish. YTA",
                  "id": 66,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 945,
              "content": "that was hilarious. when they are visiting the baby's house! it cant wait with eating until the guests leave!? the manners on that 2 month old. lmao",
              "id": 67,
              "comments": [
                {
                  "score": 135,
                  "content": "The AUDACITY!",
                  "id": 68,
                  "comments": [
                    {
                      "score": 60,
                      "content": "The AUDACITITTY!",
                      "id": 69,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "This is why I don't like children, they have the audacity to be hungry more than once in their lives!\n\n(This is meant as a snarky comment for anyone who isn't great with tone/isn't sure.)",
                  "id": 70,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 664,
              "content": "Please, the baby is on this earth for two month already and still hasn't learned to pull himself together and only drink somewhere locked away. Bad parenting!",
              "id": 71,
              "comments": [
                {
                  "score": 282,
                  "content": "Violently American. Why isn't he/she working already? They got hands!",
                  "id": 72,
                  "comments": [
                    {
                      "score": 206,
                      "content": "Right? Ought to pull himself up by his baby booties velcro straps.",
                      "id": 73,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "I was born one morning when the sun didn't shine, \nPicked up my shovel and I walked to the mine...",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "Put him in obedience class!",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Obviously nobody gave the baby some bootstraps as a birthing present.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 508,
              "content": "Good luck to his new wife if they decide to have children. I am already suspicious of a 34 yr old marrying a 23 yr old.",
              "id": 77,
              "comments": [
                {
                  "score": 227,
                  "content": "My thoughts exactly. Of course, at 23 I would think you \"just don't get it! I'm mature for my age! He respects me! Its not like that, we're both adults and age is just a number!\"\n\nEarly 20s to 34 is a HUGE gap in life experience. Its not like going from 34 to 44. He will have been (at least considered) an adult for over a decade. I wish I knew when I married at 22 with my 33 yo then husband, that he knew more about manipulation than my newly college graduated brain could imagine. It would've saved me a lot of pain....and the rest of my wasted 20s.\n\n I'm 34 and 23-year-olds still seem like kids to me!",
                  "id": 78,
                  "comments": [
                    {
                      "score": 25,
                      "content": "I was almost 11 years younger than my ex. We met when I was 23 and I honestly didn't know his age until we were already involved. He seemed my age, I figured we were just at the same maturity. Nothing about it was creepy, we were friends first and gradually became an item. I just never thought to ask.\n\nAlmost 10 years and a marriage later, he still hadn't matured any further. What I'd thought was just a youthful nature was really just him never growing up. I didn't want to spend the rest of my life waiting for him to take life seriously.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "So true this poor woman will not be allowed to breast feed anywhere. Ops attitude towards breast feeding is a major red flag for his new wife. She will probably wisen up and leave his arse",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "In his defense, he sounds like an immature idiot, so the age gap likely isn't that extreme.",
                  "id": 81,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "Wait until he finds out about diaper changes.",
                  "id": 82,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 375,
              "content": "Frankly, I’m a little disturbed by how often he must pay attention to his sister’s breasts to know how often she feeds his nephew. I have been around soooo many friends and family who have breastfed and like, it’s really not something you notice much unless you’re looking for it.",
              "id": 83,
              "comments": [
                {
                  "score": 38,
                  "content": "My mom has always been kinda crunchy so she was determined to nurse each of her kids for approximately two years and did. There are seven of us, I am the oldest, and I am nearly eighteen years older than the youngest. Think about that…nearly fourteen years of breastfeeding!! \n\nShe is also super conservative and so always nursed discreetly. By this I definitely don’t mean with a big blanket or nursing cover that draws attention though. No…my mom didn’t use a cover except in the very beginning as the baby was getting the hang of things. I swear most of the time most people would never have known my mom was feeding her baby…they just thought my mom was holding her napping offspring.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Your mom is the MVP 😊",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "Exactly. I happened to glance at a woman breastfeeding in public recently, but I was probably looking in her direction for a while before I even realized it, and once I did, I was just like, oh. \nOP is way too concerned over a breast, especially since it’s his sister’s breast. Like just don’t look if it makes you uncomfortable, which it shouldn’t.",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 355,
              "content": "Maybe he would have felt less embarrassed if his sister pumped first, and then soaked her dress when her milk let down as she bottle fed the baby.\n\nOr fed the baby while sitting on a toilet, because who **doesn't** like eating on the toilet? /s",
              "id": 87,
              "comments": [
                {
                  "score": 19,
                  "content": "And then disrupted proceedings with a screeching baby that's hungry but doesn't want to take a bottle, because they're used to a real nipple. Then we'd be reading \"AITA for telling my sister she couldn't breastfeed at my wedding but getting mad when her baby had the audacity to cry\"",
                  "id": 88,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "YES! MY THOUGHTS EXACTLY!",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 315,
              "content": "It’s shocking how many people don’t realize that babies eat constantly. The father of my child thought babies eat three times a day like adults do. Wild.",
              "id": 90,
              "comments": [
                {
                  "score": 27,
                  "content": "I’m a fully grown adult and if I don’t have 3 meals and 2 snacks a day I’m fucking miserable",
                  "id": 91,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "I wish how much easier it would be my own toddler doesn’t do 3 meals a day.",
                  "id": 92,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "I know guys who thought women fed their babies in public to taunt them. \"Nyah nyah can't touch!!!\"",
                  "id": 93,
                  "comments": [
                    {
                      "score": 24,
                      "content": "I don't know why, but for some reason I'm always freshly aggravated by men who seem completely unaware that a woman might do literally anything for a reason other than \"because she either wants or hates my dick and really wants to hear my opinion on that\".",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Right?? He acts like she's at spring break flashing for beads. \n\nShe is feeding her child. Or would he rather have a screaming baby at his wedding?",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Can’t she just “bump” the milk?! Good lord…",
              "id": 96,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2325,
          "content": "Seriously. He’s lucky they all showed up dressed and stayed for the reception. I think it was 4m before my anxiety was settled enough to all go out for longer than an hour or 2. His poor sister is showing up with a newborn who is probably still waking every few hours only to be “called out” for doing her best.",
          "id": 97,
          "comments": [
            {
              "score": 23,
              "content": "OP: YTA- I think I was crying on the couch in leggings and a nursing tank for at least 10 weeks. I couldn't have left the house. Your sister is a rockstar",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1737,
          "content": "Yes - and a PSA to OP and anyone else who may not realize: \n\nNot everybody can just spontaneously pump milk. It’s not necessarily easy to spontaneously change to formula and it might give baby an upset stomach. Not all breastfed babies will actually take a bottle. \n\nIf you don’t want a screaming baby, you let a breastfed baby breastfeed.",
          "id": 99,
          "comments": [
            {
              "score": 667,
              "content": "And don’t ask her to go to the bathroom... not only is she missing out on the reception, but sitting on a toilet seat that might smell like poop or puke or listening to drunken drama while just trying make sure they’re baby lives is just miserable.",
              "id": 100,
              "comments": [
                {
                  "score": 390,
                  "content": "Plus it is super nasty! You don't bring a newborn into a dirty bathroom stall unless you absolutely have to! Couldn't imagine eating my lunch in a bathroom stall, sure wouldn't want to make a baby do it! Especially for the half hour it can take with a little one",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 193,
                  "content": "I hate when people say that. Like you wouldn't eat in there so why make a baby with less of an immune system do it?!?",
                  "id": 102,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 32,
                  "content": "Anyone who suggests that breastfeeding should be done in a bathroom should be forced to eat there themselves.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "For real, like would you eat your dinner in a bathroom? No. Why should a baby?",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "You know, back when the San Francisco Zoo was built, they had a Mothering House, where a nursing mom could kick back, sit on a comfy chair, sip on a lemonade…\n\nSo, here’s my vision—like a section in a back corner of the church cordoned off with a silk rope, with a huge loveseat with cushions, blankets, burp rags in the bride’s colors. After the ceremony, move the whole shebang to the reception.\n\nSee, that’s an option, too. Imagine if that started trending.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 244,
              "content": "Yes. Some babies won’t take a bottle, even it is breast milk. My oldest didn’t care. My youngest would rather starve and scream.",
              "id": 106,
              "comments": [
                {
                  "score": 27,
                  "content": "My middle one was like this too. She didn't even accept a pacifier - other than my nipnops. She was latched on like 14 hours a day. Good times.",
                  "id": 107,
                  "comments": [
                    {
                      "score": 11,
                      "content": "My oldest was that way. No bottle would do, no matter what was in it. Pumping was difficult and, as It turned out,a waste of time. I was the only bottle *and* pacifier he'd accept. Kinda worked out though, he weaned himself at 6 months because he loved his baby food and I never had to break him of the pacifier.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "My boss's baby tries to be like this, but he'll eventually take the bottle when he realizes he's not getting any more breast. \n\nMy boss can't produce enough for him to be exclusively bf and she has to leave him with his dad every few weeks for doctor's appointments (covid risk for baby during appointments he doesn't need to be at). It's very funny because the baby will take the bottle no complaints if he can't see or hear her, but as soon as he hears his mom, he'll immediately reject the bottle. \n\nOnly a few months old too. Can't even crawl yet.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "I have a friend who has a baby girl. Said baby girl has just about turned one. Said baby girl has STRUGGLED to go on formula and off the titty. Said baby mama cannot pump as it causes her pain. In conclusion, baby is almost a year old and she's struggling to ween, imagine 2 months LMAO.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I had one of those who wouldn't take a bottle. I pumped fine, and that worked for my other two kids, but my middle baby just *would not*. Being American, I had to go back to work after 6 lousy weeks, so for *months* either I had to race home on every break to nurse, or my husband had to bring the baby to my work. I was working 16 hour shifts, so two meal breaks and four 15-minute breaks every work day were just feeding the baby. Nevermind me eating or resting or anything. Good thing we lived close to my job. There was just no other option, unless letting the baby scream and not eat until they made themselves sick was an option (it was not). We finally transitioned to cup a little before a year, but the baby was insanely picky about those too - I swear we tried every cup on the market before hitting on one that was acceptable. You do what you have to do.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "[deleted]",
              "id": 112,
              "comments": [
                {
                  "score": 9,
                  "content": "I don’t think anybody’s boobs like the pump (even people who are technically successful at it, which is a crapshoot). \n\nI had to pump exclusively for a while because my NICU baby was too little to feed any other way. I can produce milk but jeez, it’s physically and emotionally not a good time. \n\nPeople who are like ‘just pump for this one thing’ don’t understand that to be able to pump successfully you have to have a whole PITA routine. Your body can’t just be like ‘oh yeah, this one time and one time only, I’ll make double what your baby usually eats.’ Like no, I am not going to spend two weeks training my body to overproduce milk so that you don’t have to mind your business at a party.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "[deleted]",
              "id": 114,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "And if she did bring expressed milk, was she meant to go pump in the middle of the reception when she got engorged? Bring all that gear and set up where? Bride’s VIP room? Bathroom? 🙄",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yeah, at 2 months out, mg freezer stash was tiny, because baby was eating every couple of hours, so there really wasn’t a time when I could pump and get much out.",
              "id": 116,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 657,
          "content": "[deleted]",
          "id": 117,
          "comments": [
            {
              "score": 10,
              "content": "That's....big....",
              "id": 118,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 653,
          "content": "She breastfeeds all the time because 2 month olds eat all the time. \n\nWould OP rather have a screaming hungry baby at his wedding? \n\nYTA",
          "id": 119,
          "comments": [
            {
              "score": 14,
              "content": "Shit if I brought my 2 month old to a wedding I probably would have fed during the ceremony on purpose cause she'd stay quiet that way",
              "id": 120,
              "comments": [
                {
                  "score": 12,
                  "content": "OMG yes. I breastfed my kid through a 5-hour airplane flight. Through a football bowl game (his dad worked in athletics). It was LITERALLY the only thing that kept my colicky kid quiet, and fortunately, it worked like a charm.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Can confirm. My son breastfed for like 30-40min, and then wanted to eat again like an hour or so later. Like, when on earth is there time to pump? You have so much other stuff to take care of when they’re not nursing. And formula isn’t an easy solution bc you *still* have to pump during that time to replace a missed nursing session (to keep supply up and avoid clogs/mastitis). Breastfeeding is hard ass work. Verdict is definitely YTA.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 582,
          "content": "OP seems to think that boobs are *reallly* just for sex play.  Super duper AH.",
          "id": 123,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 252,
          "content": "Absolutely. YTA",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 230,
          "content": "Absolutely, I agree with this person, she deserves a hug and thank you for making the effort to attend a wedding with a 2 month old, oh and the fact that she felt comfortable bringing her baby was nice too.\n\nEdit: YTA",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "I don’t understand how he’s old enough to go through a mid-life crisis but has yet to figure out the main function of breasts. It’s almost like they don’t just exist for viewing pleasure (insert shocked gasp here).",
          "id": 126,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 29410,
      "content": "YTA.\n\nGod, what *is* it with all the guys who marry women much younger than them?  They all seem to be immature and controlling in the same way!\n\n'Everyone thinks you're the AH because you're the only person who had a problem with it.' -- and they're right.",
      "id": 127,
      "comments": [
        {
          "score": 8097,
          "content": "I was focused on the breastfeeding, I missed the creepyness of the age difference...",
          "id": 128,
          "comments": [
            {
              "score": 4620,
              "content": "It's not so much that the age difference is in itself creepy, it's just that in AITA stories there seems to be a specific icky behavior pattern that goes with an older husband and younger wife.",
              "id": 129,
              "comments": [
                {
                  "score": 3746,
                  "content": "mysterious makeshift hospital whistle support plate alive silky roof badge\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                  "id": 130,
                  "comments": [
                    {
                      "score": 477,
                      "content": "Exactly",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 94,
                      "content": "Imagine if op and his wife have children and the wife decides to breastfeed.",
                      "id": 132,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Even still she's apparently much more mature than he is",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Ah flashbacks of me getting married at 22 to a 35 year old with major control issues. That marriage did not last long.",
                      "id": 134,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1031,
                  "content": "I think when he is in his thirties or up and she is under 26 or so this dynamic is almost always there.\n\nI’m assuming they’ve been dating for at least a year or two? What does a 33 year old have in common with someone who is barely an adult.",
                  "id": 135,
                  "comments": [
                    {
                      "score": 1066,
                      "content": "Immaturity",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 266,
                      "content": "I got downvoted to an oblivion (by dudes probably) on r/askreddit today for saying that men in their 30s that date women in their early 20s have a tendency to be manipulative. Nice to see that a lot of people share this thought.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Emotionally maturity age they both sound around 25. Good for the wife to at least tell him he’s an asshole.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 673,
                  "content": "Disagree. The age difference is ridiculous. Any man who's over 30 and chasing 20 year olds is sick in the head.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 358,
                      "content": "I was 19 dating a 26 year old guy…it makes me cringe just thinking about it. I was so gullible. \n\nThere’s so many life milestones that change your perspective in big ways once you pass them; graduating high school, getting your driver’s license/first car, moving out into your own place, legal to drink, finishing college, etc…too many of those between you and you might as well be aliens from different planets. I mean, I couldn’t even *legally get into* most of the places he and his friends hung out at for another 2 years!! \n\nSo, yeah, I was basically his little underage fucktoy. We had NOTHING to build a “relationship” on. There was NO LEGITIMATE REASON for him to go after me except that I was inexperienced and naive as hell so he could get away with treating me like shit. I never really met his friends because if they all went out I couldn’t go, and he certainly wasn’t going to hang out at coffee shops with me and MY friends, so the whole thing was just this isolated, one-on-one bubble of watching tv at his place and fucking, with an occasional restaurant dinner or round of frisbee golf. 🙄 I never got to see how weird it was, and my friends didn’t either (or they hopefully would have knocked some sense into me.)\n\n(How did it end? He was cheating on me with my DORM ROOMMATE.)",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 387,
                  "content": "Right. Like my husband are 12 years apart but we met when I was 28, not 23. I've asked him if he would have dated me if I was 25 or younger with our age gap and he told me not a fucking chance lol. \n\nOP is probably sexualizing his sister's breasts, is WEIRD and like, it's just a baby needing to eat. Smfh.",
                  "id": 141,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 47,
                  "content": "And was there any need to tell us his wife's age? He didn't bother mentioning his sister's age. Seems like he thinks it's a brag. 😬",
                  "id": 142,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Yeah, I didn’t notice at first because I assumed it was his sister’s age! His wife’s age isn’t even relevant to the story, unless he’s attempting to imply that it should discount her opinion 🥴",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 28,
                  "content": "This - at times people with a moderate age difference may legitimately have a lot in common and share mutual love and respect for one another. It is totally possible for age gaps to work!\n\nThe type of person who ends up on AITA about it, either as the very young one being gaslit or the much older one stunned that everyone thinks they’re a jerk, are not in those healthy relationships. They’re in those relationships because one was naive and manipulated and the other was too much of a jerk to appeal to anyone with the life experience to know better.",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 918,
          "content": "they do it because when they are young they are easier to control.  he wants to be able to tell her where to breastfeed and have her obey.",
          "id": 145,
          "comments": [
            {
              "score": 258,
              "content": "I thought the same but according to his own words he’s in for it, cause she looks like she has spunk and some strength of character! I sure hope so.",
              "id": 146,
              "comments": [
                {
                  "score": 156,
                  "content": "My guess is he was hiding his true self and finally showed her who he is and she was like “hold up wait no.” Let’s hope she doesn’t delude herself into thinking she’ll change him!",
                  "id": 147,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "yep.  maybe he found out at the wedding that she isn't a pushover.",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yeah we’re assuming he’s controlling her but she spoke out very vocally against him. She’s 23, not a teenager, while this can create a power indifference that’s not inherently true. I like to believe this girls gonna whip him into shape.",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 747,
          "content": "Generally I find it’s women of their own age don’t put up with their shit. Easier to find someone who doesn’t know what a shitty relationship is when they’re younger.",
          "id": 150,
          "comments": [
            {
              "score": 245,
              "content": "Can confirm- when I was 23 I was so easily manipulated by older men and sincerely believed they liked me because I was mature. Nope... now I’m 30, not even that much older, but I will never put up with that BS again. My fiancé happens to be a few years older, but he’s absolutely not the “I like you because you’re so mature for your age”. We just are at the age where a few years doesn’t matter at all.",
              "id": 151,
              "comments": [
                {
                  "score": 226,
                  "content": "When someone older tells you how mature you are for your age, that’s always a red flag.\n\nSomeone whose mature for their age is traumatized",
                  "id": 152,
                  "comments": [
                    {
                      "score": 19,
                      "content": "“Someone whose mature for their age is traumatized.” \n\nOoooooof! Just brought all of us former “16 going on 30” girlies to our knees. Well said.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Take my poor persons award 🥇.  100%",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Same, I briefly dated a 32 year old man when I was 20 and I was so easy to manipulate. Still creeps me out thinking about it.",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 298,
          "content": "Imagine how young she was when they started dating. So nasty",
          "id": 156,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 255,
          "content": "Because he can't find anyone his own age willing to tolerate his crap. Now though, his wife is onto it and I don't see this marriage lasting out this year.",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 176,
          "content": "For fucking real. Also his complaint about her doing it literally anywhere is absurd. I literally saw a mom do it at the library the other week, and my only thought was oh cool ill give her some privacy. Like does he get mad when she had to change the babies diapers in public to? I just can't wrap my head around about him complaining about doing it at their PARENTS house.",
          "id": 158,
          "comments": [
            {
              "score": 22,
              "content": "He complained about her doing it at her own house! It's not embarrassing to feed your child the same way all mammals have been feeding their kids for eons.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "He probably thinks it’s like putting gas in your car, you just top up the tank when you choose to go to gas station.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 173,
          "content": "And his wife is way more mature already, it is not gonna age well",
          "id": 161,
          "comments": [
            {
              "score": 13,
              "content": "Neither will he",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "They are also always incapable of viewing women and their bodies as anything other than objects for men’s sexual pleasure. Why are you so obsessed with your sister’s breasts, OP?",
          "id": 163,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "Right? OP, YTA. What offends you, exactly? A mother feeding her child, with her body, the way it was intended? You should be unfathomably embarrassed by your words and judgement. \n\nYou're the tacky one. And, the age gap between you and your poor bride is not great either. No wonder you are afraid of skin.",
          "id": 164,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": ">now pretty much everyone thinks I'm an AH since I'm the only person who had a problem with it.\n\nThis is hilarious. \n\nThis guy is a real life Skinner meme. \n\n\"Am I the AH?... No, it's everyone else that is the AH\". \n\nSkinner, YTA",
          "id": 165,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13167,
      "content": "INFO: Did you ask all the other guests at the wedding not to eat as well?",
      "id": 166,
      "comments": [
        {
          "score": 4831,
          "content": "He should have made everyone just eat the same way! “Ok everyone - we’ve provided a thin blanket for every guest to place over their plate and head so that you can privately enjoy your meal. The other option is to go eat on the shitter! Happy meal time!”",
          "id": 167,
          "comments": [
            {
              "score": 5224,
              "content": "It's the new RSVP card, pick your selection:\n\n\\_\\_\\_ Blanket over head\n\n\\_\\_\\_ On toilet\n\n\\_\\_\\_ In blazing hot car, back seat preferred",
              "id": 168,
              "comments": [
                {
                  "score": 669,
                  "content": "Now I'm imagining a BabyAITA for infants to discuss precisely this kind of injustice and where/when/if it's ever justified...the debate would be riveting",
                  "id": 169,
                  "comments": [
                    {
                      "score": 312,
                      "content": "The discord offshoot from my due date group has a baby discord channel where the babies complain about things. Like being told they can't eat with their pacifier in their mouth, not being allowed to play in the dog's water, etc. It's a nice coping mechanism for our toddlers' meltdowns and lack of logic.",
                      "id": 170,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 27,
                      "content": "“Hey guys so me 3mo/F and my parents were at a wedding and my mom legit put a blanket on my head when they served dinner. I heard my uncle yelling at her and then next thing I knew, I was eating in the dark! Has anyone here ever had this happen? Shouldn’t we be able to eat and breathe like anyone else?!”",
                      "id": 171,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 27,
                  "content": "Extra points if your doing it while sitting backwards,  buckled in while going down the freeway, and someone is leaning awkwardly over you trying to feed you…",
                  "id": 172,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "\\_\\_\\_\\_\\_\\_ Would you like your meal served with the disapproving glances of older family members?",
                  "id": 173,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "made me laugh !!",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 256,
              "content": "Also have painfully throbbing breasts full of milk increasing sizes by the minute glued to their chest while risking mastitis",
              "id": 175,
              "comments": [
                {
                  "score": 140,
                  "content": "Seriously! I’m pretty sure for the first 8ish weeks I literally was just squirting milk out constantly trying to get used to my production. I was feeding every 45m to an hour for a long time because I hated pumping but the alternative was soaking through my outfit or getting violently nauseated from clogged ducts. Even if sister was able to pump/ bring a bottle - what was she supposed to do about the milk she’s constantly producing?? Idiots everywhere 🫠",
                  "id": 176,
                  "comments": [
                    {
                      "score": 30,
                      "content": "I was fountain. I felt a kinship with the fountain.with the squirting breast.  First time the baby slept over 2 hours my bed was soaked in milk looked liked some dumped a few.large glasses in bed.",
                      "id": 177,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 75,
          "content": "LMAO",
          "id": 178,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 12507,
      "content": "The only tacky person with bad etiquette is you. YTA\n\n&#x200B;\n\nSide note: you are 34 and your wife is 23?",
      "id": 179,
      "comments": [
        {
          "score": 8334,
          "content": "Imagine being married to a woman 11 years younger and her still being more mature. \n\nMadness",
          "id": 180,
          "comments": [
            {
              "score": 1262,
              "content": "This was not lost on me either.",
              "id": 181,
              "comments": [
                {
                  "score": 1471,
                  "content": "Most men in their mid-to-late 30s and over, chasing women in their early 20s, tend to be deeply dysfunctional, often misogynistic and very emotionally insecure.",
                  "id": 182,
                  "comments": [
                    {
                      "score": 694,
                      "content": "And why is he fixating on his SILs breasts.  He should be focused on his beautiful child bride.",
                      "id": 183,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "Totally agree.",
                      "id": 184,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "As someone with a dad who is 15 years older than my mom (they married when she was 22 and he was 37 and freshly divorced) I can confirm this 100000000000x lmao",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 257,
              "content": "That's usually the case with age gaps like that.",
              "id": 186,
              "comments": [
                {
                  "score": 159,
                  "content": "There's a reason guys like this look for women much younger than they are",
                  "id": 187,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "She has way more sense than him, and she’s much more mature.",
              "id": 188,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Tbh his maturity level is probably the reason he’s marrying someone in her early 20s",
              "id": 189,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 215,
          "content": "Exactly. I was looking for this. \n\nYTA",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "That’s what stood out to me too",
          "id": 191,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8038,
      "content": "Yes, YTA, I would figure that having your parents and wife tell you would have been enough, but some people need more evidence. Since you personally do not have breasts, you have no clue how painful or difficult pumping might be, so you're a jerk for suggesting it.\n\nThen there's the fact that you never yold her that it bothers you, but expected her to just magically understand that you had a problem with it.",
      "id": 192,
      "comments": [
        {
          "score": 2010,
          "content": "Plus, how would he know if the baby would take a bottle at all? Many exclusively breast fed babies won’t take a bottle. I know mine wouldn’t. And OP thinks that an exclusively breast fed baby should just suddenly be given formula? Outside of an unexpected situation, I’d think the baby would be slowly transitioned.",
          "id": 193,
          "comments": [
            {
              "score": 589,
              "content": "And if she could pump instead of breastfeeding, she would have had to do that during the wedding, which would have taken her away from the wedding for a long time.",
              "id": 194,
              "comments": [
                {
                  "score": 327,
                  "content": "Now I'm just imagining her pumping at the wedding instead, and OP getting equally as mad.",
                  "id": 195,
                  "comments": [
                    {
                      "score": 52,
                      "content": "Madder, because of the noise of the pump or her half-hour absences.",
                      "id": 196,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 32,
                      "content": "I bet that even if she had bought a bottle, he would be complaining about how many times she “distracted” people at the wedding by stopping to give a bottle or asking to warm it up or something equally stupid, because he clearly has no respect for his sister’s efforts to be there with a two month old newborn for several hours.",
                      "id": 197,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "That’s my point too. She’d have created an oversupply AND she’d have to pump frequently throughout the wedding. As someone who was constantly pumping for 7 months, that’s not better than breastfeeding and is far less dignified (although I now sort of wish his sister had cracked out the electric double pump during speeches).",
                  "id": 198,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 458,
              "content": "Imagine trying to make your baby eat from a bottle for the first time and your boobs leaking milk fucking everywhere. THAT would have been stressful to experience, both for her and the other guests. No one even seemed to be bothered by the woman quietly feeding her little baby anyway (why should they?? We have all been there!)",
              "id": 199,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 259,
              "content": "And even if the baby could take a bottle (be it pumped milk or formula), mom would still have to pump when baby has the bottle so as not to upset her milk supply. OP is very ignorant on how feeding babies works.",
              "id": 200,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 48,
              "content": "This is the same dude that told women all over to just start pumping milk to cover the formula shortage.",
              "id": 201,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 39,
              "content": "This! I’m sure OP would have been pretty upset if there was a hungry and screaming baby at his wedding because the baby isn’t used to a bottle.",
              "id": 202,
              "comments": [
                {
                  "score": 12,
                  "content": "And he would have screamed at her and then come to this subreddit about it. Men like this think women are scapegoats for all their problems and there is no winning with them. I feel sorry for OP's new wife",
                  "id": 203,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Mine wouldn’t take a bottle either so I fed her wherever",
              "id": 204,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "I think OP has no clue about anything that has to do with parenting and yet likes to give his opinion on it a lot.",
              "id": 205,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Yeah OP clearly knows jack about breastfeeding.  Or babies. Does he understand how often babies eat? Does he understand what happens to lactating boobs when they skip a feeding at that age? (Obviously, he does not, YTA)",
              "id": 206,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "And there’s a formula shortage!!!!!!",
              "id": 207,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": ">Then there's the fact that you never yold her that it bothers you, but expected her to just magically understand that you had a problem with it.\n\nYes, this is the real crux of it for me. Like, I don't think anyone should make a big deal of it, but if it was really important to him (or if there were conservative family members/guests he was worried about), he could have politely asked her beforehand to bring a bottle. But throwing a fit once it's too late to do anything isn't productive, to say the least.\n\nEdit: YTA",
          "id": 208,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "And even if she could pump or formula feed, you don't know how painfully engorged she'd be by skipping a few feedings.",
          "id": 209,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "As my wife sits here and breast feeds our child in front of my buddy and his wife who are completely ok with it because they're not fucking psychos I just sit here and wonder what is wrong with some people. Also, GREAT point about him never having communicated that he was uncomfortable and then expecting her to mind read it lol",
          "id": 210,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "And not for nothing, it’s not like you pump once and have enough breast milk for the day. I’m currently exclusively pumping because my daughter is a preemie and is not physically strong enough to get the milk out of my breast. \n\nI pump eight times a day. Every three hours. To keep my supply up. It’s a freaking chore and a half. It would be so much easier to just pop her on my boob instead of dragging the pump around with me.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Totally. Your sister should absolutely listen to you, with your vast experience of birthing, raising and feeding a baby… what’s that, you’ve never done any of those things? Oh right! Perhaps shut up then. \n\nI’ll tell you something right now, OP - I wouldn’t have been attending a wedding two months after I had my twins. I could barely stand, let alone make myself presentable. \n\nIt doesn’t seem many people here have explained why your suggestions are so bad, so allow me. My twins couldn’t feed directly due to various issues so I pumped every 2 hours round the clock otherwise my milk supply would have been significantly affected. \n\nPumping is horrendous. Genuinely awful. Just the sound of a pump triggers awful feelings in me still and it’s been five years since I stopped. It wouldn’t have mattered if she had managed to pump enough milk for the day - although I’m curious how you expected her to do that while exclusively breastfeeding without causing an over supply? Your body makes what the baby (and a pump) takes out. Over supply means pain, discomfort, and often mastitis. Mastitis is very serious, very quickly. \n\nEven if she had a day’s worth of milk with her in bottles (which the baby may refuse, or after bottle feeding she may struggle to latch the baby again), she’d still have to pump throughout your wedding to maintain her milk supply. “Just one day” matters. \n\nYou have absolutely no concept of what you’re asking. You should be thanking her profusely for making the effort to attend and instead you’re attacking her for feeding her baby. And that’s before we even get to the ridiculous attitude towards feeding.\n\nYTA and you owe her a giant apology.",
          "id": 212,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Plus, 250 people is a *lot* of people \nI doubt anyone else even noticed.\nThis is him checking out his sisters tits and being scandalized. Grow up bro",
          "id": 213,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "And the way he was like *she keeps doing it*, as if she's only feeding the baby in front of him to upset him. Babies need to eat every couple of hours, duh.",
          "id": 214,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5662,
      "content": "Oh hell yeah, YTA! Babies that young need to eat constantly, bc they have tiny stomachs that fill and empty quickly. This is why your sister is always feeding the baby - bc the baby always needs to eat!\n\nAlso, a baby this young, who has been exclusively fed by one method (breast) cannot easily switch to another method (bottle). \n\nAlso, as your sister told you, for some folks, pumping hurts like a mofo. I personally was never able to produce much extra - just as much as my son needed. So that's a lot of pain for nothing. \n\nYou need to shut your mouth and open your mind, bc you have a LOT to learn before you have children. Give yourself a good decade. Fortunately it sounds like your wife and parents have their heads screwed on straight.\n\nEdited to add: Thank you, Reddit community, for the kind awards!",
      "id": 215,
      "comments": [
        {
          "score": 1597,
          "content": "To add to this, even if she pumped milk or gave a bottle of formula, the mother would still have to pump to relieve her breasts because they would get too full and to maintain her supply. \n\nI can’t imagine having the audacity to demand a mother not breastfeed her child to preserve some prudish sensibilities. YTA",
          "id": 216,
          "comments": [
            {
              "score": 842,
              "content": "I am certain nobody even noticed her breastfeeding. OP was probably watching her like a hawk. Waiting to jump on her the minute she whipped out a boob.",
              "id": 217,
              "comments": [
                {
                  "score": 1775,
                  "content": "I’m sure people noticed. And I’m sure their takeaway was “wow, I’m amazed a mother of a 2m old came to a wedding and stayed through the reception. That’s incredible. She must really love her brother in order to deal with a 2m old out of the house for hours”",
                  "id": 218,
                  "comments": [
                    {
                      "score": 275,
                      "content": "Oh that too. But out of 250 people how many might have noticed? 20 at most?",
                      "id": 219,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 33,
                      "content": "Me before having a kid: aww, baby's having a snack\n\nMe after having a kid: Holy fuck she's more than 10 blocks from home with a kid that young? What a champ.",
                      "id": 220,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "What an amazing sister and mother. She made it to her brother’s wedding with her fresh-out-the-womb baby, fed her baby when the child needed to bed fed AND WAS COMFORTABLE enough to do it in front of 250 other people. Likely in the front of however the seats were set up since she’s sister of the groom. \n\nI wouldn’t have gone, for one. And second, I still can’t breastfeed in public without a cover because it makes me uncomfortable. But guess who’s decision that is. the MOTHER of the young BABY who needs to eat.\n\nEdit: OP is 1000% TA",
                      "id": 221,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "And if you don't pump regularly and put it off for a day for a big event, you can get clogged ducts, massive pain, abscesses, and infections.\n\nIt's very rare but you can lose a breast or die from untreated milk-related infections. Unfortunately the US is likely to see a spike of this type of death in post-Roe states.",
              "id": 222,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "After 2 months I was still producing so much, I would have started leaking milk through my pads and bra and dress onto his precious dinner table, boy would he have been mad at me for not having more control over my body during his wedding.",
              "id": 223,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "She'd also need access to refrigeration so her milk doesn't spoil in the heat. A soft-sided beer cooler isn't going to do it.",
              "id": 224,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 144,
          "content": "I vote to give the nibling OP's nipples as a chewing toy. I think he'd change his tune right then.",
          "id": 225,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 84,
          "content": "You hit the nail on the head!\n\nFather of a two week old here. My wife is exclusively breastfeeding. If anyone says anything like OP they'd get a piece of my mind. \n\nBabies need to eat CONSTANTLY. Their stomachs start out the size of a cherry and they HAVE to gain weight fast to not be in danger of literally starving to death. \n\nMother's have to be nursed CONSTANTLY or else the milk supply reduces and then baby won't get enough to eat for 24h or so while it ramps back up. Not to mention the pain of full breasts. \n\nI've never understood people, both men and women, who are offended by breastfeeding in public. And now with a newborn it makes even less sense.",
          "id": 226,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "This. I have a 5 month old who just refuses bottles. So my only option is live breastfeeding. My other 2 kids did accept bottles at 6-8 weeks. But every baby is different. \n\nAlso, a baby that is always EBF that suddenly switches to formula might get a ton of cramps because they're not used to it. Then you'd have a screaming baby at your wedding. \n\nOh and in case it's not clear. YTA OP. A big one.",
          "id": 227,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Let's not overlook how amazing boobs are at diagnosing a babies saliva and altering the mill temperature and nutrient density to give a baby exactly what it needs in that moment!\n\nBoobs are fucking amazing.",
          "id": 228,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3885,
      "content": "Oh, bless your heart. You're really not mature enough to be dating a woman much less getting married to one. She's breastfeeding the baby because the baby is hungry. And as far as pumping, do you think she's just hauling one around in case some man can't stand breasts unless they're sexualized? \n\n&#x200B;\n\nEveryone thinks YTA because you really are.",
      "id": 229,
      "comments": [
        {
          "score": 887,
          "content": "To be fair, he got married to someone who is BARELY a woman (if this is real and not rage bait)",
          "id": 230,
          "comments": [
            {
              "score": 333,
              "content": "I honestly didn’t even look at the ages. I have to agree that this is likely a rage bait troll.",
              "id": 231,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 60,
              "content": "And yet, she's still more mature than he is.",
              "id": 232,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Serious question, what is the point of a rage bait troll post? I see this once in a while and I agree that sometimes all the anti-social check marks get checked but why? To what end? This is whats confusing me. I would just assume people this stupid live.\n\nIs there something I'm missing aside from the \"look at what I can do MoM\" toddler mentality?",
              "id": 233,
              "comments": [
                {
                  "score": 17,
                  "content": "I’m guessing the karma you’d get from it if it gets really popular. I haven’t seen any replies from OP, which would very much get downvoted to hell, so probably avoiding any negative karma.\n\nETA: Nvm, just checked out their comments, downvoted to hell. Might possibly be an actual post..?",
                  "id": 234,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 128,
          "content": "Probably why he's with someone a decade younger than he is.",
          "id": 235,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3259,
      "content": "YTA. \n\nShe’s not going to starve her baby just because you can’t fathom that breasts have another purpose other than being for your entertainment. \n\nI would imagine that your guests weren’t phased. How many of them have breastfed or had partners that did (or tried)? \n\nIf you and your wife do have kids, she may choose to breastfeed. Are you going to shame her if she needs to feed your offspring in public?  \n\nGrow up, OP.",
      "id": 236,
      "comments": [
        {
          "score": 189,
          "content": "As long as the sister wasn't sitting front row at the wedding, and decided to feed in the middle of the ceremony while it was being filmed, feeding at the reception is fine. If OP didn't want his sister to breastfeed at the wedding, the time to do it would have been beforehand.  \n\nOP: YTA",
          "id": 237,
          "comments": [
            {
              "score": 203,
              "content": "One of my closest friends breastfed during my wedding and I didn’t notice even once. And there were waaay less guests at my wedding than OP’s. Baby was fed, happy and quiet, I couldn’t have asked for more.",
              "id": 238,
              "comments": [
                {
                  "score": 12,
                  "content": "During the ceremony, don't the bride and groom have their backs to the congregation?",
                  "id": 239,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 114,
              "content": "I walked out of the ceremony at my best best friend's wedding to feed my youngest because i couldn't distract and calm him and wanted to get it under control before he completely lost it and started screaming and apparently she still ended up having to defend me to people bitching about how i handled the situation behind my back 🙄 doesn't really matter what you do.. as a new mother, someone somewhere will ALWAYS find something wrong with what you're doing... Even when it's not your first child...",
              "id": 240,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Link? \n\nAnd even so, wouldnt OP want a calm full baby at their ceremony rather than a cranky hangry baby?",
              "id": 241,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Hmm I’m going to kind of disagree. What else are you supposed to do? Babies cry until they’re fed and will cry more and more until they get food. It would be a disaster not to feed them.",
              "id": 242,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "It seriously doesn’t matter where she was when she was doing this. It needs to be normalized. Breastfeeding is not some obscene act that should be hidden.",
              "id": 243,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 148,
          "content": "He’ll probably make her wear a cover or breastfeed in the bathroom if out in public. Or more likely he won’t allow her to breastfeed bc he’ll be jealous of the baby sucking on his wife’s breast. Op is that immature.",
          "id": 244,
          "comments": [
            {
              "score": 21,
              "content": "Wouldn’t want a baby to ruin his toys.",
              "id": 245,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "Also like....who hasn't seen a breast before?? Lmao.",
          "id": 246,
          "comments": [
            {
              "score": 15,
              "content": "It's not 100% out of the realm of possibility that OP hasn't seen one before, all things considered.",
              "id": 247,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "This dude has the vibes of a guy who would be jealous of his own child that they get access to his wife’s breasts more then he does.",
          "id": 248,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "Also they are his sister's breasts. \n\nThe only way they relate to him should be in feeding his nibblings. He needs to stop thinking about them sexually, because that's just weird.",
          "id": 249,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2115,
      "content": "“She feeds her baby wherever she goes. We visit her house? She’ll feed the baby in front of us. Visiting parents? She’ll feed the baby. Going out in a public setting? She’ll sit on a bench and feed her baby. Go out to a restaurant? She feeds the baby.”\n\nThis is how ridiculous you sound. SHE’S JUST FEEDING HER BABY. \n\nYTA",
      "id": 250,
      "comments": [
        {
          "score": 1088,
          "content": "My favorite is that he is PISSED about what she does IN HER OWN HOME.\n\nHe’s absolutely sexualizing his sister’s breasts & that’s so disturbing. He is 1000% the AH.",
          "id": 251,
          "comments": [
            {
              "score": 100,
              "content": "Very disturbing indeed",
              "id": 252,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "YES!! WTH are you bothering her so god damn much with a 2 month old baby? Always coming over, or going out somewhere, like... She's in her own house. JFC I can't fathom how op is speaking out about this 😓😓😓",
              "id": 253,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 194,
          "content": "And her house, the audacity of this man has no limits.",
          "id": 254,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "I really don't understand why he just can't look at the breast feeding. Like does he look at other guys dicks when hes at the urinal too?",
          "id": 255,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 25,
          "content": "Lol right, imagine if it was just about someone eating (aka feeding themselves).\n\n* We go to my sisters house, she eats... IN FRONT OF US?!\n* When visiting our parents, she eats... IN FRONT OF THEM?!?!\n* Going out in public? Brace yourselves... she will sit on a park bench and eat... IN FRONT OF OTHER PEOPLE?!?!?!\n* and don't even get me started about restaurants!!!??\n\nOh, this example is different because you're a 34 year old dude who is afraid of a bit of boobage? Grow up lol.\n\nYTA :)",
          "id": 256,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "YTA, quit looking at your sisters breasts, focus on changing your behavior, it's creepy as hell and no one asked for your opinion. At all. In any way.\n\nAs someone who had 2 babies breastfed in the 80's through 90's, usually where ever I went, even on a bus... you get comments like this from men, just men, only men, all the damn time.  And I used a blanket in public.\n\nMen really should not be allowed to voice ANY opinion on woman's bodies in any form. They are so inept and uneducated so much in that one area.\n\nIt's been almost 40+ years, you would think something would change, but I'm at the point thinking change is almost impossible for them.\n\nEDIT: Venting here, of course, not all men, blah blah blah. However the only loud ones it seems are the ones judging every aspect of women for just being women and the others? Surprisingly never open their mouth, once, at all. Notice it's all the women calling him an AH, no one else in this story. No one he respects.",
          "id": 257,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I can’t imagine any biological reason why she might need to feed the baby that often!  She is clearly just doing it for fun and to ruin other people’s lives",
          "id": 258,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "When OP goes to other people’s houses? He eats. When he’s visiting his parents? He eats! Goes out in a public setting? That’s right, he eats! For Christ’s sake, sometimes he’ll even go out to a restaurant and..eat! The audacity.",
          "id": 259,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "As if OP wasn't also eating at all those locations! Lol",
          "id": 260,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "He has a lot to learn about babies. Like they eat more than 3 meals a day",
          "id": 261,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1323,
      "content": "YTA feeding a child is not poor etiquette. There's something wrong with you if you feel a woman breastfeeding is an affront to you. Grow up before you have a child.",
      "id": 262,
      "comments": [
        {
          "score": 248,
          "content": "He thinks boobs are only for sexual pleasure apparently",
          "id": 263,
          "comments": [
            {
              "score": 30,
              "content": "he’s mad about seeing boobs he can’t see in a sexual way (his sister’s) lmao",
              "id": 264,
              "comments": [
                {
                  "score": 21,
                  "content": "How does he think babies were fed before baby formula and baby bottles were invented?",
                  "id": 265,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "And his own SISTER'S at that",
              "id": 266,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 32,
          "content": "Yeah seriously. I’m down to feed my baby wherever/whenever she’s hungry but I still feel so anxious because of AH like OP. \n\nMy dad, bless his heart, is weird being around me while I breast feed my 3 month old (he was the same when my now 3 year old was a baby but back then I used a cover so other people wouldn’t feel weird - now I don’t care). We went to their house for dinner last night. Know what he did? Asked. Before he was entering his own living room. “Is (baby) eating? Can I.. come in?”",
          "id": 267,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}