{
  "post content": "Oh Gosh, I hope I don't turn out so wrong in this situation. \n\nMe (F) and my husband Tom have a child together (3M). Tom has another child with his ex-wife, Connor (13M). \n\nAt the time of the divorce (I only met him 3 years later) Tom had a stable job that paid well, so the judge ruled child-support for his son very high and Tom had no problem paying. He hás visits on weekends. \n\nAfter 1 year of our son, Tom was fired and found a job that paid much less than the previous one. For comparison purposes, the old salary the child support took 30% and with the current one, it takes 85%. \n\nThis created tension between us. I had to start working hard and twice as normal, because Tom couldn't help almost anything at home, as there was only 15% of his salary left after paying my stepson's child support. Even though I talked to him, he said he didn't want to downsize so as not to harm Connor and and I really tried to be understanding.\n\nThis reached my limit, when I had an accident and I was out of work for 3 months, I am self-employed and my salary has decreased by 95%. In those 3 months, we didn't go hungry because my sister helped. \n\nAnd if he was 1 day late in paying child support, Tom's ex would call him and charge him, not caring that we were tight. \n\n2 months like this, I sat down with Tom and told him that our son had the same quality of life rights as his brother, which is not happening and is harming my health (the accident was due to stress). So, it was his decision, but that I would do whatever was necessary for my son to have a good quality and it was time to realize that it is not possible to maintain this value of child support without interfering in the quality of life of his other son without I have to cover the hole.\n\n He tried to argue, but he saw my point of vira and after 1 month seeing this, the judge asked for a reduction in the value of child support ( it was proven that it was far beyond what he could pay without interfering in his life and other kid). He fixed it to 30% of his salary. \n\nSince Tom has never complained about it, it's pretty clear that I \"influenced\" himand his ex is texting me, saying that I'm knowingly lowering my stepson's quality of life and that I should feel ashamed for doing this to a child. \n\nThis is a pretty mess and it's left to me, like the \"monster\" who did this to a child. \n\nAITA?\n\nSorry for my english",
  "id": 1,
  "comments": [
    {
      "score": 7937,
      "content": "NTA\n\nThe judge never said \"you need to pay to keep up Connor's and his mother's lifestyle\", but that \"You need to pay 30% of your salary\". \n\nIf the salary changed, then the amount changed. IMO child support isn't mean to support an entire family, but to provide support to a child. \n\nAlso, how was his ex \"charging him\" for being 1 day late? There are people who are YEARS behind on child support payments still walking around!",
      "id": 2,
      "comments": [
        {
          "score": 1530,
          "content": "You would think this but a good friend of mine went thru something similar. Her hubby was laid off from his job and then rehired a month later at a lower pay (he worked by contract). Proved to the judge that his pay was about 30% less than before. Judge agreed but stated that \"between his pay and his wife's pay (my friend) they could maintain the same child support\". Which really pissed off my friend. Not that she had any problems with the kids but the youngest was in 8th grade, the other two in high school. And the ex didn't work. At all. So my friend was basically paying all of their bills while nearly all of his paycheck went to child support. And they didn't have any kids between them. Ugh!",
          "id": 3,
          "comments": [
            {
              "score": 993,
              "content": "And this is the reason why I will never date a man with kids.\n\nEdit: I don't have kids and will never have any either.",
              "id": 4,
              "comments": [
                {
                  "score": 536,
                  "content": "Same, I will never date a woman with kids either.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 154,
                      "content": "Reading all these stories makes me feel happy I'm gay, to be honest.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 66,
                      "content": "This is one reason why I will never have kids.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 350,
                  "content": "I will never date, full stop. I'm happily single and the \"Mother\" of 2 cats.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 123,
                      "content": "Me too! And a dog who is reading this over my shoulder.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Cat tax! Cat tax!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "HOW DARE YOU CALL YOURSELF THE MOTHER OF 2 CATS! That is an insult to all other mothers out there!\n\nYou are the mother of TWO MINI LION! You insult all other MINI LION mothers and fathers!",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Three cats. That's all I want. Animals.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Lots of men won't date women with cats. Maybe it's because so many are witches 🤷",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Same!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 87,
                  "content": "60F, I'm childfree by choice.  I did  briefly date a man, 55 years of age with children ages 8 and 16. Never again.",
                  "id": 15,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 35,
                  "content": "Or don’t marry until those kids are adults.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 88,
                      "content": "Doesn't always work. I married a man with a 17 year old son. That young man cost me more after he turned 18. He's lucky I love that brat.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 83,
                      "content": "That doesn't make a difference.  I just had a roommate with a 400lb+  21 year old son who literally hasn't bathed for 121 days and counting. I moved out because of the smell, he refused to tell his adult son to get a ged a job or anything else.  Or to wash. Adults suck too.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "[deleted]",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Nope, will never marry again (divorced) and even when they are adults they are still their parents' kids. So thanks but no thanks.",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Hard same. No thanks.  Love my nephews and niece but noooooooo to my own.",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Exactly! CF is the way! Too much drama otherwise.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "[removed]",
                  "id": 23,
                  "comments": [
                    {
                      "score": 26,
                      "content": "This is a bot\n\nStolen from https://www.reddit.com/r/AmItheAsshole/comments/xqvivj/aita_for_demanding_and_making_my_husband_file_a/iqbhcax?utm_medium=android_app&utm_source=share&context=3",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": -33,
                  "content": "Thank goodness! Sometimes problem people resolve themselves before they become an issue for those dads.",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -131,
                  "content": "[deleted]",
                  "id": 26,
                  "comments": [
                    {
                      "score": 78,
                      "content": "y’all learned the word misogyny and just ran with it.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 55,
                      "content": "No, he is a man who doesn't want to date a woman with kids.",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 20,
                      "content": "Dating a person with kids is not easy so it can be a preference, as long as they are hating the woman for having kids is no misogynistic.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "As a woman I completely disagree",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 258,
              "content": "oh my god, that is so unfair. How is she obligated to pay for a child that isn't hers? While the mother does not work? That judge should be suspended",
              "id": 31,
              "comments": [
                {
                  "score": 44,
                  "content": "Because “hubby” means “husband” and the judge would treat their household as a joint one. That’s what marriage is, in the eyes of the law. \n\nShe wouldn’t be liable if she divorced her husband, but while they’re married, it makes sense the judge would take her income into account.\n\nIt’s not like he’s jobless so she paid in his stead. The judge was ruling that because they have two incomes, he can afford to pay a higher percentage of his income.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 396,
                      "content": "That is untrue in most states.  They are not supposed to consider the income of the other spouse.  This is why an attorney is needed",
                      "id": 33,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 325,
                      "content": "In my state at least, my salary was never figured into my husbands child support. They only used his salary to determine it. The ex even tried to bring my salary into court, and the judge laughed at her and said that since I didn't help make the children I wasn't responsible for paying for them.",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 39,
                      "content": "Completely untrue. New spouses of the paying parents income is rarely considered. They are not a party to the child of the marriage and as such have no legal financial interest.",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 37,
                      "content": "They should divorce and marry again once the judge overrules his decision (?",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 33,
                      "content": "This is not what happens in Australia. Child support liability factors in only the biological parents. Unfortunately this gets exploited another way - a deadbeat mum or dad gets remarried to someone wealthy and doesn’t work anymore, giving the other parent $19.40 per fortnight for the child, whilst their new spouse earns 300k. There are circumstances in which that can be contested, but it’s a hard slog in court.",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "I think that should only count the wife's salary if the guy is choosing to be unemployed. Which some do (or work under the table) to get out of paying child support",
                      "id": 38,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Not true in most (if not all) states.",
                      "id": 39,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "They should divorce and marry again once the judge overrules his decision (?",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "This only happens in extreme cases where the spouse is making bank. It’s not typical.",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -2,
                  "content": ">oh my god, that is so unfair. How is she obligated to pay for a child that isn't hers? \n\nBecause the law cares about whether \"it's in the best interest of the child\" first and foremost. Which is also why so many guys have to pay for kids conceived by their partners cheating, and so many guys need to pay child support to their rapists.\n\nYep, it sucks.",
                  "id": 42,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 101,
              "content": "If a judge said and ruled like that I would immediately discuss a divorce with my partner in the interest of our financial future. We would still live together and be partners in everything but we would get rid of the excuse of the judge so that the child support payment could be reduced.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "This is why a significant number of people here choose to have their wages garnished.  It's capped at 50% of net and they aren't required to make up the difference.\n\nIt ensures they get to keep enough to live themselves.",
              "id": 44,
              "comments": [
                {
                  "score": 15,
                  "content": "In many states if you prove a garnishment is interfering with your ability to live / provide etc they even cap it at 25% of their income",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "This is wrong. Her income isn’t supposed to be part of the consideration",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "It depends on the state if the spouse's income is considered.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Yep I married a man who pays child support. We went on to have two more of our own but technically my husband and I are fully supporting not only our kids but his ex had two kids with another man and neither of them work. They live off CS, section 8, and food stamps. Our income is too high to qualify for any of those because they don’t deduct child support from gross income in my state.I honestly don’t mind working or the fact he’s paying child support but it sucks when the ex makes zero effort and constantly demands more. I have kids and a full time job so it’s not hard. We tried to get a reduction when he got laid off during Covid but because I was still working my regular hours they concluded he could still pay the same amount so needless to say, I was paying a portion of his CS for a few months until he got a job and back on his feet. What makes all of this the worst is she has not allowed us to see the child in almost a year and we’re currently trying to save for a good lawyer which will be well over $5000 at the end of it. She was really sweet and let me watch my stepson all the time when my husband and I were in our dating phase but once we got married she did a complete 180.",
              "id": 48,
              "comments": [
                {
                  "score": 7,
                  "content": "Yep. This guy was/is a great dad. Always paid on time, always saw the kids on his time and even wanted more time with them. And ex did everything in her power to cause problems. \n\nThe money/child support thing was just so frustrating. I don't know the exact numbers (so don't focus on the specifics) but it was something like he went from $6k month to $4k. Child support was like $2400. So after the pay cut he had about $1k or so leftover for all his expenses. But because CS was still LESS THAN his pay it was determined he didn't warrant a reduction. Now whether the judge officially took his wife's income into account in that decision... not sure. Maybe this is a state thing. But the end result was had he not been married and wife have a house, he'd be in serious trouble.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "This couldn’t have been in the states. You can’t go after a new spouse for child support for a kid that isn’t theirs",
              "id": 50,
              "comments": [
                {
                  "score": 0,
                  "content": "Depends on the state. In my state the new spouses income is regularly considered as household income",
                  "id": 51,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I'm torn on this. On the obvious surface, a stepparent shouldn't shoulder any financial burden for a child they didn't create or adopt. But looking deeper, spousal income *is* typically household income. It is often vitally important that it is considered as such in cases of stay at home parents, creative professionals with highly variable incomes, disabled individuals with caregiver partners, etc. I'm not sure I'm comfortable granting an exception for prior existing children. Minor children are not a debt incurred prior to the marriage, they are an ongoing liability like a mortgage. If your new wife gets demoted and now her entire paycheck is going to the mortgage of the house that's solely in her name, you will have to pick up the slack on the rest of the bills. It isn't a perfect analogy.\n\nBoth my parents got legally fucked over in their divorce because of shit like this. My dad was very involved and wanted half custody but he had to quit his wellpaying job to have enough time to raise us. He went flat broke paying my mom child support that was based on former income rather than actual current earnings. It took years and by the time they got it recalculated, he married my stepmom. Well she basically made as much as he used to so my dad's household became wealthy, but he no longer had to support my mom's household to the same degree. She had a teaching degree ffs. She then struggled because she got the house in the divorce and couldn't afford it without help (part of the reason for the high payments in the first place). Once his household income increased via my stepmom, my dad paid my mom more than ordered. It was less than before, but enough to compensate her teaching salray and cover the high property expenses. \n\nI'm lucky my parents got there in the end. One of my friends had a mom who remarried rich but never worked and a dad who had to live in a van because the mom took so much of his paycheck even though she didn't need it. My friend said her mom called her dad's checks her \"manicure money\"...",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Let me guess. Judge said that there hadn’t been a material change in circumstance in your friend’s husband’s life and wouldn’t recalculate support. Am I close?\n\nEdit to add, because of all the replies, if this ever happens to you or someone you know in IV-D court, where a lot of child support cases happen, file a de novo appeal immediately. In Texas anyway, it must be filed within three days of the judge signing the order.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "This is weird because a non custodial spouse with no tie to the child aside from marrying the parent is NOT legally supposed to be considered in the formula for child support. I’m a lawyer and am surprised that your friend’s lawyer wouldn’t appeal or fight a judgment like this. (If you’re in the us at least)",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 209,
          "content": "The judge also never said \"You need to keep up Connor's lifestyle even if that means you're on food stamps or borrowing from others to eat.\"  That would be insane and Connor'smom is WAY out of line for expecting that.\n\nOP,  u/TAJustAITA remind your husband that if you were divorced he'd have to have the support reallocated anyway. Not as a threat (unless you want it to be), but to remind him that undr the law he has a legal obligation to care for both kids.",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "Also adding, the ex is only thinking of herself. OP, just tell her your kid and all of you were suffering before - now it’s evenly balanced. She can’t fault you for not wanting to hurt either kid, and making it fair. But that means her kids support had to go down to make it fair.\n\nNta",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "My dad has never paid child support for me and my three brothers. It's been approximately 20 years since my parents divorced. He owes over $250k in back child support. He just left the US, went back to his home country (Wales) and started a new family. Dickbag.",
          "id": 57,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 21,
          "content": "Child support enforcement is a complete mess in my area. There's really no rhyme or reason. I've known guys that do get charged being only one day late. I've known women that haven't seen a penny in over a decade and can't even get anyone in the child support division to return their calls. It's just very confusing why the laws aren't applied the same in every case.",
          "id": 58,
          "comments": [
            {
              "score": 8,
              "content": "I’ve heard that if the state is funding the child in any way (food stamps, HUD, TANF, Medicaid) they are like bulldogs in going after deadbeat parents.  Jail, suspended license, tax forfeiture, etc.\n\nBut if the kid isn’t in the welfare system it’s 100% on the custodial parent to go after child support, the state doesn’t really care since it’s not their money they’re trying to recoup.  That’s how people have grown kids and still owe 100k and nothing is done.",
              "id": 59,
              "comments": [
                {
                  "score": 11,
                  "content": "This. I've heard the best way to make the state go after a deadbeat is to apply for some sort of assistance. Most single parents qualify for SOMETHING. The way they suddenly find the deadbeat parent after years is downright magical. My roommate in college applied for something and despite being over 18 and living on campus, she put her permanent address as her mom's house. Somehow that was enough for the state to see the arrears and track down her deadbeat dad 15 years after he ditched her mom. Her dad (and other ghost family) magically appeared and tried to pay her off to get her to rescind her application it was super fucked up.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Seriously! My friend (she’s older; kids are all adults now) was telling me tonight her ex owes her over $80k in back child support but because they’re adults he doesn’t have to pay as much per month so she gets seven freakin dollars a month from him. Fuck you money if you will. Absolutely wild.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "i (F) have to pay child support to my ex.  at the time, the court order was far above what the state mandates indicated i was supposed to pay, and for a very long time that order was taking anywhere from 50%-70% of my disposable income.  i literally could not support myself after what they took.\n\nOP's NTA.  she didn't do anything \"to a child\".  she's ensuring that her family is protected.  if OP's husband's ex wants a better quality of life for her son, she can get off her ass and start making more money.",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Further to this, you could pull the reverse Uno card on the ex saying \"I'm knowingly lowering my stepson's quality of life and that I should feel ashamed for doing this to a child.\" - Ex's demands were massively lowering the quality of life of a child - just not HER child!",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This. Charging him for 1 day late is ridiculous, if it was months late i would understand since it could be serious but 1 day late is being petty.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Child support is to give that child the similar lifestyle if the parents had never divorced.  In this case, if Dad lost his job and had to take a job that paid less, their lifestyle would change based on the new budget.  Judge did the right thing.  However, if Dad gets a better job, one would hope the support payments increase.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1653,
      "content": "NTA. If bio mom and your husband were still married,  the stepson's quality of like would have been diminished years ago.   This is how life works.  You shouldn't starve one child to keep the other in Gucci.",
      "id": 66,
      "comments": [
        {
          "score": 59,
          "content": "This was what I was wondering too. How is it equitable for a child to live better off of child support than he otherwise would if his parents never divorced? Wouldn’t that just create a perverse incentive for people to divorce other people at the height of their careers so that they get stuck paying x amount?",
          "id": 67,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1275,
      "content": "NTA.  A lot of people might not agree with me, but a percentage of salary is fairer than a fixed amount that doesn't take into account a salary reduction.  Also, he has two children - why should the one he lives with live in poverty whilst the other has a nice life?   He should care about this.  \n\nHe is letting you be the bad guy so he doesn't have to be.  Sounds like it would antagonise his ex more, so it's better for him if she thinks you are the bad guy.  Well, I don't think you are.",
      "id": 68,
      "comments": [
        {
          "score": 396,
          "content": "The reason it's often a set amount rather than a percentage is because The System is aware of a lot of non-custodial parents who end up working significantly under the table to avoid paying child support. Not agreeing/disagreeing, just saying that's why, even if it appears unfair.",
          "id": 69,
          "comments": [
            {
              "score": 180,
              "content": "Yep. My dad is currently doing this right now on purpose to screw my mom over. It’s horrible.",
              "id": 70,
              "comments": [
                {
                  "score": 57,
                  "content": "Is he proud of himself for \"gaming the system\" and surprised you aren't so impressed?",
                  "id": 71,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "And I bet that he claims that your mom is doing parental alienation? That word gets trown out so easily by deadbeath dads!",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 97,
              "content": "Yep, willful un/under-employment. Courts will often go by your “earning potential”. Now, of course, you can always go back in and prove that you’ve looked for similar employment/pay rate and have been unable to secure any. Most judges can tell if someone is being earnest with their attempts to provide all they can, and they will adjust the support amount accordingly.\n\nEdit: a word",
              "id": 73,
              "comments": [
                {
                  "score": 22,
                  "content": "Even the earning potential is ridiculous. My friend is a farmer. All the money goes back into the farm to keep it running and not into an actual paycheck. The judge ruled on earning potential -literally said if you had a job other than farming you could be making $30/hr so that is how he calculated it. This is an area where even $20/hr would be considered the top earning job (small rural area). He hasn't been able to get it readjusted because the earning potential will never change",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Yeah, if I was a judge, I’d be suspicious of why he can’t get a job of roughly the same one he was fired from\n\nA 50% drop looks shady, like he’s trying to pay less on purpose. And I’d agree. How on earth DID he end up with such a huge cut?",
                  "id": 75,
                  "comments": [
                    {
                      "score": 13,
                      "content": "This is actually not that hard to see.  If I were to loose my job today, I would end up taking ~42% drop in pay doing what I do.  I’ve been with my current employer over 10 years and have received many classification increase (pay based off classification level-CL).  At a new company I would essentially be starting at the bottom again and have to work my way up.  I lived this nightmare during the crash of ‘08 and was luckily able to not get laid off in 2020/21.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "COVID fucked with people's careers **hard**.  I had a nearly 33% drop over that time due to layoffs and difficulties finding positions due to the impacts of job instability.  I'm just now approaching my pre-COVID income, and thanks to inflation that still means I'm significantly behind.  It turns out blowing up the economy due to unjustified hysteria has major negative impacts.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "OP says he was fired which might make it hard to find another job, especially if his job isn’t common.  In this case he has another job and he didn’t seem concerned about the payments even though it was affecting his current family so either he was cutting off his own nose to spite his face, or he just couldn’t get a job with the same salary. It doesn’t sound like he was trying to avoid paying from the way OP writes about him",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "My dad did this too... once I turned 18 ( I'm the oldest and I was the only child living with my dad but he was paying $1200 a month at $400 per kid) he quit his union boilermakers job and started working under the table and had his support reduced to $400 a month. My mom lost the house, the van, the kids sports everything and she had to pick up an extra job, she worked as receptionist in pediatricians office. It was hell... and funnily enough my mom and sisters blamed me, go figure...",
              "id": 79,
              "comments": [
                {
                  "score": 2,
                  "content": "I'm so sorry, hon 😔",
                  "id": 80,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I was too... it's hard watching your family, especially your siblings struggle knowing you can't do anything about it.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "So?  \"The System\" is also aware of all kinds of welfare fraud of all kinds and yet when people advocate for changing those systems accordingly people melt down and call it cruel.",
              "id": 82,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "True.  A lot of parents game the system by getting paid under the table.",
              "id": 83,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 49,
          "content": "I don't know. 30% of an income for someone who lives paycheck to paycheck makes it incredibly hard to make ends meet, 30% of someone who makes $500.000 a year is significantly less hard. I would go with something along the lines of a certain percentage of income above the poverty line or something.",
          "id": 84,
          "comments": [
            {
              "score": 22,
              "content": "Have to agree. Low income housing is set at 40 percent of a poor (but working) person's income. Add 30 percent on to that, they are literally only left with 30 percent for themselves to live on. Then of course, 20 percent is taken out for taxes... so literally they are left with 10 percent to try and feed themselves",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Often it’s set by combining the two parents’ incomes and then looking at that compared to custody, etc. If you have a rich ex, agreed: you shouldn’t be paying 30% of poverty wages. If your ex is as poor as you, however, you are just going to have to make that 30% work. Taking care of your kid is your top priority as a parent. You can’t let your kid go hungry because the child support is too high.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "So, the custodial parent need to support the child regardless of the financial situation, while the other parent only if they can comfortably afford it?",
              "id": 87,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "[removed]",
          "id": 88,
          "comments": [
            {
              "score": 0,
              "content": "[removed]",
              "id": 89,
              "comments": [
                {
                  "score": 13,
                  "content": "Bot\n\nStolen from  https://www.reddit.com/r/AmItheAsshole/comments/xqvivj/aita_for_demanding_and_making_my_husband_file_a/iqbi15b?utm_medium=android_app&utm_source=share&context=3",
                  "id": 90,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "Id go even further and say there should be a max limit on child support. Its meant to support the child and not a whole family.",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I do payroll, and typically we’re not allowed to take more than 50% of the net wages. So if someone can usually pay 100 in child support is now making $150, we’re usually (although this varies by court order) not allowed to take more than $75.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "This is the comment OP needs to read, you said it perfectly.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 584,
      "content": "Financial realities are financial realities. NTA.",
      "id": 94,
      "comments": [
        {
          "score": 201,
          "content": "Yup. Plus, he's equally responsible for supporting both children, and there's no way he can do that if 85% of his pay check is going towards CS for just one of them.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Right?! If he had gotten the lower paying job while still with the ex, Conner's standard of living still would have gone down. Circumstances change! NTA",
          "id": 96,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 460,
      "content": "NTA - the child support system is designed that way for a reason, 85% of his salary is absolutley nuts. Im in Australia, our system rolls over automatically at the end of each financial year to adjust payments based on both parents' incomes which is fair (you can ask for an adjustment at any time too if you provide proof of income change)\n\nyou are not lowering your stepson's quality of life, you are ensuring there is a quality of life for his dad and his family",
      "id": 97,
      "comments": [
        {
          "score": 50,
          "content": "Our system is just as broken though. It would work better (but not perfectly) if everyone did exactly the right thing, but that obviously isn't what happens. It's a mess.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Our system is good, but it definitely requires people to do the right thing though too. I'm also in Australia and my good friend (who also happens to be the mother of two of my nieces) receives almost nothing in child support from her ex (my BIL). He pays sporadically and has reported that he has no job or income and hasn't done tax returns (apparently) for a couple of years now to avoid having to pay for the girls... The law will catch up with him eventually, in the meantime she has to do it alone essentially!",
          "id": 99,
          "comments": [
            {
              "score": 2,
              "content": "It would be so nice if people just paid their child support and, oh I don’t know, actually cared about the well being of a child they created. Instead of just avoid the law and paying money the rightfully owe.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 303,
      "content": "NTA - your husband can’t pay what he doesn’t have. This is the exact reason why courts allow for revisions. You did this to survive. Block the ex. There’s no reason for you to communicate with her.",
      "id": 101,
      "comments": [
        {
          "score": 4,
          "content": "[deleted]",
          "id": 102,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 167,
      "content": ">Oh Gosh, I hope I don't turn out so wrong in this situation.\n\nnope, not all, allow your fear to go poof.\n\nas soon as your husband lost his job, he should have kept the court updated. so, everything could be documented and accounted for. the adjustment would have been made sooner and your accident may not have even happened. this is coming from someone who's sperm donor rarely ever paid and always complained to the judge about payments. at one point he was only ordered to pay $10 a month. like that was seriously going to help. point is, it's based off your current income, as his job changed and his income lower, he should have notified the court so it could be adjusted accordingly. they want you to be able to survive and take care of your household on top of paying child support. \n\nyou're not a monster, it was only right since his income had changed. the previous amount was based on a higher income.\n\nNTA",
      "id": 103,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 153,
      "content": "NTA. He's still valiantly paying best he can. He has another child to think of as well. You're asking for survival purposes, not bc you don't like the kid or need a new Gucci bag.",
      "id": 104,
      "comments": [
        {
          "score": 6,
          "content": "[removed]",
          "id": 105,
          "comments": [
            {
              "score": 7,
              "content": "Also, having additional children reduces your CS payments, as it should.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 128,
      "content": "NTA. Your husband needs to grow a pair and stand up for you.",
      "id": 107,
      "comments": [
        {
          "score": 58,
          "content": "And his younger child, too!",
          "id": 108,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 108,
      "content": "NTA.  And it should have been done years ago.",
      "id": 109,
      "comments": [
        {
          "score": 21,
          "content": "Agreed, but doing it now is the second best solution.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}