{
  "post content": "I (29F) am pregnant with my first child, a girl, and I’m 7 months along. My husband and I have been arguing about the baby’s name ever since we found out we were having a girl and the fights have just become more intense. \n\nHe wants to name our daughter “Sabrina” (not the real name, but it’s similar in terms of how it’s a less common but not super unique name) after his dad’s late mom, who he was close to. I absolutely refuse. \n\nI have two reasons, the first of which is that in my family, the eldest daughter is always named after the mother’s mother. I have my grandma’s name and I want my daughter to be named after my own mother. Second, my former best friend is named “Sabrina”. Our friendship ended on pretty bad terms and I don’t want to be reminded of her every time I use my daughter’s name. \n\nHusband thinks the tradition is silly and that his desire to honor his grandma’s memory is more important than my hangup about my former friend. I said that maybe so, but my mom’s name trumps his grandma’s name in terms of importance. He also refused my offer of making “Sabrina” her middle name, and neither of us like the name’s nickname. \n\nLast night I got really angry and told him I wasn’t going to talk about it anymore, that I was naming the baby what I wanted because I’m the one who’s going to be giving birth to her and he could just suck it up. He got upset and said that he was her parent too and it wasn’t fair for me to run roughshod over him. I said I wasn’t running roughshod, but I was shutting down a conversation that had dragged on for too long. Now I’m worried that I did overstep. AITA for taking the reins on my kid’s name?\n\nEdit: Hey all. I’ve been reading all of your posts and I sat down again with my husband a couple hours after posting and tried to have another conversation about this. I apologized for my anger at him the night before, but that I felt very deeply that this tradition was important to me. We talked about the fact that he knew my family has this tradition before we got married, but he says that I never made it clear that I wanted to follow it before I got pregnant. I was certain we had talked about it, and had even brought it up w/ my mom w/ him present when we were first talking about kids. He said he didn’t remember, so I said let’s call my mom and see if she remembers that conversation and he really didn’t want to do that. \n\nVery, very long story short, it didn’t stay civil for long after that and he said he was sick of fighting about everything with me and he ended up leaving to stay at his brother’s house. Right now we’re not sure where we stand with each other, but I think time apart is what we both need at this point.",
  "id": 1,
  "comments": [
    {
      "score": 363,
      "content": "ESH. This will NOT be the last time you disagree on how to handle parenting. If both of you have family traditions that you want to honour, figure out a way to honour them both or don't honour either.",
      "id": 2,
      "comments": [
        {
          "score": 67,
          "content": "Two yeses, one no seems to be a good rule for naming kids.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 198,
      "content": "ESH. You don’t get dibs just because you’re giving birth, and he doesn’t get dibs because he feels like it. In general, I’d say if either party objects to a name, you strike it from the list. There are plenty of names out there, surely there’s one you both like. I understand the tradition aspect, but it doesn’t seem like that’s going to work out. What I will say is that going into parenting gridlocked over this doesn’t bode well for any of you.",
      "id": 4,
      "comments": [
        {
          "score": 19,
          "content": "\"Just because you're giving birth\"....................................................",
          "id": 5,
          "comments": [
            {
              "score": 85,
              "content": "I mean I definitely agree giving birth is extremely physically taxing on a woman but if they’re planning to be equal parents they should have equal say in the name. \n\nESH because they’re both acting childish. They shouldn’t use the name Sabrina or OP’s naming tradition - at this point they should pick a new name.",
              "id": 6,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 156,
      "content": "ESH -\n\nBoth parents get to veto names they are unwilling to accept.  So you can veto Sabrina.  And if he wants to be a retaliatory dick, or if he just doesn’t like it, he can veto your mom’s name. \n\nThen you can find a different name that you both agree on, but neither of you has the right to choose a name the other one finds unacceptable because the kid belongs to both of you",
      "id": 7,
      "comments": [
        {
          "score": 21,
          "content": "But if the husband wants to reject the tradition purely out of spite why should op even care? Like obviously yes that’s not a healthy dynamic but if this family tradition is important to her and it’s being rejected literally only because she wants to do it why should the husband have that power",
          "id": 8,
          "comments": [
            {
              "score": 59,
              "content": "Because when you get into the question of “whose reasons are good enough and whose reasons aren’t,” things get sticky incredibly fast.  \n\nHe doesn’t get to decide that her reason isn’t good enough, and she doesn’t get to decide that his reason isn’t good enough. Both parents get a veto.  \n\nShe can and should sit down with him in a calmer moment, and have a heart to heart with him about why this tradition is important, and what it means to her.  And if he’s genuinely that much of an asshole that he would still veto her choice purely out of spite, then maybe what she really needs is a divorce, at which point she is free to give zero fucks about his opinion on the matter",
              "id": 9,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Maybe he really doesn't like the name. Just like the OP has a bad association with the name he wants he may have a bad association or just not like the sound of the name. It isn't necessarily spite at all.\n\nMy husband really wanted to name our daughter after his grandmother, whom I really liked and I liked the idea of naming a baby after her but I didn't like her name. We compromised by using a different version of the name. It's still not a name I ever thought I would name a baby and not a name I would have chosen on my own but I could agree to it.",
              "id": 10,
              "comments": [
                {
                  "score": -1,
                  "content": "I mean it’s possible but it seems like if that were the case it would be mentioned in the post, and while I agree that each parent should be able to veto a name they don’t like, I personally wouldn’t even want to waste time trying to compromise with someone who used said veto just to upset me",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I agree.\n\n(1) Wife doesn’t like husband’s GM’s name because it’s the same name as her former best friend - so she has a negative association with that name (and not in a small way). \n\n(2) OP’s husband rejected MiL’s name because he wants to use his GM’s name.  Unless OP states it in another post, the husband doesn’t have a problem with MIL’s name itself.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 90,
      "content": "[deleted]",
      "id": 13,
      "comments": [
        {
          "score": 37,
          "content": "I would resent a naming tradition being dumped on me. I would resent being told what I had to name my baby just because they chose naming rules that I never agreed to use. I would absolutely refuse to follow a rule dumped on me. A couple gets to choose their own names using their own rules and it seems immature to me to try to force a name your spouse doesn't like just because it's your family's rule. You need to leave your family out of it. You and your husband are a couple and need to name your baby a name you both like. Leave your family and their rules out of it. You chose to marry your husband. The two of you need to work this out without interference from families and inherited naming rules are interference.",
          "id": 14,
          "comments": [
            {
              "score": 16,
              "content": "This is why I hate naming babies after family members. Someone is always upset. My dad actually does not have a middle name because my nana - his mother - didn’t want to upset anyone with the name they choice. \n\nI’ll likely give my kids totally separate names from anyone in the family.",
              "id": 15,
              "comments": [
                {
                  "score": 1,
                  "content": "Exactly! Especially when it comes to first names people get bent out of shape when one relative is picked over another. My sister and I both have familial middle names, mine for my great grandmother (passed away years before my birth) and my sisters middle name is the feminine version of our dad’s name.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Two of my kids have family names as middle names; my oldest son has husband's name, daughter has my grandmother. Everyone gets a unique first name, and no more family names are being used. My mom didn't like the name we picked for our second son, we named him it anyway, she got over it. Other people can suck it.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I think family names should be used as middle names. I agree - unique first names are best, unless two parents really agree on naming a baby after someone.\n\nI'm the only person in my family who doesn't have a first or middle name named after someone lol.",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 45,
      "content": "ESH. Two parents. Two people decide. No one trumps the other. You have to both give and come to an agreement. \n\nGoing with your tradition and using the grandma name for the middle name makes the most sense. And your husband could even call her by the middle name if he wished. This is the obvious compromise, so you both suck for refusing to work this out.",
      "id": 19,
      "comments": [
        {
          "score": 23,
          "content": "> Two parents. Two people decide. No one trumps the other. You have to both give and come to an agreement.\n\nYuuup. This is exactly why I think that naming traditions are a horrible idea.",
          "id": 20,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": ">Going with your tradition and using the grandma name for the middle name makes the most sense. And your husband could even call her by the middle name if he wished. \n\nThat's exactly what she suggested but he declined.  How does *she* suck?",
          "id": 21,
          "comments": [
            {
              "score": 21,
              "content": "I’m with OP but I think she does kinda suck for saying she’s going to name the child whatever she wants as she’s the one giving birth. I’m sure it was said in the heat of anger but it’s still not great.",
              "id": 22,
              "comments": [
                {
                  "score": 2,
                  "content": "I agree that was a huge overstep, but I have a feeling the discussion isn't over and that was just an angry outburst.\n\nI think OP was pretty reasonable and attempted to meet him halfway by giving her the middle name that he wants.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yeah I agree... I feel like the husband is really much more unreasonable anyway- the name has negative connotations for OP and shouldn’t even be on the table. She’s pretty generous for trying to compromise by offering to use it as a middle name despite her not liking it for a good reason.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "[deleted]",
          "id": 25,
          "comments": [
            {
              "score": 3,
              "content": "You are wrong, dad wants his grandma’s name and OP wants her mom’s name.",
              "id": 26,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 35,
      "content": "ESH\n\nSabrina and your grandma's name are off the list, keep looking.",
      "id": 27,
      "comments": [
        {
          "score": 5,
          "content": "This. As soon as someone says no you move on and keep looking.",
          "id": 28,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 23,
      "content": "I actually think YTA, you both have family traditions, one doesn’t trump the other. It’s valid for you not to want to name your kid after someone you have bad associations with but you don’t get to unilaterally make a decision like this. You are both parents and you both get a say. I don’t have real advice for you on how to work this out but I don’t think it’s fair for you to just make a decision.",
      "id": 29,
      "comments": [
        {
          "score": 5,
          "content": "I think more ESH, right? By your verdict the husband has no blame and should get to name it Sabrina with the wife’s opinion not mattering. That’s not right either though. I personally think both names shouldn’t be used and they need to find a new one together",
          "id": 30,
          "comments": [
            {
              "score": 2,
              "content": "I guess yeah, they certainly both suck for thinking that one naming tradition trumps the other. I was reacting mostly to OP shutting down all future discussion and saying that since she’s carrying the baby she gets the final say. That’s bullshit. But the husband is absolutely not blameless here at all.\nAnother poster suggested they start from scratch which seems like the best bet here. No one gets to use a family name and they have to start over suggesting names and agree on something.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 21,
      "content": "ESH This is his child too. You have no right to decide this without his input.\n\n>the eldest daughter is always named after the mother’s mother\n\nIn my culture, this is like wishing death in the mom's mom. You do not name a baby after a living person. Ever. It just isn't done.\n\n>my mom’s name trumps his grandma’s name in terms of importance\n\nWtf??? That's just cruel. How did you come to this conclusion?",
      "id": 32,
      "comments": [
        {
          "score": 3,
          "content": "Your second point is irrelevant, clearly that’s not their culture.",
          "id": 33,
          "comments": [
            {
              "score": 3,
              "content": "Exactly. My point is that one person's deeply held tradition is another person's irrelevant fact. At the end of the day, a happy marriage should be more important that tradition to OP and her husband.",
              "id": 34,
              "comments": [
                {
                  "score": 2,
                  "content": "Ah I’m sorry, I misunderstood the point you were making. I wholeheartedly agree with your argument",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 20,
      "content": " Last night I got really angry and told him I wasn’t going to talk about it anymore, that I was naming the baby what I wanted because I’m the one who’s going to be giving birth to her and he could just suck it up.   \n\n\nYep YTA. Disagreeing about names is common. but Cmon.. you just told him that his grandmother who he was close to is less important than your mother.. you literally said that.. and then tell him his opinion doesnt matter you're naming her what YOU want and he can deal with it.. Yep.. Definitely you TA",
      "id": 36,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 16,
      "content": "ESH. You should both love your baby's name. His mom's name should have been taken off the table months ago, and so should your mom's name. If the other parent doesn't like it, it can't be a viable option. Is this really how either of you want to name your baby? By browbeating the other into submission?\n\nFWIW, I say this as a woman whose husband hates all of my favorite baby names, including my grandmother's name. We picked new ones together that we both love.",
      "id": 37,
      "comments": [
        {
          "score": 1,
          "content": ">I say this as a woman whose husband hates all of my favorite baby names\n\nSame, except only the girl names. I wanted to name our daughter Eleanor, and he haaaaaaated it. So her name is totally not Eleanor.",
          "id": 38,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}