{
  "post content": "My girlfriend (22F) and I (26M) have been together for almost 4 years and live together. \nShe has a stable career and has bought herself a car and was taught to drive in high school. \n\nI was never taught to drive, and it’s not really necessary because I can uber, take the bus, or my girlfriend can drive. She’s offered before to teach me to drive, but I decline because I’m not really interested in learning because I don’t plan on getting a car since they’re a lot of money. \n\nSo, my birthday was yesterday and my girlfriend was really excited to give me my gift. It was private driving lessons, which admittedly cost her several hundred dollars. I was really offended because I don’t want to learn to drive. She hyped the gift up like I’d love it, but I honestly hate it. It seems more like it’s for her because she wants me to learn to drive, than it is for me. \n\nI got really upset and disappointed when I opened it and she kept pushing to ask why I didn’t like it. I told her again that I don’t care for driving and it seemed like a really impersonal gift, because I don’t even want my license or a car so why would I want this? I felt like she doesn’t even know me. And she got really upset so I suggested she return the lessons and get me something I would like better. \n\nNow she’s calling me an AH and said the lessons are non-refundable, and is really upset with me. I don’t think I’m the AH because I’ve told her before that I don’t want to drive and I feel like she’s trying to change me. So now she’s being immature and won’t drive me anywhere and tells me I can uber if I want to go somewhere, even if it’s somewhere she was going to go already. Like she went thrifting and to the grocery store without me (we always go together) and said if I really wanted to go that badly, I can uber. \n\nIt’s not even like I ask her for rides ever, I just tag along if she’s already going somewhere. I get uber’s to and from work and have a good job. So it’s pointless for me to even get a car or license. \n\nWhen I told her that she said that she’s tired of always being the driver and likes to be the passenger sometimes, but to me it sounds like she gave me a gift that *she* wants. Because if she hates being the driver so much, I suggested that I could get lessons for *her* birthday, not mine, and that upset her even more. She said that isn’t a gift for her and she’d be upset if I got myself driving lessons for her birthday. I told her basically “see, so you’d be upset if I got you something that you think is for me for YOUR birthday” and she said yes. So even though I explained to her there’s a double standard, she’s still insisting that I’m the AH.",
  "id": 1,
  "comments": [
    {
      "score": 33586,
      "content": "YTA. Read between the lines dude, she’s tired of driving you around everywhere. It’s one thing to be unable to drive, it’s a whole other thing to just refuse to drive, what’s going to happen if there’s an emergency?",
      "id": 2,
      "comments": [
        {
          "score": 26522,
          "content": "But mommy I don't wanna drive. I can just mooch off other ppl who acquired this basic fucking skill as teenagers",
          "id": 3,
          "comments": [
            {
              "score": 4594,
              "content": "Best comment. This sums it up perfectly.",
              "id": 4,
              "comments": [
                {
                  "score": 2648,
                  "content": "But maybe there is a reason why he is uncomfortable driving. I do not drive because I am wired wrong. I have University degrees, complex jobs, can travel to foreign places without getting lost, but I can't drive. My SO of many years gets very upset when people suggest I should learn because he knows there will be bodies! And destroyed cars.\n\nPS he always tell people when they want to know why I don't drive, the intersection story. Driver is on left side and he asked me if there was any traffic coming on the right. I asked if he meant my left because his right is my left not right. He made me swear I would never drive after that conversation. Oh, and I don't see pedestrians, animals. Birds but not people.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3485,
                      "content": "Well you have a very good reason to not drive, but OP didn’t state anything else beside “I don’t want to because I have other people to do it for me”",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1467,
                      "content": "The difference is that your partner is ok with you not driving and you have an incredibly understandable reason. I didn't get my license until I was 25 because of how bad my anxiety was. I understand why some people don't have a license. But she literally paid for him to get lessons and he just doesn't want to do it. Uber adds up. Him learning to drive could save him money in the long term.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 422,
                      "content": "Fair, but what does this have to do with OP's situation?\n\nOP's reasoning:\n\n>I was never taught to drive, and it’s not really necessary because I can uber, take the bus, or my girlfriend can drive. She’s offered before to teach me to drive, but I decline because I’m not really interested in learning because I don’t plan on getting a car since they’re a lot of money\n\nImagine an OP posted that they didn't feel like doing the dishes so their girlfriend always did them and now their girlfriend was annoyed. Then a commenter responds \"I broke my legs and an in a  wheelchair and our apartment isn't handicap accessible, so I can't do the dishes and my girlfriend does them.\" That's an understandable reason, but given it has nothing to do with the reason the OP isn't doing the dishes, it's not helpful advice to the OP.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 298,
                      "content": "If he had a good reason he would have mentioned it alongside the mental gymnastics he’s performing to justify his laziness.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 286,
                      "content": "Then he can offer to get an Uber when they get out so she doesn’t have to carry the weight of always being the driver. Out to eat? Guess who has to watch what they drink. Add to the cost of just having and maintaining a car and it would be annoying.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 135,
                      "content": "From your answer it seems like you *don't* drive, but you *can* (meaning you know how) so if there was ever an emergency and your partner couldn't drive, you would be able to. \n\nIt's one thing to be uncomfortable/have anxiety about driving but it's a whole other thing to refuse to even learn. It's a basic life skill that OP should have.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 78,
                      "content": "There is a difference in do not \nAnd can not",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 62,
                      "content": "Op didn't lead us to believe in any way that he has a reason to not drive besides just not wanting to. He even states the reason is because he just doesn't seem it necessary.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "Please reply to this question;\n\nWhat does that mean? His left is not your left? If you're both sitting in the same car your left is absolutely his left. I'm so incredibly confused.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "I didn't get one until I was about 19. Hated driving. I could never articulate why I was so scared of it beyond \"the cars coming at me\".\n\nChanced into an optometrist office and turned out to have terrible distance vision and depth perception. I now drive... with glasses.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I mean .. How.. even if he's an ass for not driving or leaving the driving up to her, giving driving lessons for a birthday when the other person has said they're not interested is a petty move at best..\n if the sexes were reversed and he bought her cooking classes because he doesn't like having to cook all the time for her birthday, how would she feel.. What would your judgment be.\n  If she has an issue with him not driving, it's something she needs to discuss with him like an adult \"hey, I know you don't wanna drive, but I really can't be driving us everywhere all the time.\"  Not giving an unwanted passive aggressive gift on his birthday. NTA Specifically for not appreciating a passive aggressive gift. But honestly I think the relationship is doomed on both sides.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 619,
              "content": "I didn't learn to drive until I was 30. I just didn't need to. Public transit is good here. Importantly I never asked anyone for a ride anywhere. I took transit, rode a bicycle, or (for rare edge cases) arranged private hired transportation. If someone offered a ride I'd take it, but made a point to never obligate anyone and never accept a ride if they'd have to travel far out of the way to get me and drop me off.\n\nIt wasn't until I met my current wife who had to drive to the mountains for events with her family a few times a year that I felt I had to share that responsibility. \n\nUntil then I maintain it was not selfish or somehow immature not to know how to do something I didn't need to do.\n\nNot saying OP isn't TA, just contesting the idea that everyone has an obligation to learn.",
              "id": 17,
              "comments": [
                {
                  "score": 288,
                  "content": "IMO *everyone* who has the ability should learn to drive for safety purposes. You don't need to own a car, but you should know how to operate one.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 462,
                      "content": "Everyone should know how to do CPR but I don't think people who don't are immature assholes.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "What safety purposes? Genuinely curious, because I live in the city and I’ve never had a need to drive yet.",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 196,
                  "content": "I agree, and that is coming from someone who has a driver's license. It isn't necessary or even desirable for everyone. Right now I can too get done most using stuff like the bicycle or public transport, though it is nice to have the car as a back up.\n\n\nI think it really depends whether OP has/uses these alternatives. I personally don't think OP is an asshole for tagging alone if it only stays to that. However, the girlfriend is allowed to be fed up with it and I would not consider her an asshole if she decides that this is a dealbreaker. The two are in this case just incompatible. Unfortunate, but it happens.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 74,
                  "content": "I know many people who live in cities and countries where its cheaper and more convenient not to have a car.  But if that were the case with OP, he wouldn't have to take an Uber back and forth to work, he'd be able to get public transportation.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 11,
                      "content": "You're absolutely right. In Tokyo, my house doesn't have parking, a driveway\nor any sort of garage. In fact, my street is so narrow cars can't drive into it. My workplace also doesn't have a car park or allow people to drive to work. Instead they pay for monthly train passes for all workers. My license expired years ago and I can barely remember how to drive. I'm obviously biased, but I don't think it's immature not to know how to drive. What's immature is not then planning for your own future and setting yourself up to live in a place that supports a car free lifestyle. (Truly car free - no Uber, no bumming rides.)",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 25,
                  "content": "I’m also a non-driver, which is no issue in NYC. I have no interest in ever living elsewhere, so I’m good.\n\nOP clearly doesn’t live somewhere with good public transport as he’s taking Ubers to and from work EVERY DAY.\n\nYour comment is irrelevant.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Again:\n\n> Not saying OP isn't TA, just contesting the idea that everyone has an obligation to learn.",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Your key point is you didn't take rides either. One of my best friends doesn't drive rides his bike practically everywhere he loves it but he also doesn't call and say it's raining today I need a ride. I think the key in this guys scenario is she wants to not be the only hh driver. He may as well pick a side and either break up or do it.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Same. I lived centrally in a city where public transportation was amazing and I could walk everywhere. Did not learn to drive or get my license until I move overseas when I was older. But if I never moved, I would have been perfectly contented not knowing how to drive",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I agree fully, but it does sound like in this case, op is counting on being offered all the time. Which I understand would het annoying. But yeah, if you actually manage your life independently without loopholes like that, good for you right. It also depends a lot on where you live.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 452,
              "content": "I think paying for Uber isn’t mooching…. Why are Americans obsessed that everyone has to drive??? I don’t drive. I’m 37. I don’t mooch. I Uber / public transport or…. Oh gosh prepare yourself ….. walk 😱and yes I walk 4 miles to work everyday and back. Even if it’s raining. \n\nNTA",
              "id": 29,
              "comments": [
                {
                  "score": 726,
                  "content": "Is he paying for Ubers when they are out together or is the default that she will drive? Does he pitch in for gas? Does she ever get to have a few drinks at a meal with him without having to worry about driving?",
                  "id": 30,
                  "comments": [
                    {
                      "score": 388,
                      "content": "ALL of this. I dated a guy who flat out just refused to get his license and it was a large part of why we broke up (of course he immediately got his license after that). \n\nIt's exhausting to always have to drive when we go somewhere. Public transportation sucked where we lived, so we couldn't just hang out without me having to pick him up/drop him off. Ugh.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 167,
                      "content": "I have broken up with people over pretty much this exact scenario. I always had to drive (they had a license though) because a) they'd been drinking b) they wanted to drink c) they didn't have a car and wouldn't drive mine even after I offered to put them on the insurance d) they didn't understand why we couldn't just split a $60-80 round trip Uber instead of them driving e) I always had to go to theirs or pick them up to do stuff. \n\nOne day I had a minor mishap and broke my glasses and couldn't see to drive and they still refused to drive me to go get my glasses replaced.\n\nOP is TA.",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "What if they have kids? She's gonna be expected to drive them everywhere while OP shrugs his shoulders.",
                      "id": 33,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "That is an excellent question.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 463,
                  "content": "I think it is because much of the US has poor public transit, and most suburbs aren't walk friendly.  Like, I can technically walk to work, it's a few miles, but I have to walk on the side of the road most of it because no sidewalks.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 158,
                      "content": "exactly, you can look at neighborhoods before and after a major highway is constructed. it becomes unwalkable in lots of places, even cities. and god knows public transport is not reliable or funded. a majority of americans need a car or to be able to drive even if you don’t own one. imagine being in a rural area and needing to get to the hospital and someone says “silly american, just walk!!” not exactly helpful.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "If you live in NY city, take a pass on driving if you want to. But if you live in any non metropolitan area, you need to learn to drive. It's like not learning basic cooking because there are restaurants and other people around who know how to cook.",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 260,
                  "content": "Americans are obsessed over everyone having to drive because car monopolies have gutted our public transportation in most major cities. Also, the majority of the US is spread out with miles of houses and the only way to reach downtown centers, strip malls, schools, offices, basically anything necessary or fun, is via highways, which aren’t walkable. Where I live I rely on public transportation, walking, and the occasional Uber to get around. The non-university-run buses come once every 1-1.5 hours, so if you miss one, and your route goes on the highway, and you can’t afford an Uber, good fucking luck. In the winter snow plows push all the snow in front of bus stop shelters and you have to climb over ~4ft piles of snow to get to where the bus can see you so it’ll stop for you. I’m from NYC and naively thought I would never need a car, but that’s not how most of the US is set up. I actually despise cars because they’re the entire reason getting around has to be a pain in the ass for me, but I still daydream about having one because I lack any way to travel to other cities cheaply or just go to the store without relying on a bus that doesn’t even always come.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I feel u. I live where public transport is pretty decent but the panda express has messed up trains and due to ocd I can't use other transportation and I can't drive. Lately I can barely walk to the grocery store I'm in such bad shape. I wish I had a car and could drive downtown and buy a week's worth of groceries in one swoop.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Yeah, this, unfortunately. I grew up in the city and moved to the suburbs in my preteens. As a kid I remember walking to the bodega, the corner store, to summer school, and playing outside with the other kids in the neighborhood. When we moved to the 'burbs, the closest grocery store was three miles away. The grocery store we actually shopped at was five miles away, and both routes were along highways with no sidewalks or streetlights where cars whizzed by at 60+ mph. The nearest bus stop was further than the nearest grocery store.\n\nYou know what was in walking distance? a gas station.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Things are really different in Britain because most of our cities developed before the invention of cars. Even places like Birmingham which only became cities after/because of the industry revolution aren't really designed for drivers, definitely not in the city centre.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 224,
                  "content": "Uber isn't mooching but saying he doesn't need to learn to drive because his girlfriend will is.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 96,
                      "content": "The sheer amount of money he's prob spending on ubers would make me think twice about moving forward in the relationship.  Financial security is relationship gold.",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 56,
                  "content": "4 miles doesn't seem that far.\n\nMany cities around do not have good and safe space for people to walk on.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Have you been to America? Rural or suburban small town America? Because where I live in the ass crack of the Midwest if I don’t want to work a farm or at a gas station my hob options are at LEAST 25 miles away. I drive 37 miles one was to work daily and the nearest grocery is 28 miles away. There is absolutely 0 public transport and an Uber to work would cost 1/4 what my monthly car payment is. So, how about we stop thinking our own experiences are universal or that Americans are car “obsessed “ instead of held hostage by a system rigged to benefit the wealthy industries such as the automotive and auto insurance industries.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I'm a Londoner. Normally, I would be entirely understanding of someone who didn't bother to get a license, but the tone of OP's post says that this is less 'pragmatism' than 'laziness'. It's a useful skill to have, one I have (I can't use it, though. Stupid epilepsy), and gift horses should not be looked in teeth.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I’ve been to a few places in Europe and I cannot stress enough how unfriendly most of the US is to walking.  I live in a city with over a million people; I work for a large company in the city limits and I literally cannot get to work without driving.  There just isn’t the public transportation infrastructure here.",
                  "id": 47,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "For a lot of Americans driving isn’t a luxury, it’s a necessity. I live in Northern CA where there is no public transportation and Uber is very unreliable. I live 18 miles away from my work (I can’t afford to live closer) and am 22 miles away from any hospitals. I’m only 2 miles away from the closest grocery store, but that’s because I live in town. My rural town is geographically quite large; people can have the same zip code as me and be 10 or 15 miles away from that same grocery store, which would also be their closest one. \n\nDo I wish I had the option to never drive again? Sure, but that kind of infrastructure and cultural shift is a pipe dream.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Except for those who live in a select few of the largest cities, most of the US has poor to non-existent public transportation. Even in some of the largest metropolitan areas in the country (and pretty much all of the rural ones), it is cost prohibitive to not own a car.",
                  "id": 49,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 381,
              "content": "Exactly, and is she paying for the vehicle, car insurance, maintenance, gas, etc. by herself?",
              "id": 50,
              "comments": [
                {
                  "score": 161,
                  "content": "Of course she is.",
                  "id": 51,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 284,
              "content": "Spot on but it will probably get pulled because we aren’t allowed to call things as they are, even when it’s ridiculously obvious. \nYTA, OP. take a hint and grow up for real.",
              "id": 52,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 47,
              "content": "I quit after a few lessons at 17 when my parents were paying for it because I had other things going on at the time and I regret it now, here it is common for people not to drive. I have sent away for my provisional licence now, it is taking a while because covid and will start my lessons, even if it hadn’t been something I had planned to do if someone had bought me lessons I would use them up knowing they are not cheap.",
              "id": 53,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "You might be right where you are from but where where I’m from a driving license costs about 2500 American dollars. In Europe public transport is mostly oke and you can easily get around. \n\nIs OP in America?",
              "id": 54,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Right?  Especially because he whines \"I was nEvEr TAUGHT to drIvE\" as opposed to \"I haven't learned how to drive.\"  He's not even taking responsibility for his laziness and moochiness.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1956,
          "content": "I’m just picturing OPs girlfriend getting pregnant and having to drive herself to the hospital while in labor",
          "id": 56,
          "comments": [
            {
              "score": 906,
              "content": "Hell, it doesn't even need to be a true emergency. Say they're out somewhere and she falls and sprains her right ankle. It's not safe to drive like that, so what now? Call an ambulance and get the car towed? Something that could have cost literally nothing is now a multi-thousand dollar expense.",
              "id": 57,
              "comments": [
                {
                  "score": 562,
                  "content": "Or feels sick, or tired, or needs to make a phone call while driving. It’s mentally taxing to drive at times. I also find it hard to believe this guy spends less money ubering every day to and from work than he would spend owning a vehicle. That must be so expensive and if the GF is thinking about the relationship long term, she may be imagining how their future household budget would be affected by always having to live near public transit or a large Uber expense every month.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 383,
                      "content": "Not to mention the fact that he doesn't ever feel a need to grocery shop for himself and chooses instead to get everything he needs from a convenience store. Dude is wasting hundreds of dollars a month that could more than cover a car and then some.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 323,
                      "content": "Ubering on that scale gets *outrageously* expensive. They're already paying to maintain, insure, and gas up a car, OP just refuses to take any responsibility for it. I have a sneaking suspicion that he's not exactly jumping in to help with those expenses either.\n\nHe either doesn't realize how much he's benefitting from having a vehicle available or just refuses to acknowledge it, and the girlfriend is doing the right thing by showing him how much he depends on it. I've had to Uber to the grocery store and back and it's hell on earth.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 128,
                      "content": "I hate driving.  Especially at night.  I definitely consider it a chore, and if my partner unilaterally decided that I was 100% responsible for that chore when we were going anywhere together I would be deeply pissed.  I probably wouldn't stay with someone who doesn't drive, just because I hate it so much.  It would be like dating someone who expected me to do 100% of the cooking or 100% of the cleaning, just because he wasn't bothered to learn.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 83,
                      "content": "I would be sick AND tired of this particular boyfriend. If I were her, I wouldn't want to date someone who's 26 years old and won't get his license. I hope she runs.",
                      "id": 62,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "Or wants to have a glass of wine at dinner. I bet OP gets to drink every time they go out.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 273,
                  "content": "God forbid she ever wants to be the one to have a drink with dinner too...",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 150,
                  "content": "Right! There’s a big difference between having a license and no car and not having either. Had a close friend in college who had a license but no car, and when I fell out of bed and fractured my wrist, my friend was able to help me up and drive me to urgent care in my car. A year later I dated a guy who didn’t have his license. Since we were in college didn’t seem like a big deal. Until we were 2 hours away from college at a concert and I had to make the 2 hour drive back while running a fever and wanting to just curl into a ball and die. He wished he could help, but even in that state I was still the better option.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 66,
                  "content": "But if her left ankle was the one that was injured, she should be all good to drive herself to the ER /s\n\nGood grief. This guy needs to grow up",
                  "id": 66,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "\"I've been driving for 6 hours nearly straight. I know we're only 30 minutes from home and it's a perfectly calm night with zero traffic, but I'm tired and can't keep my eyes open and I need to pull over and just rest for 20 - 30 minutes. You'll just have to stay quiet and chill next to me.\" \n\nRather than\n\n\"I'm so tired I just can't finish this last bit. You mind driving?\"",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 326,
              "content": "They would JusT UBeR!But seriously I don’t think OP’s girlfriend would plan a child,while she already has one…\n\nEdit:Btw YTA OP.Given the opportunity,every single independent person needs to learn basic skills,like cooking,cleaning,driving,basic sewing etc.You are not 16 anymore,no one is going to cater your needs like your mother,no one has to drive you around like they are your personal chauffeur,no one has to cook nor clean for you.You have two legs and two hands,it’s time to put them in use.",
              "id": 68,
              "comments": [
                {
                  "score": 96,
                  "content": "Personally I hate driving, despise it entirely, but it is a necessary evil… if I go on holiday I take time away from driving and use public transport where it is available. I’ve had my license since the youngest legal age.\nYTA give her a break. \nI hope when you go out for dates you pay for an Uber… betting not.\nAnd love that the partner now makes him Uber even if she is going there.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 74,
                      "content": "Same. I don’t enjoy driving at all. My boyfriend loves it. He does most of the driving, but I hop in for a shift on long road trips or if he wants to get drunk. \n\nNow my dad is needs help driving into the city for cancer treatments. He could pay $120 round trip each time, but oh wait I learned how to drive so instead he gets to ride with family. \n\nIt’s a basic life skill in North America.",
                      "id": 70,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "That's where I'm at. I don't love driving either (driving for 30 years in SoCal, 27 of those in good ol' Hell A will do that to you) but there are times when you just can't get a taxi/public transport/Uber. To me it falls under useful/essential life skills.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 243,
              "content": "She was already going to the hospital, he was just tagging along",
              "id": 72,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 154,
              "content": "God forbid they have kids! Getting to the hospital is just step 1. Now OP's girlfriend is responsible for shuttling those kids around for 16 years with no help.\n\n(If they lived somewhere with good public transport, it would be one thing, but OP says they live in the suburbs.)",
              "id": 73,
              "comments": [
                {
                  "score": 57,
                  "content": "And the amount of money he must spend on ubers!! Ugh.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "My former boss was in this position. She had a very demanding job and her daughter attended a school with no bus service. She said that was the reason she stopped at one kid. Oh and this was pre-uber fwiw.\n\nHer partner had massive anxiety about driving due to being seriously injured as a pedestrian twice. All I know is my boss was run ragged.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "i didn't learn to drive until my late 30s, and having a kid was the reason why.  i had never needed to up until that point, i'd always structured my life so i could catch public transport almost anywhere i wanted to go (and cabs for the rest), but when my then-husband and i talked about having a kid, i knew it'd be selfish of me not to be able to drive then.  i had planned on just learning so i could drive in an emergency, but ended up really liking it.\n\nironically i currently don't have a valid licence or a car (i moved countries and there's a paperwork nightmare in getting my licence transferred), and this is a good reminder to wade into the nightmare that is the former and get it sorted.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 77,
              "content": "Not to mention she always had to DD if the two of them go out anywhere with alcohol.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "“Babe I’m gonna get us Uber. Oh wait—it’s surging now. Can you wait 30 mins??”",
              "id": 78,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "He’s going to order an Uber. And wait 20 mins on the curb with her.",
              "id": 79,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1038,
          "content": "Yess. Op mentions he doesn't drive because his girlfriend can drive him places. But then later says \"I don't even ask her rides\". She clearly gave him hints and full on direct suggestion by buying him lessons. At this point it isn't even between the lines. She is full on writing boldly that she wants him to grow up and learn to drive. She is not being petty by not driving him. She is showing him how inconvenient it is not to know how to drive. If he feels he doesn't need to know then she is un-inserting herself so he can get to his destinations with solutions he provided. He's being petty by saying this is for her and a gift she can pay for on her birthday. Like no, she is literally doing you a favor. And the entitledness of him demanding a better gift. Like wtf. Who do you think you are OP?! I can assert you aren't a great catch especially if you can't drive.\n\n100% **YTA** OP",
          "id": 80,
          "comments": [
            {
              "score": 261,
              "content": ">He's being petty by saying this is for her and a gift she can pay for on her birthday. Like no, she is literally doing you a favor.\n\nThat's like getting your SO a cleaning appliance for their birthday. This 100% is not a gift, and definitely comes from a place of spite and not love. ESH.",
              "id": 81,
              "comments": [
                {
                  "score": 247,
                  "content": "But the fact that OP demands a better gift is what gets me. And then to top it off he's upset that she doesn't give him free rides anymore just because she can. For me, I've never not liked a gift I've received, because it's gift. As a recipient of a gift, I always feel grateful because I know I really don't deserve anything but someone was graceful and kind enough to give me something regardless. I don't care if OP thought it was a gift he didn't like for himself. As someone who receives a gift, the right thing to do is just accept the gift and say thank you, not complain about it. Gifts are privileges and luxuries, not basic necessities everyone around the world can have. Thinking about less fortunate people globally is enough to just recognize how a gift, no matter what it is, is great.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 66,
                      "content": "That's why I made an E S H judgement. To paraphrase The Dude, \"he's not wrong, he's just an asshole.\"",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I've gotten gifts that I've hated and I've given gifts that the person hated. Some gifts are just bad gifts, and OP should be able to be honest about how it makes him feel. \n\nOP doesn't think driving lessons were an appropriate gift, OPs partner thinks it's important to drive, and I think both are right... just not communicating or problem solving effectively.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 106,
                  "content": "ESH! She has valid points but instead of communicating with him she is giving passive aggressive \"gifts\".",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 333,
          "content": "Its worse that OP says \"cars are to much money\" but in the same post says he ubers to work or other places and can take the bus. Assuming OP works 5 days/week and uber is 10 bucks each way, thats minimum $20/day, $440 per month in a 22 day work month, plus wherever else he might uber to. You can get a basic, fuel efficient car with full coverage insurance on a lease for less than that. And if the uber is more than that, well it still holds up.\n\nI went with lease because im assuming OP doesnt have to uber to far to work, so mile limits on a lease arent a concern, and they would never have to pay for major repairs on a car.",
          "id": 86,
          "comments": [
            {
              "score": 150,
              "content": "The reason I can afford to live without a car is that I have grocery stores within walking distance and I work from home, so I only have to take ubers at most once every two weeks.\n\nI couldn't imagine having to take an uber 5 times a week.",
              "id": 87,
              "comments": [
                {
                  "score": 146,
                  "content": "He doesn’t grocery shop and is ok living off what he can get at wawa (in the comments). For those unaware of what wawa is (I’m sorry) it’s a gas station meets a subway with convenience items at a huge markup.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 151,
                      "content": "I can only imagine how much fucking money this guy is spending to avoid being an adult, and it's *mind boggling*.",
                      "id": 89,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "I love WaWa but I can’t imagine eating the food there everyday.",
                      "id": 90,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Never confuse a wawa with a subway lol\n\nWawa is way better, and has a much larger menu .  The markup is any typical 24 hour store like sheets , 7/11 or quick check",
                      "id": 91,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Also I can say I stopped taking Uber specifically cause it was getting more and more expensive. A ride from my job to my home (approx. 12 mins) at 4pm on a weekday was anywhere from $12 on my luckiest day, to $19 on average. By the time I stopped using it the rides were $30+ one way. I'm not sure where OP is from but depending on the area the cost can be actually insane.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "$20 is very generous. I live like 2 miles from work and looked into Uber and it was like $30 one way. I just finally got a 2nd car. As my boyfriend has to use the other car I own for work.",
              "id": 93,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "[deleted]",
              "id": 94,
              "comments": [
                {
                  "score": 3,
                  "content": "5 each way for an uber (which is the very low end, especially if he’s getting one at start/end of work times when they surge, or in the winter since they surge when it’s raining/snowing/very cold) every work day 50 weeks a year is 2500, and that excludes the things like the fact he ‘grocery shops’ at a convenience shop/garage where things tend to be absurdly overpriced. \n\nBut also having a license doesn’t obligate you to buy a car, it just gives you the option to.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 304,
          "content": "Lol she's willing to spend hundreds to not be his ride 24/7",
          "id": 96,
          "comments": [
            {
              "score": 134,
              "content": "Right? Think about how exasperated one has to be to reach that point.",
              "id": 97,
              "comments": [
                {
                  "score": 23,
                  "content": "Been there. Uber exasperated, lol",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "That shit gets old real quick. “Honey, don’t forget I have that dentist appointment tomorrow morning”",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 278,
          "content": "Is OP Sheldon Cooper?",
          "id": 100,
          "comments": [
            {
              "score": 335,
              "content": "Even Sheldon Cooper learned to drive",
              "id": 101,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "[deleted]",
              "id": 102,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 266,
          "content": "This right here. The gift wasn't driving lessons. The real gift was a clue.",
          "id": 103,
          "comments": [
            {
              "score": 288,
              "content": "The gift was one more chance to redeem himself before she pulls the plug on this relationship.",
              "id": 104,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 34,
              "content": "Spot on! Too bad he won’t get it. Refuses to get it? \n\nRing! Ring! “Clue phone, it’s for you!”",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "And one of his complaints about driving was the expense (car, etc.) so she took care of the expense of learning to drive",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 209,
          "content": "I know a guy who is going through cancer treatment and his girlfriend can’t or won’t drive. So his sick body has to ask for rides or take a bus so he can get to appointments. I very much dislike his girlfriend for being so selfish (for other reasons besides not driving) and wonder why he is with her at all. She’s a child and takes on absolutely no responsibility for anything. \n\nThis pisses me off. Take a moment and reflect on the reasons why your girlfriend wants you to be able to drive. YTA",
          "id": 107,
          "comments": [
            {
              "score": 12,
              "content": "I’m not sure where you are, but have him check out the American Cancer Association if he hasn’t. They may offer rides in his area. They often need to be scheduled ahead of time and are subject to volunteer availability, but it may be another resource for him. I never actually used it during treatment, but it was nice knowing the option was there. I lived by myself and had it timed out- It was a 30 minute drive from the hospital to my apartment, and side effects would kick in around the hour mark. Having someone to drive me occasionally would have been wonderful, but I told myself I was young and could do it myself 😂",
              "id": 108,
              "comments": [
                {
                  "score": 12,
                  "content": "Thank you for the suggestion. He’s a proud car guy. Owns his own dealership and works on cars. It’s so weird to me that his companion would not drive. He’s also reluctant to ask for help or give much information. He knows that myself and a lot of other people are here for him if he needs anything.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "There's a movie called 50/50 you might enjoy; your friend's story is almost verbatim the same as the main character's.",
              "id": 110,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 154,
          "content": "Or what if she wants to take a road trip? She's going to do all the driving while he naps?\n\nSeriously, even if you have no plans to buy a car, knowing how to drive is a useful skill as an adult, simply so you can take your turn or at least know what you're asking of people when you ask them for a ride. \n\nAnd if you learn that you hate driving, either for medical or mental reasons, than that is a valuable lesson too, and you can be more aware of how nice people are when they offer to drive you and you can be a bit more free with offering gas money to friends or money for insurance/costs (if in a relationship where one person does all the driving errands).\n\nI'm really glad to see so many people voting YTA on this one. I was afraid I'd be the only one!",
          "id": 111,
          "comments": [
            {
              "score": 26,
              "content": "Big YTA on op. There’s no shame in having to learn a skill you don’t use often if you can and have the privilege to learn it. Especially everyone mentioning emergencies in the future. You’re not obligated to own or use a car once you learn how to drive plus it sounds like OP is downplaying or is unaware of how much he relies on her for rides and she’s sick of it. And if he lives in US and doesn’t live in a walkable city like NY or SF, he should fully be aware of how bad infrastructure is for many walkers and public transit and should just take the lessons anyway since they’re non refundable. Like it’s not the best gift but the real gift is the BIGGEST hint she dropped right into his lap.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "When they're out together she won't ever be the one who is allowed to drink. When they visit someone and have to drive for hours - it will be her alone.",
              "id": 113,
              "comments": [
                {
                  "score": 5,
                  "content": "Even the things like the trips to the grocery store, maybe she’s sick of being the one who has to drive there very single time?",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "OP is totally the asshole, although they are both the problem.\n\nTheir relationship is more like a parenting one. Four years? This guy hasn't even aged *past* that. And her? She has been mommy'ing him for this long. He won't change because it doesn't benefit him.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 137,
          "content": "He is absolutely insufferable. His poor girlfriend",
          "id": 116,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14072,
      "content": "ESH My parents nearly broke up over my dad's refusal to learn to drive. It put so much pressure on my mom. He was completely reliant on her in ways he just didn't appreciate. She always had to be DD, she always had pay for gas because he was \"just the passenger,\" he got to nap on long car rides and she never got a break. He thought it was a great situation, and it was *for him.* She however felt taken advantage of and like a chauffeur.\n\nMaybe it wasn't the best birthday gift for you, but maybe you need to take responsibility for yourself and at least learn how to drive. You don't have to buy a car or change your lifestyle, but it is an important skill.",
      "id": 117,
      "comments": [
        {
          "score": 3598,
          "content": "Yeah he can just drive her car / they share a car. No need to buy another car, just share the driving burden.",
          "id": 118,
          "comments": [
            {
              "score": 1495,
              "content": "Exactly this!! My boyfriend and I share my car because we’re in a city where having even one car can be difficult because parking and insurance is expensive. It’s so nice being able to switch off who drives when we take the car out, we usually will do one person drives to a place and the other drives home. If I was OP’s girlfriend I would absolutely break up with him over his refusal to even LEARN to drive. \n\nYTA, OP. Stop taking advantage of your girlfriend and just learn to drive already.",
              "id": 119,
              "comments": [
                {
                  "score": 403,
                  "content": "Driving is such an important skill in a developed country that its almost like saying \"I don't wanna know how to cook\"",
                  "id": 120,
                  "comments": [
                    {
                      "score": 151,
                      "content": "[deleted]",
                      "id": 121,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 19,
                      "content": "In the big cities sometimes there's enough public transport where it's not necessary.  This, however, does not seem like one of those situations.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I was thinking the same thing. I'm shocked at the people defending him because he takes Ubers or whatever. That's like saying \"I order DoorDash every day so why should I learn how to cook?\".",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "He doesn't do that either apparently. Another commenter said he just goes to a Wawa gas station for all his food",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 520,
              "content": "Also sorry, but his reasoning is that buying and maintaining a car is expensive?? More expensive, than getting an Uber to and from work every day?!? I highly doubt it. You don't have to get a brand new car.",
              "id": 125,
              "comments": [
                {
                  "score": 353,
                  "content": "And totally disregards that GF is already shouldering those costs alone, while he gets to ‘tag along’ whenever he wants to go some place.",
                  "id": 126,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 21,
                  "content": "Yeah this dude is weird. I got my car for $1500 w 0 problems. It’s just older",
                  "id": 127,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "To be fair I live in San Francisco and parking and uber kind of balance out (and I don’t have car payments or insurance or anything if I uber).  \n\nI mean OP needs to wise up or his gf is going to dump him.  I could see him being disappointed about his gift so nta in the particular day but asshole in the overall driving dynamic of the relationship (and as others have said nothing obligates him to get a car).",
                  "id": 128,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "I used to uber everywhere for about 4 years & the money I spent could’ve bought me a pretty decent car if I saved up.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Or (depending on where he lives) he would then be allowed to use Zipcars for errands if the car isn’t at home-.\n\n\nEdit: Just wanted to add that Zipcar has been hugely helpful for me in times without a vehicle. Not only is it cheaper than an Uber there and back from the grocery store for instance, but you can park and then unload larger grocery purchases gradually in a locked vehicle versus grabbing everything out of the Uber and setting it on the ground.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1186,
          "content": "This is the key thing. The non-driver in this situation doesn’t fully comprehend how much pressure they’re putting on the driver.",
          "id": 131,
          "comments": [
            {
              "score": 253,
              "content": "THIS! Reading him dismiss her desire not to always be the driver I was like \"Yeah. I can tell you can't drive.\" \n\nI got my licence in my mid-30s because I live in a big city with good transportation, where car ownership is wildly expensive. I'd also been in several accidents as a passenger (including in buses and taxi cabs) and lost a family member to a car wreck. But my dad moved three hours away... So I learned. \n\nAnd you find out there's things you don't know. You don't know how it's stressful to change lanes with no notice. You don't know that you REALLY can't see jaywalkers in black at night. You don't know that it's a very specific type of exhausting. \n\nNEVER having a break -- being the person carrying driving in a couple, always? That would suck. But he can't know that because he doesn't drive. \n\nBut it WOULD be nice if he took that into consideration -- that he doesn't know what it's like for her. He only knows what it's like for him -- a person who just doesn't want to do it, but somehow thinks everyone else is fine to do it for him.",
              "id": 132,
              "comments": [
                {
                  "score": 36,
                  "content": "I love how he describes her having to drive them any time they go anywhere as him just \"tagging along.\"",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Lol I know right? Driving is a profession. Driving long distances, short distances. Tiny vehicles and large vehicles. There is an enormous I dusty of people just driving everywhere. He even mentions one in Uber. Imagine being so dense that he uses professional drivers and pays for them, but then fails to recognize his girlfriend doing it for free.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 674,
          "content": "I do NOT like driving. I have awful anxiety about it- almost all of the time we are going somewhere together, my boyfriend drives. All that to say- I *can* drive, and I do. My boyfriend loves to drive, so it's a win-win if we're both going somewhere together. But I am very aware that driving is an important skill that it is a big Ahole move to forever stick on someone else. I understand not wanting to drive, I really do- but not even being able to contribute and being willfully ignorant of that burden makes you a bit of TA here.",
          "id": 135,
          "comments": [
            {
              "score": 179,
              "content": "I'm the same way, my husband will usually drive, but on a trip or long drive we split it. And, I always thank him, and let him know if he's ever tired of driving all the time to let me know, but he really enjoys it, so it works out. If we're drinking while we're out, we take Lyft.",
              "id": 136,
              "comments": [
                {
                  "score": 29,
                  "content": "Neither of us are old enough to drink so we haven't run into that yet, but exactly- long trips shared, I'll absolutely do it if he's not feeling it, but I guess the point I was trying to make is that not loving driving is fine- it's the outright refusal that is the problem.",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 148,
              "content": "My Aunt hadn't driven as long as I'd known her.  My Uncle drove her everywhere.  He was sent straight to the hospital from his Drs office due to his heart.  \n\nI was shocked when she asked me to drive her to her house so she could pick up their car. (We worked at the same office.) She then drove us to the hospital so I could drive his truck home. She was willing to drive the car in an emergency, but the truck was more than she was comfortable with.  \n\nI didn't even realize she could drive it had been so long.  (I think she said 20 years.) But she drove fine after the first bit.  \n\nMy uncle loved to spoil her.  My family was critical of it. He grocery shopped, cooked, vacuumed, etc.  But seeing it has benefited me tremendously. (My Aunt is 83 - so it wasn't common in our circle back then.) It's definitely made it more comfortable for me to expect hubs to do his share.",
              "id": 138,
              "comments": [
                {
                  "score": 55,
                  "content": "I know a couple where both parties can technically drive, but one doesn’t because they absolutely hate it (due to fear/anxiety). Her husband is fine with driving everywhere though. I don’t think there’s anything wrong with one person doing all the driving if that person is 100% okay with it and the other person has a valid reason for not driving. But if both people are capable of driving, and one person does not want to shoulder the burden all the time… then they should learn",
                  "id": 139,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Do we have the same friends? Because mine act just like that. He always drives because she gets panic attacks from driving. She was in a real bad wreck as a teen so she gets real nervous when she sees someone driving weird....which is all the time. Carpooling with her makes me anxious but there's nothing wrong with that. \n\nThey have an agreement and she has PTSD so it makes sense in their situation. OP not so much.... He should learn to drive. Also a license is a useful tool to have.",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I'm surprised she had a valid license. I guess some people maintain a driver's license as ID.",
                  "id": 141,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "I’m the same. I HATE driving, but I can and I will if my partner wants a break or there’s an emergency.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "And that’s the important difference. You can drive, and you do when you need to.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "i hate driving but i also hate not driving. i hate having to be responsible for getting other people somewhere, but i feel trapped if i don't have my car available to leave. it's the worst",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Exactly. I’ve met so many non-drivers who think that driving is no big deal, and that’s because… they don’t have to do it. They get rides from other people, (generally) don’t pay for gas, and comment on other people’s driving skills as if they can do any better. And on top of that, they act like driving is the easiest thing in the world.\n\nObviously, not every non-driver is like this, and some people have legitimate reasons for not wanting to drive. But OP sounds like someone who underestimated what a burden it is to serve as the “chauffeur”",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 349,
          "content": "You took the words out of my mouth! My bf doesn't drive and I'm the one it always falls back on if something happens. To go to his parents house we HAVE to drive. The other day we were heading there and he wanted to go see friends first. We had to have a conversation on the way that while I support his not driving, he needs to consider how I feel too. Delaying our departure meant we aren't there for long and that I couldn't have a drink, and that I'm driving longer periods in a short amount of time. When we travel, the stress of driving is on me and me alone. It's a hell of a lot of stress. \n\nI think this is an ESH situation because his birthday was not the time to gift the lessons. Birthdays are for presents you want. OP also sucks because he is being selfish in choosing not to understand why she wants him to drive too. They should budget for his lessons and test throughout the year to get them for him. Not on a special day. Also, I would have thought ubers to/from work would cost way more than being able to drive yourself in the long run, so you aren't thinking about finances long term. Just short term wants. That's definitely a conversation that needs to happen together.",
          "id": 146,
          "comments": [
            {
              "score": 96,
              "content": "Sounds like your boyfriend needs driving lessons.",
              "id": 147,
              "comments": [
                {
                  "score": 60,
                  "content": "No, he has his reasons and I support him. I just wanted more consideration when we have to drive. Quite often if I want a drink he will pay for an uber for us. It just takes more planning on our end.",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Driving lessons are an *expensive* and useful gift that teaches you life skills, they're also not an obligation to buy a car. I honestly think they're a fine gift especially if gf is at the end of her tether.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 166,
          "content": "[removed]",
          "id": 150,
          "comments": [
            {
              "score": 66,
              "content": "It's passive aggressive and his BIRTHDAY is not the time to do it. Actually, being passive aggressive isn't helpful at all. If she wants him to drive, she needs to straight up say it and communicate like an adult.",
              "id": 151,
              "comments": [
                {
                  "score": 25,
                  "content": "She probably has. His entire post is completely dismissive of her feelings. He doesn't even care to stop and consider her position and the demands put on her by this situation.\n\nShe probably has talked to him about this before and he was probably equally as dismissive. However, this time he finally heard the message because this time he was actually listening to what she said.... because he was listening for an explanation regarding HIS OWN displeasure at the gift. \n\nThere is no way this was the first and only time she's communicated this message to him like an adult. This is the first time that he was willing to receive the message.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 22,
                      "content": "My guess is he said he couldn't afford lessons , and it's why she thought he'd love the gift. I bet you a million bucks that this is the first time she's hearing he doesn't ***WANT*** to drive. He's probably just been dismissing her offers to teach him with excuses and can't afford it. It's why she's suddenly refusing to drive him around now.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "But is it passive aggressive? Isn't there a situation where the girlfriend may have thought he'd WANT driving lessons but couldn't afford it?\n\nHad they discussed in the past that he never wanted to learn to drive? I bet that never came up, because she might've never paid all that non-fundable money if they had.\n\nShe was upping the gift like it was great. You've got to admit, she MAY have truly thought it was a GREAT present. I mean, who would guess that someone would be this adamant about never learning to drive and being a total leech.",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Honestly based on how his post is worded I doubt this was never brought up before. My guess is that she’s very tired of driving everywhere when they go out together. You don’t spring driving lessons on people unless it’s something that’s been mentioned before. He might’ve said it was too much money to learn to drive at one point so she went “oh ok. I’ll just gift him the lessons so that all the fees and research could be done.”\n\nI mean yea it would suck to recurve that as a gift if you just don’t wanna learn to drive. But I feel like I’d also take it as a sign that she’s done talking if she’s giving it to me on my birthday of all days",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I'm wondering if, at some point (probably multiple points) she asked why he didn't learn to drive and he told her \"it's too expensive.\" I don't believe the Op would have told us if that were the case.",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 113,
          "content": "Yeah, I think the fact that OP relies on his partner is really the problem. \n\nMy partner and I are late 20s/early 30s and neither of us can drive, but we live in a city with amazing public transportation so it doesn’t matter that we don’t drive. And among my friends it’s 50/50 if people can drive or not. \n\nSo I’m generally very sympathetic to people who choose not to drive, but you can’t rely on your partner and not take the hint when she doesn’t want to drive you places anymore.",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "Why is it an E S H and not a YTA?",
          "id": 158,
          "comments": [
            {
              "score": 165,
              "content": "Cause I agree with OP that it isn't a very good birthday gift.",
              "id": 159,
              "comments": [
                {
                  "score": 60,
                  "content": "That’s what tipped it for me as well. OP definitely needs to get his license, but the girlfriend also sucks for not having a prior conversation and making it his birthday gift.",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "I agree with you.  It’s a totally valid issue for her to have with him.  She should have a discussion, and if she wants to put out an ultimatum about it I’d think that’s reasonable.\n\nIt’s also very rude to give a gift focusing on getting someone else to change in a way they don’t want to.\n\nAlso, I think it’s valid to live a life where you don’t drive.  Some people can’t, and some people are terrible drivers by disposition.  It’s fine if the girlfriend doesn’t want to be with a non-driver, but I don’t think he should be shamed for it.",
                  "id": 161,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Understood, thanks for clarifying. I agree with you on most of what you’ve said here. Especially the first paragraph.",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "I totally agree, ESH.  This was definitely a sucky birthday gift to give you and you’re right, it is a double standard with her expectations.  BUT, the fact that you’re only refusing to learn to drive because you don’t feel like it or want to, that’s terrible.  I don’t drive for medical reasons, I have severe panic attacks behind the wheel and take a lot of medications that impair my reflexes and functioning.  So it’s literally not safe for me to drive.  Even with my legitimate reasons for not driving, my husband still sometimes resents the fact that he has to drive everywhere because it IS a burden if only one person drives.  The fact that you are choosing to not drive because you don’t want to is incredibly selfish.  Besides, what if you end up somewhere where there is no public transportation options, Uber’s, lyfts, whatever?  Are you just going to bike and walk everywhere?  It’s a practical skill that even I can admit you need to learn.  Do the lessons.  But I think it’s fair to be hurt that your birthday present was not meant to be something YOU would want.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "This. Functionally, my husband doesn't drive. He has night vision issues and abhors driving in the city. I do 99% of the driving. He does drive on distance trips on highway and country roads. He drives on my birthday and to pick me up from the train. It's just enough that I am fine with it.\n\nA few years ago, I ended up in the emergency room a few times. It wasn't enough to call an ambulance. The thought of calling an uber when I was scared, panicking, and in pain is awful. He drove in the city at night each time and never mentioned it ever. When I thanked him he told me to stop, it was the bare minimum.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "A similar thing almost broke my husband and I up as well, before we were married. I had a car, he didn’t, and he didn’t see the point of getting a car because we could share. Meanwhile, I’m scheduling my life around us sharing, I’m paying for the car and insurance, and sometimes when our schedules are too complicated I’m picking him up from places because he has a lot of work equipment that he can’t easily put in an Uber. After years of nagging him about this and seeing no results, i pulled the plug on his access to my car out of nowhere and articulated that it was a. Last ditch effort to save our relationship because I resented him so much. 2 weeks later he had a car, and he got his shit together as an adult lol and now we are married.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8485,
      "content": "I was going to say E S H but was struck by this point...\n\n> because I’m not really interested in learning because I don’t plan on getting a car since they’re a lot of money.\n\nIf you've always thought that driving and cars are too expensive I can see how she thought paying for a massive chunk of that initial expense would be a generous gift. \n\nIt makes sense that she thought helping with expenses would motivate you.\n\nSo a close YTA. She's not the immature one, you expected to be driven places makes you the immature one by today's standards.",
      "id": 166,
      "comments": [
        {
          "score": 3772,
          "content": "You’re making a good point IMO but OP pays $20 in Uber fees *per day*. That would be like if my gas tank ran out *every other day*. Getting a used car would be so much cheaper in the long run. Given that OP clearly does not think long term about these things though… I dunno.",
          "id": 167,
          "comments": [
            {
              "score": 1630,
              "content": "Yeah the lack of long term thinking is odd. Constant ubers are expensive and he's likely not going to have the same job or live in the same house forever. \n\nHe's been handed free lessons on a platter, I wonder if there's another reason he's too embarrassed to admit (eg anxiety or fear of change)",
              "id": 168,
              "comments": [
                {
                  "score": 514,
                  "content": "Right, and not knowing how to drive can really limit where he can live or what jobs he can take. He'd be looking at a job thinking \"ahh, that Uber's gonna be $30 each way, I can't afford that . . .\"  or struggling to find housing near public transit. I'm willing to bet that if he doesn't get his license, his girlfriend is gonna leave him and then he'll really be screwed.",
                  "id": 169,
                  "comments": [
                    {
                      "score": 58,
                      "content": "A lot of jobs also require you get a license to even be interviewed. My old position is almost entirely in-office, but my boss still made a license a requirement on the off chance that there's an errand that needs to be taken care of.",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 311,
                  "content": "He also commented about instead of helping his gf with grocery shopping, he prefers to go to the nearest wawa as it has everything he said he needs. I say this as big wawa fan, but he clearly doesn’t think long term with money. That ain’t cheap. He said he and his gf have different diets and she likes to go shopping and cook and he prefers burgers, sandwiches and snacks from a nice gas station. Doesn’t sound like op is smart with money at all.",
                  "id": 171,
                  "comments": [
                    {
                      "score": 22,
                      "content": "What is a Wawa?",
                      "id": 172,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 160,
                  "content": "I'm actually slightly worried for OP because I fear he could have a valid reason to avoid driving and is just dodging the subject. My sister was in the process of learning how to drive when she got in a car accident that really should've killed her. She walked away with minor scratches and a concussion but she was traumatized by it and it set her back months.",
                  "id": 173,
                  "comments": [
                    {
                      "score": 11,
                      "content": "If you don’t face the issues after trauma, you’ll get stuck in a loop of inability. I totaled a car at 17 (blind curve, hit a rock that had fallen, knocked me off the road). I was made to get back in and drive within the week. I’m an excellent driver (really, I’ve had lots of people tell me this), but I could have ended up like my mother who was in an accident at 16, not driving, not injured, but so freaked out she hated driving, and I became her chauffeur as soon as I got my learner’s permit.",
                      "id": 174,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I got ran off the road during the winter months as the person almost T boned me (I reacted in time to avoid getting hit thats why it was only a run off. Asshole didnt even check to see if i was okay (they had the stop sign. They were a big truck that probably thought 4 wheel drive means they have 4 wheel stop and almost learned the really hard way that they dont)) and since then I have panic attacks trying to drive in the winter months. Car accidents can mess you up so badly and if that is the case with OP I hope he can get help",
                      "id": 175,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 122,
                  "content": ">Yeah the lack of long term thinking is odd\n\nThat's called *immaturity*.",
                  "id": 176,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "It’s probably not as expensive because he can bum a ride to the store with his gf. I’m guessing he doesn’t chip in for gas when they go out together.",
                  "id": 177,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "I did the quick math- assuming OP is working 5 days a week, 50 weeks of the year (with two weeks of vacation), that’s $5,000 per year on Uber’s. And that’s not taking into consideration weekend Uber’s or days when the Uber costs more. He could definitely get a cheap used car and spend less in a year or two than he would on Uber. This isn’t about cost, he just wants his GF to keep being his chauffeur.",
                  "id": 178,
                  "comments": [
                    {
                      "score": 3,
                      "content": "So I drive a cheapish used car that is a hybrid but I also do delivery. I just did the math with my monthly car payment (which is admittedly high but I didn’t have good credit or a lot to put down when I got it) with my weekly gas and it comes out to roughly $4,680 per year. That $300 difference can go a long way if you’re broke.",
                      "id": 179,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 249,
              "content": "That's why he's pissed. Now he's not getting free rides from his gf now uber costs go up and it's not such a cheap alternative.",
              "id": 180,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 134,
              "content": "At first I was thinking he's being silly because having a license doesn't necessarily mean buying his own car, he can easily drive hers for errands and such, or even just take turns driving when they go places together, but if he's Ubering to work and public transit isn't an option, then yeah, dude needs a license and a car. $20/day is $140 a week, and around $7k per year! $7k can buy you a used car, although maybe not a great one.",
              "id": 181,
              "comments": [
                {
                  "score": 25,
                  "content": "And that’s just one year. I bought a 7k car once, lasted 6 years with regular maintenance. I’d say after about 18 months of ubering it would be breaking even. And after that would be money in my pocket (not counting gas but ya know)",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "$7k  could buy a good used car, if you don't care about how it looks. I got mine for $5.5k. Granted, I also traded in my old car, but my old car was twenty years old and limping along, so they didn't give me a lot on the trade in.\n\nTo be fair, taking out a lone or saving up that $7K can be kind of difficult. I was lucky that my mom gave me the car I wound up trading in, so I could have transportation to work while I saved up for the next one. My boyfriend was also really patient about covering rent, utilities, and groceries while I saved up (though the car is for both of us, because he doesn't have one). My parents also chipped in half of the cost as a Christmas present.\n\nIt's really easy to look at how much money OP is spending in the short term, add up the numbers, and say \"this is how much you could be saving, just save it and then buy a car.\" I'm sure OP could do some budgeting on his food expenses and make it work out eventually, but it can be a slow and difficult process. I'm not surprised if OP finds the task daunting.",
                  "id": 183,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "For real. Buy a workable used car, and it would pay itself off within just a few years. Even with gas, insurance, matainence, etc.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "Yup, when I realized that ubering to the tune of $20+ a day was actually more expensive than leasing a car… you bet my broke ass got a car.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "The thing is OP doesn't even need to buy a car! Just being capable of driving would alleviate the burden off of her to *always* be the driver anywhere they went together and I'm sure that would mean a lot to OP's girlfriend.",
              "id": 186,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "It’s like complaining that groceries are getting expensive so you eat out every day.\n\n\nBut seriously I think it’s just op making excuses because their too lazy and selfish to learn. Think about it, they don’t have to be responsible and can rely on their gf all the time. It’s perfect for a selfish person who would rather inconvenience others than ever inconvenience themselves. I’m imagining OP thinks everyone else loves to drive.",
              "id": 187,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "I didn't drive for years and this is 100% true. And consider the time you save too!\n\nI used to bike to work, arrive hours early because of the bus schedule, leave early so I can catch the right subway...with a car I have so much of my life back.",
              "id": 188,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 374,
          "content": "Yep, YTA. You don't live in a city with good public transportation. \n\nAt the very minimum get your driver's license. You don't have to pay for a car or insurance. So overall it's free and cheap for you since the drivers training is covered. And not only that, it's a 3rd party that's teaching you so less stress overall.\n\nWhat if there's an emergency in the future and you need to drive? What if she has a family emergency and in no condition to drive? Sorry hunny, let's wait for the uber and I'll send you off without having secure transportation around your family. Lol\n\nGet the license since you live in the suburbs. Down the road you'll figure out its cheaper to own a cheap car + insurance +maintenance vs daily uber.",
          "id": 189,
          "comments": [
            {
              "score": 286,
              "content": "adding to your list, what if you need to go on a long car trip? like five hours plus. she has to drive the whole way? YTA OP I've been this girlfriend before and it SUCKED",
              "id": 190,
              "comments": [
                {
                  "score": 106,
                  "content": "I once went on a ski trip with a friend several hours away. they got a concussion and I had to drive the whole way back.\n\nimagine if something like that were to happen to his girlfriend. they’d be stranded.",
                  "id": 191,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Exactly this. My first thought was how I broke my right ankle earlier this year and suddenly couldn't drive myself to work. If my partner couldn't drive, I don't know what I would have done.",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 49,
                  "content": "Me driving 9 hours each way to visit family every year because my bf couldn’t drive and split the time. Yeah, we didn’t last.",
                  "id": 193,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I did 10 hours each way on a road trip with an ex who couldn't drive, and the stress of always handling the driving was one of the (many) factors he ended up being an ex.",
                  "id": 194,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 148,
          "content": "Plus, you add up all of those Ubers, and it is guaranteed to be more expensive than owning a car.",
          "id": 195,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 122,
          "content": "It also stuck out to me because he’s perfectly happy letting his girlfriend take on that expense and constantly benefiting from it.",
          "id": 196,
          "comments": [
            {
              "score": 36,
              "content": "The expense, the emotional burden, the logistical burden, everything. He's making it all her problem and she's clearly struggling with bearing all of the burden and begging to get out from under it. And OP's just like \"ew no why would I put any effort into this when I can just make you do it all\"",
              "id": 197,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "agreed. I'm guessing that if he did anything like paying for gas or maintenance or insurance, he would've put that right the beginning of his story to let us know that he's not a moocher.",
              "id": 198,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "You don’t need to own a car to find value in knowing how to drive. Honestly I relate it to swimming, it’s a learned skill and pretty damn useful when needed. It just makes you so dependent on another person. YTA",
          "id": 199,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "I agree. I bet she thought the reason he'd never learned was $$$. I bet you dollars to donuts that the OP never told her he had no interest in driving. I bet he even probably TOLD her it was a $$$ issue never realizing that she would spend that much money to help him. Because she UPPPED the gift forever. She probably THOUGHT it was a great gift. And frankly, IT IS. Just not for the OP and his shitty attitude.",
          "id": 200,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "He called his GF childish for no longer driving him around. It is not even a close YTA, it is a big YTA.",
          "id": 201,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Absolutely agree! Personally, it would be a deal breaker for me. I couldn’t be with someone who couldn’t drive. What happens in the future if you have kids and you can’t help pick them up or drop them off? Be prepared to lose this relationship.",
          "id": 202,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I bet when she eventually drops his ass he looks for another girlfriend that has a car and can drive him!",
          "id": 203,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "He's spending WAAAAAAY more money on ubering 5 days a week, too lol. That's like 1-2 tanks of gas a day depending on the distance. To go like 1.5 miles in my town was almost $30 during a non peak hour. If he didn't Uber for 1 month he'd pretty much have a down-payment for a car.",
          "id": 204,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6253,
      "content": "YTA.  Sorry, you might not like the gift, but read the room.  She clearly is trying to tell you something that for whatever reason you don't want to hear.",
      "id": 205,
      "comments": [
        {
          "score": 23,
          "content": "This was the wrong venue to do that though. She spent hundreds of dollars on a non-refundable gift that she knew he didn't want. What did she think was going to happen?",
          "id": 206,
          "comments": [
            {
              "score": 14,
              "content": "I agree, this shouldn’t have been a gift, it should have been a conversation.",
              "id": 207,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3908,
      "content": "ESH. Her for getting a bad gift, you for being so willfully oblivious as to how much of a burden this is. Sure, you may not be asking for rides all the time, but you are actively losing money by ubering every time she's not available. Not to mention, she's clearly annoyed with always having to drive.\n\nTake the hint and recognize that this is an issue for her, and it's likely one that will be a dealbreaker down the line. I know I sure wouldn't commit to someone who refused to learn \"just because.\"",
      "id": 208,
      "comments": [
        {
          "score": 1565,
          "content": "Came here to say this.\n\nAs someone who was scared of driving and didn't learn until adulthood, it took my partner sitting me down and saying \"look, I don't mind driving you around town, and I know this is a thing for you, but if you want to keep going to (far away friend)'s to help on her farm, you'll need to learn how to drive. I'm happy to help.\"\n\nOP's GF really should have had a similarly frank conversation with OP that she doesn't want to be the only driver and that she's happy to pay for lessons and help with any extra expenses instead of springing this as an optimistic and manipulative gift.\n\nThat said, OP is being childish by being like \"no fair! I want a better gift because I'm the special birthday boy!\" Consider this a shot across the bow, OP. Her \"gift\" is a warning to get your license or get resented. No, it's not a pony and an ice cream cake, but it's hopefully better than no ride and no GF.",
          "id": 209,
          "comments": [
            {
              "score": 204,
              "content": "Yeah, the GF needs to be clear and honest.  I agree with OP this wasn't a great gift, but I understand why GF wants to get OP to be more independent.",
              "id": 210,
              "comments": [
                {
                  "score": 20,
                  "content": "I kinda of got the vibe that the gf thought OP didn’t want to drive partially because of how expensive lessons are. So the gift was her way of taking that burden off of him.",
                  "id": 211,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Thing is we don't know if the GF hasn't done this already.  Going by the way he has said I'm assuming this was a last straw gift after trying multiple other things.",
              "id": 212,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 203,
          "content": "SERIOUSLY. I’ve never had this problem with an SO but some of my family members refused to learn to drive for a long time, and that would leave the rest of us in charge during trips and events. It’s FUCKING. ANNOYING. Learn to drive.",
          "id": 213,
          "comments": [
            {
              "score": 6,
              "content": "Why do people who choose not to drive always think they aren’t a burden?\n\n“It’s never a problem for anyone else!” Except everyone around you.",
              "id": 214,
              "comments": [
                {
                  "score": 5,
                  "content": "Seriosuly. My cousin would be like “let’s go to the city!” Or “let’s go shopping” like… you don’t have a license sooooo how are we getting there. Because I refuse to drive all the time.",
                  "id": 215,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "refusing to drive or learn to drive - when capable of doing so - would absolutely be a dealbreaker for me. it puts sooo much extra burden on the partner that does drive. sharing that burden is part of having a balanced relationship where each person carries their own weight. i’m not just talking about road trips or errands or the possibility of having multiple kids, what if there’s an emergency? \n\ndriving is a basic life skill. it’s like refusing to learn to do laundry. completely unacceptable imo. i couldn’t take on a partner like that. \n\nand the nearly $500 spent on uber JUST to go back and forth from work (not counting all other times uber is called) is an idiotic and irresponsible waste of money. that’s more than most people’s car payments + insurance + gas. but cars are too expensive? lol \n\nYTA, /u/throwawaydrivingl7",
          "id": 216,
          "comments": [
            {
              "score": 7,
              "content": "My husband started to learn to drive just after we began going out. I lived a 20min drive or a 1hr bus journey away, and he didn't think it was fair for it always be me coming to him. \n\nIt showed me he was considerate, serious about the relationship and also independent. It's helped over the years to split driving on trips and car pool to work etc, it would be a huge ball ache, if he couldn't get around on his own.",
              "id": 217,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "I agree with the ESH here, but the positive side is that this issue of driving has highlighted the fact that neither of you know how to read each other’s sign and, in practical terms- y’all don’t know how to take a hint. More than driving issues, it’s time to solve communication issues.",
          "id": 218,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3391,
      "content": "YTA- just because you have a license doesn't mean you have to own a car.  She is CLEARLY telling you that your unwillingness to drive isn't something she is going to live with much longer.\n\nAnd NO she doesn't need to drive your lazy butt anywhere. She is tired of being your personal driver. She isnt the immature one here.",
      "id": 219,
      "comments": [
        {
          "score": 143,
          "content": ">isn't something she is going to live with much longer.\n\nNo worry for him, he will go back to a new naïve 18 years old.",
          "id": 220,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2013,
      "content": "YTA learn how to drive, you never know what will happen in the future - maybe there's an emergency where you need to drive, maybe the two of you go on a trip to an area where uber service and public transport is limited (is she meant to drive 100% of the time?), maybe you both fall on hard times and catching an uber is not financially viable anymore and it would be cheaper to have a car, etc etc. Regardless, whether you ever have need to do it or not, driving is an extremely valuable skill to have.\n\nIt was heavy handed to give as a birthday gift, I agree, but it wasn't thoughtless, and I disagree that it was a bad gift because it's something that you could use that you wouldn't have given to yourself",
      "id": 221,
      "comments": [
        {
          "score": 844,
          "content": "My brother played this \"I don't want to learn to drive\" bullshit with his ex-wife. \n\nTurned out he just never wanted to be the designated driver. \n\nHe's a meth addict now.",
          "id": 222,
          "comments": [
            {
              "score": 196,
              "content": "That was not the turn I was expecting this comment to take. Woah!",
              "id": 223,
              "comments": [
                {
                  "score": 11,
                  "content": "Err yeah I need this person to break it down to me what happened in between wanting to be driven places and then somehow becoming addicted to meth whaaat 💀",
                  "id": 224,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "I wonder if OP and his girlfriend want children in the future. You aren’t going to bring a car seat in an Uber to the doctor, school, to the grocer. If the kid fell on the playground and bonked their head, OP couldn’t help. She’d literally be a single mother to two children (OP and baby). Why would anyone choose that future for themselves?",
          "id": 225,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "> maybe you both fall on hard times and catching an uber is not financially viable anymore and it would be cheaper to have a car\n\nThis is what gets me. He's trying to make it out like paying $20 for uber everyday is somehow less expensive than buying a used car. YTA, op.",
          "id": 226,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "I just don't understand driving is literally freedom.  Who would want to at least know how to pull out of their own neighborhood? 😒",
          "id": 227,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1674,
      "content": "YTA. You not driving is putting more work on her. This was her not very graceful attempt to fix that situation. But basically even if you don't take the driving lessons you need to stop depending on her for rides.\n\n>she said that she’s tired of always being the driver and likes to be the passenger sometimes, but to me it sounds like she gave me a gift that she wants. Because if she hates being the driver so much, I suggested that I could get lessons for her birthday, not mine, and that upset her even more.\n\nYou are not doing her a favor by assuming your half of a household role. It's not a gift to her, it's you pulling your own weight in the relationship. If you don't want to drive, you need to be covering Ubers for both of you for some of these trips, not expecting her to drive.",
      "id": 228,
      "comments": [
        {
          "score": 471,
          "content": "That’s exactly what I was gonna say. If I were OP’s girlfriend I would just stop driving him. Anytime he wants to “tag along” tell him he needs to call an Uber for the both of us then. That shit would stop SO fast cause he clearly doesn’t see how much of a burden he puts on her to run all of hers and his errands. OP is TA",
          "id": 229,
          "comments": [
            {
              "score": 83,
              "content": "Or charge him for the ride! Since he’s benefitting from the car, he should be chipping in for car insurance, gas and wear and tear.",
              "id": 230,
              "comments": [
                {
                  "score": 28,
                  "content": "He should at the *bare* minimum be paying for gas some, if not half, of the time.",
                  "id": 231,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "OP stated that he never really asks for rides, just tags along, so in his mind, he probably thinks he shouldn't have to help pay for anything because \"sHe WaS gOiNg ThErE aNyWay.\"",
                  "id": 232,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 174,
          "content": "And pay for half of insurance, gas and car maintenance. I don’t believe he’s only getting rides to places she’s already going. He’s benefited from her car he should share the responsibility.",
          "id": 233,
          "comments": [
            {
              "score": 60,
              "content": "Some of the places she's already going are places she has to go to because he doesn't drive, like to do groceries and the like. He doesn't drive, so the responsibility to do groceries always falls on her and he \"tags along\"",
              "id": 234,
              "comments": [
                {
                  "score": 21,
                  "content": "This as well! And she probably doesn’t even get to run out and get groceries whenever she wants because she has to wait for him to come with her, because he’ll probably complain if she goes without him",
                  "id": 235,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 102,
          "content": "“happy bday. Your gift is I will do SOME of my own laundry and cooking.. Even though it’s easy for you to chuck my laundry in with yours when you’re running a load anyway and you’re already cooking your food so it’s simple to just make a little more for me...”\n\nShe would be having to do every task solo if she lived alone and ran her own household. Having a partner is meant to lesson the burden of both people, not just give one a free ride like they were a dependant/ minor child again.",
          "id": 236,
          "comments": [
            {
              "score": 7,
              "content": "She is better off single.\n\nThis guy isn't even a partner, he is a user and he knows it. The fact that she has let it go on this long isn't a great reflection on her either. He doesn't respect her, nor does she have any for herself. \n\nWhile it's funny in theory, the hypothetical scenario of her gifting him a card that he needs to do her half of the housework might as well have a cute little chore chart - complete with his favorite stickers to track progress! - to go along with it.",
              "id": 237,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Right! This dude needs to learn to take a hint she was trying to handle the situation tactfully without starting a fight and he threw a tantrum",
          "id": 238,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1217,
      "content": "INFO: how much do you financially compensate your girlfriend for driving you about?",
      "id": 239,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1160,
      "content": "ESH\n\nYes, that gift wasn’t really a gift for you, although she probably did see it as a step towards you becoming more independent, which is a positive thing.  You say you have already expressed to her that you’re not interested in driving, so clearly there was a selfish motivation on her part and she even admitted to that.\n\nHowever…..\n\n>So now she’s being immature and won’t drive me anywhere and tells me I can uber if I want to go somewhere, even if it’s somewhere she was going to go already. Like she went thrifting and to the grocery store without me (we always go together) and said if I really wanted to go that badly, I can uber. \n\n\nI don’t think it is immature to tell a perfectly capable adult to find their own transportation.\nYou claim multiple times in your post that you don’t need to drive, that it’s unnecessary, *and* you’re rejecting her gift so……I’m on her side in this one.\n\nSure, it’s not a nice move but she’s making the point that she’s tired of being your chauffeur.\n\nTo say that you hate the “gift” and ask her to request a refund of something that would obviously be nonrefundable, is going over the top.\nEspecially since you obviously feel entitled to tag along with her whenever she’s going somewhere or asking her to drive both of you to things you need to do, such as grocery shopping, movies and dinner, etc.\n\n\nHonestly, if you have no interest in learning to drive and sharing that responsibility with her for no real reason other than you just don’t want to do it, I think you suck more than her.",
      "id": 240,
      "comments": [
        {
          "score": 688,
          "content": "I'm betting he doesn't ever give her gas money or money towards maintenance. I'd tell him to call and uber too.",
          "id": 241,
          "comments": [
            {
              "score": 390,
              "content": "From his comments, that’s what I am getting too.\n\nHe just doesn’t acknowledge (or care) that not having his drivers license is creating extra expenses and also inconveniencing his girlfriend.",
              "id": 242,
              "comments": [
                {
                  "score": 199,
                  "content": "The whole “you were driving there anyway so why should I pitch in” logic makes me nuts. If two co-workers living in the same building catch a cab to work together, they split the cab. The fare doesn’t fall on the person that hailed the cab as the other person is now “tagging along.”",
                  "id": 243,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I couldnt articulate why that was pissing me off so much until i read your comment. I completely agree. The “tagging along” excuse only works if its somewhere shes going for herself and hes literally just tagging along, like if she went to get her hair done. You cant “tag along” on dates with you SO or shared household responsibilities like grocery shopping",
                      "id": 244,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 197,
              "content": "My (26f) fiancé (26m) of almost four years doesn't drive but he at least has the decency to pay half of gas, tax, and insurance. And he was the one who offered in the first place because he didn't think it was fair on me!\n\nHe's uncomfortable with the idea of learning to drive but has said he's going to learn anyway once our finances are better so he can at least drive my car if I need him to.\n\nHow is this not a normal thought for a human who's meant to be in love with their partner? 100% YTA!",
              "id": 245,
              "comments": [
                {
                  "score": 18,
                  "content": "He said he’s not gonna learn to drive till his finances are better but spends $100-$120 on Ubers every week",
                  "id": 246,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 230,
          "content": "I have to disagree with you saying “that gift wasn’t really a gift for you” \n\nIt was free driving lessons, a skill he can use for the rest of his life. That gift was priceless if you really think about it.",
          "id": 247,
          "comments": [
            {
              "score": 100,
              "content": "also he says he didn’t want to drive because of the costs and she just covered a huge expense by paying the lessons, she probably thought he was afraid of the cost",
              "id": 248,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "As the person who always has to drive in my relationship, it’s certainly draining. My partner doesn’t ask for rides either, but sometimes I just don’t feel like driving, especially if I’ve had a long work week. I have to though, especially if we want groceries or to run out to the store. It doesn’t seem like a big deal, but always having to drive can put strain in relationships. However, I’m willing to bet that this isn’t the only not so great thing that OP has done in his relationship.",
          "id": 249,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "He also originally said that the reason he doesn’t want a license is money. I can see her thinking that making the lessons free would be a great gift, then he just has to pay for the actual test/literal license\n\nEdit to add YTA OP.\n\nYou made it seem like the only thing stopping you was money and she removed that burden. stop being a dick",
          "id": 250,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "All of this, yes. Having to be the responsible party to get both people to and from places while running errands can be grating especially after years of doing it. Plus, I’m not sure about anyone here, but sometimes I do like to run errands on my own to take my time and just browse and would prefer to leave my partner at home. If I NEVER got that free time because I felt obligated to always take my partner who refuses to drive, I think I would be thinking of ways to convince him to drive before the 4 year mark too. Plus she gave him an expensive gift of driving lessons while he mentions the monetary reasons why he doesn’t drive. She could possibly be thinking she was helping take some of the money off his plate that he complains about.",
          "id": 251,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "> Immature\n\nThat part cracked me up. Hey Pot, have you met Kettle?\n\nHe's using his girlfriend like an appliance and she lets him. Now she's starting to push back and he feels like she is changing him? I'll be surprised if he possesses the ability to wipe his ass or find his ween without her supervision.",
          "id": 252,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}