{
  "post content": "I’ll admit I’m (M26) dealing with some heavy stuff right now. I was in an accident last December that killed my best friend &left me paralyzed from the waist down. This is a dramatic change in my life that I still struggle with, not being able to walk again, losing someone I love, dealing with survivors guilt and other emotional stuff that leaves me in a dark place.\n\nBefore this, I was never religious and neither is anyone in my family except my cousin. She’s tried for years to drag everyone to her church. \nIt feels like ever since this happened, she’s used my accident to prove God is great because there was a high possibility I wasn’t going to make it and he “saved me.” It’s all she talks about with the family.\n\nWhile dealing with all the physical and emotional trauma that comes with this, my cousin hasn’t stopped bothering me about going to church with her to thank god for this miracle, which still doesn’t feel like that to me but I’m trying to work that out in therapy.\n\nI’ve told her *many* times that’s not my belief and church is the last place I want to be.\n\nIt’s got worse now that the church services are online so she literally comes to my place so we can watch together. I ask her to leave and it takes a few times until she does. \n\nI reached my breaking point last week when again she insisted when we were all having breakfast. At the table she talked about God having a plan and how sometimes he makes things happen *mentions my accident* so we can open our hearts to him. \n\nSo I asked her, “you’re saying God’s plan was to almost have me killed and leave me in a wheelchair just so I could thank him for not killing me after all?” My cousin didn’t know how to answer that and I bitterly told her “no offense but *your* god sounds very toxic.”\nA few of my cousins thought it was funny but everyone else didn’t know how to react. Then we just changed the subject but she didn’t talk anymore after that.\n\nOfc I get the txt from her about how she was just trying to help and she deserves an apology for being so disrespectful about her religion. Everyone is kind of annoyed with her too and my mom says she doesn’t like the way she’s been using my accident either. My dad feels I did go too far and should’ve just kept my mouth shut because in her mind, she believes she is in fact helping me.\n\nI’m glad I at least have some peace since she’s not talking to me but she now she’s spreading word around that I insulted her when all she’s done at this point is “help” me through this period in my life. \n\nDon’t know if I was being a justifiable a-hole, complete a-hole or not one at all. Guess I’ll leave that to all of you",
  "id": 1,
  "comments": [
    {
      "score": 6007,
      "content": "NTA your cousin needs to stfu",
      "id": 2,
      "comments": [
        {
          "score": 1916,
          "content": "Exactly! I'm Christian and still this God of hers sounds extremely toxic. Well said OP, I think I would have been a lot less kind in your situation! You are following Jesus teachings better than your cousin.",
          "id": 3,
          "comments": [
            {
              "score": 2075,
              "content": "NTA. having religion is like having a penis, it's ok to have one but don't shove it down peoples throats.",
              "id": 4,
              "comments": [
                {
                  "score": 278,
                  "content": "how is this the 3rd time i am seeing this in a row?!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 463,
                      "content": "God is trying to tell you something",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "God wouldn’t give you something you can’t handle ?",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Having religion is like having a penis, it's ok to have one but don't shove it down peoples throats.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 0,
                      "content": "The Baader-Meinhof phenomenon",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": ">having religion is like having a penis, it's ok to have one but don't shove it down peoples throats\n\nYou deserve an award for this analogy 😂 But I'm broke so have this instead: 🏆",
                  "id": 10,
                  "comments": [
                    {
                      "score": 2,
                      "content": "you should read my comments. i say i have seen this anology 3 times in a row and the dick joke just poured in",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Unless they ask.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Unless you have permission",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Unless they ask you to!",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Unless they ask for that",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "the full analogy that i have heard:\n\nReligion is like having a penis.  \nIt's okay to have one  \nIt's okay to be proud of it  \nbut dont take it out and wave it around in public  \nand dont shove it down people's throats",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 70,
              "content": ">I'm Christian and still this God of hers sounds extremely toxic\n\nYou haven't read your own bible then.  Christian God has always been a massive asshole.",
              "id": 17,
              "comments": [
                {
                  "score": 35,
                  "content": "Talk to some reform Jews, because we also ascribe to the Hebrew Bible, but we don’t believe in an intercessionary God and treat the Bible stories as a shared mythology. God didn’t actually part the Red Sea or flood the world and kill everyone except Noah’s family. It’s just an object lesson about how making a covenant with god leads to redemption.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Depends on which reformed Jews you talk to. My mom's side of the family are relatively secular Jews, and my dad's side are Christians. My mom's side of the family always viewed the \"religious\" parts as early people trying to explain a world they didn't understand, and kosher laws as part of that reasoning.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "I’m a cristian as well and see stuff like this it’s cray right",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Usually the ones that speak the loudest about Christianity are the ones that don't truly live a Christian lifestyle at all.",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "She’s definitely one of the Christians who quotes Jeremiah 29:12 and thinks it means Gods going to give them the big house filled with children where they live in bliss forever.  instead of the plan being Jesus and not about our idea of perfection.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 223,
          "content": "My view on religion is everyone has a right to one, but no one has the right to shove it down others’ throats, peer pressure, or gaslight them.  My go to lines for those making me uncomfortable, usually those ever present hardcore Christians/Catholics/JWs who pray Jesus be with me or my soul or whatever, are:\n\n1. “Everyone has their own religion and we all think we’re correct but no one has concrete proof of anything, so stop forcing your religion on me.” \n\n2. “What if I worshipped Satan and every time we disagreed, I said ‘I pray Satan be with you’ or ‘I pray Satan finds your soul before you die’?  Would you be creeped out?  Would that make you uncomfortable?  Exactly, so stop making me uncomfortable.  It’s that easy.” \n\n3. “Does telling people they’re going to hell ever really work for you?  Would you convert to a religion that said you would spend eternity in a pit of fire and pain?  ‘Cause that’s just soooo enticing.  Sign me up for the eternal fire pit of doom! Satan’s got nothing on me, bro, let’s go!” \n\nLol.  Not the best, but fairly effective in getting people to leave me alone and much more effective than my middle school comeback to my friend—turned super Christian judge-y conservative girl in school—who tried to hand me a Bible everyday because my soul needed saving.  My crime?  Putting BCE (before common era) instead of BC (before Christ) in our history project.  My response?  “I don’t need to read anything you give me, especially not that whale blubber!”  Yes, middle school me called the Bible whale blubber...",
          "id": 23,
          "comments": [
            {
              "score": 55,
              "content": "Damn, those are really good responses, though!\n\nI finally got the local JWs to leave me alone by telling them I'm a witch. My mom happened to be over, and when they asked how she felt (they know her and know that she's Catholic), she just said \"Oh, I was concerned at first, but I trust them. We even celebrate \\[sabbats\\] together.\"\n\nThe look on their faces was priceless. They were obviously shocked that she was okay with it, since she's such a devout Catholic. XD\n\nI have to admit, part of my amusement comes from the fact that I myself had a huge Jesus Freak phase in high school, so I know all the arguments and moves Fundamentalists use.",
              "id": 24,
              "comments": [
                {
                  "score": 28,
                  "content": "I remember going to a Catholic Church’s library to research about the Dark Ages and Inquisition for a paper when I was in HS. The priest who accompanied me and my friends made a point to say I would have been burned as a witch for my ideas. I never felt more complimented in my life, knowing that I wouldn’t have been accepted by those people... that was the nail in the coffin of my religious involvement. Thank God. Lol.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "You all are WAY nicer than me. I've said on more than a few occasions \"if your god is real, he sounds like an asshole so why the fuck would I worship him?\" Mind you - I dont jump to this. I prefer wearing all my witch shit and freaking out JWs and mormons but I have some extremely religious family members who I have no tolerance for (namely my dad) and that's how I get them to shut up when they're trying to push their faith on me.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Whenever someone tells me I'm going to hell I say \"someone has to run the place!\" The reactions are GREAT",
              "id": 27,
              "comments": [
                {
                  "score": 2,
                  "content": "I use a variation of that for years already :\n\n\n\" yeah, i know.. the current dude is just there to keep my throne warm until i return \"",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I actually love Satanism, but a lot of people think that means I worship the devil or whatever and I’m sure you know that’s exactly the opposite of what Satanism means. Anyway, when they come at me with the pray for you and shit, I often tell them I’m a proud satan worshipper and say shit like praise satan to like fluff their feathers sometimes. \n“Get behind me satan” is one of my favorite responses I’ve gotten back from them. \nI usually only get rude like that with people who don’t quit or tell me I’m going to be on my knees begging for his grace one day and it just disturbs me how they talk to me sometimes so I do exactly what you said in #2, and they really don’t know how to handle it most times lol it makes them extremely uncomfortable. \nOh and if you start out with just saying the rules in the satanic bible but not saying that’s where it comes from to them, some believe you’re talking about the Bible and then I’ll be like nah, Satanism. Did that to my dad and he just went silent.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "AGREE!",
          "id": 30,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "Hard agree. Oh, the god left him crippled and killed his best friend? He really did him a solid one, huh? NTA",
          "id": 31,
          "comments": [
            {
              "score": 9,
              "content": "Too true. She may need an invisible friend to tell her how to behave but she should be grateful he doesn't blame same invisible friend for sucking at their job.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": ">she believes she is in fact helping me.\n\nThe Holy Inquisition probably believed they were helping too. But seriously, don't know if it's her case but many religious people (not all) want others to follow the same beliefs to validate that they are doing the right thing by having that faith. NTA.",
          "id": 33,
          "comments": [
            {
              "score": 7,
              "content": "Oh, they absolutely did believe that. They thought they were doing people a favor by burning them alive - purifying their souls!\n\nLord save us from the enthusiasm of your followers.",
              "id": 34,
              "comments": [
                {
                  "score": 2,
                  "content": "Never confuse the faith with the supposedly faithful. - R. K. Milholland\n\nP.S.: I'm not religious, but I know when someone isn't representing their faith.",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "This. It's like telling someone with depression they should just think happy thoughts/eat better/work out. Those assholes think they're helping, and some people do improve a bit after doing so (much like some people find comfort in religion), but its fucking exhausting to hear that all the time, and have your actual struggles minimized.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Hard agree, NTA !\n\nImagine using someone else's trauma in your quest to convert people.\n\nOP if you see this, I sincerely hope you're doing better and will have far more peace without your cousin incessantly spewing shite in your ear.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": ">your cousin needs to stfu\n\nAmen",
          "id": 38,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Exactly. And OP deserves an apology FROM HER for constantly using his horrible, painful accident to try to force her beliefs down his throat.",
          "id": 39,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2263,
      "content": "NTA. Your cousin is being pushy and insensitive, and you don't need to deal with her harassment on top of everything else. You tried to tell her nicely and she kept pushing.\n\nWishing you peace and healing.",
      "id": 40,
      "comments": [
        {
          "score": 552,
          "content": "Exactly. \u0010She was taking advantage of your misfortune to try to push her religion on you. She literally thought you would be more susceptible to her religion because your trouble would have weakened you. That's disgusting and she deserved to be checked *hard*. NTA.",
          "id": 41,
          "comments": [
            {
              "score": 38,
              "content": "I've had this exact same experience with a devout Christian (she knew very well that I've been an atheist for most of my teenage/adult years). I was going through a rough time and she just *swooped* in with her God and tried to shove it down my throat when I was open to the idea in a moment of weakness. It's absolutely disgusting. Joke's on her though, this, combined with all the shit I went through for being gay made me actively hostile towards religion in general ¯\\\\\\_(ツ)_/¯",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Unfortunately a lot of churches baldfacedly *teach* their parishioners to do this. I know, because I was in a church like that growing up and it's a big reason I left religion in my twenties.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Yup she thought she could guilt OP into being a believer",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -23,
              "content": "[deleted]",
              "id": 45,
              "comments": [
                {
                  "score": 65,
                  "content": "The problem with that is, if she really just wanted to help, she'd be glad to be told when it's not helping - if you want to help someone, you appreciate feedback on how to do it and not make things worse! I can understand feeling embarrassed and defensive at being told you're getting it wrong, but if she kept going after the first time she was told to knock it off, she's more interested in Being Right than in helping or being compassionate.",
                  "id": 46,
                  "comments": [
                    {
                      "score": -14,
                      "content": "[deleted]",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 89,
          "content": "Yep! This is another example of \"consent\"; One \"No\" should be enough.",
          "id": 48,
          "comments": [
            {
              "score": 3,
              "content": "Yes! She is absolutely allowed to feel like this helps. Just like op is allowed to say no thank you. If she isn't consenting to this religious barrage, its not ok. All op did was give her opinion, again. Just a bit unfiltered. Nta. Everyone gets opinions, nobody has to suffer anyone else's.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Are you kidding? Have you heard some fundies going on about how they want Jesus all up inside them?\n\nSounds like Jesus is about as good with consent as the priests with altar boys. Christians are the least concerned about consent. Ever seen them outside of Planned Parenthood telling women they are sluts and going to hell while they just want birth control?\n\nNah, there is no such thing as consent when it comes to saving souls right? /s",
              "id": 50,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Exactly. OP demonstrated a lot of patience by tolerating this so far and trying to firmly but civilly tell her to stop. It was still pretty damn civil to just coldly tell her that if a divine force really did paralyze OP and kill his friend just to make him grateful for his life, that’s messed up.",
          "id": 51,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Yep. Your reaction was completely reasonable. Your cousin obviously hadn't learned the lesson that using the tragedy of others to force your religion down their throat has consequences, and you helped her learn it. NTA",
          "id": 52,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1018,
      "content": "NTA\n\n> My dad feels I did go too far and should’ve just kept my mouth shut because in her mind, she believes she is in fact helping me. \n\nI am sure in Hitler's mind he's in fact helping all German people too. An extreme example I know, but you get the point.",
      "id": 53,
      "comments": [
        {
          "score": 264,
          "content": "[deleted]",
          "id": 54,
          "comments": [
            {
              "score": 75,
              "content": "A rule of acquisition, probably.",
              "id": 55,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 29,
              "content": "*Odo voice:* Quark!!",
              "id": 56,
              "comments": [
                {
                  "score": 18,
                  "content": "Rip odo",
                  "id": 57,
                  "comments": [
                    {
                      "score": 15,
                      "content": "All my homies miss Odo",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Stratch that. No one at all wants to think of themselves as nefarious. \nEveryone dreads having a \"are we the baddies?\" moment.",
              "id": 59,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 187,
          "content": "German actually has a saying roughly translating to \"the opposite of well done is well meant\"\n\nIt doesn't matter if I think that I'm doing everyone a favour, if the priest didn't want his incense replaced with marijuana then I can't expect any gratitude for it.",
          "id": 60,
          "comments": [
            {
              "score": 62,
              "content": ">incense replaced with marijuana\n\nSounds like a good time to me. I'll allow it.",
              "id": 61,
              "comments": [
                {
                  "score": 9,
                  "content": "I think it would only stink up the place but otherwise have no effect. At least it smells like vomit to me. OP - NTA. And no offense? Yes to all the offense. Helpful or not in her mind, what she is is insensitive at best.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "¿Por qué no los dos?",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Bible didn't say shit about pot. Changing \"and also with you\" to \"and with your spirit\" ain't gonna draw people in. Marijuana Midnight Mass? That might do it.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Nice phrase. There’s also, “the road to hell is paved with good intentions”",
              "id": 65,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "NTA. Exactly. It doesn’t matter if she thinks she’s doing the right thing. She isn’t and it was made that clear to her that it was not appreciated. Now she is being pushy and not respecting OPs wishes.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "But was Hitler helping the German people as much in his mind as God was helping OP's friend in his?\n\nBy the cousin's logic if we attribute OP being alive to God's grace then how can we not attribute the friend's death to anything other than God's wrath? \n\nSo WTF did the friend do that was so terrible in God's eyes cuz? Because you keep bringing it up.",
          "id": 67,
          "comments": [
            {
              "score": 0,
              "content": "Yeah, and what about Hitler not being accepted into art school? Was that god taking revenge on the Jews for killing him 1900 years before then?",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "OP is returning the favour by helping the cousin keep her mouth shut. Unlike cousin's pointless efforts, OP's efforts are showing results. \n\n\"See, it worked dad. Soon, she will start seeing the error of her ways. Don't discourage me. Let me help her.\"\nJk \n\nNTA OP",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "what's that saying about good intentions",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Honestly, I have my doubts about whether or not she really believes she is helping the OP. I think this is more for her sake than his. She's faced with a very graphic and personal example of the failings of believing in an omnipotent god - that the world is full of horrible, senseless tragedy. There is no way to honestly interpret an innocent person's death and OP's paralysis as a \"gift.\" It's a tragedy. One that he can likely overcome, but it's not something to thank her god for - that's completely ridiculous and insulting. Getting the OP to buy into her belief system in the face of this tragedy would help remove the crack of doubt that the accident created in her mind. \n\nNot that we need any more evidence here in 2020, but if there is a god, he or she does not give a shit about what happens down here. We're obviously on our own.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 483,
      "content": "Nta, if anything you didn't go far enough. Even after repeated times of saying no, kicking her out and not going to church and she still wanted to push the issue? You were a lot nicer than I would have been",
      "id": 72,
      "comments": [
        {
          "score": 18,
          "content": "Agreed",
          "id": 73,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 372,
      "content": "NTA she was trying to use your tragedy to get you to join her religion and that is some manipulative shit",
      "id": 74,
      "comments": [
        {
          "score": 77,
          "content": "A lot of religions and cults (and everything in between) try to recruit people at their lowest moments so that they can mold them into whatever shape they like. Why do you think these religions look for drug addicts and prisoners?",
          "id": 75,
          "comments": [
            {
              "score": 16,
              "content": "I’ve literally been told my disease is my fault because I refuse to let Jesus in my life. These people can be so manipulative it’s scary.",
              "id": 76,
              "comments": [
                {
                  "score": 13,
                  "content": "That's actually part of why I stayed religious for so long in my youth. I was raised Christian, and thought that God would somehow cure my depression. It wasn't until I saw an actual psychiatrist that things changed, and I realized the bullshit I'd been spoon-fed.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I’m sorry you had to deal with that, I’m glad you were able to get out of that mess though, and I hope you’re in a much better place now :)",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "It's sad, really. These people hit rock bottom and they look for anything and anyone that might help them out of it, blind to whatever the true intent is.\n\n&#x200B;\n\nWould you like a Fresca?",
              "id": 79,
              "comments": [
                {
                  "score": 3,
                  "content": "Haha, nice The Boys reference -- and it's spot on.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "And missions to developing countries.  There are of course a few that go to actually help people.  Then there are the predatory assholes who make their help contingent on accepting their god.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 207,
      "content": "NTA if you made it clear that you weren't interested in going to church.\n\nAlso, kinda odd from some internet stranger but I'm sorry for your loss :(",
      "id": 82,
      "comments": [
        {
          "score": 16,
          "content": "Yeah I agree this is just... Yikes, that pushing and pushing OP needs to hold up as I go get a verse on smth about this matter.\n\nAlso happy mutual cake day!",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "happy cake day!",
          "id": 84,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 178,
      "content": "[deleted]",
      "id": 85,
      "comments": [
        {
          "score": 85,
          "content": "This. The cousin asking for an apology for op being \"disrespectful\" of her religion despite being disrespectful towards NOT ONLY op's trauma, but also their boundaries and own beliefs is soooo hypocritical. NTA ×100",
          "id": 86,
          "comments": [
            {
              "score": 16,
              "content": "That’s what I was thinking! How INSULTING to say that this tragic thing that happened to you is actually a miracle and you should be thankful. Like the fu**? I agree with a lot of people on here OP, NTA and I would’ve told her off waaaay worse long before this.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 175,
      "content": "Nta\n\nTell her that you \"insulting\" her is part of God's plan to challenge her Christian values",
      "id": 88,
      "comments": [
        {
          "score": 172,
          "content": "I told my devout relatives that God sent me, an Atheist, to test their faith in how they treat me, as God says to love your neighbor as yourself.",
          "id": 89,
          "comments": [
            {
              "score": 37,
              "content": "How’d that go?",
              "id": 90,
              "comments": [
                {
                  "score": 95,
                  "content": "One aunt actually agreed with me, the rest, well.....",
                  "id": 91,
                  "comments": [
                    {
                      "score": 21,
                      "content": "I guess they’re failing!",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "Pagan here ! I might nick that from you to use in the future with family and acquaintances.",
              "id": 93,
              "comments": [
                {
                  "score": 6,
                  "content": "Be warned, as a fellow pagan, this sort of talk sometimes convinces them that they’re not proselytizing hard enough, because if they were doing what god wanted then surely you’d convert.",
                  "id": 94,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "This is glorious.  Thankfully, I haven't had anyone really get upset about me being an atheist (surprising living in Texas), but I'm going to file this away for the time that it's needed.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "As a Christian, realistically, that probably was the case. Jesus preached a lot abut come as you are and to not judge others. I fucking love that response.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Oh, I like you.",
          "id": 97,
          "comments": [
            {
              "score": 23,
              "content": "You have good taste\nI'm adorable",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 122,
      "content": "NTA. You told her to knock it off. She didn't. At that point she's basically asking to hear your opinion. Which you shared",
      "id": 99,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 95,
      "content": "NTA. \n\nShe not trying to help, she's trying to prey on your vulnerability to get you into her cult. She wants to feel virtuous because she led you to the light.\n\nThe meaning of your suffering is for you to determine. I'm not a Christian, but I've known a few who I truly respected, and none of them would say that.",
      "id": 100,
      "comments": [
        {
          "score": 11,
          "content": "[deleted]",
          "id": 101,
          "comments": [
            {
              "score": 18,
              "content": "I mean it is true though, that is how they grow. Prey on the weak, lost, and too young to know better.",
              "id": 102,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}