{
  "post content": "\n\n\nI [F32] I met this wonderful man 'Philip\" [M36] 2 years ago. We got married 4 months ago. For context, I have a 10 yo son \"Billy\" from my previous relationship and my ex isn't in the picture.\n\n\nI have to admit that Philip's relationship with my family isn't so great. They would disagree on a lot of things. For example, he had an argument with my dad when he said that he was keeping their grandson away from them but Philip stated he wasn't and that he couldn't visit with Billy because he had work (I was sick at the time).\n\n\nThe latest argument was what made things worse. My mom and sister were discussing natural remedies (they're into this stuff) for my niece and Philip (he's a pediatrician) called both of them \"ignorant\" for not using meds instead which caused a huge argument and Philip being no longer welcome at my parents house.\n\n\nNow they'd sent me and Billy an invitation for Christmas but did not include Philip which, I expected given how strained their relationship has become. I called my mom to confirm that I'll attend but the minute Philip found out, he went off saying he could not believe I was fine with my family excluding him and then agree to go and leave him behind. I told him it's their celebration and I don't get to decide their guestlist for them. And also, I'm not leaving him behind because we did not have any plans for Christmas. He said he thought that we'd \"automatically\" celebrate together the 3 of us but now I'm taking Billy away from him as well. I thought that was a bit melodramatic because it's literally just few hours at my parents home but he insisted it was about principle and respect. We had a big argument and I said that he basically alienated himself by continually picking arguments with my family, but he started ranting saying it wasn't about the fact that they didn't invite him, but the fact that I was willing to let him spend Christmas alone without me and Billy.\n\n\nWe went back and forth on the issue but do not seem to reach a solution. My parents are used to spending every major holiday with Billy. So you can see how much pressure I'm getting from both sides here.",
  "id": 1,
  "comments": [
    {
      "score": 54503,
      "content": "yta\n\nhes your husband and he has done nothing wrong\n\n1 your dad picked a fight because he had to work and you didnt defend him\n\n2 you are encouraging your mum to be an idiot and not be knowledgeable on medications and wanting to do natural healing and when your husband as a medical professional stated the facts you let them be terrible to him\n\n&#x200B;\n\nyou think its okay to leave your husband alone on Christmas because they are being horrible to him and id be upset to you are not doing anything to defend him when he has done nothing wrong\n\n&#x200B;\n\nyou taking there side and in doing so shows you dont care for your husband\n\nkeep this up and he will leave\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nedit\n\nholly shit this blew up\n\nthank you for the awards guys\n\nlove seeing all the comments",
      "id": 2,
      "comments": [
        {
          "score": 37112,
          "content": "Maybe mum can calm the situation down with some lavender oil",
          "id": 3,
          "comments": [
            {
              "score": 6737,
              "content": "And now my drink is wasted!",
              "id": 4,
              "comments": [
                {
                  "score": 4045,
                  "content": "Don't worry, I'm sure OP's mum can spare one of her herbal brews for you",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3788,
                      "content": "I love herbal healing, it connects me to my roots. I also have epilepsy and NEED prescription meds!!! Both are not mutually exclusive but some people think they have to be?",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 130,
                      "content": "😂",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2383,
              "content": "OP’s next post will ask if she’s the AH if she skips her son’s vaccinations because her mom has some new essential oils.",
              "id": 8,
              "comments": [
                {
                  "score": 677,
                  "content": "Or am I the a hole for putting my son in the hospital because I let my mom try one her “ natural remedies” his illness now it’s worse",
                  "id": 9,
                  "comments": [
                    {
                      "score": 228,
                      "content": "Potatoes on the feet? Onions all over the house? Literally drinking some essential oils? I bet OP’s mom would be smitten with all of the above.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 496,
                  "content": "Was I the only one who automatically assumed that's what the the issue was between the mom/sister and the husband. That they were discussing \"natural\" vaccination alternatives and he wasn't having it?",
                  "id": 11,
                  "comments": [
                    {
                      "score": 623,
                      "content": "This is the impression I get as well. \n\n“Natural remedies” can mean a lot of things, like eating more ginger/garlic when you’ve got a cold or taking ginger ale/peppermint tea for an upset stomach. \n\nIn my experience at least, most doctors don’t get fussed over those sorts of things and will even encourage them (as long as whatever the problem is is mild and you’re willing to take medication when you need it, like paracetamol or antibiotics). But my immediate assumption was something related to vaccines or not using medication, which, yeah, he SHOULD be angry and upset about that.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 141,
              "content": "DoTerra, here we come!",
              "id": 13,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 100,
              "content": "Your comment is just so perfect.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 75,
              "content": "They can just go to [homeopathic a&e](https://youtu.be/HMGIbOGu8q0)",
              "id": 15,
              "comments": [
                {
                  "score": 11,
                  "content": "ha ha ha ha Thank you!  I have never seen that, it is perfect!",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "I'm going to jump on this and ask; I'm kinda picking up on low-key anti-vax vibes from the mother and sister there. I can't be the only one there, am i?",
              "id": 17,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Gonna need extra strength valerian to deal with this family.",
              "id": 18,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Actually, it's peppermint oil... it cures everything!",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2968,
          "content": "This! How can she not see that she’s choosing her family over him and leaving him alone on Christmas??? Your family sucks and I hope you come to your senses and start taking Philip’s side before your crap family is all you have left. YTA",
          "id": 20,
          "comments": [
            {
              "score": 3657,
              "content": "And not just on Christmas, but on their first Christmas as husband and wife -- they just got married four months ago!\n\nYTA, OP.",
              "id": 21,
              "comments": [
                {
                  "score": 1507,
                  "content": "lol 'we didn't have any plans for Christmas'? uhhh spend it with your husband and kid goes pretty much unsaid id think too.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 259,
                      "content": "seriously! why did she put “automatically” in quotes???",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 227,
                      "content": "\"Didn't have any plans for christmas\" means he has no other family, and OP's family is trying to alienate him from his new family. Wife is just rubbing it in. \"While you don't have anyone to see, so im going to leave you even more alone on a family centered holiday.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 88,
                      "content": "‘No plans for Christmas’ is my favorite type of Christmas. It means my husband and I can sleep in (no kids), stay in pajamas all day and just relax together. No hectic traveling, juggling gifts to and from the car, cooking big meals, etc.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yup. First priority should be family for the holidays and guess she’s fine without him. And then to tell him it’s his fault.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 117,
                  "content": "That was my thought too! Like WTF.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Poor guy, he can do so much better than someone who not only doesn't stand by him but call him \"melodramatic\". And poor Billy, thanks to his mother's foolishness he's probably going back to be raised by a single mom soon.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "This, 100% this. \n\nAlso, anyone notice she came here for judgement and hasn't answered any questions or comments- she can't accept that she's TA\n\nOP, YTA",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Tbf it sounds like it'll be their last Christmas as husband and wife",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Oh wow. I missed that it was their first Christmas together. OP probably won't have to worry about the same argument next year after her bs.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1462,
              "content": "Can I just quickly raise my hand and ask what kind of fuckin family *sends written invitations for Christmas*?! And if a person isn't specifically mentioned in the invitation, they're not welcome, like they have a bouncer at the door checking the cards? \n\nMaybe my family is weird, but isn't that just a quick mention in a phone call of what time the food will be ready?",
              "id": 32,
              "comments": [
                {
                  "score": 361,
                  "content": "Right!!! We get a phone call from the matriarchs letting us know whose house and what time. Written invitations would be a totally alien idea for my family.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 245,
                      "content": "My family has a group chat, we're discussing pie flavors as I type this.",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "My family makes Facebook events",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "We don't even get a call anymore lol. It's a group text at this point.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Phone call? We get a text!",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "I think that's exactly why they sent a written invitation. It's their passive-aggressive way of driving home the point that only OP and Billy are invited and Phillip is excluded.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Great question. We just get a phone call. Not even all of us. It would usually be the parents then they’d tell us as adults. And it was assumed that boyfriends/husbands and girlfriends/wives were invited",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I thought it was probably an email, but now I’m picturing engraved invitations with a “save the date” and and RSVP. Which is hilarious.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Our family used to rotate hosting duties, so I think all the women basically made a series of phone calls to determine whose turn it was (or who really wanted or had capacity to host) and what everybody was going to bring.  I always kinda liked that these things were determined as a collective.  Not…whatever these people have going on.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "My sister literally texted me last night to see what we're doing for Thanksgiving 😂. We had no plans so now the kids and I will be going to her house about 2hrs away. My husband has to work so he's not going, but we're doing Friendsgiving with his sister tomorrow.",
                  "id": 42,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "In my extended family you don't need invitations, not even a call, just show up at anytime during Christmas and there will be a seat and food for you. Many Christmases ago we used to do a Christmas tour visiting all my uncle's and aunts from my father and mother's sides, we eat a lot... \n\nSadly since then a lot of them passed away and family tours have gotten shorter because those large family gatherings are not so common now, but still we do a couple visits each Christmas ⛄",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": ">And if a person isn't specifically mentioned in the invitation, they're not welcome, like they have a bouncer at the door checking the cards?\n\nNahh.. 99 % of the time, as long as the carriages check out, the manservants will just let them in.",
                  "id": 44,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 764,
              "content": "This! YTA OP. He is not melodramatic AT ALL.Your husband has done nothing wrong. He is right in his opinions. If that were me I won't accept that invitation, either invite my husband or we don't go at all. You literally chose to spend time with your crappy family who have no respect towards your husband than being with him. He is your family too.",
              "id": 45,
              "comments": [
                {
                  "score": 300,
                  "content": "They hate him because he’s a paediatrician so he believes in science.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 120,
                      "content": "They hate him because he doesn’t jump when they tell him too. They can’t control him and he speaks his mind. He doesn’t let them bully him.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "How DARE HE use medical science to save kids lives!! Ugh. The nerve.",
                      "id": 48,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "OP's husband has probably seen some heartbreaking results from anti-vax parenting, since he's a pediatrician.  Kids dying or needing nursing home care for life after contracting illnesses kids shouldn't get anymore.  YTA.  The family you grew up in isn't cute or harmless.  They might be dangerous, and are at least closed-minded, stubborn, and unwelcoming to your new family.  If you go to Christmas at their house, don't be surprised to come home to divorce papers.",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "Also what kind FiL thinks his doctor son should take time off from seeing his patients to bring the grandson over?\n\nOp, mega YTA for so many reasons. Why’d you even get married. Release Philip from this misery so he can have a real family.",
                      "id": 50,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "They hate him because he sees through their con artist quackery.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Seriously if my SO abandoned me on Christmas to sit alone at the house all day I'd be absolutely crushed. Poor guy.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 764,
              "content": "Is it just me, or does OP's post read like a between the lines explanation for why they have an ex who is not in the picture?",
              "id": 53,
              "comments": [
                {
                  "score": 311,
                  "content": "Literally my first thought was “I think I know why the ex is no longer in the picture.”",
                  "id": 54,
                  "comments": [
                    {
                      "score": 79,
                      "content": "Pretty soon Philip will not be in the picture either. Who wants a marriage like this!?!\n\nYou are either a team or your not.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "He listened to the inlaws and died of whooping cough",
                      "id": 56,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "Yepp. I literally get the sense her parents were probably overbearing raising her. Now they try to control her relationships through manipulation & pulling emotional strings. OP is too far out of touch with reality to see her parents are the problem. \n\nEx dodged a bullet. Let's hope Philip doesn't put up with this BS too much longer either. OP needs to be single until she understands what a healthy marriage looks like.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "pretty much what i thought.  dude needs to get out of there for his own sake.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 328,
              "content": "Even the definition of family in OP's post is part of the problem. She's not choosing her family over him - she's choosing her parents over her family.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 185,
              "content": "These people tend to lack self awareness.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 69,
              "content": "On their first Christmas! What the hell!",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "That's probably why the son's father isn't in the picture anymore. He got tired of being left behind for her family.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Look, if Philip wanted to celebrate Christmas with her he should have sent her a paper invitation so she'd know that he *had plans to spend a holiday with his wife.*",
              "id": 63,
              "comments": [
                {
                  "score": 8,
                  "content": "How dare he “automatically” think that! /s",
                  "id": 64,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "And they’ve been married for FOUR months!!! It’s their first xmas as a married couple. Like!?! Of COURSE he would assume they’d be spending it together the three of them as a FAMILY. Cause that’s OP’s FAMILY now. My lord!",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1832,
          "content": "THIS! Not to mention the fact that the op got the invitation and just accepted it, without even telling the husband that she was invited, \"he had to find out\"( op's words) that they are spending Christmas at her family\nwithout him. \n\nEven if is just a few hours away it's still leaving him behind, then going with the excuse that we didn't have anything planned.... So apparently it's ok for you to remain alone\n\nMajor YTA",
          "id": 66,
          "comments": [
            {
              "score": 1184,
              "content": "Right? \"We didn't have plans for Christmas\" okay well my husband and I didn't have plans for Christmas until last week and I'd still have been pissed if he made plans I wasn't invited to because we're *married* and it's *Christmas*.",
              "id": 67,
              "comments": [
                {
                  "score": 413,
                  "content": "Exactly. The fact that it’s Christmas is a plan in itself",
                  "id": 68,
                  "comments": [
                    {
                      "score": 316,
                      "content": "That's what I was thinking! Like, my husband and I haven't formally sat down and \"the plan for Christmas is to be together with our children and open presents and eat and lay around all day\" but that is, in fact, the plan. There is no way I would accept another invite without talking to him first, and no way in 7 hells I would even entertain an invite that didn't include him.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "You’d think that, but since “it’s just a few hours away” apparently it pretty much equals a family Sunday dinner. /s",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Yeah. “We didn’t have plans” = Christmas with the people IN YOUR HOUSE to most married families. What a weird excuse to try to justify her AH behavior.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "THIS!!! As terrible as it is the family is not the issue (which is what OP's husband has said - she has chosen to ignore him). It's that she just assumed that he would be fine to spend their 1st Christmas as a married couple apart without even a discussion.\n\nThis is not a marriage that will last",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Yeah. I’m not married but my SO has a rocky relationship with his family and he got invited to his mom’s for Christmas (spoilers: it went badly) but he ran it by me first. I didn’t want to go because of the stuff his family has done and I met his dad (that went VERY badly). Also whenever I have plans with family I run it by him too. Except the Christmas mentioned above we show up together or don’t go at all. Exceptions are made if we BOTH agree.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 520,
              "content": "And it’s their first Christmas! They’ve only been married 4-months.",
              "id": 74,
              "comments": [
                {
                  "score": 600,
                  "content": "[deleted]",
                  "id": 75,
                  "comments": [
                    {
                      "score": 231,
                      "content": "Yep. This would be a deal breaker for me. OP would come home to divorce papers",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "Probably did marry for $$ because she sure doesn’t care about him apparently.",
                      "id": 77,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "It’s only been four months, he can probably get it annulled if lucky. But that is definitely grounds for someone to divorce. That’s a YTA from me dawg.",
                      "id": 78,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "Omg I was thinking the same thing. Why wouldn’t she choose him? Why is she defending her mean family?",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "OP's husband must have a lot of \"buyer's regret\" at this point.  He's married into a family of loons.\n\nYTA, OP.  \n\nI think you married \"up\" too high for your ladder to reach.",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "I wonder if after 4 months is it a annulment or a divorce? Because if he is smart he will run fast and far! She didn’t just send up red flag he’ll she sent up lit them on fire and sent smoke signals with them. She showed him where her priorities are and just how much she respected him and her marriage.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 331,
              "content": ">Not to mention the fact that the op got the invitation and just accepted it, without even telling the husband that she was invited,\n\nAnd- OP wasn't even offended that her family excluded her husband! I hope her \"wonderful\" husband is planning divorce papers for a Christmas gift. OP doesn't seem to value her relationship at all. OP YTA",
              "id": 82,
              "comments": [
                {
                  "score": 20,
                  "content": "Husband should pick up some extra shifts over Christmas. Will pay for divorce attorney. He should just run",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I guess her husband should have sent her an invitation first. /s",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1820,
          "content": "If I were the husband I'd be singing \"It's beginning to look a lot like F*ck This\" while packing my sht.",
          "id": 85,
          "comments": [
            {
              "score": 141,
              "content": "Omg! I'll be imagining those words everytime I hear that song now😂",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "☝🏼UNDER RATED COMMENT OF THE THREAD RIGHT HERE!!!",
              "id": 87,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 27,
              "content": "> \"It's beginning to look a lot like F*ck This\"\n\nYou should change your flair to this. It's beautiful.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I totally just sang that out loud to see how it sounds, and it's perfect. Now, to make this into a sound to use on TikTok. Thanks!",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "It's beginning to look a lot like fuck this,\n\nI think it's time to go.\n\nPack up a duffel bag,\n\nSecure things at the bank,\n\nThen drive off into the snowwwww!",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I read it to the tune too 🤣",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Does anyone else hope that OP’s husband reads this, and comes back in a few months to give us all an update?",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "That’s a riot. Bravo!",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Yup. Hope husband finds a woman who believes in science and also wants to be a wife instead of only ever a daughter.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Gonna start singing that at work. Under my breath of course, just to be classy and all.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 915,
          "content": "Exactly what I was thinking, but you definitely worded it a lot nicer than I would've. \n\nPoor bloke can't get a break. He stepped up (unlike a lot of step parents on here) & looked after your son while you were ill & got berated for being unable to do more. I'd NEVER leave my husband alone on Christmas (& I hate Christmas) ESPECIALLY NOT OUR 1ST AS A MARRIED COUPLE 🤦‍♀️ \n\nIf you're not careful 'Mr Wonderful' will soon become 'Mr Gone'\n\nYTA",
          "id": 96,
          "comments": [
            {
              "score": 14,
              "content": "Husband and I went on vacation with my daughter about 3-4 years after we were married and her bff had bailed on her. \n\nLittle shit (29) had the audacity to refer to him as my boyfriend and treat me like crap. We had a huge blowout. \n\nTen years later and she still feels guilty as sin. Rightfully, so. She keeps asking if he will ever spend the night in her house. Probably not. Ever.\n\nWe visit. We just won't stay at her house, as a couple. \n\nMy fam has been horrible to my husband and I will *not* tolerate it! \n\nOP and her family are AH's.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 551,
          "content": "Watch the family asking for help when one of them gets seriously sick. Bet husband is good enough then.",
          "id": 98,
          "comments": [
            {
              "score": 270,
              "content": "They'll come expecting free medical advice because he's family.",
              "id": 99,
              "comments": [
                {
                  "score": 11,
                  "content": "He’s free to refuse service if he believes there’s risk of a bad outcome or malpractice (people are sue happy and wouldn’t put it past OP’s family). My dad was a surgeon and would refuse service for those two reasons. Usually a patient won’t be happy regardless of what he does so he says no or something medical means the outcome would be bad (too much scar tissue in the affected area will impact how it heals for example). OP’s husband will likely refuse service because OP’s family already hates him and would likely not be happy with the treatment outcome.",
                  "id": 100,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I have a good relationship with my family and I never offer medical advice. I say if you have an emergency, call 911 and go to the ER or urgent care. \n\nIm not going to reassure you without a physical exam, labs, or imaging. And I can’t do that over the phone or at home. \n\nFor managing chronic stuff and meds and such, sure. Emergencies. No.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "And money because he's a dooooctor, he makes enough money!",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 153,
              "content": "Or financial help. Ask me how I know.",
              "id": 103,
              "comments": [
                {
                  "score": 14,
                  "content": "How do you know?",
                  "id": 104,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 434,
          "content": "Yes! And to add, if your mom is used to seeing your son on holidays she needs to be civil with your husband!",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 405,
          "content": "This is you and your spouse's first Christmas together and you are leaving him to go spend Christmas with your family - huh?  Very disrespectful OP.  If my husband is not welcome, then I'm not going.",
          "id": 106,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 361,
          "content": "I’m also wondering why Billy’s biological dad is no longer in the picture at all. I bet her family ran him off too and are used to alienating OP from men. The sister may also be a single parent since she was discussing natural remedies for the niece with mom and not her own partner. It sounds like this family’s energy is negative and they want to isolate the daughters.",
          "id": 107,
          "comments": [
            {
              "score": 285,
              "content": "Don’t put it on on her family. OP herself is pretty good at making her partner feel unimportant and unsupported.",
              "id": 108,
              "comments": [
                {
                  "score": 31,
                  "content": "It doesn’t absolve OP, but I think such a family culture may be highly relevant to her learned behaviors",
                  "id": 109,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I absolutely agree. I meant to say, “don’t put it all on her family.” They played a role in this and in who she is.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": "Exactly.  I notice that in OP's post there is almost nothing about their **own** opinion, only the wants of their birth family and their spouse.  That just shouts out Emotional Abuse since childhood, that they don't see their own wants and needs and opinions are also important.",
              "id": 111,
              "comments": [
                {
                  "score": 8,
                  "content": "THIS.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 351,
          "content": "OP: “wonderful man”\n\nAlso OP: “fuck that guy”\n\nBilly and Philip aren’t AH, but your family and you sure are. \n\nDivorce incoming!",
          "id": 113,
          "comments": [
            {
              "score": 12,
              "content": "Seriously though. Like… do you even like your husband, OP? yikes.",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 22291,
      "content": "How are you not outraged that your parents left YOUR HUSBAND out of the invitation to spend Christmas with them?\n\nAnd how could you possibly contemplate leaving your husband alone at Christmas?  Do you actually \\*want\\* to be married to him?  You accepted an invitation which excludes him and you think this is reasonable?\n\nYTA.",
      "id": 115,
      "comments": [
        {
          "score": 5855,
          "content": "Looks like Ops getting divorce papers for xmas, I know I wouldn’t stand for this, I can’t imagine her husband will",
          "id": 116,
          "comments": [
            {
              "score": 1923,
              "content": "That's what I said too.\n\nI would wrap them nicely in Christmas paper for when she returns home from her wonderful family.",
              "id": 117,
              "comments": [
                {
                  "score": 699,
                  "content": "[removed]",
                  "id": 118,
                  "comments": [
                    {
                      "score": 181,
                      "content": "I would further put a package of ibuprofen to the parcel...you know, in case someone gets sick 🥺🤫",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Stone Heart! Love it! 🤣",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 340,
                  "content": "I might marry this person purely so I can do that....",
                  "id": 121,
                  "comments": [
                    {
                      "score": 8,
                      "content": "She’s going to be available",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 111,
                  "content": "That's certainly what she deserves",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Why wait? I’d have them sent for Christmas morning…",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 293,
              "content": "This is probably the wake up call OP's husband needed",
              "id": 125,
              "comments": [
                {
                  "score": 161,
                  "content": "He can definitely do better.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 77,
                  "content": "A pediatrician, hmm? We know she didn't marry him because she loves him and respects him. But he's pulling in doctor money. I wonder if he's thinking the same things?",
                  "id": 127,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Yeah, and I don't think OP realizes that if her husband divorces her this quickly, she's not entitled to alimony.",
                      "id": 128,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "It sucks, at least it happened now. He can portably get an annulment depending on where they are. He and that poor kid deserve better",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 117,
              "content": "This is an episode of EastEnders (UK soap) from the 1980s. Den gives his wife divorce papers for Xmas. It's brutal.",
              "id": 130,
              "comments": [
                {
                  "score": 17,
                  "content": "Lol, Den was such a piece of work.  I had forgotten about that.",
                  "id": 131,
                  "comments": [
                    {
                      "score": 11,
                      "content": "And the actor was a convicted murderer ..... fact.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "I want to see this now",
                  "id": 133,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 881,
          "content": "OP is soon going to have two exes that \"aren't in the picture.\"",
          "id": 134,
          "comments": [
            {
              "score": 338,
              "content": "It makes me wonder if she was married in the previous relationship. She certainly doesn't seem to understand how it works. And the way she's behaving, she won't need to for long...",
              "id": 135,
              "comments": [
                {
                  "score": 429,
                  "content": "She's only four months into this marriage, and her family has already given her an ultimatum: \"your husband or us.\" And she's too blind to even see it. Not hard to guess what went wrong in the previous relationship.",
                  "id": 136,
                  "comments": [
                    {
                      "score": 66,
                      "content": "Holy shit, this is their FIRST Christmas together??!  I missed that part, I assumed they'd been married for a while. She's merrily skipping their first Christmas as husband and wife.\n\nSomeone's getting divorce papers for the holidays.",
                      "id": 137,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 451,
          "content": "Also super sad you can’t imagine making a new family tradition with your husband and letting your idiot family experience the consequences of their behavior, your absence on a holiday. YTA.",
          "id": 138,
          "comments": [
            {
              "score": 21,
              "content": "Because she doesn't see her family as idiots, she's viewing the whole situation as consequences of her husband's behavior. He's being punished by her absence so he is forced to apologize and make nice with the family or be exiled forever.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 348,
          "content": "Yes, YTA. And your family are AHs too for excluding your husband. You don’t try to divide up a married couple during the holidays.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 205,
          "content": "Perhaps it's a marriage of (financial) convenience. They've only been married for 4 months and she's accepted Christmas plans without discussing it with her husband. If her husband isn't working that day then it's normal to assume they'd spend the day together as a family.",
          "id": 141,
          "comments": [
            {
              "score": 37,
              "content": "Maybe convenience for her. It sounds like her husband is fond of her kid.",
              "id": 142,
              "comments": [
                {
                  "score": 28,
                  "content": "Yeah, the argument suggests he's more emotionally invested in the family unit",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I do really think that she only wants him to pay for her kid's expenditures. OP, YTA, and an immense one at that.",
                  "id": 144,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "He possibly doesn't even know if he's working that day if schedules haven't been set as it's more than a month away.  Or he possibly took the day/week off to spend their first Christmas together as a family.  No one will ever know as she went ahead and made plans without him.  \n\nWow!  That might be the shortest honeymoon period in history.\n\nEdited to add, YTA",
              "id": 145,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": ">Do you actually *want* to be married to him?\n\nI asked the same thing! Calling him dramatic for being upset, and then acting like he was out of line for assuming it's a given that they'd spend Christmas together proves that she doesn't respect him, and honesty makes it seek like she doesn't even like him. Like, I can't imagine taking our kids to my parents house and making my husband spend Christmas alone.\n\nThe fights her family picks are stupid, and how she can't see that it's them doing it is crazy to me! I mean, if her dad wanted to see her son so bad, why couldn't he drive to their house and see him? Why did Phillip have to take the kid to them? Then to discuss natural remedies in front of a pediatrician? How much do you bet they knew his stance on it and did this in order to cause an argument? Here's to hoping Phillip gets her divorce papers for Christmas.",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "My ex and I managed to pull off an amicable divorce, which means we still do holidays together for the kids, including going to my parents’ house for a big Christmas dinner. I met my current partner several years ago, and he and my ex get along great. After he and I were serious, my parents decided that my ex couldn’t come to family Christmas anymore, which really upset the kids. I told my parents that if my ex wasn’t coming, I wasn’t coming. They realized the kids’ need to have their father there far outweighed their own discomfort with me bringing two guys to the party. If I can go to bat for my *ex*, you should certainly be going to bat for your *husband*. \n\nYTA",
          "id": 147,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Within 4 months of the marriage at that...",
          "id": 148,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14226,
      "content": "YTA. You're right - you don't get to decide their guestlist for them. However, you do get to decide whether or not to spend Christmas with your husband. Every married couple I know would \"automatically\" expect to spend Christmas together.",
      "id": 149,
      "comments": [
        {
          "score": 10260,
          "content": "YTA, OP.\n\nJust to be safe, I texted my spouse and asked if he wanted to hang out for Christmas with our kid. He's sitting on the couch next to me drinking coffee. He looked up and asked if I was reading the AITA about the terrible wife who was going to let her new doctor husband stay home alone at Christmas after he was banned from her family's for having opinions about idiot parents who host chicken pox parties and cure RSV by putting onions in socks. \n\nHe didn't answer my text about Christmas though, so I'm not sure what my plans are.",
          "id": 150,
          "comments": [
            {
              "score": 1992,
              "content": "This was terrific! I hope you can iron out your plans soon!",
              "id": 151,
              "comments": [
                {
                  "score": 1775,
                  "content": "Me too! I'm full of angst now, I've always just assumed I would spend Christmas with my husband. And it's worked out that way since our first post-engagement Christmas in 2001, with no planning. But now I'm worried he will make other plans because apparently I've been doing it wrong THIS WHOLE TIME.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 587,
                      "content": "You're killing me this morning!! Thank goodness I've already asked my partner of 36 years what are Christmas plans are. Of course, I did *start* with the assumption that we'd be together and went from there...",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 69,
                      "content": "How could you have been so foolish! Theres still time to rectify this!",
                      "id": 154,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "I’ve been with my husband about the same amount of time as you and I’m literally kicking myself for assuming I had to spend all my Christmases with him.  So much time wasted spending a major holiday with the person I chose to live my life with!  Ugh, I feel like such an idiot!",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "I too have assumed me and my partner will be spending Christmas together. He is hosting his family at our house which does make it a little awkward if I'm not invited....",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "We’re not married but I live with my boyfriend eight hours away from our family. Bet your butt we’re spending Thanksgiving *and* Christmas together. Our families can figure their shit out and then we’ll join but they’re not splitting us up lmao.",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 223,
              "content": "Sorry this is abusive, hes gaslighting and manipulating you by giving you the silent treatment PLEASE sign the divorce papers from the womans shelter! \n\n/s if it wasnt obvious lol, love how your husband k n e w, wish my mans would give up and get reddit already haha",
              "id": 158,
              "comments": [
                {
                  "score": 142,
                  "content": "He lurks, and he's going to find this hysterical when he comes across it.",
                  "id": 159,
                  "comments": [
                    {
                      "score": 97,
                      "content": "He lurks? Marinara flag, throw the whole man away, he's gaslighting your divorce papers \n\n😂",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "You mean he’s spying on you on Al Gore’s public internet?!?! Well now you’re definitely justified in spending Xmas doing a homeopathic ritual with people who hate him because he has a job.",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 92,
              "content": "I think I love you. Thank you for the lol.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "“Cure RSV by putting onions in socks” 😆😆😆",
              "id": 163,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Oh no!  If he didnt answer for christmas then thats a red flag!!!  Lol. Jk.",
              "id": 164,
              "comments": [
                {
                  "score": 11,
                  "content": "Marinara!",
                  "id": 165,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I literally scared the hell out of my dog when I busted out laughing at this.\n\nHope your husband gets back to you on those plans though",
              "id": 166,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "🤣",
              "id": 167,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "OMFG. 🤌🏻🤣",
              "id": 168,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 648,
          "content": "This. \n\n>I'm not leaving him behind because we had no plans for Christmas. He said that he'd assumed we'd \"automatically\" celebrate Christmas together the three of us\" \n\nNot sure why OP put automatically in quotations like it's some weird concept she's never heard of, but it's perfectly reasonable and normal for a spouse to expect to automatically spend Christmas with their spouse and stepchild without having to put plans in place!! \n\n\nOP, YTA. Sounds like your family have felt unnecessarily threatened by your husband being in the picture (as you said, they're used to having Billy at every holiday, so your husband threatens that) so they've made mountains out of molehills and pushed him out to the point where he's not even welcome to spend Christmas with his wife and stepchild. It's also sad that you think your family's right to spend Christmas with their extended family comes before your husbands right to spend Christmas with his IMMEDIATE family. \n\n\nYou ARE leaving your husband behind and you ARE forcing him to spend Christmas alone without you and Billy. Yes, he's not welcome at your parents, and that's your parents choice. But you don't HAVE to go to your parents and leave your husband alone on Christmas, that's YOUR choice.",
          "id": 169,
          "comments": [
            {
              "score": 36,
              "content": "I was married to a man where all the adult children and grandchildren stayed overnight at the parent's/grandparent's house on Christmas Eve and had Christmas morning there. After 5 years of this, I insisted we have Christmas morning at our own house, just us and our 2 children, and then join his family later that morning. He was so upset that night he threw a glass of water at me. Marriage didn't last long after that. No, OP really didn't get the concept of spending Christmas at home with her family (husband and son). She has probably spent every Christmas at her parent's house and sees this as normal. OP sounds like she has never cut the apron strings and her parents are fine with that.\nIf husband wants to stay married to her, he should stop wasting his breath arguing with her family, just stop!, and accept them as they are. BUT, he should also work on helping his wife cut the strings, even if that includes marriage counseling.",
              "id": 170,
              "comments": [
                {
                  "score": 28,
                  "content": "I had a screaming match with my SIL last year because I had the AUDACITY to say we wouldn't be coming to my husband's parents' house until after my kids' afternoon naps on Christmas Day. Apparently THEIR traditions were more important than my kids getting the naps they very much need.",
                  "id": 171,
                  "comments": [
                    {
                      "score": 7,
                      "content": "My husbands nan greeted us with a sarcastic \"happy new year\" a few years ago after we had the *audacity* to swap things over and go to his parents for tea, for the first time in about 10 years, instead of lunch and turned up what she considered a late time (which was actually when we'd normally be leaving there to go and see my family). I'm genuinely fucked off with her for that, amongst some other behaviour I saw when we went on a full family holiday with my husbands extended family a few weeks ago. I used to really like her but not anymore sadly....",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 446,
          "content": "This might end up being the greatest gift OP could give her husband. The clarity to see how terrible and selfish OP is. Sounds like in OP’s family the apple does fall far from the tree.",
          "id": 173,
          "comments": [
            {
              "score": 166,
              "content": "Man wonder why the last guy went MIA 👀",
              "id": 174,
              "comments": [
                {
                  "score": 35,
                  "content": "Maybe he went on vacation and OP didn't know if she was supposed to go with him?",
                  "id": 175,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 221,
          "content": "If I were OP's husband I wouldn't even want to expend Christmas with OP anymore (if she ever comes to her senses), this is just so disrespectful. \n\nI hope OP's husband run fast after this.\n\nYTA, OP.",
          "id": 176,
          "comments": [
            {
              "score": 12,
              "content": "I hope he runs right into my arms. Has she said what city she's in yet?",
              "id": 177,
              "comments": [
                {
                  "score": 7,
                  "content": "Agreed if he's in twin cities I'd happily let him join my small family Christmas!",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 117,
          "content": "I only know one married couple that didn't spend their first Christmas as newly weds together (because both sets of parents laid massive guilt trips on them) - that couple was divorced by the next time Christmas came around.",
          "id": 179,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "If my husband’s family pulled this trick, he’d be LC-NC to the hosts and anyone who agrees with them.  But he also respects me as his chosen partner soooo",
          "id": 180,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "This right here.  This is your HUSBAND.  I would never imagine just peacing out and leaving my husband alone at Christmas.",
          "id": 181,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10263,
      "content": "You are so the AH. Flip it around and have his family accuse you off not bringing their grandson around when you are working. Then try to lecture HIM on how to treat a kid when he's a freaking pediatrician!\n\nIf Billy gets sick, don't bother your husband with it. Have your sister and mom treat him with KFC's 11 herbs and spices cause you know, they know better 🤦🏻",
      "id": 182,
      "comments": [
        {
          "score": 2386,
          "content": "KFC's 11 herbs and spices?!!  Classic!!  😂😄🤣",
          "id": 183,
          "comments": [
            {
              "score": 442,
              "content": "Now I want chicken and it’s not even 6am…",
              "id": 184,
              "comments": [
                {
                  "score": 184,
                  "content": "Extra crispy??",
                  "id": 185,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Of course!",
                      "id": 186,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "KFC Jamaica...Barbecue 🍗",
                      "id": 187,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 120,
                  "content": "It is almost 2pm here. Take my time zone, I will take a nap until you are done,",
                  "id": 188,
                  "comments": [
                    {
                      "score": 49,
                      "content": "Thanks! I’ve always liked koalas",
                      "id": 189,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 112,
          "content": "I was gonna say oregano oil and garlic lol\n\n\n\n\nI had a friend who was into these ridiculous natural remedies and it was honestly embarrassing for her.",
          "id": 190,
          "comments": [
            {
              "score": 28,
              "content": "Oh and union slices in his socks (where do they get this nonsense?!)",
              "id": 191,
              "comments": [
                {
                  "score": 13,
                  "content": "Gosh, I had to go through that one as a kid. I'd go take a shower as soon as I woke up because the last thing I wanted was to go to school with my feet smelling like onion.",
                  "id": 192,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "The Middle Ages. Because you know they dealt so well with the plague.",
                  "id": 193,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Look dude. Say whatever you want to about this situation but DONT BRING KFC INTO THIS. In the states kfc sucks but in some other countries their chicken is awesome.",
          "id": 194,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "OMG not the herbs and the spices!🤣🤣",
          "id": 195,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5148,
      "content": "YTA 100%\n\nYou have no ground to stand on. You are supposed to stand up for your husband. He has been poorly treated by your parents, and shame on you for not standing by his side. Your parents exclusion of him at Christmas is an opportunity to spend a holiday as a new family. Not leave your husband all alone.",
      "id": 196,
      "comments": [
        {
          "score": 875,
          "content": "Exactly. I'm also curious how serious the child's illness is and if the family was trying to treat them with stuff like essential oils. The man is a pediatrician, and depending on the situation, he would be an AH not to say something/try to help a child in need.\n\nIf this couple has only been together for 2 years, this is only OP's second or third Christmas together, and OP is showing her husband that she will let her family mistreat him, and will ditch him without thought.",
          "id": 197,
          "comments": [
            {
              "score": 423,
              "content": "Others have said that Philip was rude to use the word “ignorant”,  but I bet Philip has seen the consequences of this kind of parent too often to suffer these fools politely.  \n\nInconsequential ignorance (not knowing that tomatoes are fruits) should be politely ignored or gently corrected. This is not that.",
              "id": 198,
              "comments": [
                {
                  "score": 291,
                  "content": "If Philip is a pediatrician, it’s likely he’s spent the last few years seeing children die or become disabled from Covid because their parents decided to treat them with horse paste and vitamin overdoses instead of bringing their children in for medical treatment when they couldn’t breathe. After seeing the effects of that firsthand, I’d be enraged at people who believe that crystals and fancy water can cure RSV.",
                  "id": 199,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Oh no not the alkaline water. Don’t even get me started on that nonsense.",
                      "id": 200,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "And all the patients he's seen with allergic reactions and dermatitis from essential oil use. We are not meant to have that concentrated stuff on or in us clearly. And kids have strong immediate reactions more often than adults do.",
                      "id": 201,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "If i knew how to give a reward for an exceptional good addition to a conversation/argumentation i would give it to you. I did give you an upvote thoug",
                  "id": 202,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I appreciate the upvote!  Don’t waste money on virtual awards.",
                      "id": 203,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3148,
      "content": "YTA. \n\nThe first ‘infraction’ has set the tone for the rest of their relationship. You were sick, your husband had to work and your parents said this meant he was keeping their grandson away?  You should have nipped this in the bud right there and then. Then for your hippy dippy sister and mother to talk about natural remedies in front of a pediatrician who, I guarantee, has seen kids DIE because of ‘natural remedy’ parents, I’m surprised he didn’t say more than that they were ignorant. \n\nWhen you marry, you become a team. Your husband has been banned, therefore you don’t go either. It’s that simple. You have shown your (in your own words) ‘wonderful man’ where he lies on your list of priorities. Get your head out of your ass, or you’ll be needing to find a divorce lawyer. I sure as hell wouldn’t put up with a spouse like you.",
      "id": 204,
      "comments": [
        {
          "score": 871,
          "content": "I agree. Most \"naturalists\" really are ignorant, YTA.",
          "id": 205,
          "comments": [
            {
              "score": 843,
              "content": "My dad was a fetal and pediatric radiologist - even 30 years ago when ‘natural remedies’ weren’t the in thing, he saw many fatalities from lack of proper medical care for babies. He finally had enough when the Andrew Wakefield bullshit happened. He was old enough to remember kids in iron lungs because of polio and now idiot parents were refusing vaccines because some quack made up a story to become famous. That was when he knew he was done. He cried over those kids.",
              "id": 206,
              "comments": [
                {
                  "score": 401,
                  "content": "These parents are also responsible for vaccine-preventable disease epidemics that make schools dangerous for disabled kids, disable more kids, and kill their younger siblings and older relatives.",
                  "id": 207,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 138,
                  "content": "He wanted to sell his own measles vaccine, there's pdfs of (his attempt) to get a patent for it. He wanted to drag competitors through the mud first.",
                  "id": 208,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "My kids are in their early twenties and were the only ones vaccinated amongst their peers. Kinda frightening. For me, it is a numbers game.\n\nOn the other hand, some natural remedies do have their uses. Homeopathic medicines are an ideal placebo - its pharmaceutical grade chalk lol",
                  "id": 209,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 601,
          "content": "Love that we get what the husband said \"ignorant\" but not what the mother / sister said. I'm a nurse and Ive had many of these conversations and it takes a LOT to lose your cool to get to that point - especially a pediatrician. \n\nYTA ten times over. I actually feel bad for your husband, as you seem to have zero empathy for him. This 'wonderful man' (as you say) deserves better.",
          "id": 210,
          "comments": [
            {
              "score": 197,
              "content": "Plus, \"ignorant\" literally just means uninformed or not knowing. We give it an undeserved negative connotation, but it's a fairly neutral word if you think about it.",
              "id": 211,
              "comments": [
                {
                  "score": 15,
                  "content": "Probably because it is accurate in being deservedly negative. If you're ignorant to the point that you endanger people with anti-vaxx or anti-science beliefs, you **deserve** to be shamed and viewed negatively.",
                  "id": 212,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "I mean…if someone called me ignorant rather than, for example, misinformed or mistaken, I would feel like they were being hostile. I don’t really think it’s a neutral word in practice.",
                  "id": 213,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Yeah when I was younger (I’m 50) it really was a neutral word. Over the last twenty years or so it has picked up a negative context and is now seen as some horrible insult. I had to train myself to say “uninformed” and “unaware” instead. It’s silly, I think, but language changes.",
                  "id": 214,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 192,
              "content": "Yeah…. An MD spouse who wants to spend Christmas with me?! Where do I get in line for that…?",
              "id": 215,
              "comments": [
                {
                  "score": 154,
                  "content": "OMG. thank you for that laugh. Not just an MD spouse...a pediatrician! Every pediatrician I've met is amazing with kids. The OP has an MD husband who is likely GREAT with kids AND has the holiday off from call AND wants to celebrate together! Wow...if I wasn't married, I'd slip into his DMs. LoL. \n\nHappy Holidays, u/BeatrixFarrand",
                  "id": 216,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Hahah - happily holidays to you as well, u/d0mini0nicco !! I mean for real. If I came home with that dude, my mom would throw a ticker tape parade!",
                      "id": 217,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "And the husband is a doctor, of course he can't just call off for his in-laws' convenience!",
          "id": 218,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2883,
      "content": "YTA to me… \n\nThis will be your first Xmas as a married couple and officially Phillip’s first with the family- that is to say you and Billy. How is it ok to ignore that? That Phillips first Xmas as a true bonafide stepdad gets wrecked bc his stepson won’t be there because according to you and your parents, Billy’s grandparents are more important than your husband and coparent. \n\nYour parents can choose to include Phillip or not, but your compliance also shows Phillip that you choose them over him. They aren’t your only family now. It is not fair to your husband to leave him for any amount of time, much less a ‘few hours’, to give into your parents pressure and demands. \n\nLet me ask you this- roles reversed and your MIL demanded Phillip and Billy be at her house, but not you- how the hell would you feel not only for the exclusion by in-laws, but your spouse leaving you alone? Truly think about that and tell me that anyone who would do this, or even ask their spouse to be ok with it, isn’t being a jerk…",
      "id": 219,
      "comments": [
        {
          "score": 1280,
          "content": "Let’s be real, it’s probably the last Christmas as a married couple as well..\n\nAlso why tf wasn’t OP backing up her husband over the medicinal argument?",
          "id": 220,
          "comments": [
            {
              "score": 406,
              "content": ">Also why tf wasn’t OP backing up her husband over the medicinal argument?\n\nIn my country there's a saying: \"It's a sin to think badly but usually it gets right\" and the vibes I get from OP's post is that she didn't marry him for romantic reasons exactly.",
              "id": 221,
              "comments": [
                {
                  "score": 170,
                  "content": "I wonder if OP would have found him so marriage worthy if he wasn’t a paediatrician (and presumably very well paid)",
                  "id": 222,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Meal ticket",
                      "id": 223,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "All about the Benjamins, baby...\n\n💸💸💸💸💸💸💸💸",
                  "id": 224,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 55,
              "content": "I was just thinking the same thing. Poor billy :/",
              "id": 225,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 191,
          "content": "I totally missed the part about this being their first Christmas together.  Wow, poor Phillip for being stuck in this mess.",
          "id": 226,
          "comments": [
            {
              "score": 8,
              "content": "They just got married 4 months ago.",
              "id": 227,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 165,
          "content": "She’s about to put the ex in Xmas.",
          "id": 228,
          "comments": [
            {
              "score": 9,
              "content": "LOL, goddamn why isn't this commented upvoted more",
              "id": 229,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1558,
      "content": "YTA.\n\nYour family sound like they have a grudge against your husband. As he is a pediatrician I can understand why he would defend his discipline. And him not taking your child to see them because he has work is a valid reason. What exactly is their problem with him? \nAnd you’re not standing by him while he’s being shunned and bullied by your family. \nShame.",
      "id": 230,
      "comments": [
        {
          "score": 712,
          "content": "Let’s state the obvious: OP’s family hates her husband because he’s not a doormat, and they are purposely trying to exclude him. That’s classic bullying behavior. OP is perpetuating the bullying.",
          "id": 231,
          "comments": [
            {
              "score": 199,
              "content": "OP’s family has been in control of her life up until now. She’s perfectly comfortable letting them make the important decisions in her life. Dealing with that is exhausting, and it makes the spouse feel unimportant. That’s true even if the in laws like the spouse, but in this case, they decided that he was the enemy.",
              "id": 232,
              "comments": [
                {
                  "score": 29,
                  "content": "This is such a good point, I was confused why OP seemingly non-maliciously is not defending her spouse against them (and not even asking about xmas plans) but seems like maybe a little bit of naivety combined with being used to her parents dominating her personal life for a decade.",
                  "id": 233,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "> OP’s family has been in control of her life up until now. \n\nThat's the feeling I get too.  She got pregnant at 21 and they essentially took over.  I suspect that played a role in the fact that Billy's father is not in the picture.   \n\nHer post is a testimony to total obliviousness about her role and responsibilities as both a wife and mother.   She thinks that her parents have a claim on her child without any thought that their circumstances have changed.   It did not even occur to her to discuss the \"invitation\" with the man she just married.  She repeatedly lets her family disrespect her husband and is now blaming him for their unconscionable exclusion.    \n\nIt's difficult to understand why they married at all and I expect Phillip is already wondering about that.",
                  "id": 234,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "This.   Why u/Drizzle-Pack7957 married Phillip is a mystery to me since she clearly has no intention of actually being an adult partner with a family of her own.   She has zero sense of priorities when it comes to her marriage.",
                  "id": 235,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Kinda sounds like OP is an anti-vaxxer herself and takes her family’s side against an actual physician.",
              "id": 236,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "I’d wager there’s an anti vaxxer among the bunch OP is keeping concealed- possible mom or sister but someone because that would further OP so much further into the wrong because AV’s are so obviously terrors to public health. YTA no question but does OP even like her husband?",
          "id": 237,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 970,
      "content": "YTA.  Your nuclear family should come first, which means your husband and son should come first.   How could you even consider going to your parents when they didn't invite your husband?   You should be mad at them and made plans for you, your husband, and son.",
      "id": 238,
      "comments": [
        {
          "score": 314,
          "content": "Right. I have never “made plans” with my nuclear family for holidays. We spend holidays together. That is the automatic implied plans for every holiday.",
          "id": 239,
          "comments": [
            {
              "score": 85,
              "content": "Exactly. It’s the default behavior. There’s only a need to “make plans” if something is going to interfere with that.",
              "id": 240,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I'll bet you she wouldn't go if her family told her that her son wasn't invited for Christmas. Poor husband is a second-class family member.",
          "id": 241,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 921,
      "content": "YTA. Why did you get married if you weren't ready to treat you and hubby like a team?\n\nLook, you need a reality check. Your parents are wrong in excluding him. You choosing them over hubby = no hubby. He will leave if he has any sense. Is this what you want?",
      "id": 242,
      "comments": [
        {
          "score": 117,
          "content": "I could not have said it better myself. It’s their first Christmas together and she is going to just leave her husband alone for the holiday. \nWhen you marry the family you created comes first period.",
          "id": 243,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "And, if OP doesn't nip this in the bud, then parents will have a success and continue to exclude husband. Billy's birthday? Shouldn't celebrate that at home, because at home OP's parents can't exclude Philip. And so on.  \n\n\nThe only way you can put an end to manipulative bs is by standing your ground. They want to see their grandchild? Philip is his stepdad now and part of the package.",
          "id": 244,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "With the marriage being this new, I don’t think it will survive this blow.",
          "id": 245,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}