{
  "post content": "Me (29) and my boyfriend (27) were at a party a few night ago. We met up with my friends. My boyfriend and I have been in a relationship for a year and celebrated our anniversary three weeks ago. \n\nWhile at the party, one of my friends asked my boyfriend about school and work etc. My boyfriend has a degree in African languages and works at a non-profit. \n\nI had a quite a lot of drinks, so I called my boyfriends degree useless because he doesn't make much money at his job. In a funny way of course. Most of my friends laughed. \n\nOne friend told me it was an asshole thing to say. My boyfriend wasn't happy either, although his degree really isn't all that useful. \n\nEver since my boyfriend has been kinda cold and I feel like an ass.",
  "id": 1,
  "comments": [
    {
      "score": 30969,
      "content": "YTA x 10. I'm embarrassed for you. Even more so that you think you were at all \"funny\" when you publicly mocked your boyfriend's accomplishment.  You likely made everyone uncomfortable and that was awkward laughter you received. You obviously see yourself as superior to him: You're not. You're pathetic and likely soon to be single.\n\nYour boyfriend's degree sounds fascinating. You sound like a total bore.\n\nEdit: Thank you for all the fun and generous awards.\n\nTo all the depressing  \"But IT IS a uSeLeSs soup kitchen can't pay his loans degree!!!\" griping: Think and dream bigger, people. Please. If everyone just pursued the most reliably financially profitable path in their lives what an even more miserable place the world would be. It's like people didn't even see that he has a job. Let the man do his life, damn.\n\nThis misery loves company trajectory that society has us on is not the answer. Just because so many of us are making choices we rather not to pay our bills doesn't mean we have to heckle this dude and his neat af degree.\n\nOne final pissy edit: If you are a dumbdumb who thinks This Guy and people like him are The Ones responsible for the student debt crisis and The Only Ones who support student debt cancellation then I hope you don't have a degree cuz it would mean you spent a lot of time, effort and money and still can't drive your brain.",
      "id": 2,
      "comments": [
        {
          "score": 9140,
          "content": ">You likely made everyone uncomfortable and that was awkward laughter you received.\n\nIt's always fascinating to me when people don't realize when they put their partners down THEY are the ones who look bad.",
          "id": 3,
          "comments": [
            {
              "score": 2240,
              "content": "100% agree. OP, YTA. It was probably just awkward laughter but I also wouldn’t be surprised if it was genuine and OP’s friends are all AHs too.",
              "id": 4,
              "comments": [
                {
                  "score": 1183,
                  "content": "One of OP’s friends said it was an AH move. So not all of OPs friends are AH.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 463,
                      "content": "That's the real friend, too.  Also that friend could do better.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Or maybe that friend was just smart enough to understand that OP could be ruining their relationship",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 349,
                  "content": "This was my thought. If OP doesn't realize that they are in the wrong, what are OP's friends like? I have been around toxic crowds, and they can all be vicious TOGETHER.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 194,
                      "content": "At least one of her friends had big enough figurative balls to plant this seed of doubt.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 55,
                      "content": "They feed off eachother.  It's gross",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 38,
                      "content": "Vicious is right like a pack of Blair Waldorf’s from Gossip Girl.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Like Africa isn't full of resources that are exported around the world, what creates all kind of continuous work like contracts, translating, laws, customs handling, communication all over the planet etc",
                  "id": 12,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 810,
              "content": "And the opposite holds true as well! I was speaking to the wife of my husband's coworker. My husband was newer and she asked about him, because her husband spoke highly of him, and that's never happened in 30+ years. I gladly shared my opinion. \n\nNo big deal I figured. I was wrong. Apparently, she raved about me to her husband. Suddenly, all pretenses of her husband's usual gruff exterior vanished when talking with my husband. What surprised me was just how often they ask how I'm doing. That's when it dawned on me that how I spoke of him reflected well on me. I'd never been in a situation quite like that, so it never crossed my mind. Instead, I was worrying I'd gush too much. \n\nThis happened a long time ago, but I still remember it because I felt like I'd been hit upside the head with the brick of common sense lol.",
              "id": 13,
              "comments": [
                {
                  "score": 510,
                  "content": "One of the things I love about my husband is that I know he always speaks well of me when I'm not around. Over the years, I've seen a lot of couples speak badly of each other--some of them constantly--and it never leaves a good impression.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 411,
                      "content": "We've all known those couples where you hang out with them, then go home and think \"damn, do they even like each other?\"",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 192,
                      "content": "I only talk about issues with my wife with my therapist. It's us against the world and I'd never insult my wife by talking poorly about her. \n\nI also tell her to her face that I think she's smart, analytical, brave and beautiful. She knows exactly how I feel about her.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 116,
                      "content": "This. Reading OP's comment brought back every time I found out my husband was praising me or hyping me up when I wasn't around and how much I miss that. Choose someone who celebrates who you are even if it's something they don't view as beneficial. My husband didn't know why I needed green lipstick, but he told me how pretty I looked when I put it on. He would have supported me getting any degree that made me happy, even if it wasn't as practical. \n\nThen there's OP using her boyfriend's degree as a punching bag. 😒",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 98,
                      "content": "It amazes me sometimes to see couples speaking to each other in horrible ways that they probably would not do with any stranger.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 63,
                      "content": "I feel like 90 percent of posts here on Reddit are like that. Do you even like your partner? My wife is my best friend and she is awesome - and yes, we have disagreements and we each have our quirks which I’m sure may at times drive one of us batty - but I would never ever not speak unwell of her nor ever have had a desire to do so, let alone go on Reddit to make a point of it. It’s as I say - if you’re here posting about your partner - chances are you two shouldn’t be together.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 52,
                      "content": "In my opinion, when someone speaks badly of their spouse something is totally wrong. Supposed to be a team in life and if that team is split there is no winning.\n\nWe're supposed to build each other up, not tear each other down.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Sometimes during the workday, I hear my husband on the phone in his office talking about me; always good.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I do this about my husband.  Pre-COVID, I often ended up in groups of coworkers chatting about their awful spouses and boyfriends.  I started chiming in just so it wouldn’t become a general man-bashing session.  Made more than a few of them jealous that he vacuums, does laundry, and packs his own stuff for trips.\n\nThe bar is so low, he jokes that he “stepped over” it.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 75,
                  "content": "Years ago I met the parents of my bf's friend. I knew the mom didn't like me and she was cold but gracious.  \n\nA few years later and bf and I were going to the friend's birthday party. I thought it would be nice to buy a huge floral arrangement for the mom because she did a lot of work.  I guess she wasn't expecting a gift for herself and ever since then I am her favorite.  At parties, the mom always wants me near her and I totally love her.\n\nJust one kind gesture can really open up someone's preconceptions.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I vouch for this.. as someone who gets in her own way, a kind gesture shows you’re a “safe” person.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 69,
                  "content": "My dad is a retired 4th generation dairy farmer. My ex-fiancee's mom had never even met him and said, to my face, in her condescending fake laugh that he didn't make a sh\\*tload of money because he doesn't work hard enough. I almost had an aneurysm trying to maintain my composure and couldn't nope out of that relationship fast enough.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I'd put money on it that mom over there never actually worked a day in her charmed life. To say that a dairy farmer didn't work hard because they're not wealthy... the disconnect from reality is really pissing me off too.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Does ex-fiancee's mom think milk, butter, cheese and other dairy products appear out of thin air in the supermarket?\n\nEvery farmer, may he produce vegetables, fruit, grains or meat deserves recognition and thanks. \n\nIt will probably take something like 1816, the year without summer, to teach snobs like her about food security, because food shortages are now rare in the western world.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Out of curiosity: did ex-fiancee agree with her?",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Farming is one of the most labor intensive jobs in the world and requires a lot of varied knowledge. People that put down farmers show their own ignorance and classicism.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Having grown up on a farm, I know that farmers work hard and dairy farmers milk on a difficult schedule. Very early mornings are the norm.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 67,
                  "content": "Being a kind, thoughtful person is always a good look.  Good for you for making new friends!",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Wait, bear with me because I'm camping, and I've had a few beers, so my logic and reading comprehension functions are apparently unavailable. \n\nShe was impressed that you didn't bash your husband?",
                  "id": 32,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Yes. Because it’s so common for people to have bad things to say about their SO, that it stood out when she didn’t.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "That'd be a low bar 😅 I didn't mean it that way though, sorry for any confusion. It wasn't that I just spoke highly of him, it was *the way* I spoke highly of him. Does that make sense? I'm on the tail end of a migraine, so I hope it does lol",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "People can tell the difference between genuine admiration for another and bullshitting. It is NEVER to one’s own detriment to genuinely speak highly of another person. The old adage, “if you can’t say anything nice, then say nothing at all” is often useful!",
                  "id": 35,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Ppl can.  I think the reason her praise had such huge positive effect on the couple is *exactly the same reason she was shocked that it did.. It was delivered in total innocence of even occurring to her that it might ever be otherwise..  Pure.  Beautiful example.  Yes,  I’ll have more of this in the world, please…",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 177,
              "content": "Plot twist, the laughter was at op,  not at ops joke.",
              "id": 37,
              "comments": [
                {
                  "score": 38,
                  "content": "If they are AH enough to laugh at the bf, they are AH enough to laugh at OP dating him.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "1: Some of them are probably equally vicious and laughed because it was \"true\"\n\n2: Some of them probably recognized how toxic it was and laughed awkwardly because they didn't have a better way to react",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 143,
              "content": "My ex talked shit about me to his friends early on, and then wondered why I hated him and all of his buddies forever afterward. \n\nWhat a mystery. 🧐",
              "id": 40,
              "comments": [
                {
                  "score": 25,
                  "content": "Boggles the mind, really.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "At least it was early on. The moment I knew I had to break up with my ex who I'd been with for *years* was when I overheard him at a party telling a friend I'd only done well in school because I'd done an \"easy\" humanities major, not like his bio major.\n\nMind you, this is a man who'd always told me to my face that he was proud and attracted to my intelligence and accomplishments. It was such a gut punch to realize what he really thought.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "Or her friends are equally disrespectful people.",
              "id": 43,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 33,
              "content": "Yes but they said it in a “funny” way so that makes it alright",
              "id": 44,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "I saw an interview once where a woman talked about how she never understood husband bashing or making jokes at a partner's expense. She said if her partner's name and reputation wasn't safe with her, how could he trust her with anything else. \n\n\n\nI don't think a lot of people realize this. These are inevitably the same people who find out secrets their partner kept and are all \"why didn't they tell me??\".",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "This. I always feel bad for their partner when I met someone who just bad mouths them. Idc if the partner makes a silly mistake or has a “weird” hobby like bro it’s more weird that you decide to date someone and belittle them",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "OMG - it's \"hurt feelings\" not \"heard feelings.\"\n\nGood thing you have such a good job, op....",
              "id": 47,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "I worked w someone whose husband had a PhD in science and he was a stay at home dad while she was kind of an executive secretary.  She got drunk at the office Christmas party and made fun of him for being a stay at home dad.  I never looked at her the same after that.  Shitty.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 710,
          "content": "YTA. His degree sounds awesome! An obscure degree to have out here nowadays? Sure... but that makes it all the more interesting! He's someone I'd love to talk to to ask why he chose that path and what he's doing at the non-profit, what his role is, etc.\n\nYou, however, sound like an absolute bore who gets off on insulting your partner as you see yourself better than him. That move was so rude and gross... I'd say \"You must be great at parties.\" but you're clearly not. You're just mean.",
          "id": 49,
          "comments": [
            {
              "score": 220,
              "content": "I LOVE talking to people with kind of niche, obscure areas of interest or work. They’re always the most interesting people to talk to!",
              "id": 50,
              "comments": [
                {
                  "score": 149,
                  "content": "Right?? And honestly they're always so much more fun to talk about it and how you got to that point, what kinda job it got them and how they use it. I have my masters in folklore and that certainly doesn't rake in the money, but omg it was such a blast to learn! I regret nothing about it either. And I bet that guy doesn't either... unless his S.O. Belittles him into regret.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 109,
                      "content": "Also- FOLKLORE? That sounds so fricking cool. I hope we somehow magically meet at a party one day. I am going to get you to tell me all the folklores. 😍😂",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 69,
                      "content": "I have a degree in linguistics and Creative Writing. Did it get me a job? Nope, but it allowed me to focus for three years on the oddities and curious details of language - a topic I loved then and love just as much now, almost two decades later.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "I guarantee his about work conversations are way more exciting than my I add and subtract and on an exciting day multiple numbers for invoices.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "My partner and I both have arts and culture degrees and have worked some niche jobs in that realm. We’ve joked before that our degrees may not have made us rich, but we make GREAT conversations at parties.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 110,
              "content": "Don't forget that just because his degree is on African languages (that's so interesting!) that is all he learned.  There's all the pre-req and elective classes he took like history, English, etc., which means he proven ability to critically think, read, write, etc.  That sounds like skills a non-profit would like having in their employee.  OP is a total AH.",
              "id": 56,
              "comments": [
                {
                  "score": 11,
                  "content": "Those are good points and ones I definitely missed. I’m now even far more interested in having a conversation with him about his degree!",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "And you can't learn a language without learning the culture of the people who speak that language... and that goes probably times a bajillion when talking about African languages and cultures, how the languages evolved and changed and which peoples lived where and interacted with whom when and how colonization fucked everything up and how different tribes and nations managed to hold on to their culture and languages through all of the pillaging and colonizing and SO. MUCH. MORE.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "One of the issues nonprofits run into is that they want to work in the international sphere but don't have the language/cultural context to work with communities instead of steamrolling them or ignoring what they need for what we think they need from a western perspective. I think OP's boyfriend has the exact right set of skills to be a respectful, helpful liason.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "OPs soon to be ex should go to graduate school. I secretly side eyed a friend of mine when she went to a high end school for French, but she wound up a professor and is running a huge international languages program for a major university in a foreign country now. She has the best life, translating ancient erotica for side money, living in Paris every summer. \n\nA degree is what you make of it.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "Yeah it’s a real shame that OP has such a bad attitude towards this. I’d think of it as the exact opposite, actively engage with friends and talk about what cool things he’s doing. I mean how rare and interesting is that! I think OP probably would be more happy swooning over some wall street robot bringing in the cash with zero passion or personality.",
              "id": 61,
              "comments": [
                {
                  "score": 54,
                  "content": "I think it probably comes with the territory being an accountant. My ex and I met in college and she was an accounting major and I was a biology major. She was super cool then and we had lots of fun. Time went by and we graduated and got jobs. I began my career as a microbiologist for Ken's Salad Dressings and she went to work for the USDA. As the years went by she started earning more and more money than me and her attitude totally changed. She started belittling me because she was making six figures and I wasn't quite there. Things came to a head when I was diagnosed with thyroid cancer and she refused to help me at all during my recovery and only came to see me once while I was in the hospital recovering from surgery. She didn't even stay at the hospital while I was being operated on. Once I recovered I divorced her ass and moved away. I got a job as a researcher and over the last few years I've helped discover and create a new way to do testing on gene & cell therapies that save people's lives and make a salary that's just as good as hers, although money isn't really important to me because after surviving cancer I know what's really important in life. She fucked up.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Omg... I am so sorry you went through all that. But so thrilled you came out on the other side and far better for it! I’m so glad you saw and know your worth to know that’s not the kind of partner to have. That treatment to you is abhorrent! Amazing on your discoveries and creations too! Keep being incredible!!",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Ken’s Salad Dressings sounds awesome! I’m so glad you made all the choices you did. You’re happier for them.",
                      "id": 64,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": "Considering OP's degree is in accounting... you're probably not far off lol",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "I have a lot of respect for people who pursue niche fields or follow their passions instead of working solely for a paycheck. Having the “right” kind of degree doesn’t guarantee success either. I know so many people who burnt out or are just unhappy because they went into a job they thought would pay well but they didn’t necessarily like. I also unfortunately once experienced what it was like to have a partner who didn’t respect my career and education, so I hope this dude learns his worth and find someone who values him as a person.",
              "id": 66,
              "comments": [
                {
                  "score": 5,
                  "content": "You're so right.  I jumped on the IT bandwagon back in the early 90's cuz it was the \"right\" degree.  Did very well financially, despite being very unhappy.  Finally the day came when I had the courage to leave my career behind and do what I love.  So now I work in the animal care world, loving every day I wake up! And... deliver food cuz it doesn't pay the same as IBM lol   OP has publicly devastated this man who loves his work, and is probably miserable with her own.  There is no excuse.  She's just a shallow bully.  Did she even apologize??",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I think the BF can do much better than OP.  She lacks the spark of interest in unusual things and her imagination doesn't take her far in seeing all the different ways this degree can be an asset, whether to a business, direct help to individuals or teaching, along with numerous non-profit opportunities and helping to do good in the world.\n\nTheir values do not align and BOTH will be disappointed with each other.  They should free each other to find someone that \"fits\" better.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 531,
          "content": "Completely agree.\n\nI think the degree sounds fascinating!! I would love to chat with him!!",
          "id": 69,
          "comments": [
            {
              "score": 323,
              "content": "Especially considering there are 30+ languages in Africa! I would love to chat with this guy.\n\nEdit: Wow, TIL that there are significantly more languages in Africa than I ever knew! Which is even more cool!\n\nMore Edit: Guys, I picked a safe number because I literally had no idea how many there are. Hence why the + sign is important.",
              "id": 70,
              "comments": [
                {
                  "score": 625,
                  "content": "“Useless” degree when he’s working for a non-profit, so, maybe he’s *making the world a better place*? \n\nHow many immigrants come to a new country and have difficulty navigating? I bet finding someone who speaks your language would be not only welcome but priceless. \n\nI’d love to talk to him, too. What an amazing accomplishment!",
                  "id": 71,
                  "comments": [
                    {
                      "score": 300,
                      "content": "Exactly. This dude has highly prized valuable knowledge of some of the richest, most ancient, and most varied languages on earth. Not everything has its value defined by the dollar figure you can put on it.  Sounds like he needs to find someone who more closely shares his outlook.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 210,
                      "content": "OP doesn't think making the world a better place is useful. OP thinks getting educated isn't worthwhile unless it makes you lots of money. OP thinks it is fine to insult your loved ones at parties. I don't think OP is very \"useful\" as a girlfriend, or as a person.",
                      "id": 73,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "I really hope he gets to read these comments. And I really hope he finds someone who sees not only the value in the work he is doing but the value in him as a person for doing it. \n\nHe seems great and his current girlfriend seems shallow...",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I always say that learning someone's language helps you understand the way they think. So boyfriend's degree will help him relate to people better, because he had to learn their sentence structure and some cultural nuanced",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "It drives me bonkers when the usefulness of a degree is only how much you can earn with it. \n\nFirst of all, plenty of high paying jobs don’t require a specific degree, just A degree (which is problematic in its own way. If a job doesn’t really need a degree one shouldn’t be arbitrarily required). \n\nSecond of all, what’s wrong with learning for the sake of learning? College should be about more than just a money making degree.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Not to mention, even if it wasn't a fascinating degree, it's still something he devoted a huge portion of his life and money to and the one person who's supposed to love him and have his back called it useless. That lady is cold as ice.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 219,
                  "content": "30+???????????????\n\nTry THOUSANDS. \n\nThere are over 300 spoken in Nigeria alone!",
                  "id": 78,
                  "comments": [
                    {
                      "score": 207,
                      "content": "Well, technically there are more then 30",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 91,
                      "content": "My Cameroonian French teacher used to say she was pretty sure the tower of babel was in Cameroon because damn, so many languages!",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "Yep! And about 100 languages in Ethiopia! It's a fascinating field that I wish I were smart enough to study when I was younger haha",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "I heard there's more than one language spoken there.",
                      "id": 82,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "This is slightly divergent, but did you run into this article that went around a couple of months ago regarding a song that was sang by the descendants of slaves in the southern US and their relation to those in Africa? So there was this song that was passed down through generations in a family/community brought over to be slaves. The individuals were sure to try and pass it along as accurately as possible. They said that wherever they go and they run into people who know that song, then they are among family (or something like that…maybe it was home?). Some linguists had a recording of the song from the early 1900’s. Maybe 1930ish? By this time the song had been passed down they think 200 years. To be clear, they didn’t know the translation of the song into English, they memorized the sounds. \n\nWell, these linguists just decided to travel around Africa to try and find where the song came from. I’m sure they had a bit of method to their madness. They were about to give up when they came to a village and played a recording of the song. The people they were talking to started singing along!!! The scientists had found the community where the song originated!! They brought over the descendants of the woman in the early 1930’s recording to meet the individuals in Africa.\n\nSo some slaves were capture from Africa, brought to the US, and passed down a song through generations. There was so little distortion from the original by both groups that people were able to track down the location where the song originated…and therefore tracked down where these individual’s ancestors’ were likely taken from. The linguists even think that the Americans song is closer to the “original” song as they had been directly memorizing it through generations. Meanwhile their contemporaries in Africa were speaking the words in a living language and therefore under the influence of the natural shifts that occur in language.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "I know right? That's sick as, this guy sounds awesome",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "haha way more than 30 lmao its in the thousands",
                  "id": 85,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Well he’s probably gonna be single soon if you wanna shoot your shot!",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Also, you don't even have to work in your field to attain value in it. I'm sure they developed skills from their degree they can apply elsewhere. Like you could get a degree in history and go work in something totally unrelated, but use your skills you developed in researching, writing papers, citing, etc. in most everything.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 347,
          "content": "Fantastic, OP currently sitting on -80 karma, and not a damn fucking peep from her since receiving all this backlash, she's probably had the shock of her life.\n\nI love a good dose of karma 😎\n\nOP really out here mocking a really interesting and unique degree, when all she has is a fucking degree in ACCOUNTING 😂😂😂",
          "id": 88,
          "comments": [
            {
              "score": 160,
              "content": "There is an accountant my friend keeps inviting to parties. She is a total latch-on, no-escape *bore,* a real rocklicker. \n\nThe issue with her *super useful accountancy degree*  is that it appears to have led her to a life she detests, so much so that at every party she attends she makes this our problem when she sucks every conversion bone dry fishing for encouragement to do \"something creative\", yet seemingly never making moves outside of being two wines deep and in our long-suffering company. Her joyless face is a picture of sensible regret.\n\nThe first time I met her I did the polite laughter too, but soon grew tired of her miserable routine and the jealous, disbelieving snubs she directed at those brave enough to follow their heart. I don't laugh anymore. I make firm eye contact with her and sip my drink patiently or leave to fetch another.\n\nOP is in danger of becoming this person. \n\n&#x200B;\n\nps I'm sure some of you accountants out there are great fun at parties but would bet you're the ones who wound up doing it for more complicated reasons than \"it's useful\"",
              "id": 89,
              "comments": [
                {
                  "score": 87,
                  "content": "[deleted]",
                  "id": 90,
                  "comments": [
                    {
                      "score": 40,
                      "content": "I just think we English majors are really good at inducing existential crisis in people. \n\nThat’s what we studied.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "See, I like *systems.*  How they work, how they break down.  \n\nOne of the most interesting things about playing video games as a kid (well, and now lol) was the bugs.  As a kid, sometimes a bug told me something about how the game itself was structured and worked, long before I ever studied programming.  I enjoyed those moments of insight into the workings which I gained from how something broke.  It made me really think about the game and its systems and how it all worked together.  It's what sparked my interest in programming in the first place.  \n\nI don't work in programming, but I do game dev on a hobbyist basis and participate in game jams, which is a blast.\n\nI'm a US based tax preparer and I've found that taxes hold my interest in similar ways.  And oh my, is that a system, and an enormous one.  And oh my are there bugs and unintended effects, perverse incentives, and poor design there, too.  Spaghetti code and obvious patches from years of revisions by multiple parties is not just for programming.  Though the impact of competing interests is a lot stronger and contributes to a lot of the messiness.\n\nBut at the same time, as much as it fascinates me, I feel like what I do shouldn't really be a thing, not to the massive industry scale it is.  It shouldn't be so difficult and confusing and, frankly, intimidating, for someone with a relatively simple financial situation to do their own taxes.  But then there's basically everything to do with all the different definitions of dependency.  We hear a lot about people claiming dependents they shouldn't, but it's actually fairly common for people *not* to claim dependents they can and *should.*\n\nSo I want to help people.  But I also feel like, man, this just isn't help that *should* be needed, not to this extent, right?\n\nSo that's how I ended up doing some dry-ass shit like taxes.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 80,
                  "content": "You came so hard for accountants 😭😭😭😭\n\nJust kidding. The color of our tassel for graduation is named “drab,” which I found endlessly hilarious and appropriate (although accounting can be super interesting, especially forensic accounting and auditing).",
                  "id": 93,
                  "comments": [
                    {
                      "score": 6,
                      "content": "We are getting absolutely slaughtered in this thread.  😭. I'm just trying to make sure everyone stays employed and gets a paycheck.",
                      "id": 94,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Forensic accounting really is super interesting!",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "> her joyless face is a picture of sensible regret.\n\n😂 I genuinely laughed out loud at this. I’ve met a few people like this over the years (including my now ex), who are just SO miserable. You can feel it as soon as you’re within their radius.\n\nMy ex has a very sensible and traditional uni degree - I was always really proud of him. He worked hard for it, and I frequently told him his job was important and that society could function better because of people like him. Lots of encouragement and reassurance coming from my side…\n\n… He hates his job. Hates his degree. Hates his life. Hates everything. Nothing is ever good enough and he’s never happy with himself or anyone else in his life - and he does whatever he can to spread this misery to all those around him. Spending time with him is like pulling teeth without anaesthetic.\n\nHe also used to give me shit because my degree is in a much more niche area - he would frequently tell me I didn’t work a real job, or mock my achievements because apparently any old idiot could do what I did and I didn’t have to work as hard as him... Super charming stuff 🤨 I worked professionally using my degree for nearly a decade before I stopped to have kids. Now I’m back at work again, in a different job, also based on my “useless” degree, and I’m earning more per hour than he does 😂\n\nHis current rationalisation is that I deserve no credit for any of this, I just got lucky. AH like this are just miserable sacks of crap who push their inadequacies onto everyone else. They’ll never be happy and they blame other people for it.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I think that You write in quite funny and engaging fashion. You help the reader to create clear mental images. I just wanted to point that out. Hopefully you are involved on writing in some facet of your life .",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "She could transition to [lion taming](https://www.youtube.com/watch?v=LqQlCOmXuHM), which'd be exciting",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I have a question how does negative karma work lol but yea she is a asshole",
              "id": 99,
              "comments": [
                {
                  "score": 6,
                  "content": "Basically when you make a comment and someone upvotes your comment it gives you \"good karma\" and when they downvote you it gives you \"bad\" karma.\n\nIf you click on someone's profile just below avatar it will let you know the total karma they have, either negative or positive. In your case I can see you have 343 karma total. You can also check this yourself by clicking on your avatar and looking at the main page of your profile\n\nHope that was useful 🙂",
                  "id": 100,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 262,
          "content": "Also, not just a fascinating degree but an *important* one. African languages are precious pieces of human history, and are seriously threatened by colonialism. \n\nMaybe he doesn't make a lot of money from his job, but he's helping preserve incredibly important knowledge about humanity.\n\nMany people get degrees to get a good job. However, many people get degrees to pursue rich knowledge. \n\nTopics like philosophy, anthropology, and even language has never been about money. They've been topics of interest because they enrich the human experience.\n\nYour boyfriend sounds like a Chad. I'd let him talk to me about African languages for days, that's cool as fuck.",
          "id": 101,
          "comments": [
            {
              "score": 29,
              "content": "Well put. Plus, like, other governments and companies need to communicate with African countries and businesses. If no one speaks the languages, we’re fucked.",
              "id": 102,
              "comments": [
                {
                  "score": 8,
                  "content": "Very true. In my original comment I didn't realize that I was speaking about African languages like they're a thing of the past. Definitely not. The need to understand African languages is present and relevant today.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Everything’s you said, and people generally work for non-profits for the good it does, not for money. But an obscure degree is a good way to connect with interviewers when going for corporate positions that don’t require a specific degree.",
              "id": 104,
              "comments": [
                {
                  "score": 8,
                  "content": "I worked with a professor whose specialty was Chinese anthropology. Not exactly a ton of jobs in the field, but she got paid a lot of money by the State Department as a consultant. Now she can teach and work on asylum cases.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Well put. Plus, like, other governments and companies need to communicate with African countries and businesses. If no one speaks the languages, we’re fucked.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 162,
          "content": "Also OP’s lack of positionality and insight in to calling an African language degree useless from a culture perspective is fucking maddening",
          "id": 107,
          "comments": [
            {
              "score": 65,
              "content": "People really have little insight into how many skills a person develops from earning a degree in liberal arts and how valuable that really can be in the professional world because they believe if you’re not earning $90k per year before you’re 30 as an engineer, you’re not successful. But look at what Elon Musk (BA in physics and BS in economics from UPenn) did to Twitter or the outcome of the submarine guy Stockton Rush (BS in aerospace engineering from Princeton and MBA from Berkeley). Having more money doesn’t make you or your degree more useful. I bet OP’s boyfriend is improving lives in useful ways at the non-profit he works for though.",
              "id": 108,
              "comments": [
                {
                  "score": 4,
                  "content": "Seeing that thread from that tech guy who used AI to find “the rest of the painting” broke me. I’ve made my classics degree work, but surely we are losing something when we undervalue the arts so much? I’m actually sad because I think so many people who enjoy AI do so because it’s their first chance to be creative. It gets even better when you make it yourself!",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 119,
          "content": "Very good example of fuck around and about to find out lol",
          "id": 110,
          "comments": [
            {
              "score": 163,
              "content": "I hope she enjoyed the first (and only) anniversary.\n\nI just read another post where the OP is bitching that his’s brother’s fiancé doesn’t meet the family’s “standards”.\n\nMaybe this OP can search Reddit and hook up with that OP.\n\nI think they’d be a perfect match.",
              "id": 111,
              "comments": [
                {
                  "score": 22,
                  "content": "Oh fun! I love when we creep and find things to make the OP worse haha",
                  "id": 112,
                  "comments": [
                    {
                      "score": 4,
                      "content": "To be clear, the person you responded to is talking about two different posts made by two different people. They were suggesting that the two posters should get together since they're seemingly both mind numbingly shallow",
                      "id": 113,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "In a funny way of course!",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 80,
          "content": "Couldn’t have said it better. OP is giving vibes of feeling superior than her boyfriend based on a degree and current salary. \nA bit of an advice, degree and job is not always the only indicator of how successful someone will be. Additionally, just because someone makes more money doesn’t mean they are happy in that job.",
          "id": 115,
          "comments": [
            {
              "score": 6,
              "content": "I have two degrees, an art degree and a degree in electrical engineering. I've made about 6k from my art as a side hustle over the past decade, but it was far more valuable to me on a personal level for figuring out who I am and what I want, as well as helping me understanding more about the physical world.\n\nOP's boyfriend having a degree in african languages and a job that is out there helping people seems fantastic for personal satisfaction. \n\nYTA op",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "I know this the top comment, but it needs to be higher.\n\nYTA OP, how embarrassing and sad.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "You read tf out of OP😂😂👏🏽👏🏽",
          "id": 118,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11054,
      "content": "“In a funny way of course.” Uhh. \n\nI’m struggling to think of a “funny” way you could tell a group of people you think your boyfriend’s choice of education/career is useless. What exactly do *you* do for a living?\n\nCan’t imagine why your boyfriend wasn’t happy about your comments. Probably because YTA.",
      "id": 119,
      "comments": [
        {
          "score": 3061,
          "content": "YTA \nHa Ha Ha! You wasted your time by getting a degree that interests you. Good grief you are insufferable. Break up with him then. You don’t like him.",
          "id": 120,
          "comments": [
            {
              "score": 1586,
              "content": "It's also a really important degree...African history and culture hasn't been preserved and studied nearly as much as other continents.",
              "id": 121,
              "comments": [
                {
                  "score": 759,
                  "content": "It also has a lot of applications for use in NGOs and intelligence gathering, and that's just off the top of my head.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 361,
                      "content": "For real. I know someone with a similar degree and her career seems very interesting and exciting, and she has a lot of opportunities to use it.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 288,
                      "content": "Also, just.... not every degree has to be job training. Outside of a few specific fields (engineering comes to mind), your degree may have nothing to do with your job, which is fine. The idea used to be that school taught you how to think and learn, and then your employer taught you the specifics you need to do the job.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 263,
                      "content": "Yeah, I was thinking intelligence. There's a real need for linguists in that world. He could be a m-f-ing spy if he wanted to.",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 113,
                      "content": "And I’m sure anthropological, ecological, economical, psychological, sociological too! I’m sure I’m forgetting other -ologicals.lol I know pretty much nothing about Africa. I think it’d be interesting to talk to OP’s BF! I do know non-profits often don’t pay well, but I’d argue most have way more sociological benefits than many companies who pay well.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "And it has use at the non-profit the boyfriend works at, and non-profits often do incredibly important work. They do tend to pay their employees poorly, but poor pay is not at all the same as useless.",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "ooh I forgot about intelligence gathering, only thought about the UN, but  CIA and similar orgs always need translators too!",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Linguists, especially contract linguists, at NSA, get paid very well.  And those linguists don't just speak the language, they have to really understand the culture as well.  The military training for linguists is equivalent to 10 years of college study of the language and culture.  Back in the old \"Ma Bell\" days of phone service, AT&T and Bell both had standing offers for military linguists with any DLPT score of a starting wage of $25 per hour.  Mind you, this was aimed at 20-22 year olds with real life skills beyond that language at a time when minimum wage could actually cover your living expenses. It'd be equivalent to $60 an hour today.",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Also, learning languages that have little in common with your native language is admirable.",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Oh that's true! I didn't think of that. My friend majored in linguistics and that's certainly a career that she could pursue.",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 79,
                  "content": "I’m trying to think about what sort of work he would be doing. I’ve no doubt that it’s something that is empowering people. He is doing great work. OP ridiculed that work.",
                  "id": 132,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 45,
                  "content": "I took an African Studies class as a freshman elective in college because 18-year-old me thought it would be funny being one of the only few white people in a class full of black people. It turned out to be one of the most interesting and insightful classes I took during my college career and I’m happy my idea of a joke turned into an educational experience that I really enjoyed.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Also: it's a modern languages degree. It's likely part of the reason he got his specific job, and that's where his interests are (and that sounds great!), but there's also no reason whatsoever it should be inherently worth any less than a different Arts/Humanities degree. It should be good for most of the exact same jobs they are, certainly most office jobs that ask for a degree. Sure, the less common ones can sometimes lead to more questions about it in interviews, but (unless you're sticking with academia etc) you're not usually getting hired for your knowledge of flippin' Shakespeare either, most employers don't care. They want the basic skills that degrees require. They want to know you can write relatively coherently, work and research independently over sustained periods, and so on.\n\nProbably OP doesn't have a degree, they certainly don't seem to understand the purpose of them.",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "I misread this as “African luggages” and even though I thought, “damn, that’s specific” I still thought op was TA",
                  "id": 135,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "Sighs in Indigenous Australian….",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Except for Egypt. European museums are full of shitloads of stolen artifacts.",
                  "id": 137,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "Exactly, there is plenty of application for a degree in African languages. History, culture, anthropology, wildlife research, mining and exploration, humanitarian actions, counter-terrorism, counter-piracy etc.",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "It's because it's about black people",
                  "id": 139,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "For op \"doesn't make money\" = \"useless\"",
                  "id": 140,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 140,
              "content": "It would be one thing if the boyfriend couldn’t find a job, then OP might have a little more to stand on. But it sounds like he has a job, he just doesn’t make much money. Oh the horror, the fact that some people could value _what_ they’re doing over how much they make",
              "id": 141,
              "comments": [
                {
                  "score": 12,
                  "content": "Your last sentence is the crux of the issue. OP is clearly in the camp of people that think degrees should solely be about increasing earning potential. \n\nHigher education is also about studying something that interests you to a greater level. If that helps you get a job in a particular field, great. If that helps you earn money, brilliant. But that's not the be-all and end-all.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 34,
              "content": "> You wasted your time by getting a degree that interests you.\n\nBut OP said it *in a funny way*! /s",
              "id": 143,
              "comments": [
                {
                  "score": 6,
                  "content": "So, this?\n\nYou...WASTed...yourtime...by...GETting...adegree...THAT...interests....................^you!\n\n</Shatner>",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Obviously. The man has a degree, is doing with that makes him happy, IS BENEFITING OTHERS, and is bringing home a check? Sounds pretty fucking great to me",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 211,
          "content": "It's funny because she can demean her partner and be racist at the same time!",
          "id": 146,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 143,
          "content": "I've seen something along these lines happen *once* in my life and it immediately made everyone awkward and became the go-to bit of post-party gossip.  The husband (in this case) wasn't even that popular (and admittedly didn't do a whole lot), but the wife we all worked with didn't score any points with anyone for that and it just lowered her in all of our estimations.",
          "id": 147,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 81,
          "content": "We need to know what her degree is. It's probably something she would call useless if it wasn't her",
          "id": 148,
          "comments": [
            {
              "score": 64,
              "content": "She probably doesn’t have one….",
              "id": 149,
              "comments": [
                {
                  "score": 13,
                  "content": "that's my thought too",
                  "id": 150,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 34,
              "content": "I'm guessing it's soulless, but makes more money.",
              "id": 151,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": "She said elsewhere it's accounting",
              "id": 152,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 79,
          "content": "Right!? A degree in African languages sounds incredibly interesting and as the region becomes more stable and wealthy will be crazy useful in the future. He’s doing charity work because obviously money isn’t everything but that doesn’t mean his degree is useless…how do people like this exist??",
          "id": 153,
          "comments": [
            {
              "score": 7,
              "content": "I was just thinking Africa has so many rare earth metals that are the future of tech. Having a degree and knowledge of a whole friggen continent has the serious potential to be a well paid consultant. And one that started off building trust and understanding through NGO work to boot!",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "My partner looks like a piece of trash and I'd literally sleep with anyone else if they offered because of how inadequate he is....I was only joking",
          "id": 155,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 27,
          "content": "The only way I could see this being funny is if the BF is in on the joke. Like, my friends make fun of my lit degree, but it’s because they respect my skill set and know it’s not _actually_ useless. But something tells me that is not the case here, if a. OP is posting about it, and b. BF didn’t find it funny. Lol",
          "id": 156,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Right? Like I can make a crack at my own degree that *I* feel is useless, but if my partner made a joke out of the blue about it and not in the moment I was joking about it, it would be hurtful. It’s also wrong if he’s using it for his work at the non-profit. Just because he doesn’t make a lot of money, doesn’t mean he isn’t using his degree. OP YTA",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I think depends on your relationship and the group. You can poke shit at your partner as long as it is not serious and your partner and the group understand that and also enjoy the banter. But op actually believes that the degree is useless so there is truth behind it\n\nYta",
          "id": 158,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Yeah me and my friends rag on each other but we'd never insult how much money each other makes, shit ain't funny.  Theres more to a person than how much money they make.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6145,
      "content": "YTA. What's your degree in? Your BF is working at a non-profit. By any chance do any of the clients his NP serves speak the languages he has a degree in? \n\nYour comment wasn't funny; it was mean spirited. Don't be surprised if he doesn't stick around long enough to celebrate a 2nd anniversary, you're terrible.",
      "id": 160,
      "comments": [
        {
          "score": 925,
          "content": "Totally agree with you. It is likely that he speaks certain African languages with either co-workers or clients (or both).\n\nAlso, happy cake day!",
          "id": 161,
          "comments": [
            {
              "score": 224,
              "content": "Or creates marketing/ educational materials in that/ those languages.",
              "id": 162,
              "comments": [
                {
                  "score": 7,
                  "content": "Maybe even working with refugees. Either way it sounds interesting and I’d love to hear more about what he does.",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "Thanks!",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 689,
          "content": "Her degree is in accounting lol. Figures",
          "id": 165,
          "comments": [
            {
              "score": 586,
              "content": "Haha, all Op knows how to do is count other peoples money.\n\nEdit: Oh my, thank you very much kind stranger.\n\nFurther edit to clarify: YTA",
              "id": 166,
              "comments": [
                {
                  "score": 267,
                  "content": "Until AI takes over that industry. Then who's got the useless degree",
                  "id": 167,
                  "comments": [
                    {
                      "score": 70,
                      "content": "There's a lot more to accounting than most people know. AI will never completely take over it, I've seen linkedin articles about AI taking over accounting and it showed that AI cant even pass the CPA exam, it will take a long long time before it can. You can also use an accounting degree to get into law and practice tax law. Theres so many different directions you can take with an accounting degree. Also, accountants make good money so 🤷‍♀️. But that doesn't mean OP's boyfriends degree is useless. I think it is so respectable that he works at a non-profit organization, that shows true character.\n\nEdit: I guess chatgpt did pass the CPA exam. The article I saw was from a few months ago and new research has been conducted since. It also passed the bar exam, but that doesn't mean lawyers will go extinct. We still need humans for those complex jobs that require human judgement. I don't think we'd ever be able to 100% rely on AI for these types of jobs and they wont fully replace humans, but rather use it as a tool to cut out mundane tasks associated with the job.",
                      "id": 168,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 88,
              "content": "Maybe let’s not put down people who are accountants just because OP was an asshole?",
              "id": 169,
              "comments": [
                {
                  "score": 4,
                  "content": "Hey wtf we're catching strays over here!",
                  "id": 170,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 140,
          "content": "I agree with you. I would bet that he works with immigrants from Africa as a translator. Africa is still wartorn in many areas with refugees coming in every day.",
          "id": 171,
          "comments": [
            {
              "score": 74,
              "content": "[deleted]",
              "id": 172,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Even if he didn’t work with African immigrants it wouldn’t be useless. I took swahili in college and you wouldn’t believe how many of the vendors in my new neighborhood prefer it. I get discounts!",
              "id": 173,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "No according to OP it's not useful because it doesn't pay well enough not because it's you know, not useful. Definitely shallow af and YTA",
          "id": 174,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "OP'S comment was also very ignorant. I admire people speaking multiple languages.",
          "id": 175,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "YTA: I agree. I have a BFA I’m not using…I can joke that my degree is in “underwater basket weaving” but someone else can’t say that joke about my degree because I truly worked my ass off to earn it.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2935,
      "content": "YTA\n\nNot funny, just mean. Why are you putting down your partner?",
      "id": 177,
      "comments": [
        {
          "score": 645,
          "content": "Because she has low self esteem. Because she needs to make others look crap so that she can feel good about herself.",
          "id": 178,
          "comments": [
            {
              "score": 101,
              "content": "Narcissistic behaviour always stems from shame, and always ends up being punch down projection.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Could also be because she finds accountancy soul crushingly boring, that the only reason she chose it was for the money, so the only fulfilment she gets is from shitting on people with \"bad\" degrees who find meaning in their work.",
              "id": 180,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 194,
          "content": "Because don't you know? High earning degrees are the only degrees that matter and those that don't make a lot of money are inferior people worthy of mockery. Duh! /s",
          "id": 181,
          "comments": [
            {
              "score": 72,
              "content": "I had a friend that claimed she refused to date anyone without at least a bachelors in a STEM.  Then she met a guy who made a bunch of money (tech of course) despite having no degree and all the sudden she didn’t care…..",
              "id": 182,
              "comments": [
                {
                  "score": 12,
                  "content": "That’s funny. My impression is that STEM is most often a path to a decent job with decent prospects. No one I know who did pure STEM is making bank. I have plenty of friends with “useless” degrees making absolute bank.",
                  "id": 183,
                  "comments": [
                    {
                      "score": 14,
                      "content": "2+ decades in tech here, with ‘useless’ degrees in archaeology and library science - I’ve seen multiple waves of folk with STEM degrees come in and burn out, while many of us with humanities and arts degrees have progressed and continued to move up because we can write, present and generally manage things as well as having tech skills, while a lot who only had tech-focused degrees had zero other skills.\n\nIt’s experience and learning agility that make the difference in the long-term.",
                      "id": 184,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Likely her boyfriend’s degree is a point of embarrassment for her, so she was likely trying to pre-empt the judgment of others. Which is an immature and reflexive thing to do, and very embarrassing for BF.",
          "id": 185,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1533,
      "content": "YTA. Degrees don't have to be judged on how much money it earns you after the fact. Calling it useless is also just basically saying he wasted all the time and effort he put into getting that degree. Is he fulfilled working for a non profit? Can he/you guys make a living even if it isn't lavish? I think it was rude to say, especially in front of other people.",
      "id": 186,
      "comments": [
        {
          "score": 216,
          "content": "A simple rule that I always follow is to never put down or talk bad about your significant other to anyone else.  This paints your partner in a bad light to them and doesn't give them a sense of who they really are, only what you think of them.",
          "id": 187,
          "comments": [
            {
              "score": 41,
              "content": "Same! My rule has been “Never say anything to or about your partner in public that you wouldn’t want said to you in public”.",
              "id": 188,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "tbh, imo it's more likely to paint you (the one saying it) in a bad light",
              "id": 189,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Honestly, it paints you in a worse light imo. If I had a friend that did this I’d think very, very low of them.",
              "id": 190,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Even beyond what it does to your relationship it makes you look like an idiot.  If they are that bad what does it say about you???",
              "id": 191,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I'd like to hear what the people who that non-profit helps think about this. I bet they don't believe OP's partner's degree is \"useless.\" Fucking read the room. Holy shit.",
          "id": 192,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "I agree. It's not like our economic system is the only way to value work, skills, and knowledge, either. Wait till AI comes for her accounting job and it's worth a tiny salary, then what???",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yeah, I think there is a weird but common mindset that degrees should lead to lots of money but degrees are just knowledge and education. If not for the fact getting these degrees is getting more and more expensive maybe this harmful mindset wouldn't be as common.\n\nGetting degrees in subjects you're actually interested in sounds better to me and if not for certain harmful systems currently in place in many countries that makes even living an uphill struggle maybe people could be happier studying what they love",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "He’s helping vulnerable people turn their lives around, helping *actual human beings*, but his job doesn’t pay well so it’s uSeLEsS\n\nDisgusting.",
          "id": 195,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1140,
      "content": "YTA. Just because a degree doesn't bring in money doesn't make it useless. Art, language, performance, etc are all vital parts of life. You just sound jealous he didn't base his life around money.",
      "id": 196,
      "comments": [
        {
          "score": 273,
          "content": "It's weird, my parents (boomers) instilled in me to think that those types of degrees are useless but my mind has changed radically over the recent years. I have a degree in the sciences but it's equally as important to preserve and advance our understanding of art, history, cultures, languages, etc...like you said, other vital parts of life.",
          "id": 197,
          "comments": [
            {
              "score": 99,
              "content": "I have a degree in history and you learn a lot of valuable skills for a professional setting. Everything that has stuck out about me as an employee and candidate for promotions are things I got from my liberal arts degree. Am I a wealthy CEO who exploits people for a living? No, but I have a really enriched life as a social worker and am happy with the modest but comfortable lifestyle my husband and I are raising our daughter in.",
              "id": 198,
              "comments": [
                {
                  "score": 59,
                  "content": "It’s interesting. All those “high value” degrees tend to push out people who are bad at critical thinking and also very bad at communication. It’s why companies end up hiring people with “useless” arts degrees, because we can write and proofread and communicate properly.",
                  "id": 199,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "My liberal arts degree helped me learn to write/edit/think critically; all skills which translated well to my research job and later degree in nursing.",
                  "id": 200,
                  "comments": [
                    {
                      "score": 10,
                      "content": "This 1000 times. I have my English degree. I was taught how to write effectively and also how to properly research and think critically about a source, something our society desperately has forgotten or was never taught. It's why misinformation can spread like wildfire.",
                      "id": 201,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Ditto.  My BA is in music, and I’ve done master’s work in theology and church history.  My liberal arts degree taught me how to think.  And now?  I’m working in a field which combines my undergrad *and* grad work.",
                      "id": 202,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "My degree in historic preservation, derided as “useless” by certain family members back in the day, now makes me solidly into six figures annually… doing historic preservation.\n\nETA: Also, OP… you are an embarrassing asshole. YTA. Big time. You owe your bf an apology.",
              "id": 203,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "If it makes the world better, it is useful.",
              "id": 204,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I have a philosophy degree and it helps me identify morons quickly. Very useful.",
              "id": 205,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Exactly. People don't realize you have to have a degree to be a veterinary technician. Fast food workers make more than me so is my degree useless OP?",
          "id": 206,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Love the comment! 💜",
          "id": 207,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 825,
      "content": "YTA then and YTA now.\n\nYou embarrassed him pointlessly in front of friends and you continue to make light of his accomplishments even when trying to ask if what you did was an asshole move or not.\n\nPeople who work for NPO's are seldom in it for the money and money is not the be all end all of value.\n\nIt really comes off like you don't respect the man or his life choices.",
      "id": 208,
      "comments": [
        {
          "score": 238,
          "content": "In all fairness the boyfriend did decide to date OP so he has made at least one life choice deserving of mockery.",
          "id": 209,
          "comments": [
            {
              "score": 27,
              "content": "Truth.",
              "id": 210,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Lmao sick burn",
              "id": 211,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Oh true. He does have a fondness for useless things after all.",
              "id": 212,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "I'm curious about the one thing that hasn't been spoken of yet. What their ethnic backgrounds are and how this plays into this dialogue",
          "id": 213,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 637,
      "content": "INFO: did you apologize or talk w/him about it at all afterwards? If not, no surprise if he’s been “kinda cold,” actually much more surprising if he *hasn’t* been “kinda cold”",
      "id": 214,
      "comments": [
        {
          "score": 22,
          "content": "This post has to have been written by a chat bot. This kind of absence of self-awareness doesn’t feel human to me.",
          "id": 215,
          "comments": [
            {
              "score": 12,
              "content": "I’ve met hundreds of humans who are less self-aware than Clippy from Microsoft Word 2003.",
              "id": 216,
              "comments": [
                {
                  "score": 4,
                  "content": "Fucks sake, Clippy, Read the room,",
                  "id": 217,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "You have been wanting to say that for a while.  To humiliate him in public was cruel and you say you love him.  He doesn’t need that kind of love.",
          "id": 218,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "What’s surprising is they’re still together. I would have tore her ass up on the spot.",
          "id": 219,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 437,
      "content": "YTA \n\nIf he works in none profit and specialists in African language, something tells me that helping people means more to him than making money. AND THERE IS ABSOLUTELY NOTHING WRONG WITH THAT. He is a career chaser in terms of helping others as much as he can, not for his own monetary gain.\n\nYou mocking him whether a joke or not was a low blow. You haven't even mentioned that you apologized to your partner, which is disgraceful....even now you still say his degree is pointless after seeing first hand just how much you've hurt him with that comment!\n\nYour boyfriend deserves WAY better than you, and I wish the world has more people like him in it, and less people like you.",
      "id": 220,
      "comments": [
        {
          "score": 38,
          "content": "Honestly, give this guy a few more years, and he'll have a pretty strong niche with experience to back it up... If he wants to move into business or government he'll be able to for the right organization. Even some nonprofits pay well. \n\nThis is not a common skill set.\n\nAnd if he wants to keep working for NP, that's amazing, too.",
          "id": 221,
          "comments": [
            {
              "score": 9,
              "content": "Fucking love your comment!\n\nYes absolutely 💯 to everything spoken. I work in Education and Medical recruitment and have done for years. \n\nOver the years I've seen many people in the exact same scenario you've stated go on to do extremely well for themselves financially. I've also seen first hand how hard employers have it trying to find someone that has a very specific \"niche\" skillet they require.\n\nLike everything it's basic supply and demand. There may not be a huge demand for a qualified African language expert...but when there is, bet you're ass many places will pay top dollar for that skillet as the candidate pool is so low, government is a perfect example of that.",
              "id": 222,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 369,
      "content": "YTA, you really had to ask?",
      "id": 223,
      "comments": [
        {
          "score": 55,
          "content": "This was my first thought. How does she not recognize she’s the AH here???",
          "id": 224,
          "comments": [
            {
              "score": 28,
              "content": "this is written in such a remorseless way that it feels like a couple fought, and the guy went, \"Reddit would agree that you're the asshole.\"",
              "id": 225,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Sometimes this subreddit makes me worry about the emotional intelligence of people. Like, I get that it’s hard to admit you’re an asshole, and sure sometimes I’m actually clueless about ways I’ve hurt people. But having a clue, but not being able to decide for yourself that you made a dick move? That’s so sad to me.",
          "id": 226,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}