{
  "post content": "\nMy husband has been dealing with sone health issues the past few weeks and has been frequently visiting the dr. I asked if I could go with him but he refused saying it wouldn't be neccesary and when I asked why he wouldn't want me with him he said he felt more comfortable having privacy with his doctor. I jokingly asked if his doctor was a women and he glanced at me.\n\n\nI anticipated his next dr appointment and decided to go meet him there. He went and 10 minutes later I entered the office (I identified myself as his wife) and he was shocked when he saw me. I greeted his doctor (a man lol) and we talked but my husband refused to even look my way and refused to speak as well.\n\n\nWe left the office together and he went off on me in the car saying I shouldn't have \"followed\" him and came into the dr office after he asked me for some privacy. I said it was alright I'm his wife I already even know what his issues are and just wanted to show support. He said I overstepped his one boundary and refused to respect his wish and made him more stressed than he already is in these hard times he's going through.\n\n\nI thought he overreacted but AITA?",
  "id": 1,
  "comments": [
    {
      "score": 68516,
      "content": "YTA. You don’t have the right to invade your husband’s privacy after he requested to go alone. A signed piece of paper doesn’t give you the right to stalk your husband. You have zero respect for him, obviously.",
      "id": 2,
      "comments": [
        {
          "score": 24691,
          "content": ">You have zero respect for him, obviously.\n\nIt's downright hilarious that OP is trying to convince us in her reply that she disrespected her husband's wishes and privacy *because* she respects him (\"I respect him and worry about him **that's why** I went\").\n\nETA: her asking him \"jokingly\" if the doctor was a woman is a dead giveaway of what her *real* reasons are.",
          "id": 3,
          "comments": [
            {
              "score": 8760,
              "content": "This is the comment I was looking for. She doesn't really care about her husband's health issues and privacy as she was suspicious of the doc being a female and this being the only reason he was going.",
              "id": 4,
              "comments": [
                {
                  "score": 4336,
                  "content": "Yup, and jokes on the OP, people cheat with same-sex partners all. The. Time. The OP gained nothing from this behaviour, except eroding the respect and trust of her husband.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1092,
                      "content": "This is so far gone and disrespectful that I actually can't even believe people like this exist. I know they do of course but how someone could have their head so far up their own ass is so wild to me.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 177,
                      "content": "I never would, but my girlfriend experienced that with an ex once (she herself is also bisexual, but that doesn't mean \"both at once\" - she's still loyal).\n\nWouldn't be surprised if the husband *starts* cheating now that he no longer trusts his wife.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 95,
                      "content": "[removed]",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 22,
                      "content": "As a man whose wife left him for  the woman she was having an (at the time) emotional affair with. I concur...",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "I was about to say … plot twist your husband is in love with his male doctor lol",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Also a doctor is the least likely person in the world to cheat with her husband. She would lose her license and there’s no man on earth worth that. Worry about the grocery store bagger or someone else not heavily regulated",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Exactly.. And of all people you suspect he's cheating on you with his Doctor... At the office?? Makes complete sense🤣",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 927,
                  "content": "she even said, “…(a man lol)” when she saw her husband’s doctor is a man. she definitely only went to see if the doctor was a woman or not",
                  "id": 13,
                  "comments": [
                    {
                      "score": 453,
                      "content": "It would’ve been SO MUCH EASIER to just google the doc. Soooo… she’s disrespectful, stalking her own husband, AND too dumb to google.",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 91,
                      "content": "Plot twist: the husband is now gay.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "Bet my life she’s cheating or wants to",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 534,
                  "content": "This post is rough. My sister had to drag my BIL to the doc and go with him to make sure he followed up or he would ignore it. Turns out he had stage 3 cancer. He is 6 years in, recently got a hole in his stomach and won't be able to even drink water for 2 months while they try to let it heal. I don't like him, but I wouldn't wish that on anyone.\n\nSo, a world exists where people have to do this with their partners. Partners exist that will listen to a doctor then blow them off (which is what happened for a year until my sister got involved).\n\nBut it doesn't sound like OPs husband needed that. I wish he would have told her to get lost during the appointment. I'm more long-term single, so I don't get why he didn't. I guess I can't imagine putting up with anyone's bullshit but my own lol.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 377,
                      "content": ">I wish he would have told her to get lost during the appointment. I'm more long-term single, so I don't get why he didn't. I guess I can't imagine putting up with anyone's bullshit but my own lol.\n\nPeople like OP who are entitled, violate boundaries and play power games, can only marry people like her husband who are unwilling to throw someone under the bus, and are patient. Otherwise the relationship will fall apart immediately!\n\nAlso I noticed that people like OPs husband usually have a parent who is also invasive so they have normalized OPs behavior.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 231,
                      "content": "Yeah, my parents both go to each other’s appointments, because my Dad is super hard of hearing (even with his hearing aids) and they’re both at the age where they miss stuff, or mis-remember what was said. So, they go, and they both have their little medical notebooks, and they take notes while the Doctor talks to each other. It’s actually kind of cute!\n\nBUT… this is also something that they both agree on! They didn’t barge in there and demand to be a part of it, like OP!",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "I’m surprised the front desk let her go in the back just based on her word that she’s his wife. Im guessing this is a new doctor since she had to tell them in the first place and she didn’t already know the doctor’s a man. So the receptionist likely hasn’t seen her before. \n\nIt’s one thing if they came in together, but they came in separately and husband obviously didn’t tell the receptionist she was coming. Maybe it’s because I’m long-term single too, and this may be a normal situation for couples, but I find it unnerving that anyone could walk into my appointment by saying they’re a spouse.",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "I'm surprised that the doctor even entertained her. \n\nIn health care your spouse is exactly like a stranger.  No one gets your medical info without your ok.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Similar with my dad, he isn't great at advocating for himself and has let doctors make a lot of half asses decisions regarding his healthcare\n\nAn example is: he's type 1 diabetic and was at the tail end of his kinsey function, he could still produce urine but not do a lot of filtering. He has a mild heart attack and the hospital decided to use contrast dye for some tests WITHOUT first giving him a treatment to protect his kidneys. They knew he still had some kidney function left but figured it wasn't worth saving. He just let them do this.\n\nMom goes to every appointment with him now, just in case the Dr has a thoughtless idea and needs to be strong armed into not doing it.\n\nIf that were the case with op and husband I'd say n t a and the husband was being irresponsible, but the post would also obviously be way different from what we got.\n\nOP is YTA for doing this and proving that she can't be trusted with husband's medical health",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Speaking as a doc, it's actually sadly common to see men being dragged in by their partners.  Having been taught not to 'complain' and to 'man up' a lot of men neglect their physical or emotional health. I'm glad your BIL got help in the end.   \n\n\nThere's a reason married men often live longer or healthier lives than single men....  \n\n\nOP's husband would, in an ideal world, feel able to confide in his wife. However there seem to be very large reasons why he doesn't - and her conduct proves it.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 392,
                  "content": "She was worried about her potential problem, not his. It displays a serious lack of trust. There is no relationship with no trust.",
                  "id": 24,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "I don't even think she was necessarily looking for a female *doctor*, I think she may have been looking for evidence of cheating. If she showed and he wasn't at the Dr's, it would've been obvious what was happening instead.\n\nI feel like husband picked up on that when she asked if Dr was a female, hence the side glance.\n\nTo be clear, op YTA. I'm chronically ill, I don't care who I tell about my issues, who else is around, I just don't care. But that's ME. MOST PEOPLE DO NOT FEEL THE SAME WAY. Husband should've informed his Dr he didn't want you in the room, they would've stopped you from entering if he did. He gave you a chance to be an adult and respect his boundary request. You failed.\n\nAlso who tf cares if the Dr is a woman, she's a professional, and life isn't a porno. \n\nGo to therapy before you lose your marriage for the love of christ",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "I'm worried what would have happened to that poor man if Dr was a woman.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "in my experience those who accuse in this situation are suspicious because of their own thoughts or actions. My ex used to wonder who I was banging because the passenger seat was adjusted in my car, I used to give rides home to fellow co-workers and she went to that instead of 'how nice you are to give rides home to people.' Because she was banging someone at her work.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": ">a man lol\n\nWhich roughly translates into \"my suspicions were baseless and not at all the case so I can laugh about it now",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I'm trying to understand OP's thinking.  Did she suspect that her husband is faking a medical condition with all the costs associated with that to nail his female doctor in the exam room?  wtf",
                  "id": 29,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Yeah, it's pretty bizarre. Like men having sex with female doctors in exam rooms is this common problem lol\n\nIf she really was nervous about this, something is not right with her.",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "It's not the doctors you need to worry about, it's those dental hygienists.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1205,
              "content": "He probably glanced at her after she “joked” about it because he was thinking not this crap again.",
              "id": 32,
              "comments": [
                {
                  "score": 356,
                  "content": "Oh,  definitely.  My ex was crazy jealous and I could always tell when he was about to start his shit.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 25,
                      "content": "What a pain in the ass way to live. I’m glad he’s your ex now.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 180,
                  "content": "YUP. I bet OP is the type to get angry if a female barista serves her husband at a coffee shop.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 87,
                      "content": "And she probably expects him to be rude to female servers or else he's \"flirting\".",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "I have an ex who changed the voice on my Garmin sat nav because it was female. No f*\"$ing kidding. Terrifying red flag.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 27,
                  "content": "Exactly. I'm sure his interior dialogue went right to \"fucking hell, I've been stressing out over my health for the past few months and your biggest concern is that I might be attracted to my doctor? Really?\" \n\nWay to make *his* health issues about you and your insecurities.",
                  "id": 38,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1109,
              "content": "Yup! And then “it was a man lol” \n\nAbsolutely zero respect",
              "id": 39,
              "comments": [
                {
                  "score": 113,
                  "content": "I'm curious on how she would have reacted if it was a young, attractive woman.  🤔",
                  "id": 40,
                  "comments": [
                    {
                      "score": 19,
                      "content": "I have been in this kind of nightmare \"relationship\", dude would never hear the end of the ignorant hurtful accusations.",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "as a formerly attractive formerly young woman who had mostly much older married male coworkers (none of whom i wanted in any way whatsoever) some of whom had wives like this, i expect there would have been some awfully awkward conversation where the wife told the doctor to back off her husband in an uncomfortable location in front of the doctor's coworkers. the poor doctor would then have to deal with the hostile wife and her unjustified suspicions, as well as the work rumor mill painting her as a harlot home wrecker and in this case potential jeopardy to her license for an implied inappropriate relationship with a patient.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 46,
                  "content": "Yeah I don't get why that \"it was a man lol\" was included whatsoever.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 79,
                      "content": "because they were lying about the \"joking\" part of this line\n\n>I jokingly asked if his doctor was a women\n\nso they felt the need to explicitly dismiss the \"joke\" when they saw it was a man",
                      "id": 44,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 36,
                  "content": "[removed]",
                  "id": 45,
                  "comments": [
                    {
                      "score": 23,
                      "content": "This, so many times over, this. \n\nI don't take my husband to those appointments either, because I find the whole process (necessary though it may be) completely humiliating and it's easier for me to deal with that by myself. He'd be fine support, it's not on him at all, I trust him implicitly - it's 100% on me and no statement on him as a person or anything else. Thankfully for me, he understands this and has never taken it personally.\n\nAlso, OP basically social engineered the doc office into a HIPAA violation. They shouldn't have let her back without checking with the husband, but her timing was spot-on to pull off a \"oh hey I'm his wife, I was running a little late!\" maneuver. That's extremely manipulative and controlling and I doubt it's her first rodeo with this kind of behavior. YTA big-time.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "Not only that, she said 'is it a 'women'.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Right? This wasn't about \"caring for her husband\", it was jealousy because \"what if the doctor is a girl? She might be hot\". \n\nDisrespectful of the doctor too.",
                  "id": 48,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "That part got me. The lol was enough to make my skin crawl. She's horrible.",
                  "id": 49,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 664,
              "content": "I was having a lot of health issues for a couple of years and my partner offered to go with me to all of my appointments *if I needed/wanted him*\n\nWould he have preferred to come anyway because he was worried?  Yes.  But if I’d asked him not to, he would have respected that.\n\nThere have even been appointments where I’ve told him I’d like him to be there, but I understand if he cannot due to work/other commitments.  He’s always made the time.\n\nBut he’s the opposite and prefers to go to appointments alone and then just anxious texts me literally everything in between things LOL.  But that’s fine - he has every right to do that as well.\n\nI’m appalled at OP’s lack of basic respect",
              "id": 50,
              "comments": [
                {
                  "score": 172,
                  "content": "I'm offended at how accurate you are describing me. /s\n\nDo I want to go to my wife's appointments? Nah. But if she says no I will ask her multiple times just to make sure it hasn't changed. If she does want me there I would punch my bosses baby dog in the face to be there (not really, but you get the point).\n\nBut leave me alone about my own problems because society taught me to internalize my own problems back in the 80s and 90s. Again, /s... but not really...",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "My husband didn’t want me to go or find out about his blood work results because he was embarrassed of a few things on his blood work. It was a great moment for us to talk and me to assure him I respect his privacy but I won’t judge his health issues because I have a ton myself and he’s not once been rude about mine. But I’m going to let him tell me when he’s ready (unless it’s like life threatening then of course he’d say something).",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 635,
              "content": "As someone who is chronically ill, I feel more comfortable alone at the doctors office. I can advocate for myself and my doctor is wonderful. But if a loved one ever unconsentually INVADED my doctors appointment? I’d lose my trust in them forever. This is the sow deep seeds of mistrust kind of mood. OP is an absolute YTA and I hope the husband considers taking a long hard look at their marriage. \n\nIf you simply can’t wait for your husband to eventually tell you how it’s going, how can your husband trust you to be a trustworthy and caring other half when in sickness. \n\nOP making it about the doctor possibly being a women is incredibly telling. You don’t trust your husband. And it’s pathetic that you took it a whole step further in violating a patients privacy. 🚩",
              "id": 53,
              "comments": [
                {
                  "score": 41,
                  "content": "I'm honestly confused why he didn't kick her out. The office would have supported that. And I *certainly* hope he calls them or pops in and tells them to put her on a no info list and that she isn't allowed in his appointments if she comes in after him.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "This.\n\nI prefer to go to the doctor’s office alone.  If I am physically incapable of driving myself or something, I will ask.  If I say no specifically and a family member shows up anyway, I would never trust them again.  \n\nOP is nothing but 🚩🚩🚩🚩🚩🚩🚩🚩",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 350,
              "content": ">\"I respect him and worry about him **that's why** I went\"\n\nHey that's approximately how my narcissistic mother reasoned while routinely stepping over my (privacy) boundaries. \"I do those things you hate, because I love you!\"\n\nTurns out she just loves \"controlling me\" instead of \"me\"",
              "id": 56,
              "comments": [
                {
                  "score": 29,
                  "content": "I'm sorry to hear that we apparently have the same mother. Hang in there.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 14,
                      "content": "You too! I'm VLC and living for 2 years with my boyfriend's family instead of with her, and I'm doing therapy. It's going much, much better than it could ever have gone had I stayed with my nmom and dad",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "My narcissist mother literally told me she was nagging me with love regarding my health and dr appointments. I'm 41 years old and finally learned to stop sharing ANY vulnerability. She will find a way to use it against me under the guise of 'love/caring.' Feels gross. Check our r/raisedbynarcissists if you want/need validation",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 147,
              "content": "My doc is female I’m a male, my girlfriend has no qualms about it, she knows we are very close to the point of I have spent time with her family and kids, we exchange gifts at holidays. GF respects her and calls her my guardian Andes as she has quite honesty saved my life during two pulmonary embolism incidents.",
              "id": 60,
              "comments": [
                {
                  "score": 74,
                  "content": "Guardian mountain ranges are the best kinds of guardians. I prefer the Rockies to the Andes though.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Good catch. Non functioning brain today I am a Black hills and Big Horns kinda guy",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "I’ve never understood people having issues if a man went to a woman doc or a woman to a man.  The doctor is there to treat your problems, not to flirt or have sex with.  I am probably a little more comfortable around a male doc giving me a hernia check, but even then, I’ve never felt uncomfortable getting one from a woman.  I doubt if that is any doctor’s favorite thing to do regardless of what their gender is.",
                  "id": 63,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 26,
              "content": "I cannot believe anyone in their right mind would ever think showing up at someone else’s doctors appointment when they were specifically told they were not wanted there shows “respect” and “support” for the patient.  OP is completely delusional.  YTA.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "> [he] has been frequently visiting the dr... I jokingly asked if his doctor was a women... I anticipated his next dr appointment and decided to go meet him there\n\nTell me you don't trust your husband without telling me you don't trust your husband.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "\"ma'am your husband is suffering from X medical condition\"\n\n\"Oh thank god, I thought he was ogling a woman!\"",
              "id": 66,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2995,
          "content": "As an RN I get fired up about the frequent and gross stories about male misbehavior.  (Hear me out please, because \"what's good for the goose\" etc.)\n\nIt's generally along the lines of dad-misbehavior-in-the-delivery-room, such as inappropriate remarks that are not only unhelpful but detrimental (he can't handle the blood, the extra discharge, \"will she ever be the same down there\" and the always horrifying suggestion that since her mother is welcome, his should be too). It's all about failure to understand he's not the patient and his presence is a courtesy.\n\nThis is 100% the same. OP's husband is not incapacitated - as though her presence is required as medical POA.  It's a gross violation of personal privacy.  It should be viewed with the same level of horror as a man bringing his mother and a video camera into the L&D suite to record the birth of his child because \"he's just as much the parent as she is\" AKA \"IT'S ONLY BECAUSE I CARE SO MUCH.\"  (In OP's very own words.)\n\nI can't get over how much of TA the OP is.",
          "id": 67,
          "comments": [
            {
              "score": 478,
              "content": "This is incredibly well said. When my wife was giving birth, I was mainly worried about staying out of the way and keeping my mouth shut so I wouldn't interrupt doctors or nurses. For our second child, my wife asked me to speak up a bit more!\n\nEdit: fixing autocorrect",
              "id": 68,
              "comments": [
                {
                  "score": 159,
                  "content": "Haha my first one I was trying to say she did a good job and she told me to shut the fuck up because she wasn't.\n\nFor second I shut up and just helped her with breathing  and letting her destroy my hand during pushing stage.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I was present for all 4 births and knew better than to make any inappropriate comments. I mostly kept my mouth shut and did as I was told. I had amazing experiences like being able to cut the cord and seeing the baby crown.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 215,
              "content": "I'm still wondering how she just walked into the office?  Is this in the US? The medical facilities I've been to the \"office\" has a reception area that to get to the back has a locked door that you have to be escorted back to.  No one just \"walks into the office\".",
              "id": 71,
              "comments": [
                {
                  "score": 89,
                  "content": "“Im here to see X.” Can you get you in some places pretty easily, including hospitals.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 83,
                      "content": "My experience with that in medical facilities.  They check to see if the person is authorized and if the patient wants anyone back there.  Just my experience with my wife. I've never been allowed to just walk into the office unannounced as the OP claimed.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Not where I am, what if the partner is abusive?",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Yea not in my hospital.  Unless you were previously authorized that day in advance by the patient.",
                      "id": 75,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "US here…we have reception or waiting rooms where we tell the desk person we are there for our appointment and we have a seat. Then, in a bit, a nurse comes through a door and calls our name and we’re escorted to an exam room where she does the preliminaries, blood pressure, questions etc. THEN the dr comes in. We can’t just bulldoze our way back there calling our spouses name to see which exam room they’re in. I think OP meant she walked into the waiting room. And YTA.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "That’s another creepy addition to this story",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "What a weird angle. My wife was going through a cancer scare and every step of the way I was supportive but I asked her permission if she wanted me to drive her to the appointments, wait in the lobby, or occompany her into the room with the doctor. She kept me up to date on what was going on, but I never felt the need to bust into the doctor office.",
              "id": 78,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "I agree! She totally disrespected him.\n\nWhen OP turned up in the doctor's office, the doctor should have asked the husband if he wanted his wife to come into the examining room. We don't even know what kind of doctor this was or what OP's husband is being treated for! Did she barge into a proctologist's office? \n\nAlso, if the genders were switched, I wonder if the staff would so swiftly usher a husband into his house wife's appointment.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "My ex SIL asked my daughters OB/GYN the dumbest, most embarrassing thing ever.  She was in labor and her Dr come in to check her, while he was down there, SIL asked him he he got off on doing that. My daughter shook her head, told him to shut up and get out.  She eventually let him back in, but told him not to open him mouth, if Dr or nurse were in the room.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1409,
          "content": "[removed]",
          "id": 81,
          "comments": [
            {
              "score": 332,
              "content": "Yeah what if the specific issue is something he’s embarrassed about? An example of this with men is typically something like ED. Because men are spoon fed this idea “If you can’t perform in bed you’re not a man”. As a result it’s embarrassing for them and usually discussion about treatment is too.",
              "id": 82,
              "comments": [
                {
                  "score": 260,
                  "content": "To be fair, if husband was seeking help for ED, OP did him a favour by showing herself at the doctor's office, like \"that's me, I'm causing it!\"\n\nAdding I know ED is a medical condition with many causes, this is just a joke.",
                  "id": 83,
                  "comments": [
                    {
                      "score": 188,
                      "content": "\"Ah yes, I can now see why your wiener recoils at this absolute dumpster fire of a human being.\"",
                      "id": 84,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 61,
                      "content": "\"It's me. Hi. I'm the problem. It's me.\"",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "His ED must be healed he now just doesn't want to sleep with her at all. After that sheer disrespect I wouldn't either.",
                      "id": 86,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "XDD I lost it at  imagining her bursting into a room in the most undignified manner shouting \"That's  ME!\"",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Doctor \" I'm going to refer you to a specialist for this condition\"  Gives husband the number for divorce attorney",
                      "id": 88,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 48,
                  "content": "It's not so much spoon fed as it is an artillery barrage. The accepted definition of masculinity today is so toxic it is downright depressing.\n\nNow this guy has to deal with his wife not respecting his wishes and her thinking that he is a jerk for being upset about it. It certainly won't help his suituation.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Yeah and it takes forever to get into doctors too and to build up the courage to even go for issues like that. \n\nAbsolute invasion of privacy",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "It doesn’t even have to be anything particularly embarrassing. You should be able to talk to your doctor with complete honesty and ask anything and everything that comes to mind. This is a lot harder to do when someone else is there because you might feel like you’re wasting their time, or get worried about coming across as stupid for asking something that might be obvious to others. \n\n\n\n\nEven if you trust your partner completely and are willing to tell them everything, that but of privacy should be respected. Chances are they’ll tell you everything that happened anyway.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 188,
              "content": "Right! When I was confiding with my doctor about my mental health problems I didn't want my husband there. I needed privacy, there are things I find embarrassing and despite my Hub's being incredibly supportive. I just didn't want him there.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": ">\n>You need to apologise to him right the hell now!. \n\nThis phrasing reminds me of Spock trying to curse in ST: IV",
              "id": 93,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 805,
          "content": "[removed]",
          "id": 94,
          "comments": [
            {
              "score": 441,
              "content": "How was he supposed to know she was “supportive” if she didn’t stalk him and violate his boundaries? Stressing him out and making him too uncomfortable to share potentially important information with his doctor is just her way of “helping.”",
              "id": 95,
              "comments": [
                {
                  "score": 133,
                  "content": "Yeah, it's terrible that she tried to mask her overstepping and disrespect for his boundaries/choices as 'support'. If she wanted the best for him, she would've listened to what he wants.\n\nIt's clear that she decided to ambush him at least in part due to worry/jealousy about the fact that hoa doctor might be a woman. The 'joking' question, the unnecessary clarification.. She seemed unable to respect her husband's request for privacy. It looks like she couldn't understand the fact that her husband wanted to be alone because he would feel more comfortable sharing private details without his wife listening and possibly commenting on them. Instead, her mind just jumps to the fact that his doctor might be female. It's sad.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 72,
              "content": "It's even worse because she asked, I think. Had she not asked she could now argue that she didn't know he didn't want her there. Would still not be okay, but by asking first and then ignoring his boundaries she showed complete lack of respect for his wants and needs.",
              "id": 97,
              "comments": [
                {
                  "score": 13,
                  "content": "If she hasn’t asked  (and wasn’t aware of his wishes) and just decided to show up, the proper way to do this is to advise the receptionist that you’re so and so’s spouse and ask them to advise him that you’re in the waiting room if he needs you. I wouldn’t even advocate that without speaking with my husband but that’s the only way the receptionist at the doctor’s office should have allowed it to go down.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "This is the exact reason why, as a doctor, I always ask the patient’s family to stay in the lobby.  If the patient insists they come, fine, they’re welcome to it…\n\nBecause you never know when a crazy family member is going to show up uninvited.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 606,
          "content": "The way OP got defensive and felt the need to ask if the doctor was a woman, makes me think OP is completely unhinged and has a history of being overly jealous and controlling. There's absolutely no way this is a singular incident, I have a feeling it's a pattern of behavior. I mean, imagine throwing a tantrum like this over your spouse wanting privacy when dealing with medical concerns. \n\nYTA, obviously.",
          "id": 100,
          "comments": [
            {
              "score": 25,
              "content": "[deleted]",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I'm always amused when people think a an opposite sex Dr is going to want to steal their spouse. I mean, if they can look down there when it's smelly and green and dischargey and broken and all that other crap and still think \"that's a dick I want to suck\" they would have to be as unhinged as the op.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yeah, I can’t understand that type of jealousy. \nMy ex husband cheated on me.\nHe also had a female physician that he saw for his medical care and helped treat his alcoholism, as well as a female therapist.  I got jealous of a lot of other women after his cheating but never of them.  Good lord!",
              "id": 103,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 485,
          "content": "100%. If this were a man interrupting his wife’s appointment there would be questions around coercion and domestic abuse. I don’t see any reason why that shouldn’t be the case here. If this were my clinic she’d have been asked to leave.",
          "id": 104,
          "comments": [
            {
              "score": 97,
              "content": "Yes, absolutely. Her behavior is raising red flags for all types of abusive behavior.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "You don't even have to interrupt.  My wife asked me to go with her to an appointment once and the doc was immediately irritable and told me to wait outside.  I wasnt doing anything but sitting in the chair waiting not talking.  It wasnt like she had a broken arm or anything either she had a kidney stone",
              "id": 106,
              "comments": [
                {
                  "score": 35,
                  "content": "Yeah, if it's ER they can be jerks.  I told a doctor in the ER I was having a kidney stone. He jumped all over me.\n\n\"I said tell me why your here not what you think is wrong with you. I will tell you what the problem is\"\n\nThen I got mad and said \"I have had them before and if the state granted me the authority to write my own prescription I wouldn't have any need for you\". \n\nGood times.",
                  "id": 107,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Went into the ER for what I think was an anxiety attack (I couldn't breathe). ER gave me sedatives, tested me for sedatives, and then told me the problem was that I was on illegal sedatives.",
                      "id": 108,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "This should be higher up.\n\nIf this were a man accusing his wife of being romantic with a doctor and then barging into her appointment without her consent, people would absolutely be bringing up abuse.\n\nJust because OP is a woman, everyone is talking about jealousy and lack of respect, but no one is naming it for what it is: abuse.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I have no idea what kind of hospital would let you join an already started  appointment without the patient specifically asking for it. WTF",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 342,
          "content": "This right here. YTA OP. Your husband gave you a boundary and you crossed it. You deliberately disregarded his feelings and disrespected him. He is your husband, not your child.",
          "id": 111,
          "comments": [
            {
              "score": 19,
              "content": "Unless that kid was like under 12 years his would still be a gross violation of privacy. Teens are old enough to go back and speak privately with their doctors. \n\nThis woman is just wildly insecure and willing to trash her marriage over it.",
              "id": 112,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "Yup. Zero respect for him. Zero respect for his privacy. Insecure and jealous. YTA.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 337,
          "content": "What's a little surprising is that the doctor's office let her into the examining room 10 minutes after he went in there, without asking him, even though she said she is his wife.  Seems that a reputable doctor's office would stick their head into the examining room, say his wife is outside, and ask if he wanted her present in the room.  Once she was in there, why didn't he stand up for himself and say that he wanted privacy?  And finally, why didn't the doctor say anything?  This sounds odd.\n\n&#x200B;\n\nBut, if this post is legit, OP's a huge AH.",
          "id": 114,
          "comments": [
            {
              "score": 98,
              "content": "I feel like I'm in crazy town.  You can be in the office and meet the doctor later, but who just allows someone in to the examining room?  His doctor sucks.",
              "id": 115,
              "comments": [
                {
                  "score": 28,
                  "content": "Yeah, the door shouldn't open after the dr enters imo. They could have been in the middle of a physical exam where the husband was undressed. Its inappropriate for the staff to let her go in after the appointment started.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 27,
              "content": "[deleted]",
              "id": 117,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "That weirded me out too - if I was speaking to my GP and they let someone in, without my consent, because they claimed to be my spouse, I’d be so angry! What happened to patient confidentiality!",
              "id": 118,
              "comments": [
                {
                  "score": 9,
                  "content": "HIPAA!!!",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Makes me wonder if she didn't say something like ' oh he's expecting me, I'm just a little late'. Just another AH move",
              "id": 120,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "This is what I was thinking. The MOA in that office should be fired if they just let the wife go in without checking if it was okay.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 172,
          "content": "I get the feeling OP wasn't joking when she asked him if his doctor was a woman. \n\nEither way, YTA. Give the poor guy some space to see his doctor on his own.",
          "id": 122,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 82,
          "content": "The only reason OP was likely even allowed in was because they’re married. At least in the US. I had to go to the doctor and even though I wanted my BF with me he wasn’t permitted in the back.",
          "id": 123,
          "comments": [
            {
              "score": 163,
              "content": "> I had to go to the doctor and even though I wanted my BF with me he wasn’t permitted in the back.\n\nIt is not because of married or not, it's to make sure you are safe and not an abuse victim. Men generally do not get that kind of treatment, as in taking into consideration that they could be victims of spousal abuse and should be separated from the other party.",
              "id": 124,
              "comments": [
                {
                  "score": 98,
                  "content": "That's why they should always separately ask the patient (no matter their gender identity or age, and that includes children) if they're safe at home and ok having the person be in the room with them. Good doctors do it- unfortunately there are a many mediocre and bad doctors out there too.",
                  "id": 125,
                  "comments": [
                    {
                      "score": 23,
                      "content": "When I was getting prepped for knee surgery, they asked me if I felt safe at home…in front of my husband. It boggled my mind. Ask me that in private!",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "After they've asked you privately if you're safe at home and are ok with that person coming with you, they should have allowed it. Frankly, I'd personally walk out of an appointment that refused to allow a support person with me- I'm suspicious as hell of \"because the doctor doesn't want them there\" as reasoning.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 24279,
      "content": "YTA. First of all, he asked you not to come. That should be enough. Second, you were not there to show him support, you were there to make sure his dr wasn't a woman. You sound jealous and irrational, not to mention pushy. Major issues here.",
      "id": 128,
      "comments": [
        {
          "score": 3491,
          "content": "This! \n\nYTA, OP. Really, get your jealousy under control before you lose your marriage, because now you're a walking red flag.\n\nEdit: typo",
          "id": 129,
          "comments": [
            {
              "score": 350,
              "content": "[removed]",
              "id": 130,
              "comments": [
                {
                  "score": 24,
                  "content": "All of this!! We just have a standing 'Let me know if I need to be there' for any kind of appointments. \n\nDefinitely YTA here. I wouldnt be surprised if he never mentioned another appt to her again.",
                  "id": 131,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 21,
                  "content": "The amount of people who think being a spouse or parent trumps someone’s right to privacy is fucking crazy",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "His medical provider should have made her wait in the waiting room unless he gave consent. In the US she/they broke HIPAA laws",
                  "id": 133,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": ">You weren't well-meaning and weren't as supportive as you thought you were.\n\nI'm pretty sure OP didn't geninely think she was being supportive. It's just an excuse to give people so she can steamroll over their boundaries.",
                  "id": 134,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "I'm a living example of someone with a wife who was so concerned with me cheating... it turned out she ended up cheating on me herself.\n\nPeople project unto others. If they're concerned about you cheating, it might be because they've already thought about it (or did it).",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1678,
          "content": "Yeah, this is the thing. Op, YTA. This is super uncomfortably controlling and gross. Doctors don't care to try to seduce your husband, the doctor being a woman doesn't matter even if his problems involved needing a genital examination.\n\nDoctors don't hold the same standards of shame and sexuality towards the human body as most people, and it's detrimental *to his own health* to try to interfere with his health care *just because you're worried the doctor might be a woman.*\n\nAlso, being his wife doesn't mean anything in the medical field, he could just tell the office to never allow you to know anything from them and they would still legally have to listen. Show support by sending a message at the anticipated time and express your love and hope for his safety, not being a jerk because you feel like he isn't accepting of *your* standards of support.",
          "id": 136,
          "comments": [
            {
              "score": 528,
              "content": ">Also, being his wife doesn't mean anything in the medical field, he could just tell the office to never allow you to know anything from them and they would still legally have to listen.\n\nI'm kind of surprised she was allowed to just wander back to his room as is",
              "id": 137,
              "comments": [
                {
                  "score": 488,
                  "content": "I’m surprised the doctor didn’t kick her out immediately. Spouse barging into a medical appointment that the patient didn’t bring them to is a massive red flag (eg. for DV)",
                  "id": 138,
                  "comments": [
                    {
                      "score": 238,
                      "content": "This. I work in the hotel industry and at least at the one where I work we take that serious. We're not putting a battered spouse at risk because we gave info to the wrong person, and even if they're sneaking around for less reputable reasons it's not our business to get involved either. The only role of a service provider of any kind is to maintain the privacy of their client, and it's not for us to decide who should be exempted from that.",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "This kind of thing could be a little difficult to navigate, as kicking out an abusive partner could actually lead to more harm to the patient later on. I'm sure there's specific training/guidelines, but I can see how that's delicate when your goal is safety.",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "The way it’s gone wherever I’ve worked is that the spouse (or whoever) says they’re to meet the pt at their appointment and the pt already back in the room. Then someone would escort the alleged spouse (or whatever), and poke their head into the room first to confirm it was ok per the pt and the medical provider, and if not then it’s usually something like, “Oh, sorry the doctor is in the middle of their exam, please hang out in the waiting room and we’ll come get you once that part is over.”\n\nAnd if the spouse (or whoever) complains you blame it on the doctor.",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 164,
              "content": "I have heard of a case while working in the hospital of an older couple coming in with their daughter. The couple entered the room, sat down, and told the doctor their daughter was in the toilet.\n\nThey began asking the doctor questions, getting her to explain every detail. But something was off. The doctor started getting morrw and more suspicious. In the end, they shut down and refused to speak until the patient came in. She never did.\n\nTurns out the parents intercepted or faked the daughter's appointment and came digging for details.\n\nThe story was passed around to warn everyone not to answer anything unless the patient was present.\n\nEdit:  I wasn't the doctor or *a* doctor.",
              "id": 142,
              "comments": [
                {
                  "score": 28,
                  "content": "My ex was a medical student and someone in his year got an automatic fail for giving medical information to a spouse in the mock appointment section of the test..",
                  "id": 143,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "Wait so did they get some info before the doc got wise? It sounds like it worked initially.",
                  "id": 144,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Yes. That's why I suspect things didn't work out so hot. The story never had any 'hospital does X', so they likely never saved the day (that place sucked so I'm not surprised)",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 96,
              "content": "The \"detrimental to his health\" piece is super important.  If the husband can't go to the doctor without (a) spilling all the details to his wife even though he'd rather have some privacy, and then (b) having her show up at the doctor's office to make sure the doctor isn't attractive, then he might just decide not to go to the doctor.\n\nWhat she's doing -- intentionally or unintentionally -- is making it very expensive for him to see the doctor, in terms of emotional and physical costs.  She's putting up really big barricades, and making him jump them if he wants to see a doctor.  And, you know, a lot of people will see that and just think \"screw it, I'm not *that* sick.\"",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 316,
          "content": "This - she \"jokingly\" said \"is she a woman\" which is glaringly obvious motive here. I think you should seek counselling for Jealousy / trust issues. YTA",
          "id": 147,
          "comments": [
            {
              "score": 24,
              "content": "What I don’t understand is how she didn’t already know his doctor was a man. If she’s so concerned about his health, surely she would have asked how his appointments went, and would have found out the gender of the doctor that way. “Hey, how did your appointment go?” “Oh it was okay, the doctor was nice. He said xyz.”",
              "id": 148,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "That kind of jealousy is a reddit red flag for projection too. Makes you wonder what she's been up to.",
              "id": 149,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 190,
          "content": "I’m a woman and I used to have a male doctor for years before he retired, I don’t think it remotely crossed my boyfriend’s mind to give a shit. Because generally people are not going to the doctor’s office for a quickie. OP is weird.",
          "id": 150,
          "comments": [
            {
              "score": 28,
              "content": "Totally! Anyone who thinks a doctor’s office is a hot bed of passion and lust either watches too many TV dramas or too much porn.",
              "id": 151,
              "comments": [
                {
                  "score": 17,
                  "content": "And also just doesn’t go to the doctor apparently. \n\nNothing gets me in the mood more than a stainless steel bed with a sheet of paper on top, bright fluorescent lights shining in my eyes and the smell of sanitizer everywhere.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 13,
                      "content": "*keep going*",
                      "id": 153,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Not to mention Doctors face being struck off for that (at least here in the uk) as it's considered a power imbalance. Not saying it never happens but still.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I’m a woman and my doctor is a man that is my age and FINE AS HELL. My husband is aware that my doctor is good looking and never, not once ever has he suggested that my appointments are his business.\n\nOP is a total AH.",
              "id": 155,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Also a woman. With a lovely history of cervical cancer and a hysterectomy. I've had more men  spelunking in my vagina than I can count now.  Weirdly my husband isn't jealous at all. Can't think why. /s",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "It's such a disappointing comment especially from a woman. Sounds like OP has had a life with little hardship or she'd know the last thing on her husband's mind while dealing with health issues is making googly eyes at his doctor. Like maybe elsewhere Idk their lives, but the doctor?!",
              "id": 157,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 29,
          "content": "[deleted]",
          "id": 158,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "I’m getting some psycho vibes here",
          "id": 159,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "It's way worse than just jealousy. She also did it to prove the rules don't apply to her, she is in full control of even his most personal medical relationships, and there's literally nowhere he can go that she can't \"get\" him. It's bullying of the highest order.",
          "id": 160,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Yep! Who cares if he has a woman dr. Her insecurities are not a reason to disrespect his privacy and boundaries.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7316,
      "content": "YTA. Being his wife doesn’t mean you’re entitled to breach his privacy. You‘re invasive and controlling. You need to drop that if you don’t want to risk your relationship.\n\nIf I was your husband I would also have a serious word with whoever let you enter the office. Identifying as someone’s wife doesn’t mean they can enter without consent.",
      "id": 162,
      "comments": [
        {
          "score": 1463,
          "content": "Definitely. As a medical professional, I’m not even allowed to confirm if someone is a patient of mine, even to a spouse, without permission from the patient themselves.  This is a massive breach in confidentiality to allow her to enter while he was in consultation.",
          "id": 163,
          "comments": [
            {
              "score": 411,
              "content": "Exactly! I just don’t understand how the doctor’s office even let OP into the room. That’s a massive problem that her husband will need to address with them—honestly, I’d be finding a new doctor.",
              "id": 164,
              "comments": [
                {
                  "score": 167,
                  "content": "I read it as \"office\" meaning the practice as a whole and she met him in the waiting area.  I doubt she would've been allowed to simply wander back to her husband's exam room.",
                  "id": 165,
                  "comments": [
                    {
                      "score": 80,
                      "content": "It does kinda sound like that, but it still sounds weird. I've never been to a doctor's office where the doctor comes out to the waiting room, which is the only way it would make sense that she could run into the doctor without being improperly allowed in. It could happen I suppose, but still seems weird.",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 275,
          "content": "Agreed. Husband should definitely report it.",
          "id": 167,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 109,
          "content": "Right? How do they know she’s not lying? I can walk in and claim to be anybody’s wife. They’re just gonna take her word for it and let her in off the street?",
          "id": 168,
          "comments": [
            {
              "score": 21,
              "content": "The staff also contributed to the wife's sense of entitlement by not protecting their patient's privacy.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Right! I was always asked if my husband could come in if he arrived after me. Or I would tell them up front that he was allowed in. I also had to give signed permission for him to even be able to ask about my medical history or results. Of course he is listed as the only person allowed to get my medical records. Because my husband respects my wishes and boundaries. OP's husband needs to inform his doctors office that his wife isn't allowed access to anything.",
          "id": 170,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5612,
      "content": "[removed]",
      "id": 171,
      "comments": [
        {
          "score": 1206,
          "content": "She has zero respect for her husband. And is potentially very jealous and maybe possessive. I wonder what else she tries to be “supportive” in. YTA Op, and because I have a funny feeling about you and your thought processes, yes I’m a woman.",
          "id": 172,
          "comments": [
            {
              "score": 155,
              "content": "[removed]",
              "id": 173,
              "comments": [
                {
                  "score": 17,
                  "content": "*ex-husband",
                  "id": 174,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Haha I made another comment about exactly that. Great minds, and all",
                  "id": 175,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 125,
          "content": "\"What is wrong with you\" is the correct response. If this were my SO I'd pack my bags the same day and serve them papers immediately. There are lines you don't cross.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "What OP did was not OK. But, what kind of doctor's office just allows some random woman to saunter into a patient's appointment without getting their consent. It doesn't matter who OP claimed to be - she could have been anyone.",
          "id": 177,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "Mixing entitlement and insecurity is a wild time.",
          "id": 178,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3431,
      "content": "YTA. \n\n  \nCan appreciate being very worried about a spouse's health and wanting to talk to the spouse's doctor, but it's incredibly inappropriate to insist on being part of the appointment against the patient's wishes.",
      "id": 179,
      "comments": [
        {
          "score": 443,
          "content": "[deleted]",
          "id": 180,
          "comments": [
            {
              "score": 100,
              "content": "I often pick the lock on the bathroom and bust in when my SO is taking a shit, just to make sure they know there are no boundaries in our loving relationship!",
              "id": 181,
              "comments": [
                {
                  "score": 13,
                  "content": "[deleted]",
                  "id": 182,
                  "comments": [
                    {
                      "score": 34,
                      "content": "She could be having an affair! Right in his own bathroom!",
                      "id": 183,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "I have no idea???",
                      "id": 184,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 97,
          "content": "It looks like she was more concerned if the doctor was a woman, so it appears that she was feeling jealous.",
          "id": 185,
          "comments": [
            {
              "score": 14,
              "content": "I'm almost disappointed the doctor wasn't a woman, I really want to know what OP would have done in that circumstance.",
              "id": 186,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 69,
          "content": "Yup. \nOkay: “I’m really worried about you. Please tell me what’s going on so I can support you.”\n\nOkay: “I think you should let me come to the doctor with you. You tend to downplay your symptoms and walk out having not told them what’s really going on. I’m good at advocating like this, and I’m good at thinking of questions in the moment. Please let me come help you.”\n\nTotally crazy: “You’re going to the doctor a lot so I think that doctor is a woman. And that obviously means the two of you are banging in the middle of a crowded office where an assistant could walk in at any minute. Everyone knows the best sexy times are rushed into a 15 minute appointment slot in a room with negative ambiance.”",
          "id": 187,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "It feels really controlling. \"You can't even have your health to yourself.\"",
          "id": 188,
          "comments": [
            {
              "score": 15,
              "content": "Yeah if i was the doctor I'd be pulling husband aside to ask if he needs some help with an abusive relationship",
              "id": 189,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3360,
      "content": "Your poor husband can't even go to the doctor without you trying to control him and accuse him of cheating? YTA, and you don't seem to like or respect your husband very much.",
      "id": 190,
      "comments": [
        {
          "score": 454,
          "content": "Even asking this makes her an a$$hole. She never went there to support him but to make herself feel important",
          "id": 191,
          "comments": [
            {
              "score": 248,
              "content": "Or to see if the doctor was a female.",
              "id": 192,
              "comments": [
                {
                  "score": 49,
                  "content": "\"Man, my husband is SO sick all the time! Clearly it must be because he wants to fuck his probably-female doctor. I will react by stalking my husband, interfering with his medical consultations, and blaming him the whole way through instead of ever lifting a single finger to support him because I'm too insecure to realize that I also have responsibilities to care for my sick partner in a relationship.\" -OP",
                  "id": 193,
                  "comments": [
                    {
                      "score": 11,
                      "content": ">\"and then air out the drama online so everyone knows about it cus it didn't go my way 💅",
                      "id": 194,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Don’t worry he was “a man lol”.\n\nYikes.",
                  "id": 195,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "\"is a man (lol)\" - the fuck is wrong with this woman.. Jesus.",
              "id": 196,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "And who TF cares if the doctor is the opposite sex?  I'm a man, but my PCP and several specialists that I see are women.  I choose my medical professional based on their reputation and professionalism not whether or not they're hot.\n\nAnd guess what?  When I had my vasectomy, a female nurse handled my genitalia (had to shave the incision sites).  It's a damn medical procedure.  Wife here needs to stay in her lane.",
          "id": 197,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "I wonder if he’s allowed to wipe his ass without her there to “help.”",
          "id": 198,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1841,
      "content": "YTA\n\nHe wanted to go by himself. He wanted privacy. I don’t take my husband to my appointments with the gynaecologist. I like that to be private. The point is, it was never up to you. You have completely smashed a boundary he very clearly set. You were very, very wrong. And to top it all, that appointment was clearly wasted. Your husband couldn’t say what he needed to.",
      "id": 199,
      "comments": [
        {
          "score": 356,
          "content": "[deleted]",
          "id": 200,
          "comments": [
            {
              "score": 195,
              "content": "My gynaecologist really is a man. Lol!",
              "id": 201,
              "comments": [
                {
                  "score": 30,
                  "content": "So is mine and he's the best gyno I've ever been to",
                  "id": 202,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "Mine is too! All the women OBGYNs that I had refused to help soooo. But my husband's PCP is a woman so like...it's all good hahaha",
                  "id": 203,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "So is my wife's. Who cares? \n\n\nI once went to a female doctor whose nurse told me to completely undress... I verified underwear and all because that seemed odd. She gave me a paper vest? Uh... anyways, there I was, sitting, dick out, on the exam table when she walked in. She flinched like she had just been hit. It was so funny. I had been sitting there steeling myself for the awkward situation. That poor doctor got ambushed. We laughed and I put my boxers back on. I'm sure her nurse received updated procedures after that.",
                  "id": 204,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "Nothing so sexy as those super comfortable examining tables and fluorescent lights. Or a 15 minute time limit. Or medical assistants coming in and out of the room at will. It’s straight up Valentine’s Day to go visit a male gynecologist.\n\n/s. Just as your comment was /s. In case anyone thinks either of us is being serious.",
              "id": 205,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "My mum’s gynaecologist was a man and well known for his philandering.\n\nAlso, he was my paternal grandfather. My life might be a weird porn plot.",
              "id": 206,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I’m actually incredibly surprised the doctor didn’t ask her to leave, and that he continued to discuss he his patient’s concerns in front of her. \n\nWould never fly where I live. I’m a carer for my mum and down as her next of kin and I still need permission to speak on her behalf or request information.",
          "id": 207,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1389,
      "content": "YTA\n\nAs a woman, you surely should understand no means no.\n\nYou already know what the issue is, so it isn't like you were being kept in the dark. Some people need close support, some people need privacy. Your husband chose the latter.\n\nIf you were really worried about his condition and wanted to talk to the doctor about it, the pair of you could have possibly set up another appointment to discuss it with the doctor. Instead you disregarded his wishes and pushed through.",
      "id": 208,
      "comments": [
        {
          "score": 110,
          "content": "If OPs country of residence had medical privacy laws (similar to HIPAA in USA) then her husband's doctor would be restricted from speaking with her, without her husband present or his explicit consent. She should be abiding by her husband's wishes & staying out of his medical appointments all together; he could have had other concerns that he planned on speaking with his practitioner about during this appointment & if that's the case then she royally f'd up.",
          "id": 209,
          "comments": [
            {
              "score": 8,
              "content": "[deleted]",
              "id": 210,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 99,
          "content": "> As a woman, you surely should understand no means no.\n\nYou would be surprised, just like men women can often not understand consent",
          "id": 211,
          "comments": [
            {
              "score": 44,
              "content": "From my very limited experience women are worse in that regard because they aren't often told no. Can't tell you how often they would continue to grope or invade my personal space even after giving them a firm no. It usually ends with you being called gay. A lot.",
              "id": 212,
              "comments": [
                {
                  "score": 27,
                  "content": "Yeah, unfortunately in my experience \"no means no\" is for women and \"no means you're gay\" is for men.\n\nWe'd all do better if we could just call out bad behavior without having to always gender it.",
                  "id": 213,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Yeah, I've found that far, *far* too often, women seem to interpret \"no means no\" as \"a *woman's* no means no\"",
                  "id": 214,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Same with body positivity and slut shaming (as virgin shaming men upholds slut shaming women) too, and I say that as a progressive, just a disappointed one",
                      "id": 215,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Yeah, just the idea that they wouldn't be capable of that (ignoring consent) is one that has caused *so* much harm.",
              "id": 216,
              "comments": [
                {
                  "score": 16,
                  "content": "Yup, especially for male victims of SA and worse :(",
                  "id": 217,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "\"your argument about consent is invalid, coz I'm obviously not doing anything creepy\"\n\n- _OP, right before she does something creepy_",
              "id": 218,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 674,
      "content": "YTA.\n\nYour husband asked for privacy and you overstepped completely. \n\nIt is understandable that you'd be worried about your husband's health but you need to be supportive of him in a way that he is comfortable with right now.",
      "id": 219,
      "comments": [
        {
          "score": 19,
          "content": "[removed]",
          "id": 220,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 581,
      "content": "YTA, you didn't want to support him, you actively distressed him. His medical appointments are his own private business and you may have actually negatively impacted his health because he felt less comfortable to open up to the doctor.",
      "id": 221,
      "comments": [
        {
          "score": 20,
          "content": "Poor husband can't catch a break, wife is controlling and then when he goes to the doctor they violate HIPAA to her. \n\nOP's husband is gonna ask if the law firm does discounts for a divorce + medical privacy suit.",
          "id": 222,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "> you may have actually negatively impacted his health because he felt less comfortable to open up to the doctor.   \n\nProbably contributed to, or caused a mental health issue too.",
          "id": 223,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}