{
  "post content": "I (23F) and my bf (27M) are currently staying at his cousin&wife's place (we pay rent and take part in all household activities). \n\nTonight they had some friends over (I should now mention the age gap, as his cousin and wife are in their late 40's. \n\nI don't speak the languages at the table (and they don't speak English). And I'm sick (with fever). I was not allowed to leave the table as it'd be very rude (it's a religious holiday dinner for them) and my bf is not here (he's at work and won't be back until after this is over).\n\nThe wife is very kind and pretty much just lets me chill at the corner but the cousin gave me a dirty look and I already know he will complain to my bf that I was not social and was just on my phone the whole evening. So preparing for it in advance (and giving him a heads up) I texted my bf letting him now I'm just chilling on my phone and helping around if needed. And I'm well aware there will be an argument on the matter tonight.\n\nSo am I the A Hole for being on my phone?\n\n\nUpdate: English speakers have arrived so I had some socializing and that was that I suppose 🤷",
  "id": 1,
  "comments": [
    {
      "score": 7,
      "content": "NAH\n\nThere's a language barrier. There really isn't much you can do to rectify the situation. Your cousins should've let you go to your room.\n\nSounds weird saying that about a 23 yr old",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "I really dont think you're the AH. Honestly, while I understand it's a religious dinner, you should have been resting. You're sick and could easily get others sick as well. With the language barrier, I would have just gone to my room and had the husband explain later. Its ridiculous that you're expected to sit and just eat (if you're able while sick) in silence while not engaging with anyone else. Religious people never cease to amaze me.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. If you're sick with a fever you should be in bed, not trying to be social when you didn't even speak the same languages. I don't understand the cousin's thinking? Did he want you to infect everyone? Did he want you to sit there silently smiling and doing absolutely nothing? SMH",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1 I was on my phone through most of a dinner party.\n2 It's rude not to be social while having guests, even if they're not my guests.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (23F) and my bf (27M) are currently staying at his cousin&wife's place (we pay rent and take part in all household activities). \n\nTonight they had some friends over (I should now mention the age gap, as his cousin and wife are in their late 40's. \n\nI don't speak the languages at the table (and they don't speak English). And I'm sick (with fever). I was not allowed to leave the table as it'd be very rude (it's a religious holiday dinner for them) and my bf is not here (he's at work and won't be back until after this is over).\n\nThe wife is very kind and pretty much just lets me chill at the corner but the cousin gave me a dirty look and I already know he will complain to my bf that I was not social and was just on my phone the whole evening. So preparing for it in advance (and giving him a heads up) I texted my bf letting him now I'm just chilling on my phone and helping around if needed. And I'm well aware there will be an argument on the matter tonight.\n\nSo am I the A Hole for being on my phone?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": -1,
      "content": "[deleted]",
      "id": 7,
      "comments": [
        {
          "score": 4,
          "content": "What do you expect her to do if she doesn’t know the language? Smile and nod?",
          "id": 8,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "My only other option is staring at whoever is talking, as I do not understand anything that is said around me, and they're unable to understand me 😐",
          "id": 9,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 0,
          "content": "Absolutely irrational that something like that would frustrate you. Who cares? She should’ve been resting but instead was made to sit at the table. Especially if she’s paying rent to be in the house, she shouldn’t be forced to do anything she doesn’t want to do in the place she’s literally paying to stay in. If my landlord came up to me and said I was on my phone too much I’d laugh in his face.",
          "id": 10,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}