{
  "post content": "I’ll try to keep this short. My (M57) son (M23) is engaged to Peggy (F22). They have been engaged for 5 months or so. Our culture dictates that Peggy’s father and I share the costs for their wedding. He (her father) said we should provide $10k each, a total $20k budget. I could afford this sure but This seems insane and extravagant to me. I said I would give $5k and he could give whatever he wanted. Peggy’s father also put up 5k.\n\nI told my son this and he told me outright it wasn’t going to be enough. He said “I don’t mind, I figured that me and Peggy would have to pay for some of the wedding”. I asked what he meant. He said no way would they be able to do their wedding in under $10k. I said My own wedding, after haggling and deals, only came out to around $7k so I do not think this is an issue. He argued against me and said that my wedding was 40 years ago and prices were different. He outlined some prices and said the cheapest venue he could find was $5k, and food alone was going to be $2,5k.\n\nHe again said he didn’t mind and he thanked me for giving them money for the wedding but I honestly felt hurt that he thought we were not giving enough. I said how could food come out to 2500 dollars and he said that that was only around $25 per person. I suggested ordering pizzas or sub sandwiches but he looked at me like I was crazy. I said okay well we can just offer less for the photographer and decorator and he said that isn’t how things are done. I said it is how things are done, and maybe if Peggy and him weren’t so spoiled and expecting the best of the best for everything then $10k would be plenty.\n\nAfter I said this he just closed his eyes and thanked me for the money and basically told me to get out. I was complaining about this instance to my wife and she told me I was being a stick in the mud and it’s his only wedding. My friends agree with me though. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 46527,
      "content": "Yes, YTA. He thanked you for the money and is planning on paying for the rest. How they spend their money isn't your business. Can you seriously not envision that prices have increased over several decades?",
      "id": 2,
      "comments": [
        {
          "score": 23042,
          "content": "I got married in 2012. I paid $50 per head for the venue and food. It was the cheapest venue in the area. That same venue now charges $150 per head for the exact same thing. Also don't even think about getting a photographer for under $1k. \n\nSeriously this is why so many people make fun of boomers. They just can't imagine that prices have dramatically increased and they expect young people to be able to do what they did decades ago. My parents bought land and built a house for $90k in the 90s. The same house is now worth $1.5M. Things have changed dramatically.",
          "id": 3,
          "comments": [
            {
              "score": 11602,
              "content": "And the laughable thing is OP is suggesting things like pizza for dinner when I doubt their guests were having pizza 40 years ago\n\nETA: I am not dissing pizza as wedding food. I would be delighted with pizza. Just saying OP likely would not have had pizza and subs for their wedding with a budget that high back then. Could be wrong.",
              "id": 4,
              "comments": [
                {
                  "score": 5478,
                  "content": "Also can you imagine expecting a bride to eat pizza in a wedding dress?!?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3215,
                      "content": "It's time for the cutting of the pizza and pizza slice raises for the newly married.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 359,
                      "content": "I went to a wedding that served pizza.  Bride had a full ball gown wedding dress.  It was very them though.\n\nAnd they were very upfront about it being pizza.\n\nBut anyway, OP’s still the AH here.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "She’s doesn’t need to wear a wedding dress.  Old Navy has some nice white sun dresses that are good enough for FDIL.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Oh, she doesn’t need a wedding dress! That’s just for the spoiled!! I’m sure she has a perfectly good dress in her closet. /s",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "I looked up the inflation- a $7000 wedding 40 years ago would be equivalent to a $21,000 wedding today.",
                  "id": 10,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "I mean, one should consider ordering pizza anyway for the guests who stay at the reception really late and are dancing and drinking and having a great time. But that's separate from the dinner.",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "Pizza ten years ago was HALF what it is now in my area. Seriously I remember being able to eat enough to fill me and my parents without spending a ton and now it's a struggle to find anything besides the $5 pizza or dominos when in sale that isn't double as much for the same amount",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2475,
              "content": "I’m 51. This guy is 6 years older than me. It’s baffling to me that he said his wedding was only 7k. Bro. WTF. \n\nI can’t with my older people. I just can’t. Y’all, we’re supposed to be where this stupid shit stops.\n\nEdit: I’m not knocking the guy for his 7k wedding 30 years ago. I’m knocking him for thinking his son would be able to get anywhere near the same thing for 7k. You can spend whatever you wanna spend but it’s so fucking asinine to think that shit hasn’t changed for the worse for these younger generations in the 3 decades since. We bitched at our OWN parents for not getting this. Now he’s doing it himself.",
              "id": 13,
              "comments": [
                {
                  "score": 1613,
                  "content": "Just from inflation alone the 7K he spent on his wedding would be 21K today.  And wedding prices have risen much faster than standard inflation.  \n\nHe's complaining that his son doesn't want to put on a wedding for half as much money while braging about how 'little' his cost.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 537,
                      "content": "And college only cost $1500/semester, room and board included. All these people whining about student debt are just soft.",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 355,
                      "content": "He probably also grumbles on about how amazing he was when he was able to buy his house when interest rates were double what they are today. \n\nForgetting the house prices are now at least 10 times the average salary rather than the 2 or 3 that he bought at.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "I checked a [government inflation calculator](https://data.bls.gov/cgi-bin/cpicalc.pl?cost1=7000&year1=197006&year2=202306) and it said $7K in 1970 would be $55K today. Were you guestimating that number, or do you have a different source? I was expecting a multiple of about 4, so neither of those values seem right to me.\n\nEdit: Never mind, I don't know where I came up with 1970. 40 years ago was 1983, and you're bang on with $21K.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "And that is US inflation.  Based on the comments it does not sound like is US.\n\nCould be much higher.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "This is so important, even ONLY taking basic inflation into account he's still saying his son should do it for less than half what he did. What an asshole.\nYta",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Wait, the OP meant 7k back then, not factoring in inflation? ROTFL if true. I hope the son will never take financial advice from his dad.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 635,
                  "content": "50 here, and yeah I was laughing the whole way through reading this. OP is either lying or a cheap bastard.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 428,
                      "content": "He suggested pizza and sandwiches. Def a cheap bastard.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 137,
                      "content": "Probably both lol",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "My brother and his wife got married 20 years ago for about $6K Canadian, but the amount of effort and generosity of others to keep it that low was phenomenal, and it didn't include the cost of the rehearsal dinner or wedding party gifts (which they also kept low)\n\nFor starters, they already owned their house and had a large backyard, with no fence between them and their neighbour, so they rented a large tent with a dance floor that spread across both of them.\n\nThey were able to store extra food and the wedding cake in their neighbour's second fridge. Their neighbour was also a butterfly (I want to say keeper?) who did a monarch release with everyone at the end of the ceremony as his wedding gift to them.\n\nMy parents provided the wine (they had a friend with a make-your-own wine place who gave them a deal and they printed off lovely custom labels). \n\nMy uncle hosted a stag and doe that raised several thousand dollars to help make some repairs to the house before the wedding, especially their large porch, as we'd need that more if it rained on the day. I was unemployed and out of school so I moved in with them to help with the repairs, cleaning, gardening, and decorating (they paid me a decent wage). My and my SIL's parents also came every weekend to help out with that. With the exception of the decorations (that weren't simply garden transplants that would be staying after).\n\nFor the rehearsal dinner, they bought all the food and I prepped all the appetizers and cooked the dinner (I had kitchen management experience, so that and doing some appetizers for the wedding itself was my gift to them - they paid for all the food). A lot of the gifts to the wedding party were made by my brother and his wife rather than purchased (his wife gave me a beautiful afghan she'd made for me), all the wedding swag stuff (like MoG hat, etc) was created and paid for by my SIL's parents.\n\nThe wedding party paid for their own tuxedo rentals and bridesmaid dresses (they weren't too expensive).\n\nI'm pretty sure my mom covered hair and makeup for my SIL and the bridesmaids.\n\nThe wedding party all had brunch the day of the wedding and the next day at nearby restaurants, which my brother and his wife covered. All the parents and the entire wedding party also stayed at their house for 7-3 days before the wedding, and the night of the wedding... so a bunch more food, etc, on top of what was needed for the wedding itself.\n\n***None of the above was considered part of the $6K wedding \"budget\"***.\n\nThe actual expenses for the wedding that made it only $6K were:  \n1 second-chance wedding dress (about 1/3 the cost of retail)\n\n1 Tuxedo rental\n\n1 tent\n\n2 wedding rings\n\n1 bouquet and some corsages for the wedding party\n\nCentrepieces (which were glass bowls filled with cool stones and a few other things, we got them all at the dollar store :D )\n\nWedding invitations (which where a little cheaper because I hand did the custom parts with the same style of calligraphy)\n\n1 sound system (I think they rented part of it, but they may have borrowed all of it)\n\n1 wedding officiant\n\n1 photographer\n\n1 bartender\n\nBeer and hard liquor (my parents had the wine covered)\n\nThe cost of the food for the wedding day appetizers I made\n\nCatering of the rest of the appetizers and the dinner, including 3 servers, plus table and chair rentals, silverware, glassware, linens, etc... my brother and his wife did provide a number of the tables and linens, but a large portion had to be rented.\n\n1 wedding cake",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Yeah and I’m a 68 year old boomer and I was just cringing reading this. Trying to compare prices from then and now is insane. Even from before the pandemic! Just give them the money and let them spend it how they want to. It’s THEIR wedding now!",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I'd go with 'he's so tight, his a$$ squeaks when he walks'.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I vote both a liar and a cheap bastard",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "He said \"after haggling and deals\" so... tbh sounds like he berated everyone to give his discounts, but these days people value their time much more in general.",
                  "id": 28,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "I'm older than him. It's not older people, it's idiot people.",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "Some of you get it. And fewer of them get it (them as in while he’s only 6 years older than you, he clearly is in a different mental generation).",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I’m 50. My cheap wedding  20 years ago was still more than 10k all said and done and the venue was free! Also I have several friends in the 55+ age group and they all tend to swing more boomer than gen x so it varies I think. I think the oldest true gen x’ers  are mostly under 53. Apologies if some of you are older, I don’t mean any harm and you can relate to whichever you want =)",
                  "id": 31,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "I’m your age and my first wedding was about 30 years ago in my granny’s garden with a buffet and it was about $15,000 including things like my dress. We had to do a lot ourselves (made the flower arrangements and hand written invites, canned music etc). With a photographer, food, booze, officiant etc it adds up fast for even a modest affair at a free venue.",
                  "id": 32,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1103,
              "content": "We bought our house in 2002 for 260000 Euros. Now we get offers for 600000. It's been 20 years, the price more than doubled.",
              "id": 33,
              "comments": [
                {
                  "score": 582,
                  "content": "Got our house for 200k in 2014. Not even a decade later its around half a million. Its nuts.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 222,
                      "content": "My mom bought our family house for 195k in 2015 and it now goes for 750k. It’s a four bedroom 2200sqft house.",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "My parents paid 37 or 73k and now our house is like 1.2 million",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "I bought my cabin for an absolute steal in 2014 for $60,000 on a lake.\n\nI could sell it for easily $400,000 today.\n\nYTA OP. Boomers gonna Boomer.",
                  "id": 37,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Forty years ago, when my parents were first living together in the town we still live in, they paid $250 a month for rent + utilities on a house they shared with a roommate and split three ways. My mom with a bachelor’s degree made the least of the three of them at $15/hour, which is what I made working in retail throughout college. That same situation now would easily be over $3,000 a month to split three ways.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 501,
              "content": "Seriously, I got married last year. Things are not cheap and the photographer is something you absolutely don't want to scrimp on. We paid I believe $2100 for our photographer and for what we got we got a hell of a deal (engagement shoot, guest book, and wedding photos and he did a fantastic job). I looked through so many photographers and they really are something where you get what you pay for. There is a huge difference in someone charging $500 for your photos and $2000 for your photos. Honestly, with inflation, OP paid around 20,000 for his wedding, the same amount his son is going to spend and that he's mad about.",
              "id": 39,
              "comments": [
                {
                  "score": 160,
                  "content": "We skimped on the photographer and it shows.  We don't hang up any of our wedding photos.  We managed to get even less than what we paid for lol.\n\nEdit: I should add that we got married almost 11 years ago.  We had a nice venue for the ceremony reception and a different venue for the rest.  Our total was definitely over 15k at that time.  My wife's parents gave us a certain amount and told us to use it how we saw fit for the wedding.  The rest, they loaned us and we paid them back.  My parents did offer to help with a bit of it as well, which was nice.  All of this was more than we expected as I was expecting to pay for everything.\n\nSounds like OP's son also expected to pay for a good chunk of it and has no problems doing so, but OP seems upset that he wants to spend more than he's willing to give?  It's great that you're helping your son and future daughter-in-law pay for their wedding, but YTA for being upset that he's willing to put some of his own money into it as well.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 13,
                      "content": "His big ego is hurt",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "My husband worked for a photographer and they charged $6,000 for their basic wedding package. So expensive!",
                  "id": 42,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Yep! We got married last year and the cheapest we could find was a friend of a friend for $2,000 and the pictures weren’t great. It was heartbreaking because yes, that was a “cheap” wedding photographer amount. But it’s still a ton of money, and the best we could do.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "And also his comment that they could just offer less to the photographer and the decorator. Do you haggle with your plumber, your doctor? These are small business owners whose work has value and the implication that they should accept less is kind of insulting. YTA\n\nedit: language clarification and judgement",
                  "id": 44,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "I second this. Do not skimp on the photographer. Got married about 10 years ago and we have a few photos around the house, wonderful photographer and worth every penny. But, they came in really handy recently when my father-in-law passed away. Not only did we use a few in the slideshow at the funeral home, we also had a framed photo of him from the wedding next to the urn. It was very nice to have such a great photo of him being so happy when we needed it the most.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Yeah but maybe OP thinks he can get a photographer to do it for the *exposure*",
                  "id": 46,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Oh for sure, and a young graphic designer to make the invitations for free, for the experience!",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "My parents asked my uncle, an ok at best journalist for a small paper, to be the photographer. 1/3 of the picture were blurry. Thirty percent were useless. And it took 9 months to get them from him. We had to crop them and photoshop them ourselves. They are nice enough, but some shots we will never have because he took one and moved on and it is completely unfocused. Pay for a photographer",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "It’s been 20 years since I assisted my brother, a professional photographer, at weddings. Back then, $2100 was fairly bargain basement. A thousand dollars these days is basically what you pay a buddy of yours to shoot things on his phone. It’s a grueling task, and all told it’ll be about 12-16 hours of work. So, paying $60-85 per hour for the certainty of getting someone to simply give a crap during every moment he’s on the clock during your once-in-a-lifetime event. If you want professional camera equipment, skill, and any level of artistry, you bet your ass that’s gonna cost several thousand more, minimum.\n\nEDIT: forgot to say, if you were very happy with the work you got for $2100, you got a HELL of a deal.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 434,
              "content": "At 57 he isn't a Boomer but a Gen X.",
              "id": 50,
              "comments": [
                {
                  "score": 819,
                  "content": "Yea but barely. Big boomer energy, regardless.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 298,
                      "content": "No, no, you Gen Xers can't pass him off to the boomers.  LOL",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 689,
                  "content": "Early onset boomerism",
                  "id": 53,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Older Gen X definitely moving to boomering.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Ha!   I’m a boomer and this made me laugh.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 124,
                  "content": "Tale end of boomer and just a pinch of gen x lol",
                  "id": 56,
                  "comments": [
                    {
                      "score": 14,
                      "content": "GenX with a Boomer rising",
                      "id": 57,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "As a Gen X member slightly younger than him, I'd like to call a vote to expel OP from our generation.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 10,
                      "content": "As a fellow Gen X'er... I second the vote.",
                      "id": 59,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "Elder Gen X got a lot more lead exposure than the ones born in the mid to late 70’s. It killed their empathy.",
                  "id": 60,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Crap. I was hoping we wouldn’t have to claim him.",
                  "id": 61,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "boomer brain is definitely a thing.  there are millennials with boomer brain ffs.  and it's sad.",
                  "id": 62,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 336,
              "content": "Please don't paint all boomers with this same brush.  Some of us actually live in the real world and are fully aware if how times have changed.  OP is being ridiculous and is appallingly out of touch to think prices haven't changed in 40 years.  I'm not denying that there are definitely boomers with this stuck in the past mindset, but there are a good many of us who acknowledge times have changed, things are more expensive, it's a different world.  He must be utterly blind to his everyday life, ffs.  Doesn't he use a computer and a smart phone every damn day? Doesn't he pay for gas, food, and clothing? \n\nFrom one boomer to another, OP, open your damn eyes and stop being willfully obtuse and ignorant. YTA",
              "id": 63,
              "comments": [
                {
                  "score": 22,
                  "content": "Thank you for saying this! I (63F) live in the real world too. I know how much prices have increased and how earning potential has NOT kept up. It's obvious if you just go to the grocery store or fill up your gas tank. I am by no means \"rich,\" but I donate to food drives, school supply fundraisers, coats for kids, etc. because I was once a single mother and struggled. I have not forgotten and if I can help my neighbors, I do. Not every older person has this \"stuck in the past\" mindset. (Gawd, did I just call myself an \"older person'??? ffs).",
                  "id": 64,
                  "comments": [
                    {
                      "score": 20,
                      "content": "73 years old and  I am amazed how families can afford to live. Health insurance, cars, groceries, child care, homes, are so expensive, it is insane. It's really wrong.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "My husband is a boomer. He's had no hesitation about footing the bill for his youngest daughter's wedding where she needs it (and it's not like we're wealthy or anything). Seriously, if OP can't (or, I suspect, won't) understand basic inflation, I don't know that there's any hope.\n\nOP, YTA. Listen to your wife.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "He's not a boomer though, just small minded and they are found in all generations.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 207,
              "content": "Photographer under 1K?! They’re all minimum 3K here.",
              "id": 68,
              "comments": [
                {
                  "score": 15,
                  "content": "Yeah for less than 1k they might as well just buy an iPhone 13 and ask a trusted friend to take pictures. They’re certainly not going to find anyone with professional experience at that price. The excellent photographer at my wedding was like $2400 and she gave us a great deal because she wanted to vacation in my city and was able to write off the travel costs.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 153,
              "content": "I got married less than two years ago, our wedding was in the neighborhood of 10k and was mostly budget friendly. I splurged on things like a nice venue, but then we kept food costs down. So overall, low average for my area. OP is delusional.",
              "id": 70,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 142,
              "content": "I just looked up my grandparents old house in a more fashionable area around Sydney. They sold it for 390k in 1995, it's now worth 4.5 million.",
              "id": 71,
              "comments": [
                {
                  "score": 15,
                  "content": "4.5 million in Sydney? What, is it a studio apartment?",
                  "id": 72,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Sad to say he is not a Boomer but is GenX. I’m truly embarrassed for my generation.",
              "id": 73,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1906,
          "content": "I looked it up and the average cost of a wedding in 1983 was [$3500](https://www.nytimes.com/1982/06/02/garden/recession-not-for-weddings.html).\n\n\nso OP had a fancy wedding, spending double the national average",
          "id": 74,
          "comments": [
            {
              "score": 1062,
              "content": "It gets better. Adjust for inflation with any online calculator and 7K becomes 25K… IE OP spent the exact amount of money his kid wanted to spend.",
              "id": 75,
              "comments": [
                {
                  "score": 285,
                  "content": "More than that, I'm pretty sure that weddings have increased in price MUCH more than the overall inflation rate. They've always been expensive, but any more they're absolutely INSANE. I wouldn't be surprised at all if a wedding that cost $7k in 1983 would be $50k+ these days.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Yeah OP is a dick",
                  "id": 77,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "What dad should do now, is go out and price his wedding recreated down to the detail. And see how much it would cost today. \n\nWedding prices have risen 500-600%.    So if his wedding was 7k - you’d actually be even higher than normal inflation ($25k) and closer to $35k-42k for the same quality wedding.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 799,
          "content": "This is the same kind of person who can't understand why you don't fully own your house by the time you are 30, or loudly tells you he's got every job he ever interviewed for.\n\n\nTimes have changed",
          "id": 79,
          "comments": [
            {
              "score": 180,
              "content": "Very much so a \"pull yourself up by the bootstraps\" sorta person. \"Stop having expensive coffees and avacada toast and you'll be able to afford everything!\"",
              "id": 80,
              "comments": [
                {
                  "score": 81,
                  "content": "\"have you tried cancelling your Netflix and gym membership?\"",
                  "id": 81,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "He walked up the hill both ways to school in the snow.",
              "id": 82,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 612,
          "content": "#$5,000 in 1980 is equivalent in purchasing power to about $18,513.90 today, an increase of $13,513.90 over 43 years. The dollar had an average inflation rate of 3.09% per year between 1980 and today, producing a cumulative price increase of 270.28",
          "id": 83,
          "comments": [
            {
              "score": 274,
              "content": "I just saw my error: \n\nIt was $7000 20 years ago. \n\n$7,000 in 1980 is equivalent in purchasing power to about *$25,919.45* today, an increase of $18,919.45 over 43 years. The dollar had an average inflation rate of 3.09% per year between 1980 and today, producing a cumulative price increase of 270.28%",
              "id": 84,
              "comments": [
                {
                  "score": 27,
                  "content": "[deleted]",
                  "id": 85,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 586,
          "content": "I love that his son never even asked for 20k. It was his fiance's father",
          "id": 86,
          "comments": [
            {
              "score": 369,
              "content": "OP even talked the fiancé's father into cutting the amount he gave in half.   It wasn't enough that he's cheap, he pushed him into being cheap too.",
              "id": 87,
              "comments": [
                {
                  "score": 152,
                  "content": "I noticed that too... OP is a real dick in the mud.",
                  "id": 88,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "The fiancee's father is probably still giving the extra $5K, they're just doing it under the table to keep the peace.",
                  "id": 89,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 509,
          "content": "Exactly. Does OP think nothing changed in **40** years?!? \n\nThings changed SO much! \n\nGees... remember the grocery budget you needed to buy food 2-4 years ago? \n\nOP's son is not *complaining*, so he's not spoiled. He's saying thank you, stating the fact, and telling OP he'll pay himself, just as he already thought he would. \n\nBut I guess as it is tradition, OP expects the wedding couple to make do, so HE doesn't lose face for not paying what is needed? \n\nBesides, even if it would be enough, if the couple wants to do extra, they should. It's their wedding. And apparently, they can afford it.\n\nOP,  I'd suggest you find yourself some prices from 40 years ago, and some from now, and just compare that yourself",
          "id": 90,
          "comments": [
            {
              "score": 185,
              "content": "> OP expects the wedding couple to make do, so HE doesn't lose face for not paying what is needed\n\n\nding ding ding! We have a winner! OP doesn't want everyone to know how out of touch and stingy (compared to fiancee's father) he is. \nYTA OP.  Get a clue.",
              "id": 91,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "OP discovers inflation. He sounds like the spoiled one to me if he is this old and isn’t aware that prices change over time.",
              "id": 92,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Something tells me he’s not the one that shops for the eggs…",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 181,
          "content": "Yeah, I was expecting OP's son to ask for more money but the son is planning to pay the rest himself so I don't see what the hang-up is.",
          "id": 94,
          "comments": [
            {
              "score": 19,
              "content": "Because it's tradition in their culture for the families to pay the whole thing, so if the bride and groom are paying for part of it themselves it must be because one or more sets of their parents are cheapskates or otherwise bad parents.\n\nedit: small addition",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 160,
          "content": "Lol, OP suggested pizza for a wedding. Clearly OP is out of touch.\n\nNothing against pizza, it could work if you on a shoe string budget or if it's a (oddly specific) themed wedding.\n\nMost people would understand there's a huge difference between wedding food and bday party food, and would never ever suggest people just get pizzas for a WEDDING. Lol",
          "id": 96,
          "comments": [
            {
              "score": 15,
              "content": "Pizza is sometimes served as a drunk midnight snack lol, in addition to dinner!",
              "id": 97,
              "comments": [
                {
                  "score": 11,
                  "content": "Exactly....in addition to dinner.\n\nnot as the dinner.\n\nLol, to be honest any wedding I've been to with a \"midnight snack\" wasn't exacly counting money. they tend to be cash or open bar situations...that go into the night...which leads up to the midnight snack.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "$7k adjusted from 40 years ago equals $21,838.07 now.",
          "id": 99,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Do you think a photographer who charges $1,000 is going to haggle over prices? Do you want to offer significantly less because you think your business is more important than a good photographer who has no problem booking clients? You're a cheap asshole who knows pizza and subs weren't on the menu at YOUR ancient wedding but should be good enough for the \"spoiled brats.\" \n\nJust mark up the $7K from 1883 to today's prices and it comes out to $21,500. Yet, $10k -- half the cost of your wedding in today's dollars -- should be enough for them? It's like you only paying $3,500 for your wedding. But, you paid $7k because you wanted nicer stuff but they are spoiled because they want the same thing? \n\nBut you think they're assholes for not wanting their wedding to be a cheap pizza & sub party like you have at the end of Junior baseball season? YTA. Apparently, a $21k wedding was good enough for you but they should make do with 1/2 or they're assholes in your eyes. Get over yourself. You don't have a clue what you are talking about.",
          "id": 100,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 23975,
      "content": "YTA\n\n$7,000 in 1983 is about $24.5k now, so by your logic you should be giving him $12k, not $5k or $10k.\n\nObviously you aren't obligated to give him any money, but he kindly accepted the $5k you offered and you had no place to then berate him about how he was overspending, and you have no reason to \"feel hurt\" over this.",
      "id": 101,
      "comments": [
        {
          "score": 6066,
          "content": "Thank you for bringing up inflation! I swear that generation forgets that it exists. (Unless it suits them when they are complaining about what political party the current administration is.) Things aren't the same now as they were 40 years ago.\n\nEta yta",
          "id": 102,
          "comments": [
            {
              "score": 2721,
              "content": "I had to ask my mom for financial help, and she went off on me about how I should drop my mortgage, sell the house, and move to an apartment.  Um.  My mortgage has been cheaper than rent in my area since we bought the house 6 years ago...we had to lay out how much has really changed and she still doesn't get it.\n\nOP, YTA.  weddings are expensive, and pizza?  are you nuts?",
              "id": 103,
              "comments": [
                {
                  "score": 1435,
                  "content": "The complete refusal of people over the age of like 50 to accept that shit has changed in the last 20 years pisses me off to no end.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 618,
                      "content": "Everything else aside, if you made $20 an hour in 2000, that’s the equivalent of $35 or so in 2023. \n\nNo career advancement, nothing else. In USD that’s the adjusted consumer/inflation change.\n\nPeople don’t highlight this crap enough in the context of the modern economy. \n\nPeople talk about the state of things constantly, but the adjusted purchasing power of the dollar should be a bold highlighted mention at the top of most of these articles",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 246,
                      "content": "It’s all the lead poisoning. They all inhaled so much lead that they can’t comprehend it’s not 1972 anymore. They just literally don’t understand the passage of time. And yet they make the laws, so we can’t mandate they all get dementia care",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 51,
                      "content": "Same! My father in law tried to say my husband has a great job and he should be grateful because he didn’t make his salary until he was 40 and well into his career… when accounting for inflation, my FIL actually made 68% MORE from that salary he swears is exactly the same.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "At the same time, whenever they want to complain about the choices we make, the first thing out of their mouths is “it was different back in my day…”  ok OP, apply that sentence to today’s economy, that was different back in your day too!",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "My family has told me they were outraged because I have made it clear I won't spend more than 5k on a wedding period. They expect me to want what they had and for me to have that I would have to take on debt. Weddings have just gotten so crazy expensive I don't care to engage in the typical wedding.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "What's worse is they can't comprehend inflation for things like rent, tuition, weddings, etc but simultaneously completely understand that their shitty bungalow they bought for 100k is now worth 1.1 mil.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "The relief that I'm 50, not over 50 🙂",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 288,
                  "content": "I don't even think Pizza would save money.\n\nMy venue is £500. But you can only use food in house (so was £7k total). Wedding venues that allow outside food cost way more to make up the loss. Unless they all go to OPs fathers house or a village hall, pizza isn't cheaper.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 141,
                  "content": "For real! My jaw dropped when I saw how much a studio apartment costs in my area now. It's more expensive than my mortgage, and we are in a relatively cheaper area to live in the U.S. \n\nNeedless to say, I've told my youngest who's still at home they're welcome to live with us as long as needed. I could never imagine affording a place on what they pay entry-level jobs, let alone minimum wage.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 36,
                      "content": "Yeah.\n\nBank tells me I can't afford a mortgage for $900 a month, so I pay $1800 a month for rent instead.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Our mortgage in escrow for a three bedroom, one and a half bath, 1650 sqft house is the same price my friend pays for a two bedroom apartment one town over. Shits RIDICULOUS",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "A mortgage will almost always be cheaper than rent once you've made your down payment. Whoever you're renting from is usually paying a mortgage, and they still want to make a profit",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Also, why would moving to an apartment make ANY financial sense? You’re losing out on equity in the home you own, and with current market and interest rates, nothing says you would even be able to afford a mortgage again in the future. What a ridiculous solution!",
                  "id": 117,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Exactly!  And she suggested we go down to one car payment-which I have.  My car is held together on a string and hope, but I wfh so I don't need a car.  We need a dependable car.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "No kidding! My coworker and I were talking and we ended up on the subject of mortgages and I told her how much I paid a month is it's almost half of what she pays a month for rent for an apartment.",
                  "id": 119,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "That’s crazy that even with the reality, she can’t see. It’s like they can’t adjust to new information, they learned a house was more expensive than rent so that’s the law",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "My mum’s reaction to me talking about house prices is to say that everything else is so much cheaper, how she had to save up to buy a microwave because it was so pricey.\n\nUmm, maybe but a microwave is slightly different to a house. No?",
                  "id": 121,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "This shit drives me nuts.  We literally had to buy a house to get away from the insane rent.  The landlord wanted 3400 a month for a 900 sq ft apartment.  \n\nThe older generation is fucking nuts in how divorced from reality they are.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "The idea of sub sandwiches at a wedding made me lol",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 456,
              "content": "I bring out the inflation calculator all the time with my parents. My favorite time was my dad talking about how much he made during college one summer. When I put it in the calculator with inflation he was making little over $33 an hour. My parents are actually really good and this has now just turned into our running joke to see where inflation is at compared to what it was like back then but so many their age just cannot comprehend how much better they had it financially.",
              "id": 124,
              "comments": [
                {
                  "score": 209,
                  "content": "Not always a fun time getting out an inflation calculator. My father in law made more as a teacher with 5 years experience than a teacher with 30 years experience because of inflation. Poor guy. He looked so defeated.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 155,
                  "content": "Way higher comparative wages, but also insanely lower rent, tuition and other costs that fall outside of inflation calculations. INflation when considering rent/tuition and other things is vastly higher.\n\nSo they made effectively far more, their spending power went far further and the cost of the other major things were dramatically lower.\n\nIt was more than viable to work full time for a gap year in something like bartending and get enough savings to pay for a couple years of college and living expenses, then work part time throughout college to stretch your entire degree. \n\nNow you work full time in a min wage job and you'll have zero savings after a year and make zero impact on your next years college costs, it's a joke.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "My dad is seeing it first hand. I'm the oldest of 4, went to college for $10k/yr, by the time the youngest went a little over a decade later, it was $28k/yr (she thankfully had most of it covered under grants and scholarships).",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "He made the equivalent of $33/hr (at the time) with a summer job? Wow. \n\nBTW, OP YTA.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Back then they could get out of high school and find a job that could buy a home, a couple of cars, have a one income household and afford vacations every year.    \n\nThey had it so easy yet call younger generations lazy about things they have absolutely no control over.  They didn't create this mess, the generations before them did.",
                  "id": 129,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I disagree. The boomers definitely had a part in creating this mess.",
                      "id": 130,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "How ignorant can you be to compare $7k 40 years ago with $10k now? YTA for this alone.",
              "id": 131,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "Wow.  That generation lived with double-digit inflation and gas lines and the original Republican  \"trickle down theory\".",
              "id": 132,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "Are these people not buying groceries? I don't get how they can't see it. (I agree that they don't but why?)",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Omg it’s so true.  It’s especially hard trying to explain this to my Boomer parents who currently live in the Rust Belt.  They’re thinking about downsizing and getting a condo in a highly popular Southern city near their grandkids, and cannot understand why it’s impossible to find at least a nice 2br 2ba close by for “$200k MAX.” 😖",
              "id": 134,
              "comments": [
                {
                  "score": 9,
                  "content": "Hahaha my crummy 3br 1ba house in the sticks is worth $180k (which is double what I bought it for 6 years ago). I can’t imagine finding a vaguely decent place actually in (my medium sized but not exceptionally popular) town for less than $250k, and that’s vaguely decent - not in a convenient location, small, old, unrenovated",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "At this point, it is wilful ignorance. They have access to the same internet and economic news that we all do and just choose not to use it.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I mean… I doubt this guy thinks his house “value” is the same as 40 years ago. I bet he’s super happy that his house costs a lot more now than what he paid for it. So why the H does he think that a wedding wouldn’t rise in costs? \n\nI live in a country that’s cheaper than the US in some ways and people don’t earn nearly as much as they do in the US, but even here your average wedding is probably around 10K (that’s probably with 50 guests and a lot of work on your own, a lot of compromises and… well, you don’t get the Ritz with that) and that’s not getting you a super fancy wedding unless you can score all the deals, get a super cheap dress (like thrift one), get a discount for all the costly things etc. \n\nThis guy is just delusional.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1207,
          "content": "I honestly think part of it is OP still thinks what he is contributing is too much and trying to actually haggle with his son to look for cheaper options so he isn't paying that much for his share. The fact that his son said he's okay to pay the difference and OP still called him spoiled is what leads me to believe this. OP is TA for sure for trying to make his son feel like crap over this.",
          "id": 138,
          "comments": [
            {
              "score": 534,
              "content": "Do you not like pizza or sub sandwiches? LOL, JFC, what a clown. \n\nOP, YTA all the way.",
              "id": 139,
              "comments": [
                {
                  "score": 240,
                  "content": "The best meal at a wedding I've ever had was a BBQ buffet set up that was very simple but sooooo good lol (much better than $50+ plates at other weddings). I don't think it has to be super fancy, but holy crap OP has some nerve suggesting Domino's and subway (bc you KNOW it wouldn't be the good stuff either 😅).",
                  "id": 140,
                  "comments": [
                    {
                      "score": 226,
                      "content": "BBQ can be expensive too depending on the quality of the meat they use. The fact op was comparing the cost of his son’s wedding to his while also suggesting cheaper options he probably didn’t have at his own wedding is really telling",
                      "id": 141,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 68,
                      "content": "If one cannot afford to feed the guests, you either cut the number of people until you can, or you cut the length of the celebration so you don’t have to.  On the fancy side you are having a late sit down dinner with options for steak or seafood for 5 to 500 people, the alcohol-fueled party lasts all night, and most people spend the night in the 4 or 5 star hotel next door. On the casual side you have a sunrise wedding in the park before or after donuts and coffee (and maybe OJ or fruit) for 5 to 500 and everyone is home before 10 am. I’ve been to both and everything in between and I don’t remember a whole lot about any of them other than that I had fun and how radiant the happy couple looked. A BBQ buffet sounds marvelous!",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "OP is cheap but is also trying to satisfy his culture, which wants him to pay half and be reasonably generous. So he’s trying to reframe his cheapness as generosity, or at minimum sufficiency. But his son knows that he’s cheap and wouldn’t pay more; the son simply isn’t willing to lie to let OP play his “oh but my cheap offer is really plenty” game.\n\nSon is basically telling his father, “it’s ok, I know you’re a cheapass.”",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 597,
          "content": "And that's just regular inflation. The wedding industry itself has gotten completely out of control, so in order to have the same quality of wedding I wouldn't be surprised if it would be 40k-50k or even more. \n\nJust like how university education, even after accounting for inflation, is about 4x more expensive than 40-50 years ago.\n\nEdit: Reading that article posted farther down in the comments about how bad wedding inflation has actually been, an equivalent wedding to what OP could get for $7k 40 years ago might actually be ***closer to $100k now if not more***.",
          "id": 144,
          "comments": [
            {
              "score": 24,
              "content": "Wedding industrial complex, isn't it?",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Protip... don't tell them it's a wedding and look for vendors. It's astonishing the price difference.",
              "id": 146,
              "comments": [
                {
                  "score": 35,
                  "content": "That can work well - as long as you accept the very real possibility that the vendor finds out that it is a wedding and cancels you, leaving you stuck without a venue/food at a point when it's too late to book anything else.",
                  "id": 147,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yeah potentially around $100k for OPs wedding today. \n\nBack in the day he paid double the average cost of a wedding and that was after haggling some stuff down. Average wedding today is around $35k and somehow I think that's after making cutbacks because people just flat out cant afford the normal wedding stuff that they want.\n\nI've been to a $100k wedding and if wasn't even fancy like you would think. Pretty much felt like a normal wedding except the ceremony and reception were at different areas and the tables had nice bottles of wine and whisky ready to go.  Having a large guest number also adds significant cost.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "It's not just inflation, the overall wedding industry just charges a lot more.\n\nHere's an article about a woman exactly recreating her parents' wedding from 1974 in 2017. The 1974 wedding cost $2k, equivalent to $10k with inflation now. But all the same services now cost $47k.\n\n[https://www.buzzfeed.com/megkeene/heres-what-my-parents-1974-wedding-would-cost-in-2017](https://www.buzzfeed.com/megkeene/heres-what-my-parents-1974-wedding-would-cost-in-2017)\n\nIt's buzzfeed, I know, but it's actually a really good read and thoroughly done.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Here’s an (inflation calculator)[https://www.usinflationcalculator.com/] if OP doesn’t believe it.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Yeah, this fool is going to make people think Gen Xers are as delusional as boomers about inflation.",
          "id": 151,
          "comments": [
            {
              "score": 10,
              "content": "Gen X are the ones punching people out at school board meetings and snitching on teachers for having books about the holocaust, so it checks out",
              "id": 152,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I’m glad I went to the comment because I knew someone was going to have that inflation calculator ready to go “BaCk IN My DaY I diD it fOR oNlY..” \n\nIt doesn’t even sound like his son is mad at him or demanding more money. He thanks him, just voice his disappointment. What is he not allowed to do that? \n\nReminds me of those parents that tell you you can just starve and go on a rant about how they didn’t have to do anything for you; just because you said you wanted pizza for dinner  lol",
          "id": 153,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Someone else pointed out that OPs wedding was above the national average at the time (not sure if they knew the correct country) and by that logic, OP had a fancy wedding and suggested their kid had pizza and subs lol",
          "id": 154,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "OPs wedding was more then the sons - damn. Yta OP",
          "id": 155,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 9841,
      "content": "YTA. An average wedding these days is about $25k, depending on where you live. Your son and future DIL aren’t spoiled; they handled this gracefully by making it clear they don’t mind paying for some of the wedding themselves and thanking you multiple times for contributing. You calling them spoiled was out of line and you should apologize.",
      "id": 156,
      "comments": [
        {
          "score": 1295,
          "content": "Is it!? Wow! Holy fuck I'm going for elopement instead!",
          "id": 157,
          "comments": [
            {
              "score": 1289,
              "content": "I got married at the courthouse.  $100 for the marriage license. Dinner about $200 for 4 adults, 2 teens, and a toddler. Reception \"party\" was around $600 and didn't happen due to flooding. This was in 2012. Now when husband, daughter, and I go back to that same restaurant it costs over $100 for just the 3 of us.",
              "id": 158,
              "comments": [
                {
                  "score": 3365,
                  "content": "Have you tried just getting pizza or subs instead?",
                  "id": 159,
                  "comments": [
                    {
                      "score": 391,
                      "content": "I got pizza 3 years ago for mine. Still came out to over $100 for maybe 10 people. Nothing is cheap anymore.",
                      "id": 160,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Just offer the Uber driver less to make up for the expensive food",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "Exactly, even a modest courthouse ceremony and dinner, or a backyard barbecue event with more guests, will easily run you a grand or more these days. Sure I guess you could go to the courthouse in jeans and then have McDonald’s with your spouse, but the vast majority of people want that day to feel at least a little special.",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 314,
              "content": "It’s insane. We were married 2005 and had a small family wedding (75 people on a Sunday, for a champagne brunch at a really nice lakefront restaurant. No limo, no make-up artist, no band. Just ceremony following by brunch). And the following week had party for friends. We still wound up spending $12,000.",
              "id": 163,
              "comments": [
                {
                  "score": 21,
                  "content": "It was that pure Rock Cocaine buffet that blew up your budget, I bet.",
                  "id": 164,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "People forget that the biggest part of the whole traditional wedding thing is *feeding a large number of people*. $25/person is actually very affordable—when was the last time you went out to a nice restaurant and spent that little, even for brunch? You can spend that at Chipotle ffs. \n\nAnd that's before you even factor in renting the space and all the accoutrements that feeding a bunch of people requires, like chairs, forks, etc. I had a minor mental breakdown approximately 12 days before my wedding because I was convinced we hadn't rented enough glassware. I went out and bought hundreds of plastic cups just in case 😂 Did not end up needing them, but man, that pre-wedding anxiety will do crazy things to you, lmao.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "And that's 2005 prices. I can imagine how much more that would be now.",
                  "id": 166,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Most venues at at least $10k, if it’s not a park or community center. Food is at least $20/25 a head. Photography is $3500-5000 for 8-9 hours of shooting. And those are the strictly “necessary” costs. We had 120 people and got a steal with a local taqueria in a ruralish town. And we still paid $4k to feed everyone. \n\nIt’s important that this is people’s livelihood, so they need a living wage too. I was shocked at how much photography was, but realized it made more sense when I thought about how much time they spend editing the photos, and their equipment, travel, etc. \n\nI DIY’d a majority of our wedding, and my in laws paid for the venue, and we still paid $15k. But we are in CA, so it’s incredibly hard to do any event with a big group without spending a lot.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 231,
          "content": "Also, with inflation, a 25k wedding today would be about…7k forty years ago!",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "OP's own wedding was 7k *after haggling and deals*...\n\n***FORTY YEARS AGO!***\n\nThat's about as unrealistic as it gets!",
          "id": 169,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "I got married in 2017 and spent about 10k but made a lot of sacrifices, and even now in 2023 that same venue, etc. I’d probably end up spending at least 15k. OP YTA, even a “cheap wedding” where you cut costs is insanely expensive unless they elope or do a courthouse wedding.",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I got married in 2019 and paid 45k for about 120 people.\n\n\n\nLuckily our culture the guests give cash gifts instead of actual presents so I essentially broke even.\n\n\nMy sister-in laws wedding was 110k+ and that's a different story due to covid.",
          "id": 171,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "I’m getting married in September in SE Michigan and our venue alone is $25k. I am very, very lucky in that her mom is paying, but when she told me what our budget was, I couldn’t believe it. Before I knew she was paying, I was hoping to do a backyard wedding and count myself lucky if it was under $10k.",
          "id": 172,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7308,
      "content": "YTA.\n\nFirst, give whatever you want, but then don't get mad when your son tells you that he is going to then spend HIS OWN money for other parts of the wedding. You don't get to decide how much their wedding should cost, you only get to decide how much you want to contribute.\n\nSecond, did you serve pizza and subs at your wedding? If the cultural aspect of paying is so important to you, what are the other cultural traditions of this wedding, and would your family and friends been good with pizza when you got married? By the way, I'm down with pizza for a wedding, but  you being very invested in one part of the cultural tradition of a wedding while thinking going cheap on other major parts is..interesting.\n\nThird, no you don't get to just pay vendors less.\n\nAnd finally, do you really not realize that stuff costs more than 20 years ago? Your wedding cost $7k, and let's say it was 24 years ago (your son is 23, so I'm going with you had your son after you were married). Just by using the general US inflation calculator, $7k in the year 1999 would cost $13k in the current year. And that's inflation, not buying power. If you go by buying power, it is easily over $20k to get the same thing you got for $7k decades ago.  That's such basic comprehension that things cost more than 24 years ago, I can't believe you can't apply common sense to this conversation.",
      "id": 173,
      "comments": [
        {
          "score": 2238,
          "content": "OP’s wedding was 40 years ago!! Of course weddings are going to be much more expensive now.",
          "id": 174,
          "comments": [
            {
              "score": 1132,
              "content": "Like seriously, $7k in 1983 was the equivalent of $21k today with just inflation.",
              "id": 175,
              "comments": [
                {
                  "score": 706,
                  "content": "Nah fam, its the millennials at fault. Its all because they spend willy nilly and dont know how to haggle. Their entire generation is just spoiled and incompetent and complain too much. Back in my day we used to fight soviet spies and tank nuclear bombs before going to work 12 hours/day and we ate our leather shoes when things got bad and even then i still had time to raise a family",
                  "id": 176,
                  "comments": [
                    {
                      "score": 260,
                      "content": "Damn avocado toast",
                      "id": 177,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 134,
                      "content": "OP’s son really needs to just walk into a business with a suit on and a resume in his hand and he wouldn’t even need his dad’s money, but he’s too busy drinking feminist avocado lattes.",
                      "id": 178,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "You had LEATHER shoes?/!! Mine were made of straw and I had to re-thatch them every week after plowing the fields.",
                      "id": 179,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 232,
              "content": "Almost half a century!! 🫠😩 \n\nOP, your son is trying to be patient with your lack of understanding (willful as it is). Why don’t you make some calls to see what you can haggle for this wedding, since you’re so sure they’re overspending (pro tip: they’re not). Also, pizza or sub sandwiches? This isn’t a game party. This is *your son’s wedding.* Please stop this.",
              "id": 180,
              "comments": [
                {
                  "score": 76,
                  "content": "Just got married in May and found that most caterers now only include disposable plates and flatware. My mother was absolutely fucking appalled at the idea of serving my wedding dinner on paper plates and said we would have real plates even if we went over budget. We paid an additional grand for the cost of having the plates there and for the “washing fee.”",
                  "id": 181,
                  "comments": [
                    {
                      "score": 28,
                      "content": "No way! That's ridiculous. If I was given a paper plate at a wedding I'd think I was being pranked lmao.",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": "Given the patience exhibited by the son, I imagine that this is NOT the first time a conversation like this has taken place.\n\nOP probably: \"Why are you renting an apartment?  I bought my first, second, and vacation homes by the time I was your age while making minimum wage?!  Your generation is so entitled and lazy!\"\n\nOP's son probably: \"Yes dad you bought three houses on minimum wage because all three houses cost less combined than my and my fiancée's (2 total) Kia Sportage cars\"\n\nOP probably: \"Why did you take out loans for college (assuming in a place that charges for tertiary education)?  When I got my PhD at Yale, I did it working minimum wage jobs 15 hours a week AND buying my 1st house!\"\n\nOp's son probably: \"Yes dad, you did that working a minimum wage job because a PhD at Yale and your 1st house cost less than it does to get braces for your teeth\"",
                  "id": 183,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "My jaw literally dropped when OP suggested pizza and subs. YTA YTA YTA",
                  "id": 184,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 62,
              "content": ">Asshole Enthusiast \\[9\\]\n\nOh wow!! I was trying to do the calculation based on what was in the post (so went with the age of his child) but 40 years ago doubles my numbers!",
              "id": 185,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 367,
          "content": "Right? If the son had pitched a fit and insisted that OP needed to pay more, OP wouldn't be the AH for calling him spoiled. But he literally said \"thank you, that won't cover everything we want but it will help\". That's not \"spoiled brat\" behavior, that's \"my dad doesn't understand how things have gotten expensive and it's exhausting\" behavior.",
          "id": 186,
          "comments": [
            {
              "score": 34,
              "content": "My favorite part where was where the son had to just close his eyes and take a minute because of OP's dumbassery",
              "id": 187,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Makes you wonder what else the father has complained about that his son KNEW he was going to be exactly like this.",
              "id": 188,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "THANK YOU",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "For real! Suggesting they pay the photographer less is what kicked this over to solid YTA territory for me. Pay people what they are *worth.*",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "It was 40yrs ago not even 20 so even more than this",
          "id": 191,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "Have you not bought anything in the past 40 years, or read the newspapers, that you are apparently unaware of inflation.\n\nYou son and future DIL are being very gracious and thankful.  If you don't want to spend any more money, don't sulk.",
          "id": 192,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3587,
      "content": "YTA and so wildly out of touch. You evidently have no idea how things work now.  It’s the mentality of my grandparents, which is understandable as they are in their 90’s. You really have no excuse. \n\nWas your wedding also a pizza party?",
      "id": 193,
      "comments": [
        {
          "score": 663,
          "content": "Right! With inflation his wedding budget would be about $26k today. It sounds like OP is the spoiled one.",
          "id": 194,
          "comments": [
            {
              "score": 30,
              "content": "Nah, just cheap and tacky.",
              "id": 195,
              "comments": [
                {
                  "score": 32,
                  "content": "Classic out of touch boomer mindset",
                  "id": 196,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Totally. It's one thing to call them spoiled if they want Swarovski table decorations and want to ride in on elephants but it's another to call them spoiled just because they want a decent wedding and they don't want to short change vendors and cut corners.",
                      "id": 197,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 243,
          "content": "Based on how cheap he is, he might have made his mother, sisters and aunt cook for the guests",
          "id": 198,
          "comments": [
            {
              "score": 63,
              "content": "My dad had a potluck wedding. It was incredibly tacky. But to be fair, this was his 4th wife and 6th wedding.",
              "id": 199,
              "comments": [
                {
                  "score": 22,
                  "content": "Geez, he might as well have just started having family reunions that also had a wedding reception by that point!",
                  "id": 200,
                  "comments": [
                    {
                      "score": 10,
                      "content": "My dad is special.",
                      "id": 201,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 90,
          "content": ">It’s the mentality of my grandparents, which is understandable as they are in their 90’s. You really have no excuse. \n\nThis burn made me actually laugh",
          "id": 202,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "Ok, so rough calculations for the Star Birthday Package (cheapest option) at Chuck E Cheese says that:\n\n\\- each child will get 2 slices of pizza and a drink (we're going to assume this wedding is full of children)\n\n\\- costs $12.99 per kid\n\n\\- optional \"wedding\" cake from Chuck will be $10-$20\n\n= $1,299 for a hypothetical 100 kid-attended wedding\n\n= $1,320 for everyone INCLUDING cake!\n\nBONUS: 40 Chuck E Cheese tokens AND table cloth and plateware!    \nNOTE: 2 hours max reserve space!",
          "id": 203,
          "comments": [
            {
              "score": 15,
              "content": "r/theydidthemath",
              "id": 204,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Boomers gonna boom.",
          "id": 205,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "It was a kegger.",
          "id": 206,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2890,
      "content": "YTA Your son was incredibly gracious but you had to keep pushing, he even thanked you.  \n\nDo you pay the same price for gas, food, clothes etc like 40 years ago ?   \n\nDo u live under a rock.",
      "id": 207,
      "comments": [
        {
          "score": 542,
          "content": "He must do. 40 years ago my father bought a  house for 20,000. It recently sold it for £600,000. Even if everything else you said was reasonable - at least work out the comparative value of 10k and don’t judge your son for his choices if he is happy to foot the rest himself, that’s up to him.\n\nEdit: YTA",
          "id": 208,
          "comments": [
            {
              "score": 39,
              "content": "I don't understand how they're so out of touch too. All they need to do is look at what they used to make compared to now. You think you're the only one whose pay went up drastically?",
              "id": 209,
              "comments": [
                {
                  "score": 10,
                  "content": "Yes. They honestly believe that.",
                  "id": 210,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 149,
          "content": "These days we can’t even afford a nice rock to live under!",
          "id": 211,
          "comments": [
            {
              "score": 10,
              "content": "Dude probably thinks that \"living under a rock\" = nice house with a slate roof.",
              "id": 212,
              "comments": [
                {
                  "score": 14,
                  "content": "It’s one nice house with a slate roof Michael, what could it cost, $7k after haggling and deals?",
                  "id": 213,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "I get bullshit like this from my older customers all the time: \"$20k for a new machine? But I bought mine for 5k twenty years ago\"\n\nI usually reply with \"how about I buy your house for the same price you bought it 20 years ago, hell I'll even double it\"",
          "id": 214,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "I believe he does. It was the lovely and gracious mother of the groom who raised a patient and thoughtful son.",
          "id": 215,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1826,
      "content": "YTA\n\nDude, I too am 57 and know things from back then.  Yes things were cheaper then BUT do you really think 10k today can buy what 10k bought 40 years ago?  Obviously you have a job and saved money so it is inconceivable that you would try to compare 40 year ago prices to todays. (In fact adjusted for inflation since 1983 your $7500 would be today's $22,975   https://www.usinflationcalculator.com) Your son thanked you and was appreciative (your projecting that he felt you were not giving enough was because you knew you were being cheap compared to your future in-law) and communicated what he was going to do to make up the difference and you pulled the I remember when it was a nickel when I was young line?!!!!  \n\nGet a hold of your time, try not to be that old dude and stop talking with the those friends who either have not gotten the whole story or are too old to remember that Pinball is not the biggest game at the Arcade.",
      "id": 216,
      "comments": [
        {
          "score": 615,
          "content": "THANK YOU.  OP probably also thinks houses cost $30k... \n\nOP YTA for your reaction, not for the lack of additional contribution.",
          "id": 217,
          "comments": [
            {
              "score": 94,
              "content": "He sounds like my Grandmother who finds my rent of $850/month for a 2,200 square foot house \"extravagant\" and tells me I need to downsize to save money.\n\nShe doesn't understand that I am paying a QUARTER of the market rate for rent in my neighborhood, and the only reason it's so cheap is that my \"landlord\" got this house, with me already in it, in a divorce. She really has no interest in being a landlord, but her only expenses here are major repairs (Which are pretty rare) and a few hundred dollars a year in property taxes.  It's basically free money for her.",
              "id": 218,
              "comments": [
                {
                  "score": 36,
                  "content": "850 a month?? Yeah that is freakin insane. Lucky bastard...",
                  "id": 219,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I wish! That would be amazing!",
              "id": 220,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I would bet $10,000 that he does.\n\nWhy $10,000? Because that's how much I saved up and bought a car with in 2013. My mother, who has OP's energy absolutely flipped out. \"YOU HAD A DOWN PAYMENT AND YOU BLEW IT ON NOTHING!!\" Um, what? A) I didn't blow it on nothing. I needed that car to get away from my ex and go to grad school, and B) There weren't $50k houses anywhere that was of consideration to live in 2013. Of course, considering my parents paid $30k for their house 40 years ago, my mother knows that's what houses cost and it has never changed.\n\nShe kept on with this until I stopped speaking to her.",
              "id": 221,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "She should sell her house at this price",
              "id": 222,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "Hey. I'm 57 too. Whatta u know.  I was married in 1995. That was when the father of the bride was responsible for the entire bill. ( which is kind of pathetic now that I think about it. My father-in-law paid for the rehearsal dinner. Cheap f***. ) My parents gave me 10k almost 30 yrs ago.  And although it worked out fine, and we spent every cent, the reception etc. was very simple. I was very simple. Lol it was '95. I paid $100 for my wedding dress at Lord & Taylor in Boston! And was happy with it. Can u imagine? And my engagement ring was my great aunt's. We made our own \"goodies bags\" LOL I can't remember what they're called at a wedding. Lol u know what I mean.  \nSorry Dad, but you've embarrassed yourself. Pizza... come on now.",
          "id": 223,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Someone broke it down a few years ago. OP is delulu \n\n\nhttps://www.buzzfeed.com/megkeene/heres-what-my-parents-1974-wedding-would-cost-in-2017",
          "id": 224,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Maybe he should be getting paid today what he made 40 years ago and let’s see how quick his tune changes.",
          "id": 225,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Hard agree. I am just envisioning him and his friends like this cultural/traditional family I used to work with…the granddad of the family taking walks with his very like-minded friends. Of course you will find an echo chamber there.",
          "id": 226,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1310,
      "content": "YTA. He was respectful and thankful. Explained why 10K would not go far for a wedding at today's prices. Your response was to suggest pizza and subs (at a wedding FFS) and insult him and his fiance. Your son is a far better man than you.",
      "id": 227,
      "comments": [
        {
          "score": 337,
          "content": "👆🏻 This!!\nTo suggest pizza and subs for the meal at the reception!! 😱\n\nYTA dad. Unbelievable!",
          "id": 228,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "“After I said this he just closed his eyes and thanked me for the money and basically told me to get out.”\n\nThe dude’s been through this movie so many times with his old man, he has mastered the form lol",
          "id": 229,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "The pizza and subs suggestion is so insane to me 😭 might as well suggest the bride wear a dress made of toilet paper and have the wedding in the backyard then",
          "id": 230,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 909,
      "content": "YTA\n\nI googled a quick inflation calculator. $7000 in 1980 equates to just under $26,000 today. So actually your son is talking about a wedding that's cheaper than yours.\n\nIn other words: This is like you being asked to plan your wedding back in the 80s for less than $2800.",
      "id": 231,
      "comments": [
        {
          "score": 93,
          "content": "What a shame this boomer didn't think to google inflation before insulting his son and damaging their relationship.",
          "id": 232,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Pizza pies only cost a nickel back then. I bet he could have even done deep dish and kept it under $2800 if he haggled with the firehall to host the event.",
          "id": 233,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 769,
      "content": "YTA.   You spent $7K of your parents' money when you got married 40 years ago.  That would be about $25K today.  $10K today would have been $2.8K when you got married.  You are being a hypocrite.   You got the best of everything when you got married at your parents' expense, but you expect your son and his fiancee to pay for over half the wedding to get an equivalent celebration.",
      "id": 234,
      "comments": [
        {
          "score": 136,
          "content": "That’s what I was wondering. What would the $7,000 be today with inflation.\n\nI will say I think it’s ridiculous to spend what could help fund a down payment on a house on a wedding, but that just me. My parents spent under $2,000 for my wedding 40 years ago, and I thought it was great.\n\nBut if you got $7,000 for yours, and you want to put up $5,000 for your son 40 years later, you’re being a hypocrite, if you have the money.",
          "id": 235,
          "comments": [
            {
              "score": 12,
              "content": "> What would the $7,000 be today with inflation.\n\n$21,443.40 using inflationcalculator.com, an increase of 206.1%.",
              "id": 236,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 126,
          "content": "I totally can see OP’schild actually planning a budget wedding and OP complaining that it doesn’t have all the bells and whistles that he expects from a wedding",
          "id": 237,
          "comments": [
            {
              "score": 60,
              "content": "Yup\n\n“Back in my day, we knew how to host a proper wedding! Kids these days have no respect for proper etiquette!” Ok, boomer 🙄",
              "id": 238,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "Or expecting op to invite all of their extended family, aunts/uncles, cousins, etc",
              "id": 239,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Yeah, someone's spoiled here and it ain't the son",
          "id": 240,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "And do we really think OP's own parents spent 7k on their wedding? I bet it was half of that, but they didn't moan and complain about it because they knew inflation makes a huge difference.",
          "id": 241,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}