{
  "post content": "My husband, unbeknownst to me, bought a motorcycle from his best friend at work. It's a sturdy, old Honda from the early aughts in near-mint condition.\n\nI'm horrified. My mother is a nurse and raised us to believe, \"We have a term in the ER for motorcyclists, we call them organ donors.\" Made my brother and I promise to never to ride on or get one. \n\nWe have a beautiful 6 month old baby at home, our first. \n\nInitially, I demanded he return it, but he said it was his \"life long dream\" to own a bike & kept saying how great it would be on gas. 🏍️\n\nEDIT: *yes he knew my views on bikes before we got married & everytime he brought it up I asked him not to do it*\n\n*I knew he was interested in bikes, but none of this \"life long dream\" stuff*\n\nSo I said, ok, keep it, but don't drive it over 30 MPH & don't take it out of our neighborhood. (We have a lot of side roads).\n\nEDIT: *of course, it goes w/o saying he would have to have \"safety gear,\" a decent helmet, & pass the course required to obtain your license. In our state, helmets are mandatory* \n\n I said he can also  take it up to the lake where he and his friend go fishing, if he promises he won't drive it over 30 mph and stays off the highway, IOW, tows it up there on a trailer behind our car. \n\nEDIT: *what I mean here is don't take it on roads where the speed limit is over 30mph or out on the highway. The roads in our neighborhood & around the lake have a posted 25 MPH speed limit.*\n\n*the whole point of the \"riding rules,\" which admittedly aren't great, is I'm trying to find a  reasonable compromise b/c he is insistent on keeping it. I mean, I'm nursing this baby and changing her diapers all day and I can't stand thinking about this anymore*\n\n\nHe says I'm being a controlling harpy and sucking all the fun out of his new toy. \n\n\nAll I can see is him splat all over the asphalt and our daughter asking me \"Why is my Daddy in Heaven?\" one day.\n\nAITA for trying to establish motorcycle \"rules?\"\n\n\nLAST EDIT: *we cannot afford \"extra\" life insurance, especially since husband just suddenly spent 6k on new bike. his life insurance is through his work, and it's just the average policy*",
  "id": 1,
  "comments": [
    {
      "score": 16024,
      "content": "ESH\n\nHe should have discussed it with you.\n\nYou're not his mother and he's not a child.",
      "id": 2,
      "comments": [
        {
          "score": 14484,
          "content": "To be fair, my mom (an E.R. Nurse for 30+ years) calls them donorcycles. They really are dangerous, but mostly because cars are assholes and people on motorcycles overestimate their ability. We grew up near Sturgis, so we’ve seen a lot. My advice? Get him leathers and a good helmet and have a talk about why he did this behind your back so close to the birth of your baby. The two seem like they might be a bit related to me.\n\nEdit to add judgment: ESH",
          "id": 3,
          "comments": [
            {
              "score": 3053,
              "content": "EXACTLY THIS!  I live in FL and see bikes daily (son actually owns one),  9 out of 10 motorcycle accidents is because of CARS being careless/reckless and not paying attention.",
              "id": 4,
              "comments": [
                {
                  "score": 6711,
                  "content": "I mean, being right doesn’t really matter when you’re dead.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1231,
                      "content": "Which is why it is SO important to ride in proper safety gear. Ideally, those suits that are designed to minimize roadrash. If not, long pants (~~jeans~~ specifically motorcycle pants), heavy duty boots (leather), long sleeve jacket (leather or similar), gloves, and a full-face helmet. I can't stand seeing people riding in shorts, t-shirts, sneakers, etc.\n\nMy boyfriend got a street-legal dirtbike about a year and a half ago, and he has done everything he can to make sure he rides as safely as possible. He always wears all of his gear, even if he's just going for a short cruise. When he's out on dirt, he takes a GPS tracker with him which can call out if there's no service, and always gives me his itinerary so I know where he is if anything happens.\n\nEdit: lots of people are saying jeans are worthless in a crash and one person correctly mentioned gloves, so I edited to reflect proper safety gear.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Right? I don't care WHY you're dead.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Physical laws beat traffic laws",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "Or worse, maimed and/ or brain damaged for the rest of your life.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "A paramedic friend of mine always says this.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "This. You will deal with cars most places you go on a motorcycle, so the risk is real. The real problem here is that the husband bought the bike without discussing it with his wife. No matter what the wife says, he will not respect her rules. He made that clear when he bought the bike. The husband is the AH, and the wife is delusional if she thinks rules will make this work.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "This is something my dad (who drove motorcycles for a good portion of his life) drilled into my brain when I started driving \n\nJust because you are legally correct won’t make a difference if your car is totaled or your dead, so be fucking careful and observant",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 564,
                  "content": "And the people in the cars are going to walk away. You can be dead right, but right or wrong you’re still dead.\n\nI’m not going to risk *my* life trusting other people to be good drivers, cause I know they aren’t.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 79,
                      "content": "There was an awful accident near me. Motorcycle ran a red at high speed, hit a car, and killed the passenger of the car.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "People in my city drive like assholes. There isn't enough clonazepam in the world to counter the anxiety riding a motorcycle* in that mess would give me.\n\n*Or having a loved one ride a motorcycle.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 477,
                  "content": "It doesn't really matter who is to blame when you are lying dead in the morgue.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 49,
                      "content": "There's no margin for error at 150 mph",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Or paralyzed. Or with a traumatic brain injury. I don’t mind getting killed; being crippled is the fear.",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 315,
                  "content": "Well a lot of times the riders tailgate or do foolish things. I live in Jersey and if there is traffic they weave between the cars, drive between lanes or on the shoulder. They think road rules don’t apply. My friend’s brother was killed on a bike because he went too fast around a curve.  Not disagreeing that cars are at fault. Sometimes you can’t see them in your blind spot. \n\nI was on the highway and I am extremely careful driver. I wanted to move into the fast lane and looked in every mirror and over my shoulder and saw nothing but my spidey senses were tingling when I started to move into the lane so I moved back. A second later a dude on a bike passed me ad looked at me with a “OMG you almost killed me look”. Not sure why he was sitting in my blind spot. But he moved after that.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 177,
                      "content": "NJ here too and see a lot of dangerous motorcycle riding. I truly try to be as vigilant as I can, but a motorcycle doing 90 weaving in and out of traffic is really hard to spot. I was also the witness to a man thrown from a motorcycle after being hit by a car. He died right there. People in all kinds of vehicles just aren't as careful as they should be.\n\nI also suspect that the birth of the child and the motorcycle acquisition are related. This is for sure an ESH situation and another AITA that could be resolved by communicating in the relationship.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 106,
                      "content": "Right? I always see motorcycles weave in and out of traffic and I’m like “okay, but we’re supposed to be cautious so we don’t hit you????” And like, I am, but, people on motorcycles often drive recklessly.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 87,
                      "content": "I was in the car with my Dad one time in heavy stop and go traffic on a major roadway. We heard a motorcycle come up behind us and the guy was driving very fast, weaving in and out, driving between lanes and i my Dad and i looked at each other and shrugged. About 20 min later we come up to an accident. Motorcycle laying on the shoulder and guy on the ground. People had stopped and the guy seemed to be moving, but it was the same guy. The way he was driving i think he was lucky not to be dead.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 55,
                      "content": "NY here. Was driving sandwiched between two bikes the other day. One ahead was being safe and I was trying to give him plenty of room and still going the speed limit. One behind me was driving erratically, riding my ass, swerving into oncoming traffic looking for an opening to pass, and lane splitting once he did. \n\nI get wanting a motorcycle I've always wanted one, too.  But too many ride like the second guy and in my experience, they're twice as likely to end up roadkill and blame drivers for not paying attention. As if it's even possible to anticipate them coming down a double yellow to get in front of you or swerving into a merging lane to beat traffic.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 48,
                      "content": "I'm in PA, and a motorcyclist is driving dangerously nine times out of ten. Most aren't even wearing helmets, yet they're going 90 in a 40, tailgating, lane splitting, and more. There are a-hole drivers too, but \"bikers\" are really out here trying to get everyone and *themselves* killed. We lost a good family friend to an accident; he was on his motorcycle and was driving like an ass. Got killed.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I’m always extra conscious around bikes, always trying to give them extra space. Slowing down just to make sure I don’t get too close. And then internally cringe every time they zoom forward to other cars and merge lanes 3 feet in front of a mini van.\n\nThe thing is if a bike does something like that, and something happens that stops them on a dime, the car behind them is going to squish them! How can that be the cars fault? With no consideration for how distracting a bike darting around a car is to the car driver in the first place. People would rightly be pissed if a car cut in front of them with a yard to spare going 70 mph. A bike doing it comes with the extra stress of a manslaughter charge.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "SC and I see the same here.  I wonder if they want to die.  Not all motorcyclists, but still enough.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I’ve had this happen too. Made me feel sick as my dad was a biker and my brothers a biker too. I always think of them when out on the road so like to think I’m extra vigilant of bikers. Defo was in the blind spot. So lucky like you I felt something that told me to hold back. I’d never of forgiven myself if I’d of harmed him.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Some States, riding the line is legal -- I don't believe NJ is one of them though.... so doing that is not only dangerous -- it's illegal.  And I've seen it on the West Side Highway in Manhattan....  that's just nuts.",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "I'm in Washington state and we also have our fair share of aggressive motorcyclists. Just a few weeks ago there was a fatality that was completely on the rider. He decided he wanted to split lanes to pass traffic, misjudged and hit an SUV in the rear quarter panel while at a high rate of speed. He got thrown and literally cut in half by a sign pole. Half of him was on the northbound side, the other half on the southbound.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I'd argue the percentage of idiots on motorcycles / owners of motorcycles is about the same or higher than idiots I'm cars / owners of cars.",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "The isn't true, unless the states where I assume youre from are massively different. The statistics published in New Zealand show that motorcyclists are mostly responsible for their own crashes. Another vehicle isn't even involved in a good percentage of motorcycle crashes.",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "I don't know about statistics.\n\nAll the time when we're out, I see motorcyclists riding like jerks - passing cars in between the lanes, weaving in and out of traffic, just being very aggressive.  Now maybe they're the 10% of motorcyclists and I just notice them because they're the attention-grabbing ones.\n\nMy husband witnessed a fatal motorcycle accident.  He provided dashcam video to the police.  The video proved that the motorcyclist entered the intersection on a just-turned-red light and hit an SUV that was making a legal L turn on a L arrow in front of them.  The SUV was in a \"blind spot\" and not visible to the motorcyclist until she entered the intersection going full speed (because she was trying to \"beat the light\").",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I hear this a lot. Since Covid, traffic seems so much more reckless than before. I’m sure data is available, so I agree that cars are being driven recklessly. However, I cannot recall the last time I saw bikes on a highway that weren’t driving 20 mph over limit while weaving around cars. I am terrified every single time I see them.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Are you serious? I see so many motorcycle drivers driving like jackasses. I mean, maybe it’s the car drivers fault that they didn’t see the motorcycle that was going 100 mph weaving in and out of cars. I don’t think the average human brain is trained to do that.",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "The whole cars being reckless, it's not the motorcyclist's fault thing ticks me off. I am very respectful of motorcyclists  on the road, then only about a month ago I check in my rearview and the asshole on the bike behind me is STANDING ON HIS SEAT. Screw you, dude.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 485,
              "content": "As a former EMT, I can absolutely confirm that everyone involved in any kind of emergency medicine calls them donorcycles.",
              "id": 36,
              "comments": [
                {
                  "score": 101,
                  "content": "My husband used to ride, and even he called motorcycle helmets \"brain buckets.\"",
                  "id": 37,
                  "comments": [
                    {
                      "score": 15,
                      "content": "That actually refers to a specific type of pretty useless motorcycle hemet.",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "A paramedic friend calls motorbike riders temporary residents.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I'm a former medic too. Same.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Yup. And plenty still ride them. My Uncle called them that as well, but he retired and it's the first thing he bought.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Even some riders I know call them that.... I know nurses who ride.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 416,
              "content": "She should spend hundreds of dollars on safety equipment to support his dangerous vanity hobby? If he doesn’t already have a helmet and leathers he’s even more irresponsible than she indicated.",
              "id": 43,
              "comments": [
                {
                  "score": 69,
                  "content": "Fair enough. I’d hope he’d shell out for it, then.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 197,
                      "content": "Unless they both make excellent money it's pretty irresponsible to shell out so much money so soon after the birth of one's child. And if they make excellent enough money to justify it, he could have \"bought his dream bike\" years ago, so I somehow doubt they have that much disposable income.",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "She should also take out a hefty life insurance policy.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Pretty sure in USA you need a motorcycle license too.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 347,
              "content": "Also, make sure he has life insurance. It’s morbid, but even with the best helmet and leathers if there is a bad enough accident it won’t matter.",
              "id": 48,
              "comments": [
                {
                  "score": 277,
                  "content": "And disability insurance. Very easy to survive but still be stuck with a lifelong disability that prevents him from working.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 50,
                      "content": "Very true. And not only are you now working, depending on the injury you can be wracking up medical debt. So you would want a policy that includes hospital stays and gaps in medical coverage. \n\nBut I’ll be honest, this would be a dealbreaker for me. I wouldn’t be able to relax when my SO was riding their bike. That’s no way to live. No matter how much you spend on protective gear and insurance it won’t bring back someone who died.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "My uncle was hit while stopped at a red light. He is physically disabled and hasn’t worked since the mid 00’s. He is constant pain & will be until he passes away, which due to the hit his head took wearing a helmet will be sooner rather than later.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "This is what made me absolutely terrified of motorcycles. My uncle was in a motorcycle accident involving a semi and was severely disabled for life. He was in literally constant pain for decades, mostly bedridden for the last decade of his life, had a morphine pump installed and was still unable to really leave the house because of pain.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "DEFINETLY life insurance.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 263,
              "content": "Yep. My cousin was killed riding a motorcycle. He was wearing full safety gear and was a very experienced rider. All it took was a car driver not checking the blindspot. Family forever changed.",
              "id": 54,
              "comments": [
                {
                  "score": 79,
                  "content": "I've pretty much always wanted a motorcycle. I loved riding my moped/scooter as a teenager. But when my father was just out of high school he worked as a photographer at a newspaper. His older brother had a motorcycle. He was sent to report on a accident on the highway.... Yeah, it turned out to be his brother who had died in the crash. It wasn't pretty and he had to tell his family. So he has always been very anti motorcycle and I know that I would pretty much never be able to get one until he passes away. Now that I'm in my 30's I'm probably too cautious for one right now.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 11,
                      "content": "A coworker of mine died after skidding out on gravel on a frontage road. Experienced rider, wore the right gear, probably just took the turn too fast that one time for the conditions. We found out at work mid morning and I can’t forget that the reason they asked us not to tell anyone else was because they didn’t want his teenage son to find out about his dad’s death from anyone other than his mom.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "A former roommate, very bright guy with a great job, was in a medical coma for 7 months and was lucky to survive his motorcycle accident. He was in physical therapy for another year and likely won’t ever work in a knowledge based job again. Traumatic brain injuries ruin lives. He was 24 and the bike was a raffle prize; the day he brought it home I told him it could get him killed.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "My nephew was very nearly killed. He was medically retired from the military at 19 because it destroyed his leg and hands. The one silver lining is that he happened to be on orders at the time, so all his care was covered. He can get around okay but the scars are insane.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 118,
              "content": "[removed]",
              "id": 59,
              "comments": [
                {
                  "score": 100,
                  "content": "Probably add on some disability insurance in addition to only life insurance? What if he becomes incapacitated to work?",
                  "id": 60,
                  "comments": [
                    {
                      "score": 66,
                      "content": "[removed]",
                      "id": 61,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Everyone who has children should have life insurance whether they ride a motorcycle or not.",
                  "id": 62,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 109,
              "content": "My brother and I both ride and have both gone down on the highway. I wear a helmet and full leathers - which I've been frequent made fun of for by family. I walked away from my accident with a few bruises. My brother refuses to wear a helmet. He had his nose ripped off along with his cheek when he went down. They were just flapped over and hanging there. He required plastic surgery and now has a beard to cover the damage. Definitely make sure your husband has good safety equipment and have him take a safety course. He should have talked this over with you, but riding at 30mph in the neighborhood is an unreasonable expectation.",
              "id": 63,
              "comments": [
                {
                  "score": 7,
                  "content": "I have heard that riding on the highway actually feels safer to most because things are simpler. Everyone is going in one direction, no lights or major turns, it's a bit easier to anticipate someone else messing up. When you're in residential areas or smaller side streets things get more hectic and unpredictable. Has that been your experience as well?",
                  "id": 64,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I recall once reading that most bike accidents take place closer to home and at lower speeds. I will say that the way bikes maneuver make it more difficult to react at lower speeds. You don't really turn at higher speeds - leaning and adjusting your weight along with slight manipulation of the handlebars will do the trick as the effects of your movements are amplified with speed and your body will tend to maintain balance in turns due to centrifugal force. At lower speeds, you have to do a lot more turning of the front wheel to maneuver - treating your bike more like you would a car - and it's a lot easier to lose control. The more you have to turn your wheel at low speeds, the more likely you are to become unstable, especially as you'll have greater difficulty naturally maintaining balance without the benefit of speed. Think about the most awkward speeds to maneuver a pedal bike: You see a lot more people falling down when they're going slow than when they're at full clip. Now tack several hundred extra pounds of dead weight onto that pedal bike and imagine just how much more difficult it would be. \n\nAll that said, it really depends on the type of road you're going to ride on. I take residential roads to get out of my neighborhood, but would never use them as my primary place to ride for the same reasons you've listed. Plus, they just aren't a lot of fun. Going slow in full riding gear means you're usually going to be hot, whereas a good vented jacket will cool you down at speed. But, I hate riding on interstates, especially those with dense traffic. Rush hour sucks on a bike and you really never want to have to stop quick on a bike at any speed - too much front brake and you can go over the top, too much back brake and you can step out, and a mismatch between brake pressure can cause drift or wobble. I want to be able to focus on my ride and I know I always need to be planning an exit from every vehicle in my vicinity. As such, I tend to like to ride on back roads where there's not a ton of traffic and I have a lot of visibility.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": ">have a talk about why he did this behind your back so close to the birth of your baby. The two seem like they might be a bit related to me.\n\nThis reminds me of that [scene](https://www.youtube.com/watch?v=FIx0TSYhUww&ab_channel=Paddington) in the first Paddington movie. Where Hugh Bonneville's character and his pregnant wife arrive at a hospital in a bike, and they leave, with a baby, in a beige car because it's a very \"calm and neutral colour\"",
              "id": 66,
              "comments": [
                {
                  "score": 5,
                  "content": "Lol, loved that scene. I’ve repeatedly told my husband that if we make it to 40 without having children, I’m getting a motorcycle.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I have to go NTA here. My dad was an ER doc and, as others here have mentioned, he called them donorcycles. My cousin once asked him what was the worst thing he ever saw in the ER (expecting gunshot wound or something?  Idk) and my dad was quick to say motorcycle accidents, and told us a grisly story. If my SO bought one I'd either propose rules or leave.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I grew up with a girl who lost her dad at 19 to a motorcycle accident. Three years later she lost her brother, her only sibling, to a motorcycle accident. at the same intersection. \n\nI would never allow my children to ride one after seeing the way it tore her family apart. My husband has joked about getting one before, but I know he loves me enough not to do it. I would lose my mind every time he went out on it.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 576,
          "content": ">You're not his mother and he's not a child.\n\nWhat's OP to do then? Practically speaking, OP's rules don't make much sense. However, should she just accept the motorcycle and its associated significantly increased risk to adversely affecting the family? He made the childishly ignorant and big, unilateral decision to buy it, why shouldn't he be treated like a child? \n\nOP is actually being nice enough to try and compromise, though admittedly there could be a better one than a 30 MPH limit. But this is definitely something that I know many people consider close to if not actually a deal-breaker for a relationship.",
          "id": 70,
          "comments": [
            {
              "score": 145,
              "content": "You can voice your concerns to your partner without writing a rule list",
              "id": 71,
              "comments": [
                {
                  "score": 385,
                  "content": "[deleted]",
                  "id": 72,
                  "comments": [
                    {
                      "score": 215,
                      "content": "Yeah I've got a 7 month old, if my husband went out and bought a motorcycle I'd be googling how to disable the damn thing. He can be as mad as he wants, I don't give a fuck, my daughter deserves to have a father.",
                      "id": 73,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 75,
                      "content": "At the very least, now that he has a child to raise and support, he needs to make sure he has enough life insurance so his wife can live if the unthinkable happens and he gets killed. Of course, he should be doing this, even without the  motorcycle.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 156,
                  "content": "She was backed into a corner and probably could have discussed it better.\n\nThat being said, he has a family and a child. Making a decision like this should have been said first so they could have a discussion. But I’m guessing he didn’t want a discussion and was a jerk by putting his wife in this position",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 93,
                  "content": "Voicing concerns is the step that should happen after he discussed buying the bike with her... oh wait a second...",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "I'll admit I don't like the list myself either, but what if those concerns have been completely ignored, as OP's husband has done? \n\nYou're speaking in general while completely ignoring this specific situation here.",
                  "id": 77,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "It’s a compromise. She wants no bike, he wants bike. How is asking him to limit himself to safer riding not exactly the definition of compromise? Husband is not willing to make a counter offer. He wants to do it his way and only his way. He is being unreasonable.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "And you can also consult with your partner before taking up a dangerous hobby.  He created this situation, not her.  OP's response isn't perfect, but she's just trying to make some sense of things and deal with her fears.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "You get to set rules when your partner breaks your trust and spends big money on an extremely risky hobby just as your newborn arrived. He fucked up, she is trying to compromise. She is the one who is going to have to raise their child alone if he is not careful enough.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I just laugh at the idea of the 'compromise' being that he can't ride it anywhere but round the block and can't go over 30mph. \n\nThat's just the same as saying 'no motorcycle' but with extra steps and more hassle. \n\nMy cousin did this exact same thing and his wife just said 'nope, get rid of it or there will be trouble with our marriage'. Which is perfectly valid and doesn't inevitably lead to further nitpicking and smaller arguments as OPs frankly silly rules do.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": ">What’s OP to do then\n\nGet a good life insurance policy for him",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Before my husband and I got married, I told him \"I'm not really in the business of telling other adults what they can and can't do. But, if you're going to be my husband, the one thing I *forbid* you to do is get a motorcycle. Like, you want to quit your job to follow a dream, or move to China, or try nonmonogamy, or basically anything else, we can talk about it. But absolutely *no motorcycles*.\"\n\nI could not live my life knowing that there's a hugely elevated chance that any random day I might get a phone call or a knock on the door telling me that the person I'm closest to in the world, who I built my life with, and the father of any future children, has just died suddenly and horrifically. I know accidents can happen to anyone, but riding a motorcycle *astronomically* raises the odds. I wouldn't be married to someone who would risk causing me and the rest of his family that kind of heartbreak for a thrill. It's absolutely a valid deal-breaker.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "OP should have him sign up for life insurance, short and long term disability insurance, and set up a savings account funded from his fun-money budget in the amount of their max yearly insurance deductible.\n\nGet him full body protective leathers and a Decent helmet.\n\nThen he needs to take and pass a thorough safe riding course.\n\nAnd tell him that if he ever does something stupid like speed or ride drunk he’s getting divorce papers the next week because she won’t deal with that.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "NTA.  Motor cycle riders are 27x more likely to die in an accident than someone in an enclosed vehicle.  OP’s spouse never should have gotten a MC.  He shouldn’t keep It knowing how his wife feels.\n\nHere’s plenty of other disturbing statistics https://www.motorcyclelegalfoundation.com/faqs/motorcycle-accidents-death-and-injury-statistics/",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yeah I’d leave my husband if he got a motorcycle. I would literally have a panic attack every time he rode it and I can’t live like that.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "> What's OP to do then?\n\nMandate that her husband subscribe a good life insurance policy, and sign over to the organ donations registry. So his bike at least does some good in the world.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 327,
          "content": "This boggles my mind. A spouse has the right to demand their spouse be responsible and safe, ESPECIALLY when they have a kid together. \n\nGetting married means someone is sharing your life, and it's no longer just your own anymore",
          "id": 88,
          "comments": [
            {
              "score": 10,
              "content": "This, 100%.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 179,
          "content": "Yea, but if he gets into a wreck she would become his care taker.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 178,
          "content": "Agreed on your verdict. But ugh, the undertaker in my town (small town) absolutely flipped out when his teenage son was trying to get a motorcycle. Like, calmest guy ever, screaming with a vein pulsing in his forehead. It's stayed with me.",
          "id": 91,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 154,
          "content": "That's typical reddit bullshit which has no idea of being a supportive (and supported) spouse. \n\nShe's being too nice. She has a right to expect her husband to keep himself safe from injury or death to for her and their child's sake. He can't behave like he's living in a silo. \n\n Her suggesting ways he could use the mo-bike and still be able to use his toy is a compromise. If he can't see past his pout, he's really behaving like a child. She may not be his mother but he's the AH for putting her in that position.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 130,
          "content": "She's not his mother, but she is the mother of his child. I'm all for adults having freedom, but when you commit to someone and have a child with them, they have input into behavior that could yeet you out of the plane of the living.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 128,
          "content": "> You're not his mother and he's not a child.\n\nRight, she's his wife and the mother of his kid, and she's trying to keep from being a single mom.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 90,
          "content": "I would have been angry at the lack of discussion, but making him follow her rules is going to lead to resentment and conflict.  He is not a child, but  I do suggest some other rules.  \n\n\nAlways wear a helmet  \nTake a driver safety class  \nWear proper shoes and clothing  \nAbsolutely no drinking while riding  \nNew large life insurance policy",
          "id": 95,
          "comments": [
            {
              "score": 13,
              "content": "I like these rules.\n\nAnd if they have separate funds, the cost of all this should be paid by him.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "AND short and long term disability insurance.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "Maybe not, but he's acting like a child, AND he has one at home to think of. OP is not being at all unreasonable.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4857,
      "content": "Some people will say YTA, I say NTA.  My husband crashed, and broke his collarbone.  Then went and bought another one with out telling me.  He is now my late husband.  I wish I had put up more of a stink and made him sell it.",
      "id": 99,
      "comments": [
        {
          "score": 1240,
          "content": "Sorry for you loss!\n\nThis is why OP should make her husband buy a really big life insurance policy! Also to make him think.",
          "id": 100,
          "comments": [
            {
              "score": 565,
              "content": "I think the first question on the application is \"do you drive a motorcycle?\" Going to be expensive insurance!",
              "id": 101,
              "comments": [
                {
                  "score": 176,
                  "content": "It is definitely the first question of many....",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "I think it’s on the list. Mountain climbing is, too.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Apply before he starts driving the motorcycle.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 310,
              "content": "[deleted]",
              "id": 105,
              "comments": [
                {
                  "score": 11,
                  "content": "My mom said my dad could buy a motorcycle after my brother and I graduated from high school. They both took a class on how to ride them last year.",
                  "id": 106,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 67,
              "content": "My mother only agreed to my father buying a motorcycle if he also had enough money for the big life insurance payout. She also told him she was going to write ‘told you so’ on his headstone. His accident didn’t kill him, and he decided not to buy another bike with the payout.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Came here to say make him buy a lot of life insurance!",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "This is exactly what I said. The only rule: he must have and it must be enforced, a massive life insurance (salary x5-10 years). Once he satisfies this, he can ride.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1006,
          "content": "Yea NTA here \n\nPeople saying shit like “you’re his wife not his mother” \n\nBruh he’s the father of a newborn child and should be mature enough to know how fucking stupid of a decision that is and since he clearly doesn’t, the wife is stepping in for the sake of her family \n\nLike sorry husband but you’re an adult. It’s not always about chasing dopamine. \n\nJust got home from the ICU and all I got to say is I support you OP. Duck what other people are saying.",
          "id": 110,
          "comments": [
            {
              "score": 151,
              "content": "Right?? This was my thought too. Like, yeah maybe she was treating him like a child but that’s because he is acting like one. He’s being immature, selfish and reckless… no different then a 14 year old boy. Safety reasons aside… what about the financial? If my husband went out and bought an expensive “toy” behind my back I’d be livid regardless of whether or not it was safe. Sounds like a mid life crisis to me. \n\nAlso check out that wild convo developing below in response to your comment haha\n\nAlso NTA",
              "id": 111,
              "comments": [
                {
                  "score": 10,
                  "content": ">she was treating him like a child but that’s because he is acting like one. \n\nThis x 100.\n\nHe spent thousands of dollars behind his wife's back on a fun hobby item he knew she was uncomfortable with him having and that increases his risk of death or disability by huge amounts. He was being incredibly immature and deceitful and clearly didn't spent any time thinking about his wife or brand new baby, only about what he personally wanted.\n\nThat is pretty childish behavior, so why should the onus be on OP to be mature and understanding and do whatever he wants",
                  "id": 112,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yup totally agree. If you want to be treated like an adult, act like one. If you don’t want people to treat you like a child, don’t act like a child. Super simple really",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Exactly. Sometimes we have obligations to other people that puts limitations on our actions and behaviors. NTA.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "ALL OF THIS!\n\nClearly, even if she had not previously been direct about her feelings on motorcycles, he knew how she would react. That's why he didn't have a conversation with her prior to the purchase. He was hoping since he had already bought it that she'd cave, or something. While I think the rules are a bit extreme, I don't blame her for reacting this way. Not only is she justifiably nervous and scared about him being on the bike in general, this was also a huge betrayal since he went behind her back to get it.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "God thank you for this comment. Seriously OP is NTA",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 442,
          "content": "I’m so sorry 😢 \nMy dad was in a motorcycle accident when I was 11 that almost killed him and left him permanently disabled. It was terrifying.  I haven’t been on one since and no interest in tying my life to anyone who does. \nNo joke- this is a deal breaker for me NTA \nMy husband is a sensible sort, but if he came home with one we’d be done. I don’t want that phone call",
          "id": 117,
          "comments": [
            {
              "score": 100,
              "content": "It’s 100% a deal breaker for me too. MH knows this and has never even considered it.",
              "id": 118,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "I’m so sorry about your dad. Good on you to hold that boundary with your husband. My dad used to drive one before he had kids and got into an accident where he broke his leg lost a bunch of teeth and lost a testicle. He had to be life flighted to the hospital. After that he didn’t touch a motorcycle again until we were out of college because “who will raise my children when I’m dead?”",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 229,
          "content": "I am so very sorry for your loss. People don’t realize you’re like 20x more likely to die in a motorcycle accident than a car accident. It’s one thing when you’re young and don’t have a family, or a retiree just enjoying your Harley. \n\nI think people calling OP TA are motorcycle enthusiast themselves. Too many of them are taking the it personally and not logically. He can be the best motorcycle driver in the world, and all it takes is a careless driver and BOOM, OP is a single mother and kids grow up without a dad.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 115,
          "content": "Yep my husband was in a crash that landed him in the ICU for 6 days and hospital for 2 weeks. I asked him to not even consider getting on another and he agreed.",
          "id": 121,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 92,
          "content": "NTA. My father would never let any of us ride on a motorcycle, only saying he had friends who crashed on one and died. My mother later told us the friends lost control on a curve and went through a barbed wire fence. He was riding his motorcycle with them when it happened, it was apparently quite gruesome, and he never got over it. Then my husband and I had a friend who had a motorcycle accident when he hit a patch of gravel. The doctor said it was a good thing his accident was “minor” so his injuries weren’t bad (a broken collarbone and terrible road rash among other things). He was single and had no one else to help him, so he ended up living with us for a few weeks while he recovered. A young man working on our landscaping died when he was riding his motorcycle and a car pulled out right in front of him. And, finally, a former neighbor was widowed after her husband returned from his 3rd tour in Iraq and died in an accident on his motorcycle. So, needless to say, it’d be a firm “No” from me if my husband said he wanted a motorcycle.",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "I’m sorry for your loss wow that is so sad",
          "id": 123,
          "comments": [
            {
              "score": 9,
              "content": "Wow that’s heartbreaking.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 38,
          "content": "I'm so sorry-- motorcycles are so dangerous... Don't blame yourself, please.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "This needs to be the top comment. I am so sorry you went through that.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "She’s also 6 months postpartum and still recovering from baby! She has a completely valid reason for “overreacting” as the YTAs said.",
          "id": 127,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4453,
      "content": "ESH.\n\nYes, he should have discussed it with you.\n\nBut you clearly don't understand what motorized vehicles are for and you are being absolutely controlling and unreasonable.  Not over 30mph?  Not out of the neighborhood?  Are you kidding me?\n\nMy mom was a nurse too.  I grew up calling them \"Donor-cycles\".  Yes, it's scary.  But so is your reaction and \"rules\".",
      "id": 128,
      "comments": [
        {
          "score": 2696,
          "content": "Would it be less controlling to force him to sell the bike?\n\nI'm asking seriously, because I would see this purchase as a marriage-ending event for a couple reasons:\n\n1. If he dies, he is abandoning his child. How could he not consider this?\n2. If he becomes a vegetable, OP is going to be his caretaker.\n3. He didn't ask because he knew she would say no. Why not talk about it first?\n4. This \"motorized vehicle\" is purely for thrills and unnecessary, he has a car.\n5. There's no way in hell that bike is staying under 30mph.\n\nEven if he's the prefect driver, someone could hit him, and a motorcycle has significantly less safety features than a car in an accident. A \"fun new toy\" is not worth the risk of leaving his wife struggling and child fatherless.",
          "id": 129,
          "comments": [
            {
              "score": 53,
              "content": "I think the stats are 27-30 times more likely to die in an accident on a motorcycle as compared to a car.",
              "id": 130,
              "comments": [
                {
                  "score": 13,
                  "content": "Exactly!! 30x more likely to die, here’s some more statistics (from JD Power) for anyone who cares :) \n\nhttps://www.nadaguides.com/Motorcycles/shopping-guides/motorcycle-vs-car-accident-statistics#:~:text=and%20car%20accidents%3A-,Motorcycle%20Accidents,car%20accidents%20remain%20around%2020%25",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": ">If he becomes a vegetable, OP is going to be his caretaker.\n\nThis is the reason this may lead to divorce.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "If it’s just for fun, I’m pretty sure there are race tracks that you can safely drive around super fast on. Have races with other people on motorcycles. I definitely wouldn’t ride it on the road with other cars if I were him. There’s no protection and it’s super dangerous",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "He had to have known about her thoughts on motorcycles right? I mean assuming this is his “life long dream” like he says. I can’t imagine that he’s never mentioned anything about motorcyles ever in their relationship if he feels so strongly about them. \n\nGiven that, we know that OP has a visceral reaction to the idea of her partner owning a motorcycle. I think it’s safe to conclude that she’s had a negative reaction to this before and then he did behind her back anyways. After they’ve already had a baby and she is intimately and LEGALLY invested in him continuing to be alive. \n\nYes her rules are bad and not going to do anything. He’ll break all of them and she’ll be the bad guy. But all her actions are driven from a place of fear that she’ll lose her family’s future. It isn’t like this is an unfounded fear either - motorcyles are demonstrably dangerous even to professional riders. \n\nIt’s fine if people are comfortable taking those risks, but everyone has a different risk tolerance and sometimes that leads to incompatibility. \n\nI think she’s reacting emotionally — it isn’t helping the situation, but idk. I think it’s too harsh to call her an asshole. She’s still a brand new mom I cant imagine she’s feeling particularly sane or rested to begin with. I just kinda hope she gets real life support and maybe a nap.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 134,
          "content": "Always heard that most accidents happen within a mile of your home..",
          "id": 135,
          "comments": [
            {
              "score": 426,
              "content": "This is a classic case of stats being skewed easily. Most accidents happen within a mile of your home because the vast majority of your driving occurs within a mile of your home. Like you literally drive within a mile of it twice everytime you go somewhere, to leave and to come back. It's like saying most drownings happen in the summer. No duh that's when most people are in water!",
              "id": 136,
              "comments": [
                {
                  "score": 61,
                  "content": "Most deaths ascending Everest occur in may",
                  "id": 137,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Really? I know absolutely nothing about mountain climbing. I assume more people attempt then because the warmer weather will open some paths/make it easier?",
                      "id": 138,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 72,
              "content": "Which is like saying most shower falls happen in your home.  Its not because your own bathroom is more dangerous, its because most showers are taken at home.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Most also do most of their driving in proximity to their home, so you'd expect to have the most accidents where you do the most driving.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "You can say whatever you want, but I rather leave someone and get over then in a slow way, then having them come back dead. \n\n\n>Not over 30mph? Not out of the neighborhood?\n\nAnd this sounds absolutely reasonable to me, because the alternative is threatening a divorce emediately, without actually trying to compromise. \n\n\nAnd more then that, is a big fat no.",
          "id": 141,
          "comments": [
            {
              "score": 27,
              "content": "Right, and I feel that nitpicking her rules is pointless.  She made \"rules\" because he forced her to.  She was ambushed and probably all she can think about is being stuck alone with a baby when her inexperienced-rider husband makes a mistake and has a crash.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "What is scary about her reaction?? Redditors are always way too dramatic..",
          "id": 143,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Most motorcycle owners have accidents in the first months of ownership.  I have uncles that rode motorcycles, only 1 still does, he happens to be particularly gifted when it comes to vehicles, quick whitted and great coordination.  My other uncle who used to rude but doesn't had a Samaritan witness a bike  on top of a unconscious rider on the road  at night, pull the bike off of him, call 911, and tell them of the hit and run accident. My uncle had the bike burn down through the muscle in calf. Took major skin grafts to close it. Never found the driver that hit him. He was a experienced biker. Doctors said and police said that a unexperienced biker and a less lucky one would be dead. OP has a very valid reason to do this. OP'S husband isn't licensed nor have they discussed going to class.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "He didn't buy it for his commute lmao",
          "id": 145,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2572,
      "content": "ESH, although I’m not sure you’re being an asshole so much as completely unrealistic.  If he didn’t feel the need to consult you on the purchase in the first place, what makes you think you can impose *any* terms he’ll actually agree to, let alone ones that undoubtedly defeat the purpose of him owning this thing from his perspective?  Get to counseling to figure out how you navigate the disconnect in priorities and make sure there’s nothing else he plans to spring on you instead.",
      "id": 146,
      "comments": [
        {
          "score": 1095,
          "content": "Piggybacking because this one’s the most right.\n\nAnybody who makes the conscious decision to become a motorcyclist when they have a 6 month old does not make reasonable decisions.\n\nIf this is his dream, how have you two\nNever discussed it when you have opposing ideals?",
          "id": 147,
          "comments": [
            {
              "score": 320,
              "content": "I really get the feeling that he is looking for an out on Fatherhood and possibly the marriage. So he goes out and buys the thing he knows she will hate the most,  that way she reacts negatively and when the divorce happens it is not because he was a deadbeat Dad, but rather that she was a controlling shrew who wanted to crush his dreams.",
              "id": 148,
              "comments": [
                {
                  "score": 474,
                  "content": "I'm not so sure it's that devious.  If I was going to take a stab, I think he's a bit freaked out about having a kid and responsibilities and saw an opportunity to buy a motorcycle and maintain a version of his independence.  I doubt he knew how significantly his wife would react to it.  They're relatively newly married and probably didn't spend much on the bike, so he didn't really consider running it by his wife first, who is still adjusting to the reality of having a new kid and is naturally overreacting a bit.  Everyone sucks here but I think it's really a communication issue on all sides.\n\nEdit: Minor typo",
                  "id": 149,
                  "comments": [
                    {
                      "score": 173,
                      "content": "My dad did this exact thing when my first of my baby brothers were born. Note, my baby brother was his first biological kid. He was my stepdad who adopted me when I was 12. He did the same thing of go behind my moms back and buy a motorcycle she was against. I think he had a midlife crisis with the baby coming. He also bleached his hair a yellow blonde randomly. He was not making clear normal decisions during that time",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "This is much more likely.  He's terrified of becoming the stereotypical \"boring dad\" and a motorcycle is cheaper and easier to find room for than a sports car or other such powersport.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 136,
                  "content": "He's a young father, not a Batman villain.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Yeah at that point it’s time to get off Reddit cause you’re reaching way to hard.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 108,
                  "content": "Or, he just saw a good deal come up and decided to buy one…\n\nNah, that would make too much sense, definitely an elaborate conspiracy.",
                  "id": 154,
                  "comments": [
                    {
                      "score": 81,
                      "content": "Yeah I love AITA projections on what’s REALLY happening. It’s good entertainment at the least",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Exactly dream bike for sale, someone he knew and trusted, get in! The kid will love sitting on it getting awesome pics growing up",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 31,
                  "content": "How is this crap upvoted so much.  This is the most ridiculous comment lmao",
                  "id": 157,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Reddit will look for literally any reason to demonize the other party in a post and make them out to be a comic book villain.\n\n\"Oh, he said he didn't hear you ask for a massage? It's because he's gaslighting you into thinking he's hard of hearing so that he can rape you mercilessly and then bury you in the woods.\"",
                      "id": 158,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "First day on AITA?",
                      "id": 159,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 28,
                  "content": "That is some twisted, conflate weaponized bullshit right there",
                  "id": 160,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "What the fuck is wrong with you?",
                  "id": 161,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 50,
              "content": "'If this is his dream, how have you two Never discussed it when you have opposing ideals?'\n\nThis, but I do think it's funny that an entire generation grew up hearing jokes about mid life crises and somehow are surprised when it happens to them too. \n\nIt's just that this generation doesn't have the money to buy corvettes.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 235,
          "content": "Honestly, if was OP I'd be telling him he's paying for the multiple life insurance policies I'm taking out for when he gets himself killed. All it takes is one bad pothole or one bad driver and he's dead. \n\nI'd say four $500,000 life insurance policies (or more, if he makes enough that he'd eventually bring home that much. Lost future income blah blah blah) would make the point- and if he decides he doesn't care, well, if you invest it well at least you won't have to worry about being down to one income and can put the kid.through college.\n\nThen suggest he make his own funeral arrangements/plans.\n\nThen drop it.",
          "id": 163,
          "comments": [
            {
              "score": 239,
              "content": "I actually had a coworker who's wife was an ER nurse and that was their compromise. He had to keep $X amount of life and disability insurance while their kids were minors cut to something like $500k after the youngest graduated college  with the insurance premiums coming out of his fun budget, and she told him she could sleep with any of his friends she chose if he got himself killed by taking up a dangerous hobby. And he was like it made him think, but he agreed because that was her taking care of herself if he was in an accident.",
              "id": 164,
              "comments": [
                {
                  "score": 130,
                  "content": ">she could sleep with any of his friends she chose if he got himself killed by taking up a dangerous hobby\n\nBit out of left field, but alright! \n\nStartled my toddler by snorting at this, thanks reddit.",
                  "id": 165,
                  "comments": [
                    {
                      "score": 69,
                      "content": "Honestly, she might have thrown that one in to try and spook him out of it, but he pretty much called her bluff.",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I think that's a perfectly fair and reasonable compromise, honestly. The adding of the friends she can fuck after he dies is a bit weird and seems to more punish/reaffirm her dislike that he would still ride (bc clearly the financial aspect of it was no longer a problem), but if he's dead she has every right to move on. At the same time, again, cold and a bit disturbing to say that, bc then I'd be wondering which of my friends she's currently thinking about the possibility of having the chance to sleep with because I am taking a dirt nap.",
                  "id": 167,
                  "comments": [
                    {
                      "score": 26,
                      "content": "I think it's a \"you can't be mad if you're dead\" statement.",
                      "id": 168,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 101,
              "content": "In addition to a substantial life insurance policy, he needs a Long Term Care (LTC) policy.  Because if he gets in an accident, he may not die, but he may end up with life-altering injuries that need ongoing, possibly full-time care.  Not a lot of young couples with an infant can afford that.",
              "id": 169,
              "comments": [
                {
                  "score": 16,
                  "content": "LTC policies usually don’t kick in for 90 days so they need money for that set aside too.",
                  "id": 170,
                  "comments": [
                    {
                      "score": 8,
                      "content": "A lot of life insurance policies can come with LTC riders. Definitely Life, disability, and LTC.",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "My advice, too. He can do what he wants, and she prepares for his death by paying for a policy out of marital funds.",
              "id": 172,
              "comments": [
                {
                  "score": 11,
                  "content": "Pays out of his own funds, if they have separate finances or individual spending limits.  We call it our BLOW money, but my teens giggle when they hear the term.",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 29,
          "content": "Neither of of these people seem to realize that they’re individuals in a partnership. 100% ESH.",
          "id": 174,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1627,
      "content": "As a man, imo, buying something like that after your wife just finished growing a child and is most likely mukkin through PPD. Is just not smart. Because there's no way he didn't know how you felt about motorcycles. That's breach of trust. And puts him at TA. Plain and simple. No facts or statistics needed. \n\nI will say, I have friends who have ridden all thier lives and never been in an accident on their bike. I also have a few friends that have, one that lost their life, and one that wished she did. Your fears are valid for sure. \n\nAt this point, Id probably compromise and tell him the cost of riding his bike comes at him paying for the life/dis insurance and wearing practical safety gear. Some of the guys I know who ride always say  Skid Lids = Closed Caskets. \n\nHe's TA imo. Hope ya figure it out.",
      "id": 175,
      "comments": [
        {
          "score": 644,
          "content": "I \"asked\" my wife if I could get a griddle for our deck. It was on massive sale, and I had an unused gift card, which dropped the total cost to $150. But we have an agreement that we discuss purchases over a certain amount unless it's an emergency, or it's time sensitive and the other person isn't available. She didn't care that I got a griddle, and we're extremely financially stable, but it's a respect thing. We're partners.",
          "id": 176,
          "comments": [
            {
              "score": 188,
              "content": "... I have this same agreement with my husband, but the threshold is lower... mainly to keep us from buying stuff spur of the moment. So many people say that he is \"financially controlling\" me... because I like to discuss what we buy or how much I spend.",
              "id": 177,
              "comments": [
                {
                  "score": 128,
                  "content": "He is, in a way. And to him you are as well. In a completely normal and healthy way. You keep each other in check from making frivolous purchases. People will see whatever they want to see.",
                  "id": 178,
                  "comments": [
                    {
                      "score": 31,
                      "content": "I have the same agreement with my husband. He only ever broke that agreement once and I ended up being fine with it anyway. Anything over $100 that’s not bills, groceries, etc gets discussed. We never fight about money either.",
                      "id": 179,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 83,
              "content": "My partner and I aren’t even married or have finances tied\n\nWe live together and split things\n\nBut somehow I still manage to ask if he would be ok with a big purchase because like you said, we’re partners!\n\nAlso I hope the griddle is awesome\n\nNTA",
              "id": 180,
              "comments": [
                {
                  "score": 47,
                  "content": "She loves pancakes and hash browns. I can do it inside in my cast iron pans, but I'd rather clean a griddle than cast iron. She's getting so many freaking pancakes now.",
                  "id": 181,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I love that for you guys!!! Glad to hear it worked out great!",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Well this is the most wholesome thing I've read today",
                      "id": 183,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "My husband just asked if he could buy a $100 wok and it means he'll now make fried rice occasionally (the only thing he makes because I usually do the cooking). I will not turn that down lol",
                      "id": 184,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1144,
      "content": "NTA. Statistics and insurance rates tell us that motorcycles result in more frequent and more serious accident rates than cars. You have a newborn, and your husband has undertaken a statistically dangerous brand new hobby without consulting or thinking of his family.\n\n[Occupant Fatality Rates By Vehicle Type, 2020](https://www.iii.org/fact-statistic/facts-statistics-motorcycle-crashes)\n\nSource: U.S. Department of Transportation, National Highway Traffic Safety Administration.\n\n&#x200B;\n\n|Fatality Rate|Motorcyles|Light Trucks|Passenger Cars|\n|:-|:-|:-|:-|\n|Per 100,000 Registered Vehicles|67.08|6.90|10.79|",
      "id": 185,
      "comments": [
        {
          "score": 553,
          "content": "Thank you for this statistic! \n\nI'm blown away by the number of people that think a \"fun new toy\" is worth risking his families stability and potentially leaving his kid without a dad.",
          "id": 186,
          "comments": [
            {
              "score": 214,
              "content": "The timing of getting one 6 months after his kid is born is suspicious. Maybe something is going on in his head that he feels he wasn't ready to be a Grown Up with a kid.\n\nYou'd think you'd want to be more cautious to see your kid grow up now that you have one...",
              "id": 187,
              "comments": [
                {
                  "score": 16,
                  "content": "No one is ready to have a kid. Most of us deal with that feeling in a way that doesn’t substantially increase our kid’s chance of losing a parent…",
                  "id": 188,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Sounds like a typical midlife crisis. Husband realises he's going to be tied down for the unforeseeable future because of the baby, so the motorcycle is like his last shot at being \"free\" or \"independent\".",
                  "id": 189,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "It’s because half the people commenting on this sub are under 21. Probably more. I’m 23 so I’m not claiming superiority. But that’s why they aren’t focusing on the fact he has a whole ass family.",
              "id": 190,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 176,
          "content": "Thank you. Anyone saying “he’s an aDuLt and can make his own cHoICeS” is neither married nor do they have children. He doesn’t get to make unilateral choices that could result in OP being left a widow and their child fatherless 6 months after they have a baby! It’s impulsive and irresponsible. In her shoes I’d be reconsidering the marriage because he clearly gives zero shits about what he’d be leaving behind. Ex husbands are better than late husbands and easier to explain to the kid. And he better have a massive life insurance policy and hospitalization/accident coverage because I have a feeling if he almost dies and ruins their finances and lives, she’ll be the first to finish him off",
          "id": 191,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Wow. That is a *startling* difference to the UK. Over here, we have around 1.4 million motorbike users, and typically between 250-300 fatalities each year, putting our rate at around 20 per 100,000. Stricter licensing requirements and more stringent helmet laws, I guess, and wearing full protective gear is heavily ingrained in biker culture.\n\nThanks for posting the link. I was wondering why people were coming down so heavily on OP’s side, but this definitely goes some way towards explaining it.",
          "id": 192,
          "comments": [
            {
              "score": 14,
              "content": "That's likely part of it, but I'm guessing the other part is that the US is much geographically larger, and thus has a lot more interstate highways with 75+ mph speed limits, which also tend to have quite a lot of semi truck traffic due to most goods getting around the country that way. And many motorcyclists speed and weave through traffic congestion. Doing like 90 and getting clipped by a semi will end you even if you're wearing the best helmet and leather jacket in the universe.",
              "id": 193,
              "comments": [
                {
                  "score": 8,
                  "content": "I can confirm this. \n\nThe amount of motorcycles I see in the cities or country roads (which have strict speed limits and are windy so you can't speed that much) massively outweigh the 1 or 2 I see on the national Motorways.",
                  "id": 194,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 724,
      "content": "NTA\n\nHe should have told you before, obviously didn't because he knew that a dangerous purchase like this would be a no no!\n\nBetter to ask for forgiveness than permission eh?\n\nTell him to take out a life insurance policy, tell him to add a clause 'in the event of motorcycle death, widow gets $5million'. \n\nYou're not being controlling or anything you're genuinely afraid of him losing a leg or a lot more in an accident.\n\nTell him that if he's gonna ride the motorbike, you'll ride it too. Sometimes with the baby. See if that makes him see sense.",
      "id": 195,
      "comments": [
        {
          "score": 161,
          "content": ">Tell him to take out a life insurance policy, tell him to add a clause 'in the event of motorcycle death, widow gets $5million'. \n\nRight!\n\n\n>Tell him that if he's gonna ride the motorbike, you'll ride it too. Sometimes with the baby. See if that makes him see sense.\n\nExcellent ! Perfect answer.",
          "id": 196,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Needs permanent disability insurance too. I imagine caring for a vegetable for life is pretty expensive.",
          "id": 197,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 552,
      "content": "[deleted]",
      "id": 198,
      "comments": [
        {
          "score": 4,
          "content": "Totally agree.  Death is hard, becoming single parent is harder, becoming parent with child and disabled spouse is even harder. I have  married 45 years, and while the dollar value has grown, we have an agreed upon amount we never overspend without consultation.  The dollar amount has gone up over the years, but I cannot either of us would buy a motor vehicle without consulting the other.",
          "id": 199,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 460,
      "content": "NTA.\nIm with you on the danger. And I'm upset for you that he bought one without permission.\n\nI won't do or involve myself in anything that could result in me not being there for my kids.",
      "id": 200,
      "comments": [
        {
          "score": 404,
          "content": "Thanks, the big thing for me here is our baby. I can't raise her on my own and she needs and deserves to have him in her life. I'm certainly not saying every bike rider is a dead man walking, but my mother told us HORROR  stories growing up about people who came into her hospital who had been in bike wrecks",
          "id": 201,
          "comments": [
            {
              "score": 512,
              "content": "Make sure he has life AND DISABILITY insurance. You're not going to get him off the bike, but prepare for the worst.",
              "id": 202,
              "comments": [
                {
                  "score": 89,
                  "content": "Good and realistic advice",
                  "id": 203,
                  "comments": [
                    {
                      "score": 112,
                      "content": "I wish more people had life and disability insurance, including SAHMs who think they don't need it because they \"don't have any income.\" Try paying for everything a SAHM does -- it's expensive.",
                      "id": 204,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "And OP needs to make her husband get the safety gear that will be the barrier of life and death: a damn good helmet, damn good jacket, riding pants, and that bar thing that saved my Aunt’s BF’s life when a car hit him off his motorcycle and then ran over the motorcycle",
                  "id": 205,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 128,
              "content": "Statistics are on your side, both empirically and anecdotally. I have a friend who is an insurance actuary - his perspective is that if you ride a motorcycle, it's not an 'if', it's a 'when and how badly' you get into an accident.",
              "id": 206,
              "comments": [
                {
                  "score": 132,
                  "content": "Thanks. I mean, my Mom had good reasons for not wanting us involved with them. \n\nShe was a trauma nurse and saw terrible, terrible things. \n\nTried to bring back one rider who already lost his leg. Shocked him back to a rhythm SEVEN times before he died. His whole family was gathered in the ER lobby, sobbing. Grandparents, cousins, wife, kids, everyone.",
                  "id": 207,
                  "comments": [
                    {
                      "score": 12,
                      "content": "One of [these](https://www.revzilla.com/motorcycle/alpinestars-tech-air-5-system?gclid=Cj0KCQjwpeaYBhDXARIsAEzItbFYbwcn0z5sQgZRS9FfrxCAlbHEbTs27ZT3LHE4hLouZoOiQdrULtcaAo0mEALw_wcB) might help you feel better about him riding, I've heard good things about them but I've never used one myself, I don't ride motorcycles, I think they are required in races and people also use them for horse riding.\n\nEdit: any airbag vest really, I'm not saying that one is the best cuz I wouldn't really know, that was just the one I grabbed off Google.",
                      "id": 208,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "[deleted]",
                  "id": 209,
                  "comments": [
                    {
                      "score": 86,
                      "content": "I feel like we must live in different worlds.\n\nMost motorcyclists I see on the road, and especially on the highway, are changing between lanes quickly and speeding. Two things that greatly increase your chance of accident. Just because the accident is caused by a car hitting you doesn't make the car at fault if you are rapidly shifting lanes. I do occasionally see the old bikers on like Harleys being safe but those aren't the majority of motorcyclists.",
                      "id": 210,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "No statistic outweighs what YOU believe is best for YOUR family. If you cannot convince him NOT to ride... then increasing life insurance and health coverages should be a discussion. WITH the argument you just provided... what happens if he's gone... what is he willing to do while alive to provide in the event of his death. I don't think that is being unreasonable.",
              "id": 211,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I get it. Scary with a new baby you're still adjusting to in all ways.\nPlus not even running it by you is a bit disrespectful.",
              "id": 212,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Honestly, it's a valid fear. My dad has been riding motorcycles his whole life, but the moment he started a family with my mom he sold it. He didn't want to leave his kids without a father. My grandma's first husband died from a motorcycle accident leaving her with 2 young babies. This should be a time he sells any bike instead of buying one. NTA. Hopefully, he invests in a great helmet and leathers to protect him as much as possible.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I told my husband he is more than welcome to get a motorcycle if he wants, but he will also be getting a new wife. I would never tell someone they can't do something but I also have made the choice not to be with someone who rides a bike. It is a personal choice and he knows that. If having a bike is more important than having me then who am I to deny him?",
              "id": 214,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "My cousin and brother died in two separate bike wrecks so yeah… definitely get good life insurance on him if nothing else :/",
              "id": 215,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "My grandpa sold his bike after his first month as an orthopedic surgeon. I understand the argument she doesn't have a say in what he does but on the other hand people seem to be being purposefully obtuse about what a motorcycle accident looks like. She's already compromising if it was a deal breaker for her. I agree NTA",
          "id": 216,
          "comments": [
            {
              "score": 23,
              "content": "For real. Motorcycle accidents are horrific and too common. \n\nYeah, she had no say and he have her no choice to hit accept. Not cool in an equal marriage.",
              "id": 217,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 316,
      "content": "NTA.  I sold my bike after my kids were born.  They are absolutely as dangerous as people say. I had an accident myself, and I witnessed a fatal accident also.",
      "id": 218,
      "comments": [
        {
          "score": 82,
          "content": "NTA\n\nMy dad had a bike for a little while. he said that no matter how slow and careful he was,the environnement was so dangerous, even with a very very good gear, that it was way too risky to keep using it. \n\nHe sold it after a few month ofusing it (he hadone before my sister andI wereborn, but sold itwhen heknew my mom was pregnant), and is perfectly happy using a car only.\n\nMy cousin's partner had one aswell, and sold it the instant he knew he was about to become a dad. Same thing, hogh quality gear, and always serious while driving, but all the rest made it too risky.\n\n&#x200B;\n\nToo many people think that accidents only happen to others.\n\n(I also hope you recovered  well)",
          "id": 219,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I knew a guy who lived to ride his motorcycle. Like eat slept and breathed riding. His wife also learnt to ride because she literally would never see him otherwise. He had a very bad accident after his daughter was just born, and he came to our house to show us what exactly happened. He videoed all his rides, and the video was harrowing. He didn’t show the part here he was fighting for his life on the road, but he showed how he was leaning into a curve and the road was slightly even, causing his bike to go out from under him. It happened so fast. He was hospitalised with a broken collar bone and many other injuries. \n\nHe stopped riding. He wasn’t the greatest at being emotional, he was a guy who I thought didn’t care all that much about his family. But he said he wouldn’t ride again now his baby was here. That that accident really shook him not because he could have died but because he would have left his kid and wife behind. It didn’t occur to him until he was hurt. I always think of how this man literally adored motorbikes more than life and he was able to quit because of the risk involved for his family. If he can do it, I feel like pretty much anyone can",
          "id": 220,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}