{
  "post content": "Obligatory this is a throwaway because people involved are on reddit.\nI(29M) own my own home (this will be relevant later), my mum (53F) lives with me as she lost her home a couple years ago (long story/not very relevant)\nA year ago she began dating again and met R(47M) and they have been in a Relationship for 6months.\nWhen global issue began I agreed to allow R and his kids (14f,12m) to come live with us.\nNow I've met R enough times that we know each other as friends but not close friends, im just happy my mum is moving on.\nhe immediately began laying down rules he \"expects all the kids to follow\" and I thought fair enough you have rules for your kids its not my business. Of course he put out a reasonable curfew for the kids.\nSo now we get to 48hrs ago, I was feeling cooped up in the house and decided to go for a late night run with me immediately going to bed when I got back.\nWhen I woke up in the morning I went down for breakfast, as I hit the bottom of the stairs the living room door flies open with R on the other side red faced and obviously angry, he immediately shout \"in here now!\". I have no idea whats going on but I assumed it was to do with his kids so I go in and he slams the door shut so I turned and said \"was there any need for that?\" He goes wide eyed and starts going into an agry tirade \"how dare I disrespect his rules\" \"your step brother and sister follow the rules why can't you\" \"under this roof you show me respect, I'm your f***ing stepdad\" through all this im sitting on the coffee table in disbelief, getting angrier by the second, eventually he finished blasting off but not before his kids and my mum come down to see whats going on.\nThis may be where I am the a**hole.\nI stood up and pretty much stood nose to nose (yeah  its intimidating behaviour, my first mistake) and I just let rip. I asked him how dare he talk to me this way in my house, im a grown man, I do not follow your rules under my roof, if you can't handle that then get out you aren't my stepfather, you are my mothers boyfriend and we will never have the sort of relationship you clearly misled yourself into thinking we do, I expect an apology\". he packed his things and took his kids back to his own home, my mum said there was no need for me to be that nasty and accused me of going too far for embarrassing her boyfriend in front of his kids and undermining his parenting,now she's giving me the silent treatment.\n.....................................................................................\nFinally ready to update, so thanks to everyone for your comments and dm's on the original post, im going to answer some questions before I update.\n\n1. Yes R was well aware when moving in that it would be my house he is staying in.\n\n2. I'm not kicking my mum out, she needs a therapist not a change of address.\n\n3. To those who were curious about my parents marriage and how it ended, dad was controlling and manipulative and he hid it well, just like he hid his girlfriends. There were no fights or divorces, he was my dad and I do care, but he played away with the wrong woman and paid the ultimate price on her car bonnet, its sad, but I cant be angry about it.\n\n4. To the idiot who decided to assign race by behaviour, keep that garbage to yourself, aholes come in all colours and creeds.\n\nSo on with the update, probably gonna be quite short\n\nAfter finally talking with my mother she has apologised, she wasn't fully aware of what had gone on and thought I had been the one to start the argument. \nWe spoke about Rs behaviour and agreed this wasn't someone she needed in her life and that she needed a therapist.\n\nRather than come himself R decided to send his elderly parents around to talk with us, I was polite but made it clear I wouldnt be discussing this with them and instead asked them about the children's current situation, in short they are back with their mum and she is aware of Rs behaviour, she is not happy with him.\nR seems to be laying low for now and knows his relationship with my mum is over.\n\nFinally, I decided against charging for damage, the simple fact is getting him away from my family as quick as possible is worth more than a door frame and a cheap wall sconce.\n\nSorry its not an interesting update, but at least its a closed book now.",
  "id": 1,
  "comments": [
    {
      "score": 10013,
      "content": "NTA. You’re a grown man, it’s your house—and the trash took itself out.",
      "id": 2,
      "comments": [
        {
          "score": 3124,
          "content": "This! OMG so NTA. The best part is where your mom wasn’t invited to go with him back to his house...",
          "id": 3,
          "comments": [
            {
              "score": 1804,
              "content": "I thought that was pretty rich as well about his mom not going to stay with her boyfriend if she was that butt hurt about OP rightly putting bf in his place! Also, if he had a house to go back to, why did he move in with OP in the first place with his two children?",
              "id": 4,
              "comments": [
                {
                  "score": 808,
                  "content": "Hi, R lives in a 1 bedroom 3rd floor apartment and I live in a 4 bedroom house",
                  "id": 5,
                  "comments": [
                    {
                      "score": 805,
                      "content": "And he decided to police you??? I cant understand how he thought that would go well in any angle. \n\nWhy are you thinking you are the AH here anyway?\n\nNTA.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 82,
                      "content": "That makes sense you have more room. I’m so sorry he treated you like that in your home. You did him a solid. I have been finding it interesting lately how so many people seem to forget a parent living with their child isn’t the same dynamic as child living with their parent. I hope your Mum sees the difference once she cools down. \n\nNTA",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 41,
                      "content": "Hello, thank you for the clarification! Sorry that you had to go through that in your own house! What a great way to start the day!  /s",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 0,
                      "content": "He'll be back.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 200,
                  "content": "He want to be with OP's mom and covid makes it a bit hard when you don't live together.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 468,
                      "content": "Would've been much easier to just move op mom to his house though rather than 3 ppl.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 73,
                  "content": "Op didn't say the boyfriend had a house to go back to. Op said the boyfriend went back to his home. To many people, a home could be an apartment, a room in a relative's house or, even, a nursing home.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 101,
                      "content": "I don't think most people assumed actual *house* when OP said \"home\". It's just as weird if the guy moved his kids out and into OP's house from an apartment. I also don't know of any nursing homes that would take in a 47 year old and their kids.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "Im thinking possibly the mom has given the impression it was her house and R decided to act as patriarch, when OP declared it was his home then R had no choice but to crawl back under the rock he came from, he didn't take mom with him cos hes mad, he thought he'd landed on his feet with a gf with a 4 bedroom house. He tried to call the shots thinking it's his house now only to be shot down by the real owner, totally shamed him and probably exposed a chancer. Mom has possibly dodged a bullet here and OP- definitely NTA!",
              "id": 14,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -13,
              "content": "[deleted]",
              "id": 15,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 322,
          "content": "Yep. It's a literal \"YOU HAVE NO POWER HERE!\" situation. NTA.",
          "id": 16,
          "comments": [
            {
              "score": 97,
              "content": "Did you just summon the crotch of David Bowie?",
              "id": 17,
              "comments": [
                {
                  "score": 13,
                  "content": "*snort*",
                  "id": 18,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I like your username <3",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Through dangers untold and hardships unnumbered, I have fought my way her to the castle beyond the goblin city to take back the child that you have stolen. For will is as strong as yours and my kingdom as great. You have no power over me!",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 188,
          "content": "He yelled at a full grown adult.....who was paying the bills....and putting a roof over his head ....for reasonably adulting...\nMake no mistake, slamming doors is violence. He started violent, you shut him down. NTA",
          "id": 21,
          "comments": [
            {
              "score": 137,
              "content": "First they slam the door. Next time they punch the wall. After that they grab things out of your hands. Then they throw you into the refrigerator. Then they push you to the floor. Then they straddle you and strangle you. \n\nBut they’ll always say it’s not abuse because they didn’t punch you. \n\nDon’t forgive them. They will get worse.",
              "id": 22,
              "comments": [
                {
                  "score": 25,
                  "content": "Yes! I am no contact with my parents because they are abusive in many ways. I tried to have a relationship with my older sister (golden child) but she refused to see them as dangerous. She accused me of making it up and I just stopped and said, \"how many holes are in the walls of out parents house that they haven't bothered to fix? And what about the few they did fix? She told me I was an asshole. But my dad would pull my hair, push me, scream in my face, spit on me, and a few times worse. But mostly he stuck to being in my face and spitting. He and my mom are stalking me. They have a no trespassing notice. So, they stood on the sidewalk with their new dog and called to my kids. A lawyer said because I can't prove they are recently violent (because I won't let him near me to hurt me) I can't get a restraining order. This man has a paint ball gun with ball bearings and pepper spray. He told the police he was going to do what he wanted and no one could deny him access. But since these are my parents, even though I am an adult with kids of my own, I am treated like their property.\n\nThey even got the damn police to knock on our door a week before Christmas and asked us to come to the station so my parents could give my kids a special Christmas. The officer seemed to not understand that they used him because they couldn't step foot onto our property legally! We had to remind him of the violence and he told us to lock our doors and call if they showed up. At least the house they are building behind us is to a family with a police officer in it. At least my kids and husband can run for help when my dad eventually snap sand murders me (which I am convinced he will).",
                  "id": 23,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I'm sorry that is so fucked :(",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Yes! Higher up. This is bad news. It will escalate. I worry for his kids and your mom. It’s nice she’s dating but someone this controlling and weird is not the guy.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 116,
          "content": "NTA, I seriously don't understand the thought process of people like this.",
          "id": 26,
          "comments": [
            {
              "score": 69,
              "content": "If you're curious about that, read Why Does He Do That by Lundy Bancroft (available in all formats including, I believe, a free pdf out there for those without means or in a hurry).\n\n[This article](https://narcissistfamilyfiles.com/2019/09/02/identifying-the-covert-narcissist-in-your-life-a-checklist/) is also helpful, as well as their [missing missing reasons](http://www.issendai.com/psychology/estrangement/missing-missing-reasons.html). Perhaps my favourite is [Don't rock the boat](https://www.reddit.com/r/JUSTNOMIL/comments/77pxpo/dont_rock_the_boat/), possibly sharing the spot for best essay ever written with [Ur-Fascism](https://www.nybooks.com/articles/1995/06/22/ur-fascism/) by Umberto Eco.",
              "id": 27,
              "comments": [
                {
                  "score": 24,
                  "content": "Why Does He Do That? was illuminating to say the least. I think it should be required reading in High School and there should be a test at the end.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I’m always here for people recommending Lundy Bancroft!\n\nAlso NTA, and it’s alarming that your mother isn’t on your side about it",
                  "id": 29,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Happy Cake Day!",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "Absolutely NTA. What kind of entitled shit is this? It's your house, not his house. Wow.",
          "id": 31,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "What the actual eff is with this guy?!? He is trying to control a near 30 year old man in his own house and he thinks he gets to just coz he is banging is mum? \n\nMum dodged a bullet thanks to OP.",
          "id": 32,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "This! ^ NTA",
          "id": 33,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Agree, NTA, and thank goodness he removed himself instead of forcing you to go through an entire eviction process.",
          "id": 34,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "THIS!! Omg what a heaping pile!!! NTA!!! Good for you and so glad he left!!!",
          "id": 35,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "NTA i salute you Big Man! Your house, your rules!!",
          "id": 36,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4393,
      "content": "LMFAO @ this dude who thinks he can parent a 29 year old adult who's not even his kid. Bonus points for trying in the 29 year old adult's house!\n\nNTA kick that guy out ASAP",
      "id": 37,
      "comments": [
        {
          "score": 1078,
          "content": "And make sure he doesn’t try to damage anymore of the house!",
          "id": 38,
          "comments": [
            {
              "score": 1588,
              "content": "He did do some damage it seems, sconce near the door is down and the door jamb is out of the dry wall",
              "id": 39,
              "comments": [
                {
                  "score": 1674,
                  "content": "make sure to send him a bill for damages",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 753,
                  "content": "Does this dude ever hear the phrase \"my house, my rules\"? Or was he under the impression the house belonged to your mum? Find that out. And change locks. NTA",
                  "id": 41,
                  "comments": [
                    {
                      "score": 447,
                      "content": "Even if the house belonged to OP's mom it still didn't become his house simply by f-ing the mom.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Even if the house did belong to his mom it wouldn't change that he's an adult not a kid.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 249,
                  "content": "Even if your mom won't listen/talk to you, I'd say advice her to break up with him. If he reacted like that by learning that the 29 year old adult who owns the house they've been staying in didn't let him press you under his tumb, didn't let him be in command over you under your own roof, and didn't get to treat you like a kid just because he too was also a member of this house now and a man, imagine what he could do if he thinks your mother is suddenly flirting with other men or thinks she's getting too friendly with other men or thinks she's spending too much time too often with her male friends.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 261,
                      "content": "This is why I'm worried for those kids, I really want to find a way to get in touch with their mother, if nothing else to at least make sure someone is keeping an eye out for them",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "He sounds absolutely bonkers",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "I didn’t realize he damaged the house in his rage! Definite red flags for your mom!",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Dude even if you had been a minor living in tour mom’s house.  That is a completely insane and violent response to you “breaking” a rule.  \n\nBill him for the damages.  Add a threat if small claims court if he doesn’t pay up. \n\nNTA",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 356,
          "content": "NTA!!! What grown ass man tries to parent another grown man and one he’s not even known for a year!!! If he’d helped raise him from childhood maybe it would be understandable that he thinks OP should treat him like a father figure and follow his rules (but again OP is a grown man and can decide his own rules). Lol your mom should dump him and be glad that she dodged a bullet!!",
          "id": 49,
          "comments": [
            {
              "score": 214,
              "content": "You don’t parent grown ass people, period. My parents married other people when I was 23. I think they both consider me their daughter, but to me they’re just the people my parents married. I see them maybe once a year. They never tried to parent me, and bad things would have happened if they had.",
              "id": 50,
              "comments": [
                {
                  "score": 167,
                  "content": "You don’t *discipline* grown ass people the way a parent does with a child, but offering support, advice born from wisdom and filling an emotional gap that needs to be filled (when wanted) are all parenting moves that can be done by older adults to younger ones without being wrong. I’ve heard/read too many ‘My first boss was more like a father to me than my own father’ to believe that *every* adult, everywhere, doesn’t benefit from a parental figure in their lives just cause they passed the magic age number.\n\nBut in this case the whole thing is super weird. Mr. 47 is an asshole.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 303,
          "content": "> Bonus points for trying in the 29 year old adult's house!\n\nI wonder if he had \"somehow\" been given the mistaken idea that it was actually OP's mother's house.  Such an assumption may have led him to think he had more leverage.",
          "id": 52,
          "comments": [
            {
              "score": 336,
              "content": "That might also be the real reason OP’s mom is so upset now—OP embarrassed *her* by exposing her lie.",
              "id": 53,
              "comments": [
                {
                  "score": 114,
                  "content": "Oooh, good point! I hadn't considered that. I think it's tome his mummy went to live with her boyfriend.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": "Omg. OP read this please. This is exactly the thoughts I had when I read the post. \n\nPretty sure the reason 3 people move rather than one was because he believed that is was OPs mums place and she told him she didn't want to move away and \"leave her son alone is her house\" or some kind of BS to make it so that she didn't have to lift a finger to get what she wanted.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "OP addressed this elsewhere [here](https://www.reddit.com/r/AmItheAsshole/comments/jjdnx5/aita_for_embarrassing_my_mothers_boyfriend_in/gad6r02)\n\nAt least in his POV everyone knew who owned the house.",
                  "id": 56,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "He's not even his stepkid. They basically have no real relationship. NTA all the way.",
          "id": 57,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1172,
      "content": "NTA\n\nHe embarrassed himself lmao",
      "id": 58,
      "comments": [
        {
          "score": 139,
          "content": "That's big facts.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "fr, if this is exactly what happened i don’t see how the mother can see it any other way",
          "id": 60,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1011,
      "content": "NTA- idk what “rule” you broke but it is your house and he shouldn’t have started going off on you. Y’all should’ve talked like grown men, but to late now lol",
      "id": 61,
      "comments": [
        {
          "score": 1393,
          "content": "He was upset that I broke the curfew he placed for what I believed at the time just his kids, being 29 I dont see why I would be subject to such a thing and yes we should have talked like grown men, he set off my anxiety with the way he initiated the confrontation",
          "id": 62,
          "comments": [
            {
              "score": 1356,
              "content": "...he tried to give you a curfew, at 29, in your own home, after knowing you for only 1 year.\n\n...wow.\n\nYeah 100% NTA the dude is mental.",
              "id": 63,
              "comments": [
                {
                  "score": 479,
                  "content": "He is probably controlling and abusive. I bet you he has been controlling OP’s mother and certainly his own children. He made the mistake of over reaching with the OP. It’s sad that the OP’s mum is still into him, as for his poor kids...",
                  "id": 64,
                  "comments": [
                    {
                      "score": 108,
                      "content": "That’s probably why he immediately left. He realized he had zero power over OP and very little power in OP’s house (obviously still has power over his kids and apparently OP’s mom too).",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 107,
                  "content": "I’m 32 and I don’t even have a “curfew” anymore when I go to visit my parents in *their home* (my childhood home). I’m a grown woman; my daddy doesn’t tell me what time I can come home anymore. If I come home late, I obviously enter as quietly as possible and try to avoid disrupting others, but nobody gets on my ass about what time I came home. Sometimes, if my dad can’t sleep and is lying in bed awake, he’ll come downstairs when he hears me come in and he’ll make a snack and we will sit at the kitchen table and chat. It’s very cosy. Nobody’s bellowing “where the hell have you been, young lady! It’s 2 AM!” at me. 🙄",
                  "id": 66,
                  "comments": [
                    {
                      "score": 23,
                      "content": "I moved back in with my parents at 19 after trying to live on my own for a while and discovering it sucked.\n\nNow my dad and I had had issues through my teenage years because I felt like they expected a lot of me in terms of taking care of my (sick) mom and younger sister and the house while still imposing a lot of rules, so while I was nervous about us getting along, I prepared myself for “his house his rules” again. I’d gotten into a bad relationship where we got engaged and I ended up supporting him and his sister as the only one with a steady income, so tbh, I was okay with trading freedoms for being a kid again for a bit.\n\nI don’t know if he’d been thinking about those fights or if my mom has a lucid moment before I came back and gave him a talking to or what but basically as long as I was doing SOMETHING (work/school), my mom was happy, and he could depend on me to help out, he was content footing the bill and treating me like an adult.\n\nWe had hiccups of course, but my point is that when I moved back home, I was 19, in debt, and my main household contribution was watching TV with my lonely mom, and my dad recognized me as an adult because he knew that, while I WASN’T currently supporting myself, I could, and it benefitted us both to do this.\n\nI could come home at 1am living under his roof and he could know that my mom was fed and happy (and she did do much better while I was home for a while actually, having her “babies” around always gave her a boost) or I could do it in my own place and we could both be on the hook for more responsibilities. Ultimately, he preferred having another adult in the house so he decided to treat me as one.\n\nPoint is, my “respect your elders”, “I brought you into this world and I can take you out again”, “if I’d spoken to my mother that way I’d be out cold” father treated me with more respect than OP’s not-step-father did at 29 in his own house. My dad never abused be, but because of his upbringing there were times it was clear that an effort was going into that. (His mother would have/did knock him out cold for much smaller offenses than whatever I had done). \n\nSo many red flags.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "That is cool. My mom came to visit me a few years ago for a few weeks (she lived out of the state) , and I had a party to go to with some friends. I told her about it and when I said goodby, she asked me when I was coming home. I responded, in a nice way, that I was a 40 yr old woman, who owned her own home and I would be home whenever I pleased  lol",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "My dad used to do that too when I'd come home late. I swear there was a few times he'd stay up/get up early so we could have breakfast together.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 375,
              "content": "IT'S YOUR HOME.\n\nYou didn't start that confrontation, HE DID. \n\nHe's not your stepfather, those aren't your step siblings, he's been dating your mom for barely HALF A YEAR, and he has ZERO, NADA, ZIP, ZILCH authority over you as the homeowner, HIS HOST.  \n\nBloody hell, he has exactly as much authority to give your neighbors a curfew as to dare, to DARE to impose his rules on you, the unbelievable GALL. \n\nHells bells, he was a GUEST, and he behaved like THAT? I'm utterly FURIOUS for you.  \n\nNTA, and don't you gorram doubt yourself for a moment!\n\nAnd don't permit that... person.. in your house ever again until he gives you a honest, true, and sincere apology for his behavior, his treatment of you, HIS HOST, and repairs the damage he caused with his tantrum on the way out. I know you want your mom to be happy, but the pure disrespect this man displayed was ludicrous!",
              "id": 70,
              "comments": [
                {
                  "score": 71,
                  "content": "Had to reread in Mal's voice once I hit, \"gorram\", and I love you for it.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I think it's better in Inara's voice. You know she'd work herself up to actually swearing.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Agree with everything except the last paragraph. Just don't bother even if he apologizes. \nIf the mom don't see this as a red flag, then OP needs to do an intervention.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "Did he realize that you owned the house? Is it possible that your mom lied to him and made you out to be some 30 year old deadbeat still sponging off his mother?",
              "id": 74,
              "comments": [
                {
                  "score": 45,
                  "content": "Even so, you don't get control of an adult just cause you're dating their mom. OP's almost 30, regardless of where he lives he can do whatever the heck he wants.\n\nAnd tbh if that's how she spun it OP should kick her ass out.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Of course, I’m just boggling at how he could have possibly thought he had even a little justification...",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 47,
              "content": "Then yea, you’re NTA. How is he supposed to make rules for you in your house. But hopefully, if you would want to, y’all fix the issue as grown men for your mom at least",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "Yes. How dare you the owner of this house and gracious host to him and his children defy his rules...",
              "id": 78,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": "Nah you responded like for like. He's a controlling bully and probably would not have listened to calm reasonable dialogue.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "NTA!  He set the tone for that conversation. If he wanted to be the adult in that situation he should have started by talking to you, not shouting, slamming doors and lecturing you.  Even if you *were* his errant teen, that is 100% NOT the way to confront you! \n\nAnyone who could have kept their cool under those circumstances should be offering up their services to the Middle Eastern Peace Process, because they clearly have superpowers. \n\n*You* didn’t embarrass him. He embarrassed himself.  He undermined his *own* parental authority by being an unreasonable dick.\n\nIf he’s treated his children like this their whole lives, he may have kept them so cowed that this is the first time someone he views as inferior has stood up to him.  AH has no idea how to deal with it.  It might also be the first time your mother has seen him go off, and she might be taking her own embarrassment at his behaviour out on you. \n\nBe glad they’re gone, enjoy your space for a bit.  But keep an eye on your mum - he sounds like a controlling douche with anger issues who could easily be abusive.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Good riddance honestly. And it makes more sense for your mom to go live with him and his kids. You’re old enough to have your own kids, smh. Weird dude , glad he left. NTA",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Is it possible he believes this is your mom's home therefore you are the \"guest\" and as her boyfriend he's got a right to make rules for you in her home? Because it would explain his outburst and your mom's silent treatment.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "The entitlement? Astounds me? NTA",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Nope. Someone comes into MY HOUSE expecting me, a GROWN adult to follow their rules, DAMAGING  MY HOUSE, and then SCREAMING at me definitely has no right to any kind of respect. Fuck that.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Probably should have busted his face really, it's almost all these kinds of people understand. They don't understand maturity, they don't understand respect, they only understand \"respect\" (abject fear resulting in obedience) and being MADE to respect others.\n\nProbably abuses his kids and treats everyone around him that isn't in a position of authority over him like he did OP.\n\nOn god I don't miss working around \"type a\" (massive eyeroll) people anymore.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 616,
      "content": "INFO: If he has his own home, why doesn't he live there? And why wouldn't your mom live with him?\n\nI mean, obs, you're NTA. He was completely out of line and I worry about how he's with his own children. But I'm wondering why the hell did he have to move in with you, to begin with?\n\nAnd your mom needs to apologize profusely for her boyfriend's behavior. Not apologize for yours. Honestly, there seems to be a lot more going on under the surface there that would be a mover's job to unpack. I only have two teenagers who live with me and I know I'd go apeshit on someone I was dating who thought they could even raise their voice to my kids in my house like that let alone speak to my daughters inside their own homes in that way. She needed to back you up, tell him to get the fuck out, and break up with his loser ass right then and there. \n\nIDK, man, I think he's showing some mega-warning signs your mom should be majorly picking up on. And if she's not, I'd do some gentle asking if I were you. Because no one would talk to my daughters that way. And if it was my mom's boyfriend, I'd be asking her if he blows up like that on her as well.",
      "id": 86,
      "comments": [
        {
          "score": 569,
          "content": "He was staying with us due to lockdown, it was a better option at the time as his flat is tiny but my house is not, ive tried probing my mother asking about how he is when they are alone but she is still ignoring me",
          "id": 87,
          "comments": [
            {
              "score": 606,
              "content": "No shade. She can get tf out too. Does she even care how her bf treated you in your own house.",
              "id": 88,
              "comments": [
                {
                  "score": 450,
                  "content": "I'm not sure on my mothers reaction, she doesn't do well with confrontation or defending herself/others, my dad was a grade A narc and gaslighter and it left her a bit of a mess when the marriage was over",
                  "id": 89,
                  "comments": [
                    {
                      "score": 459,
                      "content": "I get that but she obviously doesn’t have much of a problem defending others as she’s definitely defending her boyfriend and standing up to you.",
                      "id": 90,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 95,
                      "content": "This is a fair point. A lot of people who have one abusive (or controlling/gaslighting) relationship can go on to have more, maybe because the horrible behaviour feels normal to them.\n\nIf he is an angry, controlling man, you'll be better placed to protect your mother if you don't let him drive a wedge between you two.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "\"my dad was a grade A narc and gaslighter and it left her a bit of a mess when the marriage was over\"....seems like she found another potential narc :/",
                      "id": 92,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "Sounds like she found herself another winner. He feels he rules over everything, including you and your home, and is willing to get loud quickly over it. What do you think he'll do to your mom when she breaks a rule?",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I’m wondering whether part of why he spoke to you that way was maybe his mother told him it was her house? Do you think thats something she might have done? Might explain why she’s gone silent on you instead of just trying to defuse the situation",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "That doesn't excuse her behavior. If she cannot respect you and stand by you, she shouldn't be living with you.",
                      "id": 95,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 45,
              "content": "Are you sure your mom didn't let him believe she owned the house?",
              "id": 96,
              "comments": [
                {
                  "score": 103,
                  "content": "Everyone involved was aware of who owns the house",
                  "id": 97,
                  "comments": [
                    {
                      "score": 75,
                      "content": "If that's the case then he is a very entitled individual. Did he think he could just come in and boss you around in your own property? Weird.",
                      "id": 98,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 492,
      "content": "NTA. You are a 29 year old man being expected to follow the rules he implemented for a 12 year old?\n\nYour mum should be thankful that she has an insight into her boyfriend",
      "id": 99,
      "comments": [
        {
          "score": 358,
          "content": "This wouldnt be her first poor choice of partner, my dad was not a good husband",
          "id": 100,
          "comments": [
            {
              "score": 226,
              "content": "A gentle reminder you are not responsible for her choices. You are sweet to look out for her but you deserve happiness and safety too. And I guess new wall decor.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "Her reaction screams that this is ops normal. \n\nTry to talk to her about this. I know it’s hard, but healthy non-abusive people don’t speak like that to anyone, much less a grown ass man IN his grown ass man house. \n\nThis dude is a walking red flag.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "Honestly I know she ignoring you and not responding but she doesn't have to respond to listen. I'd be telling her that she's picked another man like your dad and him shouting the way he did triggered that reaction in you because of that. There is no point asking her directly what he's like in private because she isn't going to tell you so I'd be pointing out exactly what you recognised in him in comparison to your dad and their relationship and tell her you can see she's falling into the exact same situation again and it scares you. NTA. This guy has sheer audacity and even though your mum is being stroppy I'd be really concerned for her if I were you.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "It sounds like she’s gone from one abusive partner to another :( give her some space and time away from him and hopefully she will open up and see his ridiculous behaviour for what it is.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "In HIS OWN HOME no less! Crazy.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 365,
      "content": "NTA.\n\nSome random dude literally rolled up into YOUR house, slamming doors, and yelling like he pays the bills and his name on the title. He tried to show dominance and intimate you (most likely does the same to his kids and maybe your mother) and backed the fuck down when he realized that met someone he didn't have control over and could probably beat that ass.\n\n\nIt's probably true because his ass bounced back to HIS home after he was emasculated.",
      "id": 106,
      "comments": [
        {
          "score": 355,
          "content": "He may actually have to pay a bill as it seems his door slamming has dislodged the door jamb from the drywall and brought down a nearby wall sconce",
          "id": 107,
          "comments": [
            {
              "score": 192,
              "content": "Oh yeah no, I applaud you for having self control. I would've taken him out. He had little to no respect for you and your home and going around broking stuff. He is rude and disrespectful. I bet his house is full of holes from him breaking things.",
              "id": 108,
              "comments": [
                {
                  "score": 181,
                  "content": "I'm just hoping he isn't this way with his kids, at least when they were here I knew nothing shadey was going on",
                  "id": 109,
                  "comments": [
                    {
                      "score": 76,
                      "content": "He probably does also, I'm not saying he is like that towards your mother (I hope not) but it's troubling that he felt comfortable and bold enough to do it to you.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 58,
                      "content": "If he's able to be like this with you, a *29yrold man,* then he's definitely an asshole to his own kids who aren't even of legal age. He tried to intimidate you, and you stood up for yourself. These cowards usually get frightened when their bullying target fights back.\n\nAlso what the fuck? He has no clue of social boundaries? Living in another dude's house with his kids (for free i assume) and he dares to do this? Haha. \n\nDelusional.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "That's what I was thinking. If he blows up in rage about a relatively small rule being broken how is he parenting two adolescent children? That is a huge red flag. He sounds like me step-dad who was a nightmare. Anyone who can't control their temper without having physical outbursts has absolutely no business being around children. He is going to screw those kids up, even seeing that kind of rage from a family member is damaging.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "I’d consider filing a police report. It’ll help when you take him to small claims court, and dude deserves whatever sticks to his record.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Agree.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 224,
      "content": "NTA, like you said, you’re a grown man and he got aggressive for no reason other than to show dominance. You did right sticking up for yourself and your mum has no right to be upset with you",
      "id": 115,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 93,
      "content": "NTA\n\nHis reaction is absolutely laughable. Who the f*ck goes to someone else’s house and demands respect and makes household rules?? Nah man I wouldn’t have wasted my breath I would have silently walked away and packed his sh*t for him and put on the porch.",
      "id": 116,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 62,
      "content": "Holy shit if you’re not a troll, NTA that is insane. He lives in your house and you’re a grown adult. If he never comes back, your mom dodged an awful bullet. There’s def more insanity to follow, this is just the tip of the iceberg",
      "id": 117,
      "comments": [
        {
          "score": 62,
          "content": "It wouldn't be her first rodeo with crap partners, im just wanting to know what was going through his head",
          "id": 118,
          "comments": [
            {
              "score": 2,
              "content": "Try not to waste too much of your life attempting to figure out how a-holes think. It's a pointless endeavor.",
              "id": 119,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}