{
  "post content": "My ex and I had an peaceful divorce. We co-parent our 3 children together and there haven’t really been many issues. My ex is getting married to Stephanie. I like Stephanie she has been great with my kids and makes my ex happy. My ex invited me to their wedding and I was happy for him. It was my day with the kids so it made sense for me to come was his reasoning. When I arrived at the wedding Stephanie thanked me for dropping the kids off and brushed me off. We had never had any issues before.\n\nI explained that I was going to stay for the reception and she was very upset. I was confused because I assumed she knew I would be in attendance. It turned out she didn’t consider that I would actually accept the invitation. I told her that I was invited and since I took the 2 hour drive I would be staying for the entire duration. She didn’t like this response. Stephanie asked me to leave and I stood my ground. She went on to complain about my dress upstaging hers. My ex and former mother in law helped her to calm down and the wedding shortly began.\n\nI thought that was the end of it, but later in private Stephanie accused me of trying to ruin her special day. She is convinced that I wanted to show off and make the wedding about my divorce. She said it was rude for me not to leave after the bride requested it because it was her special day. I told her that I am not responsible for her insecurities and once again reminded her that I have no interest in ”stealing” my ex back.\n\nEdit: the dress is posted on my page and since this is a throwaway i don’t remember the random password i typed up. i will also be active on u/closureseekingex2",
  "id": 1,
  "comments": [
    {
      "score": 52548,
      "content": "YTA I love when these posts are skewed to be “but I didn’t do anything wrong!” And then you see the dress and it’s literally a red wedding dress\n\nhttps://www.amazon.com/dp/B07T9M5S7G/ref=twister_B07FR31MHV?th=1&psc=1\n\nETA: this is from her post on her profile",
      "id": 2,
      "comments": [
        {
          "score": 17364,
          "content": "Lmao that’s hilarious. This needs to be higher up. I didn’t think OP was t a but now OP YTA.\n\nETA: I responded to this when it was 1 minute old but I’m glad it got the attention it deserves. Go Redditers!\n\nETA2: before OP deleted their previous posts/comments they apparently had bragged on r/trueoffmychest about upstaging the bride at her exes wedding. \n\nYTA TIMES A MILLION HOW CAN YOU EVEN ASK OP.",
          "id": 3,
          "comments": [
            {
              "score": 10744,
              "content": "YUP. OP pretended to wear a \"pretty dress\" knowing we'd all assume it'd be a pretty cocktail dress or a similar outfit. Nope she shows up in a full on black-tie gown, which actually could be a red wedding gown.  She knew what she was doing - 100% YTA.",
              "id": 4,
              "comments": [
                {
                  "score": 4046,
                  "content": "Read the link. It's literally a wedding dress.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2609,
                      "content": "Yep!\n\nSIQINZHENG Women's Sweetheart Full Lace Beach Wedding Dress Mermaid Bridal Gown",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1045,
                      "content": "op keeps saying its a *similar* dress to the one she linked. there are other sleeveless red dresses she could've shown us but the one she chose just ~happened~ to be a wedding dress? c'mon",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "And RED!! Isn’t that the traditional colour to wear if you’re the mistress?? I know these things are dumb and outdated but it feels pointed",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "No, but also A WEDDING DRESS FOR A MERMAID-- extra upstagey, Ariel.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Ohhhh, so a “WEDDING” dress ISN’T a dress that guests wear to a wedding??? How confusing!!! \n\n/s LOL",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Good lord. \nAnd I bet you that OP’s response would be  «  oh, but when it said wedding dress, that just means that it would be appropriate to wear to a wedding… »",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1433,
                  "content": "Yep, from an ex I expect nothing but the tea length or cocktail length, floral print can't-go-wrong dress.\n\nSomething like this https://i.pinimg.com/736x/40/92/9c/40929c619755cd66f25ee84c504032f5.jpg\n\nOr this https://www.joebrowns.co.uk/media/catalog/product/W/E/WE544A_1.jpg?quality=90&bg-color=255,255,255&fit=bounds&height=&width=\n\nOr this https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcScAl0cMPDB6ckW-QFYtIEi53PS9Dx6uKH9To58UzvTdroOgUViONwE-KQr7-zbCGc3B9bJL3k&usqp=CAc\n\nNot a wedding gown. Wtf. YTA.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 793,
                      "content": "I feel like that really really depends on how formal the wedding was? OP said this was a formal wedding, which to me means evening attire? Or is here sth lost in translation? Like if i showed up to any formal event in the 1st or 2nd dress, I would be underdressed af. That’s a casual summer dress. The 3rd maybe because it’s a silky fabric.\n\nEdit: My pick for OP https://www.peek-cloppenburg.de/de/p/mascara-cocktailkleid-in-schimmerndem-design-rot-1642208 It’s still red and sexy, but a lot more sleek and less formal. Cute midi length, no train. No beading, no lace.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Yep, the co-parent is one of the most marginal guests at a wedding. There's definitely levels of appropriate dress for different levels of guests. Like of course the couple's parents will be dressed very nice since they'll get some eyes on them that day. Close friends and family will dress nice for pictures and to add to the atmosphere. But the more distant guests I would expect to wear whatever they had in their closet and not pay for hair or makeup. The marginal guests can get away as well with being more casually dressed",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Oooh I want that first one!  It's nice enough to dress up or down.   I bought a literal ballgown for a formal night on a cruise once, never wore it again.   I'm all about the wearable stuff now!   My fanciest dress is this one [https://www.garageland.fi/en/bettie-page-alika-circle-dress-red-10456.html](https://www.garageland.fi/en/bettie-page-alika-circle-dress-red-10456.html)   (Bettie Page Alika Circle in navy), I've had it for years now and wear it to funerals and parties and cruises and anything, I adore it and the cut is super flattering for big hipped gals.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "She could have shown up in a dress like one of these and I'd have given her leeway and say she's not the asshole. \n\n[Rosette A-Line Gown](https://www.macys.com/shop/product/alex-evenings-rosette-a-line-gown?ID=2287674&tdp=cm_app~zMCOM-NAVAPP~xcm_zone~zPDP_ZONE_A~xcm_choiceId~zcidM05MVZ-f31bef45-b908-4560-aa50-20f4644e274a%40HB2%40Customers%2Balso%2Bshopped%245449%242287674~xcm_pos~zPos3~xcm_srcCatID~z5449) [Beaded Gown](https://www.macys.com/shop/product/adrianna-papell-beaded-gown?ID=10486608&CategoryID=5449&isDlp=true) [Off-Shoulder Mermaid Gown](https://www.macys.com/shop/product/betsy-adam-off-the-shoulder-mermaid-gown?ID=10475419&tdp=cm_app~zMCOM-NAVAPP~xcm_zone~zPDP_ZONE_B~xcm_choiceId~zcidM06MYD-eb00144b-9db1-4178-83d4-38e4c22923fc%40HB1%40Customers%2Balso%2Bloved%245449%2410475419~xcm_pos~zPos4~xcm_srcCatID~z5449) [Red Off The Shoulder Dress](https://www.macys.com/shop/product/vince-camuto-off-the-shoulder-gown?ID=13296067&tdp=cm_app~zMCOM-NAVAPP~xcm_zone~zPDP_ZONE_B~xcm_choiceId~zcidM06MYD-eb00144b-9db1-4178-83d4-38e4c22923fc%40HB1%40Customers%2Balso%2Bloved%245449%2413296067~xcm_pos~zPos5~xcm_srcCatID~z5449) [Three-Quarter Sleeve](https://www.davidsbridal.com/product/three-quarter-sleeve-embroidered-jersey-sheath-d40ny23241) [Double Slit Sequin Lace](https://www.davidsbridal.com/product/double-slit-sequin-lace-a-line-dress-d28ny22286v2) \n\nBut an honest-to-God wedding gown?? YTA OP.\n\n(what no of course this comment wasn't just about linking pretty dresses why would you say that)",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Eh, floor length is fine but in muted colors or floral as you mentioned.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Yo imma save this shit. Ladies in ma house gon love this collection",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Exactly what I was expecting when I read “a pretty dress”.\n\nWhat OP wore was a wedding dress, dyed red.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1036,
                  "content": "I wore a red wedding dress for my wedding and it was less wedding-like than this one. 😂",
                  "id": 20,
                  "comments": [
                    {
                      "score": 574,
                      "content": "[removed]",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Why wear your wedding dress once when you can do it twice? ...to your ex's wedding",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "I wore a suit to my cousin's wedding and this was less fancy-like then this on. Then again I was six and hated wearing suits cause they made me uncomfortable",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "🤣🤣🤣 lmao",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Me too! Mine was a smart 40s-style red suit.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "My wedding dress was almost identical, just in off white.",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "Exactly what I thought!\n\nOther guests must have been laughing behind OP’s back.\n\nYTA OP",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Looking at the dress, I think she was channeling the Red Wedding 🤣",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "That’s not black tie, that is a literal wedding gown. And even if she got it in red it would only be appropriate at a straight up white tie wedding.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "My daughter got married in that dress. It is even prettier in real life and it is definitely a wedding dress.\n\nOP\n\nYTA",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1305,
              "content": "I thought she was YTA anyway - sure, the bride’s insecurities ‘aren’t her problem’ on a regular day, but on your own wedding day, I think it’s the one day you shouldn’t have to deal with your husband’s ex if you don’t want to.",
              "id": 31,
              "comments": [
                {
                  "score": 247,
                  "content": "I mean, I agree, but in that case, why was she invited to the wedding at all? It’s pretty weird to invite someone and then get mad when they come.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 129,
                      "content": "Maybe she changed her mind when she saw the dress",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Doesn’t matter. She was disinvited by the bride",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "It's part of healthy co-parenting. Trying to show the kids that you can all get along. \n\nWhich apparently isn't the case.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "You're exactly right. You can't rescind a wedding invitation just because you were counting on the invitee to not show up. You don't send out invites, gambling that the person you invited will not be there.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 105,
                  "content": "After she got an invite and drove 2 hours to make sure kids could go on her time? Nah imma stay that’s a huge waste of gas-especially rn w prices- but agreed that OP should’ve worn something less “look at *me*”- she knew what she was doing wearing such a fancy dress YTA.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Same! I am shocked at the number of people saying that the dress changed their mind.\n\nUhhh, what? \n\nThe bride asked her to leave, and she said \"nope\" like... that is such an asshole move if a bride asks you to leave and you refuse.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 21,
                      "content": "I mean normally inviting someone and then asking them to leave WITHOUT REASON when they get there would be worse.\n\nBut I think them showing up amounts to a high end costume, given the circumstances, is a valid reason.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "Yeah I mean she was definitely reeking of entitlement but I wasn’t sure until I was *sure*",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Yeah and the moment the literal bride asks you to leave, you go and leave",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Yeah…I mean, also, it’s not a good sign that the ex didn’t mention to the bride that he’d invited the ex-wife. That’s not something that should be sprung on the bride the day of. Not the ex-wife’s fault, but it’s in really poor taste to wear a red wedding dress in these circumstances. YTA",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 896,
              "content": "Changed my mind completely when I saw the dress. YTA",
              "id": 43,
              "comments": [
                {
                  "score": 258,
                  "content": "Right!!! Jesus … now I can see why the bride is upset. OP just ruined a relationship with her kids stepmom that according to OP was a good one.",
                  "id": 44,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 53,
                  "content": "So did I. I assumed a nice cocktail dress not an actual wedding gown",
                  "id": 45,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Here I was thinking JC Penny and OP up in here David’s bridal!",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Even if the dress was appropriate if the bride asks you to leave, you leave and deal with bride being an asshole later.  \n\nOnce someone asks you to leave their event even if they are wrong, you still need to leave.  You're no longer welcome.  \n\nYou have to co-parent with her husband for years after this.  Being asked to leave in an appropriate dress would have been rude of the bride but you don't crawl in the mud with the pigs and then point out how dirty the pigs are.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I was about to say:\n\n - Was the dress white? If yes, YTA. Else NTA. Although red is definitely questionable….. \n\nBut I just assumed the dress was NOT A BRIDAL DRESS 🤣🤣🤣 \n\nTurns out it was a bright red bridal dress jeeeeze.\n\nOp wtf. Who shows up as a guest to a wedding in a bridal gown!!!",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I mean if the bride asks an EX of the groom to leave her wedding, and the ex says \"nope, I'm staying\". That ex is an asshole, the bride can 100% revoke that invitation\n\nI figured the dress would be egregious in some way, but even if it wasn't, OP is YTA",
              "id": 49,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "😆😆🤣 I did a good belly laugh when I saw that pic! Like there is literally a bride in the dress in the ad!!",
              "id": 50,
              "comments": [
                {
                  "score": 6,
                  "content": "Ya like uh what?! How do you look at that and in good consious think “huh this would be a perfect dress for my ex husbands wedding” 🥴",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "She’s set up a new throwaway due to being trolled so bad lolllllll",
              "id": 52,
              "comments": [
                {
                  "score": 7,
                  "content": "Of course she did I don’t think she actually wants to be told she’s TA.",
                  "id": 53,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1587,
          "content": "That's the problem with this sub, you only get one heavily biased side. It's very easy to portray a situation where you're a Saint and the other is an AH when really it's the other way round.\n\nOr you can post a situation, same exact situation and details, but you'll be the AH depending on if you're the man or the woman.\n\nThis sub is fucked but hilarious, I love some of the takes of the bored, embittered, lonely SAHM's",
          "id": 54,
          "comments": [
            {
              "score": 4661,
              "content": "It’s spotting the missing reasons. \n\nIn the post she mentions the bride calling out how she’s dressed but posts no details of her dress. That’s why a lot of people just asked for info, it seems intentionally vague. She’s then drip fed information. Dress was red and lacy; but was it revealing? Was it overly fancy for the setting? Then she posts a screenshot of a dress literally listed as a red wedding dress on Amazon…\n\nIt’s like posting;\n\n“Am I the asshole for playing games with a friend while my bf was at work?”\n\nWhat kind of games?\n\n“A card game”\n\nWhich one?\n\n“Strip poker”",
              "id": 55,
              "comments": [
                {
                  "score": 1257,
                  "content": "Yep, this is the key. The dress thing caught my eye too. Why was the bride complaining about the dress exactly? Oh, that's why. YTA. lol",
                  "id": 56,
                  "comments": [
                    {
                      "score": 1020,
                      "content": "The fact she refused to leave when she was asked to by the bride said enough for me.  Doesn’t really matter what she was wearing, she’s the groom’s ex.  ‘I like Stephanie.’  No, I don’t think she does.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 739,
                  "content": "There was one yesterday about a step-dad kicking his step-daughter out of an apartment he owns so his sister, her boyfriend, and his niece can move in after getting evicted.  His info:  She's 22. She didn't pay rent.  She lived in a city about 2 hours away.  She was taking a year off school.  His sister liked to spend \"extravagantly\".\n\nInfo he didn't provide in the post:  His step-daughter was living in his apartment rent free and took a year off college because she was getting medical treatment for a serious illness.  \n\nRead closely and ask questions if something seems ishy.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 491,
                      "content": "There was one a little while ago where a woman asked if she was TA for not cancelling her vacation with friends. Her boyfriend had suddenly cancelled his trip with them, and he had asked her to cancel too and stay back with him, and had gotten upset when she said no and went to party with her friends.\n\nThen someone asked why he had cancelled. He had just been diagnosed with a serious form of cancer and was setting up chemotherapy treatments. He wanted his long term girlfriend with him for emotional support.",
                      "id": 59,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "The funny thing is he was already clearly the asshole even WITHOUT the serious illness part of that story.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Oh his step daughter was sick? I didn't see that. He is a much bigger ass than I thought! That's horrible!",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Although in the case with the stepdad I thought he is the AH anyway. Didn't matter to me that she paid no rent. He offered her the flat and they had an agreement. If he wouldn't have been ok with her not paying rent then he shouldn't have given her that flat, full stop. So, that these were the reasons just made a bigger AH of him in my eyes.",
                      "id": 62,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "perfect explanation 😂",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Excellent example!",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 166,
              "content": "Given the number of my YTA results, don't think it's as easy as you think.\n\nShe was pretty good at it here though!",
              "id": 65,
              "comments": [
                {
                  "score": 16,
                  "content": "She would have gotten away with a N T A verdict easy, but I’m convinced she really thought she was in the right and that posting her red wedding gown would garner support lol",
                  "id": 66,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "The SAHMs are usually not too bad. It's the teenagers with zero life experience but certainty everyone should go NC for the smallest thing you have to watch.",
              "id": 67,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Oh but it’s so delicious and part of the fun to read between the lines. Or when another commenter drops a “this you?” And points to older posts where the OP has a ton of red flags. When it’s suuuper straight forward, it’s not even any fun. Something like “am I the asshole for being sad that my mom died and my boyfriend wanted me to go to a rave with him the night before the funeral?” It’s not really good fodder for this sub. But when there’s more subtle clues that the OP is the asshole, those are the best. This post itself isn’t even that subtle.\n\nThe very best of this sub is when the other party finds the post and gives their side.",
              "id": 68,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1333,
          "content": "OP is being incredibly disingenuous in this post and is most definitely victim baiting. What they failed to mention in the post is that they went to the wedding in an entire bridal gown, not just a “cute red dress”. I don’t care who you are, going to a wedding in a bridal gown warrants your invite getting revoked. This post is giving narcissism and main character syndrome. YTA op\n\nEdit: it’s also hilarious that OP has now deleted the comment where they initially linked the dress. Clearly they know they were in the wrong and are backtracking\n\nFinal edit: OP is a piece of work, previously posted to r/trueoffmychest talking about how she was thrilled that she upstaged her ex’s wife and she is crying herself to sleep. She deleted everything prior to posting here to try to deceive everyone. And she has now deleted her account, what a colossal loser\n\nhttps://imgur.com/a/TF9tUyN\n\nI screenshot OP’s deleted comment about purposefully upstaging the wife",
          "id": 69,
          "comments": [
            {
              "score": 281,
              "content": "I've read too somewhere that if you wear red to the wedding you slept with the groom. She knew exactly what she was doing. What an AH",
              "id": 70,
              "comments": [
                {
                  "score": 210,
                  "content": "This isn't really a thing. And in many cultures (and it's becoming more mainstream with Americans), wearing red to a wedding is seen as you wishing the couple luck and prosperity.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 85,
                      "content": "Exactly, I once did a deep dive and could only find references to the red thing on wedding/bride/Reddit forums and discussion. All were people either asking if or was true or people just spreading this “rule.” \n\nMoreover, literally billions of women get married in red (China, India etc), many more than get married in white. I’ve only ever seen and heard the whole red means they slept with the groom, and generally tacky to wear red, in America. In India it’s not just the bride but many of the female guests too. My first wedding was in a dress made from a red sari. \n\n\n(I know Reddit is America heavy but not only is it world wide, America itself is a melting pot with significant numbers of women whose cultures are red dress affairs. I always find it curious when declarations are made about how things are done - without any obvious awareness the rest of the world exists.)\n\nETA I still think OP is an AH though because she wore a dress sold as a wedding dress, it was not a guest outfit imo. Plus the bride asked her to leave - that should have been enough in and of itself. She clearly didn’t care what the bride wanted so why stay at for a wedding when you can’t wish the bride well enough to respect her wishes at her own wedding. YTA OP.",
                      "id": 72,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 21,
                      "content": "My bridesmaid wore a red dress, it fitted in with our colour scheme. She definitely didn’t want to shag my husband lol! I’ve never heard of red bring a no-no colour but it seems American wedding customs are different from those in the UK.",
                      "id": 73,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": " Well, the groom is her ex and they have 3 kids, so she obviously did sleep with him.",
                  "id": 74,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "I think this is just an extension of red being for 'scarlet women'",
                  "id": 75,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "I mean... They have 3 children together... Pretty sure it hasn't escaped anyone's notice that she previously fucked the groom. 🤷",
                  "id": 76,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "I’m from hungary and here the rule is no white, black (funeral color) or red on wedding. Reason is that the bride changes to red dress at midnight/for the party.",
                  "id": 77,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "That’s not a thing except for two people on the internet",
                  "id": 78,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "This needs to get all the upvotes. As they say, what you do in the dark will eventually come to light. Shame OP!\n\nAs an aside, my mom wore red to my brother’s “black and white wedding.” My parents had just finalized their very bitter divorce 2 months prior. Strapless silk mermaid gown, blood red. You can imagine how that stood out in a sea of black and white. She knew exactly what she was doing at the time. I’m getting married 11 years later. The topic came up about her dress/what she should wear and I said “NOT RED.” She feigned dumb and got upset that no one told her the dress was a problem until a decade later. Stop. Just stop. You know…",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "YTA.....and its poor form to wear red anyway! It's a colour that stands out in photos and it's difficult to mute, definitely a look at me colour regardless of the style of dress. Poor etiquette. And the dress pictured... come on OP we all know what you were doing.",
              "id": 80,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "It's no wonder OP's ex doesn't want her in his life. She is so tacky and toxic. Yuck!",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1103,
          "content": "Oh Jesus Christ. You showed up in THIS! Then didn’t leave when asked? And how is it that she was unaware you were actually coming? Did you RSVP? INFO.",
          "id": 82,
          "comments": [
            {
              "score": 513,
              "content": "Right!? Can you imagine showing up in a WEDDING DRESS to your EX’s wedding and then when the bride asks you to leave HER wedding she refuses!!!! I was the bride I would have refused to proceed with anything until OP left. How utterly disrespectful. Also the fact that OP came to this subreddit to try and make themselves feel better about the situation? I just can’t",
              "id": 83,
              "comments": [
                {
                  "score": 307,
                  "content": "Yep. OP was obviously feeling insecure about her ex getting married and decided to show up looking her-effed-up-version-of-fabulous, hoping everyone would think: he left HER?! \n\nOP, YTA, and you know it. Grow up, and stop trying to ruin things for your ex. Move on with dignity - you’re not Scarlett O’Hara. Classless.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 105,
                      "content": "> hoping everyone would think: he left HER?!\n\nOh, they did, but the full thought was likely more along the lines of, \"**It's no wonder** he left *her*.\"",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "\n\nUpvote just for the Scarlett O'Hara reference.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "\"I'm a Villainess in an Otome Game but I'll Show my Ex That I'm the Main Character\"",
                      "id": 87,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 230,
                  "content": "What OP and others like her don't seem to realise is that no one else at the wedding is thinking how great they look or whether they look better than the bride. \n\nThey just see them as tacky and toxic. They may not say it, but they definitely think it.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Exactly this. The guests would care about the bride far more than OP realises. It's so tacky and immature. I would be so embarrassed if I were her. No wonder he ditched her.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "And then the toxic one says “They’re just jealous”.",
                      "id": 90,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "Yep.\n\nOP - _Everyone_ at the wedding was laughing AT you",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Exactly! This OP is trying so hard and as a guest, I’d be embarrassed for her. Super cringe to show up at an ex’s wedding as a “hottie.”",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I feel she could have added a little red veil tbh",
                  "id": 93,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Or a tiara 🤣🤣🤣",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 493,
              "content": "Doesn't even matter what she was wearing, IMO.  The bride asked her to leave and she \"stood her ground.\"  \n\nYou don't \"stand your ground\" at another woman's wedding.  The bride asks you to leave?  You leave.\n\nYTA",
              "id": 95,
              "comments": [
                {
                  "score": 129,
                  "content": "Yep. This. Even if she was out of line (and it doesn't sound like she was), if you are asked to leave, then leave. Why would you want to stay at that point unless you are a petty asshole? YTA.",
                  "id": 96,
                  "comments": [
                    {
                      "score": 149,
                      "content": "OP says she \"likes\" Stephanie, but I'm calling BS.  If a woman I only tolerated neutrally was distressed by my presence at her wedding, I would apologize and take myself to a restaurant and movie instead.\n\nI cannot fathom the petty vindictiveness that would make me STAY where I wasn't wanted.",
                      "id": 97,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "Lol OP said the \"groom wanted\" her there. She's ridiculous.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "you don't stand your ground anywhere but your own property/event. For any reason anyone can always tell you to fuck off at their own property or event. They told you to leave, you can't stand your ground and stay you just refuse to leave like an asshole. \n\nSure if you're trying to prevent a crime or some shit there are other scenarios but for a basic party that isn't your own and you're told to leave, leave.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "Even before I saw the dress I thought she was the asshole. Of course the bride was bad too for issuing an invite she didn't want her to accept, but once you're asked to leave a wedding by the bride you should leave!",
              "id": 100,
              "comments": [
                {
                  "score": 6,
                  "content": "I’m wondering what the groom thought lol.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 484,
          "content": "ITS A WEDDING DRESS!!",
          "id": 102,
          "comments": [
            {
              "score": 8,
              "content": "Or attire for a Met Gala event or the Presidential Inauguration Ball.  Totally Upstaged the bride.",
              "id": 103,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 387,
          "content": "THIS! So glad you put this in as the OP left that out of her edit. The dress is literally a wedding dress in the colour red, I would be angry at anyone who showed up in a wedding dress no matter the colour, let alone your fiancés ex. Regardless of if she wants him back or not she was going to stand out at the wedding and would attract attention, now her ex is left arguing with his new bride who’s had one of the most important days of her life ruined.",
          "id": 104,
          "comments": [
            {
              "score": 92,
              "content": "Totally agree. I have been to far too many formal weddings for both people I like and people who I don’t like (but had an obligation). Things I would never have done at any of the weddings: red, lace, strapless, a mermaid cut. Well done on being TA.\n\nJust to add - I would also have left after a bride asked me to leave regardless of their reasoning.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Would it though? I mean, sure, it's rude as f*** but would any guest see anything else but a sad, divorced mom of three who wore a bridal gown to her exes wedding?\n\nLike, I got married 7 months pregnant so most guests were prettier than me tbh. If my sons baby momma would have shown up in a cheap red mermaid dress like that I would have laughed my ass off.",
              "id": 106,
              "comments": [
                {
                  "score": 10,
                  "content": "In a dress like that I’d have assumed the wearer was the made of honour or someone important to the couple for how extravagant it was, once someone asks who she is I think it would be a bit of a talking point amongst guests the further the day went on, especially when details start getting added on, it’s pretty hard not to hear or notice the grooms ex wearing the red wedding dress, who argued with the bride and refused to leave the wedding. That’s a lot of attention and gossip to deal with when you’re spending 3+ hours getting pictures with everyone, especially those relatives on the brides side who first ask “who’s the lovely lady in red over there”\n\nMaybe it’s just me 🤷🏻‍♀️ Also, pregnant brides still slay, my mum did hers 7 months pregnant in capped sleeves and a big old Cinderella skirt but she was glowing 👏🏻😂",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I also got married when I was pregnant, 6 months. I totally get where you are going and agree she would look pathetic. However, I also get why the bride would feel that way. This dress is way over the top and OP was an AH for staying after being asked to leave. In the heat of the moment, I am sure the bride felt a little insecure. It would be a little jarring right at first to see the ex standing in that dress at the wedding. After things calmed down, the smell of pathetic that OP has coming from her would waft through the wedding and it would be funny and OP would look like a fool. \n\nOP - YTA",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 327,
          "content": "[deleted]",
          "id": 109,
          "comments": [
            {
              "score": 95,
              "content": "I agree with this take. I don't care what color or silhouette but if you show up at another woman's wedding wearing a dress with a train you are an asshole. And she isn't just any woman. She's the groom's EX.",
              "id": 110,
              "comments": [
                {
                  "score": 8,
                  "content": "My BFF had a formal wedding. As a short, fat, and broke grad student, my options were limited. The one gown I found that fit at Rent the Runway was a black lace over tan gown in a shape not unlike his bride-to-be's gown. It was less ornate, but still. I had the RTR shop assistant take a picture with my phone and immediately texted both BFF and fiancee. It was either this gown or a less formal dress.  They gave the greenlight and fiancee said she'd be mad if I didn't wear it cause I looked fabulous. \n\nI would *never* have worn that gown without their express permission. When her bridesmaids saw me before the wedding, I got a couple of stink eyes until the bride squealed in happiness that I'd worn it. Some of them were friends from college I didn't know, so all they saw was groom's female friend in a fancy black gown. I wasn't mad about the stink-eye.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Sounds like the bride loves you very much! Props to her for choosing you over optics.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Honestly even cut off at the knee, wearing a slinky red dress to your ex's wedding is just... not ok.",
              "id": 113,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 277,
          "content": "She even [admits](https://www.reddit.com/r/undefined/comments/1054eq8/comment/j38t2ba/?utm_source=share&utm_medium=web2x&context=3) her attendance was for her own closure... yikes.",
          "id": 114,
          "comments": [
            {
              "score": 78,
              "content": "I mean....her un is closureseekingex",
              "id": 115,
              "comments": [
                {
                  "score": 5,
                  "content": "Definitely a made up post.",
                  "id": 116,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "How on god’s green earth do you get closure from attending an ex’s wedding-",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 205,
          "content": "Right!  Girl, stop pretending you did nothing wrong and blaming it on her insecurities....",
          "id": 118,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 177,
          "content": "BRUH IT SAYS WEDDING DRESS\nYTA",
          "id": 119,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14637,
      "content": "Can you show us the dress??\n\nAfter seeing the dress, YTA. That dress is too much for a guest at a wedding. Way too bright and unless this was a super elegant wedding, too much. I doubt too elegant as you said barely any dress code was given besides no white.",
      "id": 120,
      "comments": [
        {
          "score": 4913,
          "content": "She literally wore a wedding dress.",
          "id": 121,
          "comments": [
            {
              "score": 1702,
              "content": "Yeah, if was inappropriate. From her comments, I have a feeling she doesn’t get along with Stephanie as she claims",
              "id": 122,
              "comments": [
                {
                  "score": 562,
                  "content": "The correct title would be: “AITA for showing up at my ex’s wedding in a wedding dress”\n\nWho, apart from the actual bride, goes and buys a dress for a wedding that has the term “wedding dress” in the name. \n\nVery manipulative of OP to just call it a pretty dress when she knew full well what she was doing. \n\nWhether she wanted her ex back or not, what she did want was attention.\n\nWell OP - YTA and you know it too or you would have made this post with the correct title.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Of course it said wedding dress in the title! It’s a dress to wear to weddings! /s",
                      "id": 124,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "https://www.reddit.com/r/TrueOffMyChest/comments/105s1ki/my_wedding_was_ruined_by_a_jealous_ex_and_she/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
                  "id": 125,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 577,
              "content": "I don’t understand how some people can do this and not feel embarrassed. Like, my literal nightmare is showing up to an event and having everyone stare and talk about me based on what I’m wearing. ESPECIALLY if what I’m wearing is obviously considered inappropriate. I can’t imagine anyone said anything positive about what she wore… except maybe a few random horny dudes. Score.",
              "id": 126,
              "comments": [
                {
                  "score": 276,
                  "content": "I once (in my mid-20s) attended my new-ish boyfriend's sister's wedding, who I'd met a few times, and wore a chocolate-brown cocktail dress with an asymmetrical hem. Thought it was a safe choice.\n\nBridesmaids come walking down the aisle...wearing chocolate brown cocktail length dresses in a different fabric. I died. Fall through the floor moment. I was horrified people might think I was trying to be part of the wedding party without being asked. I hadn't been to many weddings and didn't know to even think about it.\n\nLesson: ALWAYS ask casually what the wedding colours are and avoid like the plague.",
                  "id": 127,
                  "comments": [
                    {
                      "score": 79,
                      "content": "Ugh I’ve done the same thing and I was mortified when I saw the bridesmaids. I was so annoyed with my now ex because I’d asked what colour the theme was (bride was his friend) and he’d told me a completely different colour without even asking her as it turned out.",
                      "id": 128,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 44,
                      "content": "My husband was best man in a wedding recently. I asked him ahead of time what color the bridesmaids were wearing so I wouldn’t match. He apparently asked and was told it didn’t matter, and all colors were good. I showed up wearing a dress almost the exact same color as the bridesmaids, and my dress was fairly similar to some of theirs (since it was a laid back country wedding). It didn’t end up being an issue at all, but I felt so awkward about it.",
                      "id": 129,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 35,
                      "content": "Ha, thanks for the reminder to ask my ex/coparent what his wedding colours are! \n\n(I am invited and going, we are genuinely all friends, but have already discreetly checked with the bride that she's **really** ok with me there... Definitely do not want to rock up in a wedding party colour!)",
                      "id": 130,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "The last 2 weddings went to I wore something totally similar to the bridesmaids.  The first was a formal wedding and I wore a long eggplant colored dress... bridesmaids... floor lenght purple dress.  The last wedding was a beach wedding, I wore a teal, boat neck, knee lenght dress, bridesmaids wore a tea lenght, cowl neck version.  I was totally embarrassed both times.  Thought I was totally safe, invites were both either plain white or black and white.",
                      "id": 131,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "One time my husband and I were invited to a wedding, I had a purple dress and he had a purple shirt, so I suggested we both wear them to match, like geeks lol. I thought it would be fun.\n\nYeah, the bridesmaids were wearing a similar shade of purple. Thankfully the groomsmen were in blue but gosh it was uncomfortable lol.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Narcissists love the attention and they never think they are in the wrong.  The only reason op has posted this is to try and get people on her side. We are not on her side so she most likely thinks we are all dumb or something.  This is most likely why she hasn't replied to anything.",
                  "id": 133,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 557,
          "content": "Omgosh, how can OP *not* think they’re an AH for wearing this and then NOT LEAVE when asked by the bride?! I don’t care if you’re wearing a potato sack or a Gucci gown, if you’re asked by the person or people getting married to leave - YOU LEAVE. Not doing so means YTA. Wearing that nightmare of a “party dress” which is labeled as a **wedding gown** means you’re ~~double~~ triple the asshole! I hope when you get remarried she shows up in a black lacey slip dress.",
          "id": 134,
          "comments": [
            {
              "score": 217,
              "content": "> if you’re asked by the person or people getting married to leave - YOU LEAVE. Not doing so means YTA\n\nI would have disagreed on the grounds that she *was* invited. It's stupid to extend invitations, then say \"oh, I never expected you to *actually* show up!\" \n\nBut the dress itself definitely makes OP the asshole here.",
              "id": 135,
              "comments": [
                {
                  "score": 96,
                  "content": "Also it sounds like she was in charge of bringing the groom's kids so of course she's gonna come. But yeah... The dress is fucked up.",
                  "id": 136,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Yea. The dress is absolutely inappropriate but I also couldn't imagine being so uncouth as to tell her to leave after agreeing to let the kids attend on her custody time and driving them two hours each way to be there. Hell, even if she hadn't been invited or declined the invite before I'd probably make another offer for her to stay.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Why would you want to stay at a wedding where the bride doesn't want you? What is the point? Just leave.",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I mean, if she didn't RSVP then yeah, I can see how she'd not expect her to show up. So, I'm guessing she didn't RSVP. Wedding dress, garish bright red dress, refused to leave, showed up w/o RSVPing. 4x YTA",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "At this point I don't have any reason to believe stephanie actually said the part about her showing up or it is at least being twisted, but idk. I also would suspect the argument over the dress and leaving didn't have as cordial a tone as we are being told.",
                  "id": 140,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "corollary on that is if she had dressed normally.  If she had dressed appropriately, and then the bride had said she did not expect her to turn up and wanted her to leave, sticking around is acceptable.\n\n\nHowever, as soon as she put on the red wedding dress, that shit is out of order, over the line and little wonder the bride lost it.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "She does post a pic on her profile.",
          "id": 142,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 18,
          "content": "Idec about the dress. If she was asked to leave, she should have left.",
          "id": 143,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13877,
      "content": "You. Wore. A. Wedding. Dress. \n\nI don’t care if it’s red. That is wildly inappropriate. YTA x1000.\n\nETA: Thanks for the award, kind stranger!",
      "id": 144,
      "comments": [
        {
          "score": 2428,
          "content": "Strapless  fitted gown...YTA \nYou were trying to upstage the bride",
          "id": 145,
          "comments": [
            {
              "score": 768,
              "content": "The description of the dress is red wedding dress, not just a strapless fitted gown",
              "id": 146,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 330,
              "content": "Especially true if she feels that she has a \"better\" figure than the bride.\n\nYeah, YTA. SOOOOO much.",
              "id": 147,
              "comments": [
                {
                  "score": 36,
                  "content": "Oh yeh, OP 'likes' Stephanie because she thinks she's hotter than Stephanie.",
                  "id": 148,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 99,
              "content": "With a train.",
              "id": 149,
              "comments": [
                {
                  "score": 54,
                  "content": "This especially. Strapless and fitted is fine and normal for a dress but a train???? Trains are literally only used as part of wedding dresses because they're so inconvenient to be used for literally any other type of dress.",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 931,
          "content": "In the olden days wearing a red dress to a wedding signified that the wearer f-ed the groom.",
          "id": 151,
          "comments": [
            {
              "score": 548,
              "content": "I have no doubt this didn’t escape the OP",
              "id": 152,
              "comments": [
                {
                  "score": 107,
                  "content": "Me neither.",
                  "id": 153,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 38,
                  "content": "I do, this is not a thing except in small parts of the internet",
                  "id": 154,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 93,
              "content": "I just assumed red and black were discouraged at weddings but I wasn't sure at the reasoning, interesting 🤔",
              "id": 155,
              "comments": [
                {
                  "score": 150,
                  "content": "Growing up red always meant the wearer had had sex with the groom or was a \"harlot\". Black meant you disapproved of the marriage and hoped the marriage failed.",
                  "id": 156,
                  "comments": [
                    {
                      "score": 55,
                      "content": "I always thought black was meant for funerals. Which made it even more insulting when someone wore white to a funeral",
                      "id": 157,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "you seem knowledgeable in the ways of dress codes, so i'd like to ask: what's the subtext to wearing a tie-dye shirt and flipflops to a wedding?\n\nasking for dave.",
                      "id": 158,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Oh my gosh I didn't know this! I wore a black dress to a wedding three years ago and it was only because everything I had dress-wise at the time was black. I feel stupid. Time to send my friend an apology on FB 💀",
                      "id": 159,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "What??? Please tell me when you say “olden days” you mean like 1890’s. Cuz if it’s 1990’s I have some apologies to make!",
              "id": 160,
              "comments": [
                {
                  "score": 6,
                  "content": "I don’t know I just heard it a few times. I don’t know how old it is hahahahaha",
                  "id": 161,
                  "comments": [
                    {
                      "score": 5,
                      "content": "It is actually not a thing. It is a Reddit urban legend. https://www.brides.com/wear-red-wedding-6742620",
                      "id": 162,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 47,
              "content": "So THAT'S why people were making comments about my MIL wearing a red dress to my wedding. 🤣🤣🤣\nI wonder how many people misunderstood that.",
              "id": 163,
              "comments": [
                {
                  "score": 12,
                  "content": "😂😂😂 that is so…disturbing…",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Well in fairness she did",
              "id": 165,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Can you provide a source for that as I’ve never heard of this before.",
              "id": 166,
              "comments": [
                {
                  "score": 19,
                  "content": "\nAll the sites online I’ve found that mention it are pretty questionable.  I suspect this is at best a regional, generational thing rather than a mainstream tradition.  Kind of how black at weddings used to be taboo because of the color’s association with funerals but is fairly normal now.  If someone wore a regular red outfit/dress to a wedding I wouldn’t read too much into it, but a red wedding dress does make me think the person wearing it was trying to send a message. Especially if the person wearing it is an ex!",
                  "id": 167,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 128,
          "content": "[deleted]",
          "id": 168,
          "comments": [
            {
              "score": 31,
              "content": "The hell kind of closure does she need🤨🤨",
              "id": 169,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 93,
          "content": "Even if it wasn’t a wedding dress, or red (which I didn’t know means you fucked the groom lol), OP is still the asshole. If the bride wants you to leave, even if it’s for a stupid reason (which this was not stupid) and you don’t leave, YTA. It’s her day. One of the most monumental days of her life. It should be perfect and just as she wants it. Of course bridezillas who go crazy are not ok just because of this reasoning… but being asked to leave isn’t a bridezilla thing. OP seriously sucks.",
          "id": 170,
          "comments": [
            {
              "score": 46,
              "content": "I agree with your point, but telling someone to leave after you invited them and they drove two hours is definitely a bridezilla thing. It's passive aggressive AF to invite someone but assume they'll decline. \n\nThat being said, if I went to an event I didn't pay for and was asked to leave, I would. No point in being somewhere you aren't wanted.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "It’s clearly a revenge dress. You could put that thing in a slideshow with Princess Di and Bella Hadid and it would fit right in. It is WAY too showy to wear to any wedding and ESPECIALLY not to your ex’s wedding where you’re basically a ride for your kids.",
          "id": 172,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "Not only was it a wedding dress. Wearing red to a wedding apparently is another \"unwrittwn rule\" and means you slept with the groom. No need to blast it OP, the children is evidence enough!",
          "id": 173,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5957,
      "content": "So it looks like OP deleted the comment where she posted a link to the dress but you can still see the beginning of the URL link so, because I’m insane and bored, I searched Amazon for “red lacy womens wedding mermaid” dress and this matched the same URL beginning \n\nhttps://www.amazon.com/SIQINZHENG-Womens-Sweetheart-Wedding-Mermaid/dp/B07T9M5S7G/ref=sr_1_2?keywords=Red+lacy+women’s+wedding+mermaid+dress&qid=1673036544&sr=8-2\n\nI’d vote E H Sbecause this is a *bit much* to wear to your Ex’s wedding but she also should have just ignored you once you made it clear you weren’t leaving\n\nEdit - changing to YTA because come on. That’s a wedding dress\n\nETA - because I’m getting A LOT of comments on my initial E H S verdict. My initial reasoning was “ignore her and let her embarrass herself and not give her the attention she wanted” but almost immediately reevaluated and went with Y T A because everyone’s right, it’s a wedding dress and the bride shouldn’t have had to deal with that and OP was being TA",
      "id": 174,
      "comments": [
        {
          "score": 1555,
          "content": "Damn…that’s actually a bridal gown. \n\nYTA OP",
          "id": 175,
          "comments": [
            {
              "score": 10,
              "content": "A 99 dollar wedding dress, who would have thought!!!",
              "id": 176,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 512,
          "content": "LMAO this woman thought she could pull a move like this and NOT be the a hole?? She clearly isnt over her ex",
          "id": 177,
          "comments": [
            {
              "score": 194,
              "content": "She commented somewhere and said she was \"looking for closure\" so you're spot on",
              "id": 178,
              "comments": [
                {
                  "score": 63,
                  "content": "just realized OP’s username is literally closureseekingex 💀",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Jesus what a toxic person",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "This is an absolutely wild way to look for closure",
                  "id": 181,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 380,
          "content": "This was the link: [https://www.reddit.com/user/closureseekingex/comments/1054eq8/the\\_dress\\_was\\_similar\\_to\\_this/](https://www.reddit.com/user/closureseekingex/comments/1054eq8/the_dress_was_similar_to_this/)",
          "id": 182,
          "comments": [
            {
              "score": 22,
              "content": "Thanks! Wasn’t loading for me so I assumed she’d deleted her comment",
              "id": 183,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Lol! That makes Stephanie’s comment that she thought she was just dropping off the kids even more hilarious.",
              "id": 184,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 292,
          "content": "Why should they have ignored OP in her inappropriate gown, though? Like, anyone with any amount of sense would see that dress in any color and know it’s not meant for a wedding unless you’re the bride. \n\nIf she had bought the dress in white and wore it to the wedding, everyone would be 100% on the bride’s side for kicking her out. \n\nJust because you’re initially invited doesn’t mean you can’t be uninvited or kicked out for inappropriate behavior; and if the hosts request you to leave for said inappropriate behavior, you can’t just get around that by refusing.\n\nETA: thank you for posting the link, though! I can see why OP would delete her original comment.",
          "id": 185,
          "comments": [
            {
              "score": 23,
              "content": "That’s why I changed my verdict! I originally thought something along the lines of “she should have just ignored you and let you embarrass yourself” but then basically had a follow up thought on exactly what you said",
              "id": 186,
              "comments": [
                {
                  "score": 15,
                  "content": "In fairness, you’re probably right in that most of the guests were side-eyeing her as a tacky attention grabber. Lol.",
                  "id": 187,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 125,
          "content": "I did the same. Big old nope for a wedding...especially for an ex.",
          "id": 188,
          "comments": [
            {
              "score": 77,
              "content": "Yeah it’s a literal wedding dress in the other pictures",
              "id": 189,
              "comments": [
                {
                  "score": 14,
                  "content": "it really does look intentionally provocative. And am I in the only universe where coffee shops exist? She really should have left and just come back for the kids.",
                  "id": 190,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "Imagining someone driving for 2 hours in this just seems unhinged lol",
          "id": 191,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "No one should have to ignore thier partners ex showing up dressed In a bright red wedding dress to the wedding and \"making it clear they're not leaving\".",
          "id": 192,
          "comments": [
            {
              "score": 5,
              "content": "Yeah that’s why I changed my verdict. Meant more like “ignore her and let her embarrass herself” but yeah, she’s just an asshole",
              "id": 193,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Hahaha I love that she’s just trying to modify everything so she can get the final result she wants 🤣🤣.",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Hahaha, oh shit.  I clicked that link and it told me I bought it in 2019...for my wedding!  I returned it since it wasn't quite what I wanted, but yeah, that's a fucking wedding dress.",
          "id": 195,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "I mean you don’t type in wedding dress on Amazon when you are tying to find a dress to wear to a wedding as a guest?? LOLLL\n\nYTA",
          "id": 196,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3494,
      "content": "~~You were invited and had thought you were on amicable terms with your ex and his fiancée, assuming that your dress was appropriate for a wedding guest.~~ \n\n~~Obviously there was some miscommunication between your ex and his fiancée regarding the invitation; a 4 hour round trip just for you to drop off the kids to see their father getting married seems to be a bit much to put upon you~~\n\nEdit: saw the dress posted, changing this to YTA. That dress was entirely inappropriate to wear as a guest to someone's wedding and the bride was right to call you out on it.",
      "id": 197,
      "comments": [
        {
          "score": 460,
          "content": "She wore a wedding dress.",
          "id": 198,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 200,
          "content": "She wore a wedding dress",
          "id": 199,
          "comments": [
            {
              "score": 131,
              "content": "I didn't see the picture of the dress until after my comment. I agree now that the dress was inappropriate for her to wear to someone else's wedding.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 50,
          "content": "She wore a wedding dress",
          "id": 201,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 34,
          "content": "Also there is 0 information if the husband ever asked her to switch weekends so the marrying couple could have the kids, so she wouldn't have to drive them over for the wedding.\n\nLike what if she was only invited because she had the kids that weekend and didn't want to switch... and then pulled this dress nonsense.\n\nOP is just leaving so much out to be seen as a victim, when she seems pretty malicious",
          "id": 202,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "She wore a wedding dress.",
          "id": 203,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "She wore a wedding dress.",
          "id": 204,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2909,
      "content": "I'm intrigued why requests to see a comparable dress are being ignored by OP.",
      "id": 205,
      "comments": [
        {
          "score": 944,
          "content": "I checked her comments and she posted something but it instantly vanished",
          "id": 206,
          "comments": [
            {
              "score": 599,
              "content": "I looked at it, it seems like she searched amazon for red lacy mermaid sweetheart dress. \nIf you type that in  it gives a pretty good idea of the dress. I am leaning toward it being too much for an ex's wedding.",
              "id": 207,
              "comments": [
                {
                  "score": 985,
                  "content": "Lol it’s a wedding dress.  It comes in red, but holy shit I’d be pissed too.\n\nhttps://www.amazon.com/SIQINZHENG-Womens-Sweetheart-Wedding-Mermaid/dp/B07FR31MHV",
                  "id": 208,
                  "comments": [
                    {
                      "score": 431,
                      "content": "Oh damn. \n\nYTA OP. That’s a wedding dress",
                      "id": 209,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 154,
                      "content": "Yeah the dress made me change my vote to AH.",
                      "id": 210,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 143,
                      "content": "Oh crap.  That even says “bridal”. Im gonna be changing my vote to yta lol",
                      "id": 211,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 68,
                      "content": "There’s a lady that submitted her photo in the review section literally wearing a veil talking about how it’s perfect for her wedding (the red, not the white) \nThis was very intentional and she tried to mislead us all so she could show them everyone agrees.)",
                      "id": 212,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 34,
                      "content": "The first video review is literally a bride practicing her aisle walk in that red dress and a veil. She looks good in it too! Very bridal!",
                      "id": 213,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Jesus….over the top!!",
                      "id": 214,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "Yeah, I commented on a comment of hers and said it even had wedding in the title of the dress. That’s the first sign she was wrong",
                  "id": 215,
                  "comments": [
                    {
                      "score": 20,
                      "content": "It had to have been intentional.",
                      "id": 216,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 181,
              "content": "She also made a different post titled \"I upstaged the bride and I don't care\", I mean, come on. Of course this was deliberate.",
              "id": 217,
              "comments": [
                {
                  "score": 62,
                  "content": "She seems like a narcissist. A manipulative one at that the way she posted here, what she did to the bride. i feel so sad for the bride that she has to deal with OP for the rest of her life. I wouldn’t blame the bride if she left the husband. I would if i were her. and i feel like that’s the ultimate goal of OP. Hung-up narcissistic ex.",
                  "id": 218,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "No way!! Is there a link?!?!",
                  "id": 219,
                  "comments": [
                    {
                      "score": 57,
                      "content": "Also, super crazy she literally copy and pasted this from r/trueoffmychest and instead of \n> I thought that was the end of it\n\nShe ends with\n> It was satisfying. \n\nhttps://imgur.io/rsH8tRb\nScreenshot of the post on the now deleted account.",
                      "id": 220,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Oh yeah, she posted on a few other Reddit sites and what she posted suggested that she did this deliberately.\n\nhttps://www.reddit.com/user/closureseekingex2",
              "id": 221,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 65,
          "content": "This is why I didn't even need to see the dress to know OP was the AH. If you're asking if you're the AH for wearing \"a pretty dress\" and not providing info about said dress, you already know the answer you're getting.\n\nIt's a YTA post because she wanted validation and should've known nobody would give that to her if she didn't provide the most important piece of information.",
          "id": 222,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 49,
          "content": "Look on her profile, she posted a pic.",
          "id": 223,
          "comments": [
            {
              "score": 7,
              "content": "Thank you :)",
              "id": 224,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 36,
          "content": "https://www.reddit.com/user/closureseekingex/comments/1054eq8/the_dress_was_similar_to_this/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
          "id": 225,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 20,
          "content": "She's ignoring the requests because she wore a wedding dress!",
          "id": 226,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "Also, super crazy she literally copy and pasted this from r/trueoffmychest and instead of \n> I thought that was the end of it\n\nShe ends with\n> It was satisfying. \n\nhttps://imgur.io/rsH8tRb\nScreenshot of the post on the now deleted account.",
          "id": 227,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "it’s a straight up beautiful wedding dress",
          "id": 228,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Because it makes her look bad once you see the dress she wore.",
          "id": 229,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1639,
      "content": "Question did you send in a RSVP card saying you will attend?\n\n\nYour post is very vague in this regard",
      "id": 230,
      "comments": [
        {
          "score": 420,
          "content": "OP responded that they did RSVP before the deadline",
          "id": 231,
          "comments": [
            {
              "score": 323,
              "content": "I have to wonder if her ex sent the invitation and didn't tell the bride.",
              "id": 232,
              "comments": [
                {
                  "score": 297,
                  "content": "The bride saying that she \"didn't expect OP to actually accept the invitation\" implies that she knew about it the invite, went along with it without argument or communication, and is now mad that OP isnt a mind reader.\n\nETA.. that particular dress does make you an AH tho OP. Yikes.",
                  "id": 233,
                  "comments": [
                    {
                      "score": 216,
                      "content": "I don’t think it’s the fact OP isn’t a mind reader, I think she was probably fine with her being there until she saw her turn up in a wedding dress. Red or not, it was a wedding dress. If she’d worn something appropriate or even the tiniest bit more low-key, I don’t think bride would have had an issue with her staying.",
                      "id": 234,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Did they mention they'd be showing up in a tacky, fire engine red wedding gown?",
              "id": 235,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 26,
          "content": "Doesn't matter someone found the dress, it is literally called a wedding dress on Amazon",
          "id": 236,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "What she wore and whether she RSVPd is almost irrelevant.  If the bride at a wedding asks you to leave, you should probably leave.",
          "id": 237,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1385,
      "content": "EDIT: I just saw the picture of the dress. Hahahahaha, there’s no way you didn’t know that would be too much for a wedding guest, especially an ex. Are you kidding me? I was giving you the benefit of the doubt, but now that I just saw a picture of the dress… YTA. You absolutely knew what you were doing, stop trying to pretend like you didn’t.   \n———\n\nNTA. Personally, I think you should have left. But, I don’t think you’re TA for wearing a pretty dress and not leaving. Reason being: Stephanie had two chances before her wedding day to address this. First, she could have made sure you were not sent an invite. Second, she could have rescinded the invite once you RSVP’d “yes.” It’s her own fault for waiting until you showed up to deal with this. She ruined her own wedding day.",
      "id": 238,
      "comments": [
        {
          "score": 233,
          "content": "Look at what she wore…it was a wedding gown, red, but a gown.",
          "id": 239,
          "comments": [
            {
              "score": 113,
              "content": "A redding gown",
              "id": 240,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "And I’m not sure if many people know the symbolism behind wearing a red dress to a wedding but in this case, as the ex wife, that symbolism does apply to her.",
              "id": 241,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I think Stephanie would probably have been fine if OP was just wearing a nice, normal dress.  Maybe not expected her to actually be there, but been fine with it when she was.  \nWearing what she did, it's just super extra, though.  And, once the bride says please leave, you're an asshole for not leaving, regardless of why she doesn't want you there.",
          "id": 242,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Bro I felt the same! At first I’m like I wouldn’t have gone but why is she so uptight about you being there? Maaaaannnnnnn she fooled us ALLLLL 🤣🤣🤣",
          "id": 243,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 825,
      "content": "You wore a red lace wedding dress. I saw the Amazon link you posted, it's literally a wedding dress just in red. You knew what you were doing. The listing literally says wedding dress. YTA",
      "id": 244,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 696,
      "content": "~~ESH~~ YTA\n\nEdit: Upon seeing the link to the dress gonna go with YTA. Doesn't matter if it was red, that shit is a wedding dress.\n\n\\------------------\n\nBride was a bridezilla and the whole \"I didn't think you would accept thing\" is stupid, but still, once it was clear she didn't want you there you should have left. Easy enough to go to a cafe somewhere are read a book or go see a movie.",
      "id": 245,
      "comments": [
        {
          "score": 126,
          "content": "Agreed. Bride sounds like an AH in this situation, but I can't understand wanting to stand my ground about attending a wedding where one of the people *getting married* (as opposed to just another guest) has flat out told me they don't want me there. Just go elsewhere for a bit and come get the kids after it's done.",
          "id": 246,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "OP wore a wedding dress. Asshole.",
          "id": 247,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}