{
  "post content": "I am a makeup artist for the past 9 years. I charge $500 for bridal makeup, around 250 for bridesmaid etc makeup but for regular party makeup I charge around $150.\n\nSo few weeks ago a lady had booked me for a party makeup on June 25th. She booked at 10am. I went there thinking I'd do a regular party makeup. I had agreed $150 with her.\n\nAs I was there, there were some people coming over. I assume relatives. At some point it slips from a woman about the wedding and I realise the woman I'm doing the makeup on is the bride. I'm doing a bridal makeup charging for simple party makeup.\n\nI was completely pissed how she lied about the occasion but I kept doing my job. After we were finished. She gave me $150 and I notified her we are actually $350 short. She asked what I meant by that and I said that I did a bridal makeup. You're the bride. That's what I charge for bride's. She said we had agreed on a simpla party makeup and that I am basically ripping her off because I worked the same amount of time and used the same products as I'd use in a bridal makeup so the title of the event shouldn't matter. I told her she doesn't get to dictate how I form my prices. She then refused to pay me at all and called me a scammer and told me to get out. Before I left her mom threw $200 on my face and told me to get lost.\n\nI was telling what happened to my friends and they all sided with the bride and said that unless I used more expensive products and I did extra labor then I'm not justified in charging her more and since she requested party makeup I should just charge her that. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 44844,
      "content": "She did not ask for bridal treatment and didn't do a makeup test run. You used the same products you would use on a simple party makeup and attempted to upcharge her $350 for what exactly? Just because she's the bride and you want to squeeze more money out of her? If you used different products or it took way longer then sure I could see the upcharge. But you didn't and it didn't so yes YTA.\n\nEdit: lots of likes. To those saying op did nothing wrong\nOp stated the only difference in the makeup is setting spray. Unless that spray was made by the gods themselves it is not worth the $350 upcharge.\n\nEdit 2: If anyone can justify why you would charge her more for no extras, other than a setting spray, when all she asked for was simple party makeup and didn't demand or ask for more than that, just because she is bride I'll eat my hat. Well my husband's hat cause I don't have any of my own.",
      "id": 2,
      "comments": [
        {
          "score": 18543,
          "content": "I’m still trying to do the mental gymnastics in my head to how OP justifies $500 for “bridal”.\n I had my make up done recently for my wedding and it was a standard $120 per person and everyone, including me, had the same product and amount of time spent On them.\n\nOP is a standard con artist that see’s weddings as a cash cow.",
          "id": 3,
          "comments": [
            {
              "score": 7264,
              "content": "Reddit's using all our posts and data to train AI's, so, I just deleted mine.",
              "id": 4,
              "comments": [
                {
                  "score": 9000,
                  "content": "One of my friends got a bridal package and she had 2 makeup style trials/tests before the real deal on the day of the wedding, she was able to choose her look down to every detail, and was super happy. The result was amazing, she got a very elegant makeup, and down to her every wish. \n\nBut in this case the bride got a simple party makeup, with no tests, no mention of extra products or time. She has to pay more just because she is the bride? Doesn't make sense.\n\nEDIT: OP YTA and a scammer. She didn't ask for \"bridal\" makeup, she asked for party makeup, meaning she did not put extra responsibility/pressure on you.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3934,
                      "content": "I’m currently wedding planning. I figure if we’re doing trials and heaps of communicating to plan my make up for my wedding, sure I’ll pay extra. But this bride didn’t have that so why the extra cost? The word “bride” shouldn’t dictate a cost, the amount of work going into a service should.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 473,
                      "content": "Right? The product or service should dictate the price, not the occasion. \n\nA bride should be free to get party makeup if she doesn’t require the extra time and attention. Someone going on a date with their friends should be able to order “bridal” makeup if that’s what floats their boat. Why is her destination even any of OP’s business?\n\nAnd for $500, I feel like he should hang out throughout the wedding and refresh her make up all evening long… that’s a ridiculous price.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 290,
                      "content": "I know a woman that does bridal makeup, she has like 2 year waiting lists. Charges a fortune but does 2 trials and tries to schedule at least one on like the hen do. Bridal makeup first before adding extra for the party she has planned. \n\nAlso gives little containers of foundation, new full lipstick and a little thing of setting powder and setting spray if the bride wants to touch up at all during the evening",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 257,
                      "content": "I was unsure of this one but you’re totally right. She didn’t ask for anything extensive, only simple makeup.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 160,
                      "content": "My bff did this for her wedding, in addition the artist left an aid behind and they fixed up her makeup between the wedding and the reception. So the extra made sense",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 137,
                      "content": "Yes this. When I got married I got a “test” make up run. It was very labor intensive, probably even more labor intensive than the actual big day because we were trying different styles. The whole package was easily worth $500. \n\nWhat OP did? How long did she even work for? Did she want a lawyer or doctor’s hourly wage?",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I hope the bride talks about her experience and that she leaves bad reviews everywhere.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I did my (try to stay with me here) ex stepdad's wife's makeup and hair for her wedding. I did it free if charge as a gift with 3 test runs on the makeup and 2 on the hair. Did I use extra stuff to make it water proof/sweat proof? Of course! But it was like a couple drops if inglot duraline mixed with her foundation, and spraying setting spray after powdering the foundation and then again once everything was on. At most it took me hour and a half to 2 hours for the makeup and around an hour to do her hair. She was a few shades darker than me so I bought her foundation, concealer, and bronzer, in her tone which all together was around 80? Maybe? So at most I could see charging like 150? Unless OP is doing incredibly detailed eye looks I don't see how they're charging 500 for bridal makeup.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "That makes sense if there were trials with no cost.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1340,
                  "content": "I was getting married at the courthouse but still doing photos so I wanted to look nice. I went to book an in home hair appointment for a blow out. Just a blow out. I said it was for my wedding at the courthouse and the price went from 120 to 350! More than my wedding dress and all the alterations. I asked what they were doing differently to justify this price increase and they said \"extra care and attention.\" More than double to price for a blow out!\n\nPeople like OP are 🙄🙄🙄\n\nYTA.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 604,
                      "content": ">I asked what they were doing differently to justify this price increase and they said \"extra care and attention.\" \n\n“Extra care and attention” that you didn’t want and didn’t ask for. What classy people.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 127,
                      "content": "I hope you told them to pound sand and left, that’s ridiculous!",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 108,
                      "content": "LOL. Now I'm imagining some bride who's getting married at the courthouse picking up a bouquet at the grocery store to pose with, and then the staff somehow finding out about it after the purchase and chasing her down the street demanding a hundred more dollars.",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 30,
                      "content": "It's absurd.  A lot of people who are having small weddings don't want or need the perfection so it's absurd to charge extra.  If there are only going to be 12 people at the wedding then it's less stress than a sweet sixteen party.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "“Extra care and attention” just makes it sound like they were gonna do a mediocre job in the first place 😂 shouldn’t they be putting care and attention in all of their appointments?",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "“Extra care and attention” being an overt admission that if it weren’t a wedding, they would be comparatively careless and inattentive. What a selling point for their business!\n\nI understand if there are specific techniques or styles that are either extremely tedious or finicky and carry higher risk of screwing up and having to redo, and charging more for those styles. I even think it’s perfectly reasonable if you only offer those styles for weddings because you don’t enjoy doing them, and would rather not offer that service to someone willing to blow a lot of money but only wants it for Sunday brunch. Completely fine. But when you charge more for the exact same product just because it’s for a wedding? You’re a con artist, end of.",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "Someone tried to pull that EXACT line on me when I bought a cake and they clicked it was actually for a 21st",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Came here to say this. I did a simple court wedding ( not even a white dress) and just wanted to simple makeup for the day. Anytime I said the word \"wedding\" prices dramatically increased 2X and 3X. When I asked for the difference they couldn't really point it out since all I wanted was simple makeup.\nI'm happy to pay more if you can justify the extra cost.\nI hate people like OP with a vengeance",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "My thing is...so there's no care and attention in regular appointments? People will try for a quick money grab wherever they can.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 758,
                  "content": "20 years ago when I was getting married, I thought the same. Now, after 20 years of seeing how a lot of people get around weddings and the amount of abuse service people cop, I really *really* don't blame vendors for adding to the price as soon as someone says \"wedding\". It's an arsehole tax and stress tax in one, because most people are going to be super fussy about having everything perfect and tempers are often high.\n\n... But in this scenario, the service provider got to the job and only knew it was a wedding because someone spilled the beans. No one was running around screeching, they weren't yelled at repeatedly for not bringing the bride's vision to life and ruining her one perfect day, there were no high-pressure time crunches. The party makeup look was what was requested, everyone was happy with that and chilled. OP made a bad judgement call.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 176,
                      "content": "This is it exactly. People have their perfect vision and can be incredibly demanding down to the last detail for weddings. And that is their right. If folks want perfection, though, it's going to come at a cost for the extra stress on the providers. OP should've recognized that this wasn't that sort of case and moved on.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 105,
                      "content": "It's not fair to assume every bride is a bridezilla to justify increasing the base charges. I was a bride that asked for a natural look, no lashes, no contouring. I had one trial where I liked everything and only stuck to my guns about not wanting lashes. I would have been gobsmacked if I was overcharged because it was assumed I'd be an AH just because I am a bride.\nYTA",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "I've done a few weddings doing favors and table scapes, and holy hell, you have to add an asshole tax. Often if the brides are great, the MOG, MOB, wedding planner, or someone adjacent to planning and decision making are fucking assholes and create 3, 4x the work.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "This. I can't agree with the people saying it's *always* a scam, because like... I've seen how customers behave on a good day, let alone when it's their wedding. If it was within my power I'd totally charge more to put up with that. \n\nBut in this case? Total scam.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "And at the same time, people can be giant entitled a**holes when its not for a wedding - someone can be a clientzilla just for a party that they're really stressing out over. Which is why prices should be based on what it actually takes from the provider and not who the client is and what the context is. \n\nI do wonder if OP was booked to do makeup for just a party and not a wedding, and the client would have tons of demands and be fussy and mean and take up much more of OP's time and demand the most expensive products, if OP would still charge them just $150 \"the party price\" (while charging $500 for simple quick makeup from a quiet and chill bride, just cause \"its a wedding\")",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 600,
                  "content": "Same with funerals. I went to the florist to order flowers and when the employee called the owner for current prices(we didn’t get typical funeral flowers) she asked the employee if it was for a funeral or wedding and he said he didn’t ask. She gave him 2 different prices, the higher price was if it was for a wedding or funeral. Side note, he knew it was a funeral but he refused to charge extra and told her it was a regular party. We picked the flowers up anyway to save on delivery fees because we were on a budget",
                  "id": 31,
                  "comments": [
                    {
                      "score": 984,
                      "content": "Charging extra for a funeral when it's the same flowers is even scumier.",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 99,
                      "content": "Hopefully you won't need this anytime soon, but my family recently discovered Trader Joe's has beautiful flowers at a reasonable price. Of course you can't really custom order anything, but they have a decent selection and in our experience they've been really helpful when we explain the situation. They had beautiful pink and white Gerber daisies for my sisters baby shower a few years ago, and a few months ago we had a funeral for my BIL's brother where they wanted red roses. We called TJs and they said we couldn't custom order them, but when we explained what they were for the guy told us when their next shipment would be, and set them aside for us to pick up first thing in the morning. No extra fees, and they looked better than anything I've seen from a florist shop!",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "My dad went to the shop my mum got all her flowers  from. When he told them they were for her funeral, they refused to charge him! We weren't getting anything fancy, just her favourites, but they could have fleeced us and did the exact opposite.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "And caterers too. Funerals are expensive scams, it’s already a hard time for family as it is.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 342,
                  "content": "I agree. My son got married one week, and we had his reception a week later. \n\nWhen I called to book the hall, the guy asked if they would be getting married that day. I told him no, they were getting married a week prior in another city. \n\nI paid $250 for the hall. If it had been for a wedding the same day, it was $1500. There was absolutely nothing different with the hall. Just the event.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Extra insurance for weddings, possibly",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "We hired our hall to a couple, who said it was for a birthday. About 2 weeks before the date I found out it was a wedding. I asked her why she didn't tell me at the beginning and she said because everybody charges double when they hear the word wedding. I think it's disgraceful. I assured her the cost was the same but the reason I wanted to know was so I'd go that extra mile to make the place look even nicer. It's very sad.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "My best friend got married in a venue where it was double for a wedding. She just said an event and got a better price. No one who owned the place was even there to check in or ask about the event so no one was the wiser.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 294,
                  "content": "The \"wedding tax.\" Pissed us off when we were planning our wedding.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 87,
                      "content": "Yep, it's ridiculous!! Every service, or venue charges 3x the amount for a wedding than for any other event.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I didn't even know the \"wedding tax\" was a thing until I was planning to get married and literally the number 1 piece of advice I got was \"don't tell people it's for a wedding\". Artists, cake designers, rentals, they all gouge the shit out of you when they would charge like half the price for anything else. It's an absolutely disgusting practice when you are not doing anything differently. OP YTA and so is anyone who does this.",
                      "id": 42,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 277,
                  "content": "Eeer, normally I’d disagree.\nBridal make up requires at least one trial, and it’s done in a specific way, to last all day, and night, and look perfect on pictures. \nBut the client asked for party make up. So give her party make up, end of story. If she complains that it wasn’t perfect on pictures, THEN you go “Well, that’s why bridal make up costs more.”\n\nOP is a scammer, straight up.",
                  "id": 43,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 139,
                  "content": "Eh, for makeup, bridal is done differently.  It's usually, keyword being *usually*, done to last for 8-12 hours, be visible on camera, but still look good in person.  Which is a whole lot more difficult a look to do than you'd think, especially with how much makeup is necessary to look good on camera.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 332,
                      "content": "But if OP didn’t do all those extra special bridal touches then the customer should just be charged the party price regardless of the venue",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 117,
                  "content": "Often the hike is to offset zilla behavior. \n\n \"the color is not *quite* right and want me to change all coasters? Can do!\"\n\nLooks like that was not an issue until she made it one",
                  "id": 46,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Most industries have a bridezilla clause in their contract though, allowing limitations to changes / phone calls etc and surcharges relating to these but shouldn’t change the base price.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "Only thing I'd like to say about this is that while many people tell you not to let it slip the services are for a wedding, please don't keep that from your photographer or video person. The difference between family photos and wedding photos is vast. If I'm shooting a wedding I block off days after and I'm there from the beginning to the end. I've heard of people trying to tell a photo or video person it's a get together but you're really not getting everything you need with that. We should be in contact with you before the wedding, checking in to make sure your needs haven't changed, and there's so much to it.",
                  "id": 48,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 454,
              "content": "[deleted]",
              "id": 49,
              "comments": [
                {
                  "score": 378,
                  "content": "Not all wedding up-charges are entirely pointless. Weddings are once in a lifetime events so vendors often do spend more time and more quality products to ensure the results are perfect. I know makeup artists that use different products for bridal versus simple party makeup to ensure that close up photos are flawless and last through sweating, eating, drinking, etc. Examples include airbrush foundation, long-lasting lip color, and higher quality lashes. Photography for a wedding is much higher stakes than for a family reunion. That said, OP was the total A here. She did what the customer asked for, and then tried to upcharge for no discernible reason.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 290,
                      "content": "Yeah this. When my sister was wedding planning she called a make up artist who charged more for wedding make up…but actually outlined all the things she did differently to make sure it stayed flawless all day. She also made it clear that if my sister just wanted the basics, she’d do that too for a lower rate.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 146,
                      "content": "At the end, OP said that she told her friends that she did a bridal make-up on the customer, so I don't understand what she actually did tbh, lmao.\n\nShe was the asshole nonetheless. Either for agreeing to give the customer a cheaper service and then giving her the more expensive one without announcing her, or for giving her a cheaper service and upcharging her only for the occasion.",
                      "id": 52,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 60,
                      "content": "Then the customer should be able to choose, right?",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 48,
                      "content": "[deleted]",
                      "id": 54,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 25,
                      "content": "I just got airbrushing done and lashes as a bridesmaid recently. In all, it cost me $90.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 168,
                  "content": "This happened with my cake. It was small so i just wanted a simple 2 tier cake, not a lot of design that would take hours or anything. When I waslooking under \"wedding cake\" it was $400. However a \"special occasion\" cake was $120. Guess which one i chose? There was no real difference between the two either!",
                  "id": 56,
                  "comments": [
                    {
                      "score": 36,
                      "content": "I'm a baker and I do generally charge more for wedding cakes, but, for me at least, it's because I make them differently. \n\nWhen I quote a wedding price I'm including a tasting as well as delivery and assembly on site (tiered cakes can travel assembled but there's a higher chance for something to go wrong like that so for weddings I always assemble and finish at the reception building). I also use wood as the base of the cake board instead of cardboard and will physically sketch out the design of the cake to show the couple before I start working on it so they can make adjustments if we're not on the same page.\n\nFor the cake itself, wedding cakes get best of the best fancy pants ingredients. Vanilla beans instead of extract, European butter, super high quality chocolate, local fresh fruit, etc. And everything gets extra care: cakes are leveled with a ruler instead of by eye, all of the fillings are measured out so they're *exactly* the same between layers, I'll literally use a level to make sure each tier is perfectly flat, things like that. \n\nAll that being said though, I explain all of this to the customers first and if they don't want all that stuff I'm fine charging the party price! Or if they want things like the tasting and assembly on site but don't need the wood board or fancy ingredients or want the cake to look rustic I can do somewhere in between. \n\nPeople like OP make it much more difficult sometimes because people will come in asking for a \"party cake\" but still expect the wedding experience because they've seen people get ripped off.\n\nETA: this is nothing against what you did btw, just wanted to put an explanation out there as to why wedding cakes might be more, if you're working with an honest baker at least",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "When the cake arrived and they saw it was for a wedding did they tack on an extra $180?",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "This! You are only worth a higher price if you are doing higher quality of work.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 321,
              "content": "Happens all the time. Friends wanted a simple venue with buffet, no special treatment, so they didn’t tell the external caterer that it was a wedding. The caterer assumed it was a grandparent birthday or something as the venue would fit. They were *pissed* when they found out. Why? Because wedding buffet is 40% more. Why? Just because. There was difference, no decoration. \n\nI understand that weddings can be more stressful for the service providers due to the human factors involved. So yes, sometimes you charge more for coordination effort. But clearly when you didn’t notice before that’s not a factor. So it’s just a rip-off. And a reason why weddings are disproportionately more expensive than comparable sized events.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 192,
              "content": "I'm guessing prices depend on where you live.  Here, $500 wouldn't be unreasonable for bridal make-up, but it would, definitely,  include a trial.run, and would be a more, \"glam,\" look than party make-up.",
              "id": 61,
              "comments": [
                {
                  "score": 149,
                  "content": "I have one makeup artist friend. He breaks his makeup charges down by what he does and then has recommended packages for various situations. The bridal package iirc includes a trial and an application process that's meant to withstand many hours of ceremony and reception. \n\nThe other case for bridal makeup upcharge that it includes adjustments for photoshoots etc.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 109,
                  "content": "Plus touch ups for photos: bridal parties are generally more of a hassle because of photos/stress going on during the makeup, but if OP didn’t do anything different than she would for party makeup & wasn’t occupied additional time, there’s no justification.\n\nIt’s like salons charging for women’s cuts vs mens instead of based on complexity/time spent, a practice that’s becoming generally frowned upon.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Y'know. I've thought about the haircut prices bit. While it may cost me $45 (plus tip)to get my hair done once every 4 weeks, a man may get their hair cut weekly at$20 to stay fresh. I could probably go 6 weeks and not have it noticed as much as a man's short haircut.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 124,
              "content": ">cash cow\n\nExactly. Although she claims the client tried to say it wasn't about the title of the event, OP is actually making it about the title of the event. By not saying Bridal instead saying Party, she felt the client was trying to cheat her. YTA, definitely!\n\nIt's what photographers tried to do. When things went digital photohogs tried to do the same things and charge more when actually they were using the same amount of time for photos but using less materials because everything went digital. What a rip off!",
              "id": 65,
              "comments": [
                {
                  "score": 91,
                  "content": "They aren't using less materials rather different materials. Digital requires memory cards, larger hard drives, electricity to run computer while editing; all of which cost money. So though they may not be using a roll of film and developing in a dark room they do have costs that have to be factored in.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yeah no, you are paying for the photographer’s skill. It’s a charge for the service (and maybe some prints/album included in the initial fee) and generally anything that requires more materials, like prints or albums, will have an additional charge.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 60,
              "content": "Since you just had your wedding, you know how much people will upcharge things when they know they’re for a wedding. Not informing a makeup artist that they’re doing wedding makeup is a suggestion I’ve heard from a lot of brides to be because of the upcharge. I kind of thought that was bad advice but after reading this post, I’m not so sure.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "I was thinking the same thing.  I live in an expensive area, but with makeup trial run and the wedding day I only paid $250 (price plus tip).",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "Exactly. The only extra charges for my wedding makeup were for airbrushing and eye lashes - extra services, not simply because it was a wedding.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "It’s the same routine most places do for weddings. It’s an automatic up charge even when the services are the same for a party or corporate event. It’s a terrible practice and they’re all AH just like OP.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Right! I went to a hairstylist for my wedding four months ago. I lied and told her that I was just going to an event. Why? I didn't want to pay an extra hundred or so just because:\n\n1) I wanted something simple\n\n2) I was neither demanding nor super picky about it\n\n2) my hair isn't too thick and I was there for less than 30 minutes\n\n4) the style I wanted didn't need a trial and only required four bobby pins and a bit of spray.\n\n\nThe stylist did a really great job of course, and I tipped her well. But why should I have to pay $300 for half an hour when I didn't want anything intricate, I didn't need a trial, didn't need anything special or extra (like a wash, cut or coloring etc.) and the style was elegant but not difficult.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1812,
          "content": "I work in the spa industry and USUALLY I would side with the makeup artist but in this case absolutely not. This is exactly why people assume we are all scam artists. We have higher pricing for bridal makeup/hair for the following reasons:\n\n- Booking extra time as well as 100% dedicated service and attention, this covers extra product, time needed for hair extensions/hair pieces/falsh lashes/veils, etc. as well as understanding they may have to pause for photos, talking to the bridal party, etc.\n- A small portion of the additional fee is because of the extra stress that CAN be involved with anything surrounding a wedding\n\nWe QUOTE brides high to cover ourselves for the above reasons. If a bride only ends up getting something simple and straightforward then we charge less (except in the case where they specifically book the longer time then change their mind on the day of, we charge the higher price because they reserved the time meaning we turned away other services).\n\nAlso $500 is beyond insane. There is no way your time/materials are worth at least $250 an hour (allowing 2 full hours max for the makeup) I don't care where you are and what you are using. And if you were some sort of celebrity MUA then you would know how to properly book an appointment including contracts and deposits/prepayment to avoid this exact situation.\n\nEdited to add: OP put themselves into AH territory when they specifically waited until the end of the appointment to demand the extra money. If it was truly a concern she should have stopped when she realised it was a bride situation and communicated to the bride that since she was booked for a simple party makeup then that's all you can give her and that if she wants the more dedicated/in depth service then you will need to charge more. Then going forward she would use this as a learning situation for herself including a more in depth consult and perhaps a trial. THAT would have been the professional thing to do. Instead OP decided to be petty to prove a point.\n\nOP is definitely TA\n\n2nd edit to account for OP's own comments that solidify my judgement:\n\n- OP admits the client booked a party makeup and all she knew was the client's name, the service booked and the date/time. She did absolutely no follow up/confirmation, let alone a contract/deposit (contracts protect both parties and give realistic and solid expectations for everyone involved)\n\n- OP admits she uses the exact same products on both party and bridal makeup aside from specialised setting spray\n\n- OP gives the reason for the price difference as \"the responsibility\" yet does not give any explanation as to what extra responsible steps she takes to justify the pricing such as booking extra time, bringing extra products/lighting tools/keeping a backup MUA on standby in case of emergencies, etc. Repeatedly says \"its the principle\" which is, at best, vague AF.\n\n- OP agrees with and says she should have committed what amounts to assault by forcefully removing the brides makeup while at no point COMMUNICATING her frustration with the bride.\n\n- OP refuses to accept her judgement, saying the only reason she isn't taking the bride to small claims is because her friends would never let her hear the end of it.\n\nI'm glad OP has such amazing friends willing to be honest with her and make this the hill they die on. She should listen to them.",
          "id": 73,
          "comments": [
            {
              "score": 263,
              "content": "Exactly.  Addressing it with the client when it was revealed would have been the professional thing to do",
              "id": 74,
              "comments": [
                {
                  "score": 309,
                  "content": "I really don't understand how she didn't say a word to client, completed the job and then demanded an extra $350... That's cringy af.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Nothing like upsetting a bride on her wedding day,",
                      "id": 76,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 202,
              "content": ">OP put themselves into AH territory when they specifically waited until the end of the appointment to demand the extra money.\n\nThank you! I’ve been confused going through these comments why no one else brings this up. When someone said wedding OP should have shut it down and said whoa thats not how my prices work, not demand 2x as much after the works done.",
              "id": 77,
              "comments": [
                {
                  "score": 29,
                  "content": "More than 3x as much actually.  OP is a rip off",
                  "id": 78,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 137,
              "content": "For that much money I'm surprised at the lack of personal interaction she had with her client. Yes professional makeup artists should have the products to cover whoever their clients turn out to be but I'd think no matter what the occasion - \n\n'Please email me the following info:\n\n*  a picture of yourself without makeup, \n* do you have any make-up allergies, or skin sensitivities \n* do you have any reference photos of the look you are thinking of\n* what type of event, indoor/outdoor/ day/evening\n\nmany people have allergies, skin can be oily/ very dry/ acne blemishes to cover, not to mention skin tone.",
              "id": 79,
              "comments": [
                {
                  "score": 67,
                  "content": "Right? I worked front desk at spas for so many years that this level of cavalier...ness(?) towards bridal makeup especially at that price gives me anxiety. Our prices are considerably lower and we ask all of those questions plus we take a credit card number or deposit to hold the apt. And we don't even do on-site makeup. I truly can't believe OP has been doing this professionally for 9 years.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 25,
                      "content": "and 'party makeup' can vary so much - is the client going to a afternoon tea party, an  '80's disco' party or an 'I made partner at my law firm' party?",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I'm a makeup artist's hardest project because I have morphea (scleroderma) and I basically look like two-face from all the scarring. The challenging part is that some of this has altered the shape of one of my eye sockets so my face looks SUPER asymmetrical, and it's really obvious, and I can't wear the same makeup on each side without looking SUPREMELY weird. So! The ONE TIME I had professional makeup done (for my sister's wedding, actually) I basically told the MUA that anything that 'fixed' that was their best approach. I think she enjoyed the challenge, tbh. \n\nMy sister paid the full normal price for me - no upcharge for the difficulty - but I also cannot (physically can't) let others put eyeliner, mascara, or eyelashes onto me, so I didn't have any of that done by the MUA. Or blush, or lipstick. It was mostly just to hide the scars and make one eye look less wonky. And it worked marvelously, we tipped her like a baller.",
                  "id": 82,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "She's not a professional. She's a scammer with some make up skills, a horrendous work ethic and really luxurious setting spray.",
                  "id": 83,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "YES, all of this. I saw the title of the post and expected to side with OP, because I was expecting a bridezilla story. \n\nI *think* I get where OP is coming from. Reputation is everything when you’re an individual service provider, and weddings are really fraught, and maybe they were worried about their work falling short, because they didn’t use more expensive/longer-lasting products?\n\nBut OP put themselves in a situation where a) their work is going to fall short anyway, and b) where the entire bridal party has had a bad experience with OP’s price gouging.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "[deleted]",
              "id": 85,
              "comments": [
                {
                  "score": 5,
                  "content": "Exactly! Best idea for OP was to just suck it up at that point, especially as they ended up doing nothing more than a different setting spray - which does not cost $350 for a single use of it. \n\nNot to mention OP's made comments how they should have removed the make-up after finding out - so essentially by force. OP wants real badly to go to jail it seems as the bride easily could have filed assault charges at that point and paid not a dime to OP. More likely OP would owe the bride some restitution!",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "The OP isn't just an AH, she's a really profoundly stupid one. She cannot take her to small claims court because she is the one who broke verbal contract. The client asked for a basic service, got a basic service and had literally zero requirement to fill OP in on any specifics. \n\nThe only reason she isn't taking her to small claims court is cos she can't. Lawyers would laugh at her and a judge would destroy her. Even if her case was taken by some idiot...potential counter suits that actually have legal merit would bury her. Also, this is such a dumb idea it'd likely be published somewhere with OP Scammers actual name and business details so everyone knows not to pay her 500 for a 150 bridal service with no actual bridal service to speak of. \n\nObviously again showing how unintelligent she is, she believes she is within her rights to assault someone by forcefully removing the make up service she had agreed to. I hadn't seen this response from her, but that's actually disgusting and she shouldn't be operating a business. Only an unstable human would consider any of these things okay. \n\nAll of the internet and everyone she knows is telling her she's TA and her response is essentially \"I should have physically assaulted her for not disclosing irrelevant personal information to me so I could scam the living daylights out of her!\" --- actually bonkers. \n\nI feel sorry for her friends.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "It's totally legit to charge more for bridal make up but not to change your price without telling the client. They agreed on $150 so she should have honored it or at least told the bride about the increase before she began.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Very well put. I used to run a nightclub, so I have a ton of DJ friends. I've had a few arguments with them about the wedding thing, because they never could explain how they can charge 4x as much as the clubs pay to do a wedding reception. Like, you have to announce the party and play a few requests, but beyond that, you're gonna play The Electric Slide, The Chicken Dance, The Dip, Cupid Shuffle, The Wobble, The Cha Cha Slide, and some slow jams and top 40 peppered in. The little extra is well balanced out by the fact that the remaining 2 and 1/2 hours are pure autopilot.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 807,
          "content": "She demanded a party make up, she got a party make up. How she is dress or where she wears the make-up, why do OP care? Oh yeah, greed! If OP get booked for a bridal make-up and the person shows up in a party dress, does she just need to pay 150 bucks? \n\nYTA You made a party make up without saying a word and then demanded 350 bucks more. Just no. I hope they warn people about you on every platform.",
          "id": 90,
          "comments": [
            {
              "score": 166,
              "content": "It’s like ordering a regular old sheet cake that says “congratulations” and then the baker hears they are using it at a wedding and says “actually, you owe me what a wedding cake costs because you’re taking this cake to a wedding”",
              "id": 91,
              "comments": [
                {
                  "score": 29,
                  "content": "^^^(nods) There are so many things that come with a wedding tax just because capitalism.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "My wedding cake was 40 dollars. And 100 dollars for the sheet cake. My baker was very happy for my marriage",
                  "id": 93,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 247,
          "content": "The only difference according to the makeup artist I had for my wedding between bridal and party was for party she uses a standard setting spray and doesn't leave a touch up kit. For bridal she uses a setting pray meant for synchronized swimmers and leaves a personalized touch up kit. There also isn't a trial in the party package but even with the trial my bridal package was only $75 more expensive than the party package so around $225. \n$350 extra for the word bridal is a grift definitely agree with the YTA",
          "id": 94,
          "comments": [
            {
              "score": 16,
              "content": "There are $15 setting sprays and $45+ setting sprays; seems like having 'low/med/high'-end in the kit would be a smart move.",
              "id": 95,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 216,
          "content": "OP's updated comment:\n\n>I use the same products most of the time both in bridal and party makeup. The only difference is the setting sprays I use and after I found out she's a bride I used a higher quality setting spray and mixed it with some fixing spray to make the result better\n\nSetting spray and fixing spray does not justify $500. If the makeup is the same, the price should be the same. OP is a con artist.",
          "id": 96,
          "comments": [
            {
              "score": 82,
              "content": "Also, even if they did, the bride didnt ask for it. She asked for party make up, and if the artist decides to use other products without consulting her, that still doesnt allow her to take a higher price.",
              "id": 97,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "Wow op is a fucking scam.",
              "id": 98,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 191,
          "content": "I’ve been doing hair for 10 years and I completely disagree with how the OP handled this situation, if someone schedules me for a blowout/curls and then tells me during the appointment they are getting married that day I’m definitely not going to upcharge them just because of that. I can understand if there are trials or run through, different products or advanced techniques but it doesn’t sound to me like there was in this case.Besides being rude it’s a terrible way to run your business, that bride is going to tell everyone she meets how poorly she was treated, and rightly so. OP, YTA",
          "id": 99,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 162,
          "content": "I agree. What gets me though is if OP heard its actually a wedding, WHY did she not tell the bride \"i charge more for weddings\" before even doing the make-up job? Why continue doing the make-up without saying anything?",
          "id": 100,
          "comments": [
            {
              "score": 114,
              "content": "Because she was hoping to grift them.",
              "id": 101,
              "comments": [
                {
                  "score": 23,
                  "content": "ya thats royally fucked up.  OP is lucky she got any kinda payment.",
                  "id": 102,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "It was because she couldn't scam them if she had been professional and done that.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 139,
          "content": "I seriously doubt OP could prevail in court either, since there is no material difference between the procedures and the \"bride\" asked for the make up treatment that they received.",
          "id": 104,
          "comments": [
            {
              "score": 19,
              "content": "There's also no contract.",
              "id": 105,
              "comments": [
                {
                  "score": 29,
                  "content": "Yeah... to me that's the game ender in court. OP admits she quoted the bride party price.\n\nIf OP wanted to be fair... say she was half way through the \"party\" makeup before realizing it was a wedding, she could have said \"Oh I'm sorry I didn't realize this was for a wedding, for parties I use a lower quality setting and mixing spray that would hold better for the wedding, but if you'd like me to use that the price will be $500, or you can keep the party makeup, but it may not be ideal for surviving the wedding because of (whatever BS justification she wants to push for why that stuff is $350 better). \n\n\nCustomer paid for a service, OP unilaterally decided to change the service on the customer without discussion to something 3x more expensive. There is no justification there.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 30,
                      "content": "[deleted]",
                      "id": 107,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 101,
          "content": "Agree. If you performed the same service on her that you would perform on someone who wasnt the bride then why would you charge her more.\n\nYour pricing system sucks and YTA until you fix it- or at least dont complain when people take advantage of a shitty system.",
          "id": 108,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 91,
          "content": "This! The whole point of a bridal option is to include everything that goes with it. The artist I picked did a trial, plus airbrush foundation and custom false lashes. Bridesmaids paid less because they didn't get the lashes (unless they added it for extra) or the trial. So charging her for a service she didn't get is ridiculous. Unless OP just does the exact same service for each price level and bases the cost solely off the event and not what is provided, in which case we jump from ridiculous to literally insane. OP is TA and greedy to boot.",
          "id": 109,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16516,
      "content": "YTA. Once you found out, you should have told her the prices for bridal makeup. And, seeing how everything you use for party makeup and bridal makeup is the same other than the setting spray she was right to call you a scammer. A $350 difference for a couple of sprays to set the make up??? That spray better be made of Gods tears.",
      "id": 110,
      "comments": [
        {
          "score": 3091,
          "content": "[deleted]",
          "id": 111,
          "comments": [
            {
              "score": 1115,
              "content": "I mean the only reason I can come up with is if you use something heavier/more waterproof cause they’re assuming you’ll cry? And in general lighter products feel nicer. Idk.",
              "id": 112,
              "comments": [
                {
                  "score": 355,
                  "content": "I wouldn’t want super heavy stuff for my wedding either! I’d feel weird all night",
                  "id": 113,
                  "comments": [
                    {
                      "score": 298,
                      "content": "It's not bad actually. I didn't notice a difference between it and my usual setting spray. Not worth and extra $350 and OP is TA but the setting spray isn't noticeable",
                      "id": 114,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 286,
                  "content": "My makeup artist used the stuff for synchronized swimmers for my bridal (I also had a trial) and left a touch up kit as part of the bridal package but all together the bridal package was only like $75 more than her regular package. \nYou cry at your wedding plus between pictures and ceremony and reception that makeup needs to last 8+ hours",
                  "id": 115,
                  "comments": [
                    {
                      "score": 84,
                      "content": "Synchronized swimmers wear makeup!?",
                      "id": 116,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "See that's fair. What op did is not",
                      "id": 117,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Some setting sprays glue your makeup on in a way that others do not. If you aren't use to them, they can be uncomfortable. Depending on your skin type, they can also cause breakouts and dryness if worn all day. But, your face will stay on even if it's raining, humid, and a million degrees outside. \n\nI did my own wedding makeup and used a regular setting spray because I have naturally dry and sensitive skin and didn't want to wreck my shit.",
              "id": 118,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 623,
          "content": "It’s very common for wedding up charges on things. It’s usually not because the products are “better” but the extra attention to detail/dealing with bride level anal retentiveness. At least that’s how it works for wedding cakes. It’s very common for people to lie about the event to get cheaper prices. Which sucks. But if you don’t catch their lies until after you agree on a price that is the service providers problem. Telling them they own you more AFTER providing the service is definitely YTA and also illegal.  OP really needs to get in the habit of reviewing expected services and pricing BEFORE beginning her work from now on.",
          "id": 119,
          "comments": [
            {
              "score": 439,
              "content": "And they didn't even do anything extra. They did the exact same as they would had they done the $150 service. There was no extra time spent, no bride pampering.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 375,
              "content": "Also, if I don't say it's for a wedding, I wouldn't be expecting \"wedding treatment\" – like the extra attention to detail or whatever. So still getting charged for something I never asked for (or got, presumably) is just horrible.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 226,
              "content": "It only sucks if you still have to give that extra attention to detail. If I’m paying for an event to be catered, and I pay regular event rates and am happy with the food and service level, why tf should I pay an up charge just because the event happens to be a wedding? If there’s no difference in service or products, it should matter whether the event is a corporate meeting, a bar mitzvah, a birthday party or even a wedding. Charging more without actually providing more is predatory and definitely a scam. Now demanding extra service because it’s a wedding after only requesting/agreeing on a regular event level service is an asshole move, but that’s when the provider can explain “sorry, that’s an extra service on top of my usual package and the additional cost if you want it is X”",
              "id": 122,
              "comments": [
                {
                  "score": 82,
                  "content": "I was in special events for 13 years pre-pandemic. We charged more for weddings, but they also got more. Rehearsal space time, coordinating deliveries with florists/bakery, the extra setup with specialty decor, accommodating the bridal party who is there well before the guests, etc. If they said they just “wanted a party” as in hall/food/in-house decor, and then started trying to sneak those things in, they would quickly be handed a revised contract.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 86,
                      "content": "Right, but should that not be up to the customer if they actually want all that \"extra\" stuff you mentioned? If I'm putting on an event, and I don't need extra set up with specialty decor, I don't need accommodations for the wedding party above and beyond what is outline as available to me in the original \"normal event\" contract, I don't need the extra coordination with different deliveries etc., then as long as I don't ask for any of those things or expect any of those things day of, I'd be pretty miffed to get handed a contract saying \"well if we knew this was a wedding, we would have given you all these extra things so now you have to pay for them!\" But I Don't want or need all those extra things, so no, I'm not paying extra just so you can decide to throw in a bunch of extra stuff I didn't ask for just because you can offer it for other weddings. Again, totally different scenario if the customer expects all the extras and thinks they're getting away with something by originally making it sound like a more low key typical event and then still expecting the VIP treatment because it's actually a wedding, but it's really not cool for businesses to assume everyone WANTS the extras \\*just\\* because it's a wedding.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "But if they book the service for the party and don't need the extra services for the wedding, why would you charge extra just because it's called a wedding. Not everyone has a grand wedding and isn't required to. Charge extra for extra service, not a name.",
                      "id": 125,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 114,
              "content": "The problem I see with this statement is if I’m okay with receiving your normal amount of attention and I don’t give you any “wedding anal retentiveness”, I should be able to pay for that level of attention.  Why would someone give more attention because of the type of event it is?  Why not just give great attention all the time?",
              "id": 126,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 47,
              "content": "I understand charging more for the detail and if there was a test beforehand to give the bride different options for makeup but some people want simple makeup for their wedding. It shouldn't matter that this was for a wedding and that the bride \"lied\", maybe the bride just wanted the simple service anyway.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I suspect this is why my stylist on my wedding day charged my mom less. She hadn't had that much fun in a long time. Because I am not great with makeup, never have been, and I don't even know what hairstyle would look amazing. My mom booked bridal and was willing to pay bridal, but I sat in the chair, she asked me what I had in mind and I was like *shrug* I dunno...I kinda like old school pin up style but can't do it...and I don't know anything about false lashes or updos so..I am gonna defer to your judgement. She got giddy levels of excited \"you mean I can do -anything?- and I nodded. While we talked I mentioned I didn't actually know what being beautiful is like because I fail at basic girl 101. She goes girl. I got you! And she did. I looked in the mirror when she was done and was blown away. While she did my hair she asked me what I wanted my husband done like because she had him later that day, told her \" I dunno?\" And she pulled a pic of her boyfriend up \"this?\" And I went omg yes! When she was done, she told my mom she never had such fun doing bridal before and cut the rate by half as her 'wedding gift' to me. Mom gave her a massive tip by the end, so much so she told her not to worry about my husband's hair and beard she was good. It almost made me cry she was so nice @.@",
              "id": 128,
              "comments": [
                {
                  "score": 10,
                  "content": "In event services I would say there are definitely asshole fees and I like you discounts. Lol",
                  "id": 129,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Yep XD and I felt extra special with that. She is my go to person for big things now XD",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I hear this a lot, so if I ever get married, I'm straight up going to lie what the food, make-up, decorations, etc. are for because a markup for the sake of a markup is bullshit. Especially if the only difference is the word \"wedding\" or \"bridal.\" A cake is a cake. The cake won't know it's being eaten at a wedding or at a three-year-old's birthday party, so why would the baker care and charge extra cash? I genuinely don't get it.",
              "id": 131,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "> A $350 difference for a couple of sprays to set the make up???\n\nA couple of sprays to set the makeup, which the bride didn't order. OP shouldn't have used them because the bride didn't order them. Even if they are legitimately god's tears sprays, they were not ordered.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "OP should have read the room before starting to do the procedure, and reviewed the agreement with the hostess/bride. Also, I don't know why there's no mention of a contract. A contract for services protects the client and the contractor in the event of an expectation going away,or a misunderstanding over fees for services and products provided.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "Crap like this is why I did my own makeup for my wedding. I wanted to look like myself, I came in armed with enough setting spray to do all my bridesmaids and myself, and I was happy with the results.",
          "id": 134,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "This is 100% a fake post. $500 for wedding makeup is rare, only a semi celebrity artist would charge that. In which case, their party makeup would be proportionately more as well. \n\nAny legit makeup artist you talk to will tell you their  wedding prices are higher (but not *this* high) because they take more time, use a good bit more product, and are more slow and precise for brides. If a bride books their general services, they’ll get those services at that price.\n\nThis is just one of those hUh lOoK hoW dumB aNd ovErpRicEd tHe WeDdiNg inDuStrY iS posts. Which it is, but not because it of makeup artist pricing.",
          "id": 135,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11760,
      "content": "YTA. As a fellow makeup artist there is absolutely no reason I can see for that massive price disparity. She asked for party makeup, don’t give her anything special beyond that. It was your choice to use the more expensive product, not hers, but even if it wasn’t— an extra $350?? Come on.",
      "id": 136,
      "comments": [
        {
          "score": 2652,
          "content": "I’m glad to read your comment because I feel like this is common practice to take advantage of people during sentimental events, and it’s nice to know it’s not just a given. I can understand charging more if it comes with better treatment (Champaign, a crew of other artists working on the brides maids, idk… something!) but with such a big price gap, she’s destined to get “scammed” by a smart bride at some point.",
          "id": 137,
          "comments": [
            {
              "score": 1341,
              "content": "Wedding photographer here. You would not BELIEVE how common the attitude of “It’s a wedding, let me triple my prices” is.\n\nI charge $1,200-$3,500 for my wedding packages but it’s very open and honest in what things cost and why it costs what it costs.\n\nI’m considered low mid-range in my market because most photographers are starting at $3,000 just to show up. \n\nIt’s worse for other vendors. \n\nI get why people charge a lot for weddings as there’s much more time, money and effort put into the work you do for a wedding vs. the work you do for a simple party or whatnot but it’s gross that people think they can milk a couple for extra money just because of the event type.\n\nIf you can show why your prices are what they are and justify it, I’m all for it. If you’re up front and honest with a couple BEFORE THEY BOOK, I’m all for it.\n\nBut this post and that attitude in general are disgusting.",
              "id": 138,
              "comments": [
                {
                  "score": 517,
                  "content": "I went to photography school, and some of my fellow students were also working jobs. We had a few wedding photographers, and I even did a wedding myself. It was my best friend’s, and the photos were my wedding gift to her. \n\nI definitely understand the increase in prices for things that require you to put in A LOT of extra work. \n\nWedding photography is brutal. You’re constantly on your feet, moving about, trying to shove people with phone cameras out of the way so you can get the shot you’ve been hired to take, and there’s that one unhappy wedding guest that refuses to smile. \n\nI don’t give any shit to photographers or videographers for charging extra. \n\nThat being said… I don’t do photography anymore, but if a bride and groom just asked for a simple outdoor photo shoot of the two of them instead of a full wedding, I’d charge them the same that I would a regular photoshoot. \n\nNothing has changed except their attire, and I’m not selling the clothes. There’s no need to be greedy and ridiculous, like OP.\n\nOP, YTA, and you know EXACTLY what you were doing.",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": "I’m sure you can attest - a wedding package would be entirely different from a different type of party package and probably cost considerably less. Typically weddings require a lot of energy, skill, timing, patience, etc to ensure you really give the best product you can possibly give since they are so monumental for most people. \n\nThe up-charge for weddings is for the skill and the stress of making sure everything goes perfect. You do not want to fuck up someone’s special day. \n\nMeanwhile OP is over here applying clown makeup from NARS believing they deserve an extra $350 because someone said “wedding”.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 30,
                      "content": "As I've said, if you can JUSTIFY why your cost is higher and you tell the client beforehand, I'm cool with it. If you try to sneak it past or are just charging more because you know you can, that's bullshit.",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "DJ here. I don’t do functions any more (just bars and clubs now) but I used to work for a company who charged the same rate for any event. On the other hand, my friend works for a company which charges double for weddings. It’s dogshit. \n\nAlso, just to get my vote in here: OP, YTA.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Common with flowers as well",
                  "id": 143,
                  "comments": [
                    {
                      "score": 26,
                      "content": "In my opinion, flowers and transportation are the two stupidest expenses on a wedding day in terms of service vs. cost.\n\nDon't get me wrong. A beautiful bridal bouquet is unbelievably nice but is it $400-$500 nice? Ehhhhhhh. \n\nI've had a lot of brides who get their bouquets from the grocery store florist or by making it themselves. I would almost never be able to spot the difference. \n\nAnd transportation? WOOOOOF. A thousand bucks or more to take what amounts to maybe an hour total trip? Insanity.",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "OP was simply bit by her own karma",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1007,
          "content": "> It was your choice to use the more expensive product,\n\nBased on the OP, it seems she uses the exact same products in both her \"party\" and \"bridal\" makeup, so she isn't even using better products, just slapping an extra $350 on the bill because \"it's a wedding and people will pay\".",
          "id": 146,
          "comments": [
            {
              "score": 289,
              "content": "OP's argument is largely centered on her using a better setting spray\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/vq0d0d/aita_for_charging_a_bride_more_for_make_up_when/iem9kll?utm_medium=android_app&utm_source=share&context=3",
              "id": 147,
              "comments": [
                {
                  "score": 409,
                  "content": "And ultimately, if the bride didn't order that, she shouldn't have used it.",
                  "id": 148,
                  "comments": [
                    {
                      "score": 263,
                      "content": "100%\n\nOP is (not to continue the broken record tone of the comment section) a scam artist. The absolute NERVE to have a customer book the cheaper of two applicable options (weddings are parties FFS) and only want that service, CHANGE THEIR SERVICE (it's still the same service, but the rEsPoNsIbIlItY tax makes it ~different~, I guess) without asking or saying anything, and then demand over 300% of the original price (which you already agreed to) with NO WARNING and then get mad at THE CUSTOMER and BLACKLIST them....\n\nRidiculous. Terrible business. Just fundamentally off every rocker, really.",
                      "id": 149,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 528,
          "content": "Yep everyone knows and hates the \"wedding tax\" and OP is just mad that this bride was wise to her scam.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 462,
          "content": "Hard same. I'm a makeup artist as well and the difference in a bridal makeup vs an event would be a significant change in products and services offered (like in house visits, tests, airbrushing, touch up kits, etc), not just like a more hardcore setting spray. FFS, OP should retire and leave her clients to people who aren't trying to scam them. Maybe a nice MLM is more her speed.",
          "id": 151,
          "comments": [
            {
              "score": 82,
              "content": "What if a bride wouldn't be able to pay for your bridal version so asks for a regular party version. Would you deny her or would you give her the party attention?",
              "id": 152,
              "comments": [
                {
                  "score": 207,
                  "content": "I'd be very clear about what the differences would be and what she could expect and let her make the choice herself. If she wanted the bridal package but not at the price point I was offering I would decline the job, but if she was fine with what she was getting at the lower price then we're both in agreement. That's kind of the great thing about being a freelancer however you also have to make sure everyone is on the same page up front and there are no misunderstandings.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 24,
                      "content": "That's fair then. You are charging extra for actual extras and not for the name of the event.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "I used to be a hairstylist who did wedding hair, and my prices for wedding/event hair were higher if I was doing a trial run prior and I was needed on site  at the venue. I did give package deals if I was doing the whole wedding party, and that would include me bringing an assistant to prep hair if it was a large wedding party. But I still never got crazy with my prices. \n\nI would like to add that part of higher prices for wedding hair on site is because we would need to block out a large portion of our day on our scheduling books to accommodate traveling to the venue and being on site for that time. Often hair stylists may feel they would have made more money with less hassle of packing up their tools and traveling to and from venues. However, no one is forcing those stylists to offer wedding hair services. Either you want to be available for wedding hair and all that it entails or you don’t. It also covers the products we use and paying an assistant if needed. Sometimes brides are extremely particular and needy, that just comes with the occasion. I’ve have lovely brides to work with and brides that made me reconsider if it is even worth my time and passion to do weddings anymore. That being said, the prices I’m seeing these days are verging on the side of price gouging and taking advantage. \n\nI recently had a friend of a friend reach out to me and ask if I would be willing to do her hair (paid) for her wedding on site (a mile from where I live) because prices for just drying/shaping her natural curls and pinning a few pieces back were quoted to be around $500. I couldn’t commit to the day, as I’ll be out of town, but I told her I would be happy to do a run through with her at my house and teach her how to do her own hair if it came to it. Even though I’m retired from hair I don’t mind doing hair for friends every once in a while as long as they value my time and pay for products and tip me for my time.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "Imagine going to a barber and requesting one of their regular $25 haircuts. They agree to cut your hair and start chopping away. They decide without telling you that they are going to give you a $375 haircut instead. The only difference is that they put a different moose or gel in your hair. Then when you go to pay them, they tell you that because it’s your wedding day instead of just a regular day, you need to pay $350 more. You only wanted a regular haircut, not a special wedding day haircut.",
          "id": 156,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "And without notifying the bride before doing the nake up even. That's horrible.\n\nYTA. Your prices are terrible and so is your behavior and attitude.",
          "id": 157,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Did she actually use more expensive make up? She didn't actually say she did in her post or did I miss it? The way I read it is that she did the exact same thing but labelled it differently due to the event?",
          "id": 158,
          "comments": [
            {
              "score": 26,
              "content": "Barely. She later commented that she used “more expensive setting spray”. Total bs. You’re right",
              "id": 159,
              "comments": [
                {
                  "score": 11,
                  "content": "Lol sounds like a great business, very legit and trustworthy",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Just curious? How much does a good setting spray cost to buy from a retailer? Bride should have purchased it outright for that much or less right?",
          "id": 161,
          "comments": [
            {
              "score": 27,
              "content": "Most higher end setting sprays are like, $40. I found one on Google for $100 for an ENTIRE BOTTLE. a few spritzes for $350 is absolutely ridiculous.",
              "id": 162,
              "comments": [
                {
                  "score": 7,
                  "content": "Oh my god. It’s an even worse mark up than I thought!",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Also.. they agreed on a price for a service. The nature of the service hasn't changed, so the price shouldn't either.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Exactly, what if she wanted simple party makeup? Not heavier or more fancy makeup. If she asked for \"Party makeup\" then just give her party makeup.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6899,
      "content": "YTA. A wedding is a party. She didn’t ask for extra work done, you didn’t ask what kind of party it was before agreeing to the booking. She got around your sneaky price gouging practices and you’re salty, get over it.\n\nIt’s reasonable to charge more for bridal makeup if you’re doing something more elaborate than you normally would, not just because it’s a wedding.",
      "id": 166,
      "comments": [
        {
          "score": 801,
          "content": "> and you’re salty, get over it\n\nBwahahahaHAHAHAHA",
          "id": 167,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5371,
      "content": "YTA and a scammer, 350 for setting spray, ridiculous",
      "id": 168,
      "comments": [
        {
          "score": 1125,
          "content": "Where I’m from (Europe) you’re looking looking at €200 for bridal… $500?! How is that justifiable in the slightest?!",
          "id": 169,
          "comments": [
            {
              "score": 756,
              "content": "Same here, I’m in Texas and paid $150 for my bridal make up and that included the test run. $500 is a ripoff 😂",
              "id": 170,
              "comments": [
                {
                  "score": 6,
                  "content": "Californian here. The price is insane",
                  "id": 171,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 302,
              "content": "I’m in NYC and have researched wedding makeup artists and that price is outrageous.",
              "id": 172,
              "comments": [
                {
                  "score": 163,
                  "content": "Right?  I’m in Philly & my best friend paid $150 for hers in sept. Bridesmaids were $90. OP is a huge ripoff.",
                  "id": 173,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yeah and if she wants to charge that much, fine but the service and cost was established and then the same service suddenly became more expensive because it was for a wedding",
                      "id": 174,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 109,
              "content": "That price (I’m in the U.S.) is outrageous!",
              "id": 175,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "I live in a major metropolitan area in the US. My sister got married last year and asked me to do her makeup. I was too nervous about the pressure so I hired a fancy-ass makeup artist. I only spend money on cruelty-free products, so I felt like I could only support an artist who uses CF products too. It was expensive - $400, but it came with a trial. $500 for an ordinary makeup artist is unbelievable.",
              "id": 176,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Yeah, when my sister got married I paid for the bridal party’s makeup and I’m pretty sure for all of us, including the bride, it was about $250.",
              "id": 177,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Welcome to America where we make capitalism proud.",
              "id": 178,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Basically, it's because America's core value is \"rip people off if you can get away with it\".  You can explain nearly all of our problems if you start with that principle.  Source: I'm an American.",
              "id": 179,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Where in Europe are you? I paid £60 for my makeup when I got married in May",
              "id": 180,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "> 350 for setting spray, ridiculous\n\nEven if the setting spray was 100% worth every penny of that, the bride didn't order it, so the fact that OP used it is solely OP's problem.",
          "id": 181,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4166,
      "content": "YTA. You gave her a party makeup and tried to charge her $500 when you found out she’s the bride. What changed in those few minutes? Lol. \n\nAnd wtf, $500 for some makeup??",
      "id": 182,
      "comments": [
        {
          "score": 93,
          "content": "This is going to be a serious social media blast. This mistake is going to cost the Op far more than a few hundred bucks in the long run",
          "id": 183,
          "comments": [
            {
              "score": 75,
              "content": "Lol this post already got recommended to me from another site on my Google news feed.",
              "id": 184,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1936,
      "content": "YTA there is such a markup on prices just because the word wedding is involved. It’s completely fucked up. Like hell I can either spend $1000 to hire a big marquee tent, or I spend $200 to buy the same damn marquee tent. If I get a cake made for a family event it’s a certain price, I mention wedding(same sized cake, zero differences) prices at least double for no other reason than the word wedding being involved.\n\nHonestly it’s so fucked up people charge soo much more because the word wedding is involved.",
      "id": 185,
      "comments": [
        {
          "score": 492,
          "content": "I read a defense from a baker that they charge more for wedding cakes because decorating a normal cake takes them only a few minutes, but they allow basically unlimited time for a wedding cake because they want it to be perfect. But in this case...setting spray???",
          "id": 186,
          "comments": [
            {
              "score": 327,
              "content": "The cakes were decorated in the exact same way. There was zero difference between how they looked. Only difference was the price",
              "id": 187,
              "comments": [
                {
                  "score": 179,
                  "content": "Some wedding-industry providers say that they’re more diligent about what they do for weddings, meaning that they will give it priority. I can kind of see that explanation a little; if I order a cake for a birthday party and there’s a problem, there’s probably less impact than if it’s for a wedding. But none of that would justify shooting the price up if you find out it’s for a wedding only when you’re actually providing the item or service. That’s simply gouging.",
                  "id": 188,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Ok I'm not a lawyer but I get that there's a somewhat increase in liability. If you cater a bbq and something goes wrong you'll be sued for a lesser amount than if you catered a wedding and something goes wrong because the family could try to insist that you're liable for the other costs of the wedding since your failure impacted other expensive items as well. But the key word there is a)try and b) knowing the liability. But generally they limit damages to foreseeable damages. So if the caterer does not know it's for a wedding, then they're only going to be liable for any damages up to a bbq level. \n\nIf a caterer knows it's for a wedding, then I'm ok with an upcharge sufficient to cover any extra insurance, plus that they may allow extra time, extra materials, or incur other extra costs to ensure that that things go smoothly. But OP is definitely YTA. Upon hearing it's for a wedding she should have simple stated that the reservation was not for wedding makeup and the service she was providing was not wedding makeup and she was making no guarantees related to the quality or length of duration for the makeup lasting as long as a wedding an reception.",
                      "id": 189,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Most wedding cakes are tiered, which are hard to assemble and transport. You usually don't have \"tastings\" of 3 - 6 different cakes for a birthday cake, so that's another cost. If you are doing a wedding, and want a cake on the cheap, it's fine to get a sheet cake from Costco.\n\nNot that tastings, tiers, & multiple changes would account for the entire difference - I agree there is a \"wedding premium\" for things associated with weddings.\n\nYou might enjoy this wedding vs party cake skit: [https://youtu.be/gimiDBAK2wA](https://youtu.be/gimiDBAK2wA)",
                  "id": 190,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 79,
              "content": "That’s great if the wedding couple wants that extra attention, but if they don’t care, then it’s insane to charge them for it anyway",
              "id": 191,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 315,
          "content": "I hate wedding tax. \n\nI remember someone saying to me 'aw venues charge more for weddings because they want the day to go perfectly etc'. . Umm, if I'm booking a venue for ANY kind of party, I want it to go well.  Do the venues not?  They only care about weddings?!",
          "id": 192,
          "comments": [
            {
              "score": 31,
              "content": "“We are charging you extra because we promise to do our job better than we would on a birthday”",
              "id": 193,
              "comments": [
                {
                  "score": 11,
                  "content": "More like \"we are changing you extra because we're pretty sure you're going to be a total pain in the ass about anything and everything.\"",
                  "id": 194,
                  "comments": [
                    {
                      "score": 15,
                      "content": "So do they refund the difference if your pleasant and not a pain in the ass?",
                      "id": 195,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "It’s not because the venue wants the day to go more or less perfectly, it’s because the venue is anticipating people involved in the wedding being more obsessive about everything being ‘perfect’ and thus requiring much more time and energy to deal with. The venue wants to do their job either way, it’s just a question of how much time they have to spend handling extra emails/calls/weird requests/etc.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "This. The professional can charge whatever they think it's fair for their labor however charging $200 more just because the woman is the bride is ridiculous. The only justificative is if she uses more expensive products.",
          "id": 197,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "It's just predatory. They know people want their day to be special, so they try to take advantage. \n\nIt's  one of the same root causes to why healthcare and student loans are so messed up.",
          "id": 198,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1928,
      "content": "[deleted]",
      "id": 199,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1744,
      "content": "YTA in this situation and YTA in business \n\nShe asked for party make up, you gave her party make up, she didn't ask for anything extra and you didn't provide anything extra- so what difference does it make? \n\nAnd after reading your responses to other comments, YTA for charging your customers an extra $350 for 'different setting spray'. That's daylight freakin robbery.",
      "id": 200,
      "comments": [
        {
          "score": 558,
          "content": "I knew a make up artist with a similar disparity in prices for “party” and “bride” make up but it made sense!\nParty make up was just a your face done. “Bridal” make up was an experience. For bridal she’d give you a facial, you got complementary brushes and keep all the products she used for your face. Not to mention the trial was included! OP is a con-artist. YTA!!!",
          "id": 201,
          "comments": [
            {
              "score": 183,
              "content": "I think that’s one of the key aspects of a mark up for bridal bath party: the trial. What if she didn’t like the party look, I pay more so I can decide if I like it or not. This was an insane AITA. Of course OP is.",
              "id": 202,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1061,
      "content": "INFO:… so was there anything different you did when u realized she was a bride than otherwise?? \nHer mom throwing money at u was gross but if the look remained the same… why tell her after you did her makeup she’s 350’short ?",
      "id": 203,
      "comments": [
        {
          "score": 728,
          "content": "I don’t even think the money throwing was gross. I think OP was gross to change the price at the last minute and act like TA. They were just paying OP to go away and not ruin the brides day.",
          "id": 204,
          "comments": [
            {
              "score": 86,
              "content": "Yup. Beggars can’t be choosers. She asked for the money, didn’t specify that she didn’t want it thrown at her so…. 😂",
              "id": 205,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Better than what I would have done in the bride's shoes. I would have mentioned the payment would be in the mail - and paid the original $150 in $5 increments every 2-3 weeks. Let OP sit at home and stew for the year or more it would take to get all the money. OP couldn't even take it to court as there was zero contract, the quoted proven price is $150, and OP in comments says they should have taken the make-up off by force....so essentially they wanted to spend their weekend in jail and not get paid at all.",
              "id": 206,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "Besides setting spray (lol, I have used Urban Decay’s for years and I really doubt other brands can do so significantly better that you can justify that price) but that makes me curious of what brand(s) of make up do you use?",
          "id": 207,
          "comments": [
            {
              "score": 57,
              "content": "Hey! Her wedding-setting-spray is made from fairydust, unicorn horn and the tears of newlyweds, who tried to have a simply and inexpensive wedding (Not on this swindler's watch!)",
              "id": 208,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}