{
  "post content": "It happened yesterday, but I'm still thinking about it, so I need an external opinion.\n\nIn December 2021 I had a surgery for a breast cancer. It was in the very early stage, the surgeon removed it completely, but I still had to do radiotherapy sessions and many follow-up visits.  \nYesterday I had the visit with the breast specialist. He was in the examination room with two residents. These rooms have an examination table and a curtain that can be pulled to prevent the patient from being visible from the corridor, should someone open the door (this is relevant for what happened).\n\nAs usual, I sit on the table and took off my shirt and bra. The curtain was open but I just didn't notice.  \nBut suddenly the doctor yelled at one of the residents, *\"Move and pull the curtain. What if someone opens the door? Do I always have to say everything?\"*  \nSuddenly the mood became very tense and I tried to ease it with a joke, *\"It's not a problem, doctor. By now, half of the hospital staff has seen my boobs. Actually, I could open an OnlyFans when I'm here.\"*  \nThe residentes smiled, the doctor didn't. On the contrary, he became even more tense, abrupt and angry.\n\nWhen I went back to my workplace, I told boss and coworkers what happened. A coworker suggested not to think about it too much, the doctor was probably in a bad mood.  \nBut boss said I was an a-hole, because the doctor wanted to be courteous and protect my privacy, then he was right to get mad at the resident because they have to learn what to do without constant inputs, and that with my joke I undermined the doctor's authority in front of the residents.\n\nI just wanted to ease the tension, but maybe my boss is right? AITA for making a joke?",
  "id": 1,
  "comments": [
    {
      "score": 64,
      "content": "NAH, your boobs your jokes but the doctor was only doing his job, he has to teach the interns and they need to learn the right way because they may not always see someone as confident in their body as you .",
      "id": 2,
      "comments": [
        {
          "score": 1,
          "content": "Yup.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "[removed]",
          "id": 4,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 39,
      "content": "NAH it's the doc's responsibility to make sure the interns understand and follow procedure. You didn't do anything wrong here.\n\nFor the record, humour is how I cope with invasive, painful, or humiliating medical procedures. It's how a lot of people cope. It's normal. In context, that joke made me laugh. If we can't laugh, we've lost the plot.",
      "id": 5,
      "comments": [
        {
          "score": 14,
          "content": "I totally agree with you, humor will save our lives.Since I discovered that I have cancer, I have obviously had many checkups, even non-breast related. For example, I had a dermatological visit to check the moles and the doctor was there with four residents (it's a teaching hospital, so there are residents everywhere), and he asked me if I was okay with so many people in the examination room. I replied, \"Yeah sure, but next time we charge the entrance fee.\"That time everyone laughed, including the doctor.",
          "id": 6,
          "comments": [
            {
              "score": 5,
              "content": "OP, you're awesome.",
              "id": 7,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "This is more or less how I deal with these situations. Both for my sanity, and because treating someone who doesn't cause tension makes things easier and go more smoothly for everyone. I'd rather the staff laugh along with me than be put on edge by me, if that makes sense?\n\nRecently had a big cancer scare and some really unfun and painful procedures. Turned out not to be cancer, but to be something they'd never seen before lol\n\nIt was, well, excruciatingly painful and I couldn't be given anesthetics.. The surgical theatre was pretty full of chuckles, even after I nearly passed out when I stood up- 'it's ok, I promise if I pass out I'll make sure not to land on any expensive equipment or damage the floor with my head, it's all good\". Surgeon laughing, nurse kind of alarmed, other staff just snickering. That's how you want to leave a painful experience if you can. I'd rather laugh than cry.",
              "id": 8,
              "comments": [
                {
                  "score": 3,
                  "content": "Your joke was awesome 😆",
                  "id": 9,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Here's to bad jokes and staying in remission (:",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "NTA.  Look, you're beating that bastard, Cancer, so I'd say you've earned the right to make jokes about it.  Hell, I thought it was actually funny.  Keep laughing, and with material like that, let us know when you'll be making your debut in Stand-up comedy.",
      "id": 11,
      "comments": [
        {
          "score": 9,
          "content": "Thank you ♥\n\nAside from this little incident, the visit went well, the breast ultrasound didn't detect any new neoplasms and the tumor markers in my blood are within normal parameters, so I hope to kick the bastard out of my life forever.",
          "id": 12,
          "comments": [
            {
              "score": 4,
              "content": "Hell yeah! Kick that cancer to the curb!",
              "id": 13,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Rock and roll!  You're my kind of people!",
              "id": 14,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "NAH. You were ok with the situation but the next patient might not be. The DR gave training and it sounds like this wasn’t the first careless mistake on the residents part.",
      "id": 15,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 8,
      "content": "NTA if the doc has a problem with his colleagues that’s something to be discussed outside of the patient.\n\nYou were the one “at risk”, so by making a joke of it you showed you didn’t care, so that should have been the end of it",
      "id": 16,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "NTA. The doctor wasn't wring for snapping at the intern (provided it wasn't too harsh), and you weren't wrong for making a joke. As the patient, it's your experience that is paramount and if you needed to break the tension to feel more comfortable, then you should do that. If the doctor feels like his authority was undermined then that's on them, tbh. Creating a comfortable environment for patients is an important skill and he could have just smiled and said, \"maybe but patient privacy should always come first\", and the point would have been made.",
      "id": 17,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NAH, but the doctor wasn't really wrong. I know you wanted to diffuse the situation, but he correct message wasn't that it was okay.",
      "id": 18,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "NTA. I make jokes all the time, myself.",
      "id": 19,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA\n\nYour boss wasnt there, the doc might have had some other grudge with the residents. \n\nI made an entirely inappropriate joke to my doctor doing IVF and he was dying - and finally fell about laughing.  his observation once we both stopped giggling was that I had a healthy sense of humour in the face of the BS and thanks for treating him as a human being. \n\nWhich is EXACTLY what you have shown by cracking the joke.  Maybe your Doc has the God complex",
      "id": 20,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA - The doctor probably had no problem with your joke he was just annoyed with the resident. It’s possible he didn’t even hear you because he was focused on his annoyance and just saw the resident smile which soured him even more. Either way a lot of people make jokes around doctors because it helps them to relax so most doctors are used to it and many even encourage it. You just caught this guy on a bad day.",
      "id": 21,
      "comments": [],
      "relation": "Support"
    }
  ]
}