{
  "post content": "So, to celebrate my son’s graduation and with most people around here being vaccinated I took the family to the local hibachi for some dinner.  \n\nMy family of four sits down and soon we are joined by another family of four.  They are nice enough and when the time comes to order, the father says that one of his daughters has a dairy allergy and asks that her food be made without butter.  The waitress says “No problem, we will make everyone’s without butter”.   The father says, her allergy isn’t that serious and as long as her serving has no dairy, it should be fine.  The waitress repeats “We will make all the food at the table without butter”.  I say that we would like butter with ours.  She replies “Sorry, at hibachi we make all of the food together and we cannot risk her getting sick so all of the food needs to be made without butter”.  \n\nI reply that we are not even together.  Plus, I say you can make her food in the back.  There is no rule that the food needs to be made together.  The father agrees with me and says they do it all the time.  At this point, the waitress says they are very busy and they can’t do that.  So I got up and said we are leaving because someone else’s allergy should not affect my dining experience. Then we went to a different hibachi restaurant 10 minutes away.  My wife says that I was an a-hole because I ruined my son’s graduation dinner and I should have been more thoughtful to the girl’s needs.  Plus, now the other restaurant has lost a reservation.  My point is that the girl’s needs could have been met in other ways by the restaurant.  Plus, my son likes his butter.",
  "id": 1,
  "comments": [
    {
      "score": 17467,
      "content": "NTA. Even the father agreed with you. The staff were just avoiding having to do two lots of cooking.",
      "id": 2,
      "comments": [
        {
          "score": 4243,
          "content": "Yeah, considering the hibachi place wasn't overcrowded, it wouldn't have been *too* much of a strain to accommodate both families' needs.\n\nEspecially with the mutual agreement, I'm going for  a straight NTA too.",
          "id": 3,
          "comments": [
            {
              "score": 4407,
              "content": "ESH, after more info below.\n\nAgreed here...but I can't help but wonder what the son was thinking about his dad making them leave during his celebration. \n\nAt that age especially, I'd rather have had food w/o butter than my parent throwing a fit and making us leave, find a new place, wait longer for dinner, etc. It sounds like this is way more about dad wanting his butter than any consideration for the son.\n\nEdit: OP mentions below that he asked the son \"if he minded\" leaving, but didn't tell us the kid's response...and that's really a loaded way to ask it in the first place. I think that tells us a lot - it's definitely all about the dad here. Seems like everyone is shitty except the other parent and daughter.\n\nEdit 2: Thanks for the awards, kind redditors!",
              "id": 4,
              "comments": [
                {
                  "score": 2000,
                  "content": "Agree with this.  As the daughter of someone who would pull stunts like this frequently, I can assure you that his son’s night was probably ruined.  Probably the other family’s too who probably felt guilty about the whole thing.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 901,
                      "content": "Who said he threw a fit?  You can disagree without a scene.  You can also leave without a scene.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 287,
                      "content": "On the other hand, as someone with food restrictions, I would feel awful if a restaurant tried to change everyone's food because of me and absolutely wouldn't blame another family for leaving if they refused to just cook mine separately.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 225,
                      "content": "Also the daughter of someone like this.... Answering that I did, in fact, mind was a HUGE no. So even if asked I would have said I didn't mind.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 69,
                      "content": "It wasn't ruined. They went ten minutes away and there was apparently no scene. The wait staff was acting inappropriately and not even listening to the allergy dad. Like who does that?",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "It was hardly a stunt. He ordered food on the menu. He had every right to receive food on the menu.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "You can’t assure anything. You don’t know them at all.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 311,
                  "content": "I can’t eat any kind of meat so my food is always separate but I’d be irritated if a restaurant changed everyone else’s food because of me.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 199,
                      "content": "can you imagine how people would react if the restaurant told people they all had to have vegetarian entrées because some stranger didn’t eat meat?",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 124,
                      "content": "Same. I’m also allergic to some fruits and would be so upset if a restaurant’s staff was trying to remove my allergens from other people’s food for any reason. People with allergies deserve to be treated with the same respect as everyone else, but that should include compromise where possible...changing everyone’s food would stress me out and make me feel awful. It’s not a compromise at all.\n\nRemoving butter can also change the flavor profile of some dishes to a point where it’s not what was being craved in the first place. It’s like giving someone a Beyond Burger when they order a beef burger and expecting them to just accept it.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 63,
                      "content": "Yes, my adult children have some food allergies and we'd never even go to a place like this if it was going to be an issue.  The other family knew they'd be asking for accommodations, so they should have had their own table as the restaurant cooking style is not personalized.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 187,
                  "content": "Op said his son wanted butter. Unless you’re talking about a different comment...Op stated he asked his son if he minded leaving AND his son had said he wanted butter when it was initially brought up that the food would be changed to accommodate one person.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 145,
                      "content": "No, don't you get it, because of the imaginary picture of OP's son that some random asshole on the internet has conjured up, OP is now the asshole for his sins.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "I read it twice to be sure and the OP’s son never says anything. The OP adds at the end that his son “likes” butter but he was apparently never consulted over whether it was worth making a big scene about it.",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 124,
                  "content": "Gotta hard disagree with the ESH. The child's dad specifically did **not** expect OP's family to have their food prepared with no butter. He was completely reasonable. And a light TA to OP, but hardcore TA to the restaurant.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 55,
                      "content": "Would have loved if this story ended with all 8 of them going to the other nearby hibachi place and the 7 that were able being drowned in butter and the families enjoying each other's company so much that they made plans to do it again.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 121,
                  "content": "OP also says that his son wanted butter so not sure how you’re getting ESH out of this.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 102,
                      "content": "Projection.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 115,
                  "content": "So if I go to a restaurant and someone at another table is allergic to gluten is it ok for the restaurant to make us all eat gluten free? This is not ok for a restaurant to make everyone suffer for one person. I would’ve left as well.",
                  "id": 23,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 99,
                  "content": "I get your point but there is no evidence that OP \"threw a fit.\" Disagreeing and firmly stating, even arguing, an opposing opinion isn't asshole-ish! \n\nYes, people can be entitled brats, but asking for what you're paying for in a business shouldn't automatically be seen as being a \"karen\" (which is super deserved in some cases but wayyy over-used.)",
                  "id": 24,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 93,
                  "content": ">At that age especially, I'd rather have had food w/o butter than my parent throwing a fit and making us leave, find a new place, wait longer for dinner, etc.\n\nEh, I'd rather have a good meal.  Besides, he didn't throw a fit.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 73,
                  "content": "Didn’t sound like OP threw a fit. The special request should have been prepared in the back. Throwing a fit would have been getting loud and drawing attention to the situation. Demands of “let me speak to the manager!!”  Being irate. They could not accommodate OP and his family so they left. Yes, they lost the reservation, but now they can cook the special request in the back.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "Honestly it would suck to pay for food you know you don’t like.  My mom always makes a scene whenever we go out, but this dude doesn’t seem like he is making a scene.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 146,
          "content": "How can they be certain there wouldn’t be any residual butter already on the grill? Do they clean it that thoroughly after every serving? You’d think the restaurant would make her meal in the back to avoid any cross-contamination and potential liability if the child *did* have an allergic reaction. Granted, the child’s dad said it was a minor allergy, but still…",
          "id": 28,
          "comments": [
            {
              "score": 62,
              "content": "You cook it on a piece of foil, or in a pan in the back.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "Yes they do clean it that thoroughly. Right after serving they pour water on the still hot surface and thoroughly scrape and clean it. It's stainless steel so easy to clean like that.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Honestly we loved hibachi and my sister has a bad allergy to shell fish. My dad always ordered the shrimp and if you mention the allergy they still where able to cook them in front of people and keep them separate (usually did her chicken first). Never had an issue with cross contamination. They cleaned them well enough for her never to have had a reaction.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 82,
          "content": "My first reaction to this post was, since when does Japanese food have dairy? I haven’t been to a hibachi grill, but that’s apparently high heat cooking. Butter has a low smoke point, you don’t cook with it on high heat it just wrecks the flavor. So it would be at most something added after cooking like in a sauce. So it is absolutely possible to put separate sauces on each family’s food without substantial inconvenience to the restaurant.",
          "id": 32,
          "comments": [
            {
              "score": 65,
              "content": "Yeah I’m honestly baffled by all the “WELL ITS NOT HIBACHI IF THERES NO BUTTER” comments like… they use oil in hibachi. Wtf.",
              "id": 33,
              "comments": [
                {
                  "score": 48,
                  "content": "A lot of hibachi places use butter. I don't think I've ever been to one where they didn't use butter and oil.",
                  "id": 34,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "I googled it and apparently Benihana garlic butter is a thing. But that still shouldn’t be getting applied until towards the end of the food cooking.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Yes but there's a ton of it, and you'd taste the difference if it wasn't there. It was used on everything in vast quantities.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Yeah, I'm so confused by this. What would they even use the butter for?",
              "id": 37,
              "comments": [
                {
                  "score": 61,
                  "content": "In every hibachi grill I've been to, they use butter to cook the rice, veggies, and meat. and not a little bit",
                  "id": 38,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Same with the one we go to. They bring out a big ass mound of it (like honestly possibly a foot high) and slice off what they want before dumping it on the grill. Every part of the meal gets some, and as you say not a little.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yeah that confused me too, why is there so much butter? I've never been to American hubatchi but I've been to plenty of teppanyaki restaurants in a few countries & I've never seen butter?",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "This would be the case with a wok. A hibachi is a bit more forgiving.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "It’s a Hibachi! They do it all together on the same grill! You’d have to deep clean between each meal which would take longer.",
          "id": 42,
          "comments": [
            {
              "score": 122,
              "content": "Chef didn't have simple problem-solving skills, for sure. Why not cook the no butter meal first while everyone is eating their salads and their shitty onion soup?  Girl is happy. No butter. She gets her food a shade earlier than the rest of table. No big deal. Quick scrape of the hot grill, use butter, do the whole dog and pony show like normal. Everyone gets fed, problem solved, meal is five minutes longer.",
              "id": 43,
              "comments": [
                {
                  "score": 77,
                  "content": "My son is allergic to shrimp. We go to hibachi all the time.  They cook the shrimp first, appetizer and meals, clean the grill, then cook the rest of the food.  It’s never been a problem, with other people who weren’t with us, they just got their shrimp part of their meals first, too, and were fine with it.  If we had a dairy issue, we would expect them to cook that person’s in back, as everyone agrees is sensible.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "Yeah, my bf and I had hibachi yesterday and a lady at our table but in a separate group didn’t want butter in her stuff and they kept hers off the the side and the rest of ours was made with butter. There was no issue. The restaurant was just being lazy it seems.",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "plus, i mean hibachi without butter? What is the point",
          "id": 46,
          "comments": [
            {
              "score": 5,
              "content": "When do they ever use butter in quasi-Japanese cuisine? Bizarre",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "This-the father of the kid even pointed out they prepare butter free food separately all the time.  If anything the staff were the AH’s here.",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I have a shellfish and fish allergy and they have no issue with cooking me food off to the side…. Like they still do the whole theatrics with mine, they either cook it first or on a separate area… I’ve never had an issue. (I also live in the California Bay Area though, so maybe that has to do with it?)",
          "id": 49,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3370,
      "content": "NTA.  The only AH here is the waitress.  The father of the other family was fine with all the suggestions you gave. \n\nI say you should also follow up with the restaurants through social media or phone or email.",
      "id": 50,
      "comments": [
        {
          "score": 1349,
          "content": "The waitress isn't ta. She can't do shit about the kitchen's rules or the manager's rules.",
          "id": 51,
          "comments": [
            {
              "score": 711,
              "content": "Well. The kitchen/manager rules lost a bunch of money for the restaurant. I think it seems like she didn't want to tell the kitchen they had to cook a separate meal, for whatever reason. Or she just thought this was better. But it is NOT standard practice to change everyone's meal just because one person needs something else",
              "id": 52,
              "comments": [
                {
                  "score": 450,
                  "content": "I can’t have any kind of meat for health reasons and my food is always separate but I’d be angry that the restaurant tried to change everyone’s food because of me. That’s not fair to anyone.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 89,
                      "content": "I've always been accommodated for avoiding meat by them making mine first or last (after cleaning the grill) or in the back.  It's literally never been an issue, with the exception of once a guy was mad they waited an extra 2 minutes until the veggies were done instead of cooking his steak at the same time.",
                      "id": 54,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 95,
                  "content": "> The kitchen/manager rules lost a bunch of money for the restaurant\n\nA table of four isn’t going to make or break a restaurant. I highly doubt they really care about that table walking out.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 60,
                      "content": "Yes but the restaurant now has two upset families, possibly 3.  OP whose family left and the other family who was fine with the daughter’s food being made in the back.  Now they have to wait for another family or party of 4 to take OP’s family’s place and now that family has to have food cooked missing an ingredient and may not want that either.  The only option the restaurant has is not seating anyone else with them.  \n\nAnd most hibachi places have 10-12 seats around the table and not just 8 so it was really in their best interest to just make her food in the back.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 75,
                  "content": "I've known chefs who dgaf about losing a table when the table demanded something the kitchen/chef have already said no to. That the waiters might be very well aware of without having to ask yet again.\n\nChefs often tend to be conceited/proud or just stubborn.\n\nBut I'm also unfamiliar with the type of restaurant in the story, it's so weird to me that strangers have to be together.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 100,
                      "content": "Hibachi involves a large flat iron grill with people seating around it. Different parties seated together is typically the norm.  \n With that said, there should be enough room on the grill to accommodate butter/no butter cooking",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 68,
                      "content": ">\tBut I’m also unfamiliar with the type of restaurant in the story, it’s so weird to me that strangers have to be together.\n\n\"If you're not familiar with Japanese Hibachi or teppanyaki, imagine sitting around a large, hot hibachi grill where a chef is standing in the center, cooking a dinner made up of meat or seafood, fresh vegetables, and rice\"\n\nThe grill is as big as a small table, limiting the number you can fit into a restaurant, so they will group smaller parties at the same grill. They also do tricks while cooking so it's time and personnel intensive enough that they can't give every party their very own grill.",
                      "id": 59,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 39,
                      "content": "I might add, if you’ve never done Hibachi (or teppanyaki as some places call it) you should try it at least once in your life.\n\nWhile alittle more pricy than your standard restauran, it involves the grill master telling jokes and entertaining the surrounding guests. Juggling salt and pepper shakers, catching shrimp pieces with their chef hat, Igniting flaming onion volcano, it’s all fun to watch. Not to mention your food is literally cooked infront of you and you get it fresh af",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I was going to say the same thing. When I was a waitress, I worked with some very scary chefs who absolutely did not GAF about what the customer said, as long as the chef felt everything was done the way it should be. They would scream/swear at the waitstaff over any little thing. I have seen servers get blamed for things that are not their fault too many times to count.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "As a chef, this has not been my experience with the overwhelming majority of chefs.",
                      "id": 62,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": ">But it is NOT standard practice to change everyone's meal just because one person needs something else\n\nEspecially if \"one person\" is not even part of your group.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Even when cooked on the same stovetop, with the same utensils? There is no way to ensure no cross contamination and if she gets sick, the dad would blame them",
                  "id": 64,
                  "comments": [
                    {
                      "score": 65,
                      "content": "That's why the suggestion was made to cook the daughter's portion *separately* in the back.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "In most restaurants no, but isn't a point of this restaurant that everyone's food is cooked together?",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 106,
              "content": "I had 14 food allergies for about 7 years I went to a hibachi restaurant multiple times during those 7 years. It was standard practice to cook my food separately in the back op is nta and I have a feeling something sketchy was going on with the waitress",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 89,
              "content": "If she didn't even check with the kitchen or a manager then she is TA.  If she made the decision herself instead of asking the chef who probably wouldn't have minded then she is to blame for this.",
              "id": 68,
              "comments": [
                {
                  "score": 77,
                  "content": "OR guess what, she's encountered this situation multiple times before and she knows what the chef will say.\n\nSource: I've been a waitress and have been asked to ask the kitchen about something I already knew (multiple times) the answer to.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Then you say \"let me go ask the kitchen,\" walk away to fuck off for a couple of minutes, then go back to the table and blame the kitchen. Otherwise, you just look like a shit ass, lazy server to the customer.\n\nThat's basic customer service skills lol\n\nI'm an ex-retail manager of 20 years and I told my employees to do this when customers would ask something that they knew I wouldn't override. It's my job to be the bad guy, not them. This server made herself look like the bad guy to the customer.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Except the father of the girl said they did it all the time. The waitress just said they were too busy, which wasn't necessarily a call she could make without asking the chef first.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "Unless the waitress was VERY new to this job, I'm sure she's encountered a customer with allergies before. That's assuming that the restaurant doesn't y'know, explain their policy to servers.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 46,
              "content": "The father of the other family said their food had been made in the back before on other occasions. It's clearly not some sort of kitchen or manager policy. And if it was, she could have said so. This stinks of not wanting to go out of her way to do extra work.",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 34,
              "content": "No, the waitress is TA because she could've checked with the manager before they decided to leave.",
              "id": 74,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Didn't sound like it was a rule in fact the other father said that had done it before. She didn't go and ask the chef, who probably wouldn't of had a problem with it.",
              "id": 75,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Sounds a lot more like she was making the rules up herself, considering she never even asked the kitchen. It would be really odd to compromise service like that instead of prepping a seperate meal.",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Every hibachi place I’ve ever been to has a dining area separate from the hibachi tables as well. You can still have hibachi off the menu and they just cook it in the kitchen like a regular meal. There is no reason they could accommodate that for non-hibachi tables and not one extra meal for a hibachi table. The waitress didn’t want to do it. Plain and simple. We’ve gone to hibachi dinners at the cooking table when a person in our group had a severe dairy allergy and they happily made her food in the kitchen and served it plated with zero issue.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "That's assuming she was right (and/or truthful). I've seen a fair number of people misinterpret the rules or take it upon themselves to make decisions that they really don't have the authority to make. (Especially given how bad this rule is, it really could be a single person's bad interpretation vs. crazy management.)\n\nI would give her the benefit of the doubt if I was OP, but just wanted to point out that she *could* be the AH -- we don't know.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "She can go ask. I've worked in food service before, even at our busiest, we were never told \"Don't do this because we are too busy\".",
              "id": 79,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 62,
          "content": "Don’t kill the messenger. Most likely the waitress was just repeating the directions she got from management. A waitress doesn’t have that level of authority. The restaurant was only CYA the easy way.",
          "id": 80,
          "comments": [
            {
              "score": 7,
              "content": "Yeah but doesn't hurt in any way for the waitress to ask her manager or to simply kick the conversation up the ladder she was just being lazy I work at a restaurant and my manager never gets angry when I have to ask a question because a customer insists on it",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1867,
      "content": "NTA,  it's standard to cook only the person w the allergies food separately, why sound everyone be punished and pay for something they don't want.",
      "id": 82,
      "comments": [
        {
          "score": 652,
          "content": "My mom has a severe shrimp allergy and we go to hibachi places all the time. The staff will usually make her whole meal first and then work on everyone else's food. It's never a big deal, just weird that my mom gets all her food first lol.",
          "id": 83,
          "comments": [
            {
              "score": 155,
              "content": "It’s a lot easier to avoid cross contamination if you cook the food that can’t be mixed with anything else first. Ingredients people are allergic too have a way of sneaking around being cleaned all the way off the grill top.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Because the shrimp would normally cook before everything as an appetizer. Cooking the shrimp first contaminates everything after with shellfish which is a rather common allergy. \n\nThey dont fully clean the grill until after the meal so things are clean between meals but during one meal all the food contaminates what is cooked after... that is why they cook chicken at the absolute end.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "Exactly. It’s like in a different restaurant where all the food is cooked on one grill and saying the entire restaurant has to have their meals made without butter because one person is allergic to it.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 970,
      "content": "NTA. Even the father agreed with you. Sounds like the waitress didn't want to be bothered.",
      "id": 87,
      "comments": [
        {
          "score": 780,
          "content": "As a waitress who has occasionally blamed the kitchen for my own mistakes, this is entirely on the kitchen.",
          "id": 88,
          "comments": [
            {
              "score": 84,
              "content": "You just made me giggle out loud in a public place.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "My favorite excuse when the kitchen was taking too long was that they dropped the food. It always worked, especially on busy nights.",
              "id": 90,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Nothing better than blaming the system when it’s my own mistake",
              "id": 91,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "OPs wife ITA. OP was totally justified.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 567,
      "content": "NTA - The cook there handled that very poorly if they think EVERYONE should have to be made to cater to the one person with allergies and she just didn't want to deal with it by making a separate trip.  You had a right to ask for your food to be made correctly just as much as they had a right to ask for their kids to be made separately.",
      "id": 93,
      "comments": [
        {
          "score": 114,
          "content": "I think it was the waitress blaming the kitchen for something she didnt feel like dealing with.",
          "id": 94,
          "comments": [
            {
              "score": 49,
              "content": "Have you ever worked as a waitress??? That’s most definitely not the case here. She probably knew what the kitchen would say already.",
              "id": 95,
              "comments": [
                {
                  "score": 48,
                  "content": "I am a server and I don’t see this as “most definitely” *anything*. How long did you work as a waitress that you never saw a lazy one?",
                  "id": 96,
                  "comments": [
                    {
                      "score": 11,
                      "content": "LMAO. As an ex-waiter, I agree. There are plenty of times waiters just brush things off as establishment rules or that the kitchen is too busy to accommodate because they don’t want to deal with it. Too many people watch Hell’s Kitchen and think all chefs are like that when in reality most chefs are happy to accommodate. \n\nIn all the places I’ve worked, the chefs were happy to get a change of pace and alter their dishes.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "i've worked many restaurant positions, that is most definitely the case. I could give two shits what the kichen would say, this is a god damn allergy. the kitchen can bitch and whine all they want, doesn't change the fact that the daughter of the family has an allergy, and having both families suffer because you can't come up with a good conclusion or compromise means someone is doing a shit job, and situations like this I would go out of my way to do everything I can to make sure everyone know who is at fault.",
                  "id": 98,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "If you have allergies and you hear the restaurant say this kind of shit, you should probably leave as this restaurant can't manage allergies. \n\nSaying \"everyone has to have it with or without butter!\" Implies they have very limited facilities, that are *not seperate*. This just screams cross contamination. They should absolutely be able to produce their normal food and the allergen free food at the same time, if they cant they're simply just not using the ingredient while using tools that have cooked with them countless times before. You do that shit with serious allergies and youee gonna hurt someone.",
          "id": 99,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 498,
      "content": "INFO: Did you ask your son if he wanted to leave?",
      "id": 100,
      "comments": [
        {
          "score": 399,
          "content": "I asked if he minded if we went somewhere else.  He mentioned earlier that he wanted butter in his.",
          "id": 101,
          "comments": [
            {
              "score": 607,
              "content": "Reply. This sounds odd. Did he really say earlier- I am so looking forward to butter with my dinner?",
              "id": 102,
              "comments": [
                {
                  "score": 736,
                  "content": "When the waitress said that nobody would get butter, he said that he wanted butter.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 121,
                      "content": "Ok. Gotcha.",
                      "id": 104,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 103,
                      "content": "So if I'm reading this correctly, the conversation was:\n\n\nWaitress: No butter for the table\n\nOP: Seriously, that's absurd\n\nOP: Son, do you want butter?\n\nSon: Yeah, I would\n\n<a bunch of arguing with Dads and stubborn waiter>\n\nOP: Son, would you mind if we leave?\n\nSon: Yeah, that's fine.\n\n\nLater\nWife: You made a huge scene and ruined our son's graduation dinner.\n\nAssuming that's a reasonably accurate reconstruction of the scene, I think your wife is correct",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Butter is a crucial ingredient to Benihana's (we are talking about Benihana, right?) fried rice.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 156,
              "content": "So...did he not want to leave? That's avoiding the question. \n\nAsking, \"Do you mind if we leave?\" (as a person of authority in the situation) is different than asking if he wants to.",
              "id": 107,
              "comments": [
                {
                  "score": 137,
                  "content": "Yeah I’m raising an eyebrow at the lack of a direct answer. The son wanted butter, but did he want butter more than he didn’t want to leave? It can be supremely awkward when your parent makes a scene, especially when its “for your benefit” and you don’t actually care that much.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 49,
                      "content": "As someone who’s father has made many of scenes, I would have rather just stayed at the restaurant and not have the hassle of dad complaining about the waitress for the rest of the night. Gosh, can you imagine OP going on and on about the employee on the drive over to the other restaurant? My dad would freak out and my shoulders would get all tense 😬 and I wouldn’t say anything because If I did he would just get more mad.\n\nWhy didn’t they ask for the manager? \n\nIt’s weird that OP is very unclear about what the other family members said and if they actually wanted to leave. He wasn’t really answering the question.",
                      "id": 109,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 26,
                      "content": "I mean it was apparently 10 minutes to the next one, not a giant issue imo",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "He probably kind of wanted butter but didn't want to make a big deal out of it and probably wouldn't have said that he wanted to leave if asked directly.  OP sounds like classic angry dadsplaining.  I could be wrong, but that's what it sounds like.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 132,
              "content": "That statement covers everything from\n\n“I want butter and would like to go to another restaurant so I can have it”\n\nto\n\n“I’m so embarrassed by the stink my dad is making that I have no objection to leaving”\n\nto\n\n“If you care about me eating butter so much i guess we can go elsewhere ”\n\nOne of those things makes you an asshole. So which degree of being okay with going elsewhere is it?",
              "id": 112,
              "comments": [
                {
                  "score": 14,
                  "content": "Yeah you got it exactly.\n\nIt’s entirely possible he totally wanted to leave.\n\nBut asking him if he minded leaving wasn’t really a good question. That feels like “I want to leave but want to get token approval from my son for appearance’s sake”. It could happen that their interests align, but a better question is asking the son if he’d like to stay or leave directly. Could still be susceptible to pressure but would at least help, that’s the best way to ask anyway.\n\nBut if OP is as overbearing as he sounds, then he also likely won’t be discerning enough to answer this question. Of course I’m biased, this is totally something my dad would do and everyone else would begrudgingly go along with even if we hated the whole thing.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 38,
              "content": "Why not move to another table?",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "And what did he say? Did he say he minded, that he was ok with it? Seems weird your wife would accuse you of ruining his dinner if he was eager to leave, too.",
              "id": 115,
              "comments": [
                {
                  "score": 3,
                  "content": "The only way the wife’s reaction would be justified is if the kid didn’t want to leave, but said sure because his dad was on a war path and he just wanted it to end or to appease his dad or not risk his wrath by saying he wanted to stay.\n\nOf course, it’s also possible the wife just wanted to stay while they both wanted to leave.\n\nIt’s one of those things you’ll never know unless the son came on here to tell his side. ¯\\\\\\_(ツ)_/¯ I am curious, but alas.",
                  "id": 116,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 452,
      "content": "YTA. it was not nearly serious enough for you to leave the restaurant, one meal without butter wouldnt have killed you. was it important to your kid that his meal have butter, or to you? it was his graduation celebration and you threw a fit and made it all about you.",
      "id": 117,
      "comments": [
        {
          "score": 321,
          "content": "Right? Who the fuck makes butter their deal-breaker, especially with Asian food?",
          "id": 118,
          "comments": [
            {
              "score": 255,
              "content": "The whole time I’ve been reading this thread, I’ve been trying to work out where butter comes into the picture at a hibachi place.\n\nEdit: I’ve been informed several times that they cook with a metric shit ton of butter at Hibachi places, I believe y’all, and am now hungry",
              "id": 119,
              "comments": [
                {
                  "score": 134,
                  "content": "While I don’t really have an opinion on the dad’s actions, hibachi places use a metric fuckton of butter. Every place I’ve been to they keep a giant loaf of it on the cart with the rest of the food and cut off giant chunks of it to cook damn near everything. There’s a reason the food is so good.",
                  "id": 120,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Cool cool. I haven’t been to one in years and I guess I misremembered them using mostly oil. Or maybe I just haven’t been to a good one lol",
                      "id": 121,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 40,
                  "content": "Have you been to a hibachi place? They use sooo much butter when making the meals.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 37,
                      "content": "The ones I go to use oil. Shrug.",
                      "id": 123,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 187,
          "content": "This feels like a classic case of OP telling us exactly enough of the story to make them seem reasonable.\n\nIt might be a touch disappointing if a restaurant normally used one oil but used another because of someone you didn't choose to dine with but it's a minor thing. Most people would be over it in a second.\n\nI suspect OP felt enough like an asshole to make this post because their family were all willing to let it go for the sake of a good night in the restaurant and OP unilaterally decided this was worth a fight and a change of restaurant.",
          "id": 124,
          "comments": [
            {
              "score": 7,
              "content": "I fell like technically OP isn't an asshole but i am pretty sure that he fucked up reading the room when he decided for his family to leave the restaurant.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 118,
          "content": "I can’t believe so many people are agreeing with OP here. He is a total asshole in this situation and made a big deal about something that didn’t even matter. Not to mention that part of the fun of hibachi is eating with other people. GTFO with this “we’re not even together” BS.",
          "id": 126,
          "comments": [
            {
              "score": 38,
              "content": "He probably embarrassed the hell out of the girl with the allergy, as well, poor thing. \n\nShe’s got to be absolutely mortified, and she’s probably blaming herself for them leaving.",
              "id": 127,
              "comments": [
                {
                  "score": 7,
                  "content": "That's probably my #1 reason why OP is a gigantic arsehole.  Having a different sort diet is tough enough without people backhandedly insulting it. \n\nThe fact he wasted everyone else's time too is the #2 reason.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "AITA should really change its name to \"Was this thing I did technically illegal?\"\n\nEveryone's like \"it's your right to leave the restaurant so NTA\" but like Jesus a bit of whatever oil they use instead of butter isn't gonna kill you. I'm inclined to believe that OP is the type of person to constantly be making fusses whenever the tiniest thing doesn't go exactly their way. Like sometimes a cafe that I might go to won't have a diet version of their soda and I'd prefer to have a diet version but if they don't have it I'm not going to inconvenience everyone in my party by upping them to a different restaurant. I'll just go with the flow and get something else to drink.\n\nI think that the wife is correct, Op decided to take his son to a shared dining experience and could have been a little thoughtful about their dinner partners. Like he said the other father was being supportive of Op but Op couldn't return that gesture by just having the absolute smallest modicum of chill.",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 72,
          "content": "I can’t believe I had to scroll this far down to see a YTA. OP’s entitlement is astounding and has no awareness. The waitress made it pretty clear they were busy and has no control over the kitchen management. And anyone saying “well they just lost a lot of money” ok? Bye. It’s butter, who cares?",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "Agreed. I'm sure he wouldn't be able to tell the diffrence of a whatever butter replacement they use. Almost no one could. But even if he could why is it dads vote the only one that matters. \n\nO no he can't get the dish perfectly right. I guess he should drag his protesting family out and go were he wants. Fuck what the graduating kid or his wife thinks. It's the princable of the matter. /s",
          "id": 131,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 52,
          "content": "THANK YOU. Their wife is probably correct in her assessment here. This isn’t even a justified AH situation - restaurants have to be serious about food allergies. \n\nDo Hibachi restaurants typically make food orders “in back?” I’ve never experienced this.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "I genuinely cannot fathom OP's reaction. It's fucking hibachi. It's made together/right next to each other. It's prepared together. It's totally reasonable for a restaurant to try to avoid causing an allergic reaction, particularly for fucking hibachi. \n\nYou're well within your rights to leave. But, going to hibachi - where you know you are going to eat with other people - and declaring \"other peoples allergies shouldn't affect \\*me\\*\" is really pushing it. Demanding you make \\*another patrons\\* food in the back is also ridiculous. I don't understand how OP cannot fathom that those two points make him an asshole. It sucks they couldn't to butter for your food, bro, but you can't just tell the restaurant what to do when they need to minimize liability.",
          "id": 133,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 33,
          "content": "Not many people are focused on how it made the child with allergies feel. I bet this made them hate their condition even more. OP had a real opportunity to make someone feel included and decided to be selfish and petty.",
          "id": 134,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "Agreed. Pathetic self control.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Agree. Feel bad for the daughter who has the allergy. She must have felt pretty small. Hopefully her night wasn't ruined.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 244,
      "content": "NAH.    \n\n\nHonestly if you're dealing with food allergies, a hibachi is not a great place to take your kid, but the parents weren't assholes, and were fine as long as their kid's allergy was respected.    \n\n\nYou shouldn't have to have the substance of your meal altered to accommodate a stranger's allergy who isn't part of your dinner party.     \n\n\nThe restaurant's position is one of very conservative caution and I can appreciate that ESPECIALLY as the parent of someone with multiple severe allergies.     \n\n\n  \nThat being said.  What the restaurant SHOULD have done is moved the allergic family to a separate table.   So i guess technically if there's an A judgement call, it's on the restaurant.",
      "id": 137,
      "comments": [
        {
          "score": 80,
          "content": "The restaurant position is one of laziness. They wanted to make a single batch with everything for the table.",
          "id": 138,
          "comments": [
            {
              "score": 25,
              "content": "They wouldn't be able to do that without completely cleaning and sterilizing the hibachi between the meals, which would delay the meal considerably.     There's no way to have 'allergen here/no allergen there' any more than there is not have a 'non smoking section' or a 'non peeing section' in a pool.      \n\n\nNow this kid was probably not sensitive enough to dairy to worry about cross contam, but for someone with a cross contam allergy, yeah, there's just no way to do that.  Restaurant was in the right on that one, just not the way they handled it.",
              "id": 139,
              "comments": [
                {
                  "score": 61,
                  "content": "They literally do it all of the time. I’ve been to hibachi with people who have shrimp allergies",
                  "id": 140,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 41,
                  "content": "No, that's standard practice for a restaurant like this. They maintain a couple small pans for cooking allergy meals and keep ingredients in the back, and then they keep the main grill for non-allergy dishes.",
                  "id": 141,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "And they could not make her meal before the ones of the others? It was suggested by other commenters. Or have it done in the kitchen?",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "Hibachis always make my food first or on the opposite side of the table so it doesn’t cook with any meat",
          "id": 143,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 153,
      "content": "YTA. This is what we call making a mountain out of a molehill.",
      "id": 144,
      "comments": [
        {
          "score": 8,
          "content": "Butter is kinda important in making food tho. It certainly makes dishes taste better so I would also object to this. And why should other people have to cater to a random persons needs when it isn't necessary? The girls father even said so. It was purely the restaurant being too lazy to cook her food first and then make the rest after.",
          "id": 145,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 145,
      "content": "NTA - but the waitress was\n\nthe sauce made with the soy and butter is delicious, I wouldn't want hibachi without it either",
      "id": 146,
      "comments": [
        {
          "score": 39,
          "content": "Waitress can only do so much, she doesn’t control the kitchen. The chef/manager are the ah here for their rules because they lost a good amount of money from them walking out.",
          "id": 147,
          "comments": [
            {
              "score": 13,
              "content": "that's just it.. she didn't do anything - the waitress took it upon herself to decide.. she didn't ask anyone (chef or manager) anything",
              "id": 148,
              "comments": [
                {
                  "score": 18,
                  "content": "I mean if it’s a policy then I get why she didn’t ask but who knows.",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}