{
  "post content": "I 24 female, did a last minute favour for friend of mine for his mums wedding,little bit of back story for you.\n\n I love doing photography I always have and I always will. while I was out with my friends I was unexpectedly called by my brother in law, I don’t usually get a call from him so when I saw he was calling I answered and asked if everything was okay.. he had explained the situation about the previous photographer dropping out last minute at 6pm on the NIGHT BEFORE THE WEDDING! and asked me to help and I would be paid by a certain date. \n\nI agreed and travelled 4 hours with my camera and laptop up to this wedding venue to take photos for the bride and groom. \n\nUntil today I found out I’m not being paid till much later in the month.. if not next month, so I sat and had thought about and came to the conclusion that I wouldn’t send any photos \n\nI then explained this to my friend and he was unaware of a date being set for payment and only the amount, until I’d showed him  that part of the conversation we had between each other. \n\nSo now I’ve been called an as*hole for refusing to send any photos over until payment has been made in full by given date but everyone’s already been using my photos quite happily for profile pictures and cover photos from the few I had already sent over, not to mention I’d already been hounded by people for said photos as they needed them asap? I feel the whole situation is about to put a divide between me and my friend when I don’t want it too but am I the Ahole for refusing to send anymore photos until payment has been made or am I over reacting?..",
  "id": 1,
  "comments": [
    {
      "score": 9097,
      "content": "NTA.\n\nI'm wondering it the prior photographer dropped out because the wedding didn't meet a \"payment in full before the event\" clause.",
      "id": 2,
      "comments": [
        {
          "score": 2201,
          "content": "No the photographer dropped out after she couldn’t get insurance on her all her equipment but had months to get the insurance hence why I was called last minute. I’ve only got a camera and two lenses I don’t need that fancy stuff to take a photo but it’s annoyed me as they had a contract drawn up that she signed with half the money upfront whereas I’ve not received anything as of yet..",
          "id": 3,
          "comments": [
            {
              "score": 4536,
              "content": "They’re going to leave you high and dry if you send those photos. You’ll never see that money\n\nEdit: whoops. NTA",
              "id": 4,
              "comments": [
                {
                  "score": 1185,
                  "content": "Send little thumbnails that can't be enlarged. Only send regular photos after full payment.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1328,
                      "content": "with watermarks",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 71,
                      "content": "I wouldn't do this. \n\nThey might decide to make do with the few you have sent already -for free.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 44,
                      "content": "No.  Send nothing.  NTA",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "[removed]",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Must include heavy watermarks. I’ve actually seen people just use the thumbnails and skip payment.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Too much of a risk imo",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "That gives them the opportunity to cherry pick the photos they want and demand a discount because they aren't taking all of them. I'd advise the OP not to send anything. \n\nYeah, and NTA.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 138,
                  "content": "OP do not send those pictures. The moment you do, you can kiss that money goodbye. NTA",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "Exactly this, in their mind they already have paid once (deposit to the original photog, regardless of a refund it was “paid “). They are not going to pay twice. You could consider sending ONLY ONE photo w/ an obnoxious watermark and see if this helps motivate them",
                  "id": 14,
                  "comments": [
                    {
                      "score": 15,
                      "content": "This. In fact, they might think they've already paid for the few they're using and make do with them. \n\nI'm sorry they did this to you.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "And just stop all work on them, because they are probably not going to pay you ever.  At which point the friendship is over and you might as well sue them.  Check your local laws for how.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "You are right they will leave her without a penny",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "I did a photo job for a landscaper.  I made a show booklet .  They took it , with promises to pay.  I never was paid.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "That's exactly it, send the pictures and you will never see a payment \n\nNTA",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "NTA, don’t send them or only send watermarked versions they can’t use. You will not get paid for this otherwise.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 609,
              "content": ">No the photographer dropped out after she couldn’t get insurance on her all her equipment\n\nIs that what the photographer told you, or what the wedding couple told you? Because I have a hard time believing any professional photographer would let their business insurance lapse like that.",
              "id": 21,
              "comments": [
                {
                  "score": 247,
                  "content": "I suspect she would get a very different story by asking the previous photographer instead of the people who are refusing to pay on time",
                  "id": 22,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Yup",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 98,
                  "content": "It’s also not difficult to get the insurance re-setup even if they did (nor is it that expensive).",
                  "id": 24,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I have never insured photography equipment but what does it take? 1 phone call? A day?",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 42,
                  "content": "Yeah that’s bullshit.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "I agree with you 100%. There’s no way this just came up last minute. They didn’t pay and needed a scapegoat.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "That struck me too, and it makes me think that the previous photographer was also not a professional wedding photographer. What's the betting that they were waiting for payment before they bought insurance, and didn't get paid? Unable to get insurance is an acceptable truth from friend stiffing them before OP.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "[removed]",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 240,
              "content": "NTA.  You send those photos before being paid, you're not going to get paid.  You have a product, you don't deliver your product before you get paid.",
              "id": 30,
              "comments": [
                {
                  "score": 36,
                  "content": "[removed]",
                  "id": 31,
                  "comments": [
                    {
                      "score": 3,
                      "content": "If I were you I would still bring my camera and only take pictures of flowers at the venue lol",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "[removed]",
                  "id": 33,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 126,
              "content": "Yeah it sounds like they’ve been taking advantage of you and are going to try to continue to do so. It’s good that you’re refusing to send the photos until you’re paid, and maybe consider taking them to small claims court if they continue to dodge paying you.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 101,
              "content": "No professional photographer would do that. They didn’t pay the last person and this isn’t their first rodeo (unlike you) so they bailed. \n\nYou aren’t getting paid unless you withhold the photos.",
              "id": 35,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 96,
              "content": "Tell them that you get the money in 24 hours or else there's going to be a tragic accident with the delete button.  All the people demanding copies can chip in.",
              "id": 36,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 90,
              "content": "It sounds like they're trying to get a refund from that photographer and are hoping you'll forget about it by then, or will be happy to get the half she sends back.",
              "id": 37,
              "comments": [
                {
                  "score": 16,
                  "content": "This actually sounds very accurate.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 67,
              "content": "Nice how he conveniently forgot about that part of the message. NTA. Don't send any photos until you get your money",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "Or so you were told. I'd be suspicious of these people. It's very dodgy that they are messing you about over payment. People do not do that to friends.",
              "id": 40,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 42,
              "content": "it’s not your responsibility to give them free services with nothing more than a vague idea of when you might be getting paid back. if they want them so bad, they’ll find the money. or sign a legally binding contract with a set date and conditions for failure to pay. should be no big deal since they were already planning on paying you, right? ;)",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 136,
          "content": "Or they tried to haggle on price, or they said, oh we’ll pay you in a couple of weeks, etc. \n\nThese people are almost certainly going to try to stiff OP. They gave her a deposit or whatever, she gave them a few pictures, until payment is received, delivery of product does not need to be complete.\n\nEdit: saw in another reply they haven’t paid her anything. DO NOT GIVE THEM PICTURES. They’re already using your work without payment.",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "This. OP, once you deliver the photos, you'll never see the money. Anyone who texts that isn't the bride, say, \"I'm sorry, but I'm only communicating with the bride, since she's my client.\" Then, block them. Text the bride, \"If you're paying on X date, you'll receive the photos on X date.\"\n\nAnd, moving forward, only show sample photos with your watermark on them.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2330,
      "content": "NTA\n\nyou did this as a favour at short notice and drove 4 hours each way, the least they can do is pay up on time.\n\nStick to your guns no pictures until payment is made in full.",
      "id": 44,
      "comments": [
        {
          "score": 1517,
          "content": "I am gonna be sticking to my guns, because I feel like this might make an example of doesn’t matter who you are payment is to be made in full on the date regardless your relationship to me",
          "id": 45,
          "comments": [
            {
              "score": 577,
              "content": "That's the spirit. And, for future reference, yes, 50% deposit is a must. Protip: make that amount the absolute minimum that covers your time, labor, and costs, then double it. Worst-case scenario, at least your minimum outlay gets covered.",
              "id": 46,
              "comments": [
                {
                  "score": 89,
                  "content": "Yup. Charge double and get 1/2 down. I do it when I am not comfortable with a customer. Usually a good gut feeling and I have been tortured to get the final payment by some of these customers. Better safe than ripped off",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "You also need to factor in edit time, multiplied by how many pictures they want.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 108,
              "content": "Don’t send out any more pics without applying a watermark right over them. That’ll stop some of the profile pic usage. Don’t take the watermark off until paid in full",
              "id": 49,
              "comments": [
                {
                  "score": 128,
                  "content": "Don’t send pics period.  Watermarks are relatively easy to remove nowadays, no matter how large they are.\n\nSee it happen in photog groups all the time.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Giant watermark",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "Watermark + really small definition. \"hey look! That cluster of pixels is your sister\". 😁",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 95,
              "content": "ANYONE who is complaining is free to pay you the total amount...",
              "id": 53,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 69,
              "content": "I’ve never had a photographer send pictures before payment was made in full, and I don’t know about in your area, but most photo printing places won’t print photos that are taken from websites without a signed document from the photographer saying they have the rights to the photos after payment has been made.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "And they need to pay for your trip too. You drove 4 hours to help. They should be bending over backward to pay you for your time. \nYou are definitely not an ah. \nThey are for sure. And if your friend is hounding you ask him to pay for it, and he can get reimbursed by his mom. When he refuses to do that you will know, because he knows his mom will not pay. \nNTA",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Please don't send them those photos. I'm a photographer of 15 years, this happens more than you'd think. It *will* change the relationship between you and the friend but by sticking to it, you are setting a very important boundry and you respect yourself, unlike them.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "the profile pictures, see if you can get them taken down. presumably you own the rights",
              "id": 57,
              "comments": [
                {
                  "score": 16,
                  "content": "This is an option. Not sure it would be successful but you could report the photos to Facebook or any other social media platform as copyrighted material.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "I bet they are waiting for the refund from the original Photographer before they pay you, and the timeline is longer than you were told.",
              "id": 59,
              "comments": [
                {
                  "score": 10,
                  "content": "Maybe it was a non refundable deposit, and there is no good will left between the original photographer and the couple.",
                  "id": 60,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "If anything, you should be paid first and quickly as a thank you for your willingness to agree with less than 24hrs notice and a four hour drive away. I'd'a been sending you something as soon as you agreed. That's how grateful I'd think most couples would be in such a situation.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "If payment is not received by X date, photos will be deleted and/or a civil suit may be filed.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 927,
      "content": "I used to do photography and never sent more than a watermarked low quality sample if that until I received payment in full. I wouldn't do a large event like a wedding without a deposit either. \n\nAlso never do work for friends and family at a discount. It's either free because I don't mind and I do things my way or it's full price. They can be the worst clients and will expect you to go above and beyond and not compensate you.\n\nNTA",
      "id": 63,
      "comments": [
        {
          "score": 413,
          "content": "I don’t water mark my photos which I should have",
          "id": 64,
          "comments": [
            {
              "score": 225,
              "content": "You need to have a contract that every customer signs that outlines your fees, payment terms and that photos are not released until payment is made.  It will help you in the long run to avoid these types of situations",
              "id": 65,
              "comments": [
                {
                  "score": 70,
                  "content": "Sounds like she did this on complete good faith. Clearly she will do more next time.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 72,
              "content": "Live and learn. Hold onto the photos and don't feel an ounce of guilt from it. Every other person at the wedding is getting paid for their time and product, you are no different. It's not uncommon for a wedding album to be delivered a month after a wedding. Typically I'd choose my favorite photo of the couple and send an edited low rez phone quality copy with a lower third watermark to the bride and groom while they're on their honeymoon. \n\nPeople don't need photos, the only ones who do are the ones who have paid for them. Deal directly with the paying party. If anyone else wants a photo tell you can't give them any photos and they can ask your client for them. If the client needs them ASAP there is a premium charge.\n\nHow long have you been doing photography professionally?",
              "id": 67,
              "comments": [
                {
                  "score": -9,
                  "content": "No",
                  "id": 68,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Oh gosh. Yeah definitely start watching them (and very specific language regarding usage in contacts). But yeah, I wouldn't send anymore until full payment. \n\nIt's also try to get screenshots of how your photos are being used all over social media currently even though you haven't been paid. That way you can prove your work product is being distributed without your consent prior to final payment. May not be against the law since there wasn't a contract in place but at least it might show ill intent on their part of they sue you.\n\nNTA. Good luck friend.",
              "id": 69,
              "comments": [
                {
                  "score": 8,
                  "content": "I believe photos like any other form of art have an implied copyright and can not be used without the consent of the artist (photographer in this case)",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Not sure if it works but there seems to have been a verbal contract and its shown written somewhere, just not an official signed contract. The former is usually binding still though isn't it?",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "Not just water marks but also make sure they're low res proofs.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 25,
          "content": "If a family member or friend can’t pay you what you’re worth then they don’t care about helping you succeed. That’s how I always worded it. \n\nIf I made the offer then it was a wedding present. But if someone demanded a discount I reminded them that I have expenses.",
          "id": 73,
          "comments": [
            {
              "score": 9,
              "content": "Yea, they're looking for you to hook them up and then they keep asking for more. Can you adjust this photo, that looks great can you edit this out, can you just do this little thing that's actually an exhausting time consuming thing.",
              "id": 74,
              "comments": [
                {
                  "score": 3,
                  "content": "Exactly family members and friends feel like they are entitled to free time.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 439,
      "content": "NTA. Absolutely not, this is the professional approach. You sent out some freebies to show the work has been done. Do not send anymore until you've been paid. Once the clients receive the work they have not paid for, many of them tend to put paying for it on the back burner and make you chase after it. Holding on to the final deliverables is a great motivator. You are not overreacting. You are dealing with people who insult you and call you names *instead of keeping their end of the bargain.* They are *bullying* you into giving them what they want *instead of paying you.* You are definitely not overreacting. It may damage your relationship with these people, but keeping polite distance from them is probably just as well.",
      "id": 76,
      "comments": [
        {
          "score": 335,
          "content": "I think he’s just a bit annoyed because I told him no one is getting anymore photos from the wedding until payments been made. I think it took him off guard a bit as he wouldn’t usually expect that from me as I’m so laid back but I organised something and now have had to back out",
          "id": 77,
          "comments": [
            {
              "score": 247,
              "content": "He should expect it from someone he hired for a service.  \n\nWhen I go through the drive through, I don't get my food and drink until my card is approved.",
              "id": 78,
              "comments": [
                {
                  "score": 38,
                  "content": "What, you don't tell them you'll pay when you feel like it?",
                  "id": 79,
                  "comments": [
                    {
                      "score": 30,
                      "content": "No I just scream at them. Isn't that normal??",
                      "id": 80,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Alternative: grab your food and run like crazy!",
                      "id": 81,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "Professional service is professional service. It must be fully paid for before the client receives the product. The reason experienced freelancers do that is precisely to avoid being forced to chase after the payments. You are behaving in a competent, professional manner. His annoyance is tough on him. Your question was whether this makes you an a-h. It most certainly does not.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Make sure you screenshot all the messages in case they can somehow delete them after.  Also, I’d make it clear to them that there’s a difference between “photos of them at an event” and “their photos”- at this time, since you have not been paid, those photos are NOT THEIRS.   \n  \nAdditionally, no more favors!  Every single person from your dearest family member to the POTUS gets to sign a contract.  I would suggest seeking out the services of a lawyer to CYA; also try to work in a clause that limits your storage time if the client doesn’t pay in full.",
              "id": 83,
              "comments": [
                {
                  "score": -6,
                  "content": "you’re not going to hire a lawyer for like a $400 gig.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 12,
                      "content": "They’d be hiring the lawyer to write a contract for them to use with all their clients going forward, so much more than a single $400 gig (and a single wedding gig is going to be more than $400 anyway).",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "You have the same right to be paid the same as everybody else, did he expect you just to be a pushover and go oh well",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Sounds like he had no intention of paying you from the beginning and took him off guard you actually expect to be paid.\n\nNTA OP but tell him if you don't get your payment until X date you will delete the pictures (that's what scammed photographers do when they're taken advantage of by people like him). Remember you're not obligated to give them ANY picture without payment, no matter the emotional manipulation and backlash, THEY'RE in the wrong.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "He has no right to be annoyed.  They are trying to take advantage of you.  If you send the pics now, you will never see the money.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Start sending copyright infringements claims on the website they post them on!",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I gather *they* are telling *you* the date they have decided to pay you or maybe a month after that. They are jerking you around to get all the remaining photos for free. Tell them that the remaining payment *has to clear your bank* by the date they gave you or the remaining photos will be deleted. Do not give any reason, do not negotiate and walk away if they start pleading poverty or try to tell you sob stories. Either they are willing to pay for them or they are assholes trying to get them for free.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "You might not want to think of your friend being like this but it sounds like he’s trying to take advantage of how laid-back you are. You deserve to be paid for your time and if he was a good friend he’d pay up straight away. You should stick to your guns and wait for payment before sending any more photos. NTA.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 279,
      "content": "The next time they ask for the photos: \n\n\"We had a deal, I travel to your wedding and take photos, you pay me. Until I'm paid in full, you do not get your photos. If you refuse to pay, I have our text conversations and will have to let a small claims court judge settle the issue. Though, I should be up front and mention that if I have to sue for my payment, I will also have to sue for the time and expenses of taking time off work to go to court.  Also, if I continue to hear that you are slandering my professional reputation, I will have no choice but to take legal action for defamation. Please send payment by our agreed upon date of X. If you have any questions, please direct them to me in writing at XXXX@payme.fu\"",
      "id": 92,
      "comments": [
        {
          "score": 85,
          "content": "That email address 😂😂😂",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 77,
          "content": "We have a contractual agreement where I agreed to provide photography services for your wedding upon payment. As of now, the payment has not been received in full, and therefore, the delivery of your photos is pending. It's important to highlight that our text conversations serve as documented evidence of our agreement.\n\nIf payment is not received by the agreed-upon date of X, I may have no choice but to seek resolution through small claims court, which may involve additional costs for time and expenses related to legal proceedings. Additionally, if any defamation of my professional reputation continues, I will be compelled to pursue legal action for defamation.\n\nI kindly urge you to fulfill your payment obligation by the specified date. If you have any inquiries or require clarification, please communicate with me in writing at XXXX@payme.fu.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "This is an excellent response.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "That’s fun to write, but really not helpful for the situation. OP doesn’t need threats, especially empty ones. She has the photos. If/when it does come to a demand letter, you’re better off with something more to the point and professional. It’s going to be read by the judge. There are templates and guides online.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 149,
      "content": "NTA. He (or they?) don't want to pay you. If you send the photos, you definitely will never be paid--and that will put a divide between you and your friend, anyway.  \nSo stand firm and if they want the photos, they have to honor their word and pay you (p.s., make sure the check clears first!).  \nSince there will be a divide either way, it may as well be a paid divide!",
      "id": 97,
      "comments": [
        {
          "score": 8,
          "content": "You're absolutely right but I still laughed out loud about \"check\" because that seems like something from the 90s where I live because everything is digital lmao. I forget that this type of payment is still taken seriously in some places, if someone tried to give me one here I would INSTANTLY think scammer and wouldn't accept it!",
          "id": 98,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 84,
      "content": "NTA.\n\nThey don't NEED the photos immediately, they WANT the photos immediately.  Once they have them, you have no leverage in getting payment.\n\nSounds like you have already provided some photos, so they know the quality of your work.  There is no reason for them not to pay you, and if they do not have the money right away, they can wait for the photos until they do.",
      "id": 99,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 71,
      "content": "NTA.\n\nThey can get the product when they pay for the services. You helped them out in a bind and being payed as promised is exactly what you are owed.",
      "id": 100,
      "comments": [
        {
          "score": 3,
          "content": "[removed]",
          "id": 101,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 66,
      "content": "NTA  Payment first or this is not a friend",
      "id": 102,
      "comments": [
        {
          "score": 33,
          "content": "They are not a friend.  Actions prove this.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 46,
      "content": "Photographer here.\n\nNo. NTA.\n\nShot a wedding the other week and received payment BEFORE the ceremony (In some cases it's smart to request a deposit too.) as it should be. But i understand as a last minute replacement you didn't have that relationship with them yet.  \n\n\nAs you've already experienced with the few you've uploaded, people will gladly covet your work without any thought to compensate you. I promise that if you send them the photos before receiving payment you'll never see that money, and may go to STUPID lengths to avoid responsibility.",
      "id": 104,
      "comments": [],
      "relation": "Support"
    }
  ]
}