{
  "post content": "\n\n\n\nI got invited to my fiance's family christmas celebratory dinner. It's my first christmas with them. I have always been picky about what I eat. Can't help it and it has to do with psychological factors, childhood, and personal likes and dislikes. Before accepting their invite I let FMIL know that I wouldn't be eating the traditional food at their celebration, and showed her a variety of dishes to choose from to accommodate me. She refused and told me to bring my own dish. I said if I had to bring my own dish when I'm a guest then I better stay at home then. We went back and forth and I insisted I wouldn't come if accommodations weren't being made. I just thought it was a simple request and FMIL could've agreed if she really wanted me there. My fiance agreed that I shhould bring my own dish but I didn't.\n\n\nWhen we arrived there and I saw that no accommodations were made I got up, go my things and walked out and went home. My FMIL and fiance were shocked. I got tons of calls and texts from them both and my fiance came home lashing out calling me selfish and spoiled to walk out like that over a dish that his mom didn't have to make for me. and, that it was my responsibilty to feed myself. How is it my responsibilty to feed myself when I'm a guest? Makes no sense to me. I told him this and he accused me of starting shit and ruining my first christmas with his family and disrespecting his mom.\n\n\n\nNow he's continuelly saying I fucked up and should've sucked it up for the family's sake.\n\n\nETA to clear few points:\n\n\n* For those saying I have no respect for my inlaws. I do, especially FMIL. I respect her but this is so far the biggest conflict we had.\n\n\n* I work long hours even on holidays so not much time to cook.\n\n\n* I wasn't asking for an elaborated dish or several dishes. Just one simple option.",
  "id": 1,
  "comments": [
    {
      "score": 79383,
      "content": "YTA from one picky eater to another. I went to a Christmas dinner with my mom's family. There was nothing I wanted, so I just socialized and ate when I got home. Why should she have to make a whole new dish just for you? That is pretty entitled behavior.",
      "id": 2,
      "comments": [
        {
          "score": 41613,
          "content": "And a reasonable compromise was also made. \"Bring your own dish if you don't want what will be available\"",
          "id": 3,
          "comments": [
            {
              "score": 34440,
              "content": "Exactly!! Allowing OP to bring her own food WAS the accommodation. But she didn’t want to be accommodated, she wanted to be catered to. Someone should explain the difference to her.",
              "id": 4,
              "comments": [
                {
                  "score": 17128,
                  "content": "> and showed her a variety of dishes to choose from to accommodate me.\n\nDefinitely \"Princess\" vibes.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 8855,
                      "content": "My thing with people like this who are extra picky, yes you may give me a list of \"acceptable options\" but I will guarantee OP would not like the way it's cooked. She will find some way to nitpick. Her issue is t about being picky, it's about control.  Food is her way of controlling the situation.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3237,
                      "content": "[removed]",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1498,
                      "content": "Reminds me of the Friendsgiving post were the OP was bent out of shape because the host didn’t provide her multiple dishes to accommodate her pickiness.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1213,
                      "content": "OP \"You can just make ME anything off of this list, on top of what you're already making, not a problem right?\"\n\nALSO OP \"I work long hours so I don't have time to cook\"\n\n?????\n\nHow can you say in one breath that it's easy and not a big deal, then in the next breath say you don't have time. \n\nIdk why OP even went. They literally said they wouldn't go if accomodations weren't made, and they were told accomodations would not be made. Instead of keeping to that, they went and made a scene instead. Definitely TA.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 793,
                      "content": "Right! I don’t think she understands that being a guest in someone’s home is NOT the same thing as being a “guest” at a hotel or restaurant or day spa….",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 246,
                      "content": "[removed]",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 189,
                      "content": "Red damn flag flying.  Fiance should seriously consider whether he's up for a lifetime of this kind of immature bullshit.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 35,
                      "content": "I cringed so hard when I read that. \n\nI’m one of the pickiest eaters I know and would never expect someone to accommodate me by making a special meal. The only time I’ve made suggestions on what a host should cook for me is when I was asked, otherwise I either provide my own food or make do with what’s there and eat more later.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 29,
                      "content": "For sure.  How attractive/hot must OP be that she has made it this far and got engaged, and acts like a spoiled rotten brat?  She sounds like an insufferable pain in the ass.",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3569,
                  "content": "Perfect response. Fact is your FMIL is NOT a hired chef taking personal orders. She’s planning for a lot of people. If everyone behaved as you did they’d have to make 30 separate dishes. \n\nYour behavior is selfish and entitled",
                  "id": 15,
                  "comments": [
                    {
                      "score": 418,
                      "content": "And I’m betting the “simple” options given aren’t all that simple. FMIL may not have had the required ingredients, and it could have taken away necessary time and oven space from the rest of the meal planned.\n\nBeing a picky eater is not something that entitles you to have others bend to your will. Allergies and dietary restrictions, I would be more sympathetic to as a host, and I would try to find something I could make for them, but not for “ick, I don’t like that. Or that, or that, or that.” Bring your own damn food.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 49,
                      "content": "Yeah, how come her update explains how busy she is, with NO consideration that FMIL might be a bit busy too??!",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "I really liked that OP says they work long hours so don't have time to cook but expect someone who is cooking (presumably) a lot of stuff for a holiday dinner, and dealing with all that entails, to put even more effort in to make something else.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1736,
                  "content": "Speaking as a member of families where a lot of various accommodations need to be met,  depending on who is attending: gluten free, no pork, lactose free, diabetic friendly- if you have needs that you aren't sure others can or will meet (or as we've gotten older and/or as the families have expanded, new needs have arisen) you make sure to bring at least one dish that you can eat even if it's not officially a potluck. Thankfully all of our family gatherings are relatively planned out and everyone brings something. \n\nWe're all getting better at remembering each others needs, but as someone who is picky at least about beverages my husband and I know to bring our own beverages.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 883,
                      "content": "And I find it hard to believe that out of all the dishes on the table, there isn't one thing there she can eat. Salad, corn on the cob, rice, anything! If she wants to be a picky eater, then she's going to have to make compromises. I'm gluten free, so  sometimes 80% of the food on the table I can't eat, but I happily survive and would never bitch and moan at a family gathering like that.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "Bringing food to help is has always been a standard in my family. She wanted to be treated like a guest? She is not a guest she is family. She should just help by adding to the meal or don't complain.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "I have a serious food allergy and I never expect anyone to remember it but me. I mean I do expect waitstaff to remember what’s in a dish long enough to confirm whether I can eat it, or to tell the kitchen to leave something out of it, but… Expecting my friends to remember? Absurd. \n\nAlso, some food issues - like celiac disease - are extremely difficult for a non-trained professional to accomodate in a kitchen that ever serves food that isn’t celiac friendly. So I wouldn’t expect even someone with the best of intentions to be able to genuinely accomodate some issues.\n\nSo much YTA, OP. Get over yourself. Also, you didn’t have to cook your dish Christmas Day. You had days in advance to make something happen and you chose not to.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "Right?? \n\nOP also doesn't say what any of those 'easy dishes' she asked for was. Or what was it about it that made eatable for her.\n\nThat's fishy to me. So I'm thinking something expensive, needing special ingredients, time consuming. At least not as easy as she wants us to believen. Because if it was, she could've made and brought it herself. \n\nTalk about entitlement!",
                  "id": 23,
                  "comments": [
                    {
                      "score": 19,
                      "content": "I REALLY want to see OP's list of acceptable foods!",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1825,
              "content": "Exactly. We have a friend with a limited diet due to texture issues. He shows up with a dish or 2 to share! And usually grabs something before anyway so he just snacks and chills.",
              "id": 25,
              "comments": [
                {
                  "score": 1298,
                  "content": "Bringing one or two to share as well? Now, your friend is truly a gracious guest, the type of person who is a pleasure to host!",
                  "id": 26,
                  "comments": [
                    {
                      "score": 466,
                      "content": "Well he usually just makes a big batch of whatever it is. I guess it's easier to scale it up then it to halve it most of the time. He's a good cook too. He makes this buffalo fried cauliflower that's delicious.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 856,
              "content": "which is more than i would have done for someone behaving that entitled. I am also a picky eater and I cant imagine declaring that i will not eat at an event that i am an invited guest at (much less such an important event! your first chance to make a good impression on your future family in law!) and i cant imagine demanding a second dish be made for me. I would rather not eat/politely pick at my food than be that rude to people i wanted to like me. I wouldnt even do that to people i dont like. \n\ncooking a holiday meal is a huge labor even if its for a small family. demanding (bc it wasnt a request or suggestion from op) that a second meal be made for one person is unreasonable and rude",
              "id": 28,
              "comments": [
                {
                  "score": 217,
                  "content": "Same! If a dish has something I don't like, like mushrooms, I eat around them. Or kind of pick them out andeft on the side of the plate. My being a picky eater is MY problem and not something other people need to cater to. I always genuinely feel bad if a host apologizes because they realize they made a dish that has something in it that I don't like. There are so many common things that I don't like that I'm completely used to eating around them or skipping.\n\nIf a host makes a dish that I just don't care for overall I eat as much as I can force myself too. If someone makes a comment about how little I ate I make a polite excuse. \"Oh I had a really late lunch and am just not super hungry\". \"I've been feeling a little unwell all day and food just doesn't seem to be agreeing with my stomach at the moment\". And then thank them profusely for the meal and all the effort they put in.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 38,
                      "content": "I have weird allergies and really am afraid to eat most other peoples cooking, so I just nibble at the veggie platter and bread and then eat when I get home. It's not like I can't live off the fat of the land for a few hours...",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "It really is so entitled and rude. I do not even send food back at a restaurant if it has something I dont like. If i order a dish with mushrooms for example (i also am not a fan) and the cook (who probably is on autopilot making tons of plates at once) forgets to take them out, i will just eat around it. because like you said, it is my problem that i just dont like that.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "I'm so picky I've literally thrown up when forced to eat things that don't agree with my brain.\n\nWhen I was invited to my first Thanksgiving at my FILs, I asked my fiancee what they usually cook. I then figured out what bits and pieces I could eat without causing a fuss. I snacked through dinner and ate a proper meal at home.\n\nI could *NEVER* imagine demanding someone else cater to me! I'm so embarrassed to be this picky, why broadcast it to the whole family? What a terrible impression to make!\n\nIf this was her 10th Christmas dinner with them I could imagine being a tad miffed they didn't provide anything they know you like. But being a guest in someone's house means you play by their rules, especially during the holidays.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 255,
              "content": "[removed]",
              "id": 33,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 195,
              "content": "We’ve done this at almost every family event since my kids were little and picky eaters. Now that they’re older we let them starve if they don’t like what’s there and don’t want to make a dish themselves to take.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "They also told her they weren’t catering to her so why did she expect something different?",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "It's so reasonable. My SIL is vegan and picking about which holiday vegan roll she likes. She always brings her own and I heat it up. It's so much easier. \n\nThe pescitarian brings his own salmon, my mom brings her own wheat-free stuffing. One of my best friends is so damn picky she often brings her own whole meal. It's really not hard.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "I'm glad my family does it differently. Everyone brings something. We eat buffet-style with all the food on one table that we go and grab whenever we feel like.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "[deleted]",
              "id": 38,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "[deleted]",
              "id": 39,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2632,
          "content": "All this. I don’t eat seafood. Ever. The smell makes me sick. My SIL is Vietnamese and when her and my bro got married they did two ceremonies/receptions. One traditional Vietnamese. Walked into her parents house and the seafood smell about knocked me out. I put on my big girl pants excused myself to the restroom and rubbed some peppermint chapstick under my nose. Burned like a mo fo but I was able to stick it out. I had to step outside a few times. But I managed. I stopped for food when I left. \n\nOh and I was 7mo preg. Was I miserable? Yes. But it was not my home. \n\nOP - YTA. She said she wouldn’t be accommodating you and gave you the option to bring your own food. If that hadn’t been an option sure you could be a little salty but come on. I would suggest you host a holiday dinner at some point. It’s a ridiculous amount of work and stress.",
          "id": 40,
          "comments": [
            {
              "score": 435,
              "content": "I get nauseated by smells a lot especially due to my medicine. The peppermint chapstick is so smart!",
              "id": 41,
              "comments": [
                {
                  "score": 49,
                  "content": "Vicks under the nose also works well.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "They use peppermint extract on their facemasks in operating rooms when things get extra, uh, stinky.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "I recently discovered something called StinkBalm. Comes in a chapstick tube but is meant to go under the nose, designed to help block unpleasant odors for healthcare workers. I work in a vet clinic and it has helped a lot for dealing with some of the unpleasant smells we deal with. I’d previously just used minty chapstick on my lips under my mask, which works, but this stink balm is pretty awesome stuff, highly recommend!\n\nBut will use my chapstick in a pinch. Because it works.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1345,
          "content": "Agreed. From another picky eaters POV I get kind of embarrassed of it and I don’t mention it. Something I’m actively working on but I definitely try and eat whatever my in-laws make as just a simple sign of respect tbh. \n\nThey know now what my likes & dislikes are now. They’re very kind about it since they know I try and have made an effort in the past. And their cultures dishes are very different than mine so it’s a learning curve for both parties. \n\nWith that said bro really made a scene. Their first Christmas with strangers who they’re hoping to make family and they do this??? This would give me the absolute ick and I wont be surprised if they are an ex very soon.",
          "id": 45,
          "comments": [
            {
              "score": 528,
              "content": "I'm a picky eater. If we are doing something like that I'd just eat before, bring a dish and if anyone asks just be like \"ya know I'm just not feeling very hungry today\" no one needs to know your drama for just a family dinner.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 992,
          "content": "Exactly this - YTA OP. I have a lot of food issues due to severe allergies, and some issues with specific foods which means I can’t even try to eat them (related to abuse in my childhood). \n\nMy sons are autistic and although they eat a really good variety of healthy foods, they just won’t eat unfamiliar things. \n\nI have never in my entire life demanded someone make something specific for me. Either I bring my own food, or I eat before and just eat what I can (or nothing). We went to family for Christmas - I took all my sons’ safe foods and made all their meals myself, then we tried to get them to eat the other meals and they managed bits here and there. \n\nI cannot even imagine having the audacity to behave this way with other people, let alone my first Christmas with future in laws. They even told OP that they wouldn’t be making her something separate (and she had the nerve to say there was no point going) so I don’t know what was expected. \n\nThis is going to be a nightmare long term - OP, you need to apologise.",
          "id": 47,
          "comments": [
            {
              "score": 34,
              "content": "Yes - my sister's 2 and my daughter are autistic.  We always pack meals for our own and offered the holiday meal.  I relate to your comment so much",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "Super picky eater from childhood trauma here. If there's nothing to eat, there's always bread. Is it embarrassing? Kinda, but I can't even fathom telling a new family about my trauma so I'll eat like a bird before and after. I make my own food and bring it. I ask if I can use the stove when I get there and throw something together. But if I was about to marry into this family, you bet I'd explain what's wrong, and try to work with them. Like I ask if I can make the mashed potatoes at holidays cause I only like them when I make them and I make them really good. \n\nOP asked, FMIL said no, OP gave a boundary, she still said no, and then OP ignored their own boundary to make a scene. YTA",
          "id": 49,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 34,
          "content": "Right? This especially:\n\n>\"I let FMIL know that I wouldn't be eating the traditional food at their celebration, and showed her a variety of dishes to choose from to accommodate me.\"\n\nJust absolute bonkers entitlement. I'd have laughed her out of my house. Can't help but think FMIL might never actually MIL if this sort of entitlement follows her about beyond just this. Nobody would put up with this nonsense for long.\n\nYTA",
          "id": 50,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "I accommodated two vegans and one dietary restriction (religious) for Christmas dinner and I’m also voting YTA. Nobody asked to be accommodated and all three brought shareable vegan dishes. I also tweaked a couple of the traditional ones we usually have so that everyone could enjoy them. That is what being a gracious guest is all about. OP should take note.",
          "id": 51,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "YTA- oh and you spelt “ex-fiancé” wrong",
          "id": 52,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 32168,
      "content": "Let me recap.\n\nYou DEMANDED some food was made to your liking, and when people told you \"no\", instead of cooking food for yourself... you caused a scene ?!\n\nYeah, YTA. If you have things you don't like to eat, it's YOUR problem. You are not a child anymore. Start acting like an adult.",
      "id": 53,
      "comments": [
        {
          "score": 6117,
          "content": "OP's whole attitude reeks of entitlement.",
          "id": 54,
          "comments": [
            {
              "score": 1300,
              "content": "Couldn't have said it better myself. YTA.",
              "id": 55,
              "comments": [
                {
                  "score": 22,
                  "content": "Yep. I'm lactose intolerant, had dinner with a family that had nothing but dairy based stuff...\n\nAte a couple rolls, ate when I left and enjoyed my night. .\n\nIt really isn't that hard.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 710,
              "content": "Literally, even just the way it was written 😬 gives off real AH energy",
              "id": 57,
              "comments": [
                {
                  "score": 252,
                  "content": "I got about 15 words into OPs post and I wanted the ring back.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 22,
                      "content": "If they do end up getting married I guarantee you that OP will get her engagement ring \"upgraded\" sooner rather than later because the one he picked isn't good enough. Or big enough. Or expensive enough.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 44,
              "content": "Exactly! She wants to be treated like family but also like a guest. And she sucks at being both! She could have ordered takeout from somewhere that makes food she will eat.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "[removed]",
              "id": 61,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "I love how she just says \"can't help it\" so now it everyone else's problem.",
              "id": 62,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "I seriously dislike this person based on this post.",
              "id": 63,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "Considering the fact that they told her they wouldn’t make it and she went there to see if they had made it after all, def giving entitlement vibes. OP, YTA",
              "id": 64,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2630,
          "content": "Not to mention that OP seems like they weren’t forthright with their fiancé or MIL based on this:\n\n> We went back and forth and I insisted I wouldn't come if accommodations weren't being made. I just thought it was a simple request and FMIL could've agreed if she really wanted me there. My fiance agreed that I shhould bring my own dish but I didn't.\n\nIt seems like OP thought their MIL would cave, despite there seemingly being agreement on the part of at least the fiancé and MIL that OP should bring their own dish.",
          "id": 65,
          "comments": [
            {
              "score": 1150,
              "content": "Yeah, I found this a little confusing.  Like...what was the final agreement before the actual visit?  Was it some open-ended ultimatum?  Did FMIL say she wasn't going to make an extra dish, and OP just....thought FMIL wouldn't follow through?  To me it sounds like, the final decision was that FMIL wouldn't make an extra dish and OP could come or go as she pleased, and OP just....somehow thought she would show up and an extra dish would be there?  Jesus.  YTA just for being \"shocked\" there was nothing special for you after being explicitly told that there wouldn't be.  Everything else is just on top of that.",
              "id": 66,
              "comments": [
                {
                  "score": 213,
                  "content": "It feels like OP intentionally left it vague and intentionally went there, fuming silently awaiting until the food was brought out and it wasn’t her custom dish. Instead of addressing it at literally any point prior like an adult.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 36,
                      "content": "LOL that sounds about right.  There's no way that I could imagine this situation being confusing.  Like \"Come or not; bring your own food, eat what we serve, or starve.  We're not making an extra dish for you.\"   That is as unambiguous as it gets, IMO.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 35,
                  "content": "Bottom line...if you are worried about food, bring your own.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 723,
              "content": "Either that or OP expected a special dish wouldn't be made for them and was planning on storming out as a way to punish everyone for not bending over backwards to cater to OP.",
              "id": 70,
              "comments": [
                {
                  "score": 103,
                  "content": "This. Seems like storming out was already premeditated if OP didn't get her way.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Yep! That was totally my thought as well. They wanted to make a scene.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 326,
              "content": "I'm seriously shocked they showed up after FMIL did not agree to cooking their special food. Very performative to make a scene after that. Just stay and get drunk instead LOL",
              "id": 73,
              "comments": [
                {
                  "score": 383,
                  "content": "It was a powerplay/testing boundaries. You know, like a toddler would do. She expected fmil to be a pushover and she wasn't.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 281,
                      "content": "She may have won this battle in her mind but you know she gonna lose the war. As soon as she left his family was telling him to drop her ass",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "Possibly also \"getting a feel\" for how far she can push the bf...",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "She 100% expected fiance to back her and storm out too. It was a power play against the FMIL to say if she didn't do what she wanted, she risked LC with her son. \n\nIt failed.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Yes.  Instead of not showing up like she said she wouldn't, she chose to show up so she could make a scene.\n\nAlso, she complains about not having time to make herself a meal, which I can understand.  However, it seems easy to go to the grocery store or get take-out.  \nThis whole thing seems like it was more of a power play.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Yep. \n\nDo. Not. Put. A. Ring. On. That.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1185,
          "content": "YTA - 100%. \n\nAlso - that’s going to be one fun wedding. Can’t wait for that post!",
          "id": 80,
          "comments": [
            {
              "score": 671,
              "content": "IF there is a wedding...",
              "id": 81,
              "comments": [
                {
                  "score": 584,
                  "content": "Yeah tbh after that fiasco I’d reconsider marrying someone like that",
                  "id": 82,
                  "comments": [
                    {
                      "score": 52,
                      "content": "Yeah if you are going to act like that, to my family, at a Christmas get together, after being told not to expect anything, we are done. Have fun spending New Years alone.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "Same, bullet dodged.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": "If the wedding even happens now. Fiance may decide to Dodge that bullet.",
              "id": 85,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 696,
          "content": "For real, this drives me nuts. This is why people hate us picky eaters, because of folks like OP who want to make it everyone else's problem. Grow up and accept that it's on us, not them, OP!",
          "id": 86,
          "comments": [
            {
              "score": 267,
              "content": "I was the pickiest of eater growing up. I can't count the number of time the only thing I ate was bread and butter.\n\nBut I can easily count the number of time I complained : zero.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 467,
          "content": "OP said they previously had a good relationship with their MIL and this was their biggest disagreement. So, this stunt was not only an act of entitlement but it probably needlessly damaged OP's relationship with their inlaws.",
          "id": 88,
          "comments": [
            {
              "score": 494,
              "content": "And with her fiancé!  Seriously, the audacity.  “Here is a list of dishes I deign to deem appropriate for you to fix for me. Super easy to make. Of course, not so easy that I could possibly be responsible for making one and bringing it with me, mind you.”  YTA.",
              "id": 89,
              "comments": [
                {
                  "score": 24,
                  "content": "Exactly. OP said that they were working during the holidays so they couldn't possibly find the time to make a meal for themselves.... but expected her MIL to cater to her despite planning/buying/prepping/cooking an entire meal for a larger group + preparing the house to host (and possibly also working herself.)\n\nOP keeps saying it was just a simple dish, but OP thought the time expense was too much to take on themselves, but expected someone else to do it. Also, what type of tacky person doesn't bring **anything** to a group meal? OP came bearing nothing but audacity and entitlement.",
                  "id": 90,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 33,
          "content": "> You are not a child anymore. Start acting like an adult.\n\nI feel like this is what happens when we cater to children.\n\nI don't like tomatoes or mayonnaise... so as a kid when dishes were made with them I was told to politely decline them and eat what else was available.  Occasionally adults tried to get me to eat their horrid Pasta Salads or whatever, which was annoying, but I was fine.  I didn't love Turkey but would stomach it at Thanksgiving and eat what I really loved: Stuffing, Sweet Potatoes, and Olives.",
          "id": 91,
          "comments": [
            {
              "score": 18,
              "content": "My parents line was, “if you don’t like what we’re having, there’s peanut butter in the cupboard and you know how to make a sandwich.”",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 25653,
      "content": "How many variations of this story do you plan to post? \n\nBefore the holiday, you posted after being told they weren’t going to make a different meal and how you thought it was nuts as you’re a guest. \n\nEveryone told you then to bring your own food. \n\nAnd now you didn’t and you made a scene. \n\nYTA",
      "id": 93,
      "comments": [
        {
          "score": 9151,
          "content": "Lmao I didn’t realize this person was spending her entire Christmas season angry about this non-problem she turned into a disaster for everyone.",
          "id": 94,
          "comments": [
            {
              "score": 5293,
              "content": "I really hope the fiance saves himself and breaks up",
              "id": 95,
              "comments": [
                {
                  "score": 2401,
                  "content": "I do too. This was insane behavior and it’ll only get worse from there. Imagine marrying someone who treats your mom like that.",
                  "id": 96,
                  "comments": [
                    {
                      "score": 289,
                      "content": "It feels to me like she wants really badly to have a JNMIL.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "Getting along with and respecting my family is a huge requirement when I’m dating someone.  I don’t necessarily need them to be best friends, but I’m also never going be with someone who acts like OP.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "Imagine running a household with them, and just coming to an agreement on what farking brand of peanut butter to buy...\n\n\"I'm sorry honey they where out, so I got the store brand\" \n\n*platter shatters against a wall*",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "My same thought.   Fiancé, save yourself and get out now.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I really hope fiancé sees this, if this is an indication of how she acts then RUN!",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "I love that op is wasting this much time and energy being mad and ruining their own holiday. How many approved dishes could they have made in this time?",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2645,
          "content": "I'm excited for their next post: AITA - my fiance broke up with me because I didn't like his mother's cooking.",
          "id": 103,
          "comments": [
            {
              "score": 607,
              "content": "AITA - I made a post on AITA.  the whole reddit disagreed with me but I am right.  AITA??",
              "id": 104,
              "comments": [
                {
                  "score": 28,
                  "content": "R/mildlyinfuriating - I posted on AITA but everyone misunderstood me so they called me an asshole",
                  "id": 105,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 31,
              "content": "The end to this magnificent trilogy.",
              "id": 106,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1884,
          "content": "You’re right!  I thought this sounded familiar, and the writing style is the same…very whiney.  Everyone told her to bring her own, but she kept going on about the “guest” part.\n\nYikes, she didn’t take the advice.  She knew all of the opinions in advance and still went through with it.  \n\nYTA OP",
          "id": 107,
          "comments": [
            {
              "score": 467,
              "content": "Also reminds me of the person kicked out of friend group for entitled eating behavior at a potluck.",
              "id": 108,
              "comments": [
                {
                  "score": 35,
                  "content": "Ahhh I need to read this...was it recent?",
                  "id": 109,
                  "comments": [
                    {
                      "score": 91,
                      "content": "Yup! https://www.reddit.com/r/AmItheAsshole/comments/z9xpl1/comment/iyj3gjn/",
                      "id": 110,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "I don't think she knows what it means to be a \"guest\" in someone's home, there are rules for how a host and guest should behave, and sure, most people don't follow them any more, but she should take up reading because she broke like, all of them",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Kind of helps me understand why they're a picky eater. I'm aware ARFID exists, but this sounds like what happens when you spoil a child and never tell them no. They grow up to be entitled, self centered adults who cannot fathom that the world doesn't revolve around them and their wants.\n\nBeing a good guest is just as important as being a good host. FMIL was already being a good host, OP was a terrible guest. I'll bet my last dollar this was all some sort of power play. She insisted that FMIL bow to her demands, played chicken, lost, and made a scene to try and force fiance to take her side. Now she's trying to get someone to agree that she was right so she can wave it in his face and try to save hers.\n\nYTA 100% OP. I don't think you'll be marrying into this family if you keep up the bs.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 442,
          "content": "Omg hahah this person 100% knows they are the AH then. Imagine asking someone to make you a dish and when they say “no make it yourself” you throw a tantrum when you realize they did infact stick to their word and not make you a special dish delusional and entitled",
          "id": 113,
          "comments": [
            {
              "score": 30,
              "content": "You'd be amazed how many people ask the same question over and over and over expecting  a different answer the fifth, sixth, or seventh time...",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 185,
          "content": "Wait, this is the same OP?! LOL, impressive OP! Oh, YTA",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "[deleted]",
          "id": 116,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 38,
          "content": "I believe this is the original post referenced that has since been deleted:\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/zhx5jk/aita_for_not_bringing_q_dish_to_my_boyfriends/izoboq1",
          "id": 117,
          "comments": [
            {
              "score": 45,
              "content": "It's also been suggested that [this post](https://www.reddit.com/r/AmItheAsshole/comments/z9xpl1/aita_for_being_a_picky_eater_at_friendsgiving/iyj3gjn/) was likely made by the same user; there is overlap in the stories, underlying perspective, and writing styles.",
              "id": 118,
              "comments": [
                {
                  "score": 32,
                  "content": "Holy shit, this is amazing.\n\n> *I was bullied out of my old friend group*\n\n#doubt#\n\nThey probably got sick of her shit and stopped inviting her to stuff.",
                  "id": 119,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 33,
          "content": "Wait there are variations to this story \nAnd OP was called AH in all of them? And still didn’t learn the lesson?  (Face palm)",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "I suspect OP won’t have this issue much in the future because I suspect that their invites anywhere are going to dry up real fast.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "There isn't anything on their profile. Do you have a link?",
          "id": 122,
          "comments": [
            {
              "score": 52,
              "content": "She deletes them.",
              "id": 123,
              "comments": [
                {
                  "score": 21,
                  "content": "Because she’s an AH",
                  "id": 124,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9011,
      "content": "YTA - they did offer to accommodate you, by allowing you to bring your own dish.",
      "id": 125,
      "comments": [
        {
          "score": 1901,
          "content": "Seriously... I have a meat allergy (I know, WTF) and I always check before if I can bring my own food. Sometimes people will already have options I can eat, if not then it's no drama, I bring my own meal.\n\nWhat is OPs problem? First and last Christmas with the family 😬",
          "id": 126,
          "comments": [
            {
              "score": 428,
              "content": "Same here. Can't eat meat, not that I don't want to. I recently tried in Paris (because...Paris), and ended up VIOLENTLY ill. I always offer to bring a meatless main dish, but my mom is actually super offended by that, so I just stick to the cheese board and side dishes.",
              "id": 127,
              "comments": [
                {
                  "score": 496,
                  "content": ">but my mom is actually super offended by that\n\nSorry but that's weird, why is she offended that you become sick from certain foods so have to bring your own so you are able to eat?",
                  "id": 128,
                  "comments": [
                    {
                      "score": 500,
                      "content": "1. There's not much that doesn't offend her. I also don't drink, and she brings it up CONSTANTLY. I'm in my 40's...it's not going to change, but she never stops trying. \n2. Because I am a much better cook and everyone prefers whatever dishes I make. Last month I made Thanksgiving dinner for the whole family, and my mom threw a tantrum because, \"everyone clearly liked your food better! I don't know why I even bother!\". And she's right...Everyone texted me after Thanksgiving to ask if there was a way to keep her from insisting on cooking for holidays.",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 326,
              "content": "My cousin can’t cook and was trying to go vegan—for Easter dinner one year she just ate what she could and then pulled an enormous tomato out of her bag and ate it at the table with everyone else. People can find a way if they want to.",
              "id": 130,
              "comments": [
                {
                  "score": 156,
                  "content": "I love this so much 🤣 it's such a baby vegan thing to do",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "That must've been something to see. Please tell me she ate it like an apple!",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7923,
      "content": "YTA. Holy entitled. Pretty sure you don't need to address her as FMIL. You'll be single soon enough.",
      "id": 133,
      "comments": [
        {
          "score": 2781,
          "content": "FMIL as in former not future lol.",
          "id": 134,
          "comments": [
            {
              "score": 490,
              "content": "But that would be FFMIL as in former future MIL!",
              "id": 135,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 32,
          "content": "Best thing that could happen to the finance.  I hope he's asking himself if he wants to endure a lifetime of this behavior.  YTA",
          "id": 136,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7177,
      "content": "[removed]",
      "id": 137,
      "comments": [
        {
          "score": 2281,
          "content": "I read this in a very whiny snotty tone also lol. Don’t think OPs wedding is going to be happening anytime soon after this one… can you imagine them as a bride/groomzilla?!",
          "id": 138,
          "comments": [
            {
              "score": 942,
              "content": "yeah, the part “feed myself when i’m a guest? makes no sense to me” screamed entitlement. would OP like to be spoonfed too?",
              "id": 139,
              "comments": [
                {
                  "score": 258,
                  "content": "Yeah its like the guest host relationship only works in her favor not any other way.  Sure when you are the guest the host feeds you if its a dinner, but also if you are the guest you don't dictate what the host makes.  Its pretty simple.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 243,
                      "content": "It's incredibly common for guests to bring dishes or sides to contribute to a holiday meal to start with, and that's before OP just refused to eat any of the traditional dishes. \n\nI get the feeling OP has led a pretty sheltered life if all this seems somehow shocking.",
                      "id": 141,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 79,
                      "content": "exactly! yet OP had the audacity to present the hostess with a menu telling HER to choose. like damn you had so many options but you couldn’t prepare one of em for yourself?",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 370,
              "content": "If my fiancé threw a tantrum like this, they’d no longer be my fiancé. They can be someone else’s problem. OP was given the option to bring something they want to eat if they were gonna refuse to eat anything that was already on the menu. Instead they threw a tantrum because people should be catering to them. YTA, and there’s no way this was written by an adult.",
              "id": 143,
              "comments": [
                {
                  "score": 29,
                  "content": "I freaking can't eat what other people consider normal, so guess what I did for both Thanksgiving and Christmas? I BROUGHT MY OWN FOOD. \n\nYTA, OP",
                  "id": 144,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 486,
          "content": "And she actually gave her a list of dishes to choose from to make for her. The entitlement is unreal. OP YTA",
          "id": 145,
          "comments": [
            {
              "score": 24,
              "content": "Exactly. OP is TA",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Right?  I've got two family members irrationally afraid of mayonnaise.  When I host brunch, I make sure to make a tray of finger sandwiches without it.  I love these people, and want to host them well, and its easy tweak and I'm happy to do.  If any of them send me a list of demands for something specific, and the ultimatum was they wouldn't come, we'd be thrash talking them over our finger sandwiches.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 192,
          "content": "Right! I’m a vegetarian. I understand that there won’t always be options for me aside from maybe a salad and dessert. Because of this, I plan for myself. Sometimes hosts are accommodating and will put meat on the side, or make a pasta or rice dish for me, but I’ve learned not to always expect that to happen. OP should be aware of this by now and plan for themselves\n\nEdit: typo and YTA",
          "id": 148,
          "comments": [
            {
              "score": 34,
              "content": "Definitely. I am vegan - I do communicate this but always add that I'm willing to bring my own dish so I'm not adding more work for the host. \n\nI never had to, because people were always accomodating - but  I mever expect them to be.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I'm not vegetarian or vegan, but I make sure there's something substantial for the veg folks to eat when I'm hosting. Like if I'm hosting a cookout I'll grab a packet or rwo of veggie dogs, a dinner party I'll do some kind of pasta side, etc. It's just part of being a gracious host, and it's always appreciated.\n\nHowever, I'd be pretty offended if someone acted like OP and presented me with a list of demands lol. I'd go pretty quickly into \"you get what you get and you don't get upset\" mode.\n\nHosts and guests meet each other halfway, you try to accommodate guests, and guests make sure they aren't imposing. YTA.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "You know at the dinner table the family was saying to this guy, \"Are you SURE you want to marry this person\".\n\nOP shot herself in the foot too many times YES she's. YTA.",
          "id": 151,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": ">psychological factors, childhood, and personal likes and dislikes.\n\nso, personal preferences?",
          "id": 152,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5231,
      "content": "[removed]",
      "id": 153,
      "comments": [
        {
          "score": 1596,
          "content": "This. My child has a sensory disorder and is extremely limited in their diet. His food is my problem, I always bring something with me. You telling people what to make for their meal is a little over the top. Typically it is rude to show up empty handed. So why not bring something you like to share with others",
          "id": 154,
          "comments": [
            {
              "score": 449,
              "content": "Yup. I'm vegan (for both health and animals), and have some food sensitivities, so usually if there is absolutely nothing I can eat I either don't eat and get something when I'm home, or bring a dish. Most of the time there is bread or sides I can have. I have never and would never demand someone cook a dish just for me. \n\nIF they offer or insist on cooking something special for me (which my MIL usually does), I'll offer to bring something that is extremely quick and easy to cook, like a readymade frozen dish, hummus and veggies to chip up and dip, or pasta and premade sauce. I wouldn't want to inconvenience her by taking up half her oven on one dish for one person. I definitely wouldn't send her a list of ideas and tell her to get cracking 😂",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1574,
          "content": "Exactly! \n\nOP, you seem to be confusing *preference* with *allergy*.\nIf you were deathly allergic to shellfish, and your FMIL knew that and planned a shellfish- based Christmas dinner, then yes, you have every right to be upset.\n\nBut that’s not what happened. You literally stormed out because the chicken nuggets weren’t Dino shaped. There wasn’t one white roll or cookie or plain cracker you could eat? \n\nI’d expect better behavior from a toddler. Literally. My toddler is taught if they don’t like something that’s served just pass it along and say no thank you.\n\nAnd, for the record. It’s extremely common to have someone take their own food. My cousin won’t eat anything but ham, so his mom always takes a ham. Sure, sometimes that doesn’t go with the menu but who cares? My picky cousin is his own problem, not ours. Hence why WE don’t eat ham for EVERY hokiday",
          "id": 156,
          "comments": [
            {
              "score": 307,
              "content": "A friend has a son with autism and he eats an extremely limited diet. One time she asked me to bring regular kraft mac n cheese for him to a gathering because she hadn't had time to make it for him. Super different from \"I know I won't eat anything there make me something else\" as an adult. Super cringe.",
              "id": 157,
              "comments": [
                {
                  "score": 48,
                  "content": "Also super different in the fact that your comment comes across as your friend ASKED as opposed to DEMANDED.\n\nSounds like OP was DEMANDING to be catered for and refused the reasonable compromise of BYO.",
                  "id": 158,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "As someone who has food sensitivities and allergies... I fucking hate it. I wish I could just not like something, rather than have to walk a minefield of allergic reaction or my digestive system going into full tantrum mode. \n\nPeople don't get that it's a LUXURY to be able to just... push something to the side and not eat it? \n\nI have a severe crab allergy and someone offered me crab gumbo. I was like, \"Oh I can't eat crab.\" They gave me some other gumbo that didn't have crab in it and I was halfway to taking a bite when they said they ate the crab that was in my share.\n\nHad to have a short chat about cross contamination before having a hyperventilation moment. \n\nDidn't get pissed off because it doesn't always occur to people, but holy crap. I hate this shit. \n\nI miss crab too. :'( Developed the allergy out of the damned blue when I was in my early 20s and now I'm stuck with it. I can still eat shrimp and lobster. Just not crab. How the fuck does THAT make sense?! Stupid immune system.",
                  "id": 159,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "\"You literally stormed out because the chicken nuggets weren't Dino shaped.\"\n\nLMAO, I'm so dead! This is too accurate of a description of OP's behavior! I'd award you if I wasn't a broke bloke.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "Yea my picky 3 year old is better behaved.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "ANYTHING but ham?\nA whole ham based diet?",
              "id": 162,
              "comments": [
                {
                  "score": 23,
                  "content": "Hahahah no, sorry. Ham is the only main he’ll eat. He’ll eat all the sides…. Just to turkey/ chicken/ fish/ pork or beef",
                  "id": 163,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "I was an extremely picky eater as a kid and we kept a bag of chicken nuggets (Dino shaped!!) at my grandmas house specifically for this. When those chicken nuggets ran out, I told my mom we’d need to re-up but never complained even when I didn’t have any. I’d just sit at the table with my cousins while they ate and ask for McDonald’s on the way home. I wasn’t the most well behaved child tbh, but even then I knew acting like OP would be major AH behavior.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4465,
      "content": "YTA. You knew in advance that accommodations wouldn't be made, yet you still showed up and made a bunch of drama.",
      "id": 165,
      "comments": [
        {
          "score": 1842,
          "content": "That was the dish she brought.  Piping hot drama.",
          "id": 166,
          "comments": [
            {
              "score": 380,
              "content": "With a sprinkling of entitlement.",
              "id": 167,
              "comments": [
                {
                  "score": 164,
                  "content": "A sprinkling? It was loaded on like cheese on waffle fries.",
                  "id": 168,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Entitlement, scattered, smothered and covered!",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 402,
          "content": "I keep thinking this too. Were you just gloating in the car on the way there thinking about how cool it would be to be the main character of the night?",
          "id": 170,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 122,
          "content": "Seriously! It's bad enough to insist on them making specific dishes for you, but you knew they didn't agree to that and you could have stayed home. But you went anyway just so you could flounce out for maximum drama! YTA multiple times over.",
          "id": 171,
          "comments": [
            {
              "score": 22,
              "content": "The way OP frames it like \"I gave her a list of acceptable dishes\", like she's being reasonable just shows that even after being told YTA, she'll still think she's right.",
              "id": 172,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 53,
          "content": "Exactly this, it reads like OP desperately needs attention and validation and made it a point to cause a scene by walking out, instead of politely making up an excuse not to go or just furnishing their own food. \n\nI can’t imagine telling someone to give up their time, energy, money, and oven space to cook specifically for me “or else.” Good luck salvaging any kind of relationship with the in-laws now.",
          "id": 173,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "This is what confused me. I thought she said if the fmil didn’t make her a special dish, she wouldn’t come. The fmil said no, but…OP went anyway?",
          "id": 174,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2594,
      "content": "YTA\n\nYour issues are just that: Yours. For you to place the responsibility for YOUR issues on others not only makes you an asshole, but a presumptuous one at that. \n\nYou were told several times BEFORE the event, that you needed to deal with your own issues. You decided to go, anyway. Good on you, for at least going. \n\nHowever, you allowed your pride to get in the way, by not taking care of your own issues. (Basically, you said to everyone \"Hey! They're putting this thing together. I don't care what they think, they WILL make me what I want\")\n\nIn making the evening about you, you ruined the evening for everyone. That makes you the asshole, here.",
      "id": 175,
      "comments": [
        {
          "score": 376,
          "content": "Exactly!  I agree that allergies should be accommodated- allergies can kill. But OPs likes and dislikes are her problem. They invited you to bring your own food — that was their accommodation to you. YTA",
          "id": 176,
          "comments": [
            {
              "score": 152,
              "content": "And even allergies are hard to accommodate when trying your hardest. My best friend at work has a severe peanut allergy she usually opts to not eat or will bring her own meal because although everyone has the best of intentions. Sometimes you just can’t trust it. She always is pleasant and still enjoys getting together with family and friends",
              "id": 177,
              "comments": [
                {
                  "score": 19,
                  "content": "My dad struggles with numerous food allergies (thankfully none are lethal, just bad stomach pains). All my life, my mom has coordinated with hosts to find out if what they are planning on serving will hurt him. If so, she prepares a simple meal for him (usually chicken and rice) and they take it with them to avoid adding work for the host. \n\nThis is what you should be doing, OP. *Especially* since yours are just being picky.",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Eh, if it is an allergy that could kill, I would insist (nicely) they bring their own food.  I'm a good cook, but not an allergy expert and I wouldn't want that responsibility.  Something like OMG, that is so unfortunate, please bring anything you would like for your well being.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1998,
      "content": ">She refused and told me to bring my own dish. I said if I had to bring my own dish whrn I'm a guest then I better stay at home.\n\nWhat?! Why?! This alone makes you an AH.\n\n\n\n>When we arrived there and I saw that no accommodations were made, I got up, go my things and walked out and went home.\n\nI can't believe you did that. Double AH.\n\n\n\n>Now he's continuelly saying I fucked up and should've sucked it up for the family's sake.\n\nHe is correct. Apologize FFS. Why are you so painfully entitled? Who in your life has put up with this shit?\n\nMy God, YTA",
      "id": 180,
      "comments": [
        {
          "score": 293,
          "content": "Like she could have stayed and just didn't eat anything. That was always an option. Your dietary restrictions are your own.",
          "id": 181,
          "comments": [
            {
              "score": 39,
              "content": "Right! She could've spent time with them, and then left soon after dinner if she was truly starving.  She clearly chose to be rude.",
              "id": 182,
              "comments": [
                {
                  "score": 48,
                  "content": "I genuinely refuse to believe that there was absolutely nothing to tide her over. Mashed potatoes and a roll. Eat it go home eat wtf you want. She, for some reason, was testing his family to see \"how much they cared\". And let me tell you everyone will fail every test they don't know they're taking.  She reiterated if they cared for her they'd do it. It's not their job to do that. You get that validation from your real mom boo. Not in laws. It's their job to be kind and respectful as a potential future partner to their child. They owe her nothing past that. Because using her own logic \"if she cared about them she would have stayed.\"",
                  "id": 183,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 223,
          "content": "What really gets me is she told her FMIL that she “better stay at home” if she had to bring her own dish. Her FMIL told her she would have to bring her own food. But she still showed up, clearly assuming her FMIL was going to cave to her demands, and had to create a scene.",
          "id": 184,
          "comments": [
            {
              "score": 43,
              "content": "It's like she KNEW there wasn't going to be a special meal made just for her, and wanted to make FMIL look like the bad guy by playing victim and causing a scene. And now it's spectacularly backfired.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}