{
  "post content": "So here's the deal. I (19M) smoke weed all day, every day. It's just a normal  part of my routine and I don't see anything wrong with it, and this is not something that I want to be judged on. My mom is completely against me smoking weed, and she's always telling me to stop.  I believe that cannabis is nature's medicine and that society is  oppressive to those who use it. It has helped me in so many ways and it upsets me that it's still stigmatized.\n\nMy mom told me a few days ago that my uncle and younger cousins (4 and 6 years old) would be over around 3PM yesterday, and asked me to not smoke on that day. She always gets upset if she sees me smoking, so I didn't do it while she was home.  She went to the grocery store in the morning and I figured it would be okay to  blaze up in the living room with the windows open before my cousins showed up.\n\nWell as it turns out, my uncle and two cousins showed up early and walked in right as I was in the middle of smoking a joint and lounging on the couch in my underwear. It was a really embarrassing moment, and I'm sure my small cousins were shocked to see me like that. To make matters worse, they saw me coughing in a haze of smoke as they walked in. My uncle was upset and he screamed at me for smoking in front of the children and being \"irresponsible.\" He told me that I needed to grow up and start thinking  about the consequences of my actions. I could tell that he was really disappointed in me, and the whole situation made me really frustrated. \n\nI know this was not a good situation and I regret that my cousins had to see me like that. But here's the thing: I don't think I did anything wrong. My mom told me the wrong arrival time, so how was I supposed to know that my cousins would be coming over early? And I don't see what the big deal is about smoking weed in my own home, as long as I'm not bothering anyone. If I had been told the correct time, this would have been avoided.\n\n**TL;DR:  I smoked weed in my living room while my mom was at the grocery store and my uncle and young cousins showed up early. My mom gave me the wrong arrival time and I don't think I did anything wrong by smoking weed in my own home.**",
  "id": 1,
  "comments": [
    {
      "score": 35444,
      "content": "[removed]",
      "id": 2,
      "comments": [
        {
          "score": 29679,
          "content": "Just wanna hop on to point out op keeps saying his house. It isn’t . It’s his moms house and she asked specifically not to smoke!! The rest is just icing on the cake .",
          "id": 3,
          "comments": [
            {
              "score": 15426,
              "content": "I was also going to make this point. \n\n\"And I don't see what the big deal is if I want smoke weed in my own home, as long as I'm not bothering anyone.\" \n\nIt bothers your mom. And it's HER home. If you smoke weed all day, every day, it's a wonder she hasn't kicked you out for literally doing nothing but smoking while she pays the mortgage and other bills. \n\nYou're 19. I'm willing to bet that if you do happen to have a job, you don't pay rent because you spend all your money on weed. C'mon dude, man up a little and give your mom some respect. After all, it's HER house that she allows you live in.\n\nETA: YTA",
              "id": 4,
              "comments": [
                {
                  "score": 7250,
                  "content": "Add to that he’s sitting in his UNDERWEAR in the living room of his mom’s house. I’m sure she just LOVES walking into that view in her house. /s",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3230,
                      "content": "On his mom's behalf: I think I just threw up a little bit in my mouth....",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 449,
                      "content": "I’m honestly despairing. I know he’s a kid but holy shit I wouldn’t have my kid smoking weed in the house and I smoke a lot myself. There’s a limit there, I don’t actually have kids but I feel pretty strongly about a parent asking their kid to quit smoking weed in their house, and that kid sitting in the fucking living room in his underwear, smoking a blunt. \n\nThat’s… so fucking ridiculous I can’t handle it",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 375,
                      "content": "There are so many sentences that directly link him to being the a$$hole, that I struggle to understand why he’s even questioning it. \n\nHis mom’s going to need to kick him out of the house, because she’s not doing him any favors right now. Smoking weed all day every day instead of.. I don’t know. Having a job, maybe? Something that prevents him from lounging around in his mom’s living room in his underwear on a weekday afternoon. \n\nHe should just rename the post, ‘AITA for taking advantage of my mom, and completely ignoring the rules of her house, while also exposing my young cousins to to the reality of my sad existence?’",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 213,
                      "content": "It’s so fucking rude. OP, it ain’t your house! Smoke your weed in your own room, not in the common spaces.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 56,
                      "content": "This. In his underwear 🙄",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Underwear. Dope. Regrettable situation. All his words. Are we being punked? Is this real?",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 553,
                  "content": "Yeah, I'm 40, have a medical card and I smoke almost every day. When I moved back in with my mother while my house was being built for over a year, you want to know what I didn't do. Smoke in her damn house because she asked me not to. How hard is it to respect someone and their rules for their property. I put all of my pipes in storage and used edibles and vapes in my own room (with Mom's blessing of course).  YTA, 19 is too old to be acting like a child and trying to shift the blame.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 230,
                      "content": "Man, you just know OP hasn't even thought about the weed odor. Pot and tobacco smoke are pretty common migraine triggers and that shit is *impossible* to get out of soft furnishings. My partner can't even stand in a bus shelter where someone was smoking twenty minutes ago and those things are open to the wind on two sides! 19 is old enough to show some basic consideration for other humans. YTA.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I moved in with my partner whose roommate smoked weed everyday in the apartment they lived in because my partner said it was okay for him to not stand outside in the cold and rain to do it. When he was asked to stop by the neighbors because it was so strong it was making their place smell like it on the daily, he said “I don’t have to do anything different this is my place,” and I was just so blown away by the lack of respect he had for someone else considering he was affecting them too. \n\nI mean it use to piss me off he’d smoke when my daughter was over, however it wasn’t my house so I didn’t say anything, I’d just keep my daughter in our room or we’d go outside or visit somewhere else. My partner hated it to, and had for a long time since non of the furniture in the living room belonged to the guy smoking and he would never clean up, but just choose not to say anything because he doesn’t like confronting people.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 204,
                  "content": "Yes, YTA. You may think you’re not bothering anyone, but you are your mom. You’re still essentially a baby when it comes to being an adult, but you need to start being responsible about this stuff. I’m fairly surprised she hasn’t kicked you out based off your complete disregard for her house and rules. If you don’t have one already, it’s time to get a job. Either help pay bills or save up to find an apartment or something. That way you don’t have to deal with your very obviously oppressive and tyrannical mom (/s). \n\nAlso, smoking in the living room, in your underwear after you were asked not to is really disrespectful, not just to your mom, but your uncle and cousins too. She told you they were coming, maybe they got their earlier than they had originally anticipated, maybe she accidentally got the time wrong. Either way, all of it would have been avoided if you had just respected your mom. The blame is on you, not her.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "How can anybody honestly believe they can smoke indoors without \"bothering anyone\"? That's deluded. Of course it's going to bother people, no matter what you're smoking. Go outside at least. Jesus.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Yeah, smoking weed isn't something that you can do inside and expect everyone to be just fine with it. That stuff stinks and lingers, windows open or not. There a reason most places won't allow you to smoke anything indoors. Of course it's going to bother others, especially if they don't smoke. \n\nThis isn't about stigmatizing weed use, it's about being respectful to someone in THEIR house, and realizing that you can't make decisions solely based on your wants when it affects everyone around you.\n\nYTA",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Right! My parents have made it very clear that they want us to always consider their home our home. No matter what. \n\nHowever... a, I live away from home, and when I do go back, I make sure to actually contribute like with cleaning/cooking etc because duh... OP is entitled af",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Agreed. YTA. OP, if I were your mother, I'd kick you out after this stunt.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Also, he's clearly bothering his mom. So the 'I'm not bothering anyone' line is bs.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "This. My youngest kids smoke, 20 & 22, and live in MY house. No one smokes anything inside my house. No tobacco, no vaping, no weed. End of story. \n\nOP, if I was your mom, you’d be couch surfing. \n\nYTA, a might big entitled AH at that!",
                  "id": 21,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 954,
              "content": "This whole post screams “I’m not mature enough to smoke weed.” \n\nOP, exposing children to second hand smoke of any kind is unacceptable. YTA",
              "id": 22,
              "comments": [
                {
                  "score": 314,
                  "content": "Considering at 19 his brain is still developing, quite literally he is not mature enough to smoke weed.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 141,
                      "content": "When I was around 14 and found out exposure to mind altering substances can inhibit brain growth before 25 years old or so, I decided to keep my future intake to zero or max a couple times a year for anything. Weed, nicotine, alcohol, drugs, whatever. Even if they were “cool” or not that bad for you (I do believe weed should be legal). \n\nNow that I’m in my late 20’s, I’ve let myself experiment with regular use and… meh. I don’t really like binge drinking or getting high all the time. Turns out I that I feel pretty good sober and having developed a healthy lifestyle without substances as crutches (therapy, exercise, eating healthy) means that I don’t particularly enjoy what they do for me. \n\nI still have a drink sometimes or smoke a joint with friends, but I can’t imagine waking and baking ever feeling normal or satisfying to me.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 192,
                  "content": "Not to mention that the house is gonna smell like weed regardless of windows being open and such because all he does is smoke weed and that seeps into everything. I'm surprised mom hasn't booted him yet. If he can afford weed, he can afford his own place.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 160,
                  "content": "It’s so funny to me that he’s complaining about weed being stigmatized when he’s 100% part of the problem. Like dude…where’s the self awareness here?",
                  "id": 26,
                  "comments": [
                    {
                      "score": 21,
                      "content": "This is what gets me. I'm a stoner, cannabis has many medicinal uses. This dude, this caricature of a stoner, is what the  reefer madness thinks of. Thinking of it, maybe a stoner is bad troll is what we read?",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "that’s why he’s complaining. he’s being stigmatized and he doesn’t like it, but he doesn’t want to change the action(s) he’s being judged for",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "THIS. I'm only a year older and I'm astounded by how he talks about this so nonchalantly. You can absolutely get addicted (speaking from experience), and acting like his mom is the issue for not wanting him to smoke in HER house (OP, it isn't your damn house and you know it) is beyond disrespectful.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 249,
              "content": "Exactly, OP’s bad habit is clearly making EVERYONE in this situation uncomfortable and I say bad habit because they couldn’t even go one day without smoking for the sake of the kids. If you know children will be present at some point in the day, why even take the risk? Even if the windows are all open, the smell lingers. YTA, move out if your don’t like it.\n\nEdit: Adding that I’m tired of seeing teens justify excessive smoking by slapping the medicine label on cannabis. Studies have linked this substance to dependencies, psychosis and other adverse health events while also showing minimal medicinal benefits with stuff we get in the shop. Just say you like smoking recreationally in the same way some people enjoy drinking.",
              "id": 30,
              "comments": [
                {
                  "score": 110,
                  "content": "Agree regarding ‘natures medicine’.  There’s a limit.  A lot of medication is used AS NEEDED.  I don’t know what this young man’s ailment is that justifies consistent, daily use but, c’mon man. This isn’t it.   If his mom is asking him to stop then I doubt he has some anxiety disorder or cancer or anything that actually justifies his pot use as ‘medication’.  \n\nGo to school, or get a job.  Start a career, become independent and then smoke until your lungs are black in your own damn house.  \n\nYTA OP",
                  "id": 31,
                  "comments": [
                    {
                      "score": 23,
                      "content": "The way OP speaks makes me feel like he's one of those people who read one article or reddit post/comment saying \"marijuana is a cure all!\" and uses 'natures medicine' as an excuse to get high all day.\n\nHe wanted to \"blaze up.\" Which, to my understanding, is slang for getting high. Maybe there are people who have conditions that they smoke for who say they're getting high, but from what I've seen, people with medical conditions say they're smoking not for the high but because of the pain relief, hunger, etc... not just because they want to get high and waste away on the couch.",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 28,
                  "content": "Not to mention that medical marijuana and recreational are basically different compounds so....",
                  "id": 33,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Not to mention medical is controlled so you know dosage and content (some conditions MAY respond to small amounts of THC but the majority of medical tends to be more CBD based)\n\nYa wanna get high and it’s legal fine. But don’t screw it over for those to legitimately need medical cannabis. It’s as bad as the shortages on diabetes drugs because a bunch of numpties reckon that it will keep them thin.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Yeah, anybody who genuinely needed it before legalization was capable of getting it where I live, even my friends dads who definitely didn't need it but found a doctor that was cool.\n\nIt's better now, but when legalization first happened it was this huge faux medicinal push that never made sense to me because the LCBO doesn't need this false push around their product, they sell booze, and you party with it, and are classy.\n\nidk if it was an admission by silence type of thing but needing the \"\"medicinal\"\" crutch makes me wonder if the initial retailers felt their new industry was kinda trashy and they could avoid that discussion entirely by pushing the \"this kind makes you super energetic, THIS strain will make you more creative, but THIS kind right here will make you better at playing the piano\" type of shit",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Or at least smoke with windows open  in your own bedroom!! Like why? Why?! Was he in the living room? In his underwear!",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 115,
              "content": "Ok thank you. Totally different if his place. Do you think he even pays rent or does chores?",
              "id": 37,
              "comments": [
                {
                  "score": 183,
                  "content": "No way he pays rent. And his mommy probably needs to beg him to do chores, or anything.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Check out his username 🙊",
                      "id": 39,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 92,
                  "content": "Not if he smokes all day everyday like he says. How can he function",
                  "id": 40,
                  "comments": [
                    {
                      "score": 92,
                      "content": "Based on this post, it doesn’t sound like he does function. I don’t think he’d be questioning if he was the asshole if his brain was functioning.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "He can't. Clearly lol",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Yeah, he sounds like an addict in denial. It's be one thing if the weed was for pain, then it'd make sense to smoke it everyday. But he's doing nothing else.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 85,
                  "content": "19 year old stoners can’t pay for shit, let alone pay rent.\n\nThat’s why he still lives with his mum instead of being at university or work like a normal kid 😂",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 82,
              "content": "Exactly this. He’s violating house rules which makes him a default AH, but right before his little cousins come over? Does he think they want to spend time with him while he’s high? Get over yourself OP and grow up",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "This was my first thought, too. When he owns his own place, then OP gets to have opinions on what is allowed. Until then, he follows the house rules. That alone makes YTA, OP.",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Not to mention it's just rude to smoke around a non-smoker. If you feel the need, it's polite to ask if they mind if you have a smoke. Pro tip: if they say they don't mind, they're just being polite. They do mind. Don't smoke around non-smokers",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Agreed! Her house. And she is probably supporting him because he spends all his money on weed. PSA: Smoking weed all day every day is just as costly and detrimental to your health as any other addiction. It will cause you to lay around in your mom's house all day in your underwear on the couch. It will cause your poor mother to have to support your sorry self. It will cause you to cough in a haze filled room when other family members walk in on you. And it will cause you to turn to reddit to ask if you are the ah and leave you trying to justify why you aren't. \n\nOP YTA. You are 19, man up and get a job, pay some bills, and cut back on the smoke. Everything in moderation. All day everyday is beyond moderation.",
              "id": 48,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1014,
          "content": "On the other hand he’s probably the best possible anti-weed propaganda for those kids. They now associate it with stoned, coughing Uncle Shawn in his underwear.",
          "id": 49,
          "comments": [
            {
              "score": 185,
              "content": "I LOLed at this. Oh look it’s Uncle Underwear Coughing!",
              "id": 50,
              "comments": [
                {
                  "score": 114,
                  "content": "Dystopian Captain Underpants",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "Take my award, you beautiful human.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Yup. He can be the model for ‘DARE’. Stay away from drugs, kids, or this could be you. See this guy? He’s still going to be on this very couch in his underwear Ten years from now.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 911,
          "content": "As a fellow stoner I couldn’t agree more. YTA.",
          "id": 54,
          "comments": [
            {
              "score": 404,
              "content": "Doing *anything* \"all day, every day\" except for breathing (and maybe drinking water?) is a sign of a pretty serious addiction, IMO.",
              "id": 55,
              "comments": [
                {
                  "score": 58,
                  "content": "Too much water can kill ya",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "Same, I clicked ready to defend a fellow smoker but nah man, I'm out.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Yep. Smoking in someone else's home without their express permission to do so is rude as hell. OP is one of those stoners that give the rest of us a bed rep.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "The entitlement of this little shit. When OP has their own home they can smoke whenever they want. This is their mom’s home. At least have some decency to smoke outside somewhere hidden if you’re expecting people. \n\nAs a fellow weed smoker, the house already probably smells like weed from this jackoff, but he couldn’t even respect one serious request. \n\nIf this was my child I’d start the eviction process and see how well he does in the real world. He doesn’t even know or care how lucky he is to have such a patient mom.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 893,
          "content": "\"My mom is completely against me smoking weed\" - But I smoke it constantly in her home.\n\nYTA\n\n\"My mom told me a few days ago that my uncle and younger cousins (4 and 6 years old) would be over around 3PM yesterday\" - She gave me several days warning about this to figure out a plan, but I didn't.\n\nYTA\n\nShe \"asked me to not smoke on that day\" But I did.\n\nYTA\n\n\"She went to the grocery store in the morning and I figured it would be okay to  blaze up in the living room with the windows open before my cousins showed up.\" Even though that's clearly the opposite of what I was expected to do. I didn't opt for a non-smelly THC option. I did not go outside.\n\nYTA\n\n\"My uncle and two cousins showed up early and walked in right as I was in the middle of smoking a joint and lounging on the couch in my underwear.\" I did not even bother to put on pants. Or help my mom get the house ready.\n\nYTA\n\n\"It was a really embarrassing moment, and I'm sure my small cousins were shocked to see me like that. To make matters worse, they saw me coughing in a haze of smoke as they walked in.\" I was embarrassed to be seen as exactly who I am, every day all day.\n\nYTA\n\n\"My uncle was upset and he screamed at me for smoking in front of the children and being \"irresponsible.\" He told me that I needed to grow up and start thinking  about the consequences of my actions. I could tell that he was really disappointed in me\" - I got called out by my uncle, who has probably heard my mom talk about how hard it is to have her home fumed up all day every day by a child who won't respect basic requests or help out.\n\nYTA\n\n\"I don't see what the big deal is about smoking weed in my own home, as long as I'm not bothering anyone.\" Unless you count my mother or uncle as \"anyone.\"\n\nYTA",
          "id": 60,
          "comments": [
            {
              "score": 144,
              "content": "Silver lining, good lesson for the nephews...that's gonna leave an image and they will NOT want to be that loser when they are older!",
              "id": 61,
              "comments": [
                {
                  "score": 25,
                  "content": "Yeah, probably about a 50% chance OP’s name ends up getting used as a verb in the uncle‘s household. \n\n“You going to Rick your life up?“ \n\n“I don’t know, Bro, he was my friend last school year but over the summer he totally Trevored.”",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "THIS. good job breaking it down so hopefully he can really understand instead of being immature and defensive. \n\nlike. lmao. OP absolutely deserves YTA. he make stoners look bad. and doing something \"all day, every day\" is probably an addiction. he couldn't do it in is bedroom? outside? he has zero regard for the other people living with you. doubt he's ever even considered that maybe they just don't want to be smelling it. they don't want to be exposed to it. that's their choice and their boundary and he's violating that. it sounds like he's the type of dude to blow a vape in people's faces. it's time to grow up. respect boundaries. learn, empathize, and apologize",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "As a regular cannabis consumer this is the exact post I could have made. I do all my smoking outside because I know how smelly it is and I personally do not want to live in that funk. Much less so if my mother whose house I leeched off of didn’t like it. And triply so if she asked me to stop when a fucking toddler was on his way to the house.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I wish his mom could see this and get the sense to kick him out if he doesn't shape up.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "That last one really gets me. \"If you ignore the person who has explicitly told me I'm bothering her then I'm not bothering anyone\"",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 625,
          "content": "Yeah, if you don't want to be judged on this then don't act like the worst version of a stoner imaginable.",
          "id": 67,
          "comments": [
            {
              "score": 122,
              "content": "I was thinking the same. There’s good, fully functioning stoners. There’s stoners who get by. Then there’s this guy.",
              "id": 68,
              "comments": [
                {
                  "score": 7,
                  "content": "I have family members who are stoned constantly and are bizarrely more productive while stoned than while sober. \n\nBut that's not most people and they wouldn't be caught out like this!",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 457,
          "content": "Seriously. I smoke regularly too but OP has a problem if he can't wait until evening to smoke one damn day. Being an adult means you can't get high all day, every day, sometimes there are situations were you should be sober.\n\nEdit: YTA",
          "id": 70,
          "comments": [
            {
              "score": 120,
              "content": "I am with you on that. I smoke everyday, but you can wait until a time where it's acceptable to be high and relax. But clearly before 3PM means you have NOTHING going on with the rest of your day.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Or even just go outside!? Or in his room if they live in a super cold place. But in the living room?!",
              "id": 72,
              "comments": [
                {
                  "score": 10,
                  "content": "That and he said he was smoking a joint. One of the smelliest ways to do it. Opening the windows won't do shit unless there are at least a couple of hours to air it out, especially burning paper like that. OP is just an idiot all around here.",
                  "id": 73,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 291,
          "content": "I smoke a lot as well and this is just so gross and disrespectful. First off, stop smoking inside. I live in Canada and I go outside to smoke, even in the winter. At the very least, switch to a vape so you’re not stinking up the whole house.",
          "id": 74,
          "comments": [
            {
              "score": 91,
              "content": "Yeah honestly who the hell smokes inside? I have always smoked outside because it's just common courtesy. I even have roommates and guests, they don't ask me to smoke outside. I choose to because it's common sense that smoking weed is my choice and I don't need to subject others to it.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Yeah, exactly my thought. Like maybe his mom hates that he smokes weed so much partially because he is a jackass who smokes it inside her house.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 241,
          "content": "Literally go for a walk?",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 164,
          "content": "I don’t get why if he HAD to have a joint just smoke one in the garden?? Why does he have to do it in the house. Smoking inside is disgusting",
          "id": 78,
          "comments": [
            {
              "score": 94,
              "content": "Because then he’d have to put on pants?",
              "id": 79,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 120,
          "content": "Right. YTA, not because children saw \"drugs,\" but because other people didn't consent to breathing in your smoke. And you won't believe this, but it lingers. There's no lawn chair, porch, garage, yard, or nearby smoking spot? You can't have an edible when you're indoors?",
          "id": 80,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 27271,
      "content": "YTA.\n\nRegardless of your way of life, your cousins are children and should not be around smoke (regardless if its weed, cigs, cigars, housefires, etc).\n\nYour mom made it clear and \"asked me to not smoke on that day\"\n\nYou smoked.\n\nYou got busted.\n\nYoure the AH. And you need to grow up, not because you smoke weed........but because you smoke weed all day, every day, and dont take responsibility for yourself or your actions.",
      "id": 81,
      "comments": [
        {
          "score": 4169,
          "content": "I giggled way to hard at \"housefires\"...  Thank you ;)",
          "id": 82,
          "comments": [
            {
              "score": 1887,
              "content": "Call me old fashioned but I don’t think anyone should be around those tbh",
              "id": 83,
              "comments": [
                {
                  "score": 741,
                  "content": "I'm an adult and I'll watch my fires burn thankyou! (s/ofc) :)",
                  "id": 84,
                  "comments": [
                    {
                      "score": 36,
                      "content": "As an adult that’s dealt with insurance companies before, my house burns down I’m not leaving it. Rather die than have to call those fucks again",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "This is fine.",
                      "id": 86,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 379,
                  "content": "Don't you tell me when I can and can't use arson to destress!",
                  "id": 87,
                  "comments": [
                    {
                      "score": 14,
                      "content": "My apologies Pinball",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "That's my emotional support house fire",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "Idk man I personally enjoy when there’s a firefighter or two in the general vicinity of a housefire tbh. Just my personal preference tho!",
                  "id": 90,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "I believe that housefires are nature's medicine and that society is oppressive to those who enjoy them!",
                  "id": 91,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Gosh I came to say exactly that! Carbon monoxide and smoke, in general, has helped me in so many ways and it upsets me that it's still stigmatized 🥺",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "Well, it's ok if you're there right at the start but flee before anyone notices what you've done 🤣",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "As a former firefighter I really enjoyed being around house fires",
                  "id": 94,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3445,
          "content": "Exactly. It’s not only that she didn’t want the kiddos *seeing* you smoke. No one wants kids to have to breathe in smoke for their health.\n\nAlso, anything you do “all day, every day” is a problem. That’s the definition of an addict. I don’t care if you’re doing pot or jogging, moderation is important. You obviously couldn’t even control your addiction for one day.  That’s a really big deal.",
          "id": 95,
          "comments": [
            {
              "score": 1023,
              "content": "Not to mention that actively smoking weed is worse for his body and his mother's sanity than, say, popping a gummy every once in a while.",
              "id": 96,
              "comments": [
                {
                  "score": 699,
                  "content": "Not to mention the long term effects chronic use has on brain development. Dude should have waited till 23-24 to start, damn.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 436,
                      "content": "Yeah, I'd say there's a good chance he heard all this in highschool and it went in through one ear and out the other. You know, like smoke.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "100% this. Cannabinoids found in cannabis do have medicinal properties. \n\nHowever in some people who are prone it can also cause psychosis. \n\nIt also impacts how the brain develops in adolescence and can lead to altered brain chemistry causing instances of anxiety and long term functioning issues  and therefore really shouldn't be smoked till the brain is fully matured (early twenties).",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Yeah kind of regret smoking weed at 16 and never stopped doing it. But I have a 3.8 GPA right now at my university. So im no slacker. I just don't smoke when learning and doing important projects. Glad I have some self control... unlike OP.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Agreed! Chronic weed use isn’t good for a developing brain, thank you! Most people don’t know that.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 451,
                  "content": "Plus at 19, he is doing damage to his development.\n\nThat has been proven studies. Wait a few more years before you start doing it that much.",
                  "id": 102,
                  "comments": [
                    {
                      "score": 209,
                      "content": "Unfortunately it goes how OP is doing it, young and dumb. By the way they’re talking I’m sure he’s not being very productive. I know a few people who can smoke a few times a day and function and handle their shit but they are the very rare exceptions and work their asses off. Op ain’t that, no way. \n\nI smoked far to much growing up, lots of times blunts and joints or shitty rez hits. Weed smoke contains tar just like tobacco, just not nearly as harmfully. But it has effected my lungs and I rarely smoke my weed these days. We’re in a golden era for weed, a weed renaissance if you will, where 40 years ago people were very ignorantly against it now people are very ignorantly for it and now legitimate negatives get swept under the rug. I suffered from ignorance and now so is OP",
                      "id": 103,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "Oh yes. My brother uses marijuana, but he also dates a youth therapist who knows first hand what can happen, and so he's always clear with the younger siblings that it's not ok at their age, and he's the one sibling they generally listen to",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Yeah, I mean he could at least go somewhere outside and do it privately. I’m sure that alone would be enough to calm things down. Unless everyone in the house smokes constantly inside, it’s disrespectful to be doing it right in front of them.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 13,
                      "content": "But then he'd have to wear clothes!",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 119,
              "content": "Yeah my brother is a weed addict (went through rehab a couple times, sober now) and a lot of OP's comments were upsettingly familiar",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "The smell, too! I would be so embarrassed if guests came to my house and the place smelled like skunk",
              "id": 108,
              "comments": [
                {
                  "score": 19,
                  "content": "i’m so glad someone else thinks weed smells like skunk! i feel like no one around me associates the scent with a skunk lol",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Exactly. I'm not against weed myself (except maybe the weeds in my garden but that's a different kettle of fish) but every time I hear someone say that they're 420 friendly, that they NEED to smoke it for their aNxIeTy but don't have a prescription, or as OP puts it \"all day every day\", all I hear is \"I'm an addict and if I don't get what I want, I'm going to make it YOUR problem\". \n\nIn my experience at least.\n\nYTA, OP. For smoking in the living room (go to the yard at least, for Chrissakes) for exposing your cousins to it and for being in denial about being an addict and for the disrespect you're showing your mom for asking for something that is a reasonable boundary to most people.\n\nETA: no one is \"oppressing\" and I find (at least here in Canada) there certainly is no stigma really surrounding marijuana these days. The only oppression you seem to be finding is your mom asking to actually (gasp!) be an adult.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Considering that OP thinks *smoking* weed is “natures medicine” I’m pretty sure they’re so addicted they don’t want to hear about how bad smoke of any kind is. I’m gonna hazard a guess and assume OP is the type of person that says “smoking weed cures cancer bro, I’m gonna live forever lmao”",
              "id": 111,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "YTA. Take this how you will. All day everyday anything is a problem. Balance is key in overall wellness and satisfaction. I do agree its medicine, but shouldn’t be used to self medicate.  If theres something going on where you feel the need to get high all the time you should really address the root problem or trauma. There is such thing as drug use for grown ups.  Anything all day every day is addiction. Regardless of substance except maybe water. \n\nMy sister has 6, 4, and 3. I wouldn’t smoke before taking care of them. And if i knew they were coming over and asked specifically not to smoke I wouldn’t have.  If I needed to for medical reasons, perhaps an edible or a vape pen. 6 and 4 are in old enough to remember.  Not your fault they came early or got the time wrong, but for god sake smoke outside. Hit a vape pen maybe. But blazing a J in you house before kids come tell me you need to reassess yourself. I get your 19, but that childish, selfish, and just plain dumb.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Nah cause I see a lot of friends and people who swear they ain’t addicted to their pens(weed) or their Juuls or vapes, but if they don’t hit it on a regular bases they go crazy tryna search for it.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2225,
          "content": "_\"I smoke weed all day, every day.\"_\n\nOP also seemingly lives with his mom, and doesn't even have the decency to put on some clothes and smoke outside.\n\nOP, do better.",
          "id": 114,
          "comments": [
            {
              "score": 994,
              "content": "Or the decency to admit it's her home too. \"my living room,\" but... where does she live exactly, or does she just routinely visit you, go out grocery shopping, and then come back to visit you...?",
              "id": 115,
              "comments": [
                {
                  "score": 697,
                  "content": "Or the decency to admit that it's her home entirely because I doubt OP is on the lease.",
                  "id": 116,
                  "comments": [
                    {
                      "score": 261,
                      "content": "or helping pay bills if he's just high everyday",
                      "id": 117,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "I also doubt if he has a job... What job allows you to smoke weed all day every day?",
                      "id": 118,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "Yeah, unless his mom is living with him, it's her house not his.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 89,
                  "content": "Yeah I noticed that too. His living room, his home, but who’s on the deed? Who pays the bills? Probably his mother. Instead of respecting her wishes, he’d rather smoke all day, in HER living room, in HER house, against HER wishes, and can’t even be bothered to put on some pyjama pants? And I thought my younger brother was bad with HIS weed habit. At least he puts on clothes and only smokes in his bedroom. 🤷‍♀️",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "My mother would never let anyone smoke in her home, and in turn, I can't imagine just smoking around my mom's house. There has to be some respect there. My mom can't force anyone to not smoke at all (assuming only adults come over) but she can insist that they smoke outside. Being in your underwear all day smoking and doing nothing is no way to live. He sounds like every 19 year old stoner, yet they think they have such a profound and different opinion. \n\nHe also couldn't go one day without it, which is quite telling. He's wasting his days and I find that sad. Time is so precious.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Yes! This got me too. 19, smokes weed all day every day, and lives in the same house as his mother. You know damn well that’s her house. I don’t see how a 19 year old who “smokes weed all day every day” could NOT be living with their parents yet. Not many jobs let you sit around smoking all day and it’s expensive to live on your own. It’s absolutely laughable he’s calling it “my living room” lmaoooo. Child, no!",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "\"In my own home\" spoken like a true child.",
                  "id": 123,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 850,
              "content": ">I smoke weed all day, every day.\n\nAnd \n\n> natures medicine\n\nIf you need to take medicine all day, every day - you are severly ill. If you don't _need_ medicine all day, every day but take it nonetheless all day, every day, you're an addict.",
              "id": 124,
              "comments": [
                {
                  "score": 197,
                  "content": "Nature’s medicine my ass. Asbestos is a natural mineral. I don’t see people consuming it.",
                  "id": 125,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 786,
              "content": "OP hates that marijuana is stigmatized, yet behaves the exact way that causes people to stigmatize it. \n\nYTA. It’s not stigmatized because people think weed is dangerous, it’s because of people like you that are being selfish and don’t seem to understand that you need to respect other people not wanting to be around it.",
              "id": 126,
              "comments": [
                {
                  "score": 71,
                  "content": "You ABSOLUTELY nailed it on the head right there..\n\nOp wants to pretend that weed is a totally natural and harmless \"medication\" but then treats it like an illicit drug and fully admits to being addicted, unable and unwilling to stop even when directly asked by the person KEEPING A ROOF OVER THIER HEAD. \n\nIt's such a horrendous lack of respect, and while I fully expect that my own children will someday try marijuana (nor do I have any problem with that, I myself was in the medical marijuana program early on due to Crohn's disease)- I absolutely would be utterly disappointed if my child was behaving like OP, And - if they were smoking ANYTHING *INSIDE* my home, they would be getting a legal eviction notice at the earliest possible time I could file. \n\nDamaging my property and leaving my home freakin' reaking of weed while you lounge around in your underwear in my living room?\n\nOh fuck no. \n\nI want to know who's PAYING for this lazy asshole to be sparking up \"all day, every day.\" Why do I get the very distinct impression he's got no life, and no job?",
                  "id": 127,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 24,
                  "content": "Exactly & why smoke inside knowing kids were coming over?? There’s edibles and vapes everywhere so the smoke doesn’t get into other people’s faces & lungs. I’m just surprised that OP wouldn’t use those methods especially if his mom who he lives with has had to tell him repeatedly not to smoke in the house!",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "You put into words what I was trying to figure out about why this post bothered me so much. I (31) have a medical marijuana card for chronic pain and anxiety disorder, and I partake every now and then. Mostly on the weekends, or in the evenings before bed, *when I need it.* \n\nOP blazing it up all day every day because it's \"nature's medicine\" is just addiction to the feeling of being high. He's no better than an alcoholic at this point. On top of that, blazing it up in your mother's living room with no clothes on, on a day that small children are coming over, is irresponsible at best. It's very easy to lose track of time while you're high, and this could have happened regardless of the uncle arriving early had he just gotten a little too high that day.\n\nOP is a major AH. Grow up, dude.",
                  "id": 129,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "As someone who used to have that exact mentality, you hit that on the head. It took years to break that, personally.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 292,
              "content": ">and smoke outside\n\nThis is the part that bugged me. That smell sticks to everything! My best friend smokes but she always smokes outside so the house isn't negatively affected when guests are over. Especially since myself and many others cannot stand the scent. That's just consideration",
              "id": 131,
              "comments": [
                {
                  "score": 26,
                  "content": "I thought I was the only one! Weed scent gives me the most painful migraines on the planet. My brother and I have had arguments in the past because of his copious weed smoking. He basically started getting pulls from other people at like 14, and now it’s become a pretty serious addiction. But even my brother, (who is one of the most selfish people I know) can actually put on clothes, and only smoke weed in his room. He’s got an air dehumidifier in his room too. Like it took us a long time to get to the point where his weed isn’t clearly noticeable as soon as you walk into my Mum’s house. But he actually listened and learned. So I was happy enough with that. This OP is kinda a jerk.",
                  "id": 132,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Oh wow me too I get the headaches! Also for me the smell is a trigger from an abusive relationship so I can’t stand the smell. \n\nOh and OP YTA, get help, get a job and get your own place to smoke weed in",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I'm a pack a day cigarette smoker and go to great lengths to avoid bugging non-smokers OUTSIDE. To be smoking inside your mum's house!! Oh man, surely OP knows it's wrong.",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I have smoked weed since I was a teenager. A couple of months ago I allowed a friend who was down on his luck to move in with me. Like OP he smoked weed all day every day. In “his” room with the door closed. The smell was annoying and intolerable. Even when he left for work the cloying smell remained. I finally had to ask him to leave my home because of that and the fact that he was a lazy slob. Which seems to go hand in hand with smoking weed.",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 288,
          "content": "i shmoke sometimes more than i breathe oxygen but if there’s one thing i’ve been mindful of since i started smoking anything was to be courteous of others. if i want a cigarette, i’m not gonna shmoke it until i can be sure it won’t bother anyone else. when i shmoke my bud, same thing… don’t do it anywhere or any way that will bother others- even at parties, the amount of times i’m told i don’t need to worry about blowing it out a window- it’s just force of habit and only feels right to minimise my “smokers’ presence”",
          "id": 136,
          "comments": [
            {
              "score": 40,
              "content": "It’s just basic courtesy. I have plenty of friends who smoke, and though I really don’t anymore, my rule is always step outside if you’re gonna light up. I don’t need my house getting danked up",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Is that you, Sean Connery?",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "From someone who gets  really bad migraines and nausea because of strong smells, especially smoking, thank you :)",
              "id": 139,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "And dude is no doubt still living with his mom in his mom’s house talking about mY lIvInG rOoM lmao",
              "id": 140,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "I also smoke, but if I'm with a no-smoker you can bet I wouldn't even think about lightning a cig. And when I visit a no-smoker house I make sure to not even smoke before leaving my home so I don't bring the smell in.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Lol at natures medicine. It’s insane to smoke all day and op has an issue he needs to address.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 18966,
      "content": "YTA. \n\n\nIf you smoke pot \"all day every day\" to the point that you can't stop for a day, let alone a few hours, then you have a problem. That's not a habit, that's an addiction. \n\nBtw overuse of any substance, including marijuana, can impact your still-developing brain. Weed specifically also has links to certain mental illness. Your uncle is right, you need to grow up.",
      "id": 143,
      "comments": [
        {
          "score": 9319,
          "content": "Love this comment. I’m pro-legalisation but my god stoners want to pretend weed is as safe and healthy as water and it’s deeply frustrating. Grow up OP, and stop being so horrible to your mum.",
          "id": 144,
          "comments": [
            {
              "score": 2980,
              "content": "If you drank water all day everyday, you would die. Moderation in everythjng",
              "id": 145,
              "comments": [
                {
                  "score": 1451,
                  "content": "\"Everything in moderation, including moderation\" - Oscar Wilde",
                  "id": 146,
                  "comments": [
                    {
                      "score": 36,
                      "content": " I'm an extreme moderate. I believe anybody not in favor of moderation and compromise ought to be castrated",
                      "id": 147,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "Sometimes ya just got to throw a rager - Oscar Wilde, paraphrased",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 407,
                  "content": "Sure but some things are more dangerous than other things. And weed is far more dangerous than drinking water.",
                  "id": 149,
                  "comments": [
                    {
                      "score": 1134,
                      "content": "Idk man i knew a guy who drank water and died. 3 weeks later. In a car wreck.\n\nEveryone who has ever drank water has or will die\n\nSeems pretty sus to me",
                      "id": 150,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 23,
                      "content": "You can drink to much water, it affects your kidneys and can kill you. It also dilutes the sodium in your blood too. Not sure what it’s called, but you have to drink almost 30 liters of water a day for it to become a problem. \n\nOP - YTA. Your mom asked you not to smoke for one day.",
                      "id": 151,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "Over hydration can cause acute issues and death (many deaths in the 90's/00's linked to ecstasy were due to excessive hydrocranial pressure from drinking too much water). Smoking weed will take decades to kill you.",
                      "id": 152,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 809,
              "content": "Yeah - it’s not safe for fully grown adults to smoke all day every day (like WTF do they think it’s magical smoke that has no impact on the lungs) but for a kid with a developing adolescent brain, it’s not safe full stop.",
              "id": 153,
              "comments": [
                {
                  "score": 749,
                  "content": "I knew someone who started age 12 and they had memory issues, insomnia, the works age 17. They also had severe asthma and hospitalised themselves several times because they refused to stop smoking. \n\nStoners love to say weed is more safe than alcohol, but at least we all acknowledge that drinking heavily every day constitutes a dependency!",
                  "id": 154,
                  "comments": [
                    {
                      "score": 490,
                      "content": "My partner lost several jobs due to being high on the job and would drop anything and everyone to go smoke with friends. His clothes and room smelled gross all the time and he has severe memory loss, insomnia, eating issues, his anxiety worsened when he quit cause he never learned to self regulate, and the process he took to quit almost destroyed our relationship because he was awful to be around. People who deny the bad parts of weed deny peoples experiences and science that proves that point. I think it should be legal but it should be regulated and definitely needs to be taught about like other dangerous substances",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Yeah one of the reasons I am in favor of legalization is that once it’s legal we can talk about it the way we do alcohol — fine in moderation but definitely possible to abuse or become addicted to, here’s the signs you have a problem, here’s how to tell you’re too messed up to drive, etc.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Additionally, often those stoners fail to mention the impact of smoking weed on the lungs. Smoking any substance is unhealthy for the lungs. There's plenty of other ways to ingest besides smoking.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I dunno, most adult stoners I know will agree on the sentiment that you absolutely should wait until your brain is fully developed to smoke, that you shouldn't smoke and drive, and that yeah, technically any kind of smoke in your lungs isn't THE BEST for them. Like yeah, it isn't as bad as cigarettes but it's not as good as NO smoke. A lot of my friends will only use edibles for that very reason.   \n\n\nThat said, when we say it's \"safe\" we don't mean \"there are absolutely no adverse reactions in the body to inhaling smoke\", we mean \"you aren't going to overdose and die in the street, you arent going to chew off your own tongue, and you aren't going to see magical elves dancing around your livingroom\".",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1378,
          "content": ">Btw overuse of any substance, including marijuana, can impact your still-developing brain. \n\nSource:  OP's post.",
          "id": 159,
          "comments": [
            {
              "score": 300,
              "content": "He would respond to the comment, but he forgot what he was doing and went back to watching cartoons in his underwear.",
              "id": 160,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 202,
              "content": "☠️",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "https://www.cdc.gov/marijuana/health-effects/teens.html\n\ndamn that was hard to find\n\nedit: in case anyone calls me out about non-sequitur BS like We'Re NoT tAlKinG aBoUt TeEnS\n\nhttps://www.cdc.gov/marijuana/health-effects/brain-health.html",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 653,
          "content": "Thank you! Smoking all day every day is an addiction but people like to act like having a weed addiction is “cool stoner shit”. I’m pro weed in certain cases but I absolutely hate when people act like OP.",
          "id": 163,
          "comments": [
            {
              "score": 325,
              "content": "Stoners like OP will never believe cannabis is addictive.",
              "id": 164,
              "comments": [
                {
                  "score": 417,
                  "content": "the thing is bc they believe its not CHEMICALLY addictive like opioids and such that its impossible to become addicted, and its just not. if people can be addicted to gambling they can be addicted to anything with or without a chemical bond happening. just based off the chemicals your own body releases in response to the stimulus.",
                  "id": 165,
                  "comments": [
                    {
                      "score": 193,
                      "content": "THANK YOU. This has always bugged me about weedbros. That and their claims that it’s completely harmless 🙄 we even had an AMA from the Legalise Cannabis Party in our state’s sub doubling down on it being “harmless”. Like come on, I’m all for legalisation and regulation of cannabis but let’s not spout bullshit.",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Yup people don’t realize chemical dependency and addiction are 2 entirely different things",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "For sure. I smoke everyday when I get home from work. I can go all day during work without it or even craving it But I know I'm addicted, and it isn't about the weed anymore it's more so the routine of smoking a joint or bowl. My best friend on the other hand, smokes all day everyday, hasn't gone a day without in probably 10-15 years and does not believe at all that he's addicted.",
                      "id": 168,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 153,
              "content": "I had a roommate that just couldn’t stop smoking. He’d wake up and take a hit. Go take a shower and take another hit. Start dressing, again. Before he left he’d smoke once again and then drive to work. Once back home, first thing he’d do? Smoke again. \n\nWhats worse, They don’t see that as an addiction.",
              "id": 169,
              "comments": [
                {
                  "score": 25,
                  "content": "My mom was addicted my whole life until a few months ago. My whole childhood every time we drove somewhere she’d have me lay down in the backseat so people couldn’t see she had a child in the car while she smoked weed. Everyday she’d smoke at least a bit every hour damn there. Doing my hair, she’d be smoking, making food, smoking, getting ready for bed and watching tv with me, smoking. I’m proud of her for realizing it was an addiction and quitting. She’s less angry all the time and is doing overall better.",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "See, I do that when I have bud. But I also have severe pain and inflammation problems that weed helps with where other medications have failed. Or if the medications helped they caused horrible side effects like worsening my low blood pressure problems and causing me to faint more often, allergic responses, being so fogged out that I couldn't even understand English or wake up in time for work, severe lung inflammation that landed me in the ER - the list goes on and on. \n\nSmoking before I get up makes it so that getting up doesn't hurt so badly that I procrastinate getting up or have to sit back down every few minutes to work through the pain. It helps to reduce my muscle spasms so that my neck doesn't twitch and then lock up so that I have to go get steroids to unfuck me and let me turn my head again. It significantly reduces my chances of fainting when I stand up and when I shower because it helps to bring up my resting heart rate and blood pressure just enough that I'm mostly normal. When I smoke I get so much more done in a day because of the reduced pain and fainting. The lack of pain actually makes me less foggy than the weed makes me so I'm more mentally clear when I smoke than when I don't. \n\nThe caveat there is that I also don't smoke nearly as much as most people do. What lasts me an entire day is most stoners wake n bake. I smoke a little bit often throughout the day because the physical effects do wear off pretty quickly. I don't like being fogged out all the time though so I keep the hits small and regulate how often I smoke. I've been foggy for most of my life from my pain. I want to actually fucking function for once. And if I don't have the money for it, well that sucks. I don't always have the money for Drs appointments either - I figure it out and pay my damn bills.\n\nThat being said, I dated someone who would go through 6-7x as much as I did in a day and didn't see a problem with the fact that he was too vegged out to function and do basics in life. He would forget appointments constantly and if I didn't remember his schedule for him he'd miss appointments entirely and then blame me for it. He was late for work and often made me late for work because we shared a vehicle. I couldn't even try to save up for my own vehicle because I was dealing with ongoing health issues, covering for him missing bills he was supposed to be responsible for, or paying for maintenance on his vehicle. Plus I was young and got shit pay. \n\nHe wouldn't wash his dishes, or even move the stack from his desk to the sink. He’d have tantrums if I asked him to take care of it because almost every single dish was sitting dirty on his desk, and then tell me I was nagging him. But then he'd bitch that there were no clean dishes to use and throw another tantrum when I refused to clean up after him **again.** He’d go days without showering and not wash his clothes so he'd be wearing the same stank ass shit unless I washed it for him. Eventually I was the only one doing housework despite working as much or more than he did on top of having decreased energy due to my health issues. \n\nHe’d smoke through the majority of the weed and leave none for me unless I hid mine so that I had it available for my pain days and be able to make it to work instead of being dead in bed from my pain. If I refused to give him mine because I actually use it as a medication whereas he smoked recreationally he would blow the months budget and be late on one of the bills he was responsible for. I'd suddenly have no phone service because he skipped a couple months payments on our phone bill to buy himself more weed or fast food despite having food at home. Then he'd blame me and tell me I was abusive for not sharing my weed. \n\nIf he didn't smoke he had what were quite frankly **psychotic** episodes. It's one of the major reasons he's my ex now. He’d swerve at other vehicles on the road with me in the car and drive way beyond what was safe for the level of traffic or weather conditions. And I speed myself but goddamn he was **RECKLESS**. At least I slow down when I see that I'm catching up to traffic ahead and wait for safe space to pass people instead of tailgating and weaving between cars like a nutjob. \n\nHe’d scream about every little thing when they were truly LITTLE issues. He broke electronics because he'd get mad that he lost at something. He screamed at me for hours during a long car trip once because a cop gave him a warning about one of his lights being out. When I ended things he went fully manic and is now still stalking and threatening to kill me. \n\nTL;DR - Saying that people can't be addicted to weed or that it can't be dangerous is fucking **bullshit.** But it's not about how often you smoke as much as it is how *much* you smoke along with your relationship to and dependence on it. It's just like any other substance issue.",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 337,
          "content": "This! \n\nPlus: if somebody will arrive 'around 3 pm': start being prepared for their arrival by 2 pm. And in the case of smoking: take an extra hour to get the smell out of the house! In the case of weed with its unique smell: take an extra hour to de-smoke the home. In the case small kids are coming over: add another hour. So, from 11 am onward you, or at least an adult, should have been concerned with making and keeping the house smoke free and smell free.",
          "id": 172,
          "comments": [
            {
              "score": 321,
              "content": "Or just go to the yard, but he was probably too lazy to put clothes on 🙄",
              "id": 173,
              "comments": [
                {
                  "score": 240,
                  "content": "My thought the entire time of reading this post, why not just smoke outside if he needs to so badly?? Also his “but it’s in my house” seems like he’s saying “my house, my rules” when it’s clearly his mom’s house. Bizarre post.",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 242,
              "content": "That smell is never coming out of **his mother's** house if he's smoking like a stove pipe. If she ever wants to get rid of it she will basically have to gut the place.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 119,
              "content": "When people smoke weed in the hotel rooms here in Las Vegas, they are charged an extra $200 cleaning fee and air purifiers have to be put in the rooms that are taken out of available stock for at least a day. The smell doesn't leave completely, and you know the second you walk in what's up, it smells like stale cat piss and gasoline. These rooms don't have windows that open, where do they think the smoke and smell goes?",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I was questioning if they were even actually early. I suspect his mom told him they’d be there around a time. So if she said “around 3” then he’s thinking “mom is gone, so I have until 2:59 to smoke”, they might not have been early. They were early based on his time frame, but not really.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "And he’s only nineteen!",
          "id": 178,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I smoke all the time too but I do it on my porch, which is actually mine because I don’t live with my parents. What a loser.\n\nAlso yes don’t smoke chronically if you’re under 25, it severely fucks brain development. My brother-in-law started at 10 and he’s a potato.",
          "id": 179,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11702,
      "content": ">I did anything wrong by smoking weed in my own home.\n\nIsn't it actually your mother's home?\n\nYTA.",
      "id": 180,
      "comments": [
        {
          "score": 1909,
          "content": "Right? I was thinking of you smoke weed all day, everyday, you aren't working. I have had coworkers who smoked weed a lot, one of them was even renting a room in my house. She smoked it outside and never in front of my children. Usually only did it when the kids were getting ready for bed",
          "id": 181,
          "comments": [
            {
              "score": 203,
              "content": "I mean lately I’ve been smoking much more frequently so for a couple weeks it really has been all day every day for me, and I work a 9-5 😂 but my job also requires no interaction with customers, minimal contact with coworkers and supervisors, and I get to work from home in my comfy clothes except for one day a month when I have to go in, but I obviously don’t smoke at the office lol",
              "id": 182,
              "comments": [
                {
                  "score": 182,
                  "content": "> but I obviously don’t smoke at the office lol\n\nexactly. that's what edibles and vapes are for. excellent point, my dude.",
                  "id": 183,
                  "comments": [
                    {
                      "score": 88,
                      "content": "I actually won’t use edibles or vape at the office either, it’s recreational here but I don’t really want to get fired for getting high on the property 😂",
                      "id": 184,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1025,
          "content": "“I smoked weed in MY living room”\n\nYour mother’s living room, right? At least have some decency and respect for your mother and 1) smoke outside the home  2) don’t smoke the one day where it’s important to her.",
          "id": 185,
          "comments": [
            {
              "score": 277,
              "content": "Why he was in the living room in his underwear too has me baffled. Go to a balcony, the bathroom, his own room. But decided to sit on the couch, undressed, with the door unlocked. \n\nMy wife has a medical marijuana prescription, but does it on the balcony, or cooks it up and stores it away from where you could accidentally stumble on it. I don't give two fucks about it even though I don't smoke or drink. \n\nJust be mindful of those around you. And the fact she didn't say to stop, just cut it out for the day. Kind of entitled to just ignore that shit and do it in common areas, when told to not do it.",
              "id": 186,
              "comments": [
                {
                  "score": 11,
                  "content": "I mean I live alone in a detached house by myself and I'd still never light up in my living room never mind if I'm having family over lol.\n\nBong belongs beside the back door so I can grab it and jump onto the back porch.",
                  "id": 187,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Or smoke in your bedroom, with the door closed and the window open.",
              "id": 188,
              "comments": [
                {
                  "score": 12,
                  "content": "There are so many better solutions that aren't completely disrespectful. A bong hit blown out the window/backdoor is really not hard to pull off.\n\nAnd yea, I understand weed being used medicinally...but honestly, joints are not a medicinal dose.",
                  "id": 189,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "The entitlement of doing that in your mom's house and thinking you didn't do anything wrong...",
              "id": 190,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 261,
          "content": "His mothers house, when his mother already told him she doesn’t like it. Then again told him not to do it prior to having guest over. Absolutely TA.",
          "id": 191,
          "comments": [
            {
              "score": 14,
              "content": "This is how my sister acts. It’s beyond disrespectful and she just lost 8k from her college fund (not that she’s using it) to pay for all the money she stole to buy weed, door dash, and go out to eat and especially drink with friends. She doesn’t care who pays, it’s her house and she “has the right”. \n\nOP, everyone but you in your life thinks you’re an asshole.",
              "id": 192,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Exactly what I was going to say. At first I thought OP lived alone and I was like \"well yeah you can of course smoke weed when you want it's your house\" but the fact he's openly smoking in his mother's home knowing she hates it idk that's disrespectful as hell to me. He could at least go outside. \n\nDefinitely voting YTA.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I was so confused when he mentioned his mom not being home. So likely it isn't his living room or his \"own home\". Definitely the AH.",
          "id": 194,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10122,
      "content": "My man, you are living and espousing the absolute worst parts of stoner culture. Doesn't matter you had the wrong time, a responsibility and expectation were communicated to you. Grow up and get a handle on your use, the community has been working hard to move past the stereotype you're living up to. YTA",
      "id": 195,
      "comments": [
        {
          "score": 2428,
          "content": "This post set the legalisation movement back decades.",
          "id": 196,
          "comments": [
            {
              "score": 963,
              "content": "The underwear especially… dear lord..",
              "id": 197,
              "comments": [
                {
                  "score": 193,
                  "content": "This guy is somehow sub Jessie Pinkman…",
                  "id": 198,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Say what you will about Jessie, he had the strongest moral compass of the show. Especially regarding children",
                      "id": 199,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 154,
                  "content": "It's like if a stereotypical boomer wrote a politic cartoon, it would be this clown in his underwear smoking pot in his moms living room",
                  "id": 200,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "Praying they weren't grubby tighty whities",
                  "id": 201,
                  "comments": [
                    {
                      "score": 9,
                      "content": "probably shit stained too.",
                      "id": 202,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Just missing the half eaten pizza boxes thrown about everywhere 🙃\ndude is pathetic.",
                  "id": 203,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 986,
          "content": "This! Most weed users I know (myself included) are considerate of others while living active, productive, fulfilling lives. OP smoking in his underwear midday on his MOM'S COUCH, ignoring the needs of the household and stinking up the place, is just pathetic. YTA.",
          "id": 204,
          "comments": [
            {
              "score": 358,
              "content": "He’s got all the Pearl clutcher up in arms but you guys are right. Honestly I don’t think any of us would even entertain this story if one of our friends told it to us. My first question would’ve been, why were you not outside? Source: years of smoking outside bc my mom DID NOT play that shit lmao",
              "id": 205,
              "comments": [
                {
                  "score": 188,
                  "content": "Yeah man, even after my mom accepted that I smoke weed, smoking a joint indoors was a big nono unless she was gone for the whole week. That shit will stink up the house for a few hours minimum",
                  "id": 206,
                  "comments": [
                    {
                      "score": 176,
                      "content": "the fact that he was smoking a JOINT in the living room😭😭😭 not even a small one hitter or small bong to lessen the smoke💀super inconsiderate to his mums house, YTA big time my dude",
                      "id": 207,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "even when my mom is gone i dont dare smoke in the house. woman has the nose of a bloodhound. and it’s just plain disrespectful. she asked me not to do it, so i wont. simple human courtesy LOL",
                      "id": 208,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Same! We once ingenuously smoked a blunt in my room - don’t worry, we had the windows down and a fan pointed out. I got home two hours later to the nicest woman in the world absolutely FUMING. \n\nI’m sorry ma. We were young and dumb!",
                  "id": 209,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 71,
          "content": "This. 100%",
          "id": 210,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Yeah the literal reason weed looks bad is cause of people like this.",
          "id": 211,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5117,
      "content": "YTA. I can only assume you live with your Mother and she isn't the one living with you. Why are you so disrespectful? At least smoke pot outside and be courteous to the other people who live in the home. \n\nYou have a lot of growing up to do.",
      "id": 212,
      "comments": [
        {
          "score": 1253,
          "content": "Exactly! \n\nYTA OP!\n\nMy brother (30yo & pays rent) been smoking for years, he still takes it outside as respect for our mom and he knows it's not good to do it around his kids. \n\nOP must be delusional from the all the weed he smokes if he things he's NTA.",
          "id": 213,
          "comments": [
            {
              "score": 308,
              "content": "I don't understand people that get high around kids, I don't even like drinking a beer in front of my younger cousins.   \n\n\nI was thinking why didn't he just hot box his car, but I'm assuming he likely doesn't have one. He's lucky his mom doesn't toss his ass to the curb, mine would with a \"reap what you sow\" as the door's hitting my ass on the way out.",
              "id": 214,
              "comments": [
                {
                  "score": 25,
                  "content": "I have a medical marijuana card and never use marijuana when I’m with my son or caring for him. There are absolutely benefits but it’s still a drug that impacts your functioning.",
                  "id": 215,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "I smoke every day and unless my family is, like, OUT OF TOWN I’m going outside to do it. Because come on, man… people have a right to not smell pot all the damn time. YTA",
          "id": 216,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3542,
      "content": "As someone who tokes almost daily and has for nearly a decade.\n\nHard, YTA. Not your house, not your rules. You should be counting your blessings your mom, who is so anti weed, actually allows you to toke in her home.",
      "id": 217,
      "comments": [
        {
          "score": 738,
          "content": "Wouldn't his mum also be affected by the passive smoke?",
          "id": 218,
          "comments": [
            {
              "score": 954,
              "content": "Fuck yes she would be. She's probably walking around high all day not realizing. I'm a Canadian stoner and this winter when it hit -30 C me and the other stoners bought a fishing tent to smoke outside. Walking into that thing when someone is in there is pretty much an immediate second hand high. Granted the living room of his mom's house is SIGNIFICANTLY bigger so she's not getting hotboxed, but she is getting a micro dose any time he smokes in the house. Christ I'm a weed addict and I still wanna throttle OP for the absolute disrespect.\n\nEdit: contact high is the wrong term, what I meant was if he's smoking inside her house, she is also Inhaling second hand smoke and THC in the air. She is getting micro dosed or mildly hot boxed.",
              "id": 219,
              "comments": [
                {
                  "score": 210,
                  "content": "Smoking in a fishing tent sounds like an absolute blast. No worries about stinking anything up from hotboxing.",
                  "id": 220,
                  "comments": [
                    {
                      "score": 167,
                      "content": "It is so much fun actually. It's a hotbox even if you just have half a joint. The only downside is my dog gets sad because we're inside and he's outside and he wants to be where the people are! But like hell I'm gonna let my pupper inside the dank tank. Yes we called it the dank tank because honestly, there isn't a more appropriate term.  10/10 smoking experience. We also added some Christmas lights and an electric heater for extra comfort.",
                      "id": 221,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "[deleted]",
                  "id": 222,
                  "comments": [
                    {
                      "score": 16,
                      "content": "They are, they just used the wrong term, walking into a small area with a huge concentration of smoke, like a lil tent after a joint, means you’ll be breathing in THC and having it absorbed by your lungs. No “contact high” but their point stands.",
                      "id": 223,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "She is certainly not getting a contact high any time he smokes in the house.",
                  "id": 224,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Not unless he’s hot boxing. But if he’s smoking with all the windows open she’s just gonna be affected by the smell bc it’s for sure sticking in the furniture",
              "id": 225,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Oh you bet! I had asthma that developed due to long exposure to car fumes and second hand smoke and my ex triggered it way after I quit the job because he’d constantly be blowing it inside the room\n\nIt hurts to breathe in even a smidge of smoke",
              "id": 226,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 168,
          "content": "Seriously. I smoke, but outside in the yard, not in the home I pay for and take pride in. I’d be livid if someone sat in their undies on my couch and lit up. That smell doesn’t go away, no matter how much you think it does.",
          "id": 227,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 41,
          "content": "She may not even be anti weed. She is very probably anti him being a wasted mess every day. If he smoked after worked, if he was getting dressed and not lying around the house all day in underwear, she probably would not mind that he smoked.",
          "id": 228,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Also, smoking indoors (especially in someone else's house) is fucking nasty. The smoke residue gets into everything and it STINKS.\n\nI toke up from time to time in my own home, but always outside.",
          "id": 229,
          "comments": [
            {
              "score": 6,
              "content": "[deleted]",
              "id": 230,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2734,
      "content": "YTA\n\nDude, you are an adult and you have to ask if smoking weed in the living room right before a 4 year old is about to show up is bad? Really? Go outside and smoke, go to the garage or balcony and smoke, or better yet GET YOUR OWN PLACE AND SMOKE. \n\ndouble YTA for comforming to the stoner loser stereotype. \"Natures super medicine\" gtfouutahereeeee. I partake every once in a myself too, but this is super obnoxious.",
      "id": 231,
      "comments": [
        {
          "score": 839,
          "content": "The medicine thing makes it even dumber, since when is it healthy to take medicine you don't have a specific need for, and every day?",
          "id": 232,
          "comments": [
            {
              "score": 380,
              "content": "Took me a long time to admit that the depression and anxiety I was using as an excuse for over-smoking were being made much worse by over-smoking.",
              "id": 233,
              "comments": [
                {
                  "score": 40,
                  "content": "Same and then a month after I stopped, I stopped feeling so anxious in social settings and rebuilt the bridges I was burning with my family and friends. 100 times happier now, the marijuana spirits a vengeful one when it’s disrespected.",
                  "id": 234,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 107,
              "content": "Heck, I need my breathing medication, but you don’t see me pounding them in handfuls like M&Ms",
              "id": 235,
              "comments": [
                {
                  "score": 11,
                  "content": "You don't recreationally enjoy inhalers? Smh I hit up my breo daily after enjoying some albuterol headrush and snorting montelukast /s",
                  "id": 236,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Lmao now I'm imagining someone abusing an inhaler.  \n\n\n\"I JUST REALLY LIKE HAVING OPEN BRONCHIALS, AITA?\"",
                  "id": 237,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "I chug cough syrup all day, every day. It’s medicine so it’s healthy for me",
              "id": 238,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "I feel it's important to remember he was also only wearing underwear. I feel like that would be just as embarrassing as the weed part.",
          "id": 239,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1364,
      "content": "100%YTA you were warned not to do it and you were too lazy to go outside to smoke. You're an adult start acting like one. Move out get your own house and you can do wtf you want but while under someone else's roof show some respect dude. She asked nicely and you still did it anyway, total AH.",
      "id": 240,
      "comments": [
        {
          "score": 550,
          "content": "I had a giggle at “lounging on the couch in my underwear”.   Your description of yourself sounds like a anti-weed cartoon.  YTA",
          "id": 241,
          "comments": [
            {
              "score": 256,
              "content": "To me it seems like smoking weed is his only personality trait",
              "id": 242,
              "comments": [
                {
                  "score": 77,
                  "content": "That, and lounging on the living room couch in his underwear.",
                  "id": 243,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Can you imagine how bad that house must smell if he smokes \"all day, every day\" inside?",
          "id": 244,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 714,
      "content": "[deleted]",
      "id": 245,
      "comments": [
        {
          "score": 29,
          "content": "Even if it was his own house he'd still be TA its around a 4yo",
          "id": 246,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "Still YTA for smoking knowing kids are coming over",
          "id": 247,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    }
  ]
}