{
  "post content": "look. i haven't said a word about how i truly feel about one of my closest friends still talking to my manipulative ex. i've just said that it sucks. \n\n\ni feel terrible for even thinking this because who am i to tell my friend whether or not he should be friends with someone? also, side note, they're like \"best friends\" and they've known each other since elementary. \n\n\nso i decided to tell my friend about the stuff my ex did to me, like constantly lie to me, manipulate me DURING our relationship and AFTER my ex dumped me by saying that he doesn't have that much time to live because he just got diagnosed with something but only /I/ know, and nobody else can find out, not even my friend, even though they have claimed that they're each other's 'best friend'. \n\n\ni told my friend this, he's one of my closest friends and unfortunately he's \"best friends\" with my ex. my friend told me that he's not going to stop being friends with my ex because nobody else wants to hang out with him BUT my ex, and that my ex is the only one that's keeping him \"company\" since he got back from college. he said that if i want to hate him for that, that he doesn't blame me, but he's still not gonna stop being \"besties\". \n\n\ni told him it's fine. but now, i can't help but feel terrible about it. in our same friend group, one of our friends did some messed up stuff to him and lead him on and stuff and i always backed him up and i always defended him and she WAS one of my best friends. now we occasionally talk here and there. but it sucks because i feel like i'm not getting the same back?\n\n\nALSO. i hate that i think all of that. because i REALLY don't think i have a say in anything my friend does. which is WHY i haven't told him anything and probably won't plan to because i already feel so terrible because i feel like i should stop whining about what happened to me. like people have / had it worse than i do, so why should i complain, or be hurt about something like this.\n\n\nplease don't be rude if you plan to comment, lol, i probably sound like an a hole and that's understandable, because i think i do too.",
  "id": 1,
  "comments": [
    {
      "score": 3,
      "content": "This is high school drama that won't matter in a few years.\n\nMy advice is to get new friends.",
      "id": 2,
      "comments": [
        {
          "score": 3,
          "content": "the only good thing is that i moved away so i hope i can make some new friends soon.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "NAH. Honestly it frankly sounds like you’ve outgrown this friend group and the drama that it’s causing you. You said you recently moved, take that opportunity to make new friends and move on from worrying about these “friends” causing you so much stress",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nlook. i haven't said a word about how i truly feel about one of my closest friends still talking to my manipulative ex. i've just said that it sucks. \n\n\ni feel terrible for even thinking this because who am i to tell my friend whether or not he should be friends with someone? also, side note, they're like \"best friends\" and they've known each other since elementary. \n\n\nso i decided to tell my friend about the stuff my ex did to me, like constantly lie to me, manipulate me DURING our relationship and AFTER my ex dumped me by saying that he doesn't have that much time to live because he just got diagnosed with something but only /I/ know, and nobody else can find out, not even my friend, even though they have claimed that they're each other's 'best friend'. \n\n\ni told my friend this, he's one of my closest friends and unfortunately he's \"best friends\" with my ex. my friend told me that he's not going to stop being friends with my ex because nobody else wants to hang out with him BUT my ex, and that my ex is the only one that's keeping him \"company\" since he got back from college. he said that if i want to hate him for that, that he doesn't blame me, but he's still not gonna stop being \"besties\". \n\n\ni told him it's fine. but now, i can't help but feel terrible about it. in our same friend group, one of our friends did some messed up stuff to him and lead him on and stuff and i always backed him up and i always defended him and she WAS one of my best friends. now we occasionally talk here and there. but it sucks because i feel like i'm not getting the same back?\n\n\nALSO. i hate that i think all of that. because i REALLY don't think i have a say in anything my friend does. which is WHY i haven't told him anything and probably won't plan to because i already feel so terrible because i feel like i should stop whining about what happened to me. like people have / had it worse than i do, so why should i complain, or be hurt about something like this.\n\n\nplease don't be rude if you plan to comment, lol, i probably sound like an asshole and that's understandable, because i think i do too.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "YTA, you can't dictate who they are friends with. It may pain you, but that's not how friendships work. Only in a toxic relationship would you intervene and prevent your friend from keeping one of their close friends because they are your ex.",
      "id": 7,
      "comments": [
        {
          "score": 1,
          "content": "you're right lol, i haven't said a word about it and i really don't think i ever will",
          "id": 8,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "NAH you can feel that way as much as you want. But as soon as you act upon it, or say something about it, yeah you’d be TA",
      "id": 9,
      "comments": [
        {
          "score": 1,
          "content": "yeah that's what i assumed. i don't want to be TA, and make it a huge deal and make it awkward for everyone when he's just one of my closest friends. not worth arguing about.",
          "id": 10,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "[deleted]",
      "id": 11,
      "comments": [
        {
          "score": 1,
          "content": "you're right lol, thank you! i guess i just needed to hear it from somebody else.",
          "id": 12,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "[deleted]",
      "id": 13,
      "comments": [
        {
          "score": 1,
          "content": "i do believe that he does see himself as a friend to my ex because he constantly defends him for EVERYTHING and it just bothered me a lot but i guess i understand because im sure i'd be the same with my best friend. i don't want to force him to stop being his friend, it just sucks seeing him post about my ex on his stories and stuff because it really is always unexpected and everytime i see my ex's face i always get these sort of anxiety attacks and my friend knows about it but still chooses to post him lol.",
          "id": 14,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}