{
  "post content": "My cousin-in-law “Stella” has been obsessed with having the first great-grandchild in our family ever since she married my cousin 5 years ago. When her daughter was born, she was constantly going on and on about how she was my grandfather’s first great-grandchild and how her daughter was the family legacy. It was annoying but her daughter is adorable, so we all sucked it up and humoured her.\n\nWell, 3 months ago my older brother, who is my grandfather’s golden boy, found out he had a son. Without going into too much detail, my brother met “Kiera” while he was at a very low point in his life and was taking a ‘break’ (i.e. hiding away) from life/our family. He gave her a fake backstory and name so when he left, she had no way to contact him to let him know she was pregnant. It took her until 3 months ago to finally get in touch with him.\n\nThis has caused a whole scandal in my family because my brother is the last person anyone would think would accidentally father a child. My cousins all though this would knock him off the golden boy pedestal, but my grandfather was worried my brother would never have kids, so this has had the opposite effect. From what my cousin/Stella's SIL has told me, Stella was fuming when she found out because my nephew is 2 months older than her daughter. Making him the 'first' great grandchild.\n\nMy brother is trying to convince Kiera to relocate to our city so when she brought their son so our family could meet him, we were all on our best behaviour. Stella hated it. She kept complaining everyone was treating my nephew better than they had ever treated her daughter and she started accusing my grandfather of being misogynistic. After the third day of her complaining, I told her to stop being a bitter cow because her daughter was no longer the first great-grandchild.\n\nShe’s since told everyone what I said, and my aunt scolded me for being insensitive and basically made this whole thing about Stella and how hard this was for her. My cousin also sent me a long message which essentially said I was an insensitive AH.\n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 4277,
      "content": "You were doing fine, right up to the word \"cow\". Between your cousin's silliness and your rudeness, ESH.",
      "id": 2,
      "comments": [
        {
          "score": 1335,
          "content": "Better \"cow\" than certain 4 letter words.",
          "id": 3,
          "comments": [
            {
              "score": 3571,
              "content": "Calf, I get you, wouldn’t want to infantilize her too. Good thinking",
              "id": 4,
              "comments": [
                {
                  "score": 302,
                  "content": "I heard this in Peyton Manning's cheerfully clueless voice he uses in commercials.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 89,
                      "content": "Are you talking about 6’5”, 230lb, laser rocket arm quarterback Peyton Manning?",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "idk why but when i met him in person i was shocked his voice sounded like that in real life",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 172,
                  "content": "I swear to God, I'd rather browse reddit for a few minutes than sit in a comedy club for a few hours because y'all are absolutely ***killing*** me sometimes.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Or we could start a ‘Reddit Live’ comedy tour when things finally are safe post-pandemic. Find the consistently funniest posters and take them on tour! 😜",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "This is absurdly funny to me.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "hahaha i love this sm",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "That's awesome and a great response.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 314,
              "content": "Cows are lovely. Stella is not.",
              "id": 13,
              "comments": [
                {
                  "score": 341,
                  "content": "It seems Stella and OP have beef",
                  "id": 14,
                  "comments": [
                    {
                      "score": 130,
                      "content": "But whose the vegetarian?",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 75,
                      "content": "She did sour the MOOd.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 128,
                  "content": "Funny that you say that, because in Romanian, Stela is a very, VERY common name for cows and mares.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 20,
                      "content": "I laughed out loud",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 179,
              "content": "I don’t really get the thinking behind this; “cow” is far, far more gendered than “cunt” - I’ve heard plenty of guys called a cunt but never a cow, the latter is entirely restricted to women. \n\nGranted I’m from Scotland and born into a working class family, so “cunt” wasn’t uttered in hushed tones. Also “cow” is a mistake, because originally we were calling people a bitch - cú means dog.",
              "id": 19,
              "comments": [
                {
                  "score": 149,
                  "content": "All of these derogatory terms for women are thrown around way too lightly.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 27,
                      "content": "Eh, you might get more sympathy were derogatory terms for men not thrown around just as lightly; prick, cock, bastard, etc.\n\nDifference being, half the ones that are supposedly derogatory against women are also used against men; calling a man a “little bitch” for example.",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "Just like the term “pig” for men",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 88,
                  "content": "Cunt literally means vagina though. Maybe in Scotland men are called cunts, and I've heard that about Australia as well, but in the US I've only heard women called cunts. It's also considered more of a shocking insult here. So I'd just chalk this one up to cultural differences.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 61,
                      "content": "Nobody is using cunt to literally mean vagina when using it as an insult. Same way nobody calling you an asshole literally means that you’re an anal sphincter; and nobody calling you a pussy means that you’re a vagina. \n\nCunt and asshole are hard to define with a whole lot of overlap; they’re usually rude and abrasive people who are self-absorbed and willingly hurt others.\n\nThe easier one to show the meaning isn’t the “literal” definition is pussy; as far as I’m aware, pussy is unanimously used to mean coward - when used as an insult, I mean.\n\nOthers like “wanker” and “fucker” aren’t being used literally either; you aren’t literally calling out someone for masturbating or having sex. When you call someone a bastard, you aren’t questioning the marital status of their parents. When you call someone a bitch, you don’t mean they’re a literal female dog. When you call someone a cow you aren’t saying they’re a four legged bovine with hoofed feet.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Cunt is almost a term of affection in australia tbh",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "[removed]",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "Cunt has a wide range of meaning in the UK from humorous endearment to abuse, and is applied equally to men and women. \nBut it's very telling that it is the worst nonracist term of abuse we have, and suggests an evil malignancy of character, whereas prick or cock implies more inflated ego and ineffectiveness.\n\nOr as Eric Partridge put it \"a prick is a fool rather than a knave whereas a cunt is a knave rather than a fool\"",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 0,
                      "content": "“Cunt” is just as misogyny riddled in the Australia and Scotland as it is in the USA. It’s just that women in the USA have been successful in making that misogyny a more public issue than in Scotland and Australia. \n\nFFS, you’re using a term for a woman’s junk to demean and dehumanise someone. Of course that’s fucking misogyny!",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 66,
                  "content": "This is a _stark_ difference between British english and American english, where c*nt is absolutely the most gendered insult you can possibly use, and an order or magnitude more insulting than a simple bitch.\n\nMy English friend who moved to NYC and called someone a \"cheeky cunt\" at work in his first week was pretty amazed by the shocked stares he got.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "While I'm no expert, I believe the english word \"cow\" comes from germanic roots (Kuh in German and koe in Dutch)",
                  "id": 30,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Perhaps I should have noted it, but cú isn’t English, it’s Gaidhlig - and while “cow” comes from cū, cū and cú aren’t the same.\n\nThe insult went from the equivalent of “bitch” to “cow” due to the words being homophones in neighboring countries with different languages. \n\nThe meaning has changed too, to reflect this; a cú was an annoying or insulting person, very much the same as a modern bitch, whereas now it’s come to mean someone who’s fat (akin to calling them a whale). \n\nYou get some hint to the history in that the former meaning is still widespread in Scotland, where the modified version of “fat cow” is pretty popular, while the latter is more prevalent in places like the US.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Depends on where you are in the US,At least in some parts, calling someone a c*nt is the worst thing you can tell them and they will start throwing hands. If you call someone a cow they might think you are calling them fat. Though British comedy and chef Ramsay have kind of helped people see cow/donkey as more of a general insult.",
                  "id": 32,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "Yep I’m from Scotland and agree here.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Don't women like to call men \"pigs\"?\n\nI've never heard that being referred to women.",
                  "id": 34,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "And cow is a coo",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "Consider this... A \"cunt\" is a vagina, and a cow can be either gender...\nI mean, yes, trans people exist and are valid and should be considered into the equation... so not ONLY women have vaginas, but I think you get why I dispute your gendering of the words lol",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 24,
              "content": "I disagree. \"Cow\" is dehumanizing in a really ugly way, with horrible connotations, whereas \"cunt\" is simply a quite strong insult.",
              "id": 37,
              "comments": [
                {
                  "score": 33,
                  "content": "i disagree with that. Bitch is dehumanizing too, and way worse if you compare it to \"cow\", and yet people use that word so freely. Cunt is dehumanizing too? Like I get that its a part of the anatomy, but its reducing a person down to their genitals? \n\nCow is usually used to call someone fat, which Im pretty sure she wasnt trying to do. Its not really even used outside of that meaning (in my experience). In the US, at least, \"cunt\" would be seen as way more offensive (again, in my experience). Cunt is looked at as a terrible word that you really should never say",
                  "id": 38,
                  "comments": [
                    {
                      "score": 3,
                      "content": "It's weird that \"bitch\" is harsher than \"cow\" when you think that most people see cows as food and dogs as pets. Language is pretty random. But regardless, OP didn't need to call her cousin names at all.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 31,
                  "content": "It's interesting how attitudes can vary with this kind of thing. In the UK we actually have research that's been done by our media regulator on social attitudes to various different kinds of profane language. ([Pdf here](https://www.ofcom.org.uk/__data/assets/pdf_file/0022/91624/OfcomOffensiveLanguage.pdf))\n\n'Cow' came out in the mild category, alongside 'arse', 'bloody', 'bugger', 'crap', 'damn', 'minger', and telling someone to 'sod off'. Those words were generally considered of little concern. \n\n> ‘Milder words’ were those that participants felt expressed strong emotions, or were used as light-hearted insults. Many of \rthese were thought to be in common use, including in front of children, and therefore mostly acceptable before the \rwatershed. \n\nYou would likely get away with a kids show like Tracy Beaker calling someone a bitter cow.\n\nMeanwhile 'Cunt' was in the most offensive category, alongside 'fuck', 'motherfucker', and the most offensive racial/homophobic/ableist slurs.\n\n> Participants classed a small number of terms such as ‘fuck’, ‘motherfucker’ and ‘cunt’ as the strongest and most offensive terms in this category of non-discriminatory language. They were seen to express very strong emotions, or to be rude and aggressive insults. The cultural norms around these words meant they were less acceptable to use in front of children. \r\n\n> They were considered unacceptable before the watershed by the vast majority of participants.\r Responses to the word ‘cunt’ were particularly strong. A significant number of participants were uncomfortable with its use \reven after the watershed.\n\nSo I guess whether OP is an arsehole depends on how bad it is to call someone a cow where they are.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "[removed]",
                  "id": 41,
                  "comments": [
                    {
                      "score": -4,
                      "content": "[removed]",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "I absolutely disagree. “Cow” is generally considered pretty mild as an insult where I come from, far less offensive than “cunt”. It’s a bit rude but hardly even qualifies as swearing.",
                  "id": 43,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Places I've worked in the US, the word \"c---t\" would get an employee immediately fired, while \"cow\" would be a counseling session with HR and manager.",
                  "id": 44,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "I resent op used the word, \"cow\", to insult people. Cows are actually very kind and social animals. Don't bully cows!",
              "id": 45,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Cow is kinda fitting too. Cows legitimately don't know their shit stinks and they are impossible to house train. Although it's almost an insult to cows to be compared to Stella...",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "He could of seen her next Tuesday...",
              "id": 47,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "Truth",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "Different degrees of assholery. Still an asshole.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 213,
          "content": "Jumping in here to avoid the lengthy discussion of gendered insults, but this whole family is ridiculous.  Who gives a flying whatever as to which child is the first born anything?  How petty!  The cousin-in-law is a fool for revolving her whole identity around having birthed the great-grandchild - get a life, lady, and some real accomplishments under your belt!  The Golden Child is a horrible excuse for a human being for impregnating a woman under a fake ID  - what a coward, I hope she takes him to the cleaners and then takes the kid as far from this family as possible.  The rest of the family are awful for acting like he didn’t do an bad thing, and OP is foolish for buying into any of this garbage.  ESH (except for the two kids and the woman who was denied true consent by not actually knowing the real identity of her sexual partner).",
          "id": 50,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 95,
          "content": "ESH. Especially grandpa. You yourself mention brother is being given preferential treatment by calling him golden boy. So Stella probably has a point that nephew is being treated better as kid of the golden boy vs her daughter. That said whining for 3 days straight only makes everyone else miserable too. I have no idea how toxic the dynamic is...",
          "id": 51,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 74,
          "content": "I say NTA. She's acting like this for three days, the cow didn't come out of nowhere.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Yeah they also could’ve realized the brother had the first great grandson and she had the first great grand-daughter.  Did none of them think of this to try and lessen the argument.",
          "id": 53,
          "comments": [
            {
              "score": 18,
              "content": "But the point is that nobody cares about being first or eldest, all children must be welcomed as the individuals they all are.",
              "id": 54,
              "comments": [
                {
                  "score": 3,
                  "content": "yeah I know but because the whole thing is over who's first that could've ended things faster.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 1,
                      "content": "It could have ended things faster, till next time because Stella is remarkably like my SIL who was always causing drama everywhere she went. Attempts at appeasing her actually might make things worse given that the great grandfather was actually making a big fuss of the \"new\" eldest.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "First doesn't matter anyway. They're all ridiculous. Babies are ALL special, nobody is a goddamned legacy. Wtf.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yeah, don't insult cows. Cows are lovely",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "No, \"cow\" was perfect.  Lol\n\nNTA",
          "id": 59,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "agree. I don't know why the OP is so invested in this stupidity that she felt the need to call somebody a stupid cow  (really: who GAF about the \"first great grandchild\", let's worry about the \"healthy great grandchild\" mmmkay) or how often she sees her cousin-in-law, like, can't you just mute her? Is she calling you personally to bitch about the fact that your brother knocked someone up b/f she got knocked up? ESH b/c this is just some stupid first world problem bs.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I second this. She had a foot to stand on until she called her outside of her name. \"Bitter\" would have been fine.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I think its less offensive than nearly all other curses",
          "id": 62,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1256,
      "content": "Just out of curiosity, is there something they get for having or being the first great-grandchild?",
      "id": 63,
      "comments": [
        {
          "score": 1501,
          "content": "They think they'll get a bigger inheritance but my grandfather has never said anything about it. It's just an assumption they made.",
          "id": 64,
          "comments": [
            {
              "score": 873,
              "content": "Sounds like they’re using babies to go after grandfathers money, money that he never promised or indicated that he’d give. Sounds pretty messed up to me.",
              "id": 65,
              "comments": [
                {
                  "score": 78,
                  "content": "To be fair, it only seems like the one cousin is using the kid. OP’s brother seems to genuinely just want to get to know a kid that he fathered (at least, that is what it seems like based on what OP said).",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 385,
              "content": "My cousin (first grandchild) made the same assumption about her/our inheritance. \n\nIt was divided evenly between my grandfather’s children and left at that. \n\nSilly girl and her mother really thought she would have received a cash reward for being first born grandchild.",
              "id": 67,
              "comments": [
                {
                  "score": 79,
                  "content": "eh.  i have a wealthy aunt.  i know that my brother and i our her primary beneficiaries, mainly because she's outright stated it.  put simply, she has no kids of her own.  and of my cousins on that side, only one, Melissa, is actually related to us by blood.  and Melissa pretty much cut all contact with the family well over a decade ago, not long after getting married to her husband and moving to west virginia (he's a presbyterian minister, it's where they were assigned).\n\nwhile my aunt does have one other nephew and three nieces, all of them are the children of my mom and my aunt's step siblings, who they didn't even meet until they were into their late teens.  and while they get along well, they aren't all that close.\n\nthough i do suspect that my brother will be getting a bigger portion of the inheritance when the time comes because he has kids and i don't.  which is honestly fine with me, even with my brother being better off than me (well, to be more precise, my sister-in-law is better off than me.  she's an accountant).  any money i wind up getting will be nice, but i don't believe i'm \"owed\" anything.  it's my aunt's money to do with as she wants.",
                  "id": 68,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "My paternal grandfather split it evenly between all three kids even though two didn’t need it while it would’ve been a huge help to the third. Very little went to grandchildren even though we all assumed it would skip a generation. But it would’ve caused drama because my family is 75% of the grandchildren and my uncle is childless. So it just got split 3 ways evenly. In life, my oldest cousin was favored but that was 90% coincidence, not age. Although my aunt did once use the “oldest grandchild” excuse with regards to some family jewelry. \n\nMy maternal grandmother did not. My mother had a rocky relationship with my grandmother her whole life because she always felt like my grandmother just didn’t like her. And that hurt was confirmed with the decisions my grandmother made later in life and in her will. It also caused huge rifts in the family because my grandmother (in life and death) favored the children who wanted to let her do whatever she wanted as opposed to those who pushed for what was best, even when it was harder. My mom decided she never wants us to feel that way, so she’s splitting everything equally.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I understand why your mother would be feeling that pain. My parents always told us that no matter how successful we become, they would always split the money between their kids evenly. Personally, I’m hoping they enjoy their later years to the fullest, and there’s not much to handle once they pass. \n\nI understand why some people think it’s fair to give more of an inheritance to people with children, or who are struggling. But my parents wouldn’t risk causing such a divide and igniting rumours of favouritism or manipulation throughout the family. Money just brings something out in people",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 53,
              "content": "Ugh.   Remind them that theirs was still the “first” to join the family and that great-grandpa met her first and knew her first.   That should settle them down.\n\nI mean, it’s ridiculous, but sometimes you gotta meet crazy on their own level, you know?",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "My grandparents left all the money to their four kids, with instructions to divide it out between their own kids as they saw fit, so as it went down the line to great grandkids they got next to nothing 😂",
              "id": 72,
              "comments": [
                {
                  "score": 59,
                  "content": "My grandma gave every grandkid the same amount regardless of birth order. After that each of her own kids got an equal share after the estate was settled; regardless of birth order, marital status, how many grandchildren they had given her, or financial situations.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 95,
                      "content": "I told my grandfather to spend his money while he was alive to enjoy it.  I said the rest of us would be just fine and would rather he be happy.  My aunt was not happy.  Luckily, my grandfather took what I said to heart and didn't try living like a pauper at the end of his life just to keep her happy.  I got a lot of pictures of him grinning ear to ear those last year's.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "My Grandfather basically did 25% of his total estate (which, honestly, was mostly his daughter who had died a year before him's money, but she had no will) to his Great Grandchildren (my nephews) as a trust, then split the remaining portion up so that his only remaining child (he had 3, my mom and my aunt had passed away before him) got 15%, 10% went to me and my one cousin, 10% went to his executor (his Nephew in law) and then the rest got split up 5% to all his nieces and 2.5% to his friends.",
                      "id": 75,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "My grandparents did the same thing. I ended up getting $1,000 after my last grandparent passed away. I wasn't expecting anything, so that was kind of nice.",
                  "id": 76,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 22,
              "content": "Ew that makes her go from weird to gross",
              "id": 77,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "why is your brother the golden boy? what special treatment does he get?",
              "id": 78,
              "comments": [
                {
                  "score": 41,
                  "content": "He’s the only one that had a similar drive/work ethic as my grandfather so he was his protégé. He doesn’t really get special treatment anymore but my grandfather was very invested in his education when we were younger and made sure he had all of the best opportunities.",
                  "id": 79,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -8,
                  "content": "[deleted]",
                  "id": 80,
                  "comments": [
                    {
                      "score": 20,
                      "content": "He isn’t. He’s the third grandchild and second grandson.",
                      "id": 81,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "That wouldn't work in my family, we have great grandchildren older than some grand children. Probably easiest for great grandpa to leave it to his kids or something",
              "id": 82,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "well thats insane.",
              "id": 83,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "IKR!  Are we not living in the 2000s?",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "A part of me wanted mine to be the first great/grandchild because my family has a tendency to spoil that one more. My sister ended up beating me by 1 month. Lol But she almost immediately moved to Hawaii leaving them only being able to see and easily spoil mine (and boy was he, what was I thinking?) Sure enough they didn't spoil my second the same way and don't spoil my sister's 3 at all.",
          "id": 85,
          "comments": [
            {
              "score": 9,
              "content": "My in-laws are pretty much the same. They only care about the oldest niece. It kind of sucks because we're neighbors, and my kids notice.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "That's an interesting difference to my family that basically only shows attention to the youngest until the next one is born.\nNot to say either is preferable though. -.-",
              "id": 87,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "I’m loving this story. See, I had a bunch of older cousins by the time I came along. The oldest was years older than me, and already had the whole “1st born son” thing going on. \n\nNot that our family has any special history or money or anything. And the next 2 oldest were adopted. It’s really not a thing in our family. \n\nSo I didn’t realize until I was 35 or so that I was actually the 1st-born son of the 1st-born (my dad) of the 1st-born son (my granddad). And possibly even more. I stopped listening. \n\nIt was my dad’s half-brother drunk calling me and bitching me out for being the 1st of the 1st of the whatever. \n\nThe reason I don’t call him ‘uncle’ is because he’s only a year older than me. And I still don’t quite know why he was so upset about who was born first... because A: it’s not even the right generation, he got my dad and my 3 uncles in line of succession before him. And B: he wasn’t even the oldest sibling in his own house!!! He had another half-brother from his mom that he grew up with.",
          "id": 88,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 715,
      "content": "[deleted]",
      "id": 89,
      "comments": [
        {
          "score": 303,
          "content": "From one of OP’s comments apparently the unconfirmed word on the street is the first gets a bigger share of the inheritance. So cousin in law is just worried about how much money she’ll get from Grandpa kicking it.",
          "id": 90,
          "comments": [
            {
              "score": 81,
              "content": "God I just cannot get on with the cousin in law having this train of thought. I know it's an impossible thing to want, but I'd rather my family continued to live than I inherited their money.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 22,
          "content": "It just seems like a strange family dynamic altogether. The brother is obviously the grandpa’s favorite and it’s weird to play favorites with your grandchildren so openly. \n\nI don’t know. Everyone seems overly preoccupied with this whole thing and calling someone a cow isn’t nice. ESH.",
          "id": 92,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 20,
          "content": "Alas, my aunt kicked up an utter shitfit when my mum was the first out of her sisters to get pregnant and nearly cut us off over it (wish she had). That was only in 1989 :/",
          "id": 93,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "My cousin had the first great-grandchild on my mom's side. She got... idk, a cute kid that was the center of attention before his little sister came along a couple years later? Now there are 9 total great-grandchildren, and my cousin actually managed to have both the oldest AND the youngest (oopsie baby). Literally no special treatment because of either \"accomplishment.\"\n\nRealizing that all families are weird in their own way, it still seems like a weird thing to go on about. It seems especially weird since it's not SIL's grandpa. Doesn't she have her own whole side of the family?",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I am the oldest in my family but my sister had the first baby. It’s normal and fine, but you would have thought a thousand angels attended that baby’s every sneeze. \n\nAll subsequent grandchildren were wonderful and loved, but nothing like that.\n\nI think the lady sounds bananas, but getting glory for having the first whatever is a real thing.",
          "id": 95,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 506,
      "content": "ESH. This is a ridiculous tradition based on birth order and it is always really gross when people \"worry about their inheritance\".  Stella is an ass for crowing about how her baby was the first and now crying that it isn't true. You're TA for the way you chose to speak to her. \n\nYour brother, the golden child, the is biggest AH in this story for giving a false name and now trying to get this woman to relocate to him rather than maybe relocating to be closer to her. Even without the relocating part, your brother is a gigantic AH.",
      "id": 96,
      "comments": [
        {
          "score": 286,
          "content": "> Your brother, the golden child, the is biggest AH in this story for giving a false name and now trying to get this woman to relocate\n\nUgh, yes. He’s a terrible person, who is somehow being rewarded by everyone else in this story for doing a terrible thing.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 206,
          "content": "I lol’d when OP said that the guy who decided to take a “break” from his real life and family was the last person they ever expected to knock someone up.",
          "id": 98,
          "comments": [
            {
              "score": 53,
              "content": "Right? I can't believe someone who would just run away and take a break from real life would ever do something reckless and with consequences!",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I think I might need a break from that family too...",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "I'm surprised not more people are talking about how gross the family is for this 😩💀 Especially the brother!",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Yep, I agree with every bit of this - well stated!",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -4,
          "content": "I mean it depended maybe he has a better place for them, there’s not enough information to MSN’s that claim",
          "id": 103,
          "comments": [
            {
              "score": 6,
              "content": "He is an AH regardless for his treatment of this woman.",
              "id": 104,
              "comments": [
                {
                  "score": -1,
                  "content": "For giving a false name yes, but as I said before it depends on her living arrangements, Would he be the asshole if he is trying to get her to move with him and if she lives in say a motel, or ghetto. No\n\nBut then again no one has information on that, so we can’t make a yes or no decision, Atleast on the moving part that is",
                  "id": 105,
                  "comments": [
                    {
                      "score": 7,
                      "content": "My point is, I don't see any use in arguing about his relocation intentions.",
                      "id": 106,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 308,
      "content": "Info: Family dynamics matter here. Does everyone in your family put emphasis and importance on being the \"first\" whatever? Or is it just something your cousin made up to feel important? *Is* your brother's kid being treated significantly and noticably better than her kid?",
      "id": 107,
      "comments": [
        {
          "score": 370,
          "content": "> Does everyone in your family put emphasis and importance on being the \"first\" whatever? Or is it just something your cousin made up to feel important? \n\nHonestly, yes. It's a little old fashioned but they see the first as the heir so there are perks but it's not so much for great-grandkids as grandkids. So my dad is doing way more for my nephew than he did for Stella's daughter.\n\n&#x200B;\n\n> *Is* your brother's kid being treated significantly and noticably better than her kid? \n\nI personally don't think so. It's more that we're meeting him for the first time as a 1-year-old instead of as a newborn so there's more you can do with him/for him. There's also a sense of making up for the lost time and since he lives in a different city to us, no one knows when we'll see him again so with gifts my family did go overboard.",
          "id": 108,
          "comments": [
            {
              "score": 113,
              "content": "Do you mean your grandad is doing more for your nephew? Cause wouldn’t your dad be Stella and your cousin’s uncle?",
              "id": 109,
              "comments": [
                {
                  "score": 211,
                  "content": "Nope, my dad. He is my cousin’s uncle so he did some stuff for their daughter too because my aunt was complaining her husband was useless, but not as much as he is planning to do for my nephew. \n\nIf my grandfather has done things for either kid it isn’t public knowledge.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 466,
                      "content": "So your dad cares more about his own grandchild than his great niece? Thats just normal.",
                      "id": 111,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": -42,
              "content": "I'm gonna go with ESH. It sounds like your cousin may actually have some valid points to her feelings if being \"first\" actually means something. That could easily be rectified by your family dropping the antiquated tradition of treating being the oldest like it's some sort of accomplishment or merit.\n\nYou can see how it would be painful to see your own kid knocked out of some special standing within the family by the golden child's surprise baby, right?\n\nShe probably didn't need to complain so much to everyone. You *absolutely* didn't need to call her a cow.",
              "id": 112,
              "comments": [
                {
                  "score": 36,
                  "content": "God I hope this doesn't persist as the children grow older. They can absolutely sense favoritism and it can affect them negatively.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 211,
      "content": "ESH - \n\nYour brother put the (now) mother of his child in a difficult position by not being honest with her about who he was.\n\nStella's complaints were poorly timed, though they may be legitimate.\n\nY-T-A for calling her a \"bitter cow\".  It's just rude and added oil to the fire.",
      "id": 114,
      "comments": [
        {
          "score": 54,
          "content": "This is by far the most accurate response. Everyone here, except the mother of the 1 year old, has behaved pretty terribly. Including the family dynamics of having a golden boy and putting such emphasis on birth order.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -8,
          "content": "What would have been better? Better #itch? I mean, I get it wasnt nice to say but if the CIL has been insufferable for years, I can understand why she snapped.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 189,
      "content": "NTA\n\nYour cousin is ridiculous. Just tell her you all love her baby to bits because of who she is not the order in which she came and that's she's the only person who gives a damn about crap like that. Nobody else cares.",
      "id": 117,
      "comments": [
        {
          "score": 13,
          "content": "This is the most sensible reply here so far.\n\nNTA",
          "id": 118,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 57,
      "content": "Lol Stella is a brat. I’m a soft esh to NTA.\n\nEdit: I’m super stoned so I feel obligated to add that of course calling someone a bitter cow is super rude. It does seem to be true & sometimes people just need a dose of reality. Your friendship is probably over though",
      "id": 119,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 42,
      "content": "ESH\n\nName calling was not warranted. It also destroyed any chance you had of having your point heard. Stella is being ridiculous. So is your aunt if she thinks it is rational for this to be in abt way difficult for her. Stella's weird fixation on family birth order does not sound healthy. She should probably see someone.",
      "id": 120,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 35,
      "content": "ESH.  I understand your frustration with Stella but there was no need for that language.  Stella was clearly crowing about the first grandchild too much and it was no doubt irritating.  Curious if this is an inheritance issue?   Does the first grandchild get a prize?",
      "id": 121,
      "comments": [],
      "relation": "No"
    }
  ]
}