{
  "post content": "Please try not to spread this around elsewhere but if you really find it that amusing then I can't stop you Ig. This is embarrassing \n(also my English isn't that great, sorry about that) \n\n\nOk ok, so before you say anything, I know this sounds really weird but shit happends. Basically what happend was that my brother (18) and his friend ate some bad muffins and they started vomiting and uh... Pooping.. alot. His friend went home but when my brother tried to shower some kind of explosion happened 💀 For some reason our mom didn't ask him clean it up (she never makes us do anything) but she had a long day and really didn't feel like cleaning. I (15 f) really wanted/needed to shower (girl stuff, iykyk) but when I asked our mom about it she got mad at me for \"bossing her around\", I kept (nicely) asking if she could please just make him clean it but she kept insisting that it wasn't that bad. I went to look and I'll admit, it wasn't so bad. Just some splatter (I know 🤢) on the wall and some dark stains here and there, but the thing is I CAN NOT handle stuff like that. At all. I almost vomited and I was begging my mom to clean it so i could shower, I thought it was a reasonable request to let me not have to shower in literal shit but apparently not. It turned into a fight, she kept yelling at me that she's tired and I'm being a crybaby and bossing her around. I was already in a bad mood and I *needed* the shower, so I started crying and yelling her to stop and that this was really mean (I'm really sensitive and can't handle being yelled at). She eventually cleaned it up, I don't know why she didn't make my brother do it, considering he was feeling ok. So, am I the ass hole for yelling back at her and not wanting to shower with literal shit?",
  "id": 1,
  "comments": [
    {
      "score": 11862,
      "content": "\"AITA for refusing to go in the shower after my brother pooped in it\"\n\n**NO. NTA. That's all I had to read.**",
      "id": 2,
      "comments": [
        {
          "score": 3118,
          "content": "I know it sounds like I would definitely not be the a hole but you should read the rest 😭 it's complicated",
          "id": 3,
          "comments": [
            {
              "score": 3562,
              "content": "You still arent TA. Your mother should've either cleaned it or had your brother clean it",
              "id": 4,
              "comments": [
                {
                  "score": 2174,
                  "content": "Brother should have just cleaned it while he was in the shower. Not that hard, water is already running.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 878,
                      "content": "This. One day that's going to be his shower with no mommy to clean it for him. He needs to get to learnin'.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 129,
                      "content": "I recently discovered that you can clean the shower while taking a shower and now I'm questioning why anyone would choose to do it any other way.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 112,
                      "content": "Throw on some soap, rinse, disinfect. Etc.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "My thoughts exactly. Who the fuck is comfortable with spray painting a shower that your family uses with diarrhea and just leaving it there? Just rinse it off while you’re there. The brother is disgusting.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "LITERALLY",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Not only the water was running!!",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Exactly, I’m lactose intolerant, and it’s bad, like crying naked on the floor, literally feeling like my stomach is being used as a bag pipe, worse than my period bad and I will still clean up after myself no matter what I do or how terrible I’m feeling",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 297,
                  "content": "100% the brother should have cleaned it.  If he's old enough to wipe his own butt, then he's old enough to clean his own shit out of the shower.  It's beyond gross to think this could possibly be anyone else's job.\n\nOP is still not the AH, but it's her mom's job to wrangle some sense into her son.  Right now she's failing as a parent.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Honestly, I'd just sponge bath in the sink until Dad needs a bath then let him have a discussion with the prodigal son about \"why the fuck am I showering in your literal shit, are you a baby who needs his nappy changed.\"",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I agree mom needs to teach the kids to clean up after themselves. Sounds like it might be a cultural thing to me, but definitely not helping her son to learn to be independent. And if he lives with mom until he's married, his future wife is not going to enjoy cleaning up after him either, so this needs to change.  I feel like OP should have bothered her brother more about it than her mom.  But she may have tried already and then went to mom when he wouldn't. And why would he if he's never had to lift a finger before? Mom needs to stop being a martyr and make her kids help with the household chores. Particularly messes that they are solely responsible for making.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -5,
                      "content": "The one caveat to this if this is a single parent household, that parent holding the fort down with all the stress and possibly working long shifts, or several jobs. In that case, the brother should have cleaned it anyway and OP should have womaned up and tried to facilitate that. \nIf the above is the case, then OP’s mom is NTA either. \n\nAssuming story and ages checked out, OP should have talked to her brother first and tried to solve issue. Or cared for him if he was that sick. Many kids would have talked to each other first. \n\nAs a parent and having adulted early myself, I can’t imagine being 18 and NOT cleaning it up. I can’t imagine being 16 and not dying of shame at the thought of leaving this mess for someone else. \nI can imagine my kids asking for help, but if a kid of mine came to me like this I’d try to use it as a parenting opportunity to both kids. Lessons would be care for sick loved ones/ cleaning up after yourself from here on out and here’s how/ how to ask things in a respectful manner and try to problem solve. \n\nYes OP’s parent shouldn’t make her clean it but honestly, I’d like the mom’s perspective. \nIt’s possible mom is an insensitive jerk. But who knows how much of this is perception and misinterpretation or misrepresentation. \n\nI feel like there’s not enough info about OP’s contact or lack thereof w brother and the response she got. \n\nSo unlikely to be TAH, but if mom is single, slammed, beyond tired, and OP didn’t go to brother first then OP is behaving in a distasteful manner. \nShe doesn’t HAVE to shower. I’ve been  in situations where I couldn’t, and I made do w the sink and a towel in a pinch. Ideal world- every kid should have a clean shower always. Always. But sometimes life doesn’t work that way for one evening. \n\nTLDR: I want to say NTA but there’s not enough info really.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 145,
                  "content": "This should be the top reply.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 89,
                  "content": "Well if he was that sick i get It not making him clean It but shit the mom should have least did It.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 24,
                      "content": ">but shit the mom should have least did It.\n\nAs it were",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "This. She is the parent, and even if OP wasn't a child, it's not her responsibility at all. It's the responsibility of the brother, who had the incident, or the mother, who (again) is the parent.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 219,
              "content": "I read the whole thing and no, it's not. That's gross. I wouldn't go near the shower until it had been thoroughly disinfected and it's not your job to do so.",
              "id": 21,
              "comments": [
                {
                  "score": 64,
                  "content": "NTA. Seriously I would pack my bags and go to a friends house or another family member. Your parent is not being a parent. Sorry, that you have to deal with this.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 119,
              "content": "It’s really not complicated. It’s extremely simple. Your brother is an asshole for not cleaning it, and your mom’s an asshole for not making him clean it.",
              "id": 23,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 93,
              "content": "Oh honey we read it it's okay you're not the asshole😂 That's crazy dude😂",
              "id": 24,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 83,
              "content": "The shower wasn't cleaned and disinfected after he pooped in it and you can still see some poop splatter. Of course your NTA. The rest of the post doesn't make a difference.",
              "id": 25,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 83,
              "content": "No, it's not complicated: your mom babies your brother and doesn't make him clean up after himself, even when it's literally his own shit, in a location that can be hosed down.  Sorry to trash talk your family but your mom and your brother are both pathetic.",
              "id": 26,
              "comments": [
                {
                  "score": -2,
                  "content": "[deleted]",
                  "id": 27,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I could wear moon boots and jump to less conclusions than you. Also, how is OP pathetic? She doesn’t want to clean someone else’s shit. How tragic.",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 43,
              "content": "the fact your brother just left it there instead of cleaning it himself-\n\nhe should be embarrassed at how much of a asshole he is. you're NTA",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "Nah. You are not the asshole and I read it, in its entirety. In WHAT FUCKING WORLD would your brother not clean up his own shit from the shower. I couldn’t get past that part. I’ve been sick af before. Things happen. But you gotta clean up, bro. Unless your <12 yo, that shits on you. No pun intended.",
              "id": 30,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 32,
              "content": "No it’s not. Your mom didn’t want to clean it. But she also favors your brother so she wasn’t about to make him do it. \n\nBut he’s not a baby. He can and SHOULD clean up his own poop. \n\nI had a roommate once who managed to get explosive diarrhea all over the toilet, tub and floor. And you can bet i woke her ass up and made her clean up the bathroom before i set foot in it. The whole time she was whining that it wasn’t that bad. Like HELL it wasn’t bad! Any amount of fecal matter that is not on the inside of a toilet bowl is BAD.",
              "id": 31,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "Nope, you're totally not in the wrong here and its not super complicated. Also any amount of poop in the shower is that bad. NTA -your mom telling you it isn't that bad is blowing my mind.",
              "id": 32,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -2,
          "content": "Well, you really need to read more. I mean, what if her brother pooped in it 10 years ago and it was cleaned up and she is still refusing to take a shower. That would be ridiculous.",
          "id": 33,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3822,
      "content": "UGH your brother is gross. NTA, he should have immediately sprayed that shit down with bleach and apologized.",
      "id": 34,
      "comments": [
        {
          "score": 1339,
          "content": "This made me giggle lmao. I made fun of him for it but he said he couldn't control it and that it just happened 💀",
          "id": 35,
          "comments": [
            {
              "score": 1234,
              "content": "Sure, but your brother is a damned adult. He can clean up after himself.",
              "id": 36,
              "comments": [
                {
                  "score": 198,
                  "content": "Can wait until he shits in his future girlfriends shower",
                  "id": 37,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Future ex*",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 844,
              "content": "He can’t control sh*tting himself in the shower…he CAN control how he deals with the aftermath. Your bro is the AH. Are you from a culture where boys don’t learn to clean up after themselves? If so I am so sorry. \n\nNTA",
              "id": 39,
              "comments": [
                {
                  "score": 258,
                  "content": "I wouldn't really say so. It's not really about our culture, some people are just lazy and some aren't 🤷‍♀️",
                  "id": 40,
                  "comments": [
                    {
                      "score": 326,
                      "content": "Idk why but that makes it worse.\n\nWhat kind of 18 year old MAN doesn’t respect his family and himself enough to clean up after himself?!",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "I don't know what culture it's acceptable to shit all over and not clean up after yourself as an adult. But I'm glad it's not a culture I'm a part of.",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "It's not about laziness, it's about being allowed to create a mess and not be responsible for it. Your mother isn't teaching him how to be an adult. Is she expecting a woman to look after him? \n\nThis honestly seems like a cultural thing. A culture where women are second class citizens. Don't forget women are second class citizens in the western world too, just to a different level. Why does your mum clean it up? By does your mum not teach your brother to clean his own poop?",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 40,
                  "content": "I mean, I've had food poisoning where I could hardly move. If he had *tried* to clean up but missed some spots, that's one thing. But to make no attempt in a location as easy to clean as a shower is just mind boggling. \n\nAnd to make someone who is *gagging* have to do it? Oh hell no. \n\nIn my family, we all have different things that make us involuntarily gag. After the first *hork* it is acceptable to get someone else to do it *so you don't make a bigger mess by vomiting everywhere*. That's just common courtesy all the way around.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Right like make a cup with your hands, fill with water, dump out over the poop and wash it down the drain. It’s a two-step process that can be repeated as needed! When I was pregnant I threw up in the shower all the time but I cleaned it up before I got out so no one knew!",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Sure, he couldn't control the poop explosion, but he damn well could control his decision to not clean up.",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "I always like to say that things like this aren’t necessarily the persons fault, but it IS their responsibility.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "As a person who once got Norwalk and exploded from every orifice simultaneously in the bathroom one time, it doesn’t take a lot to turn on a shower and rinse it away… I literally fainted from dehydration and almost broke the tub falling into it in a fountain of puke, and still cleaned the shower before I cabbed it to the hospital. Why? Because my bf at the time needed to shower the next morning and I didn’t want him dealing with my crusted ectoplasm. He said the next day it would have been fine but honestly, not his job.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Ok so he couldn’t control it, so he should have cleaned it immediately and apologised…",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Shit happens but that doesn’t mean he can be lazy about cleaning it up",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Does he not know how to work a shower head? Like I've had a similar thing happen in the shower and then I turned the water spray so it would rinse the poop off (I did also clean it with bleach). Like there's no reason for there to be *visible evidence*.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "uknow what i did after i accidentally threw up in the shower?\n\ncleaned up like a fucking adult LMFAO",
              "id": 52,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Why would that make you giggle?! It’s a completely serious answer and if you don’t see that you’ve had a fucked up upbringing.",
              "id": 53,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Honestly! Why did he not clean it and spray it down while he was in the shower👏👏👏👏👏",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I mean it's literally *the shower* he couldn't have sprayed it while he was in there?? And then disinfected afterwards. There's no reason for him to have left splatters on the wall, it was probably dried when the mom finally decided to clean it. \n\nNta",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I really feel bad for the poor women who ends up dating/married to the brother.. NTA",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "If he pissed too he shouldn’t use bleach, urine has ammonia in it and bleach can react to it and make chlorine gas",
          "id": 57,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1326,
      "content": "NTA everyone knows you waffle stomp the nugs down the drain",
      "id": 58,
      "comments": [
        {
          "score": 614,
          "content": "STOPPPP 💀 This is the funniest reply what",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 204,
          "content": "English isn't even my second language, so I had to mentally put pictures to what you wrote to really get what you meant.\n\nEw.\n\nYou owe me a big bucket of brain bleach.",
          "id": 60,
          "comments": [
            {
              "score": 48,
              "content": "/r/eyebleach \n\nHere ya go!",
              "id": 61,
              "comments": [
                {
                  "score": 5,
                  "content": "https://m.youtube.com/watch?v=hBzniTwBv_Y\n\nEdited because my stupid ass didn't copy the link correctly.",
                  "id": 62,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Ed Larson????",
          "id": 63,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Best. Comment. Ever.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 859,
      "content": "NTA\n\nYour mom should have made your brother clean up his shit. Making you clean yourself in literal shit is the cruelest thing I can think of and pretty damned shocking.",
      "id": 65,
      "comments": [
        {
          "score": 131,
          "content": "Exactly! My poor child had COVID last week and had the same thing happen to them on the way to the rest room. Unfortunately they had to clean it up themselves because we were having them quarantine the best way possible. \n\nAbsolutely YNTA!!!!",
          "id": 66,
          "comments": [
            {
              "score": 22,
              "content": "Not even related to the post, but I’m only 21F, no kids, having Covid made me soak the sheets in pee from the coughing. I’d *almost* rather shit, at least most of it can be picked up rather than soaking through too much lol. Hope your kiddo is doing better! As for OP, you are NTA in any way. Really, your brother should’ve cleaned up after himself.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -4,
          "content": "I completely agree, they’re NTA. But they definitely shouldn’t scream and yell at their mother like that, clearly their mother wasn’t in the right, it’s just not OK to scream at your parents. I don’t know if I’m gonna get down voted for this or not but it’s just my genuine opinion. It’s just wrong to scream at your parents, it feels bad to read and even worse to watch happen in real life. I’m glad you got your shower, but you should’ve been screaming at your brother if you really needed to. Make sure your mother knows she needs to take care of her kids, and needs to make your brother clean up his own messes, but after she’s aware of that make sure you apologize for your behavior (assuming she does too).\n\nI wish you all the best OP.",
          "id": 68,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 560,
      "content": "I’m baffled by the people telling this child that she should have either cleaned her brother’s shit or gone to him instead of her mother. There are two adults in this story. OP is not one of them. The brother is a disgusting asshole for not cleaning up after himself, and the mother is an asshole for not teaching him better. OP is still a minor which means the mom is responsible for providing her a clean, feces-free space to address her hygiene. If the nasty brother can’t be bothered to clean up his literal shit, that’s on the mom who created this problem with lax parenting, not on a 15-year-old who wasn’t even involved. NTA.",
      "id": 69,
      "comments": [
        {
          "score": 84,
          "content": "Yup.\n\nMy son at 8 knew if he missed peeing he was responsible for cleaning it up.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 73,
          "content": "Or if the brother is still so ill he *can't*, it still falls to the parent first. That's part of parenting. If they were all adults, then yeah. But they're not.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "This is what I was thinking. When I was 15, my 18yo bro DGAF what I said or did. No way would he go clean up his own matter spatter just because I asked “nicely” (and really, does a younger sibling EVER sound anything but whiny to an older one??)",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -4,
          "content": "At 15 OP is mature enough not to yell at her mother and be a brat about the situation. She could have skipped the shower and clean at the sink if it was that big of a deal.",
          "id": 73,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 297,
      "content": "NTA. Your idiot brother should’ve cleaned it up.",
      "id": 74,
      "comments": [
        {
          "score": 137,
          "content": "This. How does anyone shit in the shower and then just… leave it there??? He needs to learn to clean up after himself instead of expecting their mom to do it for him.",
          "id": 75,
          "comments": [
            {
              "score": 46,
              "content": "See, I’ve had food poisoning so bad before where I almost landed in the ER because I couldn’t even drink water without it coming right back out and I was so dehydrated that I basically collapsed when I stood up \n\nBut if I had a 💩 accident while in the shower? I would summon the damn strength to at least redirect the shower head to rinse the damn wall clean.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "This, like what sort of entitled little baby is that brother that he shits in the shower and just leaves it there.\n\nNTA\n\nwhen i first read the title i assumed her brother was a toddler  and it was already cleaned and she simply threw a fit. But no her brother simply acts like a toddler and it was still there.",
          "id": 77,
          "comments": [
            {
              "score": 14,
              "content": "Omg I had to go back and reread because I thought her brother was like 13 or something. No! He’s 18! This is a grown man! I can’t",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "One time my brother got drunk and vomited all over the bathroom. My mom handed him a bucket and sponge, and told him to get to cleaning.\n\nShe had 2 rules after all the years living with drunks:\n1. You clean up your own mess\n2. You sleep where you fall (within safe parameters)",
          "id": 79,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 143,
      "content": "INFO: why didn’t you make your brother clean it? You could have told him you’d put his 💩 on blast if he didn’t clean it.",
      "id": 80,
      "comments": [
        {
          "score": 153,
          "content": "I tried to get our mom to tell him but I didn't want to because he low key has anger issues and he was feeling sick earlier",
          "id": 81,
          "comments": [
            {
              "score": 98,
              "content": "A couple hours afterwards he should have recovered enough to clean up his shit. Right after I’d be more sympathetic. But after drinking water and taking a nap he should be good to spend 5 or 10 minutes cleaning/bleaching.",
              "id": 82,
              "comments": [
                {
                  "score": 18,
                  "content": "I don't know when I wa like 8 anytime I vomited and made anything dirty I would start crying feeling so bad someone had to clean that up. And my mom would tell me not to worry lol. I can't imagine being like the OPs brother.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 28,
              "content": "So why couldn’t you go ask when your mom said she was tired? “Hey bro, mom’s completely exhausted and I need a shower. Can you please go spray some bleach and clean up the shower?”",
              "id": 84,
              "comments": [
                {
                  "score": 20,
                  "content": "I'm a little surprised the mom is getting so much hate, honestly. Like my mom was a single mom of 4 and was working all the time, I could never imagine yelling at her like that nor would I just be cool with people on reddit talking shit about her, regardless of if she was a bit in the wrong or not.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 56,
                      "content": "She was full non stop in the wrong. Telling someone to bathe in a place with shit is a major issue. Not only unsanitary, but basically telling her she is shit. \n\nAnd as the OP said she doesn't let anyone do anything. She didn't make the brother of 18 clean it. Even if the OP is yelling at her, whose parenting is at fault there? She was yelling at a teen for not wanting to take a shower surrounded with shit. How is that reasonable in any way?",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "She was okay with allowing her son to grow up without teaching him anything, while ensuring her daughter suffered because of it. \n\nHe has anger issues - hmmm, perhaps he just knows he can lose his temper and not have to do anything. the mother is 100% at fault. She needed to teach her son responsibility, and she didn't.",
                      "id": 87,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -1,
                      "content": "Right? OP is 15. Old enough to understand that mom is tired right now. Yes, mom should have brother clean it up. But if you want it done right this second, go to the person actually responsible for the mess instead of yelling at your mom!",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "I'm genuinely worried that you're not safe in that house. Your brother has anger issues, and your mother screamed at you for making a perfectly reasonable request. What else is going on in your home and is there any other relative you can stay with?",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "Should 💩 in his bed",
          "id": 90,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 112,
      "content": "Am I the only one who has issues with the mom telling her daughter to stop bossing her around? That seems odd. The mom seems like the root of the problem to me. Never making her kids do anything. Teasing her daughter and calling her a crybaby while complaining about being bossed around. She was tired? Things still needed to get done. NTA",
      "id": 91,
      "comments": [
        {
          "score": 18,
          "content": "Yeah, that seems like seriously unhinged behavior.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 70,
      "content": "NTA. You shouldn't have to clean up after your adult brother. I'm sure no one wipes their shower down after each use but excrement on the walls is too far",
      "id": 93,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 70,
      "content": "Info: what the fuck",
      "id": 94,
      "comments": [],
      "relation": "No"
    }
  ]
}