{
  "post content": "Asking about/for a friend.\n\nMy friend's been in a relatively loveless marriage with her husband, let's call him B, for several years, & they have 2 young children together.\n\nI met them both a few years ago, early into the marriage, & have always been cordial with B. They've always seemed like a bad fit for one another. Conflicting personality types, different hobbies, even different tastes in food. But they're married, I always figured they had some deeper connection. Also, I didn't feel I knew her well enough to say anything.\n\nOver the years though, the conflicts between them have escalated, and a few months ago I felt so uncomfortable by a fight they had in front of me that I had to say something to her. I told her it often seemed like they were a bad match for each other, because of their many differences. I also felt he was being mean & dismissive to her.\n\nAt that point, she told me a lot that I didn't know. For one thing, the meanness--which she describes as \"contempt\"--is apparently a personality trait that she's been trying to parse for years. He seems to genuinely want to understand why she is upset in a given situation, but despite his sincerest efforts, he can't seem to put himself in her position mentally. \"He lacks empathy,\" is what she told me. \"He doesn't mean to, and he doesn't think he does, but he can't understand other ppl's feelings.\" And then, she says, he gets mad.\n\nTBH I was a little dismissive of this cuz I thought that was kind of a cop-out way to avoid the real issue of being poorly matched for one another. I asked if she'd ever brought it up to him, she said yes, but he got so offended & angry that she never wanted to bring it up again.\n\nSo fast forward to yesterday. My friend told me that they'd been going to see a marriage counselor for a few months. She specifically found a marriage counselor who specializes in spectrum disorders, but not in a conspicuous way, so as to keep the information from B. After several long meetings, the counselor agreed with my friend that yes, B \\[might be\\] on the spectrum, and yes, he appears to be unable to empathize w/ other ppl. This helped to explain a lot of confusing behavior for my friend, because she did not want to believe that he actually \\*was\\* as unkind as he had been behaving towards her. The counselor's agreement was comforting to her because it gave her a framework through which to understand his behavior.\n\nMy friend feels relieved to have some answers, though of course the challenge now is B doesn't have a clue. It sucks that she did it so secretively, I'm sure he'll think she's an asshole, but I feel like, maybe that's to be expected, given the circumstances?\n\nSo... I guess what I'm asking, IS my friend TA for having him evaluated behind his back?\n\n*edit: I did not mean to imply that all people with ASD cannot feel empathy, learn how to act on empathy even if it's not first nature to them, or understand feelings. I do not believe that, & I apologize if it reads that way. The 3000 character limit forced me to delete a lot of context about my two friends, and I did not mean to be reductive or ableist in my depiction. I added a bit more to clarify.*",
  "id": 1,
  "comments": [
    {
      "score": 49,
      "content": "[removed]",
      "id": 2,
      "comments": [
        {
          "score": 16,
          "content": "[removed]",
          "id": 3,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "I wanna be clear that I did not know about this diagnosis... nor am I clinically certified to agree or disagree with the counselor's diagnosis in the first place. NOR do I think it was ethical to give a diagnosis to anyone but the patient... but I haven't yet determined whether that's exactly what happened (& thank you to the person who pointed that out, elsewhere in this thread). I'm relaying the situation as it was relayed to me, in hopes of getting some moral/ethical clarity.\n\nI mentioned above that she \\*did\\* try bringing it up to him, and was met with anger and defensiveness. I honestly think that's understandable, depending especially on how she brought it up.",
          "id": 4,
          "comments": [
            {
              "score": 8,
              "content": "[deleted]",
              "id": 5,
              "comments": [
                {
                  "score": 1,
                  "content": "Nah it isn't, I agree. But out of curiosity, are you asking if it matters whether *any* diagnosis was given, because the patient had no input or knowledge? ",
                  "id": 6,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 27,
      "content": "she didn’t get him tested? they went together to a counselor and after several sessions the counselor determined he was on the spectrum. i guess i need the INFO: did the husband know the counselor specialized in spectrum disorders?",
      "id": 7,
      "comments": [
        {
          "score": 9,
          "content": "No, he does not. They are going for marriage counseling, so that's what he thinks. The counselor has some kind of specialization in spectrum disorders in addition to specializing in marriage counseling. \n\nHe's not going willingly, either.",
          "id": 8,
          "comments": [
            {
              "score": 11,
              "content": "i mean, he’s going willingly unless she literally pushes him off in a cart. i think your friend is NTA. probably most therapists would arrive at a similar conclusion. the problem is, how to tell him this? i think the best way is for the therapist to invite him for a solo session and raise this matter, but idk, maybe that’s not what therapists do",
              "id": 9,
              "comments": [
                {
                  "score": 12,
                  "content": "She is TA for lying by omission to him and manipulating him into a situation",
                  "id": 10,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "I have been wondering about the same thing. I want to be supportive to him, too. I feel shitty just knowing about it. But I also understand her position. ",
                  "id": 11,
                  "comments": [
                    {
                      "score": 7,
                      "content": "i mean, i don’t see why is this ‘mean’ to him. like, imagine they went to a kidney doctor to consult about kidney stones, and the kidney doctor, having knowledge of all organ besides the kidney specialization, notices that the husband has liver problems. shouldn’t he be made aware this? it’s a medical issue, it’s not personal",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 10,
      "content": "YTA\n\nOr rather your friend is the asshole, and the counsellor. Getting any kind of medical testing done (yes, mental health is still medical testing) without the consent of the person being tested is horrifying and the biggest asshole move. I sympathize with the circumstances, but that absolutely does not make going behind his back okay in the slightest. Imagine you tricked him by switching family doctors and getting the doctor to use the routine blood draw to test for something you suspected he had without his consent. Seems shady, right? That’s because it is. She ABSOLUTELY needs to come clean to him, stop seeing that counsellor, and apologize to him profusely for violating his privacy so disgustingly.",
      "id": 13,
      "comments": [
        {
          "score": 0,
          "content": "Yeah the blood example does really make it seem shady. But in this case, doesn't it matter that the specific thing she got him evaluated for was, in some sense, an inability to understand her desire to get him tested?",
          "id": 14,
          "comments": [
            {
              "score": 7,
              "content": "No, it doesn’t matter at all. Because either she asked him to be tested and he refused, or she never asked him and just did it anyways, both of which are unforgivable and awful. ANY medical testing being done on someone without their explicit consent is an asshole thing to do, and depending on your area, potentially violates patient rights. I’m horrified that a counsellor agreed to test someone without their knowledge in the first place.",
              "id": 15,
              "comments": [
                {
                  "score": 2,
                  "content": "Yeah, I agree with you about the counselor. My initial reaction when she told me was to balk at how unprofessional I thought it was. It's also possible that my friend came to that conclusion based on asking questions around it, you know honestly it makes me want to go back and ask whether the counselor actually said it explicitly. My friend seemed convinced that she had, & I had no reason to doubt. It's possible that the counselor said something along the lines of \"I agree that he appears unable to empathize, and he may be on the spectrum\" --- does that violate patient rights if she didn't say it explicitly? Agh yeah this all does seem really shitty. The way she went about this is definitely shitty.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Definitely something you should look into. A counsellor isn’t really allowed to diagnose someone (or even test them) without their consent, and can’t diagnose someone as spectrum just by talking to them about their marriage. Your friend might have been hearing what she wanted to hear between the lines, but is absolutely still the asshole for trying to do this behind her husband’s back at all.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9,
      "content": "NTA seems like she wants a solution to the conflict in her marriage. Problem is treatment for autism and teaching empathy isn't easy, if it's even possible. The root of the problem may be autism but it's the behavior that's causing the issues, and the diagnosis isnt an excuse for mistreating his family. I know personally I couldn't be with someone who couldn't empathize with me, but she seems to be invested so I hope she can find a way to improve things.",
      "id": 18,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "Of course YTA!!! I mean she is. But, most of all, the therapist is! Evaluating a client without their knowledge and involving one of the conflicted parties in a therapeutic assessment without the knowledge of the other is DEEPLY and FUNDAMENTALLY unethical. This is professional manipulation and your therapist should have his license revoked immediately.",
      "id": 19,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 4,
      "content": "NTA - if it's a licensed marriage counselor they'd presumably be able to handle all aspects of a marriage. Just because the spectrum is a specialty doesn't mean it's at the exclusion of other issues.\n\nHowever, your friend really painted herself into a corner on this. So I'm gonna provisionally say YTA if she doesn't handle the \"telling\" or \"not telling\" to her husband in the right way. That's a sticky wicket.",
      "id": 20,
      "comments": [
        {
          "score": 2,
          "content": "Great answer, thanks",
          "id": 21,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "SHP. I was diagnosed with autistic spectrum disorder and you can't get a diagnosis without talking to the person face to face and you know what you're in for. A marriage councillor doesn't count. It's kinda pointless then.",
      "id": 22,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "ESH except the husband.",
      "id": 23,
      "comments": [
        {
          "score": 1,
          "content": "E being her and the counselor? ",
          "id": 24,
          "comments": [
            {
              "score": 2,
              "content": "If he wanted to say \"except you\" he would've said it lol",
              "id": 25,
              "comments": [
                {
                  "score": 1,
                  "content": "Word, yeah I guess",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "E being you and her and the counselor.",
              "id": 27,
              "comments": [
                {
                  "score": 1,
                  "content": "Hmm, with all due respect, why am I an asshole here? I did not tell her to do this, I did not support this, I didn't even believe her when she first told me. \n\nYou mean because I didn't tell B? ",
                  "id": 28,
                  "comments": [
                    {
                      "score": 1,
                      "content": "No, because you told another friend about it.",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NAH\n\nIt would’ve been so easy for her to divorce him and take his kids, after all of the fighting and incompatibility. Instead, she sought a proactive way to figure out what might be an underlying issue, and seems to be committed to making their marriage work. Anyone who says otherwise doesn’t understand how tough it is to be with someone who doesn’t “get” something as basic as empathy. Your friend is a fundamentally good person. \n\nEdit: Typo",
      "id": 30,
      "comments": [
        {
          "score": 5,
          "content": "No one’s saying she’s an asshole for trying to improve her marriage. She’s an asshole for telling people sensitive medical information without his permission and without him even knowing about the medical intervention. The therapist also behaved wildly inappropriately by diagnosing him to his wife without performing an informed evaluation and without his express permission to discuss his diagnosis.",
          "id": 31,
          "comments": [
            {
              "score": 3,
              "content": "Wait, I think I misunderstood you initially. Are you saying because he doesn't know, and because we're now talking about it, ALL of us are assholes?\n\nIf so, I honestly think you're right about that. I feel like an asshole just knowing it, let alone posting it. But also we have no freaking idea what the right thing to do is, and it feels like we're grappling with a really hard moral question that shouldn't be handled without deep consideration of the consequences.\n\nI kept it broad and general, so as not to have any identifying information. I even changed the initial of his name. I don't think she's an asshole for seeking help outside her own brain. I thought this would be a good sub because I figured it would help us see a bit more clearly, and I hoped that some would represent (what I think will be) HIS opinion, so I could hear them out.",
              "id": 32,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "I'm not really sure about this situation but it just seems fishy to me for a licensed professional to give a diagnosis to anyone besides the patient.",
      "id": 33,
      "comments": [
        {
          "score": 1,
          "content": "It's not clear whether the counselor *gave* a diagnosis or whether my friend heard an official diagnosis from the counselor's agreement with her statements. I have to ask her; that was pointed out to me elsewhere in this thread and it's a great point. My friend might just have heard what she wanted to hear. ",
          "id": 34,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}