{
  "post content": "Ok so this is annoying me .please bear with me first time posting and on mobile.  By accident I found a package and opened it as I was wrapping the kids gifts. A package had gone missing my husband had orders and had been for my Christmas. Now in that closet I keep a bunch of unopened packages my mum sends to my kids and then open them the day I wrap them. Anyway I open this package and it is obvious it is not for the kids. It’s a self help book 12 rules to whatever .. I’m like what the heck. The guy who wrote it is a phycologist  Who is a misogynist right wing nut job. Who my husband likes and kind of falls in line with his own way of thinking. (Yes this is an issue as I’m rather left wing I guess) anyway so I tell him I found this package and accidentally opened it and he loses it saying how his name was on it and it had gone missing. At this point I’m like wait , no no no the only package gone missing was his Xmass gift to me… so THIS was what he thought was a thoughtful gift for Christmas. Basically telling me I’m a shit human and I need to change and this book will help. And he can’t understand why I am so pissed and was crying all night and most of the day. Am I wrong? This is not a gift you give on a holiday. This is expensive toilet paper IMO. I’m humiliated and embarrassed and hurt. Like I was so excited that he thought of me in advance and it wasn’t a last minute Walmart gift . I’m so upset. But Am I the asshole for not appreciating this thoughtful gift he got me ?\nupdate: and a bit more info. 1.Yes I’m fact he DID say it was my gift. And yes he said to help me change. 2.when we met he was not like this or at least it was never apparent . It slowly became more of a thing then hit overdrive when he started watching throw guy. 3. I actually have in fact listened to him speak and find him intolerable. For many reasons.  All this said , after realizing he somehow fucked up (at least to my POV) he actually went out and got me some movies I wanted to see that we couldn’t because of covid. A couple of Xbox gift cards to buy a game. And a uno type game “cuz I like that kinda stuff” so he made an attempt to make me feel better and happier and not be as much of an ass even if he still can’t understand why I’m upset. For those who keep saying I should just be happy I got a gift. I’d have been happier without it. Thank you everyone for your judgment .\nFor clarity: I never bought him love languages I owned it and asked him to read it with me once and let it go after he said NO.  \n Also to respond to everyone hung up on my crying . Holidays are stressful as is. I had not slept almost at all for two days. Emotions were high and I was also responding to his yelling at me for opening a package BY MISTAKE.  So yes I’m childish but honestly I also don’t feel it was that over the top of a reaction either. I’m human and my feelings were hurt. \nAlso I never at first mentioned the Author by name. So it was not me trying to start a huge debate about the guy or be bait or whatever. It was about am I justified to be upset about a self help book as a gift. That’s the yes I’m TAH or NO it’s not about my remarks on the writer. \nAnd Lastly it was not a quick google search of him that I based my options off of. It was diving down a rabbit hole for hours and feeling gross after the fact. But FINE I’m a chaos dragon I except that!",
  "id": 1,
  "comments": [
    {
      "score": 20098,
      "content": "NTA. No sane human wants Jordan Peterson for Christmas or any other time.",
      "id": 2,
      "comments": [
        {
          "score": 8778,
          "content": "Yes that’s the one and he sucks",
          "id": 3,
          "comments": [
            {
              "score": 8938,
              "content": "His gift is not 'thoughtful'. If anything, it's like an insult.\n\n*\"Merry Christmas, wifey! You are annoying af and a total problem, so enjoy this scam of a book by a shitty, misogynistic author that you hate! I hope it fixes you.*\n\n*Dear Husband\"*",
              "id": 4,
              "comments": [
                {
                  "score": 4496,
                  "content": "Lmao! To be fair I didn’t know I loathed this person till after I did some research on him after seeing the book.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 6252,
                      "content": "Get him a treadmill and viagra prescription for xmass. \n\nIf he gets mad just say they’re thoughtful gifts. You were thinking about what he needs.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1105,
                      "content": "Also it’s not a thoughtful gift when the gift giver is only thinking of themselves.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 509,
                      "content": "FYI, being a Jordan Peterson Stan is grounds for divorce.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 358,
                      "content": "As an anecdote, Peterson preaches a lot about personal responsibility...\n\nBut I've heard from people in his department that he doesn't do his own job. He ignores his grad students, his faculty duties, et cetera.\n\nJust another hateful, hypocritial right-wing grifter.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 149,
                      "content": "It looked like an interesting self-help book til I started reading it. Was not enjoyable to say the least",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 138,
                      "content": "Babes do yourself a favor (and a bit of self-soothing) and search “Hasan Jordan Peterson” on YouTube. And watch any number of videos of Hasan Piker (who may or may not also be hot as hell) picking apart Jordan Peterson’s idiocy on a whole range of topics. It’s great.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 126,
                      "content": "I was much happier in general daily life until an ex of mine made me aware that man and his cult exist 😂",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 91,
                      "content": "No gift meant to improve the recipient is an actual present to anyone except the giver, (unless it was requested).",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 54,
                      "content": "Nta \n\nAlso you know what you must do \n\nRead the book\n\nWrite a dissertation and for Valentine’s Day \n\nShow a thoughtful PowerPoint of all Jordan petersons contradictions and scam tactics \n\nhttps://youtu.be/4LqZdkkBDas",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "One of his 12 Rules for life:\n\n\n11 Do not bother children while they are skateboarding\nThis is the rule that’s the real catnip for right-wingers everywhere. Want to know why the world is falling apart? It’s because liberals are turning boys into girlies with their namby-pamby ways. Let boys do boy things and girls do girl things. Nowhere in the Bible does God say anything about this trans nonsense. There’s nothing wrong with men having all the best jobs and women staying home to look after the kids. So back off, ladies, and give us men a break.\n\nWhat a waste of oxygen.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 72,
                  "content": "Right oh and we're moving to a little town called Stepford",
                  "id": 16,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "Are there any husband-improvement books around, that she could give him in return? Something like \"I'm a misogynistic a-hole, how can I improve myself to save my marriage?\"",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Lol it’s more like “hey wifey um I have some small issues with the way you are. For example you don’t act like my slave, you talk back, don’t read my mind and fulfil everyone of my needs, oh finally you don’t acknowledge that I’m a god in bed. So I going to need you to read this book and follow it to  a t no excuses.”",
                  "id": 18,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "But who doesn’t love passive-aggressive books from fascist misogynists about changing yourself as a person???? /s",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I’ll finish that … “time for you to F off because I will no longer be subjected to your toxic ways”. I would probably say something much more harsh but I’m trying to be civil being Christmas and all lol",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I mean I'd get him divorce papers for Christmas. Who wants a man that thinks like him?",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Don't forget transphobic! Yuck all around.",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "You forgot to call her a chaos dragon and have him establish a lobster hierarchy.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1720,
              "content": "NTA\n\nMy ex husband got ‘us’ that book in an attempt to save our marriage years ago...\n\nIn a few weeks it’ll be my 2nd anniversary with my new husband.\n\nEdit: thanks for the awards! You’re very kind!",
              "id": 24,
              "comments": [
                {
                  "score": 100,
                  "content": "Love this!",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 57,
                  "content": "Hopefully the new husband is better",
                  "id": 26,
                  "comments": [
                    {
                      "score": 62,
                      "content": "Not a high bar... but yes!",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Oh he certainly is, lol.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "This makes me happy!",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "Sounds like you got the best gift…a new husband!",
                  "id": 30,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I absolutely did! \nHe is an incredible husband.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Right on. I wouldn't have stayed after that either. Oh you don't like me? Goodbye!",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 307,
              "content": "[deleted]",
              "id": 33,
              "comments": [
                {
                  "score": 122,
                  "content": "> never having met a trans person...\n\n...that he knew the status of. I guarantee he's met a transperson and just didn't/doesn't realize it.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 58,
                  "content": "My mother has that opinion. I told her it was stupid and after much arguing, I'll be cutting contact as soon as my grandpa passes with 99% of my family",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 29,
                  "content": "Seems like everyone has a random person at an event who has brought up Peterson in a typically caustic way. Similarly, I was at a birthday party and someone made a joke about getting a Peterson book and that he was a nutjob and someone piped up defending him that made the room get uncomfortable. \n\nI don't know much about psychology compared to him, so I don't want to speak to that, but the fact he gets involved with the climate change debate, and he happens to take the right wing view cements him to me as a total Youtube grifter.",
                  "id": 36,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "I hate that “trendy” argument. It’s so stupid it hurts. Could it be because we live in a time where trans and other members of the LGBTQ+ community are supported more than ever? \n\nNo, it’s just a fad.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 10,
                      "content": "It's like the graphs of people who self reported being left handed after we stopped caning people for using their left hand",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 239,
              "content": "NTA - husband is, hell, Peterson is too.\n\nJP is the kind of guy who shouldn't be taken seriously about anything.",
              "id": 39,
              "comments": [
                {
                  "score": 193,
                  "content": "He's the male \"Dr. Laura\" Schlessinger (whose doctorate isn't even in psychology but physiology). Her \"care and feeding of husbands\" book is basically a screed on how wives need to completely forget they even exist except to spend every waking second serving hubby's needs and that it's selfish to even consider expecting anything from hubby. Okay, that's a bit of an exaggeration but not by much!",
                  "id": 40,
                  "comments": [
                    {
                      "score": 111,
                      "content": "My dad got me that book when I was 14. Hahaha my mom was *PISSED*",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "She's awesome at relationships evidenced by her divorce from her first husband.",
                      "id": 42,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "Only thing I ever agreed with her even when I was a conservative it that your kids need to come first. But Christ, that doesn't mean never dating. It means who you date need to love your kids too.",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 234,
              "content": "I *knew* it was Jordan Peterson when you described the book. He’s a misogynist for sure. He also likes to post his lectures on YouTube and attempts to come off at this reasonable, thoughtful professional. He appeals to younger, college-aged men because he tells them their sexism isn’t their fault, that it’s society’s fault for changing the rules, that men are essentially told to be men and then told they aren’t allowed to be, etc; he makes it okay for men to whine about having to share power with women. It’s all nonsensical sexism masquerading as thoughtful commentary. His book, as you said, is expensive toilet paper.\n\nNTA. Your husband put thought into the gift, but unfortunately his only thoughts were of *himself*. That book was a gift for *him*, not you. He wants you to be different for *him*. That is obviously problematic on its own, and you really should consider talking to him and seeking couples therapy, but this being a *Christmas* gift takes it to a whole different level of selfish thoughtlessness.\n\nI’m sorry this happened to you on Christmas. I hope you still enjoy the day with your children.  Maybe you can tell the husband to go spend the day outside?",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 170,
              "content": "News flash, you’ve got bigger problems than a shitty Christmas present. If your husband is buying crappy, misogynistic shit for you to o read, then you’ve am got a crappy, misogynistic husband. Of course there’s an easy way to get better Christmas presents - get a divorce and find a partner that values you as a human. NTA.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 93,
              "content": "Wow, yeah. That's really shitty. I really hope he's ok with any daughters you have because.... Ew.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "NTA \n\nWe all knew immediately from your description. He's basically for dudes who think they're too smart for Joe Rogan. Key word think. Sorry you're stuck with someone like that",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Jorden Peterson is a horrible human being and no one should pay money for his misogynistic, white nationalist, elitist, brain damaged gibberish. I’m sorry your husband thinks Peterson is someone to emulate.",
              "id": 48,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "In the last bit of your post, you said that you were excited about it not being a last minute Walmart gift. Why are you still married to someone who regularly pulls that kind of stunt? You already stated that his right wing views and his misogyny have been a problem in the marriage. I can tell that you know you deserve to be treated better. So what is keeping you with him? Why are you putting yourself through this? What makes him so special that you’re able to look past it? Love can make things blurry, but you shouldn’t ignore what you CAN see.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 258,
          "content": "I would divorce any partner who thought that was in any way an appropriate or good gift.",
          "id": 50,
          "comments": [
            {
              "score": 166,
              "content": "I would divorce any partner who took JP seriously in any way.",
              "id": 51,
              "comments": [
                {
                  "score": 33,
                  "content": "Yea Id have to question whether they are stupid or malicious. Neither is flattering.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Err I take JP seriously as a clown. Does that count as a ground for divorce?",
                  "id": 53,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "Same. Husband sounds like a total asshole.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 216,
          "content": "[removed]",
          "id": 55,
          "comments": [
            {
              "score": 141,
              "content": "Return it and get yourself a new husband ~~manicure~~ instead.\n\nFTFY",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Hey, you copied my comment. Please find your own words to support OP.",
              "id": 57,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 99,
          "content": "NTA- H3H3 mocking Jordan Peterson voice: “what are we gonna do without men?”",
          "id": 58,
          "comments": [
            {
              "score": 117,
              "content": "Single females are happier than married females and married males are happier than anyone else",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "> Jordan Peterson voice\n\nYou mean xanax barred out  Kermit voice?",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 98,
          "content": "My dad gave me the same book that OP was given and it pissed me off. I ended up showing my dad exactly who glorify him, incels and redpill guys. It’s messed up.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": "Lol I had to Google this book and apparently landed on a satire version. Step 12 was \"if you see a cat, pet it\" and I had a real \"I guess even a broken clock is right twice a day\" moment.\n\n/csb",
          "id": 62,
          "comments": [
            {
              "score": 15,
              "content": "I think that is the real book.",
              "id": 63,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "Kind of funny that we came to the same conclusion about who it was, dude openly advocates for government-assigned wives for incels so they don't have toddler tantrums 😐",
          "id": 64,
          "comments": [
            {
              "score": 5,
              "content": "Holy shit really? 😂 can I get a link on that it sounds hilarious",
              "id": 65,
              "comments": [
                {
                  "score": 5,
                  "content": "[here's the NYT article that mentions it](https://www.nytimes.com/2018/05/18/style/jordan-peterson-12-rules-for-life.html)",
                  "id": 66,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Gah, paywalled - do you have the text by any chance haha",
                      "id": 67,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "I'm so sorry OP.\n\nObviously NTA. I hope that you still manage to have a good Christmas with your kids.",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "[removed]",
          "id": 69,
          "comments": [
            {
              "score": 105,
              "content": "'How To Stop Destroying Your Relationships' looks promising.  Finding self help books as passive aggressive 'gifts' is my jam.",
              "id": 70,
              "comments": [
                {
                  "score": 86,
                  "content": "[“Why Does He Do That” by Lundy Bancroft. ](https://www.penguinrandomhouse.com/books/289845/why-does-he-do-that-by-lundy-bancroft/)",
                  "id": 71,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Perfect",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "“How to give a gift that doesn’t end in divorce”",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "I'd get him *Why Does He Do That?* by Lundy Bancroft and watch his reaction.\n\nNTA, OP.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Start with Untamed by Glennon Doyle.",
              "id": 75,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "This ‘gift’ is worse than getting nothing",
          "id": 76,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5808,
      "content": "NTA, I have a feeling it’s Jordan Peterson lol. This guy says that anyone who has the executive function disorder that I have just “needs to get their life together”, what a joke. Ignoring the author, which is hard because fuck him, getting your SO a self help book for Christmas???? “Honey, I think you have several flaws which annoy me, and I think this book by an author you openly dislike might help you become more tolerable for me. Merry Christmas! :-D” yikes.",
      "id": 77,
      "comments": [
        {
          "score": 2035,
          "content": "Fml reading that made me laugh",
          "id": 78,
          "comments": [
            {
              "score": 912,
              "content": "Swap it for the spin-off \"488 Rules for Life\" by Kitty Flanagan (an Australian comedian). \n\nOr buy him \"How Not to be a Dick\" by Meghan Doherty.",
              "id": 79,
              "comments": [
                {
                  "score": 229,
                  "content": "HAHAHAH I second How Not To Be a Dick!!!!!",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "My parents got me Kitty’s book and oh god did it get dark quick. Still funny tho.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 321,
              "content": "Did you know there's a self help book called How to Stop Destroying Your Relationships?  In case you want to exchange the nice gift you got him for him and get him something more suitable.",
              "id": 82,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 91,
              "content": "Tell your husband he needs to clean his room",
              "id": 83,
              "comments": [
                {
                  "score": 15,
                  "content": "To warm up for cleaning the shit out of his head?",
                  "id": 84,
                  "comments": [
                    {
                      "score": 24,
                      "content": "That too...it's a jp reference as well- he seems to think that keeping ones room clean means ones morals are also clean, yet another of his many logical fallacies",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "By him some super feminist book for his birthday",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I kind of hope you \"get him back\" by gifting some left-wing political literature on Arbor Day or something. Start out with, \"Happy [holiday]!\" then what u/actualllllobster put in his mouth, but end it with smth to make him recognize *how that makes him feel*, on a minor holiday, is how he made **you** feel on gd Christmas.\n\nNTA.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yeah we all know how it's the thought that counts, and that's true. It's shows you were thinking of the person and wanted to do something nice for them. It's also the thought behind the gift in some cases. You two are married though so I would say it should be somewhat expected and you should put some effort into it. That doesn't mean you have to drop thousands of dollars, but something nice and thoughtful. \n\n\n\nFor example, my mom wanted a kate spade purse. I don't know what the hell to get so I made an origami one (haha it looks so cool) with some money inside for her to pick what she wanted. That was ONE of the gifts. Another is a friend of mine, I put treats, a weird but more cute looking mug, and some shirts etc. And with each item there's some thought behind it and a meaning. Main goal is to make her happy and laugh haha. Honestly, I'd be really upset and bummed out because that gift doesn't send a very good message and out of all days, it's a Chistmas gift. If you bought something nice and expensive, I wouldn't blame you for returning that item, getting him a cheap gift (someone below mentioned the self help book How To Stop Destroying Your Relationship, that'd be funny haha), and then treating yourself.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "You should buy \"Why Does He Do That?\" By Lindy Bancroft and display it prominently around the house",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 400,
          "content": ">just “needs to get their life together”\n\nOmg it was that easy?! All I have to do is get my life together!! If I combine that with \"just get a diary\" I'll be unstoppable lol",
          "id": 90,
          "comments": [
            {
              "score": 276,
              "content": "Don’t forget: using a planner, or phone reminders! And have you tried just being more organized? Less messy? It’s not that hard, if I can do it so can you. \n\nIt really is that easy, we’re just lazy /s",
              "id": 91,
              "comments": [
                {
                  "score": 186,
                  "content": ">Don’t forget: using a planner, or phone reminders! And have you tried just being more organized\n\nIs this like \"You don't need antidepressants, you need to exercise/walk in nature?\" Because let me tell you, walking in nature has done WONDERS for my anxiety and depression recently! /s",
                  "id": 92,
                  "comments": [
                    {
                      "score": 133,
                      "content": "[deleted]",
                      "id": 93,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 31,
                      "content": "I got told I was looking for \"a magic fix\" by asking if I could get into a ketamine trial. Then told I should exercise. Fuck I can hardly get up in the morning, how'm I going to exercise?",
                      "id": 94,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "Yes it’s exactly that. For me it’s ADHD and adderall but it’s the same message lol. We just need to stop having the problem… and it goes away, How about that!",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "BuT hAvE yOu TrIeD yOgA??? 🙄🤮",
                      "id": 96,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Walking helps my anxiety immeasurably. But that is something that works FOR ME. It doesn’t for everyone. Blanket advice is such bad advice.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "It's true... life could be so much easier and happier if I would just become a completely different person",
                  "id": 98,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I can’t tell you how many times I used to think that as a kid lmao",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "Is it adhd? I bet it’s adhd. As someone with adhd I feel attacked.",
                  "id": 100,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yup!",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "NGL, my son is 11 and is just riddled with ADHD.  His executive functions suck balls.  But you know how I finally got him to the point of not needing me to hold his hand to do his morning routine, no nagging required?  I got him a Minimo Daily Routine magnetic board and magnets.  He used them faithfully until he got to the point where he could get his shit done without needing to be told to brush his teeth, get his socks, etc.\n\nIn conjunction with meds, obvs.",
                  "id": 102,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I’m glad that worked for him, I know it feels amazing when you find something that sticks for you specifically. Planners and boards unfortunately don’t work for me and I’ve yet to find my thing that sticks. I think it just has to do with how difficult it is for me to use things that are out of my reach/out of the way, like I do use a little dry erase calendar within reach on my desk to map out the month and it works okayish.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": ">anyone who has the executive function disorder that I have just “needs to get their life together”\n\n\nHoly shit, I'M CURED!",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "What is executive function disorder? I have never heard of it and I would like to be educated on it. Thanks.",
          "id": 105,
          "comments": [
            {
              "score": 98,
              "content": "Other people have said, but executive function can be impacted by a few things. I have ADHD and Autism and can sit there wanting to work on something for hours and NOTHING. I describe it like my brain glitching / short circuiting. The intention is there, the capability is there but the ability to take the step to STARTING it is... conspicuously absent",
              "id": 106,
              "comments": [
                {
                  "score": 39,
                  "content": "That sounds like writer's block for other things than writing!",
                  "id": 107,
                  "comments": [
                    {
                      "score": 20,
                      "content": "That’s a really good way of putting it!",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Yep! life block! FMLB!",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "This is freaking me out because it's literally how I've been for years now. Do you have any idea whether this is more a symptom of ADHD or autism? And what are the steps that one should take for this shit...",
                  "id": 110,
                  "comments": [
                    {
                      "score": 5,
                      "content": "More so symptoms of inattentive ADHD. First step would be seeking a diagnosis.\n\nPhysical locations that offer diagnostic services tend to have a multi-month wait. Diagnosis is rarely covered by insurance, a saw a post just yesterday on /r/amitheasshole about someone spending $2000 on their initial diagnosis. (Their parents had them diagnosed as a child and never told them, they wanted reimburse by their parents)\n\nThere are online services like ADHDOnline, which I would recommend. You would complete a ~1hr long survey which is reviewed by a psychologist who makes a diagnosis. Depending on your state they may offer medication management. I'm 26 and this is the route I chose, and I'm in my first month of treatment with generic Strattera, a selective norepinephrine  inhibitor. \n\n$200 initial\n$250 first doctor visit\n$200 first follow up\n\nThat's where I'm at. I'd definitely recommend looking into options. I had made appointments at physical centers a few times in college but never followed through, something I really regret.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Sorry, as I have both I'm not really sure. I know it's one of the things that can exist in both, though.",
                      "id": 112,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I've heard it described as being like the Sims. They have things they need or want to do but the action keeps getting cancelled so they just stand there, mood just constantly getting lower and lower. This was the example that finally made me go \"OH, I DO THAT!\"",
                  "id": 113,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Ha the one time I played the Sims the one I made look like me got depressed and lay down on the sofa and died because she didn't do anything with her day. Checks out!",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "That is a PERFECT description.\n\nSigned, a person who was diagnosed with ADHD at 41.",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "Personally, I have ADHD which is an executive function disorder. Here’s a general definition I was able to find: Executive function is a broad group of mental skills that enable people to complete tasks and interact with others. An executive function disorder can impair a person's ability to organize themselves and control their behavior.\n\nSo for me, my ADHD can make it a lot more difficult to do daily tasks that people without ADHD can do, like staying organized, focused, emotional regulation (anger specifically for me) and so on. This might not be the best explanation but I hope it helps!",
              "id": 116,
              "comments": [
                {
                  "score": 7,
                  "content": "A lot of times people don't understand the difference between sometimes displaying those behaviors and being ADHD. I just explain that I can't watch/follow most shows and their plot. I'll catch myself zoning out in my own thoughts and have missed 30 mins already. It doesn't matter how interesting it is. I used to love reading but it gets hard to follow when I need to reread the same paragraph repeatedly. My eyes wander the page and I just can't do it. I hate it so much.",
                  "id": 117,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Oh man same. I used to have a bad habit of going on r/jokes and then reading the punchline because my eyes would wander. And yeah sometimes when I try to explain, people always say “well everyone gets distracted” or “everyone gets a little messy at times” but the difference between sometimes having symptoms and a full blown disorder is when you are constantly having the symptoms and it’s effecting your daily life and livelihood. Like I find it hard to focus and I get distracted easily and with my job, this can’t happen.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "It happened to my Dad after a stroke. It's common after brain inflammation or injury.\n\nSo before the stroke he had things he liked to do. So he was retired, but he enjoyed yard work and walking his dogs, he loved video games based on NASCAR racing, and hanging out with his buddies. \n\nAfter his stroke, he'd get up and go sit in his chair and watch TV.  Left alone, he'd literally watch it all day. \n\nBut if you said, \"hey Dad go walk the dogs\" he'd go do it. He had trouble initiating tasks. Also planning and organizing, those skills left too.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "And Peterson can't even get his own life together.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2478,
      "content": "NTA- I would have rather gotten no gift then a gift like that. It seems obvious to me that he doesn’t care to get you a gift that YOU would like.",
      "id": 121,
      "comments": [
        {
          "score": 901,
          "content": "That’s what I said.",
          "id": 122,
          "comments": [
            {
              "score": 815,
              "content": "May I ask, if you two have such different values why are you together? I can’t even imagine what I would do if someone gave me a book by someone like Jordan Peterson because I would never be with someone like that. You deserve a better gift and a better husband as far as I’m concerned.",
              "id": 123,
              "comments": [
                {
                  "score": 746,
                  "content": "We wound up together for several other reasons. First he liked that I was attentive and caring something he Dosnt love so much now as he thinks I am ruining my children by not wanting to give out harsh punishments and believing they have a right to their own feelings and thoughts. I loved him because he was hard working honest and a good friend to me when I went through an awful divorce. He has some amazing qualities. He is just an egomaniac who was raised in a very different environment then how I was.",
                  "id": 124,
                  "comments": [
                    {
                      "score": 757,
                      "content": "Also, egomaniac... Total red flag, girl.",
                      "id": 125,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 632,
                      "content": "> He is just an egomaniac\n\nI'm sorry, full stop, what? A person is not \"just\" an egomaniac, in the same manner someone isn't \"just\" a serial killer. This is a severe character flaw that cannot be balanced by any amount of good deeds or good intentions. It taints everything down to the bone. It makes every single thing he does suspect, a reflection back on him and his ego. There is so \"making up\" for being self righteous and callous to this degree. To cite a cliche, Hitler was a vegetarian. It meant nothing.\n\nA man who is gives a Jordan Peterson self-help book to his wife for Christmas has serious issues. A short list of them include: poor judgment, lack of empathy, lack of social skills, inability to predict the consequences of his own actions, racism/sexism/probably several other bigotted -isms. \n\nYou need to seriously consider your future with this human. He is unworthy of your time. Being \"honest and a hard worker\" is the bare fucking minimum of being a decent human being. It's not enough to choose a life partner. It's not enough to build a marriage on. And I think you know that; the way you phrased it, \"how we ended up together\", like it just happened without agency, suggests to me that you are accustomed to other people steering major parts of your life for you, either because they take the reigns from you, or because you hand them the reigns out of fear or defeat. If either scenario is true, it's time to take those reigns back and eject those people from your life. Including this man. \n\nYou deserve better.",
                      "id": 126,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 164,
                      "content": "You say \"my children\" - are they not his? His attitudes will definitely shape how they see future relationships, their place in the world... he's the one ruining them & you all deserve better. I'm sorry you're in this position.",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 152,
                      "content": "If he's bad to you and he's bad to the kids... what's good about him?\n\nNever mind what he USED to be like, what he ONCE helped with, what's good about him NOW?",
                      "id": 128,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 101,
                      "content": ">a good friend to me when I went through an awful divorce\n\nso he was nice to you while you were vulnerable and becoming single, but has since gotten worse and worse? Doesn't sound promising",
                      "id": 129,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 90,
                      "content": "So he deserves attention and care but literal children are being ruined by getting the same treatment?",
                      "id": 130,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 51,
                      "content": "Who sounds like you should have run like yesterday.....",
                      "id": 131,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 30,
                      "content": "What? it sounds like he wants you to abuse your children. That trumps any good qualities.",
                      "id": 132,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 24,
                      "content": "Describing yourselves as having ‘wound up together’…  seems like you’re checked out. I’m sorry but he ain’t the one and you and your kids deserve better than this misogynistic ballbag.",
                      "id": 133,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 23,
                      "content": "He may not be as bad as your first spouse, but he is still terrible. I see no redeeming qualities about this man, and I personally wouldn’t allow him around my children.",
                      "id": 134,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "His gift is him basically telling you that he doesn't like you",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1135,
      "content": "NTA\n\nyou know what I came in here fully expecting to say you were the asshole as it's the thought that counts but after reading this *fuck that* \n\nThat the gift equivalent of a back handed compliment, oh hey here the gift *but it's just to let you know I think you are a problem*\n\nNah fuck him he's the asshole",
      "id": 136,
      "comments": [
        {
          "score": 311,
          "content": "It IS the thought that counts.\n\nThe thought here is “you’re an awful wife, so here’s a book that tells you how you can be more in line with the kind of wife I want. So, chop chop, and get me a sandwich when you’re between chapters”.\n\nIt’s the thought that counts, and that’s what makes it a  shitty gift.",
          "id": 137,
          "comments": [
            {
              "score": 40,
              "content": "\"You need to change. Merry Christmas!\"\n\nSelf-help books are RARELY appropriate gifts and should only be given after the person has expressed interest in them.",
              "id": 138,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Exactly what I was going to say.  NTA.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "Same here, fuck that shit NTA",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "NTA  It's not a gift problem, it's a husband problem. I'd rather be alone and happy.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Lol. I have an aunt who’s great at giving back handed compliment gifts. For years, she’d make a big show of giving me my gift, often saying she didn’t get anyone else something. But the entire time, she’s get me religious books (her way of saying I don’t pray enough) or clothes that don’t fit.\n\nOne year, she gave me a religious book with the title “God, Why Am I Still Single?”. My long term bf broke up with me a couple of months before that and I was still very much not over that relationship when she gave me that book. To say I was annoyed and insulted was an understatement.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 715,
      "content": "NTA. Self-help books are a scam and the worst. Plus you already know you disagree with the author (I think I know the one, insufferable if you ask me...), that just makes it a fire starter, does your husband like to upset you?",
      "id": 143,
      "comments": [
        {
          "score": 253,
          "content": "Indeed it would seem so.",
          "id": 144,
          "comments": [
            {
              "score": 151,
              "content": "I think you should give him a divorce for Christmas. He doesn’t respect you.",
              "id": 145,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 203,
          "content": ">Self-help books are a scam and the worst.\n\nI don't necessarily agree - there were a few self help books that genuinely helped me. The difference is that I chose them myself, for things that I personally wanted to work on, and they were not given to me as a passive aggressive hint to \"improve\".",
          "id": 146,
          "comments": [
            {
              "score": 81,
              "content": "For real! I was just about to say that my girl, Brené Brown, is NOT a scam!",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "“Codependent no more” by melody Beattie was a lifesaver for me",
              "id": 148,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "[deleted]",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 83,
          "content": ">Self-help books are a scam and the worst\n\nBig disagree. Not Nice by Aziz Gazipura helped me *profoundly* with my low self-esteem, severe imposter syndrome and general anxiety.",
          "id": 150,
          "comments": [
            {
              "score": 26,
              "content": "See my answer from earlier, I was a bit over the top with that outrageous statement. I'm glad you found help!",
              "id": 151,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "😲 seems like the next book i need to get",
              "id": 152,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Firestarter. Now THAT’S a good use for that book.",
          "id": 153,
          "comments": [
            {
              "score": 3,
              "content": "You say true, I say thankya.",
              "id": 154,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 530,
      "content": "NTA. That's a passive aggressive gift and I'd be really upset too.",
      "id": 155,
      "comments": [
        {
          "score": 202,
          "content": "That’s exactly it!",
          "id": 156,
          "comments": [
            {
              "score": 144,
              "content": "I also think I know who the author is and am angry on your behalf!!",
              "id": 157,
              "comments": [
                {
                  "score": 146,
                  "content": "Jordan Paterson",
                  "id": 158,
                  "comments": [
                    {
                      "score": 65,
                      "content": "Knew it.",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Any SELF help stuff is never a gift unless specifically asked for. It's an insult and defeats the point of SELF help.",
          "id": 160,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 491,
      "content": "[deleted]",
      "id": 161,
      "comments": [
        {
          "score": 419,
          "content": "Hahahha I’m a librarian our library gives out free origami instructions for a new shape each month. Not a bad idea at all!",
          "id": 162,
          "comments": [
            {
              "score": 239,
              "content": "I think it's worse that he gave a librarian a book for Christmas",
              "id": 163,
              "comments": [
                {
                  "score": 341,
                  "content": "Oh no, I would love a book. If it’s one I want. He said I read lots of garbage for work. (For book club) and I won’t read this? I get paid to read those books. (If we have nothing going on I’ll read at work) he could not afford what I’d require him to pay to read this garbage!",
                  "id": 164,
                  "comments": [
                    {
                      "score": 130,
                      "content": "If you want any help coming up with professors and sociologists you can cite for a \"fair critique\" of the book HMU hahaha\n\n\nI would LOVE to see his face at your very own family book club where you're like \"rationally, I find Wollstonecraft's argument that women be educated and allowed autonomy a much more justified position. Returning to the modern era, Roxane Gay's essays provide a valuable insight into the benefits of progressive culture where women are empowered to reach a state of self actualisation, as opposed to being treated like dairy cattle\"",
                      "id": 165,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I'm reading this saga aloud to my family. I barely got through reading this comment when protestations arose at his calling your work reading garbage.  \n\nWhile they are not on Reddit they are all book lovers and immediately called for you to throw the whole man away if he had not immediately repent after saying that in anger & at their behest to share their worries/condolences with you, OP. \n\nFamily says: NTA, obviously.",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 56,
                  "content": "Most librarians become librarians because they love books! Source: me, who married a librarian! The main problem is trying to find a good book for them that they don’t already have!",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 340,
      "content": "NTA, I've been given some unbelievably strange gifts from my SO, like two identical tea pots in different colors, and one, I kid you not, velvet painting of Groot. But never had one that says how to better yourself to serve me.",
      "id": 168,
      "comments": [
        {
          "score": 188,
          "content": "I think I’d have loved the Groot! Yeah I’m really just not understanding what went through his head. Or that he can’t fathom why I think it’s humiliating and insulting.",
          "id": 169,
          "comments": [
            {
              "score": 134,
              "content": "I adore Groot also, though I still give the man side eye whenever he tells me he has a surprise for me. And quite frankly, how would your SO feel if you got him a book on how to remove ones head from a certain orifice and free yourself from being a misogynist? I'd lay odds he would feel insulted and like he wasn't good enough just being him. If it was me Id find 101 things to make from book pages to gift SO with through out the year so you could both enjoy enlightenment.",
              "id": 170,
              "comments": [
                {
                  "score": 65,
                  "content": "I don’t think I can like this suggestion enough",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I mean, the answer is that he’s a narcissist, right? He sure sounds like one. (OP’s husband, not Velvet Groot guy, who just sounds awkward but charming.)",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "A velvet painting of Groot, Elvis, Jesus, or dogs playing poker (or all of them in one glorious blaze of kitsch) would be vastly superior to a self-help type book, *especially* one from Jordan fing Peterson, certified tool.",
          "id": 173,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "You hit the nail on the head. Also, your comment intrigued me to look up velvet paintings. I’m now down a rabbit hole-Jesus and Elvis is where I’m currently at.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 257,
      "content": "Info at the bottom of the post you said \"But Am I the asshole for not appreciating this thoughtful gift he got me ?\"\n\nDid you mean to write \"thoughtful\" or was that a typo?",
      "id": 175,
      "comments": [
        {
          "score": 143,
          "content": "Typo",
          "id": 176,
          "comments": [
            {
              "score": 63,
              "content": "Ah alrighty! Also NTA that seems like a messed up gift to get anyone. Especially since it sounds like you do so much already. I kind of wonder if its possible to get a refund on such a purchase.",
              "id": 177,
              "comments": [
                {
                  "score": 166,
                  "content": "Well because it went missing and he so badly had to give me this particular gift. He after reporting it missing them saying we will send a new one but maybe not in time. He ordered one from Amazon. Now there are THREE of this stupid book here. I’m bringing them back from whence they came! And I’ll legit buy toilet paper with the refund!",
                  "id": 178,
                  "comments": [
                    {
                      "score": 66,
                      "content": "If you have a fireplace you could use it as tinder, and everytime you tear out a page you could yell \"look honey, I'm SWIPING RIGHT!\" 🤣 and then TORCH the pages. It sounds sooo therapeutic and you could profusely thank him for getting you something from that horrible author just so you could have the satisfaction of watching his ideas/theories/beliefs BURN!\n\nEdited to add: NTA. Sorry that's just me venting what my petty side would love to do, although I probably wouldn't. It still sounds fun though 😆",
                      "id": 179,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "That's a good idea!! (I was going to suggest maybe you should buy yourself a gift that you were hoping to get for christmas but unfortunately didn't, but that totally works too!)",
                      "id": 180,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 198,
      "content": "Just so everyone knows what's at issue, here is a short blurb abou the 12 steps-- \nFrom Wikipedia:\n\nThe book is divided into chapters with each title representing one of the following twelve specific rules for life as explained through an essay:\n\n\"Stand up straight with your shoulders back.\"\n\n\"Treat yourself like you are someone you are responsible for helping.\"\n\n\"Make friends with people who want the best for you.\"\n\n\"Compare yourself to who you were yesterday, not to who someone else is today.\"\n\n\"Do not let your children do anything that makes you dislike them.\"\n\n\"Set your house in perfect order before you criticize the world.\"\n\n\"Pursue what is meaningful (not what is expedient).\"\n\n\"Tell the truth — or, at least, don’t lie.\"\n\n\"Assume that the person you are listening to might know something you don’t.\"\n\n\"Be precise in your speech.\"\n\n\"Do not bother children when they are skate-boarding.\"\n\n\"Pet a cat when you encounter one on the street.\"",
      "id": 181,
      "comments": [
        {
          "score": 60,
          "content": "Husband is TA for buying someone a self help book for Christmas (without really strong indication they wanted a self help book), but these chapter titles sound mostly fine? “Do not let your children do anything that makes you dislike them” sounds bad, but if it’s written in a way that encourages you to be open minded you would only “dislike them” for just being doing something genuinely bad. Idk I haven’t read the book so I’m not going to pre-judge it.\n\nITT: Reddit anything that might be a conservative viewpoint",
          "id": 182,
          "comments": [
            {
              "score": 66,
              "content": "I read the book, iirc, the rule basically says that children need to be disciplined early on so that they learn how to behave with children their age and in public, so that 1. They can make friends easier, 2. Adults (teachers/relatives/..) enjoy their company and return their enthousiasm \n\nNot agreeing or disagreeing with this, just mentioning what i remember from reading it.\n\nPersonally, i get why its meh to give someone a self help book but I'm a little out of the loop on why JBP is such a mysoginistic pig. I only saw some of his psychology lectures and read the 12 rules book. Again, not challenging anyone's point of view, just out of the loop.",
              "id": 183,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "Don't try and defend JP.  his following is a bunch of trump-adoring, alt-right shitlords who call themselves a part of the \"intellectual dark web,\" and they are only half a step from full blown nazis at all times.",
          "id": 184,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "> \"Do not let your children do anything that makes you dislike them.\"\n\nI'll... get right on that.  Where do you go to buy mannequins nowadays, anyway?",
          "id": 185,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    }
  ]
}