{
  "post content": "Throwaway because my brother is definitely on reddit and i think he follows my real account\n\nI am a man in a serious polyamorous relationship with two partners who live with me, I've been in a relationship with one ill call Sarah for 5 years, and another ill call Mia for 3 years. i have two brother but only one is important to this story who ill call Frank. Frank was pretty against me being in this relationship when Mia entered it, he called it weird and exploitative and immoral. he would make little jokes and quips about it to me until one day i got sick of it and sat him down and basically laid down the law about it. told him that Sarah and Mia are the loves of my life and we work so well together and I'm truly happy being with them and if he cant respect that and accept me AND my partners, I wouldn't be speaking to him anymore as his disrespect is actively hurting me and my family.\n\nFrank was resistant at first in the conversation but as we went on he softened up and told me he was just worried about me, but he would do his best to accept me and change his behavior\n\nFrank asks me to babysit my nephew Gumby (who is 4) every once in a while and I'm more than happy to because i love Gumby and so do my partners. Frank dropped off Gumby the other day and we were playing mario party with Sarah while Mia was upstairs doing some work. We finished the game and i had to go do some grocery shopping so i asked gumby if he wanted to come with me and he said \"No i wanna stay here with aunt Sarah!\" i asked Sarah if she was okay watching him on her own and she said \"yeah sure\". i had never left Gumby with just my partners before but i didn't really think anything of it so i popped upstairs, told Mia what's going on and went to get the groceries. came home and we played some more mario party until Frank came to get him. then a few hours later i get an angry phone call from Frank asking me why i abandoned my nephew with my \"fuck buddies\". i was pretty shocked and asked him what he meant, he said that he was asking Gumby what he did at my house over dinner and Gumby told him that i left to go get groceries and left him with Sarah. i said \"yeah. i did that. so what?\" and Frank went off on me about how he left Gumby to be babysat by ME. not anyone else. especially by \"some strange women i hang around with\" and i got really angry at that and started yelling at him, he was yelling at me. until he ended the call with \"you're never seeing Gumby again. you're lucky i dont call the fucking cops on you for leaving my son in a dangerous situation like this\" and he hung up.\n\nso i don't know. i figured i would ask here. should i have been more careful? am i the asshole for this?\n\nTL;DR: i left my nephew with my partners for an hour or so to go get groceries and my brother blew up at me for it because he doesn't accept my relationship as much as i thought he did\n\n&#x200B;\n\nEDIT:  the rough timeline of Franks jokes/rudeness is that Sarah and i got together. we dated exclusively for about 3 months and she expressed interest in polyamory and i was open to it. so we started bringing other people into the relationship casually. then Sarah reconnected to her old classmate and crush Mia. Mia was casually invited into the relationship and things were so good we kept wanting to see her until we all had a talk and became an official couple and moved in together soon after. i started bringing both Sarah and Mia to family parties and get togethers and that's when Frank started ramping up the hostility and jokes. before that it was just playful jokes here and there that i didn't care about. but this was openly hostile. so after the second family party it happened at was when we had that talk and Frank seemed to genuinely apologize to me, Sarah, and Mia and made an effort to accept me and get to know them at least casually. so we thought he had changed and accepted us or at least began to make an effort to almost three years ago. maybe 2 and a half at the very least.\n\nEDIT 2: alright. the official judgement is that everyone sucks. thank you all for your judgements and advice. i've decided that I'm going to call Frank and apologize for not giving him a heads up that i was running to the store and leaving Gumby with Sarah and Mia. it would have been good to do that regardless of his feelings about my relationship. a quick text giving him a heads up. that's all. But im also going to let him know that what he said on that phone call was deeply hurtful to my partners and i. even if it came from a place of parental panic or anger. he still said what he said and its clear those thoughts and feelings were in him already and he used them to try to hurt me. So im going to ask him not to bring Gumby by for a while to babysit because he clearly doesnt trust or respect my partners and i. and i cant allow that into my home even if i love Gumby so much and want to spend time with him. we can talk about it and try to move past this. but hes lost a great deal of trust, respect and progress in accepting me and my partners and he is going to have to work very hard if he wants a relationship with me again. and if he cant accept that, im going little to no contact. ",
  "id": 1,
  "comments": [
    {
      "score": 615,
      "content": "ESH but mostly you.\n\n\nHe's absolutely disrespectful about your relationship and disgusting in the names he calls your partners.\n\n\nBut you agreed to babysit and then went out. You don't agree to watch someone's kids and then leave them with someone else. I'd say the same, even if you were monogamous with Sarah.",
      "id": 2,
      "comments": [
        {
          "score": 362,
          "content": "I’m curious, would you also say this if Sara and OP were married?? I can’t imagine this ruling if this were a case where nephew was left with his aunt while uncle ran to the store. OP and Sara have been together 5 years, living together 3, Sara attends family events and knows brother and nephew, and OP has told brother this is the love of his life (as is Mia, to be clear). Being poly complicates options for official marriage, but in practice they’re basically a married couple. If I asked my married brother to babysit my child, and brought my child to the home my brother shared with his wife, I’d consider it pretty implied that wife is welcome to be involved; if someone has to run a quick errand and the child is having a blast with one of them, the other is free to run the errand. I’d pretty much assume that at some point my brother would do dishes, run to the bathroom, and even maybe pop over to the store while his wife took charge. Same would go if I left my child with my sister; sister’s husband would be trusted as well, unless I said otherwise. And honestly, if I didn’t trust the spouse with my kid, I wouldn’t leave my kid at the spouse’s home, even with my sibling there. It’s not like with sibling there, the spouse disappears.\n\nI’d agree with you if this was a casual girlfriend or someone the brother didn’t know, but at this point Sara is basically OP’s wife, an aunt to the child, a part of the family. If brother doesn’t trust her with the child, then that needed to be said.",
          "id": 3,
          "comments": [
            {
              "score": 83,
              "content": "It sounds like OP knows that his brother doesn't like his partners (even if just for the polyamory). While Sarah and Mia might be \"part of the family,\" as they go to every event, it doesn't sound like Frank has a relationship with either of them. Even if OP were married to Sarah, it depends on Sarah and Frank's interactions and relationship. \n\n\nI'll totally pass my kid off to either of my SILs in a heartbeat. But we talk and have a relationship.",
              "id": 4,
              "comments": [
                {
                  "score": 115,
                  "content": "I mean, it says “...Frank seemed to genuinely apologize to me, Sarah, and Mia and made an effort to accept me and get to know them at least casually, so we thought he had changed and accepted us…” and that was three years ago.  The kid also calls her “Aunt Sarah,” which sounds like a relationship. To me that sounds like Frank did have some relationship with them. Sounds to me like OP, Sarah, and Mia thought they had a positive relationship with Frank, while Frank was just tolerating them, and hence the misunderstanding. If Frank weren’t being super prejudiced against the poly relationship I would say N A H — it sounds like an honest misunderstanding where OP thought Frank saw them and their partners as one unit who were being asked to babysit as a unit, while Frank never accepted Sarah or Mia and thought their request was clearly specific to OP. Both parties need to communicate, clear up the misunderstanding, and make future decisions accordingly (or OP can just go NC because Frank clearly isn’t changing my his prejudices).",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Ok but would we be having this conversation if OP's brother disliked Sarah because she were black? A man?",
                  "id": 6,
                  "comments": [
                    {
                      "score": 5,
                      "content": "We've established that Frank is a bigoted AH. But, whatever his reason for not liking Sarah....relationship status, race, sexuality, gender.....he does have the right to know that his kid is being watched by the person he left him with.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I was going to say something similar, you said it better than I would have.",
              "id": 8,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -2,
              "content": "[deleted]",
              "id": 9,
              "comments": [
                {
                  "score": 4,
                  "content": "You may disagree, but personally I think when you ask a married person to babysit and have a relationship with both members of the couple (Sarah attends family gatherings, brother seemed to make a point to get to know her, kid calls her aunt…), the default assumption is that you’re asking the couple as a unit and just happened to text one of them. Seems there are different familial norms or cultures in this, but for me, if I asked my brother to babysit, I’d assume that he and his wife were (welcome to be) doing it together — and if either of them had to run a quick errand, that’s fine, the child would be with whoever was best for the child in that moment (eg, in this case the child preferred to stay with Sarah and more can go wrong in a grocery store than at home). But I’m used to think of married couples as one unit rather than as two unlinked people, so maybe that’s why? Obviously I respect individuality of each party, but I know everything that happens to one will also affect the other so I don’t generally think I can ask something of one without implied acceptance of the other, unless I specifically say so.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I think that’s a good point, and I don’t think that you should leave your child with someone if you don’t trust everyone in the house. Even if the person you trust is physically present in the house that doesn’t mean your kid won’t be alone with someone else at some point.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 117,
          "content": "Agreed. Your brother sucks. Really. But he left you the kid because he trusts you, not your partners. No matter how much of an AH he is, you don't leave a kid with someone the parent didn't explicitly agree to unless there's an emergency. Now, the fact that your brother can't trust your partner of 5 years and that he keeps berating your lifestyle is definitely AH territory and this needs to be addressed if you want to keep a good relationship with your brother. I wouldn't keep in touch with someone who keeps openly disrespecting my lifestyle.",
          "id": 12,
          "comments": [
            {
              "score": 65,
              "content": "If I am married and my sister leaves her kid with me I would probably go to the grocery store and leave the kid with my husband.\n\nIf I left my kid with my sister I would expect her to be able to leave the kid with her husband.\n\nUnless there was a situation where I had specifically said do not leave my kids alone with this person I would expect the person I leave my kids with to have good enough judgment to know who to leave them with.\n\nI say this as someone who's sister has been in relationships with people I would not leave my kids with.  At 1 point I would have told her do not leave the kids alone with them, once it got to the point where I knew she was in so deep she would not have honored that request I would not leave my kids with her period.\n\n If you don't want someone to leave your kids with their trusted partner you have to tell them that.  Specifically.\n\nThis is not leaving kids with a 15 year old and the 15 year old decides that it's fine to leave them with the 9 year old.  This is leaving a kid in a house with 3 adults who all trust each other and are taking care of the kid.",
              "id": 13,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 89,
          "content": "When you ask a couple to babysit, you don't generally get upset about the other person in the couple picking up the slack. \n\nTo claim otherwise is utrerly bizzare.\n\nAnd these arent random eomen, they are his partners who he has been with for 2 years.",
          "id": 14,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "I’m gonna have to disagree with this one. If Frank wasn’t comfortable with Gumby’s ‘Aunt Sarah’ at all, he wouldn’t have brought Gumby over in the first place, knowing that she lived there with him and they’ve been together for 5 years. NTA",
          "id": 15,
          "comments": [
            {
              "score": -49,
              "content": "There's a big difference between being okay with someone being around, and trusting them to be responsible for your kid. \n\n\nI'll leave my daughter with my brother. I know my nephew's are there. My brother better not leave and leave my daughter to be watched by his 9 year old.\n\n\nSomeone else gave a better example of trusting her best friend to watch her kid, and while the boyfriend is a nice enough guy, he's immature and she wouldn't trust him to keep an eye on the kid.",
              "id": 16,
              "comments": [
                {
                  "score": 56,
                  "content": "You can't equate a 9 year old child with a grown woman whose been in a familial role for half a decade.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "The partners here are fully grown adults, equating them to a child is bad logic.\n\nIf brother didn't trust Gumby to be with his aunt, he should've said so specifically. Now he acted all okay but then got upset over literally nothing bad. Looks like he was just fishing for a reason the go NC.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 37,
          "content": "That's bullcrap.  I cannot imagine any situation where I would leave my kids with a sibling and get mad if they went to the grocery store and left the kids with their spouse.\n\nSpeaking as someone who had a sibling in a relationship in a relationship where I would not leave my kids with her spouse.  I didn't leave my kids with her when she was in that situation because I knew that as her spouse she trusted him and would be willing to leave the kids with him.\n\nIf I were to leave the kids with her in some kind of emergency I would have told her specifically do not leave them alone with him.  And I would have been stressed to the whole time because since I knew she trusted him I knew she would leave them alone with him.\n\nHis brother is the asshole because in not expecting him to leave the kid alone with them he is showing that he doesn't see them as a team.  In his words he sees them as fuck buddies not as a real relationship.",
          "id": 19,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I dunno, a household can watch a 4 year old. This is about the brother's opinion of their lifestyle. The brother didn't make any requests ahead of time. Going full throttle afterwards makes the brother the AH IMO.",
          "id": 20,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 204,
      "content": "Esh- him for you using your life style against you.\n\nYou because you were the one who agreed to baby sit. Even when I baby sit my nephews and have to step out I let my sister know if it's ok if my husband watches them. first because if there is an incident she knows who is watching her kids and second because it's being open and communicating.",
      "id": 21,
      "comments": [
        {
          "score": -13,
          "content": "I just find that so weird that you ask your sister if it's OK if their uncle watches.his nephews.",
          "id": 22,
          "comments": [
            {
              "score": 57,
              "content": "Every family dynamic is different. But as I stated in case of an emergency she knows who her kids as with.",
              "id": 23,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 50,
              "content": "To a non-parent, that likely does sound weird.\n\nI can’t imagine any parent not appreciating this level of communication when at any given moment an emergency could occur, and a parent having as much information as possibly would be massively valuable and helpful, as well as just being good piece of mind.\n\nIf you are a parent who finds this practice weird, that’s fine, but I just don’t understand the harm, or weirdness, you’re attributing to the situation.",
              "id": 24,
              "comments": [
                {
                  "score": 64,
                  "content": "I AM a parent and if anyone in my family asks anyone else to babysit we all assume it's the family and not just the one person that was asked that would help. If I called my sister and said \"hey I'm going to the store can my husband watch your kids?\" It would be used as a joke against me forever. Also what harm did I ever mention?",
                  "id": 25,
                  "comments": [
                    {
                      "score": 13,
                      "content": "You’re obviously describing a very different family dynamic than the one in this post (namely, you already know your sister is cool with your husband watching her kids), but you already knew that, which is why your comment is phrased to be as obtuse as possible.\n\nMaybe a semantics issue, because yes, phrasing it that way would deserve ridicule. But regardless of dynamic or trust level or anything else, it is both common courtesy and not at all weird for anyone entrusted with the care of another’s kids to make them aware of a situation where the primary caretaker/point of contact/location/etc has changed from their original arrangement. Pretending otherwise is also being obtuse",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "Your family dynamic is very diffemt from OPs as well as other families. You are implying that just because eyour family does something a certain way... other ways are weird.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "I’m a parent and an aunt and it would never occur to me to let my sister know that I was stepping out and leaving her kids with my husband, nor would I expect her to let me know that about my kids. If I didn’t trust her husband I wouldn’t let her keep my kids. I might say something like “hubs is going to take them to the movies” or something, but just running to the grocery store? Not saying you shouldn’t do that if it makes you more comfortable, but that’s definitely not universal to parents.",
                  "id": 28,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I specifically redeemed my free award for you. I’m a parent and also an aunt. These are his long term partners and frankly longer than many marriages. And specifically not trusting your siblings partners without cause is weird. Isn’t that literally the whole point…meaning they are family too?  Why you are being downvoted it beyond me.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 115,
      "content": "[deleted]",
      "id": 30,
      "comments": [
        {
          "score": 117,
          "content": "I don’t disagree, but I feel like Franks shouldn’t be leaving Gumby at OP’s place during these visits then-they should happen at Frank’s. I find it hard to believe he feels comfortable enough with OP’s judgment and OP’s home environment to leave his child there regularly, but then also act like Mia and Sarah are some dangerous randos.",
          "id": 31,
          "comments": [
            {
              "score": 84,
              "content": "Thank you!!!!  I have been reading these judgements and I am so confused. If I don’t trust your household, you are not watching my kids. Everyone is talking about knowing who your kids are with; obviously with one of the three people in that household. \n\nI now understand how some kids end up in dangerous situations with people splitting hairs like this. It is important to know WHERE your kids are.  That gets an update. Like little Timmy is at the mall , park, grandma’s house etc. \n\nYou have to be extremely naive if you think that the other people in the house has not looked after your kid by themselves at one point or another. \n\nThe brother has an issue with OP’s love life.  He needs to stay away and read up on child protection laws ( cause really? What does he think the police will do other than order him a psych eval).",
              "id": 32,
              "comments": [
                {
                  "score": 14,
                  "content": "I mean, I would trust my friend to babysit my kid at home while her unreliable boyfriend is gaming. I wouldn't be ok with her leaving my kid for an hour with her boyfriend who can't even cook a grilled-cheese just because \"household\". The dude is nice but he has no idea how to take care of a toddler. My friend does. There's many aspects to trust. Eg. Frank can trust Mia and Sara not to harm his kid, therefore he is ok with their presence while brother babysits, but not trust them in their ability to take care of kid (feed them, entertain them console them, whatev). We all agree that Frank probably has stupid reasons not to trust Mia and Sara. Clearly, he is an AH. But it's not up to OP to decide for him who can take care of his kid.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 9,
                      "content": "But if I know my friend's boyfriend isn'tgood with kids, I'm not leaving my kid at her house. She can babysit at my place just her, or lay it out plain and simple, \"If you need to go out, please take my kid with you. I'm sure your bf is great, but I don't know him well enough to leave him alone with my kid.\" If they have an issue with it, that's on them. But at least they can make the informed decision as to whether or not to babysit.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 94,
      "content": "YTA. You don't leave someone else's child in the care of other people alone without checking with the parent first.",
      "id": 35,
      "comments": [
        {
          "score": 49,
          "content": "So if you left your kid to be looked after by a couple who had been together longer than the kid has been alive, you would be upset if only 1 of them looked after tge kid?",
          "id": 36,
          "comments": [
            {
              "score": 7,
              "content": "If I sent my kid anywhere to be watched specifically by one person, and they decided to go grocery shopping and dump him with someone without checking with me first, I would be upset, yes.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -16,
          "content": "But if he was married to one of them or was in a monogamous relationship this would have been a non issue. The issue you & brother have are he's with 2 women (right or wrong as long as all 3 are consenting adults it is none of our business)  He's been with both of these women for YEARS.  This wasn't 2 chicks he picked up last week.",
          "id": 38,
          "comments": [
            {
              "score": 53,
              "content": "No, the issue that I have is leaving a child with someone without clearing it with the parent first. This was not an emergency situation.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "I don’t agree. If someone asked me to babysit and didn’t specifically say ‘you and your husband’ I would ask them if it was OK to leave the child alone with my husband before doing so.",
              "id": 40,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "I don’t agree. If I left my kid with my MIL I would be upset to find out she had left him alone with her new husband and got groceries without letting me know that was a possibility.",
              "id": 41,
              "comments": [
                {
                  "score": 3,
                  "content": "[deleted]",
                  "id": 42,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Who decides to take a shower in the middle of babysitting for a couple hours?",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": -8,
                  "content": "Okay let me see if I understand this correctly, if you leave your MIL to babysit and she asks if it's okay your kid will be watched by her husband for an hour or so, so she can run some errant or do groceries, would you be alright with that and if you are, would that count for up coming babysit sessions or should she ask every time?\n\nI know I babysat my nieces when it was actually my in laws who made the agreement, but then one didn't want to come do groceries and rather stick at home and I was there so I offered to watch her for the time being. I got into an argument with that one once, kid called her mom stupid so I told her to not say that because it's not nice, she got very pissed but never heard of it again. I never got proper ''yes Dutch\\_catlady can babysit the kids'' I just offered when the question arose and no one ever cared. \n\nI guess it's different everywhere too and every situation is different of course but right now I'm really worried I illegally babysat my non related nieces.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Maybe if I knew him better but I’ve met him a handful of times. She has a car seat, she could either take him with her or tell us that it’s inconvenient to babysit because she needs to get groceries.",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "This thread is making me glad my nephews are teenagers now and I’m not going to get busted for illegally watching them.",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 92,
      "content": "NTA\n\nYour bother is being a drama queen and purposefully looking for things to end your relationship over. This may very well have been a set up and leaving for groceries could have easily been some other minor event in the day. What if you had an emergency? Under exactly what conditions would your brother accept Gumby being in Mia and Sarah's care? Can you go to the bathroom without Gumby? Can you take a call?\n\n&#x200B;\n\nEdit: If he truly cared about you and having a relationship with you, he would have called and calmly said \"hey, I'm not really comfortable with you leaving Gumby with someone when you babysit. Could you not do that again, please?\"",
      "id": 47,
      "comments": [
        {
          "score": 49,
          "content": "That edit tho\n\nLike it’s absolutely okay for the brother to request that OP doesn’t leave kid alone with partner, that’s a fair an appropriate boundary to have, but it’s obvious this wouldn’t have even been an issue to brother is OP was in a monogamous relationship",
          "id": 48,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 52,
      "content": "Here's the thing, he asked YOU to watch your nephew. Does he know your partners well enough to leave his son alone with people he's obviously not comfortable with? Even if that were the case, you absolutely discuss it with the parent instead of just assuming it's okay.\n\nYeah, he's a bit closed-minded here, but the issue isn't that, or it isn't just that. He's disrespectful and hateful, calling your partners nasty names, but that doesn't mean he's not allowed to be worried about who's watching his kid.\n\nMaybe you should calm down and think about that.\n\nESH",
      "id": 49,
      "comments": [
        {
          "score": -47,
          "content": "i thought he knew them well enough but i was wrong",
          "id": 50,
          "comments": [
            {
              "score": 27,
              "content": "Yup, never assume when it comes to people's kids. I am genuinely sorry that he isn't open-minded, though. It's tough to deal with.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Doesn't matter if he knew them \"well enough\". Could have been your own parents...he asked YOU to watch them. YOU said yes.\n\n\nGrocery shopping wasn't an emergency. \"Sure, I can watch Gumby most of the day but I really need to run to the store at some point, so I'll have to leave him with Sarah if he doesn't want to come with.\"\n\n\nAlso....do you have a car seat? Could you actually safely take him with you? I think if you are babysitting, you should get parental permission to take them anywhere.",
              "id": 52,
              "comments": [
                {
                  "score": 9,
                  "content": "That's his practical wife of 5 years. He obviously wasn't in danger",
                  "id": 53,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "i do have a car seat for him. yes",
                  "id": 54,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 33,
      "content": "NTA. Presumably if Mia wasn’t on the scene and you had a monogamous relationship or married to Sarah your bro would’ve been fine with it?\n\nAlso you’ve been with Sarah for longer than your nephew has been alive so how is she a stranger?",
      "id": 55,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 31,
      "content": "Info: Does your brother actually know Sarah and Mia on a personal level? Not just in a ‘oh they’re my brothers partners’ way without actually having spent time with them. \n\nI think it might be an ESH. Him for just being a dick because there’s nothing wrong with polyamory. You for leaving his child with other people after you agreed to watch him. I’m all for giving children autonomy, but he’s 4. You just say ‘come on bud, we’re gonna do some shopping. You can hold the list for me’.\n\nI hope he was just saying it out of anger and that he won’t actually stop you from seeing your nephew. Just think about it next time.",
      "id": 56,
      "comments": [
        {
          "score": 28,
          "content": "yes, he knows them well. ive been with them for 5 and 3 years and we've been to dozens of family parties, countless get togethers and stuff like that where hes been perfectly polite and friendly to them since we had that talk where he promised to be better",
          "id": 57,
          "comments": [
            {
              "score": 31,
              "content": "I might lean more towards NTA then. They’re not complete strangers and I’m assuming your nephew knows them really well. I think his reaction was more because of him not agreeing with your life style.",
              "id": 58,
              "comments": [
                {
                  "score": 23,
                  "content": "He calls them “aunt”",
                  "id": 59,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "I agree, leaning more towards NTA, because the kid said he didn't want to go and I'm not about to force a 4 year old to do something or go somewhere they don't want to. He already isn't the father, next thing you know nephew starts ramping up a tantrum and people start thinking you kidnapped him or something 🤔  just my opinion",
                  "id": 60,
                  "comments": [
                    {
                      "score": -2,
                      "content": "Simple solution: OP doesn't go grocery shopping if he agreed to babysit. \n\n\nAnd a kid can throw a tantrum no matter who they are with...including parents.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I’m thinking NTA too. I mean at this point lesson learned so apologize and tell him it won’t happen again. Did you think he would be uncomfortable with you leaving or did this come as a total shock? \n\nBrother may not approve of OP’s lifestyle choices, but he was willing to have his kid spend time in their home. OP left the kid with responsible, trusted adults. It’s fine for Dad to say don’t do that again, but I don’t think OP was an AH for assuming it would be okay.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "It doesn't matter how well.te brother knows the girlfriends. The brother asked his brother to babysit, not the girlfriends",
                  "id": 63,
                  "comments": [
                    {
                      "score": 10,
                      "content": "They're not just flings they've been together half a decade",
                      "id": 64,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "If I were you I'd stay away from your brother, he sounds bigoted and rather unhinged",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 29,
      "content": "NTA. The child literally calls your partner \"Aunt Sarah\"  so it isn't \"some strange woman\" to him. If this were a short term relationship you would be the AH.\nIf you were in a monogamous relationship he wouldn't have minded. If you drop of kids to visit the grandparents no one gives a shit if grandma leaves for groceries. Same if you drop kid of to hang out with uncle and aunt.",
      "id": 66,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 18,
      "content": "ESH. Your brother should accept your relationships and his language was uncalled for. But he’s right that *you* were asked to babysit. If you want to be able to leave the child with another adult while babysitting you need to get permission from the parent.",
      "id": 67,
      "comments": [],
      "relation": "No"
    }
  ]
}