{
  "post content": "I was telling my friends at a nye party about how I got a new job in Seattle doing finance and supply chain management for amazon. It’s a big deal for me because my current job sucks (procurement for State government)\n\nAlice then goes off and tells me that working for Amazon is pointless that I should have a greater purpose than shipping people boxes of stuff they don’t need. She then talks about how in her life that serving the country was her best decision and she was happy sacrificing pay to do meaningful work.\n\nNow if it was one on one I wouldn’t care but she said this in front of a lot of my friends. So I told her that her job in the air force was guard duty in Texas and data entry. That she didn’t serve the country anymore than I currently do in my state job.\n\nIt seemed like I flipped a switch she started cursing me out, saying she could have been called to Iraq. That I have no idea the training she had to do how tough it’s for women. Then saying I am ungrateful for the troops? I don’t think I was an asshole in this at all and I do respect the Troops but the ones that actually see combat not ones that are basically in government jobs.",
  "id": 1,
  "comments": [
    {
      "score": 412,
      "content": "ESH. You were both TA for calling out each others jobs. Regardless of what you view as 'real' soldiers, she's enlisted in the military and the threat of her being deployed is very real. Also, if you've ever been around anyone in the military in any capacity, you should have know that was a dumb statement to make.",
      "id": 2,
      "comments": [
        {
          "score": 409,
          "content": "Yeah those low brows go psycho if you nudge their hero complex",
          "id": 3,
          "comments": [
            {
              "score": 13,
              "content": "Eh, the Boot ones do. But there’s plenty of people who are uncomfortable with all the hero-worship and “Thank you for your service” because they look at it as a choice they made and a job they do. \n\nSource: was raised in the military",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 259,
          "content": "She was the one who said earlier that if she ever got deployed she would just get pregnant, in fact one of her friends did that when they asked her to move to Alaska.",
          "id": 5,
          "comments": [
            {
              "score": 94,
              "content": "Without putting that in the OP we wouldn't have any idea her feelings towards it.",
              "id": 6,
              "comments": [
                {
                  "score": 44,
                  "content": "I think OP was trying to avoid tainting the judgement",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 34,
              "content": "That is a risky maneuver, they could be deployed post maternity leave and now have to leave SO home with a baby. I’ve heard people say this and I can’t help but think it’s not a well thought out plan. My sister has been full time Air Guard for over 20 years, she deployed every year from 2-6 weeks. My family and in-laws always tried to find a way to help with her kids while she was gone. We were happy to help and she never used her kids as a get out jail free card.",
              "id": 8,
              "comments": [
                {
                  "score": 34,
                  "content": "Happens all the time.\n\nI did 2 deployments in the Navy and we basically had a betting pool on who would get conveniently pregnant around deployment time.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 36,
                      "content": "And their husbands will use it to get out of their rotations as well.\n\nSauce - went to Iraq in 2004 because the guy who was supposed to go was having his fifth kid... Five goddamn kids!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I'm going to gate keep a little here.\n\nYou don't get pregnant to get out of a 6 week TDY.\n\nWe're talking about real (6+ month) deployments.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Just the title reminded me of the episode of Curb Your Enthusiasm where Larry got shit for not saying \"thank you for your service\". People who join the army are not Gods and you don't have to worship them. NTA op. Alice needs to get over herself.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Females that do that shit are hated, in the military.",
              "id": 13,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "We all think that. \n\nWe're just not supposed to say it.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 49,
          "content": "\"Threat of her being deployed is very real\". Yeah, to Germany maybe? Given the description of her job, she isn't ever going to find herself in a warzone or in any real danger. Sorry, that's the truth of it.\n\nServed for 12 years, and the OP is dead on and this chick is exactly the kind of service member that rubs me the wrong way.\n\n&#x200B;\n\nNTA",
          "id": 15,
          "comments": [
            {
              "score": 8,
              "content": "I said the same. I also served.",
              "id": 16,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "As someone who was in the Army, I'm gonna say NTA. Mist military jobs are literally just jobs that happen to be for the government in the military. \nI was in the Army. So was my boyfriend, and his daughter is Air Force. I was a heavy construction equipment operator in an engineering unit. He was a Ranger and one of the President's 100, and was shot twice. She is a flight combat medic. They are heroes. I am not a hero for operating a bulldozer. \n\nNot everyone that joins the military has a hero status job.\nEdit to add: neither one of them brags about their service or their \"heroism\". He doesn't really talk about it all except to tell stories of his hijinks and funny stories of stuff that happened and some if the places he visited.",
          "id": 17,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Also not that its logical but anyone in Seattle considers OP TA for moving to Seattle to work for amazon\n\nIts not personal tho\n\nThey are more of an asshole for insulting your job but you shouldn't have sunk to their level",
          "id": 18,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "yeah the threat of being deployed to an airconditioned trailer in kuwait is ***verryyyyyy*** real. Lets be real here, while all soldiers \"serve\" theres different levels of service. Airforce security is pretty low on the list.",
          "id": 19,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I’m sorry the threat of being deployed loool. What is she just waiting for the chopper to pick him up at all times?? Amazon army base in Texas, either way both are doing work for billionaire corporations. Whether that’s in weapons contracts or amazon prime is irrelevant. Point here is buddy is not hero for dicking around on a military base in Texas. NTA",
          "id": 20,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 248,
      "content": "NTA imo, I’m not a fan of people that think they are saving the world because they joined a military branch.",
      "id": 21,
      "comments": [
        {
          "score": 46,
          "content": "While most people in the military are just regular folk it *does* attract a much higher percentage of assholes than most other occupations.",
          "id": 22,
          "comments": [
            {
              "score": 22,
              "content": "Don’t get me wrong, I respect the choice to join the military. And people actually doing stuff to help others in some capacity are brave for serving. A few family member of mine have served, and been stationed overseas. It’s the people that feel entitled to praise for serving, but didn’t do anything majorly important that irks me. Example, an old high school acquaintance of mine joined the national reserves out of high school, and was a weekend warrior until he got kicked out for failing a random drug screening. Five years later he’s still posting shit about “being a veteran” and “making the ultimate sacrifice to serve our country”.",
              "id": 23,
              "comments": [
                {
                  "score": 8,
                  "content": "I don't. If they want to help people they can join the peace corps.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 186,
      "content": "[deleted]",
      "id": 25,
      "comments": [
        {
          "score": 57,
          "content": "But then the south won't have anything to do.",
          "id": 26,
          "comments": [
            {
              "score": 10,
              "content": "Glorify the military that was defeated after rebelling?",
              "id": 27,
              "comments": [
                {
                  "score": 9,
                  "content": "I think he means the fact the politicians consistently use soldiers and veterans as tools to push their agenda without actually doing anything to help them when it doesn’t benefit said politician.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 95,
      "content": "NTA\n\nIt's called Chair Force for a reason.  \n\nI actually deployed and wouldn't fucking brag about it.  That is some boot shit.",
      "id": 29,
      "comments": [
        {
          "score": 10,
          "content": "She might well get the award for Boot of the Week.",
          "id": 30,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -8,
          "content": "Hey...my dad's Air Force and he's been deployed to Afghanistan twice. I'm not defending this woman, but please don't talk shit about the Air Force. He wasn't there to do desk work, and it's scary to have someone you love deployed in a dangerous area.",
          "id": 31,
          "comments": [
            {
              "score": 12,
              "content": "lol, ask your dad about his thoughts of the Navy.\n\nWe all shit talk the other branches.",
              "id": 32,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "It’s banter between the forces. Everyone knows how serious deployment can be. My Dad deployed several times over his 30 year career in the Air Force and as an civilian working for the government, still calls it the chair force",
              "id": 33,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 52,
      "content": "NTA. Undeployed military personnel are the most thin-skinned people on the planet. You struck a nerve because she's self-conscious of her own lack of meaningful contribution. There was absolutely no reason to turn it into a pissing match, but it sounds like she made a victim of herself.\n\nCongrats on the new job, and welcome to Seattle!",
      "id": 34,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 33,
      "content": "NTA. \"Those that live in glass houses should not throw stones.\" \nShe insulted you and you clapped back.",
      "id": 35,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 29,
      "content": "/r/JustBootThings\n\n( in other words NTA )",
      "id": 36,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 24,
      "content": "ESH- there is no need for anybody to denigrate anybody’s job.",
      "id": 37,
      "comments": [
        {
          "score": 3,
          "content": "Honest work is honest work.",
          "id": 38,
          "comments": [
            {
              "score": -33,
              "content": "[deleted]",
              "id": 39,
              "comments": [
                {
                  "score": 17,
                  "content": "That’s your decision but if you start insulting someone’s job at party and making it all awkward, YWBTA.",
                  "id": 40,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 22,
      "content": "> Alice then goes off and tells me that working for Amazon is pointless \n\ndisparaging your work.  they're an ass.\n\n>  She then talks about how in her life that serving the country was her best decision and she was happy sacrificing pay to do meaningful work. \n\nout of context, this is fine.  but in the context of the other sentence, this is double down on being an ass.\n\n>That she didn’t serve the country anymore than I currently do in my state job. \n\ninaccurate and an ass.  if she's in the military, and you're in the private sector, she's serving the country with her time, while you are serving corporate america.  \n\nyou were really naive to think this would go over well.\n\nESH.\n\ni think it's fair that you stand up for yourself, but you should still do so respectfully.  \n\n\"stop being so disrespectful to me.  it's horribly insulting to call my work meaningless.\"  \n\nfocus on the insulting thing she did, not on insulting her back.  i think your friends would have been on your side in this case.",
      "id": 41,
      "comments": [
        {
          "score": 127,
          "content": "Are you really so naive as to say that the military doesn't serve corporate America?",
          "id": 42,
          "comments": [
            {
              "score": -40,
              "content": "it can serve both\n\namazon only serves corporate america.",
              "id": 43,
              "comments": [
                {
                  "score": 23,
                  "content": "Can doesn't mean that it does. Amazon technically could also serve the country as well. I mean, you do realize it's been a good long time since we (America) have engaged another country over anything other than for capitalistic gains?\n\nI agree with you that ESH (he obviously sucks less since he didn't instigate but he could have been a bigger person), but feel the need to point out that you're wrong to say his statement was inaccurate. He stated a harsh truth that people don't like to hear.",
                  "id": 44,
                  "comments": [
                    {
                      "score": -19,
                      "content": "> I mean, you do realize it's been a good long time since we (America) have engaged another country over anything other than for capitalistic gains?\n\nthe onging freedom of navigation acts say otherwise. \n\n> He stated a harsh truth that people don't like to hear. \n\nthe harsh truth at the right time, is certainly the perfect truth to convey. \n\nthis was very very the wrong time.  the issue was the disrespect to the OP, and bringing the other thing up was very clearly a counter-attack on a related, but not the right issue.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": ">corporate america\n\nDo you see what word you used there? America, ie the country. Being in the military doesn’t automatically make you a hero, and working in the private sector doesn’t make you a villain. Think what America would be like if everyone “served their country” by joining the military. It becomes less of a country and more of a fascist dictatorship.",
                  "id": 46,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Amazon Web Services (AWS) literally supports the military. i.e. they provide the computing services that allows the military to operate. You have no idea what the fuck you are talking about.",
                  "id": 47,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "I thought they signed a massive contract with the Dept. of Defense.",
                  "id": 48,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 37,
          "content": "They aren’t in private sector they work for the state of Texas. \n\nThey are moving to the private sector.",
          "id": 49,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 22,
          "content": ">  in my state job \n\nOP's current job is a state government job, they are not currently working for Amazon.",
          "id": 50,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 15,
          "content": ">\"...inaccurate and an ass.  if she's in the military, and you're in the private sector, she's serving the country with her time, while you are serving corporate america....\"\n\nNo, the OP was referring to their curent/previous job where they did work for the state, not the private sector. They're switching jobs TO the private sector.",
          "id": 51,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Just a note, OP does say they currently work procurement for the state government not corporate America (amazon is a new job they haven't yet started).",
          "id": 52,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "[removed]",
          "id": 53,
          "comments": [
            {
              "score": 2,
              "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/wiki/index#wiki_1._be_civil).\n\nPlease [review our rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index) before posting again. [Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns. Please do not reply to this comment with an explanation, argument or apology and instead use modmail.",
              "id": 54,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 18,
      "content": "NTA. I guarantee other military personnel would make fun of her for saying something like that. She honestly sounds jealous. Being junior enlisted sucks. But her heart is no doubt in the right place and we can't knock her for that. Basic is terrible and the threat of deployment/time far away from your family is very real.",
      "id": 55,
      "comments": [
        {
          "score": 3,
          "content": "Basic for AF isn't terrible, it's a cake walk (I did training at Lackland and I've seen their \"boot camp\"). And given her job, the threat she faces is being sent to Germany to do more data entry.",
          "id": 56,
          "comments": [
            {
              "score": 3,
              "content": "Guard duty in Texas, at Lackland specifically, is something most every Air Force member gets to do. \n\nGod I hated doing research there. I have never met a building layout as nonsensical as that base.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    }
  ]
}