{
  "post content": "Bf \\[20M\\] and I \\[21F\\] have been together for 2+ years now. I smoked before I met him and it was no secret that I did. He told me early on that he has mild asthma so I avoided smoking when he was around or just went outside for a cig. We never argued about this before.\n\n&#x200B;\n\nAbout a year into our relationship, I casually mentioned to him that I should stop smoking cause I knew it was bad for my health. Ever since that day, he would get mad at me for smoking. I actually stopped doing it for about 10 months only because I was tired of all the passive agressiveness I got from it.\n\n&#x200B;\n\nI recently started smoking again (which he knows; he was a bit disappointed but that was that). I don't smoke much, maybe 2-3 cigs again tops. It's usually in the morning before lectures while catching up with my friends. Bf and I usually meet in the late afternoon-evening, so by then the smell is mostly gone. I'm sure of that because he didn't feel it until a couple of days ago, when I smoked like 2 hrs before we met and the smell was clearly there. He was really mad and said some pretty hurtful stuff.\n\n&#x200B;\n\nFast forward to today. We went and got dinner together. He's acting normally, except for the fact that he didn't kiss me when we met. Did the same thing yesterday but I just brushed it off and thought he was still a bit mad. Asked him about it and the conversation went something like this:\n\nbf: I'm not kissing you because you smoked today.\n\nme: I smoked like 8 hrs ago, what's the deal?\n\nbf: I just don't approve of this habit and don't want to kiss you if you smoked.\n\nme: So if I don't stop smoking, you'll never kiss me again?\n\nbf: Exactly.\n\nme: You knew I was a smoker even before we got together. How come it didn't bother you then?\n\nbf: In the beginning I didn't think we'd last this long. I didn't say anything about it for a year, but I realised that our relationship is serious so I changed my mind about the smoking thing.\n\n&#x200B;\n\nI didn't even know what to say to him. We went back and forth on this conversation but didn't get anywhere. He's not very physical as it is (which sucks for me because that's my love language) so this no-kissing-if-you-smoked situation is kind of a bummer. It wasn't hard to quit back then and I know it wouldn't be hard now, but I feel like he's being controlling and don't want to quit just because he's 'blackmailing' me into doing so, which just makes me want to smoke even more tbh.\n\n&#x200B;\n\nHe thinks I'm the asshole for not making a compromise and giving it up and I think he's an asshole for the way he's handling this. So reddit, what do you think?",
  "id": 1,
  "comments": [
    {
      "score": 101,
      "content": "Former smoker.  Even 8 hours later,  you STILL smell like smoke,  and yes,  you taste like stale smoke. ESH y'all need to have a sit down talk and hash this out. Best of luck.",
      "id": 2,
      "comments": [
        {
          "score": 5,
          "content": "Really depends on what you're smoking. Some cigarette brands linger and smell much worse than others.\n\nI smoke american spirit blacks and about half of the people I know are shocked when they learn I smoke, usually when they see me smoke. The majority of these people are not smokers, and are not numb to the smell. Someone who smokes 2-3 cigarettes a day is not going to smell like your stereotypical pack of marlboro reds a day smoker.",
          "id": 3,
          "comments": [
            {
              "score": 3,
              "content": "agreed. i smoke belmonts and i only smell like smoke under half an hour since smoking, after that it doesn't smell like smoke at all and no one can tell. my bf smokes pall malls and the smell lingers on him a little more, i smoked one of his and my parents said that i smelt heavily like smoke and the only difference was the brand from all the other times where they didn't notice at all. i also do smoke a lot less",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "[deleted]",
              "id": 5,
              "comments": [
                {
                  "score": 1,
                  "content": "Can't really add anything to that one, because for romantic partners I'm explicitly clear I smoke so that there's no situation like this post.",
                  "id": 6,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Former smoker as well who recently found his old smoking sweatshirt....that shit still smells 5 YEARS later.",
          "id": 7,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 15,
      "content": "NTA, but for real you should quit. Why are you smoking? It doesn't relieve stress... the withdrawals CAUSE the stress that you are feeling relief from. Non smokers don't have that stress.  Cigarettes don't even get you high, they just put a band aid on the withdrawal symptoms that they cause and you get to pay out the nose for the privilege of slowly killing yourself. \n\nDo yourself a favor and quit, NOT for him, for YOU. I just did... have smoked for almost 30 years. It hurts to think of the things I have missed while standing outside in a cloud of smoke feeding an addiction that isn't even cool or fun.  Find some better drugs",
      "id": 8,
      "comments": [
        {
          "score": 20,
          "content": "Gah smokers know this. You are not helping anyone.",
          "id": 9,
          "comments": [
            {
              "score": -8,
              "content": "That comment was only for his own benefit. Ex-Smokers are like alcoholics, they only think of themselves and their mistakes and assume everyone is exactly the same as them.",
              "id": 10,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 13,
      "content": "ESH\n\nYou two just aren't compatible. He wants you to not smoke and you don't want to. He's probably going to be passive aggressive about it forever if you guys stay together. Just break things off if you don't want to quit smoking.",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 13,
      "content": "Yeah, NTA.\n\nI get him, but at the same time this isn't the way to do things. I'd be happy if my partner smoked 2-3 cigs a day if they relapsed, rather that than, personally, more than 5-6, and I fucking hate smokers. \n\nHe's being unnecessarily controlling, you've compromised in  way, he hasn't. The fact you quit for him and not for you is probably why you started up again, he doesn't understand that. \n\nPersonally I'd reconsider the relationship if no amount of talking will help.",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "ESH, because\n1) He should've told you he had asthma right away, and maybe the relationship would'nt of had formed.\n2) You should stop smoking, like you did before. Just try vaping or use patches or what ever they have for that. \n\nIs the reason his asthma? If he knew when he started, then he shouldn't of dated you because of problems like this",
      "id": 13,
      "comments": [
        {
          "score": 7,
          "content": ">Just try vaping\n\nVaping is more addictive though. Definitely not a good substitute for someone who smokes as little as she does.",
          "id": 14,
          "comments": [
            {
              "score": 1,
              "content": "I don't know too much about the addiction. Is vaping that addictive? I know people who have done it for a few days, but haven't got addicted",
              "id": 15,
              "comments": [
                {
                  "score": 3,
                  "content": "Were they smokers? Addiction isn't as black and white as you may think though.\n\nA lot of smokers switch from cigarettes to vaping because in comparison it's a bit less harmful, but it's more addictive because of the nicotine or whatnot. It's recommend for people who smoke a LOT because it allows them to not constantly have to go out for smokes and such, but it comes with its whole set of issues. \n\nBest thing is to either quit, or smoke less. In her case really the best is to quit. There's some good medication out there for it too that work better than gums/patches.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I quit smoking after almost 20 years with vapes, and it was actually easier to wean myself off the vape.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Nope, but they were teenagers",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "No the reason isn't asthma, I've explicitly asked. He just doesn't like the idea of me smoking.",
          "id": 19,
          "comments": [
            {
              "score": 4,
              "content": "May be regarding your future. Don't think anyone would want to deal with a wife (maybe even mother) with lung cancer.",
              "id": 20,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "NTA - This is controlling.  I get he's concerned. I get he doesn't like it. But if you are going to smoke, he's gotta deal with or bail. Honestly, you giving up smoking isn't a \"compromise\" that's him getting his way because he asked to get his way. I'd be concerned if this was a trend with other things. The lack of touching thing is an issue too, if its incompatible with you.\n\nAs an ex-smoker myself, I get you. I never *wanted* to quit. I loved smoking. To this day I still want to.  \n\nThat being said it was an obnoxious, malodorous, expensive and unhealthy habit that can and does have real health consequences. Plus, people are getting very judge-y about it.\n\nI encourage you to quit, but ONLY if you are ready to. That's the only way you will stay quit anyway.  \n\nSo stand up for yourself. Quit only if *you* decide to.",
      "id": 21,
      "comments": [
        {
          "score": 1,
          "content": "I second the opinion that this is controlling, just because he knew before they started dating/when they started dating that she smoked. If he didn’t like it, he shouldn’t have begun/maintained a relationship with her.",
          "id": 22,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA, but maybe you could quit the cigarettes and the controlling boyfriend! \n\nI'm mostly kidding, if you can quit now, you should, outs so bad for you. I quit after 14 years, outs tough, but I felt so much better. \n\nThe boyfriend... He's being a jerk about the whole thing and should have said something in the beginning",
      "id": 23,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA, i hate that people have it in their minds that their partner will change their mind eventually out of \"love\" or \"compromise\" or whatever. if smoking is a dealbreaker for him, he can leave. but he can't expect you to quit for him, that's ridiculous.",
      "id": 24,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH, It’s all your choice, no one can make you stop, it’s your choice. Just know that they are just looking out for your health",
      "id": 25,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "ESH I do understand why he’d hate smoking and would want you to quit but he went about it the wrong way. \n\nYou should both be more mature and sit down and talk or else this relationship isn’t going to last.",
      "id": 26,
      "comments": [],
      "relation": "No"
    }
  ]
}