{
  "post content": "I (25m) am still friends with a lot of my friends from high school. I've been using facebook a lot more during COVID here in NYC to keep in touch with, and even reconnect with some friends. I'm commenting on more friends' posts, which also causes people to see my name, remember it from high school, and add me if we weren't already friends.  \n\n\nThat is what I thought happen with this one woman, C (24f). She was an underclassman in high school, one year my junior, and I literally don't remember hanging out with her. She want to my school, sure, and we have mutual friends, but we were never close. So when she added me, I was a little suspect, but she pretty much just added me and never messaged or interacted with me.  \n\n\nLooking through her facebook after she added me, it doesn't paint a pretty picture; she lost multiple relatives to the disease, including a parent who was financially supporting her. Her partner is some kind of disabled, but doesn't seem to receive government assistance, so C is basically supporting them, too. C works a really shitty, low-paying job, and doesn't seem to be able to make ends meet. Almost all of her posts are her asking for money, usually enumerating what bill is coming up that she needs help with. I'm sure it really sucks to be in her position. I haven't given, because while I'm financially secure now, my mother is ill and I anticipate having to financially support her very soon and need to save my money.  \n\n\nSince adding me, she's made no attempt to connect with me personally, no message asking how I am, or asking what I did since we went to school together, or posting about any shared interests. In fact the first direct interaction she made with me was a month after adding me, where she posted a reply to one of her posts asking for money with a meme and then tagged me and a few other people. I noticed she's started doing this more and more often, sometimes posting two or three memes and then tagging people she went to high school with. It's clear she's basically trying to get more visibility for her posts begging for money.  \n\n\nI was with my mother at the hospital and, admittedly, kind of annoyed, when I got a notification where she tagged me with another meme. And all I wrote was \"I would appreciate not being tagged in your posts if you don't have the basic decency to feign interest in my life before hitting me up for cash.\"  \n\n\nA lot of our mutual friends started messaging me saying that it was rude, that she's had a super hard time recently, that I didn't know what she went through. I pointed out I had no way of knowing what she'd gone through since she hadn't actually tried to reach out or contact me. I think there's definitely an etiquette to begging for money, as humbling as it is, and that I didn't appreciate just being added as a FB friend to widen her potential donor pool. I felt like I was being treated as a piggybank, rather than a person.",
  "id": 1,
  "comments": [
    {
      "score": 401,
      "content": "ESH. I have to say you could have just untagged yourself and unfriended her rather than lashing out. That would have been the non-asshole way of doing it. She obviously sucks a bit for putting people on the spot asking for money, but you could have handled it better.",
      "id": 2,
      "comments": [
        {
          "score": 50,
          "content": "I was going to reply, but you basically just said exactly what I was going to. Totally agree. Just block people and move on instead of making someone feel bad.",
          "id": 3,
          "comments": [
            {
              "score": 24,
              "content": "She could've even just stopped at \"please untag me in the future\" ESH",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "If nobody calls C out on her BS then how can she change. Sure she’s had a tough life but all of her “friends/piggy banks” are only enabling her. Sure it was “AH-ish” but if nobody says anything then it encourages this type our behavior. Better to say something when nobody has/will. We’ve all got to figure our own s*** out eventually otherwise we become too reliant on others to even bother doing better for ourselves on our own. Don’t get me wrong C definitely has it rough but this is a continuous occurrence with no end in sight.",
          "id": 5,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Same ESH",
          "id": 6,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "Basically this. ESH",
          "id": 7,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 127,
      "content": "NTA\n\nI'm sure a lot of people can be sympathetic to her situation, however what she is doing is rude and tacky.\n\nIf she is asking publicly for handouts then you can reject her the same way.\n\nYou said it how it is.",
      "id": 8,
      "comments": [
        {
          "score": 32,
          "content": "I agree.  She's putting people in a tough situation.  She shouldn't be publicly begging for cash like that.  Friending someone for the sole purpose of exploiting cash from them is wrong.",
          "id": 9,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 73,
      "content": "ESH, you don’t owe this woman anything but you could have set your boundaries without publicly embarrassing her. To be in a position where you are doing so poorly financially that you have to ask others for money is very embarrassing for many people, and I’m sure she would have understood if you simply said no. Personally I would have just unadded or blocked her",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 32,
      "content": "NTA, You don't owe her anything",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 27,
      "content": "ESH. You could just have unfriended her honestly.",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 22,
      "content": "NTA. She only wanted money. She was posting memes publicly instead of sending it via private chat to make it look like you  guys are close.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 22,
      "content": "ESH - You WERE rude. The simpler solution would be unfriend her or block her or something. It's social media, if she can't tag you then she can't bother you. It's clearly not a close friendship, why court unnecessary drama?",
      "id": 14,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 21,
      "content": "NTA- I had a \"friend\" on FB too who thought since my ex and I made a fair amount of money, we could just afford to fund her and her loser middle aged boyfriend's irresponsible lifestyle. Worse, she would never come right out and ask, she would hint. And then make vaguebook posts about how \"Funny how when you need me to bitch about your life, I'm here, but when I need a little help, you can't be bothered.\" Bitch, I have 6 kids. It's just you and your boyfriend who refuses to work. How is this my problem? NTA NTA, NTA!!!",
      "id": 15,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "ESH. Just unfriend her.",
      "id": 16,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "ESH- I get where you're coming from and in the sense you're not TA but the way you went about it was kinda unnecessary. You should have messaged her privately but yeah. I do however hope your mother is okay. Sending best wishes",
      "id": 17,
      "comments": [],
      "relation": "Support"
    }
  ]
}