{
  "post content": "Edit 2: (First edit at bottom) Thank you everyone for your feed back I've had an interesting mix of YTA, NAH, and NTA.\nI appreciate everyone's input and I accept each verdict given, thank you all for your thoughts on this one ^ ^ )\n.\n\n\nSo I am used to it; but my friend says its really mean so I figured I'd ask.\n\nSo last week I told my dad that I really want to go out to this place I really like because I don't get to go out; he of course said no because he wants to relax from being at work. (And the trip he took the day before)\n\nI told my mum, a few days later, that I really wanted to go to said location because I really want to get out of the house and do more things, I can't drive so I can't get to places. Buses don't reach any where particulary interesting either.\n\nSo today they both go to town and had been taking a while, so I called to find out when they were heading home so I know when to put dinner on.\nThey tell me they went out to the location ive been wanting to go to >.> \n\nI asked if they were joking and they went \"no\" and I said \"you know I've been really wanting to go\"\n\"Yea but we didn't think you were up to it, sorry\" my dad's apology was a half hearted one that was just said for the sake of it really.\nI said \"no it's fine. I'm used to it\" of which my dad continued to act as if I'm the ass hole for being disapointed.\n\nThey have done this in the past many times and each time acted like I'm the asshole when I've said that I'm upset that they go to places I've specifically asked to go only a few days prior.\n\nSo AITA for being upset that they do this?\n\nEdit to add: clarity here 😅 I've nothing against my parents doing things alone and I encourage them to have alone time as often as i can, even going out of my way so they can be alone.\nIt's just really hurtful when they pick locations to visit that I've asked to visit days after I've asked, if it was a few weeks it wouldn't be an issue 😅",
  "id": 1,
  "comments": [
    {
      "score": 58,
      "content": "NAH.  28 friend welcome to the life of an adult. your parents don't have to take you places anymore.",
      "id": 2,
      "comments": [
        {
          "score": 3,
          "content": "Yea I know that 😅 it's just frustrating that they go to places I've asked about visiting soon after I've asked.\nThey are always going out and doing things and I've no one to really do anything with",
          "id": 3,
          "comments": [
            {
              "score": 21,
              "content": "Maybe this is their way of encouraging you to grow wings, find your own place, and not rely on them taking you places?",
              "id": 4,
              "comments": [
                {
                  "score": 11,
                  "content": "I did have my own place up till 2020, my abusive ex husband made me homeless basically and I had to move back home.\nAs for wings, I'm trying to learn to drive and as soon as I get my licence I plan to buy a car so I can get a better job with better pay so I can start saving to get my own place.\n\nI'm saving as much as I can right now",
                  "id": 5,
                  "comments": [
                    {
                      "score": 14,
                      "content": "So, it sounds like that’s the case, then. They’re adults. You’re an adult. You have to make your own plans and arrangements. Don’t expect them to act like your friends. Keep saving and get out on your own as soon as you can. Stop being disappointed when they don’t bring their adult roommate (which is basically what you are now) along when the two of them go out.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Agreed on NAH. Are you asking your parents because you want to go with them, specifically, or are they your best option for a ride. Because currently it sounds like you’re asking for a favor and they decline, which is fine. There is a chance they feel like a chauffeur when taking you, which is fine, but just be aware that you might want to consider if you’re inviting them to come or asking them to take you.",
              "id": 7,
              "comments": [
                {
                  "score": 3,
                  "content": "That's a fair assessment.\nYou've given me things to think about, honestly I don't like doing stuff alone, never have, I really want to go out with my grandma but she is disabled now so I don't ask to do anything with her because it's not right, even though she will drop everything to help me.\nI always say no when she offers.\n\nMy parents I want to spend time with them but it's not often they want to hang out with me, we don't share the same interests really.\nBut they love going out to places when invited I usually take along, though not all the time because I think they should have time together without me.",
                  "id": 8,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 25,
      "content": "I’m really on the fence with this one. NAH maybe? You’re not a child but a fully grown 28 year old adult (according to another post). I can understand being frustrated but they aren’t under any obligation to take you everywhere.",
      "id": 9,
      "comments": [
        {
          "score": 0,
          "content": "That is fair.",
          "id": 10,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 22,
      "content": "INFO: How old are you? What was the place (e.g., a restaurant, a park, an amusement of some kind)?",
      "id": 11,
      "comments": [
        {
          "score": 10,
          "content": "28 according one of OP’s older posts.",
          "id": 12,
          "comments": [
            {
              "score": 20,
              "content": "Then I'd say OP is TA for being annoyed. \n\nYour parents are a unit, but as a full-grown adult, you are no longer part of that unit and your parents are allowed to do things without you, just as you are allowed to do things without them.",
              "id": 13,
              "comments": [
                {
                  "score": -3,
                  "content": "That's fine I've nothing against them doing things with out me, they do it often in fact and i choose not to join them so they have time alone necause i get how it must be for them. It''s just frustrating that they do things I mentioned only a few days or a week prior is all.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 0,
          "content": "It was a lake side that is very beautiful and teeming with wild life, I've no way to get there on my own.\n\nHonestly I respect their need for time alone, I truly do, and I go out of my way to stay put of their way so they have time alone, it just hurts my feelings is all.",
          "id": 15,
          "comments": [
            {
              "score": 9,
              "content": "Maybe it’s time to get your license?",
              "id": 16,
              "comments": [
                {
                  "score": 2,
                  "content": "I am taking lessons.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 18,
      "content": "Maybe it was a date time for your parents? If you are 28 you are an adult if you are home then when do they get time to just spend time with them.  If you want to get out of the house more look at either driving or if not look at investing in a bike.  You can be annoyed but so can they take you ask all the time for them to take you places all the time.",
      "id": 18,
      "comments": [
        {
          "score": 2,
          "content": "I am learning, it's just frustrating that when I suggest some where I'd like to go, they seem to intentionally go there just to spite me.\n\nThey date often actually and I make time to get out of the house for them as often as I can.\nIncluding my birthday yesterday when I honestly would have been happier at home but such is.",
          "id": 19,
          "comments": [
            {
              "score": 2,
              "content": "Happy belated birthday 🎂",
              "id": 20,
              "comments": [
                {
                  "score": 1,
                  "content": "Aww thank you 😀 ❤",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 12,
      "content": "YTA. How old are you? Get your act together and move out. You are playing 3rd wheel.",
      "id": 22,
      "comments": [
        {
          "score": 3,
          "content": "I was forced to move back home in 2020 after my abusive ex husband made me homeless 😅 \n\nI don't like being 3rd wheel but I cant afford to leave home though I'm saving up to do so",
          "id": 23,
          "comments": [
            {
              "score": 12,
              "content": "So sorry about your abusive ex-husband, but....\n\n...if you don't like being a third wheel to your parents, stop being a third wheel to your parents. They obviously would prefer to go places without their fully adult daughter tagging along. When you tell them places you'd like to go, they likely think it sounds like a fun place to go together.\n\nThey're your parents, not your friends. Stop expecting them to do things with you.",
              "id": 24,
              "comments": [
                {
                  "score": 9,
                  "content": "I lived with my parents on & off until I met my husband and we bought a house. There were times I’d mention to them a cool exhibit or something else that I think would be fun and they ended up going without me. That’s ok because I’m an adult and so are they. Just because we lived together didn’t mean they were obligated to take me to something I said I was interested in attending. Couples need time alone. If they don’t invite you that means they need time alone.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I don't know why people seem to think I disagree with them being alone 😅\nIt's literally only because I asked to go to one place and I felt it unfair they didn't take me this one time.\n\nI go out of my way so that they can have time alone with out me around 😅 they are always going out alone together which I've nothing against and support.\n\nIt's just as I said I asked to go one place that I can't get to myself.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Luv what you said!",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10,
      "content": "NTA but learn to drive and get some independence. You can't spend your whole life relying on other people to make your dreams come true.",
      "id": 28,
      "comments": [
        {
          "score": 3,
          "content": "I'm trying to but it's gotten complicated, my first driving instructor just vanished and I've managed to start with a new one after a few months so I'm getting there.",
          "id": 29,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "They probably can't for several reasons. I'm 27 and I can't drive because of my anxiety and panic disorder. One of my friends can't drive because of seizures. We don't know her situation.",
          "id": 30,
          "comments": [
            {
              "score": 8,
              "content": "Then she can call a Lyft.",
              "id": 31,
              "comments": [
                {
                  "score": 7,
                  "content": "Depending on area, lyft and uber dont operate.  There are way more places lyft/uber dont operate than they do. \n\nHowever, they are saying busses plural, so it could be an option there provided OP has income. No driving probably restricts jobs.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 6,
                      "content": "OP is 28, not 13. If there are buses there are likely ride shares or at least taxis. And at that age it’s time for them to get a bike, learn to drive, get a taxi etc to get a job and gain some independence.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "I can't really drive either. I have history of terrible decision making, and have almost gotton into accidents so many times no matter how hard I try to change it. It feels awful to be responsible for someone else's life. Driving is dangerous, and it terrifies me I could be responsible for someone's death one day when I know I tend to not pay attention to things.",
              "id": 34,
              "comments": [
                {
                  "score": 2,
                  "content": "I'm so sorry to hear that, I hope things get better for you.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Thanks! I alternatively ride a moped in the spring and summer to work. It feels so much more comfortable than a car, and I can be a lot quicker and precise. Can't ride it in the Winter though. Too cold and dangerous in icy conditions.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I agree. I have severe panic attacks when I think about driving and I'm seeing a psychologist who has advised me to not worry about driving. I'm terrified of dying in an accident or causing someone else's death. I've seen one too many wrecks happen and have almost been in wrecks to the point where I'm perfectly content not driving. The panic attacks and potential danger just isn't worth it to me. I'm just glad my family and psychologist understands that.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I'm so sorry to hear that, I get the same way with trains, I've a massive phobia of them.\n\nI hope that your psychologist can help x\n\nAlso I'm sorry about people down voting you just for saying about anxieties, people who don't get anxiety don't tend to understand the crippling effect it can have on others. People also seem to be down voting any one who thinking I'm NTA or NAH.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9,
      "content": "YTA - dude, i get the circumstances leading to you living at home again but you're 28yo. you're an adult. your parents' obligation to facilitate a family outing for you ended ten years ago.\n\neither learn to ride a bike, or start coordinating things with your parents yourself as if you were proposing stuff to a friend group. \"hey, this would be fun to do - are you available X day? it's Y cost if that's okay by you\". if they go with it, great; if they do it without you, that's how it is.",
      "id": 39,
      "comments": [
        {
          "score": 2,
          "content": "Yea I get that, just honestly frustrating is all, as for my friend group getting time where we can all do things is difficult, they have their own responsibilities and I don't like to rely on other people including my parents.",
          "id": 40,
          "comments": [
            {
              "score": 7,
              "content": "no, that's what i'm saying. you have to treat your PARENTS the same as your friend group. (edit: it's been a long day, that's my screw up)\n\nyour parents also have their own responsibilities. they have their own schedule. helping you right now - while the best thing for you and i'm hopeful they don't begrudge you that help - impinges on their schedule and sometimes they're not going to want to hang out with you more than they see you at home.\n\nhence why i said if they (your parents) are up for a group hangout, great. if not, it is what it is.",
              "id": 41,
              "comments": [
                {
                  "score": 1,
                  "content": "Oh right fair enough 😅",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "NTA. do they have a right to go places without you? Sure. But the way they went about it is somewhat cruel. If they didn't want to take you there, how hard is it for them to tell you that instead of going through this weird passive aggressive blame shift?\n\nI'm also kind of confused by how dismissive people are being and telling you to go there by yourself: like, even if you did have a way to go there on your own, that doesn't make what they did any better?\n\nI will say though OP that i get the feeling you are clinging to your parents in a way that is harmful to yourself in the long term. This is not the first time they've done this, correct? They do not value your wants the same way you value theirs, and they do not see any issue in treating you this way. I feel like I am watching a puppy give big begging eyes for food and hoping it will not get kicked this time. in which case very soft TA for making yourself go through this knowing how it will likely end. take care of yourself: you deserve to surround yourself with people who care about how you feel.",
      "id": 43,
      "comments": [
        {
          "score": 2,
          "content": "Thank you, I honestly teared up a bit reading that last part, it's always been this way with my parents but I love them so much I don't want to disapoint them.\n\nI do wish they took my feelings into account but they often ignore how I feel in the long run.\nMy mother often takes out her anger on me, my dad on the other hand will get angry if I'm sad about something, more recently before Christmas I was experiencing appendicitis type pain (it wasn't in the end, the hospital thought I was at first though) and while shopping I was holding my side and not smiling happy, just being quiet and with held.\nMy dad had a massive go telling me off for being miserable all round the shop.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA Next time tell them about somewhere you really want to go that sounds believable but also doesn't exist, send them on a long wild goose chase around the Country looking for it.",
      "id": 45,
      "comments": [
        {
          "score": 1,
          "content": "That would be funny. I'm not against them for wanting time alone, I go out of my way to let them have time alone. I honestly miss my old home so much and I wish I was there again, not that I'm ungrateful for them taking me in but I hate being 3rd wheel as anyone would, I've sadly no choice.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NAH but dude you’re 28 years old. Time to maybe learn how to do things by yourself. Make some friends.",
      "id": 47,
      "comments": [
        {
          "score": 2,
          "content": "I've friends and I do alot by myself, I only asked to go to this one place that was all 😅",
          "id": 48,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}