{
  "post content": "Me and my fiancee (22m & 23f) had our baby girl Thalia and she just turned 9 months old. Everyone in our family has been coming around more to see her. Two months ago we stopped talking to my parents after they pulled some shit. \nWe basically decided it was gonna be up to Thalia when she older if she wants to get her ears pierced. Tbh I was never into the idea of it being done as a baby when they can’t consent, like my fiancée parents pierced her ears when she was a baby and she always hated wearing earrings. Still doesn’t wear any. \n\nJust like every other parent that was our decision not to do it to her while she’s a baby. My parents didn’t shut up about it for a while saying “she’d look so cute.” But we told them already no and that’s our answer. When they babysat for us once they got one of my mom’s friends to do it and we were fucking pissed they went behind our backs. We stopped talking to them after that for disrespecting our decision. Everyone was saying we were making a big deal and we can’t cut them out their granddaughters life over something like that.\n\nSo we decided they’re allowed to only see Thalia when one of us is around and they won’t be left alone with her. That’s where everyone is still saying we’re being massive a-holes because we’re still punishing them over something that’s not a big deal and we’re treating them like children. Even my fiancées parents think that only letting them have supervised visits is too much and they should be allowed to babysit or have Thalia at their place alone like before. \nWe’re still not wanting to change our minds on our conditions so it’s pinning everyone against us. Are we being assholes that we just don’t trust them alone with her and rather one of us be there always?",
  "id": 1,
  "comments": [
    {
      "score": 14485,
      "content": "NTA\n\nI wouldn't be leaving my child with them ever again. My mum cut my daughters fringe and I lost it; this is another level all together\n\nWhat's going to be next thing they decide they know better on? They're lucky they're even allowed to see her tbh\n\nEdit - a fringe is 'bangs' - so mum cut her hair (she was only 2 or 3yo, but we were growing her hair out but mum decided she knew better...) \n\nAlso, thank you all for the likes and awards, very unexpected 🙂",
      "id": 2,
      "comments": [
        {
          "score": 4851,
          "content": "I didn’t want contact for a while because we were both seriously pissed off about this and that they crossed this line",
          "id": 3,
          "comments": [
            {
              "score": 4056,
              "content": "This is actually assault.  If you had reported this to the police it would have been assault on a minor and they would have been in serious trouble.",
              "id": 4,
              "comments": [
                {
                  "score": 2949,
                  "content": "It certainly was a medical procedure without the parents' consent.\n\nI am especially flabbergasted that other people hold this against you:\n\n>we’re treating them like children\n\nlike, wtf? It is *them* who are treating you like children. It is *them* unable to accept that you are the ones who are make parenting choices for your daughter and who think they know better than you. You said no, they did what they wanted anyway, against your explicit wishes. They deserve what they got. I wouldn't leave my daughter unsupervised with anyone who did this to her either!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1803,
                      "content": "Not only this - but they had a *friend* do it, did they even take her to a sterile professional environment? I’ve seen a lot of friend piercings lead to gross infections.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 229,
                      "content": "When you give an adult instructions and they make a mistake, that's when they may need supervision/assistance. When said adult deliberately goes against those instructions, that shows a complete disregard to the instructor (you) and should be met with firm action. Regardless if people say you are treating them like \"children\", what you are doing will show them they were wrong.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 200,
                      "content": "It's not even a medical procedure! It's considered a cosmetic procedure and topping it off with no parent consent. This is 100% assault on a minor. Add the fact it was most likely done with a piercing gun that cause trauma to the soft tissue and increase the risks of a serious infection and scaring. They should definitely go completely No Contact with the grandparents and anyone who sides with the grandparents can kick rocks too.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 94,
                      "content": "[deleted]",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 56,
                      "content": "This is not a medical procedure.  This is body mutilation, without the parent's knowledge or consent, and performed by someone without a licence (or so it seems).  Honestly, a judge would grant a restraining order for this, and possible jail time (it's been done before, I'm trying to find the link)",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "treat them like children and hold them down and pierce their ears",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "Ear piercing (or any piercing) is not a medical procedure.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Well to be fair it's the paternal grandparents who think the consequence is too harsh.  But thats because they are probably afraid of not seeing granddaughter over something they do so I would say they probably are boundary pushers too.  \n\nNta op.  The day someone put holes in my child's body without my consent would be the last time they saw my child.  That is a huge breech of trust.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I don't think this counts as a medical procedure.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "I would argue that it isn’t so much “parents treating OP like a child” as “parents acting like children.” But either way the parents behaved awfully",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 100,
                  "content": "Came here to say this! In the UK, this would be assault! You can have a baby’s ears pierced (although it’s not as common in the uk), but you must have the parents permission to do it. \n\nI think you are actually acting a lot calmer than I would be OP. I would be livid! They pierced your child’s ears, knowing expressly how much you didn’t want it done! If the person who pierced them is registered (assuming you have to be registered in your country), I would be lodging a complaint against them. \n\nNo way would the grandparents be getting anywhere near my baby again without me being in the room. The fact that they can’t even see how bad this is, and are saying you are overreacting, gives an idea of how little they care about your wants and wishes for raising your child.\n\nNTA, but the grandparents most definitely are!!!",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "OP, seriously consider filing a police report. \n\nNTA. Of course MIL and FIL are taking Mom and Dad's side. They didn't respect Fiance's body autonomy, so geese of a feather and all that. Anyone who overtly go against my rules as the parent would be hard banned. Anyone who sides with them do not take me seriously as the parent. Therefore expect the who lot of them to stomp on your boundaries, sooner or later. So no unsupervised visits for any of them, going forward.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 4,
                      "content": "When others comment on something that's not their business, I would say, \"This is between me and my parents\".",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "i guess. but only if you're willing to press charges.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Not to mention going after the place that did the procedure without parental consent.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This is actually not assault on minor. That charge would most likely require an intent to inflict harm, most likely great bodily harm, on the child if the state they are in even has that charge. Based on what OP said, the grandparents did not have that intent and it would be highly unlikely anyone could prove that they did. That being said, it is entirely based on the state you are in and it may be a strict liability charge there. But most likely this is not even close to assault, and legal conclusions shouldn’t be made without requisite knowledge. But hey what do I know",
                  "id": 21,
                  "comments": [
                    {
                      "score": 19,
                      "content": "In the UK doing anything like this without the parents' consent is automatically assault and taken very seriously.  Especially if it wasn't done by a licenced professional",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "They intended to mutilate the child and leave permanent holes on the child's body.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "Depending on where you live, cutting someone’s hair can be considered assault. So eat piercings definitely would!!!",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Please PLEASE get the authorities involved to establish a pattern of behaviour/paper trail at the very least. \n\nIf (pray never) something terrible happens to your family or child at their hands sometime down the line, a paper trail of official documents of their actions will be your best friend in a court of law. \n\nEven if you do not intend on following through with the charges of assault, get this incident on the books. Your future self and your grown up children will thank you for it.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Just saw this comment. But 100%^ it is assault.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -5,
                  "content": "Mf you really think cops or the legal system are going to arrest grandparents for piercing a kids ears? How the hell is Reddit so out of touch with reality?\n\nObviously they shouldn’t have done it without permission. And the parents have full rights to withhold their child from them since they’ve proven they don’t care about what they want for their kid.\n\nBut assault charges for an EAR PIERCING? You are so out of touch from being on this subreddit for so long it’s hilarious.\n\nOp is NTA, btw",
                  "id": 27,
                  "comments": [
                    {
                      "score": 9,
                      "content": "In the UK this is automatically flagged as assault and they absolutely would be arrested for this, and charged.  Especially as it doesn't appear to have been done by a professional.  (the \"friend\" would be in even bigger trouble) Thankfully our judicial system takes mutilating children seriously.",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "They’re not going to get arrested, but OP should file a police report so they have a record of it. Grandparents that boundary stomp this badly often go on to do much more egregious things.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 684,
              "content": "Not to freak you out op, but find the justnomil coconut hair story. It’s deleted but comes up if you look it up on google. Show it to anyone who says you’re an AHole.",
              "id": 30,
              "comments": [
                {
                  "score": 380,
                  "content": "I really wish this comment wasn’t a thing, because I just read this story and now I’m crying my eyes out for that poor family.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 157,
                      "content": "I was literally just about to Google it before I read your comment and now I won’t go anywhere near it.",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 43,
                      "content": "That and the Noisy Gobshite stories are the ones I legitimately cry about.",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "God, now I feel sick to my stomach.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 128,
                  "content": "First thing I thought about when I started reading OP's story. If I were OP I would have stuck with never allowing them to see the child again.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 75,
                  "content": "Oh no, not that story :/",
                  "id": 36,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 69,
                  "content": "I just read that story with my 20 month old in my arms. I'll be holding her even tighter tonight 😭",
                  "id": 37,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 53,
                  "content": "I remember reading that the day it was first posted. I was in my junior year latin class, and I was not supposed to be on my phone. I had to go to the bathroom and sob.",
                  "id": 38,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 49,
                  "content": "Jesus that story is awful. Why the hell would the grandmother do that?!",
                  "id": 39,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Both of my children have severe nut allergies.  When we first found out the allergist warned me about what he called “the grandparent effect.”  He warned about letting them babysit if the don’t 100%“believe” in food allergies.  Sometimes they will give your child the food they are allergic to just to show you that you’re wrong, or blowing it out of proportion.  The effect isn’t limited to grandparents, but I guess it happens often enough that he calls it the grandparent effect.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "Because some people just don't THINK. It makes it sound minor but people get hurt or worse all the time from thoughtless people.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "[removed]",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "I wish I hadn’t googled it. That poor baby.",
                  "id": 43,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 47,
                  "content": "I just read it and cant stop crying. Why why why the hell did she do that.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "I read it a while ago and it's absolutely heartbreaking, can't imagine how hard it was for them",
                  "id": 45,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "Just an FYI, the mother regrets posting about it and requested it not be shared anymore.",
                  "id": 46,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 180,
              "content": "I’d consider going no/Low contact with anyone who tells you this isn’t a big deal; I wouldn’t leave my kid alone with those people either.",
              "id": 47,
              "comments": [
                {
                  "score": 77,
                  "content": "Depending on who they are, they might be the kind to let the grandparents over without op knowing",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 137,
              "content": "Giving in just shows them they can do it, you’ll be mad for a little while and things will go back to normal. They knew your stances on it, were told multiple times no, and still decided to put your daughter through a procedure that alters a part of her body. That’s a hard fuck no from me. \n\nI don’t have mine pierced, and my girls won’t until they make that decision and can properly care for it themselves. If anyone went behind my back to do it because THEY wanted to, there would be hell to pay.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "Don’t stop there though, anyone who disagrees with your parenting choices doesn’t get to have alone time or babysit your child. They clearly don’t have respect for your parenting decisions and would go behind your back too. NTA.",
              "id": 51,
              "comments": [
                {
                  "score": 30,
                  "content": "I actually think this is part of why it's so important to stand your ground here - it tells everyone in the family, not just these two, that they must respect your parenting decisions, period.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "[deleted]",
              "id": 53,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 32,
              "content": "1) You set a clear boundary, of which as your daughter's parent you have absolute authority on.\n\n2) They decided that as your parents, they have absolute authority over you despite you being fully formed human adults.\n\n3) They used this imagined authority to ignore your boundaries and override your authority with your own child.\n\nScrew them, what they did shows a *profound* lack of respect in you and your fiancee, and if they do not respect your boundaries, there is nothing to say what they will do next, as they have demonstrated they believe they have absolute authority over your child.\n\nIt would still be wrong, but maybe a little more understandable if this was an actual important thing, where they believed your method of child rearing was bad for the child so they tried to rectify it, but this was something so inconsequential and unimportant that if something truly important did come along, how could you expect them to use any restraint at all?",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "If everyone is upset because you're only allowing supervised time, you may as well forbid any time/visits whatsoever.\nThey are already angry so just cut the problem in the bud.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Yeah, they *mutilated* your baby. \n\nI’ve got my ears pierced with 3 holes in each (and I’ve had more that I’ve had close up), BUT it was **my decision**. I chose to have them done as a child, I chose to have them done again as an adult... when I had my daughter, I wouldn’t let her have them done until she was old enough to make an informed decision. \n\nI don’t agree with babies having it done. At all. It takes away their choice. \n\nYour parents not only massively overstepped, but they put your baby in pain at a time where she won’t understand AND made a relatively permanent decision about her appearance. \n\nEven if the hole closes up, it leaves a mark. \n\nNTA I wouldn’t let them anywhere near my child ever again and I’d have them and the friend done for assault if it was me.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I'd be saying zero contact until they admit they were wrong and apologise - and only THEN supervised contact.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 314,
          "content": "Holy shit just think about what they’ve done. They permanently damaged their granddaughter’s ears to put jewelry in, which can cause an infection and possibly kill the child if it was not done with sterile gear, which is not confirmed because it was just one of their friends and possibly not a professional. If the granddaughter doesn’t like the piercings when she is older, then they permanently ruined on of the main parts of her body. That is absolutely absurd. NTA, and the grandparents are such TA that they might as well have shit popping out of them.",
          "id": 58,
          "comments": [
            {
              "score": 278,
              "content": "Someone who pierced a baby’s ears without their parents consent is like a tattoo artist who’ll tattoo minors. It’s a good bet they don’t care about best practices",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": "Well in children it isn’t permanent- It can take a few weeks, but baby ears close up if there isnt an earring in the piercing.\n\nNot to mention, OP doesn’t say whether the friend is a pro or not- or at least, someone who knows how to pierce ears. If they care about the kid, I doubt they got a random friend to do it for them.\n\nAnyway, I personally won’t judge OP on their piercings thoughts, because I had mine done as a baby and I personally don’t care that it was done, but OP’s parents are TAs for doing without consent from the parents.\n\nNTA OP",
              "id": 60,
              "comments": [
                {
                  "score": 84,
                  "content": "If they weren't pierced properly, the holes might not close properly unfortunately. Thankfully, op didn't mention anything about it looking improperly pierced so that's likely not an issue",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 56,
                  "content": "Babies and children grow quickly,  and are more prone to scarring because of that.  Even if the holes close up,  chances are there will be dimples in the ears and scar tissue left behind.  \nSource- have dimples and scar tissue from ear piercing when I was a child.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "As someone prone to keloids even though no one else in my family gets them, yes piercings can be permanent. I will for the rest of my life get injections in my ear several times a year. It randomly feels like it's on fire. If it's cool outside I need ear muffs because it can't tolerate the cold.\n\nThankfully, that was a piercing I choose and consented to at least.\n\nTechnically, the hole is closed I guess. But the damage is permanent.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "There’s a good chance that the holes will leave a mark. I had mine done when I was 5, and had to take them out because I couldn’t take care of them. Got them redone later when I was older, but the original piercing hole is still there, right above the actual hole. I have to put earrings in with a mirror so I don’t accidentally puncture the grown-up piercing.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "The friends qualifications are pretty dubious because most professionals know how much trouble they'd be in for doing this without consent. Most professionals also want to speak to the caregiver about cleaning and aftercare etc. They're lucky their child doesn't have an infection with this cowboy.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "If they care about the kid, they wouldn't pierce her ears behind the parents back regardless of who they had do it.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "my parents pierced my ears when I was a baby, they did it at a jewelry store with one of those terrible guns. my left hole was so badly done that I struggled to put earrings through it for years, and one night I woke up with terrible pain and a bleeding earlobe because my earring moved in the hole and pierced soft tissue next to it (the hole was super uneven.) after that I've stopped wearing earrings altogether, but to this day both of my earlobes are scabbed and I hate touching them. I wish my parents didn't want me to look \"pretty\". this should be explicitly forbidden and illegal just like tattooing a child is.",
              "id": 67,
              "comments": [
                {
                  "score": 3,
                  "content": "I’m so sorry! That is horrible. My mother also got her ears pierced unwillingly and hated them so I know how you feel. I’m sorry that happened to you.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 3,
                      "content": "thank you ❤️ I'm sorry about your mom too. really wish some traditions died out!",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "It's depressing how many people are willing to put holes in their child without bothering to know the risks. I have a friend like you who had their ears pierced poorly as an infant and it pretty much destroyed their earlobes as well, basically like cauliflower ear just on the lobe rather than cartilage. They risk tearing their earlobes if they decided to try putting earrings in again. It's not really my fight but I can't help but bring their situation up anytime the subject of infant ear piercing comes up.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "They probably just bought one of those cheap piercing guns that you can buy at like walmart.",
              "id": 71,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "Jumping on the top comment here\n\nNTA also i would like to point out that a lot of people have low level nickle allergies, myself included. Most studs are made of nickle and i have scar tissue around my ears because of my allergy that could develop into a keloid, i cant wear earrings without them being pure gold or silver. Have actually stopped wearing them all together. Please watch to see if the child has any itchness or redness at their ears after wearing earrings. Dont blame you one bit.",
          "id": 72,
          "comments": [
            {
              "score": 2,
              "content": "This, yes. I wear surgical steel posts in my ears for the same reasons. \n\nOP totally NTA",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "My sister’s nan (we have different dads) gave her meat when she was little and my mum never a allowed her to see my sister ever again. It was sad but understandable. This is another level though because pierced earlobes may never close fully (because your daughter is a baby they may). But still, the trust is broken.",
          "id": 74,
          "comments": [
            {
              "score": 4,
              "content": "Wtf that’s an extreme reaction to eating meat lol\n\nYour mom took away her grandparent because she wanted her baby to follow her strict diet? \n\nExtremeee",
              "id": 75,
              "comments": [
                {
                  "score": 3,
                  "content": "If baby isn’t ready for solids, a chunk of meat is very dangerous.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Ok, I get the ear piercing thing but wut? Grandma fed her granddaughter meat and your Mum (assuming she told grandma not to feed her meat) NEVER let grandma see her again? When you say little I'm assuming you don't mean newborn and should not be eating solids yet. Was she allergic to the meat or something and it could have made her seriously sick? Or was it just your Mum is a vegetarian and wanted to impose those eating habits on her daughter? Because if it's the later, I understand your Mum being upset but the response to NEVER let Grandma see her again is way overblown. It's not like your sister had made the decision for herself not to eat meat and Grandma tricked her into eating meat. I get that not eating meat is very important to some people, but if your sister wanted to try the meat this is akin to telling Grandma not to give her candy or ice cream but she does it anyhow. What if your sister decided she wanted to eat meat when she got older? Would your Mum freak out?",
              "id": 77,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Was there a reason that the child wasn’t allowed to eat meat or was it the mother’s imposed diet? Sounds pretty ridiculous to have that reaction over someone allowing their child to indulge in a protein that humans have been eating since the dawn of their existence (and quite nutritious).",
              "id": 78,
              "comments": [
                {
                  "score": 2,
                  "content": "If baby isn’t ready for solids, a chunk of meat is very dangerous.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Not only that, they got their friend to do it. Is their friend a professional with training and proper, clean equipment? Somehow I kinda doubt it.",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Also, there’s a big big chanse the babys ears were pierced with a piercing gun, they’re so so bad.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yeah. It's not about the ear piercing. It's about blatant disregard for the parents' wishes. You can't trust people who not only will do things you don't want them to do, but also refuse to apologize for what they did, dismissing it.",
          "id": 82,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I once read a story here about a girl with coconut allergy I think it was, whose grandma ended up killing her with some traditional hair treatment that had coconut oil. Grandma kept saying everyone was overreacting and how could someone be allergic to coconut?",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Agreed! Not only is it a disrespect to the OP and their fiancee but they also took away their grandchild's choice-which was the whole point OP was having about allowing their child to decide later what she would like.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "NTA. That would've been the end of my relationship with them. I would have also removed the earrings as well. That's sick. Anyone telling you you're being mean needs to be blocked.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3369,
      "content": "NTA - Pretty sure this isn't legal. Ear piercing requires a parent or legal guardian's consent. I don't think grandparents qualify. \n\nI think body modification against a parent's explicit wishes makes them unfit carers. What other instructions are they going to ignore because \"it looks cute\". They deliberately hurt your baby for cosmetic reasons. And let's be clear. Piercings do hurt. The are uncomfortable afterwards when you need to keep twisting the stud against raw flesh inside until the skin grows over.",
      "id": 86,
      "comments": [
        {
          "score": 1150,
          "content": "hey just letting you know twisting earrings is actually bad for them! it used to be reccomended but over time piercing and jewellery has changed a lot, and also it just irritates your ear and makes it more likely to get super infected.",
          "id": 87,
          "comments": [
            {
              "score": 424,
              "content": "Seriously? I got my ears done when I was 7 so the advice might have changed. Bigger piercings they still suggest to clean with salt water a couple of times per day. \n\nStill, it's not painfree.",
              "id": 88,
              "comments": [
                {
                  "score": 287,
                  "content": "Yeah when I got my septum pierced the person told me a few times not to twist it and avoid touching it as much as possible until at least 6 weeks, then they gave me a paper with care instructions that also said not to twist it",
                  "id": 89,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 256,
                  "content": "My 5 year old nanny kid got hers done and they said clean them daily but don’t twist them.  When I got mine pierced you were supposed to twist them all the time.  I guess things have changed. 🤷‍♀️",
                  "id": 90,
                  "comments": [
                    {
                      "score": 71,
                      "content": ">When I got mine pierced you were supposed to twist them all the time.  I guess things have changed.\n\nSame here, this was almost 30 years ago when I got my ears pierced.",
                      "id": 91,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Your kid's nanny is 5 years old?",
                      "id": 92,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "If you’re getting pierced at Claire’s or another shop like that they’ll tell you to twist it because they have no idea what they’re doing and still use a gun.",
                  "id": 93,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 91,
              "content": "Yes twisting the earrings is like cutting the inside of the piercing with micro pieces of glass due to the crust the comes from a healing piercing. Shouldn’t touch piercings, twist them, or pick the crusties.",
              "id": 94,
              "comments": [
                {
                  "score": 67,
                  "content": "Which is a lot to ask of an infant... Not that anyone is suggesting otherwise here, but definitely another way to know that parents are the AHs. Babies can't be trusted with their own piercing aftercare of *don't touch it,* so they shouldn't be pierced!",
                  "id": 95,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Oh absolutely and not to mention places like piercing pagoda and Claire’s pierce with butterfly backed earrings which the skin can grow over and cause even more problems and the piercing “guns” cannot be sterilized like a single use needle is.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "They would touch it but they are pretty unlikely to actually twist them, since that takes some finesse.\n\nWe got special piercings just for healing and were told to gently clean them with some solution and leave them alone, and only after like 2 months we can switch them for the decorative piece. But it's probably unlikely ppl are given those unless at proper piercer.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I’m terrible about the crusties. Really need to quit messing with those.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 2,
                      "content": "From my research it’s ok to gently remove them with a wash cloth or a a spray like Neil piercing/wound care but if you have to dig to get the crusties off then your doing more damage",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I was told by my piercer that you only have to twist them if they were done with the gun.",
              "id": 100,
              "comments": [
                {
                  "score": 80,
                  "content": "On a side note: do NOT have them done with a gun.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "yeah agreed with danarexaurus, getting your ears pierced with a gun is extremely unsafe. if your piercer ever reccomend twisting fresh piercings go to someone else because thats how you get infections, irritation bumps, or piercings that don't heal properly",
                  "id": 102,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I had my ears pierced 3 times as a child with the gun, and they always got infected. This last time I went to a tattoo parlor and it was so much easier and less painful. I did have a minor infection, but this one was caused by my kid grabbing it with his dirty hands. I will never let anyone I know get it the gun way. Thank you Claire's and piercing pagoda for the traumatic experiences.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Wait seriously ?? \nIt's been 10 years since I've had my ears pierced, and it was recommended that I twisted my earrings to make sure the hole wouldn't close. It's been infected ever since\nWhat can I do now about it ?",
              "id": 104,
              "comments": [
                {
                  "score": 19,
                  "content": "Take them out. Let it heal, then get it pierced again at a tattoo shop with a legit needle. No guns. Then don't touch it except some salt water rinses for a couple months. Chronic infection can lead to several health issues. Time to start fresh.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 5,
                      "content": "It's been months since I've put on earrings. It's still constantly infected \n\nBut I'm going to see a dermatologist soon, I'll ask them...\n\nI got my ears pierced at a renowned jewellery, I don't know if it's the gun or anything, but I directly got pierced with the earrings, if I remember correctly... It was 10 years ago so I'm not sure haha",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Let it heal and get it done with the needle instead of the gun at q real shop",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "That’s so weird! We got my daughters pierced in august and both the salon and my mom said to make sure you clean and then twist them. (My mom had had my sisters done in 2012)",
              "id": 108,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 105,
          "content": ">Ear piercing requires a parent or legal guardian's consent.\n\nWhich they circumvented by OP's mom having one of her friends do it. Hopefully a legit piercer (correct term?) would have known that and refused to do it. Do they have licenses/certificates they can lose?\n\nOr they just had some random person poke holes in a poor baby. Which is worse.",
          "id": 109,
          "comments": [
            {
              "score": 5,
              "content": "Legit piercers don’t pierce babies.",
              "id": 110,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "OP, If your Mom’s friend is a legit piercer and did this, they could probably lose their licensing. When anyone says you’re being too extreme, point out that you haven’t pressed charges against your mother for what she did. Anything she gets now (regarding contact with you or your daughter) is frankly a gift to her. NTA",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 104,
          "content": "Not sure where OP lives, but in a lot of places that would be considered assault. OP's parents are lucky they haven't been charged. NTA (or rather: Everyone sucks here, except for OP, his fiancee and baby daughter.)",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "> Pretty sure this isn't legal. Ear piercing requires a parent or legal guardian's consent\n\nIs the piercer supposed to ask everyone for proof that they are the parent or legal guardian? \n\nI’m surprised you can get a baby’s ears pierced at all tbh",
          "id": 113,
          "comments": [
            {
              "score": 25,
              "content": "Yes they are. You should have to show ID",
              "id": 114,
              "comments": [
                {
                  "score": 1,
                  "content": "[deleted]",
                  "id": 115,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Usually they will make a copy of the adults ID to keep on record.  That way if the adult is lying and the actual parent comes in, the piecer can show the adult the copy of ID. Also if child is old enough they have a school ID and the piecer can look at both IDs.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Actually, for licensed places they are required to verify relationship of the minor to the adult requesting. I just took my 17 year old daughter to get her septum pierced, and she had to show her license, I had to show mine, as well as her birth certificate, and my marriage certificate to her father showing that WAS my last name, as well as the marriage certificate to my now husband showing why my last name is different from hers. I even brought my judge-signed divorce papers to cover the base of \"how do we know you are legally allowed to have this last name different from hers\" but they thankfully didn't require those. It is very much so a legal, covering-our-butts thing the piercing parlor does, and I'm glad they do it.",
              "id": 117,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Oh they most likely know it wasnt legal. Or at the very least they couldn't get anyone but the grandmothers friend to do it as they didnt have parent consent",
          "id": 118,
          "comments": [
            {
              "score": 3,
              "content": "Just what I was thinking. 16 years ago was a piercer and there were strict laws about piercing babies. Our state law at the time only allowed us to pierce *one* ear at 3 months and we could do the other ear at 1 year. We also had to see a valid DOB for the baby (I.e. birth certificate, passport, ect) and ID of guardian. If guardians got angry, we just told them they are free to go to their dr’s office to inquire about having it there, but they always said the drs would say no until 1 year.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1305,
      "content": "NTA\n\nYour parents behaved like children therefore they deserve to be treated as such.\n\nThey broke your trust, went against your express wishes and pretty much said 'we know better than you and what you think is irrelevant'. I can't get my head around why anyone would think you aren't justified in your actions.\n\n(I hope you've taken the earrings out and have let the holes close over before they become permanent).",
      "id": 120,
      "comments": [
        {
          "score": 176,
          "content": "It might not matter even if they did. This exact scenario happened to me as a baby but the home piercer fucked up and I have two holes close together in my right lobe. An earring was never put into the “mistake” one and it doesn’t go all the way through but it looks like I have two holes.",
          "id": 121,
          "comments": [
            {
              "score": 63,
              "content": "Oh wow, so sorry about that....I think doing this kind of stuff  is just barbaric, how anyone can condone piercing someone without their consent is a mystery to me.",
              "id": 122,
              "comments": [
                {
                  "score": 36,
                  "content": "Tbh in my culture it’s common to get piercings as a baby, and I was always really happy with the fact that mine were done early on. I love piercings, but i am a bit squirmy with needles so I was always grateful that I didn’t have to deal with the first set of piercings. \n\nAlthough I do understand the issue of consent, and I wouldn’t do that to my child if I were to be a parent. Just because it worked out for me, doesn’t mean it will for everyone.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "I got pierced at a Claire's as a kid and have the same thing in my left earlobe rip",
              "id": 124,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 23,
          "content": "Yes. OP isn’t punishing his parents, he’s protecting his child. Their actions were concerning on two levels:\n1) The piercing actually was a big deal. It caused needless pain, requires the parents to do upkeep and permanently altered the baby’s appearance. This should absolutely be a parent’s decision (and I agree with OP and wouldn’t do it until the child is old enough to ask for it, at the earliest).\n2) They’ve demonstrated they have no respect for the parents’ right to make decisions, and they have terrible judgment. Next time, they might disregard the parents’ wishes when it comes to discipline or safety. They also might make a bigger effort to cover their tracks.\nOP and his wife are right to be pissed. They’re being really reasonable to continue the relationship on a supervised basis. OP’s parents should be careful if they want a relationship at all.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 894,
      "content": "[removed]",
      "id": 126,
      "comments": [
        {
          "score": 172,
          "content": "Rachel's sister, Amy in \"the one where Rachel's sister babysits\" S10E05\n\nEdit: there were no great lessons about how to handle such a situation in the episode.",
          "id": 127,
          "comments": [
            {
              "score": 15,
              "content": "To be fair, it took the attention away from Emma’s huge nose.",
              "id": 128,
              "comments": [
                {
                  "score": 2,
                  "content": "\"Em-a-ly\"",
                  "id": 129,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "That was my first thought.",
              "id": 130,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 91,
          "content": "I’ve genuinely never understood piercing a baby’s ears. Like if you suggested giving them a septum piercing, guarantee the grandparents would lose it, but since it’s ears apparently that’s ok. Just seems like a health hazard and accident waiting to happen.",
          "id": 131,
          "comments": [
            {
              "score": 24,
              "content": "Hard agree. \n\nI don’t get what part of “its never okay to cosmetically alter your BABY” that people don’t get.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Yeah, vanity and gender stereotyping make people do awful things! This sounds sarcastic but I’m serious",
              "id": 133,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 20,
          "content": "NTA and for people to brush it off and say it isn't a big deal really pisses me off for OP. That was absolutely not their decision to make and I would have reacted the exact same way if not worse. That is crossing a serious boundary and it would take a lot of work on their part to gain even a little bit of trust back.",
          "id": 134,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 459,
      "content": "NTA. Even letting them come hang around at all is generous.\n\nThalia is a great name btw",
      "id": 135,
      "comments": [
        {
          "score": 37,
          "content": "Thalia is a gorgeous name",
          "id": 136,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Logic would be proud",
          "id": 137,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 345,
      "content": "You're NTA, your parents are. While this particular event is not a big deal health-wise, their blatant disrespect to you as the child's parents is very concerning. If they're willing to do this in complete disregard of your wishes, who knows what else they might do... The compromise of not allowing them around your child without one of you present is a reasonable one. Ignore everyone else calling you the assholes in this situation, they are wrong.\n\nYou are the parents of this child therefor it is your choice. If they don't like it, they can pound sand.",
      "id": 138,
      "comments": [
        {
          "score": 287,
          "content": "It *can* be a big deal healthwise, and it's also illegal! You need parental permission to get ears pierced from a professional. They had a friend do it, possibly with unsterile equipment. Piercings are also quite painful, and leave permanent scars the parents and child didn't consent to.\n\nI hope they took those earrings out ASAP. Mine were professionally done but still get infected and scarred terribly. At least I consented to it as an adult. I'd be FURIOUS if this had been done to me as a child.\n\nI kinda feel like the parents went easy on the meddling grandparents... they still get to see her! I'd never let them see my kid again until they knew what they did wrong! Everyone in the family telling the parents they are overeacting need to butt out. This is super messed up.",
          "id": 139,
          "comments": [
            {
              "score": 73,
              "content": "You’re so right. I got run down and a little immunocompromised once when I got a piercing and it got so infected and wouldn’t heal. Babies aren’t known for having very strong immune systems",
              "id": 140,
              "comments": [
                {
                  "score": 8,
                  "content": "My ear was pierced when I was 4 and it hurt and got super infected. I'm 32 now and I still have the scar.",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "A lot of piercings done on infants also grow up to be lopsided. My sister actually had to have hers redone because one was so badly off-center as an adult.",
              "id": 142,
              "comments": [
                {
                  "score": 3,
                  "content": "Agreed. Mine are SO badly done that I can’t even wear earrings because they look ridiculous",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Yeah my ears were pierced at the age of 6 and I asked for them, my mom didn’t want to do it until I agreed to it myself. But all I knew at age 6 was that they looked pretty. I didn’t know about scarring or infections and they have never once not been infected. I never wear earrings because it’s too painful and my ears get red and hot and start leaking pus and then afterwards I have to soak my earlobes in isopropyl alcohol and use antibiotic ointment. They leak pus constantly, even if I haven’t worn earrings in over a year.",
              "id": 144,
              "comments": [
                {
                  "score": 6,
                  "content": "You need to see a dr, and see if you can let them heal fully and close up (with a dr supervision, you might need antibiotics or something else before they close up) An ear piercing should never have pus. If you want it done later on make sure to go to a tattoo shop with a professional piercer. \n\nGood piercings in the ears should heal  quickly and cleanly- the issue is so many people go to unprofessionally places with those horrid guns. The guns, which can’t be sterilized, don’t use needles- they use the earring backs which means it tears the skin while going in. It traumatic to the skin, can often look bad, and cause scarring and infections..... whereas a piercing needles cuts the skin cleanly, is easily controlled on location and infection is rare. \n\nI wish I had known that for my girls- both got theirs done when they chose around 5/6 or so and both had issues with their piercings. My youngest ended up letting hers grow over and my oldest (now a tattoo artist and piercer) redid them for her. They look amazing and they were never even slightly red, they healed perfectly.\n\nI HIGHLY recommend you see a professional piercer. They deal with things like this a lot, and will have some good advice.",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "You voiced my every thought and opinion on this matter",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Thank you for bringing up how they “had a friend do it”!!! Piercings should be done in a sterile environment with sterile equipment! The piercings I got done in non-sterile environments all got infected. \n\nAnd yea OP is NTA.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I’d also be worried about leaving baby with those people telling the parents they’re overreacting-if they think it’s fine to pierce baby’s ears, what might they do while babysitting?",
              "id": 148,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Yup. I can confirm. I was six when I first got my ears pierced and I had an AWFUL infection after I got my ears pierced. They were bleeding, infected AND I was allergic to the metal they used. We didn’t even know that I was allergic to anything until I got them pierced. It was pretty bad, and they had to pay for solid gold studs, plus oral antibiotics and topical antibiotics, because they still wanted me to have pierced ears.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 255,
      "content": "NTA! Who knows what they'll disobey you about next! Your child, your rules. Supervised visits are extremely generous. Check r/JustNoMIL , there are MANY stories of grandparents boundary stomping like your parents did, and escalating when not stopped. Everything from parental alienation to purposefully stealing \"firsts,\" to putting the child in dangerous situations, even feeding children known allergens as a \"test.\"\n\nIf they keep ignoring your rules, it may be time for a timeout. Piercing your child's ear causes scar tissue that may be permanent. (She's young enough that the holes may close completely.) What if she turned out to have a metal allergy? (This happened to me as a young child. Turns out I'm allergic to gold, silver, AND nickel. I can never have pierced ears again due to all the scar tissue.) This is not a minor thing. Good luck.",
      "id": 150,
      "comments": [
        {
          "score": 131,
          "content": "Metal allergies are no joke. They can result in nasty scarring after infection, especially in a BABY that was done with NON-STERILE GEAR by a NON-PROFESSIONAL.\n\nThose grandparents aren't safe for baby to be alone with if this was no big deal to them! What else will they do next?!",
          "id": 151,
          "comments": [
            {
              "score": 87,
              "content": "Nickel allergy here.\n\nMy maternal grandmother pierced my ears at 3 months. Then again at age 2. Then again when I was 4. Every time the same thing happened: My ears would swell up until I looked like Dumbo, there'd be a horrible thing infection & I'd get a fever.\n\nMy daddy finally put his foot down about it & said no more.\n\nWhen I was 14, I decided for myself that I wanted earrings. We went to a *real* piercer (which was funny tbh. Imagine Hank Hill visiting a tattoo parlor. LOL) & explained what had happened when I was a kid.\n\nThey're the ones who told me about nickel allergies & how common they are. (I was later tested & yup. Positive.)\n\nThey felt my lobes & told us I had so much scar tissue that they weren't completely sure they would heal right. I said that was fine & I still wanted to try. They used titanium studs & it worked!\n\nHowever! My original holes are STILL, nearly 30yrs later, prone to closing up very quickly if I don't wear earrings every day. That scar tissue prevents them from EVER fully healing.\n\nSo that's fun. ಠ_ಠ\n\nMy daughter is 8. I've already told her no earrings until she's at least 12.",
              "id": 152,
              "comments": [
                {
                  "score": 16,
                  "content": "I'm so sorry you went through that! I'm of the same stance. My kid will make the choice, and we're going to a professional parlor to do it.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Thanks. My mother's side of the family is extremely vain/appearances oriented. There was a lot of \"How will anyone know she's a GIRL???\" thrown around when I was a baby (because I wore glasses? Apparently that made me look like a boy? Idek).\n\nIt was super dumb. They're dumb. LOL",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Got mine done about 7....i have to have real gold or real silver or plastic. Any other type my ears react to badly. So this can be bad for a baby for sure.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yeah I begged my mum to let me get my ears pierced - I was about 4 or 5. Went to a Claire’s (aka ... not great quality) and they got so infected because I’m nickel sensitive/allergic (I can wear nickel on clean, healthy skin, for a few hours. Otherwise open/damaged skin it gets angry real fast). The holes survived, and I’m 27 now and still wear earrings. But I remember screaming in pain as my parents did their best to keep my ears clean and make sure I was okay. \n\nI can’t imagine a baby, not able to verbalize these things, having to go through that.",
          "id": 156,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 200,
      "content": "NTA it was a form of assault. You did not consent. You will never trust them with a child who cannot stand up for themselves and speak out. So until then they cannot look after her unsupervised. Actions have consequences",
      "id": 157,
      "comments": [
        {
          "score": 66,
          "content": "Yup. Piercing requires parental consent. What they did was illegal, and they could be charged in most places.",
          "id": 158,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 138,
      "content": "NTA\n\nYou said no, they ignored it - if they're willing to blatantly go against you on this, what else will they go against you on? It isn't their baby, they do not get to make these decisions, and they sure as hell don't get to override the decisions of the actual parents without consequences.\n\nHonestly, them being allowed around her at all is beyond generous already, they need to count their blessings that they're even allowed near your daughter.\n\nIf you haven't already, remove the earrings and let the ears heal over - your babies ears will change over time and piercings done when you're a baby can grow to be off-centre later in life. Also, if it was done with a piercing gun instead of properly with a needle, it could result in permanent damage to the earlobe, best to let it heal over properly and let your daughter decide when she's old enough.\n\n&#x200B;\n\n> My parents didn’t shut up about it for a while saying “she’d look so cute.”  \n\nYour parents are treating your baby like a fashion accessory, they need to respect her right as a person to have bodily autonomy.\n\n&#x200B;\n\n> Everyone was saying we were making a big deal and ***we can’t cut them out their granddaughters life over something like that.*** \n\nI mean - if you wanted to, you absolutely could. You're the parents, either your family respects your decisions and your daughters right to make her own choices later in life, or they don't get to see her. What are they going to do about it? If they don't want to lose access to their granddaughter maybe they should be more respectful of your decisions. The only power the rest of your family holds here is the power to guilt trip - they cannot force you to give them access to your baby. Whether or not they have the privilege of seeing her is entirely up to you.\n\n&#x200B;\n\n> everyone is still saying we’re being massive a-holes because we’re still punishing them over something that’s not a big deal and we’re treating them like children.    \n>  \n> my fiancées parents think that only letting them have supervised visits is too much and they should be allowed to babysit or have Thalia at their place alone like before. \n\nif it's 'not a big deal' then why was it a big enough deal for grandma and grandpa to go behind your back to do it? If it's so unimportant, then why were they so upset about your not piercing your daughters ears that they decided to do it themselves? The only ones who made a 'big deal' out of anything is your parents by going against your explicitly stated wishes.\n\nhere's the thing, OP. it ***is*** a big deal - but because your opinion, in their eyes, is the 'wrong' one they are saying in a very roundabout way that your *feelings* on it aren't a big deal. That's why they went behind your back to do it. They knew it was wrong, they knew you said no, they just didn't care and decided to ask forgiveness rather than get permission. \n\nThe long and short of it is this: They're calling you assholes for daring to give them consequences for their actions. They will *continue* to call you assholes for this until you either give them full and unsupervised access to your daughter whenever they want again or until you make it clear as can be to them that they can't bully you into getting access to your daughter.\n\nYou need to put your foot down on this OP, they've already harassed you back into letting your parents have some interaction - they have, whether or not you intended them to, received the message that with enough bullying and harassing you will give in - even if just a little. You gave an inch, and they are now trying to take a mile - you and your wife need to shut this shit down hard yesterday unless you want to deal with this kind of stuff for another 18 years. Block numbers if you need to, but you need to send them a new message: one that says you will not be bullied into compliance with *their* wishes about **your** daughter and that attempts to do so result in loss of access to her.",
      "id": 159,
      "comments": [
        {
          "score": 18,
          "content": "This exactly. Perfect example of \"missing stair\".",
          "id": 160,
          "comments": [
            {
              "score": 4,
              "content": "I had never heard that term before, and it's my new favourite metaphor.\n\nThanks",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "It known as ‘foot in the door’ approach to manipulation",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Yeah, I quite agree. It would be one thing if everyone was mortified/shocked and promising big changes. There's a way back from that where they gradually gain trust and you feel safer over time. But when people are whiny, dismissive, and saying \"Eh, NBD\" they are very, very sketchy! They are more or less saying they might pull something similar or do it again! I include the grandparents' defenders and friends in this; I would honestly be saying to fiancee's parents that you're alarmed they are backing such a move and hope, for the sake of their own access, that you're misunderstanding that they are ok with treating your child like a toy. Actions speak louder than words here. \"Guess what, we care more about our daughter than your approval! And, hey...we tried supervised access and not only is that not good enough you're making us more worried about your behavior than ever. Everyone can chill in the dog house until they understand who Thalia's parents are, and that we will defend insults to her body with everything we have. We'll see you when your attitude has had a makeover because she doesn't need one.\"",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Yes. 100% right.\nNTA.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 107,
      "content": "NTA. Your baby, not theirs.",
      "id": 165,
      "comments": [],
      "relation": "Support"
    }
  ]
}