{
  "post content": "Normally, I’m the one who cooks because I enjoy it and I’m the better cook. When my partner gets home from work, the meal is usually ready or close to ready. She sets the table (it’s just us, no kids) and usually she will wash her lunch box and immediately pack her lunch for tmrw straight from the stove. This is done before we’ve even had a chance to sit down and eat the meal I’ve cooked. I don’t know why exactly but this behavior really annoys me. She says it’s because she’s tired after eating and doesn’t want to do it then, but I’ve pointed out that she can pack her lunch after she has washed the dinner plates and while I am putting the leftovers into Tupperware containers. This has also happened once or twice when we’ve had guests for dinner. To me, making her lunch plate before anyone else has a chance to eat the food feels like self-serving behavior. She’s literally serving herself first. Maybe it’s petty, but it bothers me and when I mentioned it to her, she got defensive and said that I was creating a fake problem. While it’s not a big issue, it is an action that makes me feel not good and she has the ability to change her behavior but refuses to. AITA and this is not a thing, or should she wait until after we eat to pack her lunch?\n\nEDIT: we had a chat about it agreed that when I cook, I will box her lunch as I plate our dinners, that way her lunch gets packed and put away and I don’t get annoyed at her for swooping in on my hard work. ",
  "id": 1,
  "comments": [
    {
      "score": 12496,
      "content": "YTA - Because you get upset without a reason.\n\nYour wife likes your lunch enough to be sure she'll like them without even tasting them first. That's a compliment of awesome proportions.\n\nTo make sure that everyone can eat their heart out, her lunch portion is already put aside so there's no fuss about that either.\n\nShe could pack a lunch at a **million** different times, but she chooses this one. And you can't even say what's bothering you about it.\n\n**BUT** There's something a bit alarming and I hope i'm wrong:\n\n> To me, making her lunch plate before anyone else has a chance to eat the food feels like self-serving behavior. She’s literally serving herself first.\n\nCombined with:\n\n> (it’s just us, no kids)\n\nAre you *that* insulted that she serves herself before you? (you're the *only* other)",
      "id": 2,
      "comments": [
        {
          "score": 5461,
          "content": "Did you miss the part that stated she does this even when they have guests over for dinner????",
          "id": 3,
          "comments": [
            {
              "score": 4876,
              "content": "Most people don't have guests about 90% of the time (yes, I made that up), and he says it happened once or twice when they had guests. Meaning most of his irritation stems from times when they were alone.",
              "id": 4,
              "comments": [
                {
                  "score": 1089,
                  "content": "Which is perfectly reasonable when you’re doing the cooking.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3292,
                      "content": "Who's doing the cooking aside, this kind of reads to me like OP is suffering from spousal annoyance - like when your spouse does something pretty inoffensive but it bothers you and bothers you, and the bother grows and grows until this little thing is a big thing and you just can't stand it anymore.  Usually the cure for that is a little validation and a maybe a little space to gain proportion, neither which will OP find here by the look of it",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1042,
                      "content": "Why though? What's the reason for being annoyed by it? Without a reason, it literally is unreasonable.\n\nNobody gets less food. She doesn't even eat before anyone else, she just sets aside some food for lunch right away.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 726,
                      "content": "So then why doesn't he just offer to pack her lunch for her while he's packing up the leftovers? That's really the easiest solution here, yet he'd rather be annoyed and complain on reddit about his wife packing her lunch before she's too tired to do it.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 544,
                      "content": "Why? It literally doesn't hurt anything. He obviously doesn't care that she's taking a portion for lunch, he's just pissed WHEN she takes that portion. That is a bizarre and petty thing to be irritated about",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 206,
                      "content": "Yep!  As the cook if I am making something for guests that I want to make sure I have left over…. I squirrel some away.  Usually I offer my guests any left overs… especially if they really enjoyed their dinner. It is a pleasure.  \n\nBut it’s also a great pleasure to not have to worry about having lunch the next day after all the effort it takes to host.   I think OP needs to figure out why it irritates him that their wife is just trying to make her life easier. OP!  No matter what your mom said.  Short cuts are okay!!!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 190,
                      "content": "Most people who do the cooking wait until *the other person* has started eating first. So, I'm not certain why OP feels it's self-serving for *the other person* to start eating first. Since in OP's mind packing tomorrow's food is the same as eating it right then.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I do all the cooking! My husband loves to eat the bacon while I’m cooking it. He does the same thing with cookie or sausage links and honestly I could give a rats ass! \nI am not getting bogged down in bullshit! I had to learn that you just can’t sweat the small shit! \nI really good question to ask yourself when you getting upset with your partner is…is this the hill you want to die on? Meaning just how important is this? Is it worth an argument and upset and in my humble opinion making your lunch before eating dinner is small shit!",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "How many stay at home wives/mothers feed themselves first? Absolutely zero that I've ever known or heard about.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "My partner does all the cooking, then fixes me a plate. Is this not normal? Or is it only normal when a woman cooks and then serves her man a plate?",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 812,
              "content": "Who cares? If I went to someone's house for dinner and their spouse came in and packed their lunch before their after-work exhaustion kicked in, I cannot imagine getting upset in the slightest that they were \"serving themselves first.\" She's not even eating it!",
              "id": 15,
              "comments": [
                {
                  "score": 229,
                  "content": "The only way I would care is if there wasn’t enough food. But it seems the OP plans for it so there is an extra portion just for leftovers.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I think this is the point. I can understand why it bother OP. It feels like if the meal is cooked for dinner the polite thing to do is make sure everyone gets to eat first before you put anything up for lunch the next day. But it is pretty minor. I think there are NAH, and to keep the peace OP should probably just deal with it as long as no one is missing out.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Even then, as a guest, I'm visiting you to see you not eat your food. If there's not enough food that's not my business, I've got food at home",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 119,
                  "content": "That’s it! Not eating it means it’s not serving herself first",
                  "id": 19,
                  "comments": [
                    {
                      "score": 5,
                      "content": "If I don't make my lunch before I plate my food (last) chances are I won't have lunch. (Usually supper either but that's not the same thing). Op says there are always leftovers, so what's the big deal?",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Even if she was serving herself first I don't see a problem. I'm the cook in my family and I always serve the other people before myself. It feels quite natural and I guess it's part of showing love through giving someone the meal. OP is ridiculous",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 450,
              "content": "If there's enough leftovers to put into tupper ware, even AFTER she makes her lunch, then there's clearly enough being made that it's a non issue.",
              "id": 22,
              "comments": [
                {
                  "score": 23,
                  "content": "Right which is why I'm confused why he's so upset. I guess he's probably feeling like ok I made this food for us to enjoy but her first reaction is to set herself aside some for tmrw then eat with me, maybe he feels like she's being greedy? Idk",
                  "id": 23,
                  "comments": [
                    {
                      "score": 21,
                      "content": "If I remember correctly he never once said that she took her lunch so there wasn't enough food for dinner. He's literally just mad to be mad. I want to know their jobs so badly lol.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 233,
              "content": "I'm guest when I visit my parents and they always prépare left overs to go before we eat. To be fair  the leftovers to go are for me, but they do this even if other people are invited. \n\nThat's not weird to me.",
              "id": 25,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 93,
              "content": "B/c they have guests means she doesn't need lunch for the next day?",
              "id": 26,
              "comments": [
                {
                  "score": 3,
                  "content": "Op says packing up the leftovers. Does he buy lunch every day? He never says he packs his own lunch at any time.",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "I'd think it even is more polite to do it when you have guests before the meal starts. That way you don't have to tell your guests they can't have a second serving because OP's partner takes some of it to eat at work.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "But OP stated she packs her lunch from the stove. Are their guests eating in the kitchen or a dining room? It's not like she's packing her lunch at the table.",
              "id": 29,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Who. The. Fuck. Cares. IT'S THEIR HOUSE! Just because they have guests they can't do normal things that make their life easier? Fuck that.",
              "id": 30,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "So? Nowhere did op say there was never enough food left.",
              "id": 31,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I'm not seeing what difference that makes. She's making sure that everyone can eat their fill AND have her lunch.",
              "id": 32,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1142,
          "content": "OP is doing the cooking.\n\nWhere I come from the chef decides when the food is served. There’s no digging through the pot in advance.\n\nNTA",
          "id": 33,
          "comments": [
            {
              "score": 784,
              "content": "Agreed. I think it’s rude when someone has cooked you a meal, and then expressed a preference to sit down together with it, to ignore their perfectly reasonable request and dig in separately for future meal. Lacks manners and is selfish. NTA.",
              "id": 34,
              "comments": [
                {
                  "score": 5,
                  "content": "But they do sit down together and eat!",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 195,
              "content": "OP [wrote](https://www.reddit.com/r/AmItheAsshole/s/h7NaX2kZk6)\n\n>There’s always enough food because I cook with her lunches in mind. I am always the one who serves the plates, usually bringing both plates to the table at the same time.\n\nSo why is it wrong for her to take the lunch part out and put it away? OP cooked with that in mind. Plus, OP always serves both of them. I don't get what the issue is when nothing is taken away from their dinner.",
              "id": 36,
              "comments": [
                {
                  "score": 8,
                  "content": "I don’t understand why she can’t do her lunch while he is serving, or even, why he can’t pack her lunch at the same time as serving the meal onto dishes.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "This is exactly how I feel. If I take the time to time my dishes to be ready at the same time as you, you sit down and eat when the food is ready. What you do after is up to you. Also what is he doing while she's packing? Just waiting. Cooking can be exhausting and draining and should be respected. Even if you don't wanna do the dishes afterwards, whatever. But being late for dinner when you know when dinner is supposed to be done is super rude Imo.\n\nNTA (from a husband who does 100% of the cooking)",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yeah, I just feel it's very poor etiquette. What if OP is a little more hungry than usual? What if she picks out the best bits? What if it ruins his presentation to have someone digging around in it first? Plus when I cook I hate anyone messing around with stuff before I've served dinner. It would drive me absolutely bonkers! I would rather pack her lunch for her myself after dinner than have her messing with it beforehand. Plus, it takes line two mins, how is she too freaking tired? he had enough energy to cook the whole darn meal for her.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 577,
          "content": "It doesn't matter if there's two people or twenty-two people, you don't go digging in and taking food from the meal before the person who prepared it says it's okay, that's just straight-up rude. And you certainly don't go taking extra helpings - FOR ANY REASON - before everyone has had firsts, regardless of if the meal was prepared with the intention of there being leftovers.\n\nIf you're the cook, and you portion out the leftovers before feeding people, that's your choice AS THE COOK. If you weren't the cook, keep your hands off it until the cook says otherwise.",
          "id": 40,
          "comments": [
            {
              "score": 288,
              "content": "> If you’re the cook, and you portion out the leftovers before feeding people, that’s your choice AS THE COOK\n\nI feel like this is the super easy solution that should make everyone happy here though. OP’s wife should not be picking through the food before anyone has even eaten. But since OP presumably likes his wife, as the cook it is so fucking easy for OP to just put a specific portion for her to the side in a tuperware, since he knows it makes her happy to do this before dinner.\n\nOverall a silly problem that could be easily solved with just the tiniest effort from either party to find a solution.",
              "id": 41,
              "comments": [
                {
                  "score": 271,
                  "content": "Really, by the same token, she could just say \"Ok, I'll respect your wishes of not messing with what you made for us before you're ready, but in return could you pack my lunch when you put away the leftovers?\" The food isn't in danger of vanishing before the leftovers get put away, why does her lunch have to be packed before dinner is eaten?",
                  "id": 42,
                  "comments": [
                    {
                      "score": 76,
                      "content": "Totally agree. There are a bunch of ways to compromise here where neither person even has to give anything up.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I'm personally ADHD.\n\nIf I stop a task midway through, it's often done. Like... gone. Out of my brain.\n\nIf cleaning and refilling while in work mode upsets the OP yet is the only way a task gets done - dude needs to suck it up or say, 'wash it, I'll refill later.'\n\nFor me, if I stop a task in the middle, I'm just stopping the task. I don't do well with leaving things in the middle.\n\nIf it was just a matter of OP packing it, I feel like this would have already been done.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "This is what my husband does! He is the cook in our house and he actually decided that he didn’t like the way left over food would rest while sitting in the pots and pans during dinner. So now he will plate our food and then pack up left overs quickly. Left overs are usually for me since I work outside of the home and he can make a fresh lunch if we don’t have enough left overs. I used to hate packing my lunch, so I really appreciate that he takes the time to do this.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 542,
          "content": "What frustrates me the most is that the solution is inside this line from the post:\n\n>I’ve pointed out that she can pack her lunch after she has washed the dinner plates and while I am putting the leftovers into Tupperware containers.\n\nIf this truly bothered OP, he could just offer to pack her lunch FOR her after dinner when he's putting the leftovers into tupperware. This way she feels helped with preparing her lunch, OP gets the timing right of how he wants, and everything gets done. \n\nBut OP wants her to do it when HE wants to. While she wants to do it right away because she probably \"still has momentum from the day before she winds down\".",
          "id": 46,
          "comments": [
            {
              "score": 116,
              "content": "Yeah this is the weird part for me, in me and my partners house we just pack up all the leftovers with a priority for the microwave lunch containers, and any leftovers in the fridge are fair game for packed lunch. The whole situation feels like they aren't seeing food as a team effort?",
              "id": 47,
              "comments": [
                {
                  "score": 10,
                  "content": "It feels more like they don’t see finding a solution as a team effort, which isn’t helped by him not knowing WHY it bothers him.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Or he could do it as he is dishing up, all at the same time. Sounds like it would be easier for all, just have the tub there next to the plates and pop some in along the line...",
              "id": 49,
              "comments": [
                {
                  "score": 10,
                  "content": "It's crazy enough to work!!!! Lol\n\nMy gf and I do thus all of the time. Make multiple meals worth of food, dish up everyone's portions, the rest goes in leftover containers, then we eat. Everything soaks while we eat, and then cleanup is just the major dishes and what we ate on. \n\nRequiring a partner to wait until after dinner to portion out leftovers is a weird hill to die on.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Exactly. I guess this is one of those, how you were raised, things. I cook for my husband and 4 kids- if I knew my partner or one of my kids wanted some for lunch, I’d cook accordingly (some extra). Whenever that side portion is/was dished out makes no difference.\n\nESH. You can’t explain why it bothers you OP and after discussing it with her, her rationale is that she’s tired after dinner to pack it. There are at least 3 compromises here and you both are sticking to your guns on what should be a non-issue.",
              "id": 51,
              "comments": [
                {
                  "score": 5,
                  "content": "This. Why is OP focused on getting the internet to back him up as right and not actually solving the problem with his partner?",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 532,
          "content": "Totally disagree. \n\nPortioning your lunch before dinner is served is totally rude. Lunch is dinner leftovers….dinner is not lunch leftovers.\n\nOP, I’d honestly just offer to pack for her.\n\nIf you’re already putting left overs in Tupperware after dinner, why not just put a portion of leftovers in her lunch ware?",
          "id": 53,
          "comments": [
            {
              "score": 85,
              "content": "This is a good solution depending on if he understands her portion preference.\n\nI was starting to feel slightly insane with all the people saying, \"What's the big deal??\" because this would irk me sooo bad.\n\nAs someone who grew up with food insecurity, it still has a ripple effect as an adult. I do our family's grocery shopping and it causes literal anxiety if we run low on something, I'm not a \"meal sharer\" out at a restaurant, etc. I would be incredibly bothered by someone portioning their lunch out before I've had a chance to eat my current meal.",
              "id": 54,
              "comments": [
                {
                  "score": 11,
                  "content": "As someone who also grew up with food insecurity, I feel exactly the opposite. If the expectation and the agreement is that my lunch for the next day is leftovers from a meal, then I would be stressed about someone potentially eating that if it wasn’t divvied out from the start. People often go “oh that was so good I think I’ll have a bit more, I’ll have to unbuckle my belt haha” and I’m internally screaming *Noooooo that was supposed to be my lunches for the week*.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "“Lunch is dinner leftovers” who said that ??? \n\nOP clearly says he cooks enough for her to have lunch as well, leftovers aren’t planned beforehand.",
              "id": 56,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 311,
          "content": "All the people calling OP an asshole over this are wild.\n\nIf my girlfriend knit me a sweater, you don't think it would be rude to say \"cool, I'll try it on in winter\" instead of taking a moment to try it on and show appreciation for their effort?\n\nTo take a bit of time to appreciate when your partner wants to share their effort with you seems like the default decent thing to do. Often I want to go hop in the shower first thing when I get home. If my girlfriend wants to show me a puzzle she completed first I'm gonna go check it out and talk with her for a bit, then hop in the shower. That just seems like what you should do to show you care and appreciate the little things that are important to them. If she cooked a meal, same thing, though I do 90% of the cooking and she has the courtesy to make eating together her priority when it's done.\n\nIt's a small issue,  don't think anyone is terribly in the wrong here. The preponderance of people calling this assholish is astounding to me.",
          "id": 57,
          "comments": [
            {
              "score": 79,
              "content": "\nOn the other hand? \n\nIf I knit my partner a sweater in august, and I know that they can’t deal with heat I wouldn’t expect them to put it on, until it got cooler. My need for praise or gratification can wait, and if I need them to try it on, in order to see that it fits? Guess that sweater will have to wait, and it’s on me for starting a project in the summer, that I knew wouldn’t be finished and wearable until winter.\n\nIf I’d made a puzzle and wanted my partner to see it, but I knew that they have a short amount of energy left, after getting home from work, I’d definitely let them shower first. My puzzle and small talk can wait 20-30 minutes, if that means that my partners home routine is a bit more manageable.\n\nIf I have made dinner, I wouldn’t at all mind my partner packing next days’ lunch before we eat, if I know that that is when they have the energy and wherewithal to do it. I might even offer to do it for them, since I’m already in the kitchen.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "If your girlfriend gifted you two shirts, one to wear to dinner tonight and one to wear for work tomorrow, would it be rude to put the work one away where you put clothes you'll wear the next day before putting on your new shirt for the dinner soon? If yes, would it be rude if you know you'll forget or be too tired later? \n\nI just can't see the rudeness or lack of appreciation. It sounds like she's just being practical and he wants his social rules followed. Neither is wrong, but it's incompatible.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Yeah the amount of people saying op is the asshole is infuriating to me. A lot of people in here didn’t learn the most basic of table manners apparently…",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Thank you for being a kind, thoughtful person.  \nWhen my ex cooked dinner I would always say thank you when served and after eating.  He complained and said \"you don't have to say it EVERY time\".  My response was always the same, \"I know I don't have to, I want to because I appreciate it\".\nCommon courtesy does still exist in some of us.  Thank you for proving that I'm not the only one who still uses it.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "This. It's not basically an issue but a built-up of annoyance. And I think if anything, the wife should show a little bit of appreciation and decency to the effort he has made. Just a little amount of patience. He's only asking to not dig in before dinner. That's all.\nI'd be annoyed too tbh. It irks me when people want to dig in n try what I am cooking before it's ready. Bugs me big time. Like, it would be served in a few, can't you just wait?",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 239,
          "content": "She serves HERSELF before guests?  You don't see a problem with that?  She takes the food before it's been served, what if her partner only made enough for 2, does she go with out because her partner is greedy?\n\nTo remove food before it is served to your guests, is beyond greedy and disrespectful",
          "id": 63,
          "comments": [
            {
              "score": 16,
              "content": ">To remove food before it is served to your guests, is beyond greedy and disrespectful\n\nOnly if there isn't enough to go around.  If food is in short supply, then yes, everybody should eat first, then any leftovers are fair game.  But if there is enough to go around, I don't see any issue with portioning some aside for later.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "This is my thought, too. I wonder if OP grew up with food insecurity. While the wife is taking out food for her lunch next day before dinner is even eaten, it’s could mean there is fear there will not be enough food for dinner if he wants seconds, or even enough food for himself for lunch. And, if guests are over, it’s rude to not have enough if they are hungry and want seconds. In my opinion, unless he is specifically cooking extra at each meal for lunches, then lunch distribution should wait until after the meal is served. But, there is clearly something more going on than even the OP is able to put into words.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Most of the commenters are not even adults who cook their own food let alone anyone elses. It is common decency to wait until after dinner to pack a meal for lunch. It's plain rude and entitled otherwise.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "If I'm a dinner guest on a week night I'd expect to see work/lunch prep happening. I'd assume it's normal to pack lunch like that (cause it is in my house) and it wouldn't bother me. But also I rarely have or am a dinner guest on a week night.",
              "id": 67,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 223,
          "content": "Are you kidding me? What she's doing is rude as fuck. I don't know how you were raised but it would never cross my mind to do this. It's so off-putting and disrespectful of OP's efforts. Yuck.",
          "id": 68,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 153,
          "content": "OP has reasons.\n\nOP wants to eat together (bonding).\nOP created something, a meal, and has intentions in the way to serve and enjoy it.\n\nThe wife's behaviour is extremely rude to me considering that she was not present at all for the meal prep.\n\nIf she is really so exhausted after work, OP can take over apportioning her lunch. That way OP can do it before or after dinner, as it suits the meal. Sometimes the presentation and the feel of the meal will be affected by taking away part of it beforehand. It seems like the feel is always affected for OP.\n\nAs OP is the one who created the meal, the least we can do is give them respect in how they intended to serve it.\n\nOP will feel recognized if they sit down together without disturbing the meal beforehand. I'm sure they can figure out a way to accomplish it.",
          "id": 69,
          "comments": [
            {
              "score": 70,
              "content": "Your first reason is completely irrelevant since she is eating with him?",
              "id": 70,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 140,
          "content": "He is allowed to feel as he feels. And I think it is rude to start eating before everyone sits at the table and that is is rude to pack for the next day before having a meal.",
          "id": 71,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5404,
      "content": "NAH\n\nI'm going with this because I think it's a problem with two different perspectives. When I cook with leftovers/second meals intentionally included in the meal, I put the food intended for those second meals away before I serve dinner. It prevents issues with people's eyes being bigger than their stomachs and possible waste. It also gets that food cooling immediately so it remains in the best conditions for future use.\n\nBut since she's not the cook, I could see why she would consider it smart but you would consider it insulting. Neither of you is necessarily wrong.",
      "id": 72,
      "comments": [
        {
          "score": 1469,
          "content": "Yeah I can pretty easily see both sides. Im guessing for her, it weighs on her mind knowing she has to pack lunch, and she can't fully relax until it's done. As the main cook in our home, I can understand how this would possibly be mildly annoying, but at the same time, I can't imagine being bothered enough to make an issue. If it did bother me that much, I'd pry just offer to take over packing lunches and then we would both get our way. Of course OP is in no way obligated to do this, I just don't see that this is worth making a big deal over.",
          "id": 73,
          "comments": [
            {
              "score": 791,
              "content": "If I stop a task midway through, it's done for the day. I'm so ADHD. I never stop a task midway through if it's important I finish it. I have to work all the way through.\n\nI so, so, so hated teachers that wanted me to work on essays a paragraph at a time. Turn in my intro for feedback before finishing the whole thing. No, I finish one whole task.\n\nIf I cleaned my lunch box and didn't refill, it's done. Out of sight, out of mind.\n\nMomentum isn't just mental energy but train of thought. If things disrupt me, I have the worst time refocusing. It's rough.",
              "id": 74,
              "comments": [
                {
                  "score": 207,
                  "content": "Yes! Cooking is part of daily work. I have to start cooking as soon as I get home from work, otherwise we're ordering takeout or having a frozen pizza for the night. There is no \"cooking late\" because once \"work\" is over, I cannot get my brain in line enough to do anything but chaos cook because even following a recipe can be too much.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 77,
                      "content": "I feel so seen by this. If I sit down when I get home from work, I'm not getting back up to cook. It took a while for my husband to understand that because he needs time to \"decompress\" when he gets home.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I feel seen. Once the shoes are off I’m done. Drives my husband batty that I leave them on so long, but I literally won’t do anything once they come off. My day is done.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 132,
                  "content": "YEP. When motivation is a scarce resource, you don't waste it by finishing tasks halfway through. I either deliberately micro-task for long-term things like house cleaning, to keep tasks from feeling overwhelming... or I'll start one big thing, and then it HAS to be finished, because if it's abandoned halfway through, it doesn't get returned to until the next day.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 7,
                      "content": "... or the weekend.\n\nLots of abandoned things are caught up with on the weekend. Or following weekend.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "If I don’t pack my lunch at night when I empty it, it won’t get packed. Then I’m pissed at myself in the morning, but still won’t pack it because I’m running behind and end up buying something for lunch instead. Once I start something I can’t stop, and god forbid I sit down.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I was going to say as someone with ADHD, I need to start doing what she’s doing!\n\nI was reading the post and going “oooooh, lifehack alert.”\n\nBut yeah if she legitimately *struggles* to do it after I’d advise OP to just try and have some empathy. For some of us out there remembering and getting the mental energy to do some thorn like that after dinner is actually very difficult!",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "This was my first thought too! Trying to do this in multiple steps would lead to me being in bed trying to sleep and then realizing I never finished packing my lunch. Especially because after dinner, I don’t think about work anymore - if I don’t have enough gas to drive to work in the morning, I have to fill up before I get home for the night. I won’t remember to go out after dinner and certainly won’t remember to leave enough time in the morning.  I guess you could say I don’t think about putting gas in the car when I’m not in the car, and I wouldn’t think of making a lunch if I’ve already emptied my lunchbox earlier.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Totally off topic but the essay issue is real! I hated doing drafts and resented having them as a part of the assessment process.",
                  "id": 83,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I got to college and my professors just wanted an outline of each paragraph and the topic of my intro/ conclusion, which was fine!\n\nWhy did none of my earlier teachers just ask for that?!?! I sincerely doubt every single one of them graduated from college after the invention of the Roman numeral outline.\n\nI have no idea why my teachers all insisted the five paragraph essay, submitted in three or more phrases was essential to college. I never was asked to write a five paragraph essay and half my professors wanted short paragraph responses.\n\nI could submit my outline, get their notes, put research on one screen, Word on the other and crank out five pages in a single sitting. Review on another day, make some tweaks.\n\nIt worked so. Much. Better.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Two leap-frogging lunch boxes. OP fills the clean one while he cooks. Spouse washes the dirty one after dinner.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "u/DefinitelyNotAliens: I teach public speaking in a state university, and I'm also ADHD (thank heaven for Vyvanse).  FWIW, I have my students turn in topics, get feedback, then turn in outlines, get feedback, then finalize and present their speeches.  But that feedback part is important!  Sometimes the topics aren't a great fit for the assignment, or the outline doesn't meet all the requirements.  It feels like extra steps, but it saves redoing more work in the long run.  It might be the same with your teachers requiring intro paragraphs.  (Although that would drive me nuts for a different reason--I write the body, then the conclusion, then the introduction last).  Unfortunately, stepped assignments are good practice for a lot of white-collar work.\n\nBut I agree with you and other posters: let her do the lunch prep task before she sits down to dinner, or either lunch won't get packed or she'll be anxious about it throughout dinner.",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Yeah. I think of it like inertia. If I'm flowing I can keep it up. Starting again from stopped SUCKS \n\nIt's honestly not even always out of mind. The lunchbox would be. But I'd be thinking about that essay almost all the time and ruining my recreational time. The result being neither working hard *nor* playing hard.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Exactly this! As soon as I read what she was doing, I thought it sounded like an ADHD adaptation. She's taken an out of sight, out of mind task and tied it to an existing routine. That's what I have to do to remember stuff like that, and it works really well!",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "This absolutely. She wants to unwind and relax with OP over the nice dinner they made for her. Packing her lunch first means she won’t have to do that job, or think about work, after dinner. OP doesn’t actually say why it bothers them; it would be interesting to know. In any case they should sit down together, share their feelings about it, try to understand each other, and find a solution that works for both of them based on their priorities.\n\nEdit: changed pronouns to correct assumption about gender of OP",
              "id": 89,
              "comments": [
                {
                  "score": 4,
                  "content": "I think this posting is one of the reasons I love AITA so much. It’s a chance to get perspective from a neutral audience, and in this case, because it’s a “small issue”will be much more helpful than if the OP asked family or friends. \nNTA. \nShe’s NTA either. \nMaybe try to focus on all the savings from the lunches getting packed, and not being bought out somewhere every day. \nWishing you the best.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I was gonna say, OP says that he puts the food away while his wife does the after dinner dishes. If he’s so desperate to control the timeline, why not offer to pack her lunch while he’s already putting the food into containers?",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 915,
          "content": "I’m floating between E S H and N A H. There are some meals that I think it’s super petty to care about this. If you have a plentiful pot of spaghetti and meatballs, why shouldn’t she pack lunch first? And I totally get what she means about being too tired later: once I’m done cooking and eating, I have a really hard time making myself do chores.\n\nOn the other hand, if I’ve made a beautiful pot pie and you cut into it before it has even made it to the table, I’m going to be annoyed. I want to enjoy that pretty pie as we sit down together, and then cut into it as we sit there ready to eat together. Taking your lunch out beforehand feels like someone cutting the cake before the birthday candles have been blown out. And, sometimes there are meals where you aren’t sure you will have leftovers, especially if you try a new recipe. Let’s get dinner eaten and then see what’s left for lunch. \n\nI think maybe in this instance, as so often happens in marriage, they need to compromise. He stops caring when she packs her lunch first most nights. She waits to pack her lunch when they have guests or particularly pretty meals. They both have valid perspectives, but they’re a-holes for refusing to be at all flexible with those perspectives.",
          "id": 92,
          "comments": [
            {
              "score": 180,
              "content": "Literally the only sane reply I’ve read so far.",
              "id": 93,
              "comments": [
                {
                  "score": 17,
                  "content": "Me too, other thing is what if she doesn’t enjoy the meal or there’s only enough left overs for 1 person and it’s your favourite meal or something. Should be a discussion. Sounds like they both need to listen to each other and hit a middle ground. Sounds like maybe she needs to help with the cooking? make it a cute date night where you show her how to make something she likes eating. Idk. I see both sides, it can be annoying when you don’t feel heard. Maybe OP can’t express themselves effectively to their partner in the issue so they don’t get it (and we don’t get how they’re feeling  or why) so",
                  "id": 94,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Yeah sounds like this is annoying him indirectly (seems to reflect something else that he is feeling) - unappreciated? Not respected? He needs to work that out so he can communicate better and resolve the actual issue",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Yes. This is it. I made a similar reply but you phrase it much better. Cutting out a pie for lunch then serving the remainder for dinner feels like we're having leftovers for dinner.\n\nImagine having a nice Thanksgiving Turkey but she cuts up her portion first then serves the mangled Turkey for everyone else. Sure it's fine, it's not technically leftovers but it sure feels insulting.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yeah I think these are my thoughts too. If I’m making something I do like to be the one to serve it to people, cause that just feels like the whole experience of making something y’know. So I understand his frustration but I also understand her perspective",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I think OP doesn’t feel appreciated for the effort he puts into cooking. He probably wants to sit down with his partner, watch her enjoy the food, perhaps comment on it, and this pleasure is being slightly ‘ruined’ by his partner jumping the gun and cutting into the food, reserving herself some for lunch. \n\nIt’s a silly squabble, but as someone who also cooks a lot, I can see why OP could be slightly irritated.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "i agree 100% nothing else to add but my vote NAH",
              "id": 99,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Yeah, totally agree with flexibility and compromise. If she comes in and checks the pots and oohs and aahs (without sampling/packing) it's like a pre-appreciation of the meal. Isn't it usually the case where the cook has to shoo people away that float in on the wafted fragrance of something delicious being prepared? \"Hey, I'm not done making that-- wait until supper is ready!\"",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "This is the one.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I think this is a really good answer! But I also think that wife should make some effort to accommodate OP since it clearly bothers him.  The wrong answer is to act as if his feelings are unjustified and don't matter. Such an attitude deteriorates their relationship.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 144,
          "content": "My husband and I do this too when we want leftovers for lunch the next day. Cook a bigger meal and as we’re plating out food, we put the to-go containers next to the dinner plates and portion everything out evenly. Problem solved!",
          "id": 103,
          "comments": [
            {
              "score": 26,
              "content": "The difference between you and OP seems to be that you and your SO communicate **and** listen.  It seems as though you work as a team.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "I often cook more than we need, in part for leftovers and part to provide portions for elderly neighbors. My wife is fine with me portioning out servings for others before we eat, because then it’s done and we know our friends will have 2 days worth of meals ready to go. \n\nBUT, she usually wants me to wait to portion out dessert servings (to give away) until we’ve had our servings first.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "There’s something nice about have the presentation of your food being felt and appreciated. Just time to take in the blessing of having good food on the table. Being present. I could see why this would be irksome. But perhaps packing her lunch does allow her to be present as she doesn’t have thoughts about how she still has to pack her lunch for the next day niggling in the back of her head. I know this gets said a lot, but more communication would help. I don’t think either of them are wrong per say. Maybe on weekdays she can pack her lunch before eating dinner but on weekends she can do the opposite so that weekend dinners feel special.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I agree with this take. NAH just two different thought processes. If the issue is there not being enough for leftovers, that’s a different conversation. But I totally get wanting to get the chore over with quickly and have one less thing to think about.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3316,
      "content": "INFO:\n\nWho exactly is supposed to be served first? There are only two of you, correct? Are you capable of serving yourself first? Or are you upset she isn't serving you?\n\nMore INFO: How frequently is there insufficient food for your dinner due to her practice of taking lunch first?",
      "id": 108,
      "comments": [
        {
          "score": 2807,
          "content": "OP isn’t saying he wants to be served first.\n\nHe wants them to sit down and dig in together.\n\nDon’t know why this sub seems determined to hate him 🙄",
          "id": 109,
          "comments": [
            {
              "score": 1545,
              "content": "Shes not eating without him",
              "id": 110,
              "comments": [
                {
                  "score": 1168,
                  "content": "But she’s digging in/cutting/fucking with it.\n\nAs someone who frequently cooked for the family, as a teen, only to have various people mess with it before I was ready to serve it…I totally get where OP is coming from.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 942,
                      "content": "The fact that she does it when there are guests, when food is usually served with some amount of presentation, is mind boggling. \n\nFood entitlement is also wild. I've cooked for and with big groups before and the number of people willing to just grab stuff from the pan while you're still cooking is ridiculous.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 349,
                      "content": "“She’s fucking with it” omg stop that’s so dramatic.  She’s serving herself food drama queen",
                      "id": 113,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 329,
                      "content": "It’s crazy the food etiquette some have. This would be pretty disrespectful to me. Pack up the leftovers, eat the meal first. It’s more than just a meal",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 300,
                      "content": "She’s taking a portion and setting it aside. She isn’t licking it or rubbing it on herself. She’s not messing with it any more than when she makes a plate for herself.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Dude I was basically the exclusive kitchen staff for a family of 5 from the time I was 10 because my mom can't use an oven thermometer for the life of her, and it was either I cook or we all starve on mom's cooking. I truly don't get it. \n\nIf food is plentiful, getting mad when it's eaten is all ego and control. The point of cooking is to feed people, getting mad people are getting fed when there's enough to go around is silly sauce.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": ">But she’s digging in/cutting/fucking with it.\n\nYou mean....she's serving herself the food he cooked at a time when they are getting ready to serve the food he cooked?\n\nIt's very literally like picking up 3 plates at once instead of just 2...",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "As a person who cooks for the family often I genuinely don't understand why it bothers you, i cook enough for everyone and possible seconds for those who do get it aswell a lunch for my stepdad, if people wanna burn their mouths on the food before its ready to heat served thats on them. I pack my stepdads lunch before i server anyone because it is simply easier than the anxiety of not having made enough and someone (probably me) eating that portion which leaves him out of food for work. And then there are times when i cook and someone else serves the food (and packs the lunch) which makes my life easier as i don't have to guess serving sizes and in all honesty id prefer everyone just serve themselves when i cook so that they don't feel like too much or too little was put on their plate",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I wonder if this is a cultural thing. That or the majority commenting and calling him an AH are definitely not the primary cooks in their homes.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 494,
              "content": "No one hates him but this is a true non-problem lol",
              "id": 120,
              "comments": [
                {
                  "score": 343,
                  "content": "Threads like this are exhausting to me. I can't fathom having the extra capacity to be upset about something like this.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 197,
                      "content": "I’m exhausted just reading this. But since I’m the one who cooks and also packs food for my own damned lunch before I sit down to the table, I am clearly an unwashed heathen and a pariah of society.",
                      "id": 122,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 383,
              "content": "Some people look at the tasks she's doing as a momentum issue. She comes home, she has momentum from the day of work, so she cleans her dishes and portions out her lunch for the next day, and then completes her \"winding down from work\". \n\nFor her to wind down from work and sit down for dinner, and then have to wind back up to portion out her lunch for the next day, may be too much effort for her after dinner. So she does it when she has momentum.\n\nI also notice how OP has \"offered\" for her to do it after dinner, but he hasn't offered to portion out her lunch FOR HER to help her out. He's already putting the leftovers into tupper ware, why not just make her lunch for her???",
              "id": 123,
              "comments": [
                {
                  "score": 51,
                  "content": "This makes a lot of sense, I know I personally get a lot of my chores done when I get home from work & am still in my uniform. But the motivation leaves as soon as I’ve changed into comfy clothes",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "For me, the momentum thing is a real consideration. I am typically super low on spoons at the end of a workday, and if I don’t get to something quickly it’s just not going to happen.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "He has 'offered' for her to do it AFTER SHE DOES THE DISHES... not after the meal.. not him doing it for her.. I'm surprised how many haven't mentioned this. Overall it seems controlling and maybe even ocd.. but we don't have all the info either.  Like is bro only cooking lasagnas and sheperds pies and other meals that cutting into mess with the presentation?  If so I can understand how her behaviour would be upsetting.",
                  "id": 126,
                  "comments": [
                    {
                      "score": 14,
                      "content": ">He has 'offered' for her to do it AFTER SHE DOES THE DISHES...\n\nAnd while THEY PUT THE REST OF THE FOOD AWAY\n\nThey are not just resting and watching tv while she's doing the dishes, they're both doing chores at the same time",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 122,
              "content": "They're still eating together.",
              "id": 128,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 121,
              "content": "All the partner is doing is taking food for tomorrow. They still sit down and actually eat together. It's not like she's grabbing food and going to eat without them.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "It is hilarious.  \n\nIf this was the wife telling the exact story all the replies would be about getting a divorce lawyer because he is cheating on you.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Me neither.  I kind of get it.  He's put all the effort in to make dinner, but she can't just sit down and enjoy it with him?  She has to wash out her lunch box first and fill it up with as much as she wants before they eat together?  \n\nI get that it's mildly infuriating rather than high level stuff.  But I don't think he's crazy.  If I had to guess, this isn't the only thing she does that, to him, feels like she is wasting his time/being rude to him.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 126,
          "content": "This is the real question. If there are actual consequences to her behavior, then he has a right to be pissed. If it's never happened, then he is TA for getting upset over literally nothing.",
          "id": 132,
          "comments": [
            {
              "score": 71,
              "content": "Oh my goodness. I think the same. If everyone has enough to eat does it matter when a lunch is packed?  Why make an issue out of something that isn’t an issue? Some people just NEED to have something to complain about, no matter how petty or ridiculous.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2829,
      "content": "Why don’t your start packing her lunch for her after dinner? If she is tired this is a way to show her support and love.",
      "id": 134,
      "comments": [
        {
          "score": 1304,
          "content": "Or get 2 lunch boxes so you can have one full and ready to go by the time she gets home so you can eat immediately, then wash the other lunch box with the dinner dishes.",
          "id": 135,
          "comments": [
            {
              "score": 433,
              "content": "i like this idea it’s like a compromise and it’s simplifies cleanup by syncing with dinner washing so essentially everything is a 2in1",
              "id": 136,
              "comments": [
                {
                  "score": 179,
                  "content": "It's barely a compromise. Next day's lunch is set up before she sits down to eat, as she wants, and she focuses on the meal straight away, as he wants.",
                  "id": 137,
                  "comments": [
                    {
                      "score": 130,
                      "content": "It is a solution",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "A collaboration!",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "A Peace de la Résistance",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 166,
              "content": "This exactly! I can't imagine why packing up a lunch before eating is such a big deal, but if he's the one with the issue he can help solve it.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 62,
              "content": "100% the winning answer. Anticipate each others needs.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 123,
          "content": "That was just my thought. If he’s already handling putting food away in Tupperware containers, why not offer to pack her lunch?",
          "id": 143,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1725,
      "content": "YTA -- from your other comments, there is enough food to go around. You say that she's \"serving herself\" but it's usually just the two of you. Is there a concrete reason this upsets you, aside from her not following your preferences?\n\nIf the meal was prepped with the intention of saving some for leftovers, packaging it before serving is the much better way of doing it. It's easier to cut/portion neatly, you don't take too much OR not leave enough because you know exactly how much food there is, and it starts cooling much more quickly for safe refrigeration.\n\nYou need to examine why you're assigning so much intent to a seemingly innocuous disagreement; if it's just an \"agree to disagree\" petty annoyance you need to drop it.\n\nETA: Apparently a lot of people think people who pre-portion immediately stick it in the fridge while it's still piping hot, so here's how I do it:\n\n1 - Portion into Pyrex or other microwave safe container.\n\n2 - Leave on counter while eating with lid loosely set on top, so bugs/debris can't get in but steam can escape. *This will cool faster than if you leave the intended portion in the cooking/serving dishes while eating.*\n\n3 - When done eating, it will have cooled enough to be safely stored. Wipe any excess moisture off the lid, then seal and place in fridge. Proceed with cleaning the kitchen.\n\nThis balances the need for the food to properly cool so it doesn't get mushy or raise the temperature of the fridge, while minimizing the time the food is left in the \"danger zone.\"\n\nI do all the cooking in our house, and we cook our week night meals for leftovers because separate lunch fixings...in this economy? No way. Most dishes need to \"rest\" for a few minutes after cooking anyway, that's plenty of time to prep your containers so it's only an additional 30 seconds of time when you're already plating.",
      "id": 144,
      "comments": [
        {
          "score": 371,
          "content": "Not to mention it’s best for food to get put away quickly if not eaten and not kept around to linger for a few hours.",
          "id": 145,
          "comments": [
            {
              "score": 292,
              "content": "A few hours? Who takes a few hours to eat dinner?",
              "id": 146,
              "comments": [
                {
                  "score": 346,
                  "content": "One or two hours isn’t unreasonable to sit& enjoy a meal, relax a bit, wash dishes and portion and put away the leftovers",
                  "id": 147,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 128,
                  "content": "Seeing as he wants her to do the dishes first.. who knows what else he wants to tack on before she's allowed to make her lunch for the next day.",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 70,
              "content": "Not if it’s hot. It’ll sweat if it is immediately put in a container in the fridge",
              "id": 149,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "Agreed that it shouldn’t sit around too long, but it also shouldn’t be packed up and sealed in Tupperware when it’s piping hot from the oven.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "You take a few hours to eat dinner?",
              "id": 151,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 132,
          "content": "If I cook at my parent’s house and want ANYTHING to come back home with me, I have to take my portion out before everyone starts to eat. No one eats leftovers except my Dad, so he’ll Hoover down whatever’s left on the stove 😂",
          "id": 152,
          "comments": [
            {
              "score": 10,
              "content": "Maybe it is a learned behavior?",
              "id": 153,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 84,
          "content": "I find it rude to pack a meal before eating. But, we clean and put food away immediately after dinner while doing dishes. I’ve taken my lunch majority of the time for 11 years. I don’t think it is argument worthy though.",
          "id": 154,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 27,
          "content": "> Is there a concrete reason this upsets you, aside from her not following your preferences?\n\n\nThis reminds me of so many bosses who would tell me to do things in a specific order for no reason other than that's how they did it.",
          "id": 155,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Yeah if she’s serving herself that changes things slightly. This scenario would only irk me slightly because I like to serve everyone when I cook cuz I’m anal about presentation and what food goes on the plate. That being said, it’s pretty basic table manners to respect the wishes of the person who actually did the cooking. At the end of the day though this shouldn’t be an issue causing a rift with your SO…",
          "id": 156,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1179,
      "content": "She’s serving herself and packaging her “leftovers” for lunch before either of you have actually eaten the meal you worked to prepare. It’s even tackier if she does it when you have guests over limiting the quantity that is actually served to your guests. \n\nBut also - I wonder if there’s also a connection component to your conflict here. She’s viewing it as being practical. I get that. I wonder if this also feels hurtful for you because maybe you feel like she’s prioritizing getting her next day’s lunch ready over sitting down and connecting with you over the dinner you made for her first. I know for me personally, this would make me feel upset and like a personal chef.\n\nEven if y'all disagree here, you told her it was hurtful and she’s being dismissive of your feelings. That’s AH behavior in and of itself. \n\nNTA.",
      "id": 157,
      "comments": [
        {
          "score": 631,
          "content": "Thank you! Everyone calling this a non-issue or a non-problem. It's a problem to him and she is dismissing his feelings. So me leaving my socks on the side of the bed instead of the hamper bothers you? Who cares, it's my side of the bed. How much effort would it take to put them in the hamper? Tiny. How much effort for her to make her lunch after dinner? Tiny. She is being whiny and dismissive.",
          "id": 158,
          "comments": [
            {
              "score": 277,
              "content": "Totally agree. As the person who cooks the majority of the time, can’t they pack up leftovers together instead of someone taking their share first?\n\nI’m not sure if there’s a different dynamic going on outside of just dinner and lunches, but maybe OP just wants to feel appreciated for his efforts in providing home cooked meals. I don’t think waiting till after dinner to pack your lunch is a big ask, especially if you didn’t even cook it.\n\nThe annoyances build and resentment follows. OP is her partner, not her mother. And if OP was her mother, if my mom said “pack your lunch after we all eat” - no argument there, so why can’t OP’s partner compromise?\n\nNTA",
              "id": 159,
              "comments": [
                {
                  "score": 29,
                  "content": "Also from a food safety perspective it’s better to have to food a little cooler before you pack it up so that it cools to the proper temperature in the fridge so that you don’t give yourself food poisoning tomorrow. Personally having my partner packing her lunch from the food we have for dinner before we have even eaten it would drive me crazy. It seems very selfish.",
                  "id": 160,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yeah, I thought this too -  it’s so wrong to take hot food directly from the stove and package it up for the next day.",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": " I can't believe I had to scroll this far to find one NTA. I'm actually genuinely shocked by the lack of reading comprehension in this comment section.\n\n>As the person who cooks the majority of the time, can’t they pack up leftovers together instead of someone taking their share first?\n\nIt's this. It's just plain selfish \"self-serving\" behavior. \n\nHundreds of commenters twisted those words around like OP was some secret misogynist lying about the real reason he was upset... I literally cringed at how smug & clever they thought they were.\n\nshe didn't even cook! OP did! *the cook serves the food* that's how this works ya dummies! & before he has even had a chance to serve them the dinner that he cooked, she cuts him off to serve herself. It's fucking rude!",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 193,
              "content": "Yh it’s only cause it’s a woman doing this, I’m speaking as a girl, there’s a huge bias like her actions are offending her partner and he’s putting in effort to cook yet is feeling insulted over something very in her power to change. As a thank you at least for cooking, surely she could just pack it another time if she knows how he feels, it’s just being considerate to people you love",
              "id": 163,
              "comments": [
                {
                  "score": 207,
                  "content": "100%!!! One of the top comments is like: are you upset she's not serving you? Or are you incapable of serving yourself?\n\nJfc...I doubt that comment would be made if it was a woman\n\nThis sub should remove gender from posts for a while & only reveal after the votes been cast",
                  "id": 164,
                  "comments": [
                    {
                      "score": 72,
                      "content": "Yep. I have noticed this sub Reddit seems to hate men. If the genders were reversed it would be a different story. His wife doing this is so tacky and clueless. It is obviously an issue if it bothers him and it would bother me as well.",
                      "id": 165,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "Agreed, It's sad how this sub infantilize women. Somehow they always have to be protected. You will also find many people will dismiss his feelings and will as you pointed out, will turn it on him. Woman fragile, man bad...",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "We both cook and my first thought was “My wife would hate if she cooked a nice dinner and I did that before sitting down with her to eat.”\n\nMy second thought was “When I cook, it’s frustrating when others can’t stop what they’re doing to come eat when the meal is ready.”\n\nIf you changed OP to the wife, I suspect a lot of the YTA people would cut OP some slack and allow for the possibility that the other partner could do things differently.  Yes, these are small things, but relationships are about a million small things.  You won’t always agree, but you need to be willing to listen and adjust behaviors when your partner communicates a concern.\n\nNTA",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Fr finally.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Welcome to reddit where people like to give arguments based on their expectations. And also double standards. Ive seen that a lot sadly",
              "id": 169,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 186,
          "content": "I completely agree. If I have cooked a meal for my husband I'd like to enjoy it and have the option of seconds if I'm still hungry. I also frequently want to put half away in the freezer for another dinner so I don't have to cook another evening that week. I would find it very presumptuous and entitled if my husband secured his lunch portion without checking in with me or even allowing us to eat it together first. Also why isn't she putting a portion away for OP? So OP cooks for two but she sorts out lunch just for herself. Yeah I wouldn't be ok with that at all. It's just so rude I don't understand why everyone here is so defensive about her behaviour.",
          "id": 170,
          "comments": [
            {
              "score": 30,
              "content": "The way I see it it's not that big of an issue, but just the fact that it bothers OP should be enough for her to stop. The one putting in the effort to cook should have say over what happens to the food. It's not a big issue, but it's also not a big deal to just wait to pack lunch. Putting your foot down about something like this with the person literally making your dinner seems pretty entitled.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "omg you're the only person to bring this up - I thought I was going crazy! I would be SO UPSET if I took the effort to make dinner every night and sometimes didn't have the chance to eat the leftovers bc my husband took them first without having some kind of conversation. it sounds like OP's wife needs to take some time to be in the moment and appreciate the meal in front of her instead of treating it like a mundane part of her routine. it's obvious this bothers the OP bc cooking is an expression of his love.\n\nleftovers in our house are all packed after the meal, after any seconds, and all at the same time so everyone gets the portion they need. it takes no extra effort to just lay out all the containers and put a bit into each one - and if at THAT point there are only enough leftovers for one person, it becomes a discussion. OP should consider packing his wife's lunch while she does the dishes. it's a necessary kindness in marriage to consider your spouse's needs along with your own and it sounds like they're both forgetting that to an extent",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 125,
          "content": "Thank you!! It’s super tacky and selfish. I would literally not cook for somebody who treated me like a personal cook who’s meal came second to theirs AND their next-day lunch regularly. This comment section is so unbelievably weird. It’s rude behavior. At the very least she should care that it offends the person doing all the cooking for her. Im blown away by the comments here. People are even suggesting that he pack her lunch for her lmfao like a grown ass woman is simply too weak and exhausted after eating the dinner made for her that she couldn’t possibly muster up the energy to pack her lunch while that same person also cleans up??? This is such bratty and entitled way to treat your spouse.",
          "id": 173,
          "comments": [
            {
              "score": 21,
              "content": "Thank you, can't believe some of these comments.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "This is absolutely the answer - there are some unbelievable YTA responses here!",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "This is exactly it. He feels secondary to her lunch the next day. Like that is more important to her and the main purpose of the diner and sitting and eating with him is just a secondary part of it. \n\nHe isn’t feeling prioritized. \n\nDoes she mean it that way? Probably not. Are his feelings still valid? Yes \n\nIf it’s such a minor thing as people are saying, she should change her behavior to prioritize him even if it makes it slightly more difficult on herself because that’s what you do for your partner when they aren’t feeling validated and appreciated. You don’t tell them “well that sounds like a you problem” and keep living like it’s the old country buffet.",
          "id": 176,
          "comments": [
            {
              "score": 17,
              "content": "Yes, by packing her lunch first they are then eating her leftovers. \n\nBlows my mind that anybody in a relationship would stick to their guns and continue to do something their partner finds disrespectful when it really wouldn’t be a major inconvenience for her to pack her lunch after dinner.",
              "id": 177,
              "comments": [
                {
                  "score": 13,
                  "content": "She seems selfish. Of course it’s selfish to begin with as you say, it’s making them eat her lunch leftovers essentially. But I also think it screams selfishness that she says it’s too big an inconvenience to pack her lunch 20 minutes later when she’s already doing the dishes. It seems very “my way or the highway” to me.",
                  "id": 178,
                  "comments": [
                    {
                      "score": 6,
                      "content": "If she is this way about this, there’s a chance that she is this way about other things and this is just a straw on the camels back. \n\nAfter dinner does she turn to her phone and zone out? Does other places of lost connectivity make this small action sting even more? Relationships are complicated and you don’t get to just do what you want. I mean, you can, but you also might end up single.",
                      "id": 179,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Spoiler: these people commenting aren’t in relationship.",
                  "id": 180,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Perfectly said.  A lot of these posters sound like teenagers who have never been in a long term relationship.  You *will* disagree about many trivial things.  The ones who make it aren’t the ones who tell their spouse to chill because it’s NBD.  They are the ones who listen, and communicate, and adapt.\n\nSource:  am a married adult",
              "id": 181,
              "comments": [
                {
                  "score": 6,
                  "content": "I think they literally are teenagers that haven't been in a real relationship. As you know, there are a million stupid little things that annoy couples all the time. It's about communication and listening to when your partner is upset. She should probably adapt here and I would expect that he adapts when she is bothered by something stupid that he does.",
                  "id": 182,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I think your Reddit name should have to display your age also 😂",
                      "id": 183,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I do so many things for my husband that I think are ridiculous but I do them because for some reason he cares about it. Like making sure the shampoo lid is closed and the label is facing forward when I’m done showering - What the heck?! Who cares!!? I don’t!! But he does!  I think it’s ridiculous. But I do a quick check before i get out of the shower because it’s not big deal and makes him feel better.",
                  "id": 184,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Thank you. I thought I was going crazy reading all the YTA replies. Does nobody have manners anymore? My grandma would have a certified shitfit if anybody tried to make a lunch out of her food before sitting down to eat first.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "I agree. Am also the one who prepares all the meals and I think it's rude too. I’d be pissed if my husband helped himself to lunch before I had even a chance to have dinner LMAO.\n\nOP prepared a meal to share and any leftovers are intended to be free-for-all packed for lunch. OP's spouse marks her territory on the food first, setting aside enough for her future self before anyone has had a chance to eat, and then leaves the remainder for the couple to share in the present. I would find that behavior bothersome too - it’s like the couple’s shared dinner is now the leftovers of the spouse’s first dibs for lunch. It's not just about quantity but also quality, usually what's left over is not the 'choice' pieces after everyone has had the opportunity to eat what they want",
          "id": 186,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Why the fuck do I have to scroll so far for this. The people on this sub are fucking whack sometimes",
          "id": 187,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "There are so many here who don’t get it and who are very mad at OP about it. It’s honestly baffling. Maybe it has something to do with regional customs and even class? \n\nI’ve literally never seen anyone do what OP is doing in my life. If I saw someone do that I would feel it’s tacky, and if I saw someone do it after the person  who cooked expressly asked them not to, I’d have to conclude they were raised by wolves, they’re antisocial, they don’t gaf about any rules of interpersonal relationships or general etiquette.",
          "id": 188,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Finally a sensible & rational opinion.This should be a top comment.",
          "id": 189,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 924,
      "content": "> While it’s not a big issue, it is an action that makes me feel not good and she has the ability to change her behavior but refuses to.\n\nYTA for weaponizing your emotions to try to control her behavior. This is a ludicrous thing to get your knickers in a twist over. Grow up. Let your wife pack her lunch the way she finds most convenient without crying over it.",
      "id": 190,
      "comments": [
        {
          "score": 357,
          "content": "Oh thank god. This was the most alarming part to me by far. He wants to control her behaviour and is angry he can’t. \n\nSure he doesn’t like it but he isn’t approaching this as this hurts me and I’m trying to find a compromise- it’s ’this is annoying because I don’t like it and can’t control her behaviour’\n\nShe also has an extremely valid reason, by the time dinner is over she doesn’t have the spoons to also meal prep. If this ‘favour’ of cooking his partner a meal is so conditional on her enjoying it the express way he decides, how much of a favour is it really??\n\nYTA, OP.",
          "id": 191,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 332,
          "content": ">weaponizing your emotions to try to control her behavior\n\nare people literally not allowed to say how someone's inconsiderate and rude actions make them feel?\n\ndo i need to call an ambulance? y'all might've pulled a limb with all the stretching you're doing to make OP out to be the bad guy",
          "id": 192,
          "comments": [
            {
              "score": 28,
              "content": "“Weaponizing your emotions to control people” is such a weird phrase. You could say it about any emotion anyone has about how other people treat them or act in regard to their boundaries. \n\nI mean how about if everyone has enough respect for each other and each others labor that if someone cooks the meal they control how its served.",
              "id": 193,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "I agree. Imagine thinking that telling someone that something they do annoys you is \"weaponizing your emotions\"",
              "id": 194,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "You're only allowed to do that if you're a women obviously, this sub is so heavily skewed towards favouring women and these threads always make it super obvious.",
              "id": 195,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "THANK YOU \n\nI feel like 1/2 this sub is folks who just need to talk to each other, and 1/2 commenters demonizing folks who talk to each othe.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "No finding a minor faux pas annoying is narcissistic and gaslighting and full on abusive on this sub",
              "id": 197,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 108,
          "content": "Telling your partner something they’re doing doesn’t make you feel good is weaponizing your emotions to control their behaviour? So they should never talk about an issue they may be having with one another? Bottling it up and letting it build into resentment is probably healthier I guess.",
          "id": 198,
          "comments": [
            {
              "score": 39,
              "content": "I think they don’t value his emotions s the same way the value her emotions.",
              "id": 199,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "These types of comments (the one you replied to) really prove to me a lot of posters here are not as mature as they they are.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 66,
          "content": ">for weaponizing your emotions to try to control her behavior. \n\nOkay I had to laugh at this. Are you serious? Telling someone they have hurt your feelings is \"weaponizing emotions\"?",
          "id": 201,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 29,
          "content": "Weaponizing your emotions?? Are you kidding me?\n\nWhy can’t his emotions be valid? Only hers are?",
          "id": 202,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "Takes like this are why guys are generally emotionally unavailable. He tried to convey his feelings, and is called manipulative for just trying to communicate",
          "id": 203,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "You are dumb. Stating emotions is \"Nonviolent Communication 101\". How best could he change her behaviour or at least talk about that?\n\nShe was asshole with her equivalent of saying \"f\\*\\*\\* you\" to him.",
          "id": 204,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "Or maybe she should be appreciative that he is cooking her dinner and lunch and just show some mild appreciation by waiting an hour to pack her damn lunch \n\nYou're either being hyperbolic and/or dealing with some sort of paranoid delusions for claiming that anyone is \"weaponizing\" anything here. I didn't realize that he was poisoning her food! /s \"Grow up without crying over it\" yourself. That would be, voicing your opinion without *weaponizing* your comment with vitriolic garbage. *That* makes *you* the child.",
          "id": 205,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "So, men should leave the toilet seat up. Women should be able to leave used maxi pads on the counter. Someone who eats meat should cook steak in the same pan as the vegan’s tofu dish. I should be able to wear my muddy shoes in someone’s “no shoe” house. A husband is tired after work, just like this wife is, so he should get to watch tv/nap/whatever while his wife cooks. \n\nAnd NO one gets to feel anything about any of that? \n\nEVERY relationship has etiquette that is followed. Those rules of etiquette are established over time and distinctive to the couple/family/friend group/work place/etc. \n\nSome of those rules are pretty specific to the group/couple in question. “We wear pink on Wednesdays”. Some are more universally accepted/expected “leave the toilet seat down” or “do not** eat spaghetti with your bare hands.”\n\nThis is something specific to the couple. He finds it rude. She doesn’t care. That doesn’t make him an asshole or controlling.",
          "id": 206,
          "comments": [
            {
              "score": 12,
              "content": ">“down eat spaghetti with your bare hands.\"\n\nWhen you say that its gross for me to scoop two handfuls of spaghetti and pretend I'm a raccoon at the dinner table you're weaponizing your emotions to manipulate me",
              "id": 207,
              "comments": [
                {
                  "score": 4,
                  "content": "Good. I want your trash panda self to cower at the mere thought of my roller coaster of emotions.",
                  "id": 208,
                  "comments": [
                    {
                      "score": 2,
                      "content": "\\*HISSSSSS\\* \n\n\\*Scurries away\\*",
                      "id": 209,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "\"Weaponizing your emotions\" to describe open and honest communication has to be one of the most bizarre takes I've seen on this subreddit.",
          "id": 210,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 761,
      "content": "Nta.   I'm going to go against the grain here.   I would be miffed too.  After all that hard work of cooking and she doesn't even dish it up for dinner but instead starts packing it away for lunch?   Nah, I'd be like, hey let's eat before we pack anything.  I'm with you op.",
      "id": 211,
      "comments": [
        {
          "score": 472,
          "content": "Honestly, I’m surprised at the responses, I would be so offended like all that hard work and you’ve just come and taking a huge portion of it before I’ve even had a chance to sit down wtf",
          "id": 212,
          "comments": [
            {
              "score": 285,
              "content": "Especially because he’s told her it bothers him.  Everyone up in arms claiming he’s trying to control her, is wild.  OP should stop cooking dinner.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 169,
              "content": "Sadly I am not surprised. If the genders were reversed then I have a feeling the comments would be a lot different.",
              "id": 214,
              "comments": [
                {
                  "score": 83,
                  "content": "I guarantee they would.",
                  "id": 215,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "Bingo, only reason he is an asshole is hes male.",
                  "id": 216,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Ironically we don't even know that. OP called her \"partner\" and didn't mention their own gender. But everyone assumed. If everyone had thought OP was a woman the result would be a resounding NTA.",
                      "id": 217,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "I never like these comments as I most often see them in cases where the man is 100% an asshole and a woman would 100% be one too if she did the same.\n\nBut here... there's a comment above saying \"why don't you pack her lunch yourself so that she can relax?\": I mean didn't we agree that it was completely wrong to consider that the partner who goes to work deserved to be fully served by the one who stayed at home (and nowhere does OP says they stay at home, they probably work too) because they \"had a hard day\"?\n\nEating a meal you've spent time preparing is mostly satisfying because you get to contemplate the finished product of your work and then enjoy it. She takes that away from OP. The meal they eat for dinner is a meal that has already been touched, and even if it's obviously still fresh, it's just not as satisfying.\n\nI know OP doesn't say they're a man, but let's be honest most people here assumed so as soon as they noticed that the partner was a woman. And yes, I believe it influences how people see that, because even if there still are way too many people who think women should serve men, submit to them and that kind of bs, I don't think that the people who commented here would ever go and ask a woman who cooks almost everyday for her husband to pack his lunch herself if she's unhappy with the way he behaves with the meal.",
                  "id": 218,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Most definitely. If you are on this sub consistently you can see the patterns.",
                  "id": 219,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 56,
              "content": "I’m so surprised also! The meal that you cooked for is not supposed to be the leftover portion lol that’s insane to me.",
              "id": 220,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I mean it seems like he makes enough dinner so she has some for lunch the next day. So he knows she’s gonna take it for lunch he just doesn’t like when she packs it",
              "id": 221,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I’m genuinely curious why that is. As someone with ADHD I *have* to do my prep for the next day (packing lunch, doing laundry, etc etc) as soon as I get home or it will slip my mind once I sit down. I agree that it’s weird to do this when guests are over but I guess I’m just struggling to understand why it’s such a problem if it’s just her and her husband?",
              "id": 222,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Myself am more the mind I’ll eat as much as need too and whatever’s left is whatever’s left. \n\nIn no way would I allow someone to take food before I’ve eaten the portion I want (I’m talking if I cooked). Doesn’t matter how much food there is, doesn’t matter if it’s just 2 people and I don’t care if it saves hassle later packing it away later. It’s rude, and she does it in front of guests as well.",
          "id": 223,
          "comments": [
            {
              "score": 5,
              "content": "Doing it in front of guests sealed it for me personally. That’s just a lack of manners.",
              "id": 224,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Had to scroll waaayy far before seeing a strong nta! We’re missing so much information but personally I have a deep cultural background that strongly discourages self serving before you eat together. To me, it’s almost disrespectful after such a labor of love. Even if OP likes cooking, calling them an AH for asking their partner to wait until after their meal to pack their lunch is wild to me.",
          "id": 225,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I agree. \nEspecially if I were to prepare something special and if it's dug into before it even reached the dinner table",
          "id": 226,
          "comments": [
            {
              "score": 19,
              "content": "Plus then the food is cooling while she's pushing up her lunch instead of them both sitting right away with hot plates to enjoy the meal he's spent time and energy preparing for them. \n\nI'm surprised by how many YTA comments there are, I'd consider this rude and would also be miffed like I'm not a takeout restaurant, let's sit and enjoy the meal and leftovers become lunch. Even if I've made enough intentionally for leftovers, let's focus on the present meal that we're about to enjoy together.",
              "id": 227,
              "comments": [
                {
                  "score": 7,
                  "content": "betting it’s an age thing. People who are the cooks in the family will know how unrewarding and unappreciated cooking can feel. Potentially Hours of work gone in minutes. Least people can do is turn up to the table when it’s hot.",
                  "id": 228,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Agree. NTA. Super tacky and rude. The chef gets to dictate how the food is served..if he wants the food to be served \"whole\" without portions missing from a loaf/pie/meat pieces/lasagna whatever it may be..then that's how it should be handled. She can do what she wants when she cooks.",
          "id": 229,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I’m team NTA too. She’s ruining the presentation, and taking whatever portion she wants BEFORE everyone’s had dinner. If there’s company especially you absolutely don’t serve a dish to the table that’s been already cut into or scooped into. \n\nOP needs to talk this one out with her. These kind of annoyances kill a marriage if you don’t address them.",
          "id": 230,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 677,
      "content": "Ok, so food insecurity isn't the issue, and it's only the two of you. She comes home, still in work mode, wants the work of the day done so she can relax. And this bothers you. The only thing I see you taking umbrage to is her serving herself...when there's only two of you...so she can mark her work day over. And you are choosing to go down this path? You honestly have chosen this to be upset over? Really? Think about this one, long and hard, and if you are still annoyed, you didn't think enough.\n\nYTA",
      "id": 231,
      "comments": [
        {
          "score": 75,
          "content": "Also, I feel like a few more details matter here. What time is she coming home? If she is coming home late or has to wake up very early because she has a demanding job I think it’s fine that she’s getting herself situated before settling into her evening routine. Especially when all we know at the moment is this woman goes to work, comes home, washes her lunch box, packs lunch, eats with the husband, and then cleans up after dinner. If she’s getting home late that’s her whole evening. She can pack lunch whenever she wants.",
          "id": 232,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 578,
      "content": "NTA. I get where you’re coming from, it would annoy me too.",
      "id": 233,
      "comments": [
        {
          "score": 118,
          "content": "Agreed, especially if it's got a visual aspect to it. Cutting, stirring, etc can ruin the presentation. Not to mention potential risk of overcooking sensitive foods during this washing/packing time, like cream sauces or stovetop rice.",
          "id": 234,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Yeah this sounds annoying as hell. People are allowed to be annoyed by something without being able to clearly define it.",
          "id": 235,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}