{
  "post content": "I(22F) was taking a 10hour bus. The seats were tiny and considering I am pretty skinny I was fitting normally. However, my seat mate was a severely overweight lady around her 30y. \n\nI didn’t wanna be mean so I shoved myself in the window and even then our sides were joined and I was feeling like she was leaning on me. I was by the window and her by the isle. I glanced back and saw a grandma sitting by herself and smiled at her and asked if she minds if I join her.\n\nShe smiled and nodded and the lady next to me frowned and said. “Is there a problem?” I told her honestly I was cramping and had no space to even shift around.\n\nThis woman got so upset after that and started saying I was fat-phobic, skinny hoe, a-hole.. I told her honestly I cannot last 10hours like this and I am not staying in the seat to save her feelings and she can think whatever she wants.\n\nShe then proceeded to make an hour long phone call calling me white trash and what not. My mom said I should have waited for a rest stop and just sat down behind the lady as opposed to saying she has left me no space. Idk, I don’t think I was mean. AITA?\n\nEdit: for everyone saying this story is fake, there is a lovely person down in the comments that said they wish I will get health related issues, gain weight and get my ultimate punishment. All kinds of people out there",
  "id": 1,
  "comments": [
    {
      "score": 4586,
      "content": "Seats are (rightly or wrongly) designed with height/size parameters in mind. If people don't fit those, adjustments are required (like you moving).\n\nAs long as you made it out to be a practical necessity and not out of disgust, NTA.",
      "id": 2,
      "comments": [
        {
          "score": 829,
          "content": "I can't even sit in a bus seat normally- my legs are too long! And I'm only 6ft.",
          "id": 3,
          "comments": [
            {
              "score": 250,
              "content": "Ooft, I used to Megabus it to London every week from Glasgow! I am a slight 5\"10, though.",
              "id": 4,
              "comments": [
                {
                  "score": 87,
                  "content": "Totally unrelated, how much is that bus? I'll be in the UK in July and need to get from Glasgow to London",
                  "id": 5,
                  "comments": [
                    {
                      "score": 94,
                      "content": "£10-£20, 8 hr trip\n\nhttps:// uk.megabus.com/route-guides/london-to-glasgow",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 20,
                      "content": "If you can afford a little more, the train is infinitely nicer and 4hrs 30 - it’s around £60 off peak!",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "Someone mentioned how much nicer the train is - it really is, and if you know when you're travelling and can buy tickets in advance it can be as cheap as £25",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Depending on how long you're in the country, look into the BritRail pass. I used it to hop on/off every train in the UK I needed for two weeks back in 2018.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Site says the prices for June 26th (further dates aren’t available atm) are between £9.99 and £14.99, but I’m sure they’ll go up a bit in July to account for summer holidays so between £10-£20 I’d say!\n\nEdit: oops I’ve been on this thread too long, didn’t realise it’d already been answered",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Omg megabus 😂 I always took the last one around midnight from London to Manchester just to avoid people.",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 29,
              "content": "I have the limbs of someone at least 5\"11 and the body of a child. I end up curled up like a dead spider on long bus journeys!",
              "id": 12,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 15,
              "content": ">And I'm only 6ft.\n\nOnly?",
              "id": 13,
              "comments": [
                {
                  "score": -52,
                  "content": "90% of American men are, or taller than 6 feet 0.64 inches.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 32,
                      "content": "The average height for males in the US is 5 feet 9 inches.\n\nwww.nytimes.com/2019/01/14/health/height-weight-americans-cdc.amp.html",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "Lol. Wrong.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "My husband is 6’5”. We literally have to buy Comfort+ on airplanes because if not he ends up spreading into the sears next to him and with back pain for the next three days.",
              "id": 17,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "Exactly. Arguably those parameters should be adjusted as height/size averages have been steadily increasing in the developed world. Ideally designers shouldn't have to assume that a significant portion of the population will be extremely overweight, but it's not just about weight. Realistically you have to be like 5'7\" or under to sit comfortably on a plane, and I don't think that's appropriate these days.",
          "id": 18,
          "comments": [
            {
              "score": 81,
              "content": "> realistically you have to be like 5’7” or under to sit comfortably on a plane\n\n5’6” checking in to let you all know that planes aren’t comfortable for me either. I feel for you actual tall people, it must be hell",
              "id": 19,
              "comments": [
                {
                  "score": 39,
                  "content": "5'5\" here and it's not so good either. No room to stretch or get up comfortably and the seat in front nearly touches my knees.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 79,
                      "content": "5'3 checking in, we're totally fine but can you help us put our luggage into the overhead compartment?",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "I’m only 5’9 but chubby so I feel like a sardine or an animal in a burrow.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Huh, really? I'm 5'11\" and honestly have always felt fine on planes, obviously not super comfy but not cramped by any means.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Are you perhaps more torso than limb? That makes a difference. My boyfriend is an inch taller than me, but my legs go up like 4\" past his waist. He's much more comfortable on planes than I am.",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "I have a big butt but am not very tall. I can see how limb length + butt thiccness can really make a difference.",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I am 5’1 and the last time I flew, I wanted to cut my legs off. It was incredibly uncomfortable. I have no idea how tall people do it.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "5'7 who flies a lot and I disagree. I can sit comfortably on virtually all planes. The only possible exception was Ryanair but it was not too bad.",
                  "id": 27,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "As a 5’2 person planes are also uncomfortable for me cause I can’t reach the floor when I sit down so my feet go numb from dangling if I sleep. They had nobody in mind when they designed these things lol.",
              "id": 28,
              "comments": [
                {
                  "score": 51,
                  "content": "And your head gets shoved forward because the part that's supposed to support your neck hits you in the back of the head instead!",
                  "id": 29,
                  "comments": [
                    {
                      "score": 17,
                      "content": "YESS! And I can’t really use the ones that bend to stabilize your head cause it’s barely touching the top of my head/hair lol.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Thank you! I feel seen 👀",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I once went to the opera house which had it's original seats and they were \\*small\\*. There was a man in front of me, not fat in the least but at least 6' tall and he looked so cramped.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "I am an overweight lady in my 30s. I wouldn't classify myself as severely overweight personally, but hey others might. While I've never had issues on planes (it's been a good while since I've been on a bus) beyond maybe my leg or arm touching the other person's, I would have no problem if the person beside me wanted to switch seats to feel more comfortable. Cause whats the downside?  They move elsewhere and feel more comfortable and I get more room to stretch out (I'm not overly tall but even at 5'7/170cm there's not a ton of legroom to speak of)\n\nOP is definitely NTA for wanting to move. You should never sacrifice your own comfort for the sake of someone else's feelings.",
          "id": 33,
          "comments": [
            {
              "score": 23,
              "content": "You should never sacrifice your own comfort for the sake of someone else's feelings.\n\n.....unless you're holding in a fart",
              "id": 34,
              "comments": [
                {
                  "score": 8,
                  "content": "Yeah, you gotta carefully control the release so people can't tell it's you.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "If I felt like someone was leaning on me, disgust is 100% appropriate.",
          "id": 36,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "It's pretty disgusting that those companies make a fuck ton more money by making seats smaller. More people more money paid for the tickets.",
          "id": 37,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "I never understand why people that have more bodyweight realize that they take up more space. OP paid for a seat, and want to use the FULl seat. I you have so much bodymass that you need more than one seat, book two! You can't expect other two snuggle with you!\n\nNTA Not wanting to sit like a sardine is not fatphobic or fatshaming.",
          "id": 38,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "> and not out of disgust\n\nI'm sorry, but what would be wrong about feeling *disgusted* by **ANY** stranger **physically touching you** when you don't want them to?\n\nI don't care *what shape* you are: you have no right to be in contact with **my** body.",
          "id": 39,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Just like with planes, if you encroach on another seat, you have to buy 2. You don't have to get squished for 10 hours just because her feelings are hurt. NTA.",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": ">Seats are (rightly or wrongly) designed with height/size parameters in mind. If people don't fit those, adjustments are required (like you moving).\n\nIt's right to design them to a standard, but that standard might be wrong. Most busses I have seen have too little legspace.\n\nIf she is so big that op can't move, she needs to book 2 seats. Seriously. And I say that as an obese person.",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Honestly, I get nerve issues when being \"sat on\" and it's really painful. I miss my spiky goth days!",
          "id": 42,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1581,
      "content": "NTA, you were uncomfortable and solved the problem in a kind and respectful way, she's the one who made it into an issue. Did she want you to sit cramped for 10 hrs just to save her feelings ?  And then she proceeded to body shame you, which is totally an A-hole move. Sorry you had to deal with this, and I feel sorry for anyone else who gets trapped next to this woman.",
      "id": 43,
      "comments": [
        {
          "score": 390,
          "content": "Exactly. Now they both had more space. Obviously she did not care if OP was uncomfortable. I'm a chunky mama. Prefer not to say my weight, but over 200 at 5'4. If someone moved like this, yeah, I would be a little embarrassed because it was obviously  because of me squishing her. But no way would I call her out. She did nothing wrong but make both of them more comfortable because a considerate larger person is trying very hard to contain their girth and not encroach on the other person's space",
          "id": 44,
          "comments": [
            {
              "score": 148,
              "content": "In this case, seeing how she reacted when the OP moved, it seems to me the woman was playing \"Squish the undeserving skinny girl\".\n\nNTA",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Totally! That's the normal reaction! You're absolutely right!",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Yep, she was way out of line... she extended the discomfort for everybody there, not only she and OP but all the other passengers during THE NEXT HOUR. Like at this point is not even about being embarrassed, she was being spiteful for the sake of it.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Exactly. I'm overweight. I wasn't always, so I get both sides, but it also isn't even really a weight issue here. It's an \"involuntarily forced into physical contact (or too close of a proximity) with another person\" issue. Two people of average or low weight could be squashed together for some reason and it'd still be unpleasant and uncomfortable; add on being stuck for hours...yeah no. When I was smaller it still happened on some planes and buses, as they had ridiculously sized seats, and it was the dream that the person next to you could move to an empty row.\n\nI know this wasn't moving to an empty row, but if someone did this to me I'd still be like \"woohoo, row to myself!\", with a momentary little voice in my head saying sorry for being fat, but thank God they moved. Why this overweight lady thought making a scene was necessary is beyond me? She just drew more attention to the situation and the \"problem\" of her fatness, which is beyond strange. I know I'm fat, this lady knows she's fat...she doesn't look like the victim by behaving this way.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Agreed, it’s not like OP told her she was moving because (insert any actually fat-phobic insult here). OP said they were cramping and uncomfortable in their seat, nothing mean about it. The irony of accusing someone of that and then proceeding to body shame OP… ugh. NTA",
          "id": 49,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 799,
      "content": "NTA\n\nHonestly I'm overweight AND tall so my legs don't even fit behind the seat and i have to sit kinda sideways. I would 100% not be offended, if anything I'd appreciate more room.",
      "id": 50,
      "comments": [
        {
          "score": 122,
          "content": "NTA.  And this.  Those seats can be small and uncomfortable for pretty much all adult persons!",
          "id": 51,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "This is exactly what I was thinking.  I'd be relieved that my seat mate was able to be comfortable so that I don't have to feel guilty about that.  I'd also appreciate the extra room.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "This is what I never get with these seating question, who in their right mind wants more people sitting next to them on public transportation?",
          "id": 53,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "Big girl here, working on it though. Busseats often are too small, even for normal bodies. When you have wider hips, well, you have a problem. I try to make myself as small as possible in the hope of not making the other person uncomfortable. It's shitty for both of us and if the person next to me saw a better seat they should go for it. OP is NTA, I know it must have sucked for the other person too but that is no reason to start swearing at/about someone",
          "id": 54,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 424,
      "content": "NTA. You have a right to be comfortable on a long journey. This is why airlines make people over a certain size take 2 seats. Perhaps the bus company should do the same.",
      "id": 55,
      "comments": [
        {
          "score": 108,
          "content": "Every company should do the same",
          "id": 56,
          "comments": [
            {
              "score": 182,
              "content": "I asked Southwest about this when I had to fly when I was pregnant (and I am not small to start with). They would have been happy to sell me two seats but could not guarantee that they would be next to each other. That's super helpful.",
              "id": 57,
              "comments": [
                {
                  "score": 106,
                  "content": "Wtf? “yeah just lemme detach my upper half real quick, I’ll keep my legs over there” how on earth lol",
                  "id": 58,
                  "comments": [
                    {
                      "score": 72,
                      "content": "We will upgrade your torso to business class but your bum has to stay in coach.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "It's because southwest doesn't assign seats. Seating is first come first sever based on boarding group.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "But Southwest doesn't have assigned seating.",
                  "id": 61,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Buy Early Bird for one of the tickets and you will have no problem.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Well, my kid's a legal adult now, so the issue has passed. I just felt like wtf, I'm trying to do what most of us agree is the right thing, but they didn't make it easy.",
                      "id": 63,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -32,
              "content": "Or, they should be required to provide seats that fit at least up to a 90th percentile human.",
              "id": 64,
              "comments": [
                {
                  "score": 26,
                  "content": "They already do.",
                  "id": 65,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "But they do?",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Oh man, I wish *so much* that our busses and trains here allowed you to reserve two seats! But no, even when I directly ask for it, I get denied the option. And then everyone is uncomfortable. :/",
          "id": 67,
          "comments": [
            {
              "score": 25,
              "content": "Sometimes it’s worth giving them a call and telling them you’re taking a cello or tuba, and you need to reserve a seat next to you for it. It’s a PITA but it works",
              "id": 68,
              "comments": [
                {
                  "score": 4,
                  "content": "That's a good idea! I should try that.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I bought a train ticket from Chicago to New Haven, CT. Since I’m “a passenger of size,” I bought two seats. It was fine going, but on the way back when we started out, one of each pair of seats was taken. \n\nCome to think of it, I’ve been assigned two aisle seats on a plane as well, but only once.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "[deleted]",
          "id": 71,
          "comments": [
            {
              "score": 21,
              "content": "What the heck. I would have raised hell. You paid for that seat and didn't get full use of it. Also, wtf to your husband making his pregnant wife stand instead of taking turns or trading seats.",
              "id": 72,
              "comments": [
                {
                  "score": 2,
                  "content": "[deleted]",
                  "id": 73,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Yeah, that's really frustrating. I recently flew in the middle seat between two guys who were not overweight, but they of course stole both armrests and one guy kept elbowing my side (I'm a woman if it's not obvious). I hate the middle seat lol",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Why did your husband not give up his seat for you?",
              "id": 75,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 175,
      "content": "NTA you told her the truth and she didn’t want to hear it, you shouldn’t have to put up with being uncomfortable for that long.",
      "id": 76,
      "comments": [
        {
          "score": 25,
          "content": "People should really stop asking questions they don’t want to hear the answers to.\n\nLike… this lady was either looking to start a fight or to force OP to reassure her, both of which are petty and stupid things to do. And immediately calling you names just goes to show she’s constantly on edge about her own weight and is constantly looking for excuses to blame others so she doesn’t have to be uncomfortable with the idea that she is making someone else uncomfortable.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 162,
      "content": "NTA. Fat activists seem to think that the world should shift to accommodate their bulging waistlines  and that everyone else should be uncomfortable so that they don't have to acknowledge their own corpulence. If you can't fit in a single seat, buy two seats.\n\nAlso, why would this woman complain about having more space? I would never be annoyed if someone moved away from me on a bus, it's more room for me.",
      "id": 78,
      "comments": [
        {
          "score": 195,
          "content": "[deleted]",
          "id": 79,
          "comments": [
            {
              "score": 230,
              "content": "Honestly most overweight people are the opposite.  Desperately trying not to disturb anyone with their size and woefully uncomfortable in the situation.  It’s a different level of anxiety trying to move through the world.  And people like the one you’re replying to are the exact reason for that.",
              "id": 80,
              "comments": [
                {
                  "score": 91,
                  "content": "[deleted]",
                  "id": 81,
                  "comments": [
                    {
                      "score": 37,
                      "content": "I agree. I went from overweight (not even by a lot) to “fit looking” and the way I was treated by random people changed too. It was weird haha",
                      "id": 82,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -5,
                      "content": "Because its a perfectly natural reaction to be put off by seeing horribly abused and unhealthy bodies. Im sure children shown pictures of smokers with stomas will also have a negative reaction, and that is GOOD. It shows that their self preservation instincts are functioning",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 81,
              "content": "But they were specifically referring to \"fat activists\", not \"overweight people\". And yes, there are some (few) fat activists that do espouse these extreme views- demanding various accomodations on the one hand, but pretending there's nothing different about them on the other.",
              "id": 84,
              "comments": [
                {
                  "score": 6,
                  "content": "If their words and actions work against the mission of fat activism/acceptance, I can't consider them activists.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -42,
                  "content": "[deleted]",
                  "id": 86,
                  "comments": [
                    {
                      "score": 50,
                      "content": "Raging about how OP was \"fat-phobic\" for not wanting to get squished for a whole long bus ride does kinda sound like some fat activist BS. It's not that much of a stretch.",
                      "id": 87,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 34,
                      "content": "Yea, they started screaming OP was fatphobic when they were legit doing this, so....",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "I mean, attempting to make other people conform to an unreasonable extent, whether it's based on your own insecurity or not, is basically saying that their ideals take precedent over yours\n\nEvery bully has a reason to bully, even if its just that they're mean minded people who lack empathy, it's still a reason\n\nI think it fits, personally",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "They didn't say all overweight people, they said fat activists. And this is how they think. Seriously. Just take a look at Marissa Mathews, r/fatlogic, or fat activist compilations on YouTube. The amount of insane things I've hear fat activists say is just *wow*, from BED not being a thing to fasting and dieting being EDs, to anyone who exercises is fatphobic and has an ED, the list is literally never-ending. What TheMidnightHandyman said wasn't fatphobic, it was an assessment of the situation OP outlined in her post which clearly describes a woman who is fat accusing OP of being fatphobic and insulting her size just because she wanted to move so she could be more comfortable.",
              "id": 90,
              "comments": [
                {
                  "score": -1,
                  "content": "[deleted]",
                  "id": 91,
                  "comments": [
                    {
                      "score": -1,
                      "content": "Wow.",
                      "id": 92,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "I don’t if the commenter changed their comment since your reply. But now it says “fat activists”.\nSo they are not talking about the average person that is overweight. They are talking about the “body positive” fat activists movement, which have ruined the term body positive and made a joke out of a very real issue.",
              "id": 93,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "i think you’re missing the key identifier which is fat activist not fat people. in general the activists do tend to think this way.",
              "id": 94,
              "comments": [
                {
                  "score": 0,
                  "content": "[deleted]",
                  "id": 95,
                  "comments": [
                    {
                      "score": 0,
                      "content": "these are the mainstream views of the movement - it’s why i left it. \n\ni don’t think it wrongly describes the situation either. getting up and moving your own seat in this case was the most polite possible way to deal with it. responding with a *1 hour long phone call degrading OP for being *“fat phobic” makes me think this person definitely subscribes to *that sect of fat activism. \n\ni mean it’s word for word what i dealt with in the fat activism cult the second i started losing weight. it doesn’t seem like a stretch at all.\n\nedit:\n\n>>How is it that you pulled out of that, that I was saying fat activist and fat people are the same thing is beyond me.\n\nwell you did say “don’t you think your assessment of **overweight people** is a bit extreme?”\n\nthey weren’t talking about overweight people, they were talking about fat activists.",
                      "id": 96,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "He was talking about the \"fat acceptance\" groups. Those people that attack celebrities like Rebel WIlson who decide to lose weight",
              "id": 97,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 23,
          "content": "fat activism is more about dropping the stigma around fat bodies and combating fat-shaming than about 'shifting the world to accommodate their bulding waistlines' but sure",
          "id": 98,
          "comments": [
            {
              "score": 26,
              "content": "Which is asinine. grotesquely unhealthy bodies should NOT be normalized as okay. thats like pushing for more images of people dying of lung cancer in the media so children arent put off by it - but they should be! Obesity affects innocent children and is a top killer in america. It is proven to be socially\nContagious and should NOT be normalized like that. Imagine caring more about the feelings of adults who live unhealthy lifestyles over the innocent children being victimized and having their health ruined by it being so normalized. Once you travel to other countries that arent UK or mexico you realize how much it is a lifestyle issue",
              "id": 99,
              "comments": [
                {
                  "score": 12,
                  "content": "It's not about \"normalising\" them, it's about not being hateful AHs and judging them cruelly like you do. Your clear hatred and disgust of fat people is revolting. You have no idea why the fat people you see are fat, but clearly think it's just simple personal weakness and laziness. After seeing all your comments, you are truly heartless and cruel.\n\nI guarantee you'd see me in real life and think I'm a disgusting stupid fat person. What you don't know is that I didn't become fat until I was disabled by medical issues. I was fit, working out multiple times a week, and even went on a monitored food program and got a personal trainer when I started putting on weight. Gym staff, my trainer, my nutritionist, and doctor where all baffled, and unfortunately I was misdiagnosed for years and my health just kept deteriorating. I wasn't doing the \"wrong things\" though. The only symptom and side effect of all this that people can actually see though, just walking around in real life, is that I'm now obese. The pain, arthritis, exhaustion, dizziness, and more, that I experience you can't see...not that people like you would care while you mock and judge me.",
                  "id": 100,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Youre putting a lot of words in my mouth i am not going to engage with you",
                      "id": 101,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "and most overweight people aren’t “grotesquely unhealthy”, weirdo",
                  "id": 102,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I said obese. the person in the post definitely sounded beyond overweight",
                      "id": 103,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": -9,
                  "content": "ever heard of genetics? they're a huge contributing factor in bodyweight. some people try every diet under the sun and are still overweight.\n\neating disorders, too - people put on a little, get criticised and then stress-eat, put on more, even more discrimination, even more overweight... then boom you're stuck in a cycle you can't escape.\n\ni don't know if you intended to come off this way or if it's just the tone of your comment, but you're being extremely fatphobic.\n\nfat people deserve respect. they deserve people not to stare at them on the street, or look away because \"ew! that's gross!\"\n\n> innocent children being victimized\n\ni have never seen a child look at an obese person and say \"wow i wanna look like that!\"\n\ni have seen far too many children going \"ew! that person looks disgusting! i don't wanna sit anywhere near them!\"\n\nthat's not okay. that shouldn't be okay. many people can't help it.\n\nand yeah, i care about their feelings, because everyone's feelings fucking matter. my mum's a tiny bit overweight, but not obese, and it makes me sad how much she goes on about it. it takes a huge toll on her mental health, despite the fact that the *only way* she can get back to a healthy weight is by going on hugely restrictive diets, permanently (because it will all come back straight away otherwise) - \n\nhugely restrictive diets which, by the way, have also have negative impacts on health. our bodies don't exactly like it when we keep switching up our diets.\n\nif we were to reduce the stigma around obesity, my mum wouldn't feel as pressured to keep up that cycle, and her body would settle into its own natural weight - slightly overweight, but not unhealthy - a weight that works for her body.\n\nfat people deserve respect, and they deserve not to be treated as lesser beings for somethinf that's often out of their control. don't be an insensitive ass.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Again,\nGo to other countries and then get back to me about genetics being the reason america is so obese. Get real",
                      "id": 105,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "Phobias are irrational fears. Being averse to grotesquely unhealthy bodies is natural and a self preservation instinct. obesity is a top killer in america that affects many children due to it being so grossly normalized in this country. It IS socially contagious, look it up. Its an epidemic . That is what i care about.",
                      "id": 106,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "OP's seatmate wasn't a fat activist.  She was just an AH.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -6,
          "content": "fat activism is more about dropping the stigma around fat bodies and combating fat-shaming than about 'shifting the world to accommodate their bulding waistlines' but sure",
          "id": 108,
          "comments": [
            {
              "score": 17,
              "content": "Laudable goals. Too often, those goals get hijacked by science deniers.  \n\nAdmittedly just my anecdotal experience, but I've never met a fat activist who didn't insist that the \"medical establishment\" was lying about the health risks of obesity.",
              "id": 109,
              "comments": [
                {
                  "score": 6,
                  "content": "i mean, i don't know what you count as a fat activist, i'm just talking about the regular people i know.\n\nthough, i see your point - a lot of them definitely tone down the risks - but again i think that's because that's not the purpose of their activism - they're not trying to talk about the health risks, they're trying to stop discrimination based on size. some people have genetics that mean they are baturally overweight, and people are always like \"exercise more\" or \"go on a diet\" which is pretty insensitive. so, i don't think they're denying the science or the risks, but trying to move the discussion away from that and back to the actual discrimination faced by obese people.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I completely agree that everybody, irrespective of their body mass, deserves respect. I do my best to show people that respect, and I'm sure you do too.\n\nIt's very nice to discuss a sensitive topic on the internet and not have it turned into a flame war. Have a lovely day, internet stranger.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 99,
      "content": "Nta, and not fat phobic??? \n\nIts called personal space, and everyone I know would enjoy having that??? Sounds as if the woman was looking for a fight seeing as you didn't say anything to her until she decided to confront you about your own reasonable reasons for wanting to relocate.",
      "id": 112,
      "comments": [
        {
          "score": 5,
          "content": "Yeah, she was definitely looking for a fight. Any other person in that situation would’ve been relieved that OP decided to swap seats because that’d mean that they would get some more room instead of pressing up on a stranger.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 97,
      "content": "NTA. You paid for a seat, she was infringing on the space you paid for. If she cannot fit in her alloted space, it's her responsibility to purchase more space. You had every right to move.",
      "id": 114,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 77,
      "content": "NTA\n\nAs a fat person I say this.  \n\nThis was only an issue because she made it one",
      "id": 115,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 51,
      "content": "NTA\n\nI am fat too and one needs to be realistic. There are downsizes and while being rude and condescending is uncalled for, just changing seats because there's no room is neither of both. I don't like it when I'm squeezed against another person and would have been ashamed but also grateful to have more room.",
      "id": 116,
      "comments": [],
      "relation": "Support"
    }
  ]
}