{
  "post content": "I (29M) broke up with my ex girlfriend over 5 years ago when I caught her cheating on me. We had a 7 month old son that I learned wasn’t mine  after I demanded a paternity test and so I was out of his life after that. It hurt going through all that but what hurt the most was some people in my family being against me leaving “my son.” Some stopped talking to me, others I stopped talking to like my mom because she still wanted to accept my ex’s kid like her first grandchild. So I said fine and cut contact. Last year I had my first son. We celebrated his one year birthday on the 1st of this month. When my girlfriend got pregnant my mom reached out and wanted to make amends. For us to be in eachother’s lives. She said she hasn’t had any more contact with ex. I was mostly thinking for my son and that it would be nice for him to know his grandma so I gave her a chance.\n\nOn the actual day of my son’s birthday, my brother saw my mom first and goes “oh shit.” He saw her getting out of the car with my ex’s kid from the window and he told me. My brother told me he had no idea she was gonna bring the kid and said he’ll keep her outside if I want. I went outside instead and my mom had the kid wait in the car while we talked.\n\nI was so pissed I remember yelling at her for trying to bring him to my son’s birthday. My mom kept apologizing for hiding it she just felt really bad because his real dad doesn’t want to be involved. And they still have pictures of me and him from when he was a baby so he still thinks he’s my kid. It was hard not to lose anymore of my cool so I just remember saying “get the fuck out and don’t ever come back or bring him around again.” It was a whole thing and everyone who was already there saw it play out. My mom left and my brothers were trying to cheer me up and get the party back in a happy mood for my son. \n\nSome family were in a bad mood and they left early. The shit storm happened after that and they’re mad for how I treated my mom. Even she’s said something too that she’s hurt how much I disrespected her and she knows it was wrong to lie, but she was really trying to make it easier on ex’s son by making him feel part of a family. \nShe really thinks I need to give him a chance  because I “loved him once.” I just hung up on her.\n\nStill everyone’s on me calling me a a-hole for callously kicking her out for having good intentions even if they were misplaced. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 17843,
      "content": "NTA. That poor kid. Your mom is AH big time.",
      "id": 2,
      "comments": [
        {
          "score": 10700,
          "content": "My heart is absolutely broken for that 5 year old. OP is NTA, but that poor kid did nothing wrong.",
          "id": 3,
          "comments": [
            {
              "score": 8925,
              "content": "Nope, that poor kid did nothing wrong... and OP's mom is 100% responsible for any pain that kid experiences from this.  She should be ashamed of herself. She knew exactly what would happen.",
              "id": 4,
              "comments": [
                {
                  "score": 3673,
                  "content": "Her and his mother.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2663,
                      "content": "Right? Who is telling him that the man in His baby pictures is his dad? Clearly his mom is and OPs mom is letting that happen. \n\nNTA - normally I’m not ok when someone who has been a dad abandoned a kid because of DNA, but he was under a year and would never have remembered you if not for his mom and yours.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 720,
                      "content": "That poor kids gonna need so much therapy.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "...and the biological father. A triad of AHs in that poor kid’s life.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1762,
                  "content": "From the sound of it they know exactly who the kids father is and are lying to him about it in an attempt to guilt OP into taking up that role.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 450,
                      "content": "Yes, op stated that real father know but is not interested. And as always let's put someone in the father's role as he have emotions  related to kid, mostly betrayer as kid's mother stabbed OP in the back but let's make him a father. \n\nWorst thing that could happend is just OP blaming kid for everything that happend to him and proving kid's mother is a bad person. What's bad in breaking his world even more when at that Age he learns that he \"destroyed\" lives of all those people.\n\nNot to mention how OP could regain father's rights? Or idea is he is a father as long as he gets in line and agree with ex?",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I'm not so sure about this.  The ex or the mother said the real father isn't interested, but look at the kind of people they are.  If the child is going to be ignored by a father, why not blame the real father?\n\nInstead they're lying to the child, ex lied to OP, so why would we assume they're not lying to the bio father?  Maybe he's married and the ex knows he'd never leave his wife so is still trying to get with OP through the child.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 352,
                  "content": "It’s like peer pressuring someone to raise a kid... NTA",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 108,
                  "content": "Yea if SHE wants to be part of that child’s life, SHE can find a kind way of being honest about her role and why she loves him. She can still be a grandmotherly figure without imposing that role on to OP.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 74,
                  "content": "100%. OP, maybe send this thread to your mom so she can possibly get a clue about the pain and trauma she is causing. My god, she’s a monster.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 60,
                  "content": "She probably had some stupid fantasy in her head that her son would take one look at the boy, a tear would roll down his cheek or something stupid, and accept the kid with open arms. Her emotional manipulation backfired big time, and if she and the ex don't cut it out, that kid is in for a world of hurt growing up. NTA.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "And she blames OP for not going along with her plan.  If he would just allow himself to be manipulated this would all be so much easier!!",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Exactly! If the kid's confused about who his dad is, it's probably because OP's mom tells the child that she's their grandparent",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Exactly.  And mom obviously gives zero fucks that her son was lied to, cheated on, and had his own heart broken by having to come to terms with the fact that the kid wasn't his.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "NTA - I also awarded the wrong post, lol",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2623,
              "content": "He was 7 months when OP left so it’s not like he would remember... his mom and OP’s mom really did him a disservice by not dropping the shenanigans when OP left.",
              "id": 20,
              "comments": [
                {
                  "score": 1331,
                  "content": "So so true. They could have easily avoided this by not lying to him about who his dad is. It sucks that his actual dad is a loser, but it is not OP's job to be substitute baby daddy. Especially when that would mean having to potentially interact with someone who intentionally betrayed and hurt him.\n\nEdit: I like the suggestion someone else made that the kid's mom and OP's mom could have easily explained the photos by saying OP was the kid's uncle or a family friend, which would have explained the photos without setting up this kid for a lifetime of therapy needs.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 994,
                      "content": "Or....just get rid of the fucking photos.  Why keep them, other than to weaponize them against OP in an insane attempt to get him back in their lives?  Despicable.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 96,
                      "content": "The worst thing is: OP gets to be a dad to ex's kid for as long as he gets in line and follow her orders. Moment he would tell truth (that in the end would came out by some random blood or DNA test) or had diffrent parenting idea ex would take kid back or ignore his idea, so in the end he is just an uncle unless she somehow wants op to gain father's rights.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 434,
                  "content": "But the poor thing thinks op is his dad because of the few pictures of them together when he was a few months old. Sounds like ex and ops mom are feeding this poor child lies.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 471,
                      "content": "Yep cause now the story isn't \"OP please help raise this random kid\" its become \"OP your the only father this kid knows, how could you just turn your back on it\" \n\nThey're fucking up this kids life because grandma wants their \"first\" grandchild and cheater wants the stable baby daddy.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 354,
                  "content": ">she just felt really bad because his real dad doesn’t want to be involved. And they still have pictures of me and him from when he was a baby so he still thinks he’s my kid\n\nYeah this is horrifying. It's so cruel to make that poor kid believe a man who's not his father and doesn't want anything to do with him is his dad - the kid wouldn't have come to that conclusion on their own by just seeing a photo of OP with some baby, they've actively been showing him the pictures and telling him that's you and your dad. \n\nOP's mom and the kid's mom are fucked in the head and AHs. This is going to cause so much unnecessary pain for the child. Well I hope their mom is happy, she chose the woman who cheated on her son and her child with someone else over her own son and own grandchild",
                  "id": 26,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yeah for the last year my middle daughter assumes every picture of a baby is her baby sister because baby=baby sister. And at 5 my oldest was about the same when my middle was born unless the baby looked drastically different than her sister. Kids wont just assume a baby is them, they generally need to be told it is and even then a lot dont believe it lmao",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 97,
                  "content": "Yeah what if OP steps up and then the ex demands child support because he’s acting like kids father.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 77,
                      "content": "It's even worse than that.\n\nHe would be on the hook for child support and be the kids defacto father. But only up until the mother doesn't want to play that game anymore.\n\nAs soon as she meets someone new he could be thrown out of the picture once again with no parental rights but still being on the financial hook.",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "This is exactly why I hate OPs mother in this instance. Her and the childs mom royally screwed this kid out of any chance of successfully coping with an absent father, and set him up for this nonsense drama.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Yup.  \"Grandma\" could have still been part of the child's life without them lying to the child.  They're being abusive by this continued lie.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 369,
              "content": "Especially with the age of the child when OP found out OP didn’t do anything wrong either- this kids pain  is 100% on the ex and OPs mom.\n\n\nEdit to add: didn’t read all comments so sorry for redundancy but yeah what everybody else is saying.",
              "id": 32,
              "comments": [
                {
                  "score": 265,
                  "content": "At seven months that baby was barely past the stage where he’d forget someone existed if they went into another room.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Ehh they remember faces and stuff but not like \"this is mum\" or \"this is dad\" more like \"the one who interacts with me\".\n\nIt was weird I went from like toddler years with my mum, she lost custody until I was a teenager. I literally couldn't draw a picture of her I'd forgotten.\n\nBut she walked in that room 10 years later and I knew who she was.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 282,
              "content": "Yeah OP has been out of his life since he was a baby. If ex and OP'S mom had left things alone, he wouldn't even remember OP. He would just be a kid with a single parent, like lots of kids are. Ex and OP Mom are fucking with this kid's head in an attempt to emotionally blackmail OP. That is so many kinds of wrong. Ex and OP Mom are TA here.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 154,
              "content": "Right that poor kid has been lied too and to see the man his mom and \"grandma\"  have told him is his dad, yell and reject him like that with so much animosity is so heart breaking.  They are doing that kid a great disservice.",
              "id": 36,
              "comments": [
                {
                  "score": 535,
                  "content": "My heart broke for that child. OPs mum and ex have been lying to the poor boy. \n\nI'm guessing he was told you're going to see your dad and baby brother today. Imagine that. You're told you're finally going to meet your dad and brother only to turn up and that to go down.\n\nI can only imagine what emotions that little boy had and the damage those women are doing to him. It's not a disservice it's emotional abuse.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Wow this hit hard.. I'm sure you're right and hearing that angle makes my heart hurt for that little boy",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 97,
              "content": "Not only that. It’s such a shame that OP’s child now does not get to have a grandma, and is born into this fractured family.",
              "id": 39,
              "comments": [
                {
                  "score": 295,
                  "content": "eh, it's not actually important to have a blood-related grandmother. What's important is that the people in your child's life love them and treat them with respect. No grandmother is waaaaay better than a shitty grandmother. And usually when there is this kind of \"fractured\" family, the spaces are filled with chosen family who fill those generational roles.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 53,
                      "content": "Agreed, my family only includes people there by choice, blood or not. While I’m thankful for the ones I have and the ones that love. I wish I could have avoided the dysfunctional fallout and emotional blackmail that comes when a tense family becomes fractured. At least as a child.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "That kid should have no idea who OP is if OPs ex and Mom had a single bit of sense between them.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "That poor kid is going to be so hurt and confused when he realizes exactly what is going on. OP, you’re NTA, but your mother 100% is.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "My heart is also broken for that kid.  His mom will end up causing many issues by trying to pass OP off as his father.  I can’t believe this guys mom did this to him, on his sons birthday!!",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "He thinks his father doesn’t want him. Jesus. Can you imagine waiting outside, you’re going to meet your dad for basically the first time, and the adults are yelling saying you and your grandmother can’t come inside? Everyone else is having a great time at your brother’s birthday, but you’re completely unwanted.",
              "id": 45,
              "comments": [
                {
                  "score": 5,
                  "content": "It's just so awful. I can't even quite put into words my feelings about OP's mom here. It's so heartbreaking.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "That poor boy, that’s really awful. I hope he can get therapy if he needs that and that he can actually get past this and grow up mentally healthy and understand why all  of that happened.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 992,
          "content": "NTA. The only way that kid thinks he's yours, is if his mother and maybe yours is telling him that. Not your kid, not your problem.",
          "id": 48,
          "comments": [
            {
              "score": 343,
              "content": "For real, when I was a baby my parents passed me around to their friends like I was a prized hot potato. There are so many photos of random adults holding me...I'd never assume I was related to them, lol.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 246,
              "content": "For real, they could have said he was an uncle or a family friend. NTA.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 753,
          "content": "Omg, my heart broke for that kid at this part “And they still have pictures of me and him from when he was a baby so he still thinks he’s my kid.” this right here means OP’s mom has been choosing to bolster this fantasy that OP is the dad to this child. There is no reason for a baby who left when he was seven months old to think this unless he’s been told it repeatedly. So now instead of this kid growing up with no concept of OP being anything other than an ex of his mom’s, the kid thinks OP is his father who has abandoned him. If OP’s mom wanted to be in his life, fine. But acting as a grandma while maintaining a lie that OP is his dad is monstrous.",
          "id": 51,
          "comments": [
            {
              "score": 268,
              "content": "That's what i thought too, my heart breaks for the kid because of how selfish OP's mum is for doing that to the kid and also to the ex for cheating plus maintaining this lie. At some point that kid will confront OP and learn the truth in the most painful way",
              "id": 52,
              "comments": [
                {
                  "score": 322,
                  "content": "I can actually imagine OPs mum told the child he would be meeting his “daddy and little brother” that day, how traumatic would it be to think that then be turned away? OPs mum is setting that child up for a world of hurt",
                  "id": 53,
                  "comments": [
                    {
                      "score": 157,
                      "content": "Definitely! Also imagine the conversation on the car ride home? I can't see that being the truthful conversation the child deserves",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I know, that poor little baby, probably exited to finally be at the party with his “dad” and then getting rejected. And it’s all over a cruel and pointless lie!",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 183,
              "content": "That mom is such a vile nasty ass person.  Obviously she’s been dumping the little boy off on OP’s mom (who’s a disgusting piece of work too) under the “grandma” premise.   Who lets their 5 yo go with just anyone?  Somebody who needs a babysitter and who’s trying to make a situation into something it’s not.  Of course NTA.",
              "id": 56,
              "comments": [
                {
                  "score": 5,
                  "content": "This is where I was going! The ex is just letting the not grandma take her kid places. This is f'd.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Exactly and with COVID?  She’s BEEN doing this shit",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": "Yup, if anybody should do it it would be grandma. \n\nI will be honest, reading this I thought it was extreme to cut his mum off because she wanted contact with the kid. She could do visits and be a part of the baby's life without involving him and there is no problem there. But learning about her other actions it feels like it's less about her having contact and more about her trying to force contact with OP.",
              "id": 59,
              "comments": [
                {
                  "score": 37,
                  "content": "> She could do visits and be a part of the baby's life without involving him and there is no problem there. \n\nI agree with this. His mother spent 7 months bonding with the baby thinking he was her grandson, it can be hard to just switch those feelings off. But she was definitely very stupid and irresponsible to just spring the kid on OP, especially as that would be so upsetting for the kid.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 9,
                      "content": "It’s a question of choice. OP’s mother seems to think she’s entitled to her choice but OP isn’t, even though OP is closer to the matter (as the person directly cheated on).",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 678,
          "content": "I understand how that kid feels. My \"dad\" left when I was 1. I cried and prayed all the time for him to come home because my mom was always talking him up and making him out to be so amazing and telling me how much he loved me. In my child's mind, I believed that if he came home, everything would be better. We wouldn't be so poor and I wouldn't be abused anymore. \n\n\nWhen I was 26, I learned the truth. He wasn't my dad and he always knew it. He was a 19 year old kid who my mother talked until playing daddy. When he left, he wasn't abandoning his child. \n\n\nMy actual father didn't know I existed. My mother never told him. She wouldn't tell me who he was. I found him a year and a half ago with an ancestry DNA test. He's thrilled that I exist. His whole family is. \n\n\nLying to a kid like that is fucked up. It's selfish. Don't let the kid believe that some random man is his father and that he chose his new kid over him. It's not right. The child deserves the truth.",
          "id": 62,
          "comments": [
            {
              "score": 112,
              "content": "[removed]",
              "id": 63,
              "comments": [
                {
                  "score": 228,
                  "content": "Still, the kid doesn't deserve to believe that his dad rejected him right in front of him or believe that his dad wants his new baby but not him.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 49,
                      "content": "You're right, the kid doesn't deserve that. But OP has not been involved in this kid's life since he was 7 months old. The child would have had no real memory of OP. But the ex and OP's mum, have spent the past 4 years lying to this child to the point that, they either need to own up and tell the kid the truth, instead they have tried to manipulate OP into taking on this child! \n\nThey knew what they were doing and were determined to force this child onto someone. If someone turned up at my door and said, we've  told this kid your it's mum for the past 4 years so, here ye go! I'd be fuming and do the same as OP.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "By only one father figure, OP was never his real father, in fact he was a victim of paternity fraud and deceived into a lie, even adoptive parents choose to adopt while OP was lied to the whole way through.",
                  "id": 66,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 54,
                  "content": "I wouldn't be surprised if the bio father doesn't know and either his ex is lying to his mother or his mother lied to the OP in an attempt to guilt trip him into accepting the child as his. A person who would lie to a child about who their father is, put them in a situation where they will be painfully rejected by their \"father\" and do to their son what the OP's mother did to him can't be trusted to be truthful. I pray for that poor little boy that is the case.\n\nNTA OP, your mother and ex girlfriend are TA.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 13,
                      "content": "This is exactly my thought. The only way we know that bio dad rejected the kid is the word of two blatant liars\n\nOh, and NTA",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "According to OP’s Mom. Who really knows? The ex may not even be sure who the father is and it’s easier to say the father doesn’t want to be involved.",
                  "id": 69,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 148,
          "content": "I am once again asking what the F\\*CK is up with people so obssessed with being a grandmother to this unhealthy degree.",
          "id": 70,
          "comments": [
            {
              "score": 92,
              "content": "What is even worse, is that she has lost access to her actual grand child. Bizarre behavior.",
              "id": 71,
              "comments": [
                {
                  "score": 16,
                  "content": "I’d get it if she still wanted to be in the first kid’s life. She was attached, and it didn’t go away when she found out they weren’t related. She feels that’s her grandchild. That’s fine. If the mom’s okay with it, they should be able to work something out. The rest of it is yikes though.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Yeah, I agree I get that part, but the rest of it.....",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 93,
          "content": "That poor kid honestly, like wtf was mom thinking. It's way worse for the kid that she tries to force a relationship with someone who doesn't want one, putting him through that. Would be much easier to just grow up not knowing.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "She absolutely is, yeah. Not to mention, really really dumb to try that.\n\nWho thinks this is a good idea? How could she not see how this would blow up in her face? It's basically the first meeting after being NC for years, and she springs this on OP? At his son's birthday party? It would be hilarious if it weren't so tragic for the poor kid.\n\nI feel sorry for him, and I'm really angry at his mom and OP's mom for continuing to dangle this \"potential father\" in front of him like a carrot he'll never reach.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "OP and that poor kid are NTA.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "My thoughts exactly!",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Yeah, they are totally making it worse. At 7 months old there's no way that kid would have even remembered OP, but now they've got it in his head that OP is his deadbeat dad when that's not true.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8919,
      "content": "That poor kid. Why has no one explained to him you’re not his father?",
      "id": 79,
      "comments": [
        {
          "score": 6245,
          "content": "[deleted]",
          "id": 80,
          "comments": [
            {
              "score": 4304,
              "content": "> That is so cruel. This poor boy thinks there is this father out there who just doesn't want to be his dad.\n\nI mean there is, it's just not OP.\n\nIf ex wants her kid to have his dad in his life, she needs to take that up with the actual father.",
              "id": 81,
              "comments": [
                {
                  "score": 2436,
                  "content": "[removed]",
                  "id": 82,
                  "comments": [
                    {
                      "score": 914,
                      "content": "Believe it or not, OP is actually one of the few lucky ones when it comes to victims of paternity fraud.     \nMost end up losing almost all of their friends and family, have to pay child support and are called monsters by society, it's super sad.      \n      \nOP and his exes child are the big victims here but OP's mother is another one of the horrible people that blame the victims of paternity fraud.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 107,
                      "content": "They're trying to pull a 100% succesful cuckoo childhood. Trying to put an egg in another birds' nest, now they just need to hope their kid is smart enough to drop the other eggs off the nest.\n\n\nNTA. Who the fuck in their right mind would accept this, ever? The child is not yours, it was conceived through cheating and it has an irresponsible dick of a father who impregnated someone's wife and then ran off - it has no place in your life and you have no place in its life.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "NTA-The ex wants OP back. It's the only reason she has told her kids this. I mean either way the bio father or OP hasn't had anything to do with the kid in 5 years so it can't be for the benefit of the child. It's the exs last string she is trying to hold in to OP even though he cut the other end a long time ago. \nHis mom could have been in the kids life without acting like OP is the dad. They hurt that kid more then necessary for their own feelings hoping it would all work out.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 199,
              "content": "This this this. Allowing this lie to continue hurts the child. He would not have remembered him otherwise.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "I mean, this is true apparently.... its just not OP. Poor kid.",
              "id": 87,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 49,
              "content": "Yeah poor kid. Imagine explaining “no it’s not so much that I don’t want to be your father, I’m not your father. But your real father is out there and he doesn’t want to be your father”\n\nWhich to him ends up being that no one wants to be his father..",
              "id": 88,
              "comments": [
                {
                  "score": 14,
                  "content": "Honestly, it'd fit in with a supervillain backstory, that's how fucked up it is. These two women are the worst possible influences for the kid.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "> This poor boy thinks there is this father out there who just doesn't want to be his dad.  \n\nWell... there actually is. It's just not OP.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Actual monsters: \"Yo we don't have anything to do with these creatures. Even we have standarts for Satan's sake!\"",
              "id": 91,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "> This poor boy thinks there is this father out there who just doesn't want to be his dad.\n\nThat's what enrages me, too. They are such assholes.\n\nI am all for supporting kids, biological or not, but this is not the way it works.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "There is a father out there who doesn’t want to be his dad. It’s his bio dad. OP is being made the bad guy when the kid’s bio dad is really the loser (along with the mom and grandmom) in this story.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 264,
          "content": "I think Grandma is the one telling the boy that OP is his dad.",
          "id": 94,
          "comments": [
            {
              "score": 206,
              "content": "The problem is that OPs mom is holding onto a delusion that she is actually the Grandma.",
              "id": 95,
              "comments": [
                {
                  "score": 89,
                  "content": "She held onto that delusion but now she IS grandma to the kid. They might not be biologically related but by perpetuating this lie for 5 years... the kid believes she is grandma and OP his dad.\n\nIt’s super sad and really cruel what the ex and mother have done to this child knowing full well OP isn’t the father.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I agree.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I think that would be okay, since both the kid, the mom and the grandma want this relationship. The problem is that she should represent this as sort of an adoptive relationship, but instead, at least helps perpetuate the story that OP is the kid's dad. \n\nIt would be possible to keep her relationship with the kid as separate from her relationship with OP, but I understand how it would be heartbreaking. He has made her choose, since she is unable to choose both. If OP were more accommodating of her feelings and set his boundaries a little differently, AND grandma would get some therapy, a more cohesive and supportive family could be possible. But OP also needs therapy, since his reactions are pretty strong here. Cheating is traumatic, and he has not processed that trauma through.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I really don’t understand the logic of a woman (who is ALSO not actually related to the kid) thinking that a man who’s *not* his dad (and doesn’t want to be) is a better choice than the man who *is* his dad (and doesn’t want to be.) And the kid’s mom just going long with it??!! \n\nLike, in what universe is begging a (functionally) random stranger to play daddy to this kid better than either a) begging his *actual* dad or b) raising him completely without a father figure? \n\nThat poor poor kid. \n\nAnd NTA OP. Your mom lives in Crazytown Bananapants.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 82,
          "content": "they keep showing that poor kid OPs photo and dangling a possible relationship in front of him \"OPs' your daddy, here look at a picture of your father\" - full on knowing OP's ex cheated \n\nholy shit that kid is going to need some therapy",
          "id": 100,
          "comments": [
            {
              "score": 27,
              "content": "And now that kid got to watch from a car window as his “daddy” rejected him. Grandma is awful and doing so so much more harm than good to that kid. I feel for both OP and the kid.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Can you imagine when this kid is older and he finds out he's been lied to his whole life? I would bet money this kid is going to contact OP in the future asking why he was never around, and there's no nice way to drop that bomb. The grandmother and mom are terrible people and it's going to be so much worse **when** he finds out, because he will. \"His real dad doesn't want to be involved so we're telling him you're his dad.... who doesn't want to be involved.\" *How is that better???* \nI feel so awful for this child!",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "It is nonsensical! Kid already has an actual biological father who doesn’t want to be involved. And instead of just single parenting it out (which works great for many people!), they then pretend this other guy is his dad who also doesn’t want to be involved because he’s not his dad! And mom cheated and he’s the product of the cheating! Like what is wrong with these people.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4562,
      "content": "NTA- you found out when the baby was seven months old so no way the baby actually remembers you being around. If this child had been older and able to understand I would maybe have different feelings but I think it was best to cut it off right away if you weren’t his father. Your mom sucks for not respecting your wishes, and bombarding your sons first birthday.",
      "id": 104,
      "comments": [
        {
          "score": 1187,
          "content": "Yeah my opinion would definitely be different if the child were much older when OP found out it's not his kid, and they already had an established father/son relationship.  But at 7 months old, I think OP did the right thing to walk away and he had every right to assume the kid would not be lied to his whole life.  I still feel AWFUL for this kid because his mom and OP's mom are NOT doing him any favors by lying to him. However I can't blame OP for that.  This whole situation just sucks.  Poor kid.",
          "id": 105,
          "comments": [
            {
              "score": 362,
              "content": "I do feel it’s likely too that the mom and grandmother have been telling him all about his dad and showing him photos from when he was a baby. It’s so manipulative, it’d be far too toxic to allow these relationships to be around in any form. They made the mess, OP shouldn’t be there to clean it up",
              "id": 106,
              "comments": [
                {
                  "score": 85,
                  "content": ">and showing him photos from when he was a baby.\n\nAnd possibly showing him pictures of \"his new baby brother\" with OP too, making it even worse because then the kid is also going to think \"dad doesn't want me but is happy with his new baby and family.\"   \nOP's mom and ex are really messing this kid up, I feel bad for him.",
                  "id": 107,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I don’t understand what the ex and OP’s mom think is going to happen when this kid grows up and tries to confront OP himself, only to be greeted with DNA proof that they are not related and to find out that grandma and mom knew this the whole time and had been lying to him. \n\nThis poor kid. \n\nNTA, OP.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 87,
              "content": "It’s sad how many of similar stories are out there just like op. All ranging from different ages and stages of their lives. Paternity should be a requirement no matter what because this is just so unfair to the children and the men.",
              "id": 109,
              "comments": [
                {
                  "score": 98,
                  "content": "I think the problem with this idea (and I am NOT justifying cheating on your partner or lying about who the father is) is that it would enviably end up with women and possibly babies being killed. People are assholes. Just as there are many women who have cheated on their partner there are many men who are abusive and would react extremely badly to finding out they have been cheated on. When i was pregnant and giving the family history's of illnesses to the midwife she took me out the room for something and asked me if there was any other possible father's so they can have there history too but would not tell my husband (he was the father, they ask everyone this). In the women's bathroom there was also small stickers you could take and attach to the bottom of your cup of water if you are being abused and need them to make up an excuse to talk to you private. All this to say, pregnant women are particularly vulnerable to domestic abuse and we have to consider what potential consequences there could be with routinely checking paternity.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 32,
                      "content": "So to avoid *possible* abuse againsy a lying cheating mother actively seeking to ruin a man's whole life you want to lock in that *actual* abuse of the innocent man?",
                      "id": 111,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "What point are you making?\n\nAre you saying men shouldn’t have a right to a paternity test?\n\nAre you saying a man shouldn’t be informed if the child isn’t his?",
                      "id": 112,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "By the same logic, if I see a thief picking someone’s pocket I shouldn’t warn them because they might hurt the criminal? \nThis line of reasoning makes no sense.",
                      "id": 113,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "What if no one cheated? Just don't cheat. Easy peasy. Pretty dumb move to cheat if youre gonna caught for sure after all.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "So because the victim might not respond well we should protect the perpetrator? This is insane.",
                      "id": 115,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": "Careful, this sub doesn't like victims of paternity fraud and believes all comments like yours mean you are accusing all women of lying when in reality mandatory paternity would mean nobody is accusing anybody of lying and it also prevents paternity fraud and protects children.",
                  "id": 116,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Yeah Im surprised at the downvotes thats getting. I think itll be easier to have perturnity test. \n\nIm saying this because, for OP it saved him a lof of pain. It isnt like that for everyone but it was best for OP.\n\nMen and women cheat but when theres babies invloved the truth should be known. This was a good choice for OP",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Truth",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Yeah the ex and mom just want to see the kid suffer by thinking this guy out here is his father and is being negligent and op is being painted out as being a terrible father",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Yep, and this means that people have been actively telling him the man in the photos is his dad. Or at least letting him think it is.  Poor kid :-(\n\nOP's ex is absolutely TA for letting this go on for over 4 years, and his mother is TA for a) lying about how she's not in contact with the ex and b) pulling this stunt and putting OP *and* the kid in a horrible situation.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "He doesn’t remember. He said his mom has pictures of them when he was a baby..so that means she has shown this child pictures of OP and the kid and lied to him that that’s his real father. I get he is young and wouldn’t understand the truth, but she created this problem by not just telling him “that’s your dad” instead of the truth “that’s my son, he dated your mom when you were a baby” \n\nOP..i know you want no contact..but when this kid is old enough, you’re gunna have to talk to him yourself. Otherwise, being up to your ex and mother, you may get a 20 year old on your doorstep asking why you abandoned him. Ex is going to put the hurt and blame of him having no father on your shoulders. It’s disgusting but it’s extremely likely.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2617,
      "content": "NTA. You made your feelings clear, your mother showed no respect for them.\n\nCut her out completely, or at the very least refuse to give her alone time with your son. She absolutely will do this behind your back if she can.",
      "id": 122,
      "comments": [
        {
          "score": 1706,
          "content": "Didn’t want it to get to that because I genuinely wanted my son to know his grandma but yeah I think it’s not gonna work.",
          "id": 123,
          "comments": [
            {
              "score": 1272,
              "content": "I would bet money she would Introduce your son to the five-year-old as “his brother”",
              "id": 124,
              "comments": [
                {
                  "score": 497,
                  "content": "Yeah exactly lol, lady acts like she cares so much bc “family” but throws her son away like giving away a pet when it gets too big & moving on to a smaller, cuter one",
                  "id": 125,
                  "comments": [
                    {
                      "score": 260,
                      "content": "It’s crazy, she’s essentially alienated and lost her son and now her new grandchild, all over a grandchild that isn’t actually even her sons baby and is just his cheating girlfriends baby from a random hookup. Le what??",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 390,
              "content": "I have to agree with Brianblaz.  I'd go hard NC with your mother because you simply can not trust her to go behind your back and lie.  She has an appalling lack of judgment and is totally eating the boohoo story your ex is cooking for her.",
              "id": 127,
              "comments": [
                {
                  "score": 573,
                  "content": "I’ve talked with my girlfriend about it and we’re agreeing on going NC with her from here on out. Even if she does try to earn trust back it’ll always be on the back of my mind wondering if she’ll try to pull something like this in the future again. I’d rather not risk it",
                  "id": 128,
                  "comments": [
                    {
                      "score": 421,
                      "content": "[deleted]",
                      "id": 129,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "All my grandparents were dead by the time I was born.\n\nIt'a not so horrible and traumatizing to not be raised with a grandparent.\n\nKids need primary guardians to be their rock and love them. Extended family members are just a bonus but not something they will be emotionally damaged for not having.",
                      "id": 130,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 134,
              "content": "Tell her she chose her grandson, but it wasnt *your* son.\nPlease let her know how much she is going to damage that poor boy if she continues to tell him that you are related to him. When he is old enough, he *will* come find you and you are going to have to brutally honest about the lies he has been told. Offer him a paternity test, unless you still have the results from the first one. Tell him that you left when he was a baby to spare him from the pain that his mother, and yours, decided to inflict on him anyway.\n\nI wouldn't want her around your son either, she will, at some point, tell him about 'the brother daddy doesnt want you to know about'.",
              "id": 131,
              "comments": [
                {
                  "score": 13,
                  "content": "Yes! I have had to be the brutally honest one to a 15 year old that had been through a similar experience. For 15 years my husband’s ex girlfriend and unwittingly her family perpetuated a lie that my husband was the father to this poor girl. Compounding the problem was that he could have been the father, but the mother refused to take a paternity test from day one. When we married I was aware that one day this poor kid was going to start asking questions and find us, and she did. Test showed he wasn’t dad, and I had to tell her that her mother had been rumored to have had sex with at least 6 other people during the month she was probably conceived. I talked to that poor girl once a week for months while she processed that her mother had lied for so long. She finally found her dad from the list of men I gave her, but I still don’t think they have a relationship. I almost hoped she turned out to me my husbands child, just so we could offer her some stability, but I can’t imagine dealing with her whack job of a mother for the rest of my life.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 121,
              "content": "YOU'RE THE FATHER OF 2 KIDS!!! Are you not? Bc this is still what your mother and ex tell everyone and this 5y kids. Do not go near her if you want some sanity. NTA",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 88,
              "content": "No, it isn’t going to work and if you keep in contact it will be so much worse on the family you are creating, you, and the kid. While a lot of people are worried about the child (which I am too) I’m concerned about you too. You did the right thing making her leave and I’m sorry it happened on such a special occasion. Too many men get pushed into bad situations by using children as weapons against them.\n\nOne day this child will grow up and may contact you. It might help if after you calm down you come up with a plan for that day. Also consider other “surprises” these people may try to pull and plan accordingly.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 87,
              "content": "NTA. If you ever do want to mend the fences with her, supervised visits only.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 71,
              "content": "NTA for sure and yeah, don't ever give her unsupervised access to your son.",
              "id": 136,
              "comments": [
                {
                  "score": 5,
                  "content": "I wouldn't be giving supervised access itself to begin with.",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "But she's not his Grandma if you aren't his dad...",
              "id": 138,
              "comments": [
                {
                  "score": 63,
                  "content": "There are the family we choose, and the family we are born with...  \nShe can choose to be the adoptive grandmother, in the culture I grew up in, grandma's love the Mokopuna, no matter who the parents are. I got a chance to watch that numerous times as an old grandmother would bring her Mokopuna to the church I went to growing up, and watch as she smiled to see happy and healthy young children playing... and she would have absolutely spoiled every single one there.  \n\n\nThere was no need for her to pull the stunt she did, just to be a grandmother.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I'm a Whangai baby raised by my Nan and Pop. They love all of the Mokopuna. I love them so much, I feel this.",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "She wants to play grandma. You know how some people claim “aunty” status when there is no relation at all? Yeah, that. It’s kinda messed up because the little boy probably calls her grandma when she isn’t grandma.",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Unbelievable that folks are harping about *you* “disrespecting” *her*.",
              "id": 142,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "She also only wanted to reconnect with you when you had a kid. She didn’t even care to have a relationship beforehand",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1879,
      "content": "NTA.\n\nHer intentions were not good. She was so swept up in being a grandma that she chose to basically adopt your ex’s son and remove you from her life as a result.\n\nAfter deceiving you about maintaining contact she tried to sabotage your son’s first birthday party by bringing him there. I have no doubt that her thinking was it would be too awkward for anyone to kick her out and they would all “fall in love with the cute kid”.\n\nBe aware that this isn’t over. If she has been showing this kid pictures of you and claiming that you are his father, getting kicked out of one party and cut off *again* isn’t going to stop this scheme. \n\nBe prepared for this kid to try and get in touch with you when he is older wanting to know why you “abandoned” him.\n\nI feel the worst for him in all this. Your mom is making his already unfortunate situation so much worse.",
      "id": 144,
      "comments": [
        {
          "score": 851,
          "content": "The ex is a monster for letting this go on.",
          "id": 145,
          "comments": [
            {
              "score": 530,
              "content": "So is his mother",
              "id": 146,
              "comments": [
                {
                  "score": 239,
                  "content": "Yeah, they can both keep claiming it's for the ex's son but they're lying to themselves. They're desperatily doing this to maintain the vision of the future they imagined and they think that they can make it come true if they manipulate everyone hard enough. Meanwhile in reality they're just setting the poor boy up for even more massive trauma when he eventually realizes that he's been lied to all his life.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 35,
                      "content": "She could have easily played the role of grandmother to the kid without lying to the kid about it. Be the support the kid needs. But the lies will only hurt the kid.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "That kid is going to be so screwed up mentally. One day he will learn the truth and his whole world will shatter. I feel bad for him, he’s innocent in all this. The ex and “grandma” though - I can’t wrap my head around what they hope to gain with this lie.",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "What's crazy is the mother and the ex are contacting each other regularly",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I agree. Both and ex and mother are horrible for lying to this kid about OP being the father. It’s only going to create more issues for the little guy, and they’re putting OP and little guy in a horrible position. I don’t understand why they would even want to lie.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 241,
          "content": "Yup—she’s not thinking of the boy. She’s thinking about her own feelings thinking about the boy. \n\nThe most hurtful thing for a child is to not be wanted. She dragged that poor child to OP’s home and shoved that in that child’s face, all to manipulate OP and everyone at the party. And it worked, with some of them. Doesn’t change that child was hurt by her actions. You can’t tell me that boy heard nothing in the car.",
          "id": 152,
          "comments": [
            {
              "score": 3,
              "content": "> The most hurtful thing for a child is to not be wanted.\n\nAbsolutely. This is why it's so horrifying she's put this boy in a position to be rejected a second (or third, if you count OP leaving in the first place) time by a potential father figure.\n\nI don't blame OP here. He left early enough it wasn't a painful, lingering separation between child and man. But his mom is a *huge* AH for playing these games with a little boy's heart. So is the ex for letting it happen.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 223,
          "content": "I wonder if OP could send a Ceist and desist for pretending op was the father.",
          "id": 154,
          "comments": [
            {
              "score": 132,
              "content": "I'm pretty sure he can- a paternity test was done.      This is just harassment.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Not sure if he can send a cease and desist but maybe a restraining order??",
              "id": 156,
              "comments": [
                {
                  "score": 2,
                  "content": "Wouldn’t he have to prove that she’s a threat to him?",
                  "id": 157,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "If she’s telling her child that in her own home I doubt a cease and desist letter can do much.",
              "id": 158,
              "comments": [
                {
                  "score": 2,
                  "content": "It could scare the crap out of her",
                  "id": 159,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Unless she’s smart enough to know that those letters are basically meaningless.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 194,
          "content": "I agree with you 100%. I hope OP kept the paternity results so that he can show the kid when he is older and tries to confront OP.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 123,
          "content": ">Be prepared for this kid to try and get in touch with you when he is older wanting to know why you “abandoned” him.\n\nEek.... NTA in this situation OP, but if you want to save this poor kid years of therapy and heartache, maybe figure out a way to let the kid know that you really aren't his dad? It shouldn't be your job to do this, but if the kid's mom / pseudo grandma are genuinely leading the kid astray, the kindest thing to do for the kid is try to get the truth across.",
          "id": 162,
          "comments": [
            {
              "score": 27,
              "content": "Yes, absolutely this! Say you want to meet up with him or write him a letter or something (could be hard since the asshole women in his life may read though it and prevent it...)",
              "id": 163,
              "comments": [
                {
                  "score": 30,
                  "content": "Call CPS? Cause it's psychological abuse the lies they are feeding him.",
                  "id": 164,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "Excellent points, this isn't over and it's going to keep hurting the child and OP for a long time if something doesn't change. I'm wondering if OP has any legal options to enforce with his mom and ex that they cannot involve him in this child's life or continue lying to the child about his parentage? There my not be any options, I truly don't know, but it just seems so detrimental for this to continue.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I agree, poor kid! The kids mom as well as OP's mom are both really wrong in trying to maintain the lie of paternity. This is very damaging to that poor little boy. \n\nShe can be a surrogate grandma all she wants, but she shouldn't lie to him or push him on OP.\n\nNTA. Poor kid had to witness his \"father\" argue and kick them out of the party. He must be so heartbroken...\n\nOP's mom is a giant ahole for putting the poor kid in this situation. She should be thinking of the well being of the boy and not of making lies into false truths.",
          "id": 166,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Literally what was her plan? \"Hey Timmy were going to go to your dad's for your little brothers birthday ! By the way this is the same dad that wants to have nothing to do with you but started a new life with his new family\"\n\nLike can you imagine how overwhelming it would be for that little dude to go into a house filled with the family that rejected him ? *Her intentions were not good*",
          "id": 167,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 756,
      "content": "Fuck no. NTA at all. Your mother walked all over your bounderies and tried to bring your ex's son to your son's birthday. And also, she's really not helping that boy by telling him you're his father. That poor kid will grow up believing a lie. I know that this sub always go for the no contact option all the time, but in this case I wolud recomend that or a low contact situation.",
      "id": 168,
      "comments": [
        {
          "score": 279,
          "content": "I don’t think there’s enough attention paid to the fact she brought this kid to OP’s son’s first bday party-a milestone birthday where attention should be solely on OP’s first child.  The attention stealing move OP’s mom tried to pull here is unbelievable.  I get that she loves this kid she once thought was her grandkid but what of her ACTUAL first grandkid?   She’s so focused on this other kid that she doesn’t seem to give attention to OP’s child.  The disrespect to OP and his son is awful.",
          "id": 169,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 409,
      "content": "NTA - you're mother is making this child's life more confusing.  From the sounds of it you broke up with ex and left the child at such an early age he wouldn't even remember you.  Your mother needs therapy - this is not her grandson and she is ruining the potential relationship she would have with her actual grandson.",
      "id": 170,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 328,
      "content": "NTA.  Too bad for your mother that she decided to trick with a boy that is not your son and now loses contact with her biological grandson.",
      "id": 171,
      "comments": [
        {
          "score": 144,
          "content": "That's what I don't get.  She's choosing an absolute stranger over two relatives.",
          "id": 172,
          "comments": [
            {
              "score": 86,
              "content": "Because she has control over ex and can play mommy to not-his-child.  Where as mom would have to stay in her land and wouldn’t have any control over her real grandchild and that would destroy her illusion of having a do-over baby.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 242,
      "content": "NTA she's making a mess. That kid thinks you're the dad who doesn't want anything to do with him. Granted, you could've handled it better, but I completely understand blowing up when something like this is revealed.",
      "id": 174,
      "comments": [
        {
          "score": 8,
          "content": "I understand how OP’s emotions must have been running high. I can’t imagine how painful it was for him to spent 16 months thinking he had a child and then learning that he didn’t. I would probably lose my cool a bit if my mom kept reopening that wound years after the fact.",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Well he is better, trust me if I was in the position I would let the kid hear my argument between my mom then went to him to tell him straight that I am not his father, his mom cheated on me that is why I left and now she lied to him. Then I be the AH.",
          "id": 176,
          "comments": [
            {
              "score": 2,
              "content": "LoL, yeah I definitely don't know if I would have done any better.",
              "id": 177,
              "comments": [
                {
                  "score": 2,
                  "content": "Haha, maybe it was just me cause I am emotional but yeah that kid should know the truth, the longer they lied, many problem will arises, kid grow up being lied to about his father, developing ptsd is for sure.",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 227,
      "content": "NTA.  It is literally not your kid.  How could you possibly have any obligation to raise your ex's kid?  If you mom cannot accept that it is not your kid and that you want no parts of that, then she can stay out.",
      "id": 179,
      "comments": [
        {
          "score": 48,
          "content": "Right? He was 7 months old when everything came to light about his paternity. Op’s family should’ve had his back no matter his decision on the matter. They’re not only hurting op, but the kid as well! It would’ve been easier to just cut ties right away. Not expect op to just be okay with this!",
          "id": 180,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}