{
  "post content": "Would I be the a-hole if I didn't want to participate in donating the equivalent of 5-10 $, each time coworker has a birthday?\n\nFor context, I ( 31M) got hired 3 weeks ago in this firm with around a hundred employees in my department, and ever since I have been asked to donate money for six colleagues. I barely know those people, so to me it simply does not make sense to chip in for basically strangers!\n\nThe environment there is your typical \"we're a family\" environment and they will surely think I am not a team player, and start treating me like an asshole, they believe that five to ten dollars is not a big amount.\n\n\n\n\n\nEvery time there is someone's birthday, or someone is having a baby, or it's women's day,  there is usually food and drinks. I am okay with not indulging from now on in whatever they bring, especially since I don't want to eat unhealthy food and I usually go to work with my own food. But I think they will feel that they don't have a guarantee I am not going to do that since the food and drinks are going to be there for grabs.\n\n\n\n\n\nI do not want to do this anymore as I haven't even received my first paycheck yet, and it feels somewhat like extortion, to be honest. I know it's not a lot of money, but I feel like it's not fair towards me. Not to mention I had to commute and pay for gas with basically no money. I work here to make money, not to lose money.  \n\n\n\n\n\n\nI nearly had a vein pop in my head today when a colleague came to me and said: \" Hey, you need to give money for the flowers on women's day\", without any heads up, this time being like 20 $. I don't usually carry cash with me, so I didn't give him anything.\n\n\n\n\n\nI don't want to pay anymore just because Becky form accounting has a birthday, or she is having a baby, or God knows what else.\n\n\n\n\n\nAm I the asshole for not wanting to pay for strangers' gifts?",
  "id": 1,
  "comments": [
    {
      "score": 42,
      "content": "NAH.\n\nYou don't have to contribute if you don't want to, but as a newbie rocking the boat you will be seen as being a bit miserable and it will make it harder to integrate into the workspace. You will stake your claim to being an outsider. Your choice. \n\nI've worked in places that were similar and yeah, it does feel like extortion to an extent. One place even had a rule whereby you'd bring cakes in for everyone on your own birthday (?!) I don't even like cakes that much! I just kept my birthday quiet  never brought cakes in, and I don't think anyone noticed.",
      "id": 2,
      "comments": [
        {
          "score": 4,
          "content": "lol having people bring in their own birthday cake is surprisingly genius!?  paying for a whole cake you chose for yourself (so you control the quality/expense) makes more sense than shelling out $5 20+ times a year for every single coworker! and therefore having the option *not* to celebrate!?! because who actually wants to “celebrate” by awkwardly mingling with all the acquaintances you’re forced to spend your weekdays with??? why doesn’t everybody do this??",
          "id": 3,
          "comments": [
            {
              "score": 3,
              "content": "I suppose put like that, there was a logic to it.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 29,
      "content": "YWNBTA but if you don't chip in, be prepared for gossip and hate around the office. \n\nHate to say it but even if you're in the right, your workmates probably won't think so",
      "id": 5,
      "comments": [
        {
          "score": 2,
          "content": "Yeah, I was affraid of that....",
          "id": 6,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 16,
      "content": "NTA\nJust say sorry, my budget is pretty tight right now.",
      "id": 7,
      "comments": [
        {
          "score": 6,
          "content": "\"It's okay, little Timmy at the orphanage can skip dialysis for a week.\"",
          "id": 8,
          "comments": [
            {
              "score": 6,
              "content": "This has got to be the most evil way to deal with it. I love it! :))",
              "id": 9,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "I have to agree with you that the whole work thing about giving each other group gifts has gotten out of hand. Why can’t just the people who are close to the one celebrating just do their own thing? Unfortunately, yeah, it might not look that great if you’re the only one who isn’t participating. So, I don’t think YWBTA other people might.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "Becky needs to pay for her own birthday party or have her close friends pay for it. \n\nIf you have a hundred employees in you department and you have to give 5$ for each birthday, that's 500$ a year minimum!! Not including other ridiculous holiday celebrations that they'll try to make you pay for.\n\nNTA but if you're the only one not participating they might start treating you poorly.",
      "id": 11,
      "comments": [
        {
          "score": 2,
          "content": "your math does not check out, since he would get the same treatment aka at one point he gets the 500 back. \n\nNTA tho, but you will get hate for not participating",
          "id": 12,
          "comments": [
            {
              "score": 4,
              "content": "I do not need gifts from people that don't know me. It's as simple as that. Nobody asked me if I wanted to participate, they just came to me like : \" hey, I need 5$ for some person's present\". I think that is just plain rude!",
              "id": 13,
              "comments": [
                {
                  "score": 3,
                  "content": "One hopes that over time, they will know you.  And after you leave that job, it could be that knowing them will be useful for you in finding future jobs, etc.  You don't have to be best friends with everybody in the office, but networking is pretty key to your future success.\n\nThat said, if you've been asked for money six times in three weeks, that's kind of over the top.  I would ask a trusted colleague (see, this is why we try to be friendly!) if there's some way to not give to every request.  I can't imagine that the office has $500 parties twice a week.",
                  "id": 14,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "True that I didn't think about his own birthday. Unfortunately though, he won't get the money back for stuff like \"women's day\". \n\nStill gets  annoying having to give money to people you don't even know.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA\n\nIf there's a hundred employees, I don't think you're the only one who feels this way. Maybe there are coworkers out there who have chosen to abstain from this practice, scope out and check. Also since you're new, maybe you can explain your situation to them. However, that's easier said than done and I don't know if that is something you're comfortable with.",
      "id": 16,
      "comments": [
        {
          "score": 1,
          "content": "Honestly, I haven't thought about it like that. I most definitely will be searching to see if there are more people that share the same point of view as I do.",
          "id": 17,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA - as someone who is likely a bit older ( read over 50) may I suggest, a great reply is no thank you.  I did a temp seasonal thing a few years ago and they were all 'family' too. Potluck lunches each week, everyone assigned food to bring for like 40 people.  I was like oh no, not doing this.  I was respectful but simply declined a few times and they stopped asking me.  Funny thing is, I think other people started to feel more empowered to decline after I set a calm tone about it.  Never let others make choices about how you spend your money.  You earn it, you decide how you want to spend it.",
      "id": 18,
      "comments": [
        {
          "score": 1,
          "content": "I will try this method. However I do not have the necessary tact to do it properly. I'm afraid I might make things worse. But this definitely the healthiest thing to do.",
          "id": 19,
          "comments": [
            {
              "score": 1,
              "content": "I get that.  The peer pressure in a work setting is a lot.  I have always thought there should be a policy against that sort of thing, written or understood.  If the card is left with you, you could just move it on to the next person, without adding to it?  I know it is soooo hard.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "Nta",
      "id": 21,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA \n\nI don't do my own birthday, tell my co workers not to do anything, and don't participate in anyone else's at work. My answer is that if 'work' wants to celebrate, work can either pay for it, or pay us more so we would have more discretionary funds to use for all the office birthdays.... Which add up!",
      "id": 22,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA, things like that should be voluntary. Not everyone in the same workplace has the same ability to pay, and someone who is newly hired and maybe didn't make much before is a good example of that.",
      "id": 23,
      "comments": [],
      "relation": "Support"
    }
  ]
}