{
  "post content": "My husband and I have been together for 4 years. I have two kids (17m /19f). and their half brother is 3 years old.\n\n\n\nthis past week. My husband had an emergency (dad had a medical emergency) and wanted someone to watch our son. he asked my older son and he refused because he was going out with friends. he also asked my daughter but she locked herself in her room to study. I was at the restaurant with my brother meeting his girlfriend for the first time. My husband ended up taking our son with him to the hospital and his mom watched him from there.\n\n\nHe came home and was lashing out on everybody. Calling us selfish and unfeeling. I tried to explain that the kids were busy but he told me to get the f out with that bull because my older son could've skipped the hangout and watched his brother and, my daughter could've watched her brother while studying instead of locking herself in her room. He scolded me as well but I told him I couldn't leave lunch with my brother since he was visiting town and this was my only chance to meet his girlfriend.\n\nHe yelled some more than told us that he was canceling the family holiday trip for christmas this year. The two older kids were upset and said it was unfair. I called him unreasonable to cancel the trip and punish the kids (and possibly me) like that. he refused to discuss it later. Now me and the kids aren't speaking to him and he's saying \"good riddance\"\n\n\n*edit My husband was supposed to watch our son at the time. That's why I went to see my brother at the restaurant. The kids aren't used to watching their brother when neither parent is home.*\n\n\n*update My husband just told us that he'll be spending christmas with his family saying he needs to be around his dad anyway. the kids said they will just go to their dad since they and my husband are still not talking. neither of the kids are happy with how things turned out. so I feel like things have gotten out of hand and the problem got bigger. He's now choosing to basically abandon us on christmas and also keep our son away from me and his siblings.*",
  "id": 1,
  "comments": [
    {
      "score": 65571,
      "content": "YTA\n\nLet’s fix the title of your post: \n\nMy husband canceled our holiday trip because my kids & I are unreasonable & he just found out that we couldn’t care less about him or his family\n\nEdit — Thank You kind award givers!\n\nETA more — Seriously, OP stop adding edits!! You are so far away from being helpful to anyone, including yourself in this situation. Just stop. It appears you & your older kids will be getting consequences this year for Christmas",
      "id": 2,
      "comments": [
        {
          "score": 15587,
          "content": "They apparently don't care about their family either as, presumably, younger child is her son and older children's brother.\n\nIt boggles the mind.",
          "id": 3,
          "comments": [
            {
              "score": 13863,
              "content": "It really does. Like...if I were the 17 or 16-year old, I would have been EXPECTED to help out. Even the THOUGHT of saying no would never have crossed my mind. \n\nOP, YTA. And you're raising your kids to be that way too.",
              "id": 4,
              "comments": [
                {
                  "score": 4921,
                  "content": "> And you're raising your kids to be that way too.\n\nHonestly, I feel bad for the teens, even though they're old enough to be accountable for themselves. But clearly they've been raised by someone who is just... deeply weird, to put it mildly. That skewed concept of normal human behavior takes time and massive effort to deprogram, and they may not even realize they *have* to deprogram it until they've had a few romantic partners go \"uhhhhhh what the hell,\" as OP's is currently doing to her. \n\nLet's hope all three take that lesson to heart, to keep the list of hurt, frustrated, mistreated exes as small as it can be.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 4635,
                      "content": "I dunno, I'd think at 19 and 17, these kids are old enough to understand that a family emergency should be taken seriously. But WTF with wife and her lunch date??? These folks are bizarre - and not in a good way.  YTA",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "I'm not sure I'd call her weird but certainly self-absorbed, selfish and uncaring.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I was a child who spent her childhood raising younger siblings. So, I never wanted that for my kids and I was lucky enough to not need my older child to watch the younger one. BUT, . . , its not like I did not expect my kids to support the needs of the organism called our family. C'mon! That's not OK. So, if I'd called the eldest and told him to keep an eye on his little sister until I got there - he would just help me out. Its his family too, after all. I just never think that older children should always have the responsibility of managing younger siblings like I did. (My problem with it was that I had all of the responsibility and absolutely no authority to impose consequences for unsatisfactory behavior. I got yelled at and harassed and told how incompetent and and lazy I was when my younger siblings refused to do whatever they'd been assigned by our parents to perform. But, even with that disastrous modeling behavior - I still don't think that kids in a family don't have to help out. I just think they are no reasonable substitute for the parents.)",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3464,
                  "content": "I’m 17, my dad had some medical problems earlier this year and had a hospital stay. I stayed with my brother while my mom took my dad to the doctor. OP and her kids just do not care about this dude at all and it shows.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 1760,
                      "content": "I literally got a call while having brunch with my gf’s at the literal only time we could all meet and my husband needed to see who could watch our children because his father had to be taken to the ER. I didn’t even hesitate and was like “I’m hauling my ass home now!” I love my father in law so it’s crazy to me she couldn’t tear herself away like what in the world!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 218,
                      "content": "No they care. They cared so much they aren’t talking to him cause he cancelled the family trip",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 29,
                      "content": "Right! I was around? 12 and about to enter high school. It was summer break and my aunt broke her arm after falling down the steps. She’s older and my cousin’s grandmother and only caretaker. \n\nI ended up watching my cousin age 2-3 for more than 2 weeks with my mom there helping as needed. My cousin was my dad’s niece and my parents are divorced so my mom didn’t really want to help much 🤷🏼‍♀️",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1413,
                  "content": "To be honest, I'm baffled not only that the 17 year old thought to say no but was also allowed to go out? Like is OP raising the kids to have absolutely no consequences when they do something they're not allowed to do or are they just given free rein entirely. As you say, growing up I'd have also been expected to help out and there wouldn't have been any damn way I would be allowed to walk out that door instead of helping out in a family emergency (or otherwise if I was meant to be staying home).",
                  "id": 13,
                  "comments": [
                    {
                      "score": 500,
                      "content": "Same here. I think the families I grew up around would have canceled all the plans even if it meant some of the kids just stayed home, simply on the off chance that they were needed later or because family emergencies meant family together time.\n\nETA: OP is tripling down with her latest update. OP: YOU are the one who basically abandoned your family FFS. I hope your Christmas is lonely enough to give you only one thing - some self-awareness. If I run into your husband and his dad, their drinks are on me. Happy holidays.",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 280,
                      "content": "Same here. If someone in the house had an emergency there was no way i could lock myself in my room and pretend nothing happened, i'm sure there would be consequences. If the daughter had an important test, i can see her side since it's near impossible to properly study and keep an eye in a kid of that age at the same time. However there is no excuse for the son.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "Agree.\n\nBut mostly I'm commenting to say *Congratulations* for your so-rare correct use of \"free rein\".",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 631,
                  "content": "[deleted]",
                  "id": 17,
                  "comments": [
                    {
                      "score": 28,
                      "content": "My brother phoned me up when we were still in contact a few years ago and said he needed me to watch the kids (at the time a 9m and twin 7f) because he had phoned for an ambulance because his wife had trouble feeling anything below the waist. I was in the next city over meeting a friend. I threw some cash on the table for my share told my friend \"family emergency\" ran back to the car and probably broke every speed limit out there (dumb in hindsight couldn't get there if I was being chased by police) and got there just in time for the ambulance to take my brother and SIL to the hospital without having to worry about the kids. Kept them entertained for a few hours and then got a phone call saying she was going to have to stay in overnight and he would be back in a few hours. I told him I would take the kids back to my place for the time being to get them fed as I had no clue what was where in there place and bring them back and pick him up later if he needed a lift. Thankfully it all worked out okay and she was fine afterwards but yeah you drop everything in a situation like that. YTA OP. Feel sorry for your husband for having to deal with your uncaring assholeness.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "My youngest brother is 12 years my junior. When I was 24, my uncle died unexpectedly. My parents wanted to go help my aunt with everything but she was out of state so I went and stayed at my parents house for 3 days with my then 12 year old brother. I took off work and we had a Lord of the Rings extended edition marathon, which took a lot of the time up lol. I was more than happy to help and actually was excited to spend time with my brother. We are a close family and help each other, even as adults. I can't imagine being so incredibly blasé about a family emergency and not helping out for just an hour! This is such a weird and selfish family dynamic.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 33,
                  "content": "Never mind the teenagers . . . . in an emergency, why couldn't she take HER OWN TODDLER to the restaurant where she was meeting HIS UNCLE and the uncle's new girlfriend. Like, I get that it wasn't ideal but it was an emergency! It wasn't a fancy dinner, it was a lunch date. AND AN EMERGENCY. Take some crayons and a colouring book, plop the kid in a high chair, and have your meet-up.",
                  "id": 20,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 32,
                  "content": "As a 19 year old who’s grandma was just in the hospital and my dad stayed there for the night and I had to watch my younger sibling I couldn’t imagine not helping out my dad during that difficult time. Shame on the teenager for not helping out during that time.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "I'm so confused by this family dynamic, it sounds more like co-parenting than a family unit. And not amicable co-parenting.\n\nIt doesn't matter if he was supposed to be watching their toddler, when there's an emergency you cancel social plans to watch YOUR CHILD. OP is acting like they're divorced and her ex was asking to switch a custody date. I can't fathom hearing that your spouse's parent is undergoing a medical emergency and basically going \"not my problem.\" Wtf?",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "> Like...if I were the 17 or 16-year old, I would have been EXPECTED to *help out*.\n\nIts not just help out. Its responding to an ***family*** emergency. If I had a roommate with a kid and something like this happened, I would feel like an uncaring asshole underserving of being loved if I didn't do something simple like watch their kid for a few hours while they go see if their dad is dying.\n\nIf he can't rely on his step kids or his wife for something I consider so basic, OP will cancel the marriage on top of the vacation soon.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "Literally like\n\nI got that feeling from the way she said \"Their HALF-brother is 3 years old\"\n\nAs if that makes whats about to unfold any better? Theyre 3 years old bruh, why do you honestly find him unreasonable after all of you found your plans MORE important than basically your own child\n\nYTA all day, all of them except the husband and his fam.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2705,
          "content": "The worst two are the eldest son and the OP. Both of them could easily have cancelled their frivolous plans. Then the daughter comes next (I'll give her slightly more leeway if it is exam season). The husband should take the little boy and go on holiday just the two of them.",
          "id": 25,
          "comments": [
            {
              "score": 2764,
              "content": "I’m going to go with OP for the win on who sucks the most. Seems the most logical solution would be for Mom to invite brother & new girlfriend back to her house to continue their once in a lifetime meet & greet while she took care of her kids. Maybe uncle doesn’t like the kids either idk....\n\nETA — how did OP just continue on with her lunch like it’s totally normal for her 3 year old to be hanging out in a hospital? She “couldn’t” leave my ass... She WOULDN’T leave.",
              "id": 26,
              "comments": [
                {
                  "score": 831,
                  "content": "Or take the 3 year old to the restaurant and give him the phone to play with",
                  "id": 27,
                  "comments": [
                    {
                      "score": 1286,
                      "content": "Or….hear me out. The brother and GF come to her house to see the rest of the family too. The fact that the uncle didn’t think to go visit his nephews and nieces in the first place is a strong enough indication that the mother and brother are selfish assholes.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 484,
                  "content": "I know.  OP's FIL is in the hospital and she doesn't cancel her lunch.  Wow!",
                  "id": 29,
                  "comments": [
                    {
                      "score": 346,
                      "content": "What a great impression she must have made on the new girlfriend ... “Hmmmm, hold up... so “new boyfriend” is this how your family deals with helping others during emergencies? Check please! I’m outta here”",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 21,
                  "content": "Agree.\n\nYour father in law is having a medical emergency, but you can't leave lunch?\n\nIf my FIL were having a medical emergency, I would be dropping everything, delegating one of the older kids to watch the little brother and supporting my husband at the hospital. \n\nWhat insanely selfish people.",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1071,
              "content": "YTA, you and your kids from previous relationships are selfish and don't deserve your husband, I hope he gets out of this dynamic and gets custody of the 3 year old.",
              "id": 32,
              "comments": [
                {
                  "score": 44,
                  "content": "Well husband is saying \"good riddance\" so there is hope for him.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "I’m just baffled the OP refused to watch her OWN kid, when an emergency came up and the father couldn’t watch the kid. This is the most selfish thing I’ve ever heard in my life. I have a 3yr old she coulda took the kid to the restaurant or told her brother because of said emergency come to our house instead.",
              "id": 34,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1619,
          "content": "The edit makes it worse \n\n*The update makes it unbearable \n\nShe really does think she is not in the wrong. Her children sound like they have never had chores, never had to babysit,etc….  It was an EMERGENCY.\n\nEDIT:\n*\nLady, apologize… you left your husband in a bad spot. A terrible spot.",
          "id": 35,
          "comments": [
            {
              "score": 869,
              "content": "The edit is just *bizarre*. Like, the concept of \"emergency\" really doesn't compute for this OP. They don't grasp that to normal people — people who are capable of having the cognitive process of \"ah yes, this is an abnormal crisis situation that requires me to deviate from my normal routines and priorities\" — none of that is relevant information",
              "id": 36,
              "comments": [
                {
                  "score": 225,
                  "content": "The edit just makes her look ridiculous; almost everyone here is agreeing that she is a massive AH but she doubles down on her BS excuses.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 30,
                      "content": "She seems to think those are valid excuses that her husband is brushing aside or he wouldn't be mad. I read the edits and thought, \"Yeah and you're all TA for it because these don't trump a medical emergency!\" Some people really don't feel that family members are supposed to be like a team where each individual does their part to help each other. It sounds like they're (3 yo excluded) just using OP's husband for what he provides them but don't feel the desire to reciprocate. That poor man! What a rude awakening for him.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 47,
                  "content": "Husband: Sorry, honey, I know you fell down the stairs and broke your leg, but a nap was planned at this time and you knew. I'm going to bed. Good luck getting to the hospital.\n\nOP:Oh shit, good point. Sweet dreams honey. Hopefully the doctors can save the leg.\n\nI assume OP is good with that scenario.",
                  "id": 39,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "Lack of empathy….which is scary since OP is talking about “family”. \n\nHope the 3 year old picks up appropriate social cues from his father.",
                  "id": 40,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 45,
              "content": "Well everyone knows once you commit to walking in to a restaurant you are not allowed to leave ... for any reason. Clearly, OP is not familiar with the phrase “adjust & adapt”",
              "id": 41,
              "comments": [
                {
                  "score": 22,
                  "content": "I mean, it's also impossible for the brother and gf to grab the food as takeout and  go to OP's home.\n\nOr for OP to run out to get her son and have him join them at the restaurant.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Even if it was a valid excuse, which is absolutely isn't, how does that in any way excuse her own callous actions work her own damn son?\n\nI really hope OP's husband follows through with his good riddance remark and screenshots this thread and gets a lawyer ASAP.  He deserves so much better than this shitty family.\n\nEdit:. Good lord, OP is tripling down on behind the hero of her own story, lady you literally turned your there year old son away for some lunch you aren't going to miss him during Christmas.  I hope OP's husband gets the clarity he needs after being surrounded by family that actually cares for him.",
              "id": 43,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 44,
          "content": "Exactly. OP should understand how hurtful it is to see that his \"family\" considers hanging out with friends and studying as a priority over watching your toddler brother while your father (in law) deals with his Dad being hospitalized. \n\nThen to groan about how \"unfair\" it is that he doesn't want to be assed to take you all on vacation now. Talk about peak selfishness. OP YTA.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "I get not parentifying kids these days but how is it benefiting them later in life when a 17 and a 19 yr old can’t watch a toddler until their mom gets home?",
          "id": 45,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "Exactly this.\n\nHusband doesn't want to vacation with people who don't care about him. That is not unreasonable.\n\nYTA",
          "id": 46,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "Yeah, all of you owe husband a big, fat, sincere apology. The son especially. Jesus.\n\nETA: YTA.",
          "id": 47,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "This.\n\nPriorities are a thing. Emergencies are a thing. I have skipped out on an “absolutely can’t miss” dress rehearsal of a show because my sister called me with the news her husband was being loaded into an ambulance and she needed me to come to the ER and help with the toddlers so she could advocate for him without distraction. \n\nThe next day, I made it to the final dress dress rehearsal because we had time to find a backup. \n\nOP your son left. Your daughter locked herself in her room. This isn’t a case of parentifying your kids… this is “hey, there are two almost fully capable almost adults whose help I could really use in an emergency and they don’t want to do it.”\n\nYour husband is seeing you all in a whole new light right now, and it is about as flattering as a TJ Maxx dressing room. \n\nI feel bad for him and your youngest.",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Omg her second edit:\n\n> update My husband just told us that he'll be spending christmas with his family saying he needs to be around his dad anyway. the kids said they will just go to their dad since they and my husband are still not talking. neither of the kids are happy with how things turned out. so I feel like things have gotten out of hand and the problem got bigger. He's now choosing to basically abandon us on christmas and also keep our son away from me and his siblings.*\n\nShe has no type of self-awareness whatsoever. It’s sickening. Gosh. Husband needs to divorce her ass. You’d think she would have apologized by now. But no. A narcissist will never change",
          "id": 49,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "Let’s not forget, 17 and 19 is plenty old enough to handle a 3 year old.",
          "id": 50,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 32640,
      "content": "YTA\n\nMedical emergency > hanging out\n\nMedical emergency > studying \n\nMedical emergency > lunchie munchies",
      "id": 51,
      "comments": [
        {
          "score": 5941,
          "content": "Lol lunchie munchies",
          "id": 52,
          "comments": [
            {
              "score": 1328,
              "content": "2nd lunchie munchies",
              "id": 53,
              "comments": [
                {
                  "score": 2786,
                  "content": "Pairs well with divorcey worcey.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 672,
                      "content": "Oopsie woopsie",
                      "id": 55,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1889,
          "content": "In all honesty, the studying is the only one that should have been 2nd priority because hanging out with family and friends is an AH reason to leave someone out to dry especially having the nerve to expect a vacation from them later",
          "id": 56,
          "comments": [
            {
              "score": 1734,
              "content": "I kinda feel bad for studying girl for getting lumped in with the rest of the aholes here. She should have taken her brother when no one else would, but she actually has a claim on prior commitments. Sometimes you *have* to do something that night for schoolwork and you can't wait- and teachers aren't always understanding about emergencies. The son and mom could and should've been the ones to take the toddler.",
              "id": 57,
              "comments": [
                {
                  "score": 967,
                  "content": "Yep, but tbh the worst part is her's is the only commitment that affects both her present and future. If Mom watches son she can still go to lunch. Even if she can't then they can reschedule. Bro can still hang out with friends with his little bro. If not then they can reschedule. The studying girl can't study while watching her bro and for all we know that could be a pivotal exam that will affect her future. Would I have watched the kid anyway? Yes, but I understand why she wouldn't because OP or Bro should've sucked it up first.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 334,
                      "content": "The mum could have raised the alarm and taken brother and girlfriend to her house, surely. It's an emergency. Cancel food or get it to go, and let the husband attend to his dad.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "Aye, I had a teacher on a power trip, who failed me once cuz I didn't bring my assignment to her... \n\nI was admitted to the hospital... 🙃",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 872,
          "content": "[deleted]",
          "id": 61,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 34,
          "content": "OP could have taken the three year old to the restaurant. He’s here son and could have seen his uncle from out of town while his dad made sure grandpa was ok. Dad is rightfully upset, but I’m concerned that no one ( OP in particular)view the toddler as family!",
          "id": 62,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "But how else would OP ever get to meet her brother's girlfriend?? They will literally never get to see each other EVER again",
          "id": 63,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 25110,
      "content": "YTA\r  \n\r  \nWhen there's a family emergency, you drop everything to help. Meeting your brother's girlfriend for the first time is not a valid excuse not to go watch the 3yo, I mean WTF? Clearly you put your husband very low on  your list of priorities. \r  \n\r  \nI don't blame him for cancelling, you guys don't deserve it.",
      "id": 64,
      "comments": [
        {
          "score": 3933,
          "content": "Agree, What were they expecting from him after all of them bailed out when he needed them the most, and that three year old is OPs kid too. \nIf i were in place of OPs husband i would be having second thoughts about my relationship with this awful family.",
          "id": 65,
          "comments": [
            {
              "score": 2237,
              "content": "Honestly in times of crises people really show their true colours. \n\nOP and her kids showed theirs. If I was OP’s husband I’d be out the door. I would do just about anything for my family in an emergency and they have done the same for me. \n\nTo not even be willing to skip a lunch or a random hangout is despicable. It shows just how little OP and her kids care about OP’s husband and how selfish they all are.",
              "id": 66,
              "comments": [
                {
                  "score": 1193,
                  "content": "My question is why did OP not rush out of lunch to go support her husband and his family at the hospital?\n\nI honestly hope that he rethinks the vacation and goes on it with JUST the 3yo.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 602,
                      "content": "Yeah, that's what I thought, too. Even if they had no kids, the idea that OP would just go \"well my FIL has been rushed to hospital and hubby is in a state, but oh wait, here comes the starter, I guess he can cope alone.\"\n\nLike, what? You tell your brother there's been a family emergency, apologise and get your ass to the hospital and support your spouse.\n\nDo they not do \"for better or worse, in sickness and in health,\" in wedding vows anymore? Has it been replaced with \"I'll be there when its convenient, now fuck off here comes the pudding!\"",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "I was thinking why not just go pick up the 3 year old and bring them to lunch it’s not ideal but OP could still meet the gf and hang out with their brother…. The brother would also get some time with his nephew which shouldn’t be terribly inconvenient for him",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "This family showed less regard to its own members than I would to a friend.  I don't like kids, but if a friend called in the situation husband was in, I would watch the child ffs",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "This must have been a sobering eye-opener for the husband.   That poor man,  his own dad very ill, and finding out his wife and step kids do not care for him.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 756,
          "content": "Seriously. How awful would the brother and his girlfriend be if they wouldn't understand that OP has to leave early for an EMERGENCY. Couldn't they come by the house after lunch? Doesn't the brother want to see his nibbling? \n\nAnd don't get me started on the older kids.",
          "id": 72,
          "comments": [
            {
              "score": 314,
              "content": "Seriously, if my sister said ‘oh no, my husband has an emergency’ I’d be offering to mind the kid myself so she could go with him to help!",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "Honestly if I was meeting my sister to introduce my GF and her FIL suddenly had a medical emergency and she needed to go watch her toddler so her husband could go to the hospital I would have told my sister.  You go to the hospital to be with your husband and we'll watch my nephew.  And if my GF had an issue with that I would be ditching the GF.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Or the 3 of them could have gotten the food to go (*\"Waiter, I'm sorry, but there's been a family emergency... could you please make our order to go/bring us some boxes and the check? Thank you!\"*) and went back to OP's house to eat. She obviously doesn't give a shit about her husband and it comes across like she doesn't care very much about their son either....",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 530,
          "content": "She could've run to get the 3 year old and taken him to lunch. Sure, not ideal, but emergencies are emergencies. She could've invited them back to hers and ordered delivery. There are SO many options.",
          "id": 76,
          "comments": [
            {
              "score": 197,
              "content": "Or invited the gf and brother to her house and gotten pizza. It might not have been a big fancy lunch but she could have made it work. She didn’t want to",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "That was my take too.\nPack some of the kid's favourite toys and colour pens and tell him to draw a piece of art for the chef. Works a treat.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I wouldn't want to vacation with them either. God forbid he or the 3yo has a medical emergency and interferes with shopping or museum visits.",
          "id": 79,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16989,
      "content": "YTA and the two kids, Its not that you COULDN'T help him its that you WOULDN'T help him and actions have consequences, if you don't do the work you don't get the reward",
      "id": 80,
      "comments": [
        {
          "score": 2568,
          "content": "This needs to be higher. From the title, I was expecting some actual reasons that the family somehow couldn't get to their home before Dad had to go, or something. Nope, just \"we don't feel like lifting a finger.\"",
          "id": 81,
          "comments": [
            {
              "score": 889,
              "content": "include snobbish materialistic nose political unique yam important merciful weather\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
              "id": 82,
              "comments": [
                {
                  "score": 162,
                  "content": "It wasn't even choosing one thing over the other. None of those things cannot be done while watching a three year old. They just didn't want to be mildly inconvenienced.",
                  "id": 83,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Yeah I could understand if the little brother was three months old, and the teenagers not being comfortable being left alone with him. But a three year old? That’s a child that knows what’s going on and can take basic direction. An older teenager should be able to watch them with no problem. Insane.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 70,
                  "content": "What gets me is how she treated the whole incident as if it was something of mild import, like the dad forgetting he had made plans with friends or something. This is all written as if even the idea of it being a real emergency never truly entered her mind. \n\n&#x200B;\n\nThe fact the 17 yr old acted in a similar fashion is a red flag to me. That doesn't feel normal for someone that age. Unless of course, he learned that behavior. Is he copying what he saw his mother do or does he truly not care much? It's not impossible that he doesn't grasp the situation properly/being a teenager but feels unlikely when you add OP's behavior to the mix.\n\n&#x200B;\n\nThe only one in the bunch that had a good reason was the daughter. That shit affects her present and future. Especially if there is an exam coming. That's the only point where OP's logic isn't complete bullocks. I don't blame the husband 1 bit.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 56,
                      "content": "In a normal family of people who can feel empathy, the daughter would say \"I have to study, but sure I'll take a little break and watch him until mom gets here. She's on her way right?\"",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "Same. Maybe OP was in the middle of a business meeting and the kids were off somewhere far visiting family for the holidays. Nope, just your every day, run of the mill AHs. OP has serious issues if she thinks the reasons she listed are legitimately more important than a family emergency. YTA",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1396,
          "content": "Honestly she neglected her own child during an emergency and not getting vacation is the only reason she gave it 2nd thought. \n\nMy family would just set the kid down in front of oldest sober person around (usually me, way before I was a teen) and say 'so&so's in hospital' and go and I would totally understand cuz I'm not a monster.",
          "id": 88,
          "comments": [
            {
              "score": 269,
              "content": "That’s what I was thinking! I’m addition to wanting to support my husband I would also be thinking about my poor child. I wouldn’t want my kid to be at the hospital unnecessarily. First, just straight germs, etc. Bit secondly, that could ne very traumatic for them - seeing their father upset, seeing their grandpa hurt/sick. The chaos and weird energy at hospitals. All of that could have easily been avoided. I caught imagine putting a lunch over that. Their kid is only three!!!",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "I also found it odd that she described her youngest son as \"their half brother\".",
              "id": 90,
              "comments": [
                {
                  "score": 17,
                  "content": "Yeah, I thought she was trying to negate her teens with that til everyone pointed out that she doesn't even say 'my son' which shows a disconnect. I've always referred to my siblings as 'brother/sister' not step- or half- and I technically only have one 'full blood' sibling. We have more chosen family, I've never seen them as less than.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "This. I've commented else where, everyone here seems to be focusing on her treatment to her husband, and her lack of caring for him. \nNo one is mentioning that OP would rather her 3 y/o be surrounded by illnesses in the (presumably) ER, especially with covid still being a thing? Why couldn't the OP, brother, and new GF come back to the house to continue their hangout?\nSounds like OP doesn't care much for the health and well-being of her own child.",
              "id": 92,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10349,
      "content": "YTA\n\n>I was at the restaurant with my brother meeting his girlfriend for the first time.\n\nAnd you are his mother??\n\n>he refused because he was going out with friends.\n\nIt was a f emergency and you turned your back to your husband and your son. You three, especially you OP, are shocking.\n\nPoor guys, what a horrible family they have.\n\nYou'd be lucky if he only cancels the holydays\n\nETA thanks for all the upvotes and to the anonymous redditor that awarded this comment!\n\nETA2 thank you, u/Blonderoastme, for the award!\n\nETA3: an update from OP:\n\n>He's now choosing to basically _abandon_ us on christmas and also _keep our son away from me and his siblings_\n\nAre you serious?\n\nYou three abandoned your husband. \n\nYou three kept the toddler away from you.\n\nHonestly, don't you think you have made enough damage to your image?\n\nAnd yes, be prepared,most probably you're going to be served papers sooner or later. \n\nCongrats.\n\nETA4: thanks u/Arcana013 for the award\n\nETA5: thanks to the anonymous redditor that awarded this comment\n\nETA6: thanks u/Kittenspangles",
      "id": 93,
      "comments": [
        {
          "score": 2975,
          "content": "Yep divorce is in the cards, just shocked that OP can't see how wrong they all are.",
          "id": 94,
          "comments": [
            {
              "score": 554,
              "content": "Absolutely\n\nThe nerve of this person and the other two!!",
              "id": 95,
              "comments": [
                {
                  "score": 339,
                  "content": "Yo, I really hope he does seek divorce, cuz how could you stay married to someone who is telling their older kids that they don't have to respect you to a point that they are willing to mistreat the three-year-old.\n\nI'll be pushing for primary custody as well, if they all are so willing to ditch the toddler for their own goals, the toddler should live with the dad",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 35,
              "content": "And then they have the audacity to give *him* the silent treatment! Wtf! Over a cancelled trip?? Yeah, I agree with the husband when he said “good riddance”",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "I like how OP edited to add that the husband was supposed to be watching their son. *Their* son.\n\nHer husband's father suddenly had a medical emergency and she couldn't bother to take care of *their* child. Because she and *her* 2 older kids were busy. The youngest ended up being brought along for a stressful situation. \n\nThe husband is right to be upset with them and cancel the vacation. God forbid another medical emergency happens and OP has to decide whether to skip Mimosa Sunday Brunch or be with her family in their time of need.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "He needed to cancel the trip to save up money for divorce lawyers",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "And they're giving HIM the silent treatment!!! That's the kicker right there.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Yeah, Reddit likes to throw down the divorce card too easily but this is an actual good reason to divorce!\n\nOP, What you did broke any trust your husband had on you and your kids that he can rely on you in a time of need. The kids have the ever so slight excuse of being immature kids, maybe once they're older they'll realize what they did was wrong. You however, there is no excuse and is a relationship killer nevermind a holiday killer.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "That was my first rhought too like...you couldn't excuse yourself and go get your son OR invite your brother incl gf over??? \nWtf YTA",
          "id": 102,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "How can someone have a child for three years and have not yet realized that he'll just chill in the corner with some nuggets and a Bluey episode? Were they planning on discussing the brother's sexual habits or something?",
          "id": 103,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9652,
      "content": "Just to add, the 3yo is your son too. Your husband had a genuine emergency, and instead of reacting with compassion you HAD to stay at the restaurant? This doesn’t even add up. The father’s wife had to watch the toddler while her husband was being treated? If this is real, I’m going with YTA.",
      "id": 104,
      "comments": [
        {
          "score": 2345,
          "content": "Seriously, take the brother and GF to your house and watch your kid. You are the mother, show some compassion",
          "id": 105,
          "comments": [
            {
              "score": 851,
              "content": "Or take the kids to the restaurant to see his uncle from out of town",
              "id": 106,
              "comments": [
                {
                  "score": 527,
                  "content": "[deleted]",
                  "id": 107,
                  "comments": [
                    {
                      "score": 158,
                      "content": "Or even had her husband drop off the 3 year old at the restaurant on his way to the hospital",
                      "id": 108,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 278,
              "content": "How about going to be with her husband and making her other kids watch their brother? He got zero empathy and support. Just sad.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 154,
          "content": "> Just to add, the 3yo is your son too.\n\nDid you notice how OP said “I have 2 kids (17/19). And they have a half sibling who’s 3.” That wording makes it sound like this kid is not hers or she doesn’t consider him her kid for some weird reason.",
          "id": 110,
          "comments": [
            {
              "score": 71,
              "content": "“His turn to watch the 3yr old.”  Here’s a tip:  when it’s your own kid, you’re not “watching him”. You’re being a parent.  YTA all day long.  YTA for raising selfish older kids, too.",
              "id": 111,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "Considering the massive age gap between the 2 older kids and the 3 yo, coupled with the way OP has worded things, I'd be willing to bet that this child was a \"surprise\" and that OP was less than thrilled about all of it.",
              "id": 112,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 86,
          "content": "is she seriously having drinks and snacks and socializing while her husband's father could be dying? am i understanding this correctly?",
          "id": 113,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Definitely, how does hubby get knocked out of going to meet the gf because \" it was his turn to watch\" the 3 year old? These people can't be sleeping in the same room.",
          "id": 114,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4666,
      "content": "[deleted]",
      "id": 115,
      "comments": [
        {
          "score": 1633,
          "content": "It’s not just someone’s kid, it’s her own son. And her other kids half brother. So she’s really TA.",
          "id": 116,
          "comments": [
            {
              "score": 477,
              "content": "[deleted]",
              "id": 117,
              "comments": [
                {
                  "score": 518,
                  "content": "She doesn't even say my/our son is 3. Just says her kids half brother is 3",
                  "id": 118,
                  "comments": [
                    {
                      "score": 440,
                      "content": "I noticed that too and I'm actually wondering if she married the guy for his money and had a baby with him to lock that money down. Cause nobody with a young kid and who actually cared about their husband would do this. \"Oh no! Your father's in hospital? To bad you'll have to take my kids half brother with you, because my brother and meeting his gf are more important than your father being sick.\" YTA op. And your older kids too.",
                      "id": 119,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "Yup. This whole event goes to show the OP's kids have no love or respect for the \"new dad\" in their life, and apparently neither does OP.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 26,
          "content": "Yeah I hope he's putting that money toward an attorney consultation, cuz I don't know how he could stay married to someone who respects him so little and is so willing to abandon the toddler to go have fun",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Of course he doesn't want to spend time with OP on vacation. Aside from her and her teens not caring about their own family, if there were an emergency during vacay him and the toddler wouldn't have any help from OP.",
          "id": 122,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3151,
      "content": "YTA. Any single one of you could, and should have dropped what you were doing. You were all selfish. Nothing any of you were doing was life and death, meanwhile what your husband was dealing with could have been. You all suck. That poor man has no support from his own damn family",
      "id": 123,
      "comments": [
        {
          "score": 71,
          "content": "OP and her kids seem to have a thing for putting themselves first, over anyone else. Very selfish AH behavior. I hate seeing stories like these :/",
          "id": 124,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 65,
          "content": "What makes this even worse is that OP is now claiming that the husband is \"abandoning\" them during Christmas when the reality is he is going to spend it with his sick father. (And, I'm sure this guy wouldnt have wanted to be on a trip while his dad is ill even if OP and their kids weren't so horrible to him.)\n\nOP and their kids sound incredibly selfish + self centered and it doesn't sound like any of them even care about this man.",
          "id": 125,
          "comments": [
            {
              "score": 24,
              "content": "I don't get why she is complaining about him taking their son - she wouldn't even take him in an emergency so she can happily hang out with her brothers girlfriend without any worries now.",
              "id": 126,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2791,
      "content": "Yikes...YTA (you, your son and your daughter).   And I don't blame him for canceling the trip. Seems to me you 3 are very self-centered.\n\nAlso, isn't this your son as well? Sorry, but I think you could have easily picked up YOUR kid for lunch and / or invited your brother and his girlfriend back to your place to watch him.  \n\nThe same goes to your son and daughter. Your son could have canceled hanging out with his friends for one day,  and your daughter was home and could have easily watched him.\n\nYou 3 made things more difficult and stressful for your husband and not only that, were you not even concerned for your FIL?",
      "id": 127,
      "comments": [
        {
          "score": 874,
          "content": "I think the other worse problem here is they think HE is being unreadable for canceling but see absolutely nothing unreasonable with the 3 of their actions-- or the fact that his mother, the wife of the patient, had to watch THEIR child while her spouse is in the hospital. That's just grossly disrespectful.",
          "id": 128,
          "comments": [
            {
              "score": 163,
              "content": "Exactly!!!\n\nOP and her older kids are acting like spoiled brats. They owe the husband and MIL/FIL apologies for not being there to support them during such a stressful time and making things more hectic. They seem to only think about themselves.",
              "id": 129,
              "comments": [
                {
                  "score": 50,
                  "content": "Hope OPs husband documents this bad behavior towards 3 year old for a custody battle.  The kid deserves a better family with just his dad.",
                  "id": 130,
                  "comments": [
                    {
                      "score": 23,
                      "content": "I completely agree. What if something happened to the toddler? Only his Dad and paternal grandparents would be there for him.",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Damn. You know his mom is pissed off about this and talking shit. This is something that's going to be remembered, but unless his family is easily forgiving, her and her kids really fucked up. The kids may not care and more likely don't look at his family as their extended family, but his wife? Damn.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": ">Also, isn't this your son as well?\n\nI actually wondered about that after the opening paragraph when OP described the youngest as her children's half brother instead of her own child.  I wondered immediately if that use of language meant OP was less bonded with the youngest.\n\nYTA.  I can't blame the husband now that he knows where he stands in the eyes of the rest of his family.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "There are some weird family dynamics going on here. They are disassociated at best, unaware of social norms or even having compassion.",
          "id": 134,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2493,
      "content": "Congratulations on raising 2 kids who are exactly like you. Selfish. \n\nIt was a medical emergency. \n\nI divorced my husband over a medical emergency when he left me hanging. \n\nEnjoy your single life.\n\nYTA",
      "id": 135,
      "comments": [
        {
          "score": 463,
          "content": "Yep. And she will reap what she sows when her children grow older and if she faces an emergency, they won’t be there for her. And they’ll put her in a nursing home when she’s older. Karma",
          "id": 136,
          "comments": [
            {
              "score": 257,
              "content": ">And they’ll put her in a nursing home when she’s older. \n\nIf she's lucky. Nursing homes are expensive and they might need that money for a night out with the lads.",
              "id": 137,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": "[deleted]",
              "id": 138,
              "comments": [
                {
                  "score": 25,
                  "content": "Yeah I saw that update! She’s super delusional. No self-awareness whatsoever. She’s facing the consequences of her inactions and she has a surprise pikachu face about it? Omg\n\nAnd how can she not see, it was the other way around. She abandoned him and their son when they really needed her. She has no empathy. You would’ve thought she would’ve apologized by now, but nope. And she and her spoiled brat kids continue to give him the silent treatment. Unbelievable.\n\nAnd the “problem got bigger” lol.. she really can’t see who started this whole issue in the first place? She needs to look in the mirror",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 37,
          "content": "Wasn't married, but was left hanging with a broken foot in a 3rd floor apartment.  \n\nMy life is so much better now, even if I break another bone,  I'll happily take care of myself.",
          "id": 140,
          "comments": [
            {
              "score": 45,
              "content": "I have a brain tumor. Recently fell after getting out of the shower and hit my head on the toilet. Called my SO crying that i hit my head. He immediately told work he had to leave, stayed on phone with me, called 911 when i lost consciousness and had them at the house before he got home. Stayed by my side the whole time. \n\nSame for him, he had pancretitis and i slept on the floor in the hospital with him. \n\nIts a very different relationship. I have no fears no of being alone. \n\n(Tumor grew 30% but that wasnt why i fell, had a concussion, was fine after 2 weeks.)",
              "id": 141,
              "comments": [
                {
                  "score": 23,
                  "content": "That's nice you found someone who shows they care! I'm happy for you. I hope your tumor can be treated. I can't imagine going through something like that.  \n\nMy ex's mother was the one who drove over an hour to bring me to the hospital...and she had never liked me.  \n\nIt's been 3 years since we split up.  Still single,  but that's by choice. I needed to do a lot of mental health work on myself because I realized I had been with d-bags like that my whole life.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "I treat my neighbors better than this lady and her kids treat their own family.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "👏",
          "id": 144,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}