{
  "post content": "Okay, so anyone in the video game world knows that next week the new Legend of Zelda game comes out after like 5+ years of waiting. I’m a massive fan. When the release date was revealed I immediately requested PTO for that date as I plan on staying home that day and enjoying the new game. What I didn’t realize was that the day I asked off for is the Friday before Mothers day.  \nMy company has had to limit the requests off for that date now as many people have been asking off for it. I had previously told some of my co workers I was planning on staying home to play the game, and I guess word got around because one of my other coworkers asked me after work to give her my PTO so she can travel for mother’s day. I explained to her that i requested this day off months ago for a specific reason and I really wasn’t willing to change it. She got pretty upset with me claiming I care more about videogames than family and whatnot. I honestly don’t really care about her not being able to travel because I feel like if this was an important date then you would have requested off early, like I did. Anyways I firmly told her no, but she told some of my other co workers and they are pissed at me and calling me an A hole for not giving up the date. AITA?\nedited typos",
  "id": 1,
  "comments": [
    {
      "score": 14108,
      "content": "I would have told her I care more about my family than videogames, your family not so much.  Her family is not your responsibility.   She should have planned better.   NTA",
      "id": 2,
      "comments": [
        {
          "score": 3139,
          "content": " This, I’m from the UK so we have 8 bank holidays occasionally more for example King Charles coronation (not that I’ll be watching), I’ll be getting drunk in a pub with my mates. I’ve booked a day off every day before and after the bank holidays throughout the year to get long weekends without putting a dent in my annual leave allowance. Am I seeing family on these days? No I’m staying at home doing bugger all because I feel like it. I wouldn’t cancel my holiday for anyone because they should have requested it as soon as our holiday allowance reset if they wanted the days off.",
          "id": 3,
          "comments": [
            {
              "score": 702,
              "content": "Damn, booking around bank holidays is such a good idea, definitely need to do this in the future!",
              "id": 4,
              "comments": [
                {
                  "score": 831,
                  "content": "Where I work, we have 31 PTO days per year. This one guy schedules every one of those days on a Wednesday. \n\nHe says that he does it so he seldom has to work more than 2 days in a row because of how toxic the place is.  He works M & Tu, then Th & Fri.\n\nHe spaces out the requests for the 52 weeks of the year and calls off sick on most of those Wednesdays he does not schedule a PTO day for.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 423,
                      "content": "We also have that guy.  His reasoning is the same, although he doesn't call off sick.  He just likes to take a Wednesday off.  I love it though, We work in a department of 6 and we can't have too many people off at once.  Frees me up to take the fridays/mondays.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "This is fkn genius haha!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Call off sick on cue?... well most places would investigate that... beyond allocated sick days. However, I think most managers would have a conversation about it.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "My mom does this during the summer because Wednesdays are free entry at the beach she likes.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Genius",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "When I worked retail, I set my availability to exclude Wednesdays mostly because it's easier to schedule medical appointments when I have a guaranteed open weekday available",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "He gets two Fridays a week.  Brilliant.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "When my daughter was Girl Scouts age, I got roped into being the webmaster for not just her troop, but our entire service unit. Part of that gig was that I had to attend the Service Unit meeting on the 3rd Thursday evening of every month. At the time the 3rd Thursday of the month was also when the monthly kink party was held at one of the local clubs. Since our daughter was with my ex those nights since the meetings would go until 9pm, I requested the 3rd Friday of every month off so that I could go to the GS meeting, then head downtown for the kink party and play until 2am.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 110,
                  "content": "[removed]",
                  "id": 14,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I think you replied to the wrong comment, I'm talking about booking paid leave around bank holidays",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 84,
                  "content": "Strongly recommend, of course I take odd days every now and again but I always make sure that I have holiday left over that I can sell or carry over at the end of holiday year. One year I went to Italy for 6 days (I used the April bank holiday) 2 days of annual leave for nearly 6 days away.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 33,
                      "content": "I had some days to burn and booked this past Friday off without even realising that Monday was a BH. Was pleased when I realised!",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "This week I've got 10 days off for 3 holiday days.  You gotta capitalize on those bank holidays.  We get our birthdays off as well, hence 3 rather than 4.    \n\n\nLiving the dream, until ofc the hellscape that is working for a living kicks back in, in 8 days.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "I've done exactly kinda this. Took 8 days off with the 2 bank holidays and 2 weekends, I got 16 days of no work to enjoy.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "At my company in America we get the Friday after Thanksgiving off every year by default for reasons like this. Thanksgiving is the 4th Thursday of November every year for non-Americans.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 49,
                      "content": "half the population goes SHOPPING on the day after Thanksgiving, half the population is stuck in airports, and the other half (me, et al.) just has a normal day. 😎 Possibly feeling smug and condescending about the other 2 halves. Ha!",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Paid holiday for us as well.  New England non union blue collar worker.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "The only issue with it is that a lot of people do it so if you want to travel or go anywhere special it'll be crowded everywhere.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I always do this. If I can turn a holiday into a 4 day weekend by just adding 1 PTO day I do. July 4th is on a Tuesday so I'm taking that Monday to have sat-tues off.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "My husband works 15 on 6 off, and usually in the summer he takes the day before and after his days off as PTO so he gets to work 13/8 instead so we can get stuff done around the house or go on week long camping trips with the kids.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Hell no, you're NTA.",
              "id": 26,
              "comments": [
                {
                  "score": 2,
                  "content": "u/Hugelu_Aebiro455 is a bot.",
                  "id": 27,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I do the same thing, and am currently enjoying an 11 day break for the princely (get it?) Sum of 4 days' annual leave. Where I work, leave ie first come, first served, as I imagine it is for OP. So obviously I'm voting NTA.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "Long live the king.",
              "id": 29,
              "comments": [
                {
                  "score": 4,
                  "content": "Or not, that's cool too.",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "With his genetics he probably will.",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "Live your life and may you not see the pomp and weird that is your Coranation! \n\nI'm an American. I would say, \"I don't get it,\" but I woke up and went to a party when Chuck and Di married, so...\n\nYes, I'm old.",
              "id": 32,
              "comments": [
                {
                  "score": 2,
                  "content": "only the older generation seem to care. I don’t care about it at all. Waste of tax payers money for a tourist attraction.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 738,
          "content": "NTA - It's not like Mother's Day is a surprise or random event. Both employees had advance knowledge of what they wanted to do on that day, but only one requested the time off. It does not matter what either of them wants to do on their day off, it's literally nobody's business to know.",
          "id": 34,
          "comments": [
            {
              "score": 231,
              "content": "...As someone who also got the day off to play Tears of the Kingdom, I didn't realize it was time for Mother's Day until I read this post. Now I gotta scramble to get stuff for my mom, grandmothers and godmother.",
              "id": 35,
              "comments": [
                {
                  "score": 64,
                  "content": "I took the day off too! I'm a little disgruntled that my play time will be interrupted by family festivities that weekend lol. I suppose I will need a break!",
                  "id": 36,
                  "comments": [
                    {
                      "score": 79,
                      "content": "My dad's birthday is that weekend, too. But he'd understand -- he took off for Ocarina of Time when it dropped.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I'm glad to see that I'm far from the only one taking the day off for this! I live a bit far from my family, so most of the mothers day thing is a phone call and making up for it next time I'm in town.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "As a mom, I'm using Mother's Day as my reason for getting to play Tears of the Kingdom first, before my kids.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Hahah!  I’m *getting* TotK for Mother’s Day and I couldn’t be happier!  \n\n(I also have the day off too, scheduled it in January!)",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I took the whole week off just as a break before they even announced the release date. Best PTO accident ever.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I'm lucky, I'll be getting Tears of the Kingdom for my wife, the only mother I still have to buy for.",
                  "id": 42,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I just found out because I’m so used to Mother’s Day being the Sunday closest to my moms birthday that o assumed it was this coming Sunday😂 and I’m going to my friends over Mother’s Day and she was the one who told me it was Mother’s Day and how we are going to Busch gardens for Mother’s Day for her 😂😂 and I was like Oh I didn’t realize I was crashing your Mother’s Day weekend. \n\n(For the record we discussed the weekend a few times and doesn’t care that it’s MD weekend I would absolutely reschedule if she wanted me to and she would be comfortable telling me to do so)",
                  "id": 43,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I booked a whole long weekend for TOTK! Mother's Day happens every year, it's been 6 years since the last Zelda came out.",
                  "id": 44,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": ">It's not like Mother's Day is a surprise or random event.\n\nExactly. If coworker's mom had a dire health crisis, then I could see an argument for trading days off. It still wouldn't be an obligation, but I might give you side eye if you valued playing your game over me seeing my mother on her deathbed with no warning that this would be her last days. \n\nBut for an event that's been on the calendar for decades - I've got zero sympathy.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I had an old manager mess up my days off, so when we were getting it sorted I said what days I can't do.\n\nHe asked me \"What are your plans?\"\nMy \"troublesome\" response: \"I might be going to hospital for an appointment, I might be doing a tonne of cocaine, I might be searching for the Ark of the Covenant, it's none of your fucking business, that's my day off\"",
              "id": 46,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 260,
          "content": "NTA. Mothers Day is listed on a calendar every year even though the actual date may vary. Poor planning on their part does not equal an emergency on yours. You planned. You deserve it, and it doesn’t matter why you booked it off. FWIW, I’ve booked vacation around video game releases and it’s amazing. Enjoy your time off and your game!",
          "id": 47,
          "comments": [
            {
              "score": 85,
              "content": "Same. I already booked off in June to play Final Fantasy 16. I've been waiting for this game since the first trailer was released two years ago. If someone were to tell me to cancel my leave, I would have told them to go pound sand.\n\n\"It's just a video game\". Like do people not understand that video games are a hobby just like anything else? Like it's no different to looking forward to that concert you finally got tickets for, or that movie or tv series you really want to watch, or even that new book in a series you've been waiting 5 years for.\n\nAnd yeah, anyone with internet can simply go google the dates of important holidays for that year and planned ahead. Like I've taken long weekends before when I see bank holidays on like a Thursday. Just book the Friday off and woo hoo! 4 day weekend! People not being able to plan in advance is not my problem.",
              "id": 48,
              "comments": [
                {
                  "score": 3,
                  "content": "Never Zelda, but sometimes when I spend $60+ on a game I feel bad that I'll be bored with it after a week and maybe the purchase isn't worth it. But if you think of it vs the cost of a one week vacation, $60 or $70 is a steal!",
                  "id": 49,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Some games you can spend hundreds of hours on. Like I spent 200+ hours just on Persona 5 Royal alone trying to Platinum everything. That's great value for money right there. A 200 hour vacation (around 8 days) would easily cost hundreds or even thousands of dollars.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "The date changes but it's always the second Sunday in May.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 166,
          "content": "NTA but I personally think telling people why / being honest about why he was taking that day off was pretty naive. Obviously people were going to react this way. I guess my advice would be: In the future remember that a lot of people will not understand that what you’re doing with your time is none of their business and it’s not your responsibility to give that up for them - they will just see what you’re doing *vs* what someone else wants to be doing, and judge who deserves that time accordingly - in the court of public opinion etc. \n\nJust lie.",
          "id": 52,
          "comments": [
            {
              "score": 62,
              "content": "This would be the best way to avoid social awkwardness yes. But honestly, OP is not the weird one, that coworker is. In all offices I've been at, most people talk during lunch and will share if they choose what they're doing that weekend or during the holidays. How many times have you heard at the water cooler or lunch room, \"So any plans for the weekend?\" Or \"Looking forward to the holidays? Will you be meeting the fam?\" What OP did is completely within the norm. That coworker is the weird one. A gossip, a busybody, hostile, intrusive, and entitled, the kind of person people walk on eggshells around for no apparent reason. In a sense, a complete narcissist. Safe to say... every office has a version of this coworker and nobody likes them.",
              "id": 53,
              "comments": [
                {
                  "score": 42,
                  "content": "I never said OP was the weird one. I said OP was naive. \n\nIf I was taking a day off around mother's day or any other time period where there is a lot of competition for time off, to do something like play video games, that would not be something I'd share \"at the water cooler\" *because*: \"Every office has a gossip, a busybody, hostile, intrusive, and entitled\" person/group of people. And it would be *naive* to assume otherwise.\n\nEvery office also has a person who repackages and repeats something someone else just said.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Sure, but OP has already said \"I didn’t realize was that the day I asked off for is the Friday before Mothers day.” I'm not sure how much your advice applies here, since OP didn't know it was a holiday.",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I’m also trying to figure out why it makes a difference for the person to take Friday off as opposed to taking Monday off? Note I don’t mean OP but their coworker. If their goal is to have a 3 day weekend then there’s multiple ways to achieve it.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "Better than lying, just tell them it’s personal. You don’t owe any explanations to anyone. Ever.",
              "id": 57,
              "comments": [
                {
                  "score": 8,
                  "content": "Absolutely.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "\"I've got some stuff already planned for that day, and I can't move it around, sorry.\"",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Exactly, he booked the time off, doesn't matter why. If the colleague had a sudden emergency maybe it would be different. I tell people I'm going to sit around on the sofa in my boxers if I take a day off.\n\nOP should subtly spread around that you are actually using the time to see some adopted mothers at an old peoples home but you made up the game story as you are a little embarrassed by it and didn't want anyone knowing. Tug at their heart strings and make them feel bad.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "OP's mistake is admitting it. Should've lie and pretend it just a rumors.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "\"I have plans\" is the only sentence you ever need for a work conversation like this, be it with a coworker or a boss. You are entitled to a private life.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Why should OP have to lie? It's their PTO, they can do what they want with it. I scheduled mother's day off. And when people ask what I had planned, I just told them \"Absolutely nothing, I just don't want to come in that day.\"",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Always remember that 'no.' is a complete sentence. Repeat as required.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 157,
          "content": "\"Your poor planning does not constitute an emergency for me\"\n\nNTA, and don't tell anyone why you want time off anymore. I've worked for folks that play the \"justification game\" when it comes to approving PTO and it's infuriating.",
          "id": 65,
          "comments": [
            {
              "score": 68,
              "content": "When I worked retail I'd always took mothers day off to visit my mothers grave and once I had a coworker who asked me if I could give up my PTO for her so she can spend time with her mother, and I told her that I will not be doing that and I did tell her why and she said it doesn't make sense for me to take time off on mothers day because I no longer have a mother. I was 19 my mother died when I was 12, I reported her to my supervisor for the insensitive comment, and after that she always gave me dirty looks.  \n\n\nIf I ever work retail again, I will still take that day off so I can visit my mothers grave, it still hurts to this day, it isn't something you just get over especially since I lost her when I was 12, working on mothers day and constantly hearing people say \"Happy mothers day\" burns my soul.",
              "id": 66,
              "comments": [
                {
                  "score": 33,
                  "content": "I totally get this.\n\nFor those of us who have lost our mothers,  Mother's day can be really difficult.  I have taken the day off for that reason.  Good for you, for standing up for yourself.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 3,
                      "content": "It's just as hard for people that tried to be a mom and life interfered and they couldn't. I would encourage all of those people to avoid the public on that day too.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "That person was an asshole.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "yeah that person can and very much should go fuck themselves with an unlubed cactus. Who fucking just says that shit to someone ?! side note what is the deal with these types of people expecting someone else's PTO? That's just weird to me.  I didn't slave away accruing this shit just to give it away especially not to some dipshit entitled coworker who i merely tolerate for the sake of employment if you want PTO maybe use your fucking own.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 2,
                      "content": "What's weirder too is normally in retail once your PTO is approved, you normally can't work that day or days anyway.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "My sympathies to you.  Mother's Day is sadly difficult for so many of us.  It is very unfortunate that a little kindness can not be extended.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 126,
          "content": "just gonna toss this out there, contact whoever does your scheduling and let them know \"on the off chance anyone claims I agreed to take a shift for them on X day, they're lying and I will be taking my planned PTO\"",
          "id": 73,
          "comments": [
            {
              "score": 10,
              "content": "PTO Scheduler: I'm just touching base that PTO has been granted to me for such and such a date.  I'm looking forward to my time off. NTA.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 98,
          "content": "If anything, your coworker should be ashamed that you care more about your video games than she does about her family.\n\nYou planned ahead. You enjoy it however you want for whatever reason.",
          "id": 75,
          "comments": [
            {
              "score": 9,
              "content": "This should be the top comment",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 83,
          "content": "100% agree \n\nI’m glad there are more NTA responses on this. A few weeks ago everyone was trying to call a woman who didn’t stay late for a coworker an a bc she wanted to have bubble tea and relax in the park. The coworker got pissed bc she didn’t plan well and was missing her kids recital. Like please 🤚🏼 everyone needs to get off their high horses. \n\nEnjoy Zelda!!!!! NTA",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "Talk to HR about this person and the collective harassment she incited as well- this is messed up",
          "id": 78,
          "comments": [
            {
              "score": 30,
              "content": "THIS for petes sake OP. What shes doing is not okay, and you know she go to HR for less",
              "id": 79,
              "comments": [
                {
                  "score": 3,
                  "content": "Yep, coworker creating a hostile work environment",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "I think the OP is NTA and should take his day off, but I don’t think that is the same as saying he cares more about his video games than that woman’s family. If it were an actual emergency where the woman needed help to care for her family, then I would hope OP would postpone his video game playing to help her out.\n\nThis is not that situation, though. She can still see her family without needing to travel on that Friday. Mother’s Day is a nothing holiday, and she can visit her family any other time.",
          "id": 81,
          "comments": [
            {
              "score": 19,
              "content": "Yes, she can take off Monday if she wants a 3 day weekend.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "If it's an actual emergency you'd think the company has enough empathy to let that woman go. (BTW, that is the norm where I live. A company can say at that day 10 of 50 people can have a day of,  but if I have an emergency there will be 11 people not coming to work)\nAs it stands she can travel after work.\n\nYou never owe anyone your pto, even if you take it to stare at a blank wall",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6066,
      "content": "NTA!!!! Same goes for *any other holiday*. \nI’m childfree my choice and people always seem to think that means I should be the one working holidays. It doesn’t matter if the reason you have the day off is for a video game! It’s your day off, enjoy it!!!",
      "id": 84,
      "comments": [
        {
          "score": 1857,
          "content": "Yes!! I can't tell you how many times I've heard \" Well you don't have kids, so..\" I always answer with \"But I'm someone's kid, & don't I deserve to be with them, as much as you think you deserve to be with your kid?\" That usually makes them give up.",
          "id": 85,
          "comments": [
            {
              "score": 876,
              "content": "I usually keep my private life private and don’t talk about it with my coworkers. So any time I get shit like that I just reply “who says I don’t have kids?” and then never elaborate.",
              "id": 86,
              "comments": [
                {
                  "score": 453,
                  "content": "I finally learned that lesson at 40. Coworkers are not your friends.\n\nETA: NTA. Not even a question.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 273,
                      "content": "This. I have been asked to change my days off because people with families wanted my middle of the week “weekend,” I regularly work on Christmas Eve/Day for the people with kids, and my boss even tried to make me work harder so that the people with kids would have easier access to time off with no notice or compensation. \n\nAt what point does anyone give me any consideration at all?!? Never, so to heck with them.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 99,
                      "content": "100% accurate.\n\nI have been f*cked up many times by coworkers. I even tried to be a good person and accomodate to others sometimes on those long holiday weeks. But then, when it was my turn, no one wanted to help me.\n\nSo f*ck them all. If I can and want to take a free day next to a holiday even when I'm gonna just stay home, I will do it.\n\nMost of the times, if asked, I will say I already have plans. They don't have to know that my plans include taking care of my plants or just seeing movies on some app.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 70,
                      "content": "my no kids/married friends always reply: \"we did, but the state took them away.\" 😂",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 38,
                      "content": "I stopped accepting friend requests (FB, Instagram, etc) from coworkers ages ago. At my first job as a fresh grad I made the mistake of doing that and it was NOT good, to say the least. Coworkers would always get insulted when I wouldn't approve their friend requests or add them. Now I always say, \"sorry, but it's not personal. It's just a rule I have about not adding coworkers on social media. When I quit, I will add you!\"",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "It also took me a long time to learn this but I’m so glad I did.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "This right here is something a lot of people need to learn.  I keep my work life and personal life very separate.  As for the OP, NTA.  His coworker should have planned better.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "No they are not. They look for a weakness to exploit and go for it.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 79,
                  "content": "I have a son named Link, and he and I have important plans for that entire weekend",
                  "id": 95,
                  "comments": [
                    {
                      "score": 40,
                      "content": "My son link and I will be going on an outdoors adventure",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I have to take my poor daughter, Zelda, to therapy. 😭",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 56,
                  "content": "Somewhat related, that's kind of how my father got my grandmother off his back about the whole 'I want grandkids' thing. \"You want grandkids? Sure, I can go out and do that tonight!\"",
                  "id": 98,
                  "comments": [
                    {
                      "score": 24,
                      "content": "That’s hilarious, I’m sure your grandmother became a lot more patient after that. Smart answers like that are usually the best way to get people to back off.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I told my mother that when I was about 20 and she backtracked quickly about how she could wait.   I tried it again at 28 and she told me to get to work on it.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 48,
                  "content": "After over a year working together, one of my coworkers finally found out I am 10 years older than she assumed based on my appearance.\n\nI keep work and private life on deep lockdown.  I don’t advertise anything, and I avoid personal conversations. I am here to work, browse Reddit, pretend to work, and collect a paycheck.",
                  "id": 101,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 25,
                  "content": "This is the way.",
                  "id": 102,
                  "comments": [
                    {
                      "score": 2,
                      "content": "This is the way ✊",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "I use that method myself as well. I have a baby face and despit ebeing 28 years old, my coworkers (mostly women in their 40s) like to pick on me for it. Making anide remarks and belittling me because of my age. They think I'm 18 or something. It continuously blow their minds when I act unlike their imagination or bite back witb \"how do you know I don't....\"",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "That reminds me [of this.](https://morbotron.com/video/S02E15/OZ0T4P40g0rnyv1inBaTGYUykCk=.gif)",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 95,
              "content": "I DO have kids and I would never try to guilt someone to let me have their day off.  Kids don't care what day it is, really, there's much bigger things in life to get all worked up about! I say if someone wants a day off to sleep all day and lounge in PJs, they should do it and not feel a single drop of guilt",
              "id": 106,
              "comments": [
                {
                  "score": 59,
                  "content": "This x1000. As long as you celebrate with your kids they're not gonna care what day it actually technically happened on. My dad was a pilot and so growing up our holidays were all screwy, including birthdays. We'd do Easter the weekend before so dad could be there for the egg hunt bc he was flying on Easter sunday; xmas was on the 28th bc dad was flying over Xmas eve/day; my bday is on the 6th but it might be celebrated anywhere from the 1st to the 10th depending on dad's schedule. And as long as we didn't just cancel and do nothing at all for the event, it was fine!\n\nThe celebration, the party, the time together is the important part. Who cares if it happens exactly on the date?",
                  "id": 107,
                  "comments": [
                    {
                      "score": 3,
                      "content": "My mom worked in a hospital from the time I was in high school until she retired (ETA: my mom retired after I had been working at the place described below for 7 years and had moved into a new role, so for the whole time that boss supervised me, the holidays were not on holidays). My SIL, too, once she graduated from college. We'd do a Thanksgiving/Christmas combo on a random weekend in mid-December since ONE of them was going to have to work on each of those holidays, but could easily request a random weekend between them off. My boss would be scrambling trying to move deadlines around so they didn't fall near the actual holiday, and I had to ask him to stop doing that for me...my holiday is going to be December 16th (or something), so I'd rather have the deadline fall on December 29th, when I'd just be chilling at home if I wasn't working, than rush to get it done and then not be able to attend the actual family gathering.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Same my kid is just happy that mom is home. Also schools release their schedule during the summer before the start of the next school year (at least mine did) so parents tbat wait until the last minute to request time off baffle me",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Also who actually cares about Mother's Day? I say this as a mom of 4. It's just a day.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 4,
                      "content": "My husband's mother. She's been all pissy this year since my husband won't be home for Mother's Day for the first time in 41 years; we live in the same town that my husband grew up in, so all his family is here.\n\nMy Mom wanted us to come out and spend my birthday with her, which is extremely close to Mother's Day this year, because my dad passed away suddenly in December. So we're heading east (we live on the west coast) next Friday. This is going to be the first Mother's Day I have spent with my mom since 2008. Not that my family has ever really done much for the day really, but it's important to my mom for us to be there this year.",
                      "id": 111,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "yep! what do I want for mothers day? be nice to me all the time pls haha",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "“So what you are saying is I love video games more than you love your children because I thought far ahead to play my game but you didn’t think of your children until right now”",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "> Well you don't have kids, so..\"\n\nWhen people say this to me, I say, \"no, I don't have kids.  Not since the accident.\"\n\nShuts them up pretty quickly.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I generally said \"and don't they deserve to be with their kid\" in place of your \"and don't I deserve to be with them\".",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I once told someone it's not my fault you don't know how to wear a condom.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "My.mom used to work Christmas day when I was 10+ because \"people with younger kids deserve that day\"",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I used to get this all the time when I worked retail.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I'd rebuttal with don't my elderly grandparents deserve to see me on this day too?",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 89,
          "content": "A couple of places I worked did Christmas shifts covered by folks without family, New Years covered by guys with a family. Worked out well\n\nETA: People self selected the group they were in and some wanted the opposite but it mostly went like that. In addition, some guys took off both and folks who could use the cash could pick them up.",
          "id": 120,
          "comments": [
            {
              "score": 148,
              "content": "This just seems entirely unfair. (I’m not directing this at you specifically, you didn’t write the policy after all.) But If you’re in a field that works holidays, everyone should have a place in the rotation. \n\nHow do you define “folks without family?” I don’t have kids, but my family (parents,aunts,uncles, sister) always do a huge get together for major holidays. To miss that because someone defines “having a family” as “having birthed a child” is just bull shit. \n\nI’m currently single and have no children,  I would much rather work New Years than Christmas. \n\nI’ll suck it up and take my place in the rotation if everyone takes a turn, but I refuse to pretend like someone else deserves a holiday off more than I do. If we work the same job, then we both have to deal with the crappy part.",
              "id": 121,
              "comments": [
                {
                  "score": 44,
                  "content": "Yeah.  Same. I worked at a place that you had to work holidays so there was a sign up sheet that was first come first serve, and everyone signed up for two holiday shifts to work for on the big four of us, Thanksgiving, Christmas, New Years Eve and New Years Day. We had to sign up for two for a guaranteed one off and pick either the morning shift or  afternoon/evening shift. So I usually chose Thanksgiving morning, food's not ready until after I'd be out anyway, and then New Years Day morning because I'm not a huge New Years Eve person anyway and figured that's one spot for the people who do drink that can take the day off. Of all the jobs I had where holiday work was mandatory, that one was the fairest I thought.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I worked somewhere with a very similar policy.  I used to sign up for New Years too because I didn't care about it but I always took Christmas off.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "I had a job try to pull that with me about a day off and he said his family was more important than mine...two weeks after my little brother died.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 84,
              "content": "This would have pissed me off. I may not have a family, but I celebrate Christmas as a religious holiday and am in church. They tried that with me at a previous place of employment, and it was quickly rescinded. (On the other hand, I did cover thanksgiving every year, and new years if needed, as well as all the summer holidays. I just needed Christmas and Easter off)",
              "id": 125,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 79,
              "content": "Just because I don't have kids doesn't mean I don't have a family",
              "id": 126,
              "comments": [
                {
                  "score": 27,
                  "content": "I like to sarcastically tell my coworkers that, “it is okay, I hatched from an egg that was buried in the sand.”",
                  "id": 127,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Did it work out well or did all the people who hated it feel like they had to keep their resentment silent?",
              "id": 128,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Where I used to work you could take off Christmas or New Years (not both) and the next year you had to switch. If you could find someone to cover for you (say they were big into new years and were willing to work Christmas for it) that was your business.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "This is why I went into teaching when I had children, so I don’t have to work the holidays and am off with my kids. No one else is responsible for my life choices. I can’t imagine thinking someone else owes me their time off because I have kids.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "It's absolutely no one's business why you have the day off.\n\nMother's Day is Sunday. She can travel Saturday and still be there.\n\nYou asked first. \n\nNTA.",
          "id": 131,
          "comments": [
            {
              "score": 1,
              "content": "It wasn't anyone's business, but OP told them all why he took it off anyhow. Absolutely OP doesn't need to switch, the coworker's poor planning is not their emergency, etc, but he's going to suffer the social ramifications either way. \n\nLike, this is a situation where it doesn't matter who is \"right\", bc the consequences don't change. OP is in for a rough time at work for the foreseeable future, and it could've been avoided easily. Gotta pick your battles, and if this is a job you're stuck in, this is a battle I'd recommend skipping.",
              "id": 132,
              "comments": [
                {
                  "score": 5,
                  "content": "Yeah, could have been easily avoided if people didn’t act so entitled. People have the right to book days off for whatever reason, whether it’s to see family, go on holiday, sleep or play video games. You have the right to ask but if the answer is no, then you walk away and get on with life. Throwing a tantrum and turning everyone else against them is immature and quite frankly, workplace bullying/harassment. I’d have written them up for that.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I actually used to work on Mother’s Day and other family holidays. I’m a mother to four kids and my rationale was that I am the one in charge of choosing the time I have Mother’s Day dinner or the thanksgiving or Easter meal. Young adults usually are invited somewhere and have to conform to the schedule they are given. I would offer to work and then plan my guests to come at the time I would be home.",
          "id": 134,
          "comments": [
            {
              "score": 9,
              "content": "When I was growing up, my mother also worked during holidays. Simply because she would get double her hourly pay if she does and it was stupid to say no to that. We just celebrated another day, it's not that hard and we didn't feel like we were missing out.\n\nNot to mention going out to celebrate was way less hectic on any other day but the actual holiday itself. No need to queue for an hour or book 2 months in advance for a restaurant, only to get served a limited menu because the restaurant wouldn't have been able to cope with the rush otherwise.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Exactly! I would have told her too bad and she should have scheduled the day off months ago if it was important.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "This annoyed me to no end when I worked at a call center. MY team came in at 8.\n\nThe second team came in at noon. \n\nIt was a slow day because it was the 4th of july. Members of the second team were leaving at noon cause they have kids so they were letting them leave first. I was so mad... Them having kids doesn't mean they should be getting to go home first when they worked an hour and my team had been there for 5 already.",
          "id": 137,
          "comments": [
            {
              "score": 6,
              "content": "They were leaving at the same time they started? I think you might need a different time in place of one of the two noons",
              "id": 138,
              "comments": [
                {
                  "score": 9,
                  "content": "Oh yeah, my bad. I meant 1-2 pm. Don't know why I said noon. Although they did let some of them go as soon as they got there.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Oh wow would that piss me off no matter if I was there first or told to go home upon arrival. Oh look I've had to travel and waste my money and time just to be told to fuck off/I've been here since this morning why is Bob going home when he just got here?\n\nUsed to really piss me off starting at 6am just to be told to go home at 8. If there's that little to do just tell me the night before and I'll stay in bed, it's not worth my coming in as the money just about covers breakfast and a bus home (earlies one at 9.30 obviously).",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "> date then you would have requested off early, like I did. Anyways I firmly told her no, but she told some of my other co workers and they are pissed at me and calling me an A hole for not giving up the date. AITA? edited typos\n\nAs a mother to an adult child I feel like my daughter who has no children should still be given a day off to hang out with her family who loves her dearly!  I also worked a job in animal care that required coverage every day to include holidays, many of my coworkers didn't have children, what we always did was rotate holidays to make it fair, we felt it made for better working relationships in fact we all still hang out with each other 14 years after the fact.. My former coworkers are actually better aunts and uncles than my daughters actual biological aunts and uncles lol",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "For some reason I read this in the voice of Jay from the Jay and silent Bob movies and the exclamations made it perfect.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I couldn't tell you how many days I've taken off work for game releases.  When Diablo 3 finally came out, I took the entire week off.  I waited over a decade for that baby to be born and I was going to celebrate!  I regret nothing",
          "id": 143,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2554,
      "content": "Birthday week. Mother's Day week...people need to calm down. \n\nNTA. Mother's Day has been on the calendar all year...hell, they could have figured out when Mother's Day 2023 was last year. Enjoy the game.",
      "id": 144,
      "comments": [
        {
          "score": 649,
          "content": "A person could actually look up the date of mother's day an infinite number of years into the future.",
          "id": 145,
          "comments": [
            {
              "score": 286,
              "content": "Whoa, there. You're being all logical and planning ahead. /s",
              "id": 146,
              "comments": [
                {
                  "score": 134,
                  "content": "I've already requested the Friday before mother's day 2052 off so i can travel. I'm really looking forward to it!",
                  "id": 147,
                  "comments": [
                    {
                      "score": 34,
                      "content": "The weather on Mars is beautiful that time of year!",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Bon voyage!",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Will you be traveling via hovercraft with President Darth Vader?",
                      "id": 150,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Alright there genius not all of us can be rocket scientists.",
              "id": 151,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 102,
          "content": "I book my wife’s her Mother’s Day massage 1 year in advance",
          "id": 152,
          "comments": [
            {
              "score": 6,
              "content": "That’s so sweet!",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Love that!!",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 48,
          "content": "Tbh I hate taking my parents out on the appropriate parent day because everything is crowded, overpriced, and rushed. I always take them out on a day before or after.",
          "id": 155,
          "comments": [
            {
              "score": 10,
              "content": "My Mother would disown me and write me out if the will if I dared take her out on Mother’s Day Weekend 🤣 She’s not crazy about restaurant dining on an average day but Mother’s Day? Nope. No way.",
              "id": 156,
              "comments": [
                {
                  "score": 4,
                  "content": "it really is awful.  I’m the same way with valentine’s day lol no point in going out for dinner all crowded me and rushed, much better to just make a nice meal at home then grab discount chocolate the next day.",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Everytime I go to a restaurant during some popular holiday, they would only ever serve a limited \"holiday\" menu. Because they wouldn't have been able to cope with the crowds otherwise. And it's usually only like 2 choices of appetizers, 3 choices of entrees and maybe like 2 dessert items. Boring....\n\nMight as well go on any other day to enjoy the full menu and get better service.",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "My family started doing Easter brunch at home because of the expensive shitshow of going to restaurants at that time",
                  "id": 159,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Same here. My family are inherently practical. Can't visit on my birthday because it'll be a rush? No probs. I'll see you in a few weeks. Mother's day? Let's have it when it suits OUR calendar, not everyone else's. \n\nI said I'd take my mum for afternoon tea as a mother's day gift ( UK mother's day is in march) we've still not done it because a week later she decided to go to France and hasn't come back yet. She said she'll be back end of may and we'll do it then. No probs. \n\nOn actual mother's day I was sick as a dog, so my husband and daughter took me out on a random Wednesday instead. Suits me fine!",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Yeah, like maybe I'm just a terrible daughter, but out of all the holidays we have, I'd never fly home for Mother's Day?? I'd assume that OP's coworker is also far enough to need to fly if they were asking for the Friday off. Like I can travel home and tell my mom she's awesome on literally any other weekend, without having to buy a themed Hallmark card.",
          "id": 161,
          "comments": [
            {
              "score": 18,
              "content": "I'm just confused about why they can't take off Monday instead of Friday and leave Saturday if they really wanna be there for Mother's Day.",
              "id": 162,
              "comments": [
                {
                  "score": 2,
                  "content": "But that would make too much sense!",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Right? Just send flowers and plan for a phone call.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This is my first Mother’s Day… this thread reminded me that I didn’t request off. Luckily I’m not working, but if I was scheduled I would work and deal with it, not harangue other people who made plans in time. Def NTA.",
          "id": 165,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Well, my family is lucky cuz my birthday and mothers day are either a day apart or fall under the same umbrella, so if I'm taking time off for my birthday I can also count it as mother's day for my mom",
          "id": 166,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1274,
      "content": "NTA - You are allowed to care more about your own happiness than about her happiness.",
      "id": 167,
      "comments": [
        {
          "score": 297,
          "content": "[deleted]",
          "id": 168,
          "comments": [
            {
              "score": 58,
              "content": "OP will be at home playing The Legend of Zelda: Tears of the Coworker.",
              "id": 169,
              "comments": [
                {
                  "score": 9,
                  "content": "Brilliant- this had me burst out laughing",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "Haha. This is the response op should have given her",
              "id": 171,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 41,
          "content": "I don’t think it is even fair to classify this as OP caring MORE about his own happiness, this is OP caring equally about their happiness. They both deserve happiness and the opportunity to take days off, and clearly not everyone can take the same day off, so the fair way is first come first serve. If the other lady had planned her day first, OP wouldn’t have tried to get he to switch, because he DOESN’T care more about his own happiness…he cares equally.",
          "id": 172,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "OP should have told co-worker...\n\n**I absolutely care more about this video game than your family, it would be really strange if I didn't, I don't know them at all.**",
          "id": 173,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 721,
      "content": "NTA. Someone’s else’s poor planning does not mean they are entitled to what you fairly requested off. It’s your right to use your pto for whatever you want, no matter what day it happens to be.",
      "id": 174,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 593,
      "content": "NTA\n\nIt doesn't matter why you want the day off. Bottom line is that you requested this long ago, and it was approved. \n\nAs for the coworker that wants to travel for Mother's Day, last I checked this has been an annual holiday for over 100 years and you can google future dates for years to some. If this coworker really wanted the Friday off before Mother's Day, she could have easily requested it in a timely manner. \n\nHer lack of planning is not your problem. \n\nEnjoy your day!",
      "id": 175,
      "comments": [
        {
          "score": 120,
          "content": "Also wouldn't it make more sense to take the Monday after mother's day off so she won't have to travel that day home to make it to work the next day, also there no reason she can't just leave after work Friday.",
          "id": 176,
          "comments": [
            {
              "score": 4,
              "content": "OP is definitely NOT an asshole and well within their rights to keep their PTO day so they can play Zelda. The coworker definitely should have planned and submitted the PTO request earlier.\n\nBut it’s totally possible that she DID already take the following Monday off, but also still would need that Friday off as well for the logistics of her travel to be viable.\n\nThere can be a massive difference in airfare and available flights between when Friday night after work is your only option, compared to being able to fly out Thursday night or Friday morning. I’ve been in situations where flying out on a Friday night would have been $500+ more expensive than a flight on that Thursday.\n\nThe coworker would have been totally justified in taking however many days off she wanted to make that Mother’s Day trip work best for her. Wanting the Friday off is not why she’s the asshole.\n\nShe’s only the asshole for trying to pressure/guilt OP into giving up his PTO, and for trying to demean OP’s hobbies",
              "id": 177,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 293,
      "content": "NTA, everyone knows when Mother's Day is, and she had the same amount of time to request off as you did. She's trying to guilt trip you into feeling sorry for her and giving her your day off. Its your day off, what you do on your day off is up to you! Enjoy the game and have a great day off!!",
      "id": 178,
      "comments": [
        {
          "score": 92,
          "content": "Considering the company had to implement a limit due to the number of people requesting off, how many other co-workers requested it off, got turned down, accepted it, and made alternative plans with their mother or their kids? It doesn't sit well with me that she's requesting the time off so close to the event and feels like she can \"jump the line\" of people that had previously requested it by guilt-tripping OP.\n\nIf something is important to you, you plan ahead. I want to take the day off to see the total solar eclipse next year. Do you want to guess the first thing I'm going to do when I get to back to work January 2, 2024 will be?",
          "id": 179,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 275,
      "content": "This exact thing happened to me! Skyrim came out and I used an entire week of vacation to play it. (Excessive, I know…) I made the mistake of telling people that and my supervisor tried to get me to cut it down. Even though it was requested months ago and was already approved and work was covered, everyone thought it was a silly reason to not be there. Someone else wanted that time off for another reason so they asked again. I said no. \n\nAnyway, I enjoyed my week. When I came back, people were pissy for about two or three days but eventually moved on. The lesson is, however, don’t tell people why you are taking YOUR TIME OFF! It sounds silly but you are just opening yourself up to criticism. There are people who actually believe your time off is open to debate and what’s important to you may not be important to them. Enjoy the game, they can either plan accordingly or adjust their schedule. It isn’t the end of the world. And next time you have an important release date, say you have an important appointment and leave it at that. \n\nNTA.",
      "id": 180,
      "comments": [
        {
          "score": 69,
          "content": "My coworker took a week off for the RE4 remake and he always takes staycations anyway. He lives a short walk away from work, but we would still NEVER call him in... he's allowed his time off to do whatever he wants! I think your advice to not tell people what you're doing if you're not going out of town is the way to go for sure! Tbh, I'm thinking of taking a game vacation myself soon.",
          "id": 181,
          "comments": [
            {
              "score": 5,
              "content": "Go for it! I put in some days for Final Fantasy 16 lol",
              "id": 182,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Hell yeah buddy. I’m taking a week off for the Diablo 4 release. I know it’s pretty sweaty of me lol",
              "id": 183,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "This. I said in another comment that I like a phrase like “a personal issue” if anyone asks. It’s vague, but also sounds like something serious/important so most people won’t ask further questions.",
          "id": 184,
          "comments": [
            {
              "score": 34,
              "content": "Agree. Most people don’t ask but occasionally someone will say “doing something fun?”  I usually say  “Maybe if there’s time,” implying that something more serious is happening. I’ve never had anyone push for more after that, however someone did push a co worker about what he was doing and after deflecting a few times he said “hemorrhoid surgery!” In an angry voice. The whole office was quiet for the rest of the morning.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "I take vacation days whenever a game I really want to play comes out. I used to work for a company just like yours. Got criticizes to fucking hell for daring to take days off and take people away from their families >.> \n\nNow I'm at a much better company. I can be honest about why I took the days off and when I come back, some of the team is actually interested on how my vacay went.",
          "id": 186,
          "comments": [
            {
              "score": 3,
              "content": "It's mad that people would get pissy about taking a day off to play a video game, whereas if you said you were taking it off for a film premiere or to go to a theme park they wouldn't give a shit, even though all of those are in the same general category of fun thing imo.",
              "id": 187,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I dont take many days off but every single time i get asked why i wont be working i say \"ill find out when my fiancée tells me\"\n\nLast time was to go a few hours to an AMC theater to see Spider-Man and go to their Lego store...none near me :(\n\nIm sure i would have been required to take over the bullshit job that of course was scheduled for my day off had they known what i was doing. Instead it was ambiguous and deferred the reasoning to someone they cant get mad at.",
          "id": 188,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Yeah, I would never tell someone why I’m taking time off or calling in. Family issues or sick is the general consensus although my coworkers wouldn’t really care either way (as in if i took a week just to lay in bed and sleep they’d be cool with that because… i requested it and it was allowed, therefore why not? It’s my PTO), but it’s better not to mention it at all. If you have to, I guess you could always be vague and say you made plans with friends or family that are hard to get out of then later slowly reveal what it was, but… there’s not really even a need to tell coworkers what’s happening with your personal life",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I'm trying to see my baseball team play in every stadium. All of my coworkers and my boss know that is (almost certainly) *why* I have requested time off from April-September. It's not a \"dumb\" reason to request time off...it's my hobby, and is no less valid than traveling to visit family (one of my trips (location-wise) this year is one a coworker takes frequently...to visit his family! And another one involves visiting my family since they live nearby the stadium in question!), or celebrate a hallmark holiday, or go to a friend's milestone birthday, or visit a place you've always wanted to, or go on a second honeymoon, or any of thousands of other reasons people take time off from work!",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I jokingly called a co worker lazy for taking a day off, he then started trying to justify his day off to me. I was like, dude, enjoy your day off, I don’t give a shit what you do on your day off, that’s your prerogative. If you want to sit in your undies and watch TV do that. It doesn’t and shouldn’t matter what you do on your day off, it’s not relevant to anyone at your work",
          "id": 191,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 201,
      "content": "NTA.  It doesn't matter why you took the PTO, it was approved and it is yours to take.  This is a management problem, not your problem.",
      "id": 192,
      "comments": [
        {
          "score": 67,
          "content": "It's not even the managers problem in this case, it's a her problem. Her failing to plan ahead does not mean it's the managers problem to fix. She messed up.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 177,
      "content": "nta, be blunt, you videogames are more important than your coworker, and thats it\n\n\nor , be petty as i would\n\n\" clearly you dont care about your mom, you would have requested the day months ahead of time, just because you dont value your mom enough to set up the time off in time doesnt mean i should give up my day\"",
      "id": 194,
      "comments": [
        {
          "score": 61,
          "content": "Great ideas for interacting with a coworker!",
          "id": 195,
          "comments": [
            {
              "score": 36,
              "content": "if they dont value my reasons for taking time off, i shouldnt have to value theirs. And, its not ops fault the coworker doesnt like their mother enough to request the time off with enough time lol",
              "id": 196,
              "comments": [
                {
                  "score": 15,
                  "content": "I don’t give a shit if you don’t value their reasons for taking time off. Nobody is saying OP should give up his time. Can you indicate where I implied otherwise? I’n not seeing it. Your suggested response to them is unprofessional and childish.",
                  "id": 197,
                  "comments": [
                    {
                      "score": 48,
                      "content": "Sometimes it's easy to read these storys as soap operas and forget \"Wait, if they did the most savage thing possible it might just have comsequences\"",
                      "id": 198,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 0,
                      "content": "Kinda like calling him an AH and saying they don't care about families and the general going off on op? Be childish and unprofessional, and you can't really cry when you get the same energy back.",
                      "id": 199,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "That's one way to get called in to HR",
          "id": 200,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 0,
          "content": "People are really over exaggerating or over estimating how much backlash you get for being mildly rude back to someone who starts it, obviously it's different from place to place, but for the most part, no one cares about someone being mildly rude on time to one person, heck, I have yelled at managers when they have been acting dicks, being in the right helps quite a bit, I am not polite to people who don't deserve it, and I have never had a hard time getting along with the people who do deserve it.",
          "id": 201,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}