{
  "post content": "Alright Reddit. Here to get my judgement. So I (26M) have been dating my GF Chloe (26F) for 3 years. We started out as friends and have known each other since HS. She really is perfect for me in every way. Other than her family which is the cause for this post. \n\nSo when we first started dating I was wanting to get married. But about a year ago I switched that up. The reason sounds stupid but it just caused me to freak out. We were watching this show that talked about divorced men and their struggles. It turned me onto a couple sub Reddit’s on here about men who got boned in divorces. Weather that be cheating spouses, alimony or the freedoms men loose when they get married. I sometimes wish I never went down that rabbit hole. But I did and ever since I’ve been very clear with Chloe I don’t want to get married. \n\nI’m fine being life partners. Having kids. All that. I told her this and she was very sad. We did split up for a bit. But she came back and said she didn’t mind. She is fine with whatever life we build. So that is what we’ve been doing. The issue?? Her family is nosy as shit. After getting questioned countless times about it we finally sat them down and explained we don’t plan on getting married. Her family lost it. Saying that I was the one forcing this and bunch of other BS. Her sister especially is pissed. \n\nWe are at a BBQ this weekend. And sure enough her sister is mouthing off. She is recently engaged and was throwing shade about “how amazing it is to be committed”. I caught some side glances from her parents. I looked at her and said “if you have something to say go ahead”. She said “you just wouldn’t understand the feeling”. I said “well considering you’ve been engaged 3 times and married once already. I’m not quiet sure you know the right feeling either sweetie”. Her dad and mom then butted in saying I needed to take that back. I said “both of y’all have been divorced before. So maybe stop the petty glances and look in a mirror”.\n\nI was done after that. And me and Chloe left. I know it’s not smart getting into with your GFs family. But I feel like they are crossing a boundary and I felt like it had to be said. Chloe is staying out of it mostly. But I want to make sure I’m not the AH. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 12054,
      "content": "NTA for the question at hand regarding her family.  Don't throw stones if you live in a glass house or some shit....\n\nBut as a male whose divorce literally bankrupted him you're dumb AF for letting a TV show and some Reddit threads be the reason you're not going to get married. Take the time you need to be sure but your reasoning is flimsy. \n\nFor what it's worth I said I was never getting married again. Just hit 7 years with my girlfriend and will more than likely propose in the somewhat near future. Never say never.",
      "id": 2,
      "comments": [
        {
          "score": 4840,
          "content": "Exactly. OP doesn't once mention a single issue in his relationship or real life that would cause him to change his views on marriage - it is literally just an internet rabbithole.\n\nYou don't lose freedom when getting married either, unless you really aren't that committed to your partner. So I'm not sure where he's getting that idea.\n\nOP seemed like he just read the comments of a bunch of pissed of men online and didn't do any actual research into the marriage laws in his state, how pre-nups work, any existing common law marriage laws where he lives, etc. Not to mention it seems like he didn't actually discuss this with his girlfriend at all, just randomly told her one day he'd never marry her.",
          "id": 3,
          "comments": [
            {
              "score": 1578,
              "content": "Yeah, I had an ex who waxed nostalgic about the times before being in a committed relationship, and vaguely mentioned “sacrifices” one makes. I gave him all the freedoms by promptly breaking up.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1023,
              "content": "Dude never heard of common law marriages either. If he’s worried about losing out in a divorce he can face the same things after a certain amount of years of living together. This girl should have taken the hint. He’s just not that into her if he can be so easily swayed not to want to get married\n\nEdit- and if they have kids and separate it’s no different than if they were married so I’m confused as to what he’s actually worried about that a prenup wouldn’t cover\n\ni would be pissy with him too if I was her mom.",
              "id": 5,
              "comments": [
                {
                  "score": 698,
                  "content": "Not to mention OP says they will have kids. That takes away the most “freedom” and ties him monetarily to his gf for 18 years. His reasons for not getting married are really flimsy. He has never been personally impacted by a divorce and it sounds like he doesn’t know anyone in real life that was. She could get child support, insurance, all sorts of awards in court if they have kids. Saying you will have kids with someone but not marry them because you don’t want to lose your freedom or be out money when you break up is faulty reasoning.",
                  "id": 6,
                  "comments": [
                    {
                      "score": 242,
                      "content": "I’ve never been married before but doesn’t marriage also give you benefits of some kind?\n\nAn old coworker told me how he married his wife. He got stabbed, went to the hospital, and the bill arrived (because US healthcare) and his then-girlfriend said “Wouldn’t it be nice if this bill was lower? Like, if we were married?” And he asked if she was proposing. When she said yes, they got married.\n\nAnd I’m not sure, because again, never married, but aren’t there some authorities each other would get as each other’s legal partner, like medical choices in case of accidents. My long-term boyfriend wasn’t allowed input when I was in the hospital.\n\nAnd aren’t the taxes better?\n\nThis needs more research than “I love you, babe, but I’ve watched some stuff and read a lot of forums and even though I’ve never personally been victimized by divorce, I just can’t marry you. But let’s have children!”",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 60,
                      "content": "Dude, all of this. My partner and I have been together for over 20 years, and we have two young children together. He has made mention of the fact that I could take him to the cleaners so badly if we went our separate ways, lol, and he’s absofuckinglutely right! He’d have to pay all the same things that he would if we were “officially” married. OP has no clue about how ***not*** having that paperwork gives him no real “protection”.\n\nEdit: spelling",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Also (at least here in holland) if you’re married and have kids as a man you have way more rights and are way better protected than when you’re not married. So this is some Internet bs",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Well my state doesn't recognize common law marriage.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Been a while, but I think I read somewhere only 8 or 9 states out of the 50 recognize common law. It's slowly dying out it seems.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "It's literally instant here for assets. The day you and a partner share an address, shared assets are up for grabs if you break up. \n\nLearned that the hard way.\n\nThey make you wait a bit for alimony (just precedent and common sense not a law) but property is up for grabs from day 1. The courts are pretty reasonable, but say you bought a new living room set when they moved in,  they can sue to claim ownership of it if they move out the next day.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Not all states recognize common law marriages. You have to look it up for your state.",
                  "id": 13,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Not all states recognize common law marriage. Arizona, where I live, doesn't.",
                  "id": 14,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Op watched too much day time court TV/read too many divorce threads and now fears marriage.",
                  "id": 15,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Not all states have Common Law Marriage on their book! So it depends on their state",
                  "id": 16,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "https://www.npr.org/2016/09/04/487825901/no-you-re-not-in-a-common-law-marriage-after-7-years-of-dating",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Less than ten states now recognize common law marriage in the US. Cohabitation agreements and prenups can do a lot if each party enters with good representation to steer them in the right direction.  \nI mean, I wouldn't marry a 26yo who was already reading MRA pages and worrying I'd take his money \\[now\\] but at 26 and with this kind of pressure from my family to be in a relationship, I might have. Poor OP's gf. I think he's NTA for this specifically but maybe AH more generally.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "\"Hes not that into her\"\n\nMarriage doesnt equate to commitment.\n\nIts no wonder people think its the end all be all of relationships.\nYall put it on a pedestal. Ignoring how half of them fail. And 25 to 30ish year old women are initiating 80 percent of the divorces.\nAstounding how you took that out of this. Hes not into her. Lmao okay",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 101,
              "content": "And apparently didn’t visit the divorced mothers ghetto.  That shit cuts both ways, it ain’t just men getting chewed up and spit out in a divorce.",
              "id": 20,
              "comments": [
                {
                  "score": 2,
                  "content": "Dude my sister's ex husband drained her savings account that she put his name on after their wedding and then left her. he is also on his 3rd baby mama.....classy.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "[deleted]",
                  "id": 22,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Marriage with a shitty partner is a bad idea for everyone involved.  Marriage with a good partner is great.\n\nPeople need to be better people, and have better judgement of character about potential spouses.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "No, divorce is a bad idea for both parties.  Entering into a marriage with that understanding is recommended.",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 100,
              "content": "OP was indoctrinated by the MRA. And he can't seem to wrap his head around the fact that, in most places, if you are with someone long enough, you have the same liabilities in a split as you would in a divorce. Being married, however, makes some things easier legally.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "It’s actually disturbing the amount of men who are making real life decisions based on YouTube and Reddit echo chambers. This is becoming a theme on Reddit.",
              "id": 26,
              "comments": [
                {
                  "score": 2,
                  "content": "It's disturbing the amount of people who think the internet is a good place to get any kind of crowd sourced data whatsoever. Great place to find data that's already been gathered through traditional means, terrible place to gather data on anything that happens in the real world.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "> OP doesn't once mention a single issue in his relationship or real life that would cause him to change his views on marriage\n\nNeither did the other guys he was pointing at as an example, until of course they did. But by then it was too late. They got screwed. \n\nWhat OP doesn't realize is those people are extreme cases. The vast majority of cases are nothing like that.",
              "id": 28,
              "comments": [
                {
                  "score": 15,
                  "content": "Prenups exist and would solve most of those problems.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 4,
                      "content": "They wouldn't a lot of times actually. Prenups are good for protecting assets you come into a marriage with but generally not as good for defending decisions inside the marriage. In cases where a spouse is awarded alimony, for example, it's entirely possible that the court would have set aside a prenup. \n\nBut, again, divorces like that are in a minority. People may feel slighted in any divorce, especially if hard feelings are involved, but generally the courts strive to be fair to all parties involved.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Nah.  Unless you have significant assets prior to marriage there's not a lot to protect.  And they get thrown away for unfairness all the time too, i.e. a prenup forgoing alimony has a high likelihood of getting tossed if one person leaves the workforce to be a SAHP for an extended period of time.\n\nBasically - if you own a house or business, have a trust fund, or win the lottery prior to marriage, call up a lawyer and get that document written.  Anything less than those?  you'll probably spend more paying the lawyer than you'll save on the back end of the marriage.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "[deleted]",
              "id": 32,
              "comments": [
                {
                  "score": 6,
                  "content": "100% agree",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 62,
              "content": "Yeah, what freedoms is he talking about?",
              "id": 34,
              "comments": [
                {
                  "score": 79,
                  "content": "-The freedom to leave the relationship at any moment without legal entanglement (which is negated if the couple are living together / have kids anyway), \n- the freedom to sleep with other people (which is not a freedom most people in serious committed relationships have, married or not), \n- the freedom to not pay for a divorce (again, still has to happen in most places with common law marriage), \n- the freedom to not have to share finances (well that last one is the real issue, obviously - it's a lose-lose for men, because they either have to pay extra because they earn more and contribute to jointly held retirement funds /insurance / loans / home ownership / etc etc, *or* they don't earn more and therefore feel emasculated when their wife pays extra). \n\nIt's 100% men who feel they might lose any of their independence and control. It's a fantastic way to show someone you love them and want to spend the rest of your lives together - by insisting that you won't do it because you aren't going to risk \"losing your freedoms\".",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 60,
              "content": ">just randomly told her one day he'd never marry her\nbecause he needs be able to dip at any moment apparently. \n\nCompleted that thought for you.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": ">OP seemed like he just read the comments of a bunch of pissed of men online\n\nI wonder how many were actually married once-  and how many of those were just incels.",
              "id": 37,
              "comments": [
                {
                  "score": 21,
                  "content": "oh 100%. not only is the internet a biased sampling of real life (like which content men are talking about how healthy their marriage is in those same pages) but i’m sure a huge portion of these men he’s reading about are just making shit up on the fly to be inflammatory",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I mean maybe, but that doesn't invalidate the experience of the men who did get fucked over. Women have lied about being raped before but I'm not caveating every claim I hear with \"how many of them were actually raped anyways lol\".",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1052,
          "content": "Also, it seems short sited. Living together, owning property together, having children together all of those things mean that breaking up is going to have a *very* similar result as getting divorced (has OP looked up what the laws around common law are where they live). Like, your life is entangled, unentangling it is going to be messy either way. \n\nAnd her family isn’t wrong, you *are* the reason she’s accepting not getting married. I’m curious, if you are asking her to give that up for you… what are you sacrificing/giving to her to meet her needs? Like the motivation for your decision is really, truly selfish especially considering *so many* studies show that marriage benefits men not women. \n\nBut NTA for telling her family to stay out of your business… but… how did Chloe feel about what you said? Are you here asking us because *she* says your an AH? Because if she does then her vote is the trump.",
          "id": 40,
          "comments": [
            {
              "score": 69,
              "content": "THIS is the one I really hope OP takes to heart. I wish I had an award to give ❤️",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "What’s funny is if they break up while owning a house and realize that having to bring a partition action to sell your house because your ex doesn’t want to is so much worse than getting a divorce",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I mean while op reasoning is not the strongest let’s not put his gf choices on him. She isn’t forced to stay with that man she made her choice and has only her to be accountable for",
              "id": 43,
              "comments": [
                {
                  "score": 2,
                  "content": "No. I agree. But my point is: First, her family knows what she wanted about marriage and probably understands that HIS decision is why she’s now not aiming for that, and she might choose to stay that doesn’t absolve her partner from trying to be her *partner*. And not just expecting to get what he wants without thought to meeting her needs. That can all be true AND she can be responsible for her decisions.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 1,
                      "content": "If someone changes their mind express it to you and you decide to leave AND then come back it is not on them to meet your need. You are not a child and you making an informed decision to go back and continue a relationship that is not fulfilling is on you not on that partner. Is op reasoning sound and well researched no obviously but let’s stop blaming the man for everything it’s tiring .",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "> Also, it seems short sited. Living together, owning property together, having children together all of those things mean that breaking up is going to have a very similar result as getting divorced (has OP looked up what the laws around common law are where they live).\n\nIf OP is in the US common law is likely irrelevant bc a minority of states recognize common law marriage and/or have processes in place in which a common law marriage can be formed, but it takes years or decades +. So many bring up common law as if it’s really thing and for most in the US it’s not (other countries certainly function differently)\n\n> And her family isn’t wrong, you are the reason she’s accepting not getting married. I’m curious, if you are asking her to give that up for you… what are you sacrificing/giving to her to meet her needs? Like the motivation for your decision is really, truly selfish especially considering so many studies show that marriage benefits men not women.\n\nNah, OP’s gf is the reason she’s accepting not getting married. If, after the breakup, she came back to him and was willing to tamp down her desire for marriage, that’s her choice - a foolish one, but hers alone.",
              "id": 46,
              "comments": [
                {
                  "score": 14,
                  "content": "Op definitely needs to look into his local laws. My husband and I wanted to do common law but our state doesn't recognize anything but legally married. So we had to get married sadly. But if they don't want any of the legal issues of marriage then they do need to talk with a lawyer and see how to protect themselves. I do have a prenup with my husband, but I also have assets that are set up in a way that will never be seen as marital assets even without the prenup. A great lawyer is the best thing to spend money on.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Yes, that’s why I asked if he knows about the cooking law laws, but that’s still irrelevant owning property and having kids together entangles your lives and makes breaking up awkward. If what he really wants is protection from detangling entwined lives then he needs to stay single.",
                  "id": 48,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 530,
          "content": "Also, prenups are a thing for a reason, if the possibility of getting hosed in a divorce is the issue, there are legal documents made specifically for that purpose.  OP you should seriously consider it.  \n\nNTA about the family though, I'll admit I laughed at what you said to the sister, she really shouldn't be giving marriage advice.  Was she engaged three times to different people, or was it an off-and-on sort of thing?",
          "id": 49,
          "comments": [
            {
              "score": 6,
              "content": "Ah, this is the comment I was looking for.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Prenups aren't actually worth a whole lot, the wife can claim that she signed the prenup under duress saying she believed you wouldn't get married to her if she didn't sign and the judge will throw it out.",
              "id": 51,
              "comments": [
                {
                  "score": 2,
                  "content": "> you wouldn't get married to her if she didn't sign\n\nIsn't that the whole point? How the fuck does \"if I don't do this, I do not get what I want\" count as under duress?",
                  "id": 52,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Under duress generally implies that it was signed without the other party having their own independent legal counsel to review it.\n\nTo whit - if someone signs a prenup without counsel, it will almost universally get thrown out since they were not adequately informed of the legalese by an expert without bias.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Because that is the state of divorce courts, but none-the-less it is quite common and quite a few guys who thought they were safe with prenups have ended up getting burned in divorce court.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -9,
              "content": "Prenups are notoriously unreliable.",
              "id": 55,
              "comments": [
                {
                  "score": 38,
                  "content": "The only reason they are 'unreliable' is because they were done poorly/illegally. [Reasons they get tossed.](https://www.hg.org/legal-articles/prenups-can-get-thrown-out-if-they-are-unfair-48729)",
                  "id": 56,
                  "comments": [
                    {
                      "score": -8,
                      "content": ">or when terms are unfair.\n\nThat's what makes them basically useless. If they have to be found fair by a Court to be effective, then a Court would make orders to the same effect.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 366,
          "content": "Yep. Partner watched his mother emotionally devastate his father during their divorce and decided he would never marry. At a certain point I explained that if we agree to commit for the rest of our lives, have kids together, buy property jointly, etc. a breakup would not really be less emotionally devastating than a divorce. If he really didn't trust me to commit to me, that's a fair position to take. If he did, being married would make many things about our life much easier (like combining financing, buying a house, etc).  \n\nWe got married last summer.",
          "id": 58,
          "comments": [
            {
              "score": 125,
              "content": "Congratulations on your wedding, and for understanding your partner’s concerns and communicating your needs effectively. I had a similar story, I won’t bother you with, and we’re about to celebrated our 3rd anniversary.",
              "id": 59,
              "comments": [
                {
                  "score": 29,
                  "content": "Happy anniversary :) I'm glad it worked out for all of us!",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "I have a cousin who got out of a four year relationship with his girlfriend. They had lived together for two years. He described it as a divorce without the paperwork. He has yet to live with another girlfriend since.",
              "id": 61,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 30,
              "content": "I was a committed single who happened into an adult, respectful, committed relationship. When my partner brought up marriage, I said ‘yes’. Nearly a decade later, zero regrets.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "My mum had a horrific divorce with my father. He's an asshole so we expected it. She told me she'd never marry again and I completely understood. She's been married to her wife for 8 years this year. She's so happy and living her best life and I love that she was able to find that.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 126,
          "content": "This. OP can get a prenup if he's that concerned, but in some places (including my state) men have LESS rights when it comes to kids, etc., if they weren't married to their partner. OP seems to have come up with an excuse not to get married, and her family is seeing his partner feel trapped because she loves him, but sad because she wants to get married.\n\nNTA for the situation, but, man, OP needs to look at this woman and seriously decide if a show and Reddit are enough to never marry her.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "NTA for the family bit.\n\nYTA coz you're blaming the internet for not wanting to get married. I am ROFL-ing at the statement \"freedom that men lose when married\".",
          "id": 65,
          "comments": [
            {
              "score": 0,
              "content": "You're not in touch with reality.",
              "id": 66,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 74,
          "content": "I honestly thing this is in the realm of “needs therapy.” People of every gender get utterly fucked by marriage, relationships and divorce all the time. But there’s really pragmatic things people can do in order to avoid this. This sounds like a reason to really put the time, energy and money into a solid prenup rather than a reason not to get divorced. \n\n\nThat said, animosity, resentment and fear between the genders can really snowball and make heterosexual relationships precarious. It sounds like he’s been somewhat traumatized by some MRA type subs and needs someone impartial to help him get grounded.",
          "id": 67,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 47,
          "content": "It’s called a prenup if OP is worried about finances.  All the other issues he brought up can happen in relationships whether you are married or not.  I’m curious what other ‘freedoms’ he thinks he loses when he gets married.  That’s the the person you are with, not the marriage, that puts additional restrictions on you.  Marriage is just a legal issue really that gives married couples the right to make medical decisions for each other or file taxes jointly.  Tbh, having kids is what makes you lose most of your freedoms.  And what makes you most vulnerable if you split.",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "I'm the ex wife and my divorce left me financially devastated. I'll never get to retire. And I make a real good living. I think when both spouses are essentially equal in income, etc, you both get left ripped up, especially when your financial planning had banked on you growing old together. 20 years is a long time but we were far from old, only 42. \n\nI probably won't ever marry again but I've had a wonderful boyfriend for 4 years and I'm content in that relationship.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I studied matrimonial law and it doesn't make me want to get married... even though if my bf wanted to, I would jump right into it. I understand OP but yeah, his reasons are messed up.\n\nI cannot get over the fact though that OP is scared of basically being trapped with marriage but is okay with having kids, I mean, there's no bigger trap than kids. You can get out of a marriage, not kids. If it's being trapped and the mess it causes in case it fails that scares OP, being okay with kids makes zero sense imo.",
          "id": 70,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4030,
      "content": "YTA. Your reasoning for not wanting to get married is completely ridiculous and proves that you are way too immature anyway.",
      "id": 71,
      "comments": [
        {
          "score": 1368,
          "content": "Plus, if he lives in a common law marriage state, the absence of a marriage certificate will not matter when they split up.",
          "id": 72,
          "comments": [
            {
              "score": 297,
              "content": "Common law is a lot more complicated than living together.",
              "id": 73,
              "comments": [
                {
                  "score": 220,
                  "content": "In some places. In some places all you have to do is live together and refer to each other with spousely titles.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 155,
                      "content": "So, I’m good if I keep calling my gf dude?",
                      "id": 75,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "Or even if one of you refers to the other with a title assigned to a spouse and can prove that you received mail at the same address. I was very lucky that the state I lived in ditched that definition of common law marriage, or I'd have been responsible for someone who'd gone completely off the rails.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Spousey titles is key.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Some places, I think people just have to assume your married to be considered common law. My aunt had to formally divorce her boyfriend because of this.",
                      "id": 78,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Thats true, specially if they have kids like he mentioned",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "https://www.npr.org/2016/09/04/487825901/no-you-re-not-in-a-common-law-marriage-after-7-years-of-dating",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Most states require you to legally file for common law. You don't just get it for living together long enough. In Washington you have to file paperwork with the state, it's just like applying for a marriage license.",
              "id": 81,
              "comments": [
                {
                  "score": 18,
                  "content": ">In Washington you have to file paperwork with the state, it's just like applying for a marriage license.\n\nThat's incorrect: the term \"common law marriage\" *specifically* refers to protections offered to someone who lived with someone else without any paperwork defining their relationship. If it requires *any* paperwork it's a \"marriage,\" not a \"common law marriage.\" \n\nAnd while Washington does not use the term CLM, they *do* recognize property rights during separation from a \"committed intimate relationship,\" which is then the exact same thing as a common law marriage.\n\nNOTE: I am not a lawyer, I am not *your* lawyer, this is not legal advice.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Filing paperwork is also required for Texas Common Law marriage. My now-husband and I researched it before we wed (traditional courthouse vows). You don't just wind up default married after living with each other for a particular time period anymore. You both have to make an official declaration.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 99,
          "content": "Plus he almost seemed to want to fight about it. I’ve been around guys like that, always ah’s.",
          "id": 84,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 81,
          "content": "Yes, girlfriend would be better off breaking it off and finding someone with the same life goals as she has.",
          "id": 85,
          "comments": [
            {
              "score": 10,
              "content": "Except she seemed to have accepted his preference. If they are happy together why would she break up with him?",
              "id": 86,
              "comments": [
                {
                  "score": 18,
                  "content": "Because he’s the kind of person who sets his life goals based on things he read on salty subreddits",
                  "id": 87,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "She left him over it initially because it clearly wasn't what she wanted. I'm willing to bet that she went back because she'd rather be with him and not have the life she envisioned that be without him. I did that. He didn't want to marry, ever, and I had to make that choice to stay. It hurt like a sonofabitch. Then one day he woke up. His reasons were all based on old relationships and he realized he was taking those out on me. We've been married coming up on five years. And it's been wonderful. OP, not the AH for wanting her family to back the hell off and mind their business. Completely the AH for your immature reasons and not being nearly as tuned into your supposed partner's needs.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "Because this is reddit and people love to project their ideas of what's right and wrong onto other peoples relationships. \n\nThings change, people change, wants, goals, ideals all change.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 48,
          "content": "Sure, he's TA about his reasoning, but that's not what this post is about. It's his interaction with the GF's family. Y T A for passing a judgement about something that he wasn't asking about.",
          "id": 90,
          "comments": [
            {
              "score": 56,
              "content": "He was also a complete AH with them. He is the AH on all levels.",
              "id": 91,
              "comments": [
                {
                  "score": 23,
                  "content": "Yeah he should have just shut up and take it because he doesn't want to get married like Normal Good People!",
                  "id": 92,
                  "comments": [
                    {
                      "score": 27,
                      "content": "Normal Good People have Normal Good reasons not to get married. i'm sure if he had a personal and valid divorce-related trauma, there would be Normal Good Sympathy from Normal Good People, both here and elsewhere. but self-indoctrinating yourself into MRA propaganda? then maybe you should try harder to be a Normal Good Person.",
                      "id": 93,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 36,
              "content": "The context *makes* him the asshole in this situation. Context is always relevant in these threads. You're being intentionally obtuse.",
              "id": 94,
              "comments": [
                {
                  "score": 11,
                  "content": "Since when is it acceptable for your partner's family to get their nose all up in your business?",
                  "id": 95,
                  "comments": [
                    {
                      "score": 6,
                      "content": "because she's still their daughter.",
                      "id": 96,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "No because the problems are between his and the gf that still went ack. And the points he made to the in laws are actually true",
                  "id": 97,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "He literally asked them. He instigated when they were just talking about the sisters engagementz",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 36,
          "content": "It's kind of hilarious that a functional (?) adult would read one-sided stories about something that is innately emotional and causes severe bias and think \"oh yeah this is objective information I should base my life choices off of.\"",
          "id": 99,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "\"I accidentally fell down the bitter lonely misogynist section of the manosphere and I can't get up!\" - OP probably",
          "id": 100,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Absolutely. \"Nothing was wrong but I went down an angry man reddit rabbit hole and now marriage is evil.  She was heartbroken but still loves me so Im right.\" YTA",
          "id": 101,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "And sounds like he started the fight. They were talking about sisters new engagement, he “felt” judged and instigated a fight. Not everything is about OP.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "He never once mentioned any issues in his relationship, he's let a few people on the internet ruin what could have been a lovely outcome of their relationship. Poor GF wanted to get married probably seeing as she was upset, seems like she's putting her wishes aside just to be with him.",
          "id": 103,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 0,
          "content": "No it's valid to be worried about that",
          "id": 104,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3257,
      "content": "YTA for two reasons\n\n1. It seems like you're looking for reasons to get offended and argue about your viewpoints on marriage\n\n2. Your views on marriage are misinformed at best. Especially because you formed them by going down internet rabbit hole where anonymous people share their opinions about marriage - and on reddit - where there are a huge amount of men with highly misogynistic/incel-like viewpoints who spend all of their time denouncing marriage and women. \n\n* You don't \"lose freedom\" when married. You have no less freedom than you do in a committed long term relationship\n* There is no reason to worry about cheating unless you worry your current long term partner will cheat on you. \n* There's no reason to worry strongly about alimony unless you already support your SO or you plan on fully financially supporting her in the future\n* the MAJORITY of the things you are worrying about here will still be a problem if you have kids and are in a long term relationship and never get married. You would still have to go to family court, you would still pay child support, many states have common law marriage, etc.\n* You never seem to have had a reasonable conversation about this with your SO - no discussion on pre-nups, your future plans, etc. You just told her one day that you decided you won't marry her.\n\nYou are letting extremist internet rhetoric shape your view of marriage, and a lot of what you've \"learned\" is false or misinformed. You told your long term partner you won't marry her because of what you read on internet forums - of course the people in her life will be confused and judgmental. Also your girlfriend was under the impression that you would get married for years. You changed your opinion on that based on no actual issues in your relationship and put her in a shitty situation.",
      "id": 105,
      "comments": [
        {
          "score": 619,
          "content": "I’m wondering if he even looked at it from a woman’s perspective. Having kids takes a tremendous toll on a woman’s body and her career prospects. He’s not the only one who would be taking risks here.",
          "id": 106,
          "comments": [
            {
              "score": 142,
              "content": "yeah having kids isn’t some walk in the park and while men with kids usually see a boost in lifetime earnings, having kids negatively impacts women financially even if they continue to work full time.\n\nOP is pretty hypocritical by acting that he is a victim of the system but refusing to acknowledge the expectations he’s putting on his gf and how having children will effect her",
              "id": 107,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 91,
              "content": "money meeting start dull run fertile deliver theory water mindless\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
              "id": 108,
              "comments": [
                {
                  "score": 26,
                  "content": "Yes! And even in a household where childcare and work are split evenly, there is bias in the workplace. Studies show that men with families are more likely to get raises and promotions because they are viewed as \"needing to provide.\" On the flip side, women are more likely to get overlooked for promotions or career progression if they have children because people assume they won't work as hard or will take time away from work for their kids, completely regardless of how hard these women actually work in reality.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 26,
              "content": "Thank you! So many commenters don't seem to understand this. For many women their career will never be the same after kids. It's not archaic or paternalistic to point out that marriage does in fact protect women/mothers who may not earn as much but who deserve an equal stake in the familial assets.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "On the whole, women tend to come out of marriages considerably worse off than men. Less so if there are no children, but if there are... it's not usually men getting hosed.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 161,
          "content": "This is actually good news for the girlfriend. OP is like a piece of clay for the internet to mold. This won't be the first or last time he'll make major life decisions based on Reddit. Might be best for her if she didn't commit to this guy either.",
          "id": 112,
          "comments": [
            {
              "score": 15,
              "content": "> OP is like a piece of clay for the internet to mold.\n\nHope OP stays VERY far away from wallstreetbeets",
              "id": 113,
              "comments": [
                {
                  "score": 5,
                  "content": "He already lost everything in Dogecoin.",
                  "id": 114,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "the freedom op talks about is fucking around without having to pay alimony later because cheating on a spouse means the spouse can get money",
          "id": 115,
          "comments": [
            {
              "score": 2,
              "content": "[deleted]",
              "id": 116,
              "comments": [
                {
                  "score": 2,
                  "content": "sorry, i am german.  forgot we dont have it all the same",
                  "id": 117,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "Just this. OP, you need to see the 'manosphere' for the misogynistic nightmare it is. There's probably other really damaging propaganda of theirs that's affecting you and your relationship. It's definitelynot the way to a fulfilling relationship with a woman, at all.\n\n(Laura Bates' book 'Men Who Hate Women' is a great analysis of what's going on in these extreme sub-cultures, if you're interested, OP.)",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Omg I hope his GF sees this post and starts thinking.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1782,
      "content": "what on earth are you talking about when you say \"freedoms men lose\" when they are married?",
      "id": 120,
      "comments": [
        {
          "score": 1160,
          "content": "don't you know? the second you get married, your beautiful gf turns into a bitter nagging shrew who restricts all of your free time and lays down rules about what you can and cannot do /s",
          "id": 121,
          "comments": [
            {
              "score": 177,
              "content": "You actually need the /s in this case because half the stories on this sub are exactly that, with the genders swapped \\~>50% of the time.",
              "id": 122,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 80,
              "content": "Psh I was a bitter nagging shrew even before I married my husband.",
              "id": 123,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": "I didn't need the marriage - I turned into a nagging shrew after 4 years of dating. (We did long-distance for 4 years, and have lived 10 minutes away for the last 2 years. I blame proximity.)",
              "id": 124,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "My husband is the nagging shrew, so am I actually the husband and he is the wife? 🤔",
              "id": 125,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -11,
              "content": "Pretty much exactly happened to me. Together 8 years before marrying, had an amazing relationship and rapport of communication (or so I thought). No abuse, infidelity, nothing. I won’t say I was a perfect man, but 6 months in she was ‘bored with being married’, despite us going on vacations, seeing friends and family regularly, hopefully trying to start a family.\n\nThe stereotype of great partner turned shitty spouse knows no gender.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 510,
          "content": "I'm waiting for the list of things men lose that women don't in marriage.",
          "id": 127,
          "comments": [
            {
              "score": 291,
              "content": "If she willingly gives up her body, her free time, and ability to make her own financial decisions, she’s really gaining so so much. A man!  /s. It’s only the man who loses. /s",
              "id": 128,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 100,
              "content": "Well it's okay if women lose things, see.",
              "id": 129,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "Did we not read the same post?  His worries are about what can happen from divorce, not marriage.  You guys are hyper focusing on one single aspect of this post, and not the point of it, just to attack.  Normal reddit shit where people pick and choose what they read just to be argumentative.  That's called Texas Sharpshooter Fallacy, a hallmark of group think.\n\nAs someone who is divorced, their concerns are real.  I had as clean of one as you can get, they still try to sell the woman on taking everything.  Family court is wildly stacked against men and you are at the complete mercy of the judge you draw.  \n\nYou gain absolutely nothing from marriage unless you have kids, absolutely nothing, but you risk losing a ton.  It's nothing more than a document to legally tie your assets to another person, that's literally all marriage does, It's an amazingly stupid thing to do as a man and it's strictly because of the court system with thier insanely heavy finger on the scale against the favor of the man.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 272,
          "content": "As soon as a man gets married a bunch of cloaked women emerge and lock his dick in a box and then one of them swallows the key. The only way to get the key back is to essentially vivisect one of the woman, but which one? There could be hundreds of them! By that point they'd probably have pooped it out. The key would be lost to space, time and the sewer system. \nDon't get married if you don't like penis coffins.",
          "id": 131,
          "comments": [
            {
              "score": 77,
              "content": "\"Your Honor, they performed an ancient cult ritual and contained my member in a cursed hell-coffin that I do not believe originated on our  plane of existence. The key is long gone and I can feel something moving in the box.\"\n\n\"Yeaaah, I hear your concern, but kids do really need a *mother figure.*  You can get every other weekend.\"\n\n\\*Hell-box moans\\*",
              "id": 132,
              "comments": [
                {
                  "score": 9,
                  "content": "It's a dick in a box!",
                  "id": 133,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": " step 1, cut a hole in the box",
              "id": 134,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "How do I get invited to watch one of these rituals?",
              "id": 135,
              "comments": [
                {
                  "score": 10,
                  "content": "You have to be a married woman to get invited. If you are already married and a woman, did you include the part in your vows where you promise to bleed him dry and not let him play fantasy football? It's in the fine print, not everyone sees it. But you need to say it to become #ONE OF US",
                  "id": 136,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 260,
          "content": "Statistically men live longer, happier and more successful lives if married when compared to unmarried men and the inverse is true for women in straight marriages. \n\nYTA Op for looking for opportunities to vent about your negative views on marriage at an engagement party.",
          "id": 137,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 84,
          "content": "That one got me too. Like, is this dude in the 1950's where people can't even be in the same room as someone else until they're at least engaged? Every single wedding I've been to in the past 10 years was a couple that had already lived together for an extended period, paid bills together, all sorts of married people stuff. Most of them had even bought a house together already. Even the ones who hadn't, when asked if their life felt different now that they were \"tied down,\" answered \"umm. no, nothing has changed at all....\"",
          "id": 138,
          "comments": [
            {
              "score": 24,
              "content": "The biggest change when I got married was I got to be on my husband's health insurance plan that he and my daughter were already on. The premium didn't even change because it was a family plan for up to 6 people. Our house that we already owned together didn't change, same for our cars. In fact, what did change is because of my new health insurance, we were able to plan, conceive, and have our second child. That would've been a crippling financial decision without me being covered. Oh and with us being married, my husband's life insurance limit was bumped slightly higher, and he got a highly discounted small life insurance policy for me. Taxes are simpler for both of us as we file jointly, and we save a small amount of money on taxes that way as well. So yeah, if anything, there were perks.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 80,
          "content": "Don't you know that when men get married a literal ball and chain gets automatically attached to their foot?",
          "id": 140,
          "comments": [
            {
              "score": 19,
              "content": "That explains why they’re always late to everthing",
              "id": 141,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 78,
          "content": "Seriously! If you’re a good, committed partner your life shouldn’t really change much after getting married.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "The freedom to support their partner as a stay at home mom for a few years, then dump her and not pay alimony even though she's given up her career development to raise your child. I know there's nuances in some states regarding this, but it's a very uncertain position to be in without a legal commitment.",
          "id": 143,
          "comments": [
            {
              "score": 64,
              "content": "And belittle her as \"taking your stuff\" when those five years off work have completely and permanently fucked up her ability to retire...forever.",
              "id": 144,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 57,
          "content": "Right?? If anything, women lose freedom when they get married. In my state, I’m like one step away from being my husband’s property.",
          "id": 145,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "I'm guessing the freedom to fuck other women. 🙄\n\nReal talk tho those \"men's rights\" videos are just made by neckbeards after their yearly shower lol.",
          "id": 146,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1038,
      "content": "YTA. You are 100% right that you shouldn't get married.\n\nThe immaturity in your line of thinking all around is clear and you are not ready. You will take a TV show as a life changing source but not put in the work to even look at how to protect yourself and still get married. Instead you decide you want the benefits, which ya know, include an actual human and making actual humans, etc but clearly haven't given thought at protecting them. Everything is about you. \n\nYou will still have risks at your eventual breakup you already assume will happen. If you are going to break up, just call it dude. Let her have her life.",
      "id": 147,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 872,
      "content": "YTA So you want all the security and perks of a marriage without the responsibilities like fidelity, child support, etc. And, obviously, mutual  decisionmaking. But you're the only one who's allowed to have to an opinion about this. Got it.",
      "id": 148,
      "comments": [
        {
          "score": 176,
          "content": "> child support, etc.\n\nChild support still happens regardless if they are wed or not. But seriously my partner and I have lived together as friends for 6 years before we started dating. When living as friends things still got intertwined to where if something happened it would be a mess. Marriage clears all that up. If he thinks getting divorced will screw him over wait until an unmarried partner dies no will (or even with a will and a vindictive family) and all your loved one's assets go to their parents or siblings.",
          "id": 149,
          "comments": [
            {
              "score": 3,
              "content": "OP probably doesn't know your first sentence",
              "id": 150,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "Who says you don’t have to be loyal to your significant other without marriage??? Also if you live together there should be mutual decisions, and also child support happens regardless",
          "id": 151,
          "comments": [
            {
              "score": 18,
              "content": "I guess by fidelity they meant that marriage emphasizes on the need of being loyal, and in case of cheating, the blighted partner will be compensated in divorce court with proof of infidelity.\n\nCheating within marriage comes with more consequences and responsabilities and in many countries it's still an aggravating factor in divorce court. Cheating in a relationship is just a bit like \"ah, what an asshole\" before you dump their ass & you're left with nothing but the feeling of being cheated on ; while the cheater may only have a bit of guilt and that's it.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": ">fidelity\n\nI'll take a leap here and say 1. most people will expect their partner to be faithful, married or not and 2. being married unfortunately doesn't protect from infidelity.",
          "id": 153,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -134,
          "content": "He literally said him and his gf broke up over it, then got back together when she decided she was ok with it. He’s not the only one with an opinion?",
          "id": 154,
          "comments": [
            {
              "score": 62,
              "content": "Exactly. They broke up over it. She left him because she didn’t want this. It’s his decision to be doing it this way. \n\nYour point that she went back to him doesn’t mean she’s ok with what he has done/won’t do//said. It means she’s not in the right relationship and knows it but is too scared, pressured, insecure, manipulated, ….. take your pic of reasons why women go back to him.",
              "id": 155,
              "comments": [
                {
                  "score": 14,
                  "content": "[deleted]",
                  "id": 156,
                  "comments": [
                    {
                      "score": 21,
                      "content": "That’s the kind of love that turns into deep resentment",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 699,
      "content": "ESH\n\nYou said a bunch of rude, insulting things that you didn't have to say. You were also super condescending.\n\nMeanwhile you yourself know that your refusal to get married is almost completely due to not trusting women specifically. You weren't converted by stories about people getting screwed over by shitty partners. You're paranoid about men getting screwed over by their wives. You're also imposing that paranoia on your girlfriend (which is also a referendum on what you think about her character, btw. She's being very generous to get back together with you.)\n\nMarriage offers innumerable benefits and protections to both spouses. Your \"life partner\" is *not* your next of kin; as far as the law is concerned, without any kids, you two are (at most) roommates. If you died without a will, she wouldn't even be entitled to keep a pair of your socks. If you wound up incapacitated, your parents could ban your girlfriend from seeing you. There's also all sort of tax and financial benefits. Spouses have all sorts of privileges.\n\nI think that you should sit down with a lawyer to talk about how prenups work in your state. It's *highly* probable that most of your concerns could be addressed via the legal system. There's a very good chance that you're unnecessarily disadvantaging yourself due to an irrational fear.",
      "id": 158,
      "comments": [
        {
          "score": 113,
          "content": "OP is delusional if he thinks his girlfriend can't find similar subreddits of women sharing horror stories about their husbands. Bet he would feel offended if she lumped him in with with the worst men out there based on Reddit annecdotes.",
          "id": 159,
          "comments": [
            {
              "score": 58,
              "content": "Perhaps to an even worse extent as well. I've seen a horrifying amount of stories of women dealing with heavily abusive husbands. If OP is allowed to look her in the eyes and say he will never marry her because a few guys on reddit got cheated on, she's entitled to dumping him on the spot for fear of him hitting her one day. \n\nOP, if by some miracle she does not figure out that she deserves better than you and still wants to stay, you need to get your head out of your ass. What, you think men don't cheat on their wives?",
              "id": 160,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 27,
              "content": "I mean, this sub alone could provide you with more than enough stories about husbands turning into lazy, self-centered misogynists to forever put you off marriage if you're a woman.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 96,
          "content": "I had to scroll way to far for ESH. All are shit except the girlfriend. \n\nRude OP and rude family",
          "id": 162,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "ESH. This. All of this.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 444,
      "content": "YTA\n\nYou arbitrarily made a decision that impacts her life too. Of course her family is going to say shit to you. You're also basing that decision off of bitter angry men on the internet. That's amazing. \n\nIf I were her parents and she explained all that to me, I'd do everything possible to get her away from you. You sound super immature and what's next? Same group of men endorses beating your girlfriend so you do it because you read it on the internet? Please. Turn off your internet and experience life for yourself instead of through the lens of people who lived a different lives that left them broken human beings unable to care for others.\n\nYour girlfriend deserves better. YOU deserve better. \n\nExpect that her family will push for her to get away from you because you are NOT going to provide a good relationship to her if you're getting life advise from incels.",
      "id": 164,
      "comments": [
        {
          "score": 41,
          "content": "Nah, the next will be not having kids because he's read about men who don't find their wives attractive anymore after pregnancy to fuck and/or dead bedrooms after kids get in the picture. \n\nHis needs before anything else.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -110,
          "content": "“If I were her parents … I’d do everything possible to get her away from you” you’re part of the problem then. Parents don’t get to make choices about their ***adult*** childrens relationships. \n\nAlso he says in the post that he brought this up to his gf, she didn’t like it, then they split up over it. Then she *chose* to come back and say that she didn’t mind. So he’s not just “making choices about her life arbitrarily” she was ok with it and the parents need to respect that and stay tf out of their relationship.",
          "id": 166,
          "comments": [
            {
              "score": 71,
              "content": ">“If I were her parents … I’d do everything possible to get her away from you” you’re part of the problem then\n\nIn the same way that I would be part of the problem, if I was trying to keep my drug addicted child away from drugs, would try to restrict access to big sums of money to my gambling addict child, would want my teenager away from the 50y old adult that's trying to date them, would...\n\n\nLike IDGAF if it would save my son/daughter.",
              "id": 167,
              "comments": [
                {
                  "score": 2,
                  "content": "Yeah, it's obvious from the initial breakup that the GF really did want to get married and is compromising her own desires to stay with OP. I would encourage anyone I cared about to think very hard about that kind of sacrifice.",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 329,
      "content": "Info for you: if you are living with this woman, in a home, with children, it won’t matter if you aren’t legally married because you would be considered common law spouses and then if you were to separate payments would still be on the table",
      "id": 169,
      "comments": [
        {
          "score": 33,
          "content": "Depends on the state and how they go about things. It's not as simple as living together. Where I live they have to agree they are married. Live together after agreement as a married couple. And represent themself to others as they are married.\nLikely aside from that I'm sure on legal documents such as taxes they can also put down they are married and file together will help cement this in place.\nBtw i think their are like 15 states or so that do not recognize common law marriage so chances are higher that he could end up like that depending on their own laws for it",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "In the US, common law only applies in 6 states, and it’s much more complicated than just living together. You have to act as married, say you’re married, and file taxes as married.\n\n“Common law” isn’t as common (as in prevalent) as people think it is.",
          "id": 171,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "https://www.npr.org/2016/09/04/487825901/no-you-re-not-in-a-common-law-marriage-after-7-years-of-dating",
          "id": 172,
          "comments": [
            {
              "score": 1,
              "content": "Not everyone lives in the United States, you aren’t the only country to exist",
              "id": 173,
              "comments": [
                {
                  "score": 5,
                  "content": "Sure. Which country were you referring to in your comment?",
                  "id": 174,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 250,
      "content": "why dont you get a pre-nup then get married.",
      "id": 175,
      "comments": [],
      "relation": "No"
    }
  ]
}