{
  "post content": "My husband was out of town on a Saturday for a sporting event he left in the morning and wasn’t home until around midnight that night. We have 3 kids 13, 10, and 3 so I was home alone with them which is fine and normal since he travels for work often as well. However on this particular day I wasn’t feeling well (tmi) I had just gotten my period and I suffer for the first day with major headaches, backache, cramps etc. normally, I can manage these pains by working out prior to or during and for some reason I don’t suffer from the pain as much and am able to function like a normal being. I didn’t work out this week because I just didn’t have time so here we are. I just could not function on this day and just hoped that if I laid in bad and got some rest I would feel better and be able to get it together. In the mean time I let my older boys play video games and my 3 year old played with toys on the bed next to me while I rest. I couldn’t get it together I ended up feeling like this for the majority of the day. We don’t have family in the state we live so calling grandma wasn’t an option. So I let my boys play video games for basically the whole day (they normally have an allocated amount of screen time). I played with my 3 year old with toys while I lay in bed and I ordered all of their meals for the day just waiting for the clock to hit bed time. I didn’t make anyone shower and eventually we all went to bed. This is not how a normal day would pan out so I didn’t think it was a big deal to let this happen on this particular day being that I felt like sh*t. Anyway my husband was pissed that I let the kids play video games all day and let them eat take out for all 3 meals and made me feel like an A-Hole. I didn’t think it was a big deal being that I usually cook healthy meals and they have pretty rounded schedules for the most part I didn’t think one day would be such a big deal plus needless to say my boys loved the fact that they could FaceTime their friends and play video games all day so it’s not like they were miserable. But he really made me feel like an A-Hole for neglecting the kids.\n\nEdit: I left out the part of how I didn’t take my older son to his basketball game that day either. He did have a game and he said he didn’t want to go he loves basketball and is super good at the game. I know my son well enough to know he didn’t want to go because of the fact that it was basically a free for all at home and he didn’t want to miss out. I knew that and basically didn’t care since he made the decision not to go and I didn’t guilt. I guess that was a part of the main issue that my husband said I let him back out of a commitment to just sit around and play games all day especially knowing that he was backing out bc video games were is priority.\n\nMore info: Just to answer a few questions that\ncame up, I did not include the basketball game in my original post because it wasn’t an issue until I showed my husband my post and the responses and that is when he mentioned my son missing the game as mainly why it was messed up and that is why i included it in the edit but prior his main concern was that they were on video games all day and ate crap all day. He's never missed a practice\nor game before in the many years that he's been playing other than this one time. I had taken a few tylenol and was very fatigued there was no way i was going to put my 3 kids in a car and drive them anywhere. I did call the coach ahead of time to let him know and he was fine with it (a bit bummed\nbc he is a great player but they had enough kids to play). Could I have sent him with a friend? Yes. However a month ago he did have to ride with a friend home from practice bc I had to get my other son to Drama and they got in an accident and he's a little nervous right now about getting in the car with others. \n\nThe kids schedules aren't military structured, they are in school most the day and after school my older has basketball or football and academic decathlon. My other son does drama, chess, and science club. when they get home its usually dinner and homework so there isn't much time for\nvideo games so we usually carry that in our favor and it aides in the 1 hour screen time rule. all of the kids after school activities are theirs by choice meaning these are things they ask to do. Some of these events carry out into the weekend but the rule is still there of 1 hour screen time (video games).\n\nIt wasn't a financial issue regarding the take out it was more that he's a bit of a health nut and once in a while is cool but 3 times in 1 day is crazy to him. Yes, my older son can make his own food however his clean up isn't the best and i didn't want to deal with that. also, maybe I was feeling a bit guilty for not being present and that could be why i ordered in rather than told them to figure it out. Yes, he also could have watched my youngest and he is helpful in that way when i need him to, like if I'm making dinner or something like that but I thought it would be really messed up if I made him do that for the whole day while I just lay there.\n\nAlso, he was at a warriors game last night (6 hours from where we live) my oldest son was with him but the other two were home with me and things did not go the way they did the last week so no this isn't a common thing.",
  "id": 1,
  "comments": [
    {
      "score": 9728,
      "content": "I didn’t do it often, but sometimes, when my kids were small and we just didn’t start the day off welI called us out sick and we’d nap, build lego things, and generally not care what anyone thought. \n\nThey’re 25, 26, and 28 now, and remember that as some of the best days of their lives. You aren’t doing anything wrong- don’t let anyone tell you different.\n\nDefinitely NTA!",
      "id": 2,
      "comments": [
        {
          "score": 4631,
          "content": "Plus it teaches them that it is ok to take a day off when needed. That there are solutions for days when you just can't make your body work.",
          "id": 3,
          "comments": [
            {
              "score": 992,
              "content": "I remember trying to push through and put on a brave face when I was sick when I was younger. Especially things that didn't have a physical obvious problem like headaches or cramps. \n\nYour kids will remember that it is okay to have an off day to take care of yourself.",
              "id": 4,
              "comments": [
                {
                  "score": 326,
                  "content": "I totally get that. I used to do that all the time in high school. It didn’t matter if I had nasty cramps, a sore throat (pre covid of course) or was just having a bad day. If I could pretend to be fine, I would push myself so hard it was ridiculous. \n\nI wish I had a better understanding of taking a mental health day and I think OP is actually teaching her kids a good thing.",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 95,
                  "content": "Exactly! Especially because when you’re younger, there are older people that don’t seem to think you could possibly have anything physically wrong with you if it’s not glaringly obvious. As someone who is 22 with “invisible” chronic health issues and works as a server/bartender, I still have to constantly remind myself that it’s not a failing on my part to have to let my body rest sometimes. It’s better to listen to your body and take a day of rest than to keep pushing and possibly end up significantly worse",
                  "id": 6,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "Let your husband be sick and your out of town and see what he accomplishes. Probably the same thing you did.",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 529,
              "content": "Such a good point, modeling self-care is important",
              "id": 8,
              "comments": [
                {
                  "score": -7,
                  "content": "[deleted]",
                  "id": 9,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Op gave him a choice. Modelling that his choice matters. A 13 year old missing one game of sport is not showing his team that he doesn’t give a rats about them. It’s one game. It’s better to model to the kids that taking time when you’re not feeling well (even if it’s not the child and it is the parent who doesn’t feel well) you can have an off day and just relax. That’s better than teaching them that no matter how you feel, physically or mentally, you need to be putting others before yourself. That’s not okay.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "You don't know his situation. For all you know he's attending games just to sit benched as an alternate. When I was a kid, I completely lost interest in soccer playing defense because our team was too good. The ball never made it to our side of the field. I was a little resentful about running laps and doing practice to prepare myself to stand around doing nothing.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 365,
              "content": "I used to take mental health days from work when mine was little. Usually, we'd either go out to breakfast or, if I was feeling unwell and needed rest, set up in bed and watched movies together.\n\nAs a teen, if they are having a bad day, they now know how to use self-care techniques, ask for their own mental health day, or ask for someone to pitch in to help them meet the basic care they need. Making sure they didn't feel guilty for not being on 24/7 and knowing how to manage that was important to me.",
              "id": 12,
              "comments": [
                {
                  "score": 152,
                  "content": "All of my mom friends think I’m weird for allowing my older school aged kids have mental health days, where they can stay home from school and just do nothing all day. It’s not excessive/more than once or twice a year but I think knowing the option is there for them helps a lot even on days they don’t stay home. I’m glad other parents do this too! It’s so important to teach kids their mental health is just as important as their physical health, in my opinion.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 12,
                      "content": "My (otherwise fairly strict) mom let me do the same in high school in the early 2000s. I didn’t need them that often, but they were honestly invaluable simply to prevent burnout. She’d often use it as a day for just the two of us to do whatever we wanted together.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "My kids are both in their 20s now and they totally remember the mental health days i let them take. Both are wildly successful and maintain a decent work/life balance.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "I needed to hear this today. Thank you.",
              "id": 16,
              "comments": [
                {
                  "score": 3,
                  "content": "I struggle with this too. I find it helps to give myself that advice as though I'm talking to a friend.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "When I was a kid i was sometimes \"school sick\" it used to be a glorious day of lazing in bed, watching TV all day just because it was a bad day to get up. I was allowed to do that till I finished school as long as I didn't abuse the \", school sickness\".",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Yes, husband got a childfree weekend, so OP and the kids should be able to have a responsibility free day.\n\n&#x200B;\n\nNTA",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yes, that is very important if ya want the kids to have a healthy life when they are adults",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "My parents used to call these \"mental health days\" and it taught me a valuable lesson on self care that I still keep to.",
              "id": 21,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 254,
          "content": "My mom did similar, and those are such great memories.\n\nOP made sure her kids were fed, happily occupied and safe. It was also just one restful day, not something happening long term.",
          "id": 22,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 231,
          "content": "My parents would assist in us playing hooky sometimes. We'd hit the nearest city and go to a mall, have lunch, sing in the car, and just enjoy being together. My dad would come bail me out of school sometimes if we had good weather for snowboarding. Some of my favorite memories, right there!",
          "id": 23,
          "comments": [
            {
              "score": 32,
              "content": "I totally do this with my kids! They also get one day off with no reason. Sometimes it's just too hard, or everything's sucks.",
              "id": 24,
              "comments": [
                {
                  "score": 18,
                  "content": "Yeah, my parents never really spilt hairs when we asked to stay home because we were good students. After I got accepted to my college and my senior year turned into busy work that wouldn't make my transcripts, I fucked off for a whole week to play golf with a clinic at my sister's college and took a few trips with my friends. I still have a healthy school/life balance to this day.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "My mom would do this too. She called them ‘Miss You Days’ cause she said she’d just miss having her kids around and then we’d do fun family things and chill instead of going to school. As long as we didn’t miss exams or something important, it was cool. Those were my favorite days.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 140,
          "content": "I call those mental health days. My kids all have excellent grades. Sometimes you just need a day off from life. And pancakes for dinner.",
          "id": 27,
          "comments": [
            {
              "score": 30,
              "content": "That’s exactly what we called them, then and now. It was an excellent time for us to reset everything.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 96,
          "content": "I felt like I was shirking my duty as an employee, but then I realized that the kids growing up well adjusted were far more important.",
          "id": 29,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 77,
          "content": "^ this. My mom gave us hooky days about once per semester and at 30 years old these are still some of my best childhood memories",
          "id": 30,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "I had to have been in like 3rd grade. My mom wasn't feeling well. She asked me if I wanted to play hookey... Thing was, we had a board game called that & I was just confused as we were running late. So I said no. Only time she ever asked.\n\nNTA.",
          "id": 31,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "Honestly, this is good parenting when done in moderation. Missing a few days of school is no big deal when you’re younger as long as you teach your kids that school and grades are important and that missing a few days does not mean it will happen all the time. \n\nMy parents didn’t want us to miss any school. Obviously if we had the flu or something we wouldn’t go, but if it was a little stomach ache or small headache, we were given medicine and our butts would be in the car with the rest of them. \n\nOne time I felt sick. My mom told me I had to go to school. I got halfway through before I went to the office. Mom was mad thinking I was pulling the sick card again and drove down to get me. Tells me to go out to the car while she signs me out. I sat in the car and started to close the door before I caught it and barely managed to throw up outside.\n\nI think because of this, when I was younger part of me would lie to miss a day. Sometimes school, classmates, or teachers can be a lot and you just need a break. \n\nLet your kids be able to talk to you about these things. Give them a break. Work it out together and they can go back the next day. Let them know it’s not okay to skip important things such as school, but that their health is also important and they have to understand when their school work will be affected by their health (whether that’s physically or mentally)",
          "id": 32,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "You have top comment and so should add an official NTA judgement so it gets counted by the bot",
          "id": 33,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "I bet if the husband would fell the pain that OP felt, he would lie in the bed all day, whining and scream for OP because it hurts so much. \n\nHe was out for a fun sports event and left her alone while being in pain with the three kids. He can't complain how she handles the kids than when he does absolutely nothing! \nA fun day doesn't hurt the kids. A father who gives a f*ck about the health of the mother hurts the kids more.\n\nNTA",
          "id": 34,
          "comments": [
            {
              "score": 2,
              "content": "Seriously, how about someone kicks him in the lower abdomen a few dozen times and sees how great he is at handling the kids.\n\nOP, I think you did a great job with the kids. Sounds like they had a fun day and were well taken care of. NTA",
              "id": 35,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5080,
      "content": "NTA, you weren't feeling well. It's not like they were neglected (in endangering form or long periods of time). They were being fed, had their basic needs and were entertained. Maybe not the most healthy way but it was just this once.\nYour kids probably would remember this day as an awesome fun time.",
      "id": 36,
      "comments": [
        {
          "score": 1677,
          "content": "It's actually important for kids to learn that people get sick or don't feel well. They learn that their schedules are disrupted and things need to change. Healthy homemade meals aren't always a possibility when someone doesn't feel well. Kids learn this is **okay** and they learn to adapt to changes. Yes, honoring your commitments are always important, but not when a person is sick and they either can't or it would be detrimental to their health. This type of lesson is really important later in life when they meet people with mental illnesses or diseases they can't see.\n\n\n\nOften times people will automatically assume the person is lazy, not living up to commitments, and not telling the truth. But you're helping to teach your kids, No, these people aren't lazy, they are sick.\n\n\n\n**\"Remember when you were younger and there were a few days where mommy didn't feel well? She would rest in bed and play with younger sibling while you guys were responsible for entering yourselves. You mostly played video games and everyone ate take out? You guys had a lot of fun! But, mommy didn't look sick on the outside did she? That actually happens a lot. Just because mommy didn't look sick didn't mean she wasn't.  So just because this person doesn't look sick it doesn't mean they're lieing and just being lazy does it?\"**\n\n\n\nThis is how children learn empathy. Also, like it was already said, they probably had a great time! Your kids will probably look back on these days fondly. It's like having a snow day. Unexpected but a lot of fun. Not detrimental to them at all.\n\n\n\nNTA",
          "id": 37,
          "comments": [
            {
              "score": 205,
              "content": "They also learn that it's ok to be sick. The amount of times I've pushed myself way too hard, even to the point of damaging myself, all because I never learned that being sick was ok. \n\nI now have a long term illness that is worse than it needed to be because I couldn't understand that it was ok to take time out to heal.\n\nAlways sticking to commitments, never giving yourself or allowing yourself a break, not listening to your body, this is how people work themselves into an early grave.",
              "id": 38,
              "comments": [
                {
                  "score": 72,
                  "content": "That's a really good point. I ended up with a few severe illnesses. As an adult my life is nothing like I ever imagined. I've said so many times, **\"Why didn't anyone ever tell me that I could end up this way??!\"** Because it really does just blind side you. Then you're feeling like a horrible failure because you didn't accomplish anything that you were supposed to. Everyone told you what steps to take. You listened and did everything correctly. But no one stopped to say \"Oh, btw, life might just screw you over and you'll never get to that place everyone has always been saying.\" So when it happens, it's a lot harder to accept and deal with.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 21,
                      "content": "I think that my chronic illnesses are so severe because I was raised to push myself no matter what, and I pushed myself right into burnout and severe chronic pain. It's hard to give yourself grace and time to recharge from this crazy life, especially when taking days off or not working full-time can be looked down on, or even career ending.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "The idea that \"moms never get to be sick\" is incredibly damaging. That you have to suck it up and get through your normal routine and that's just not always the case",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "Absolutely love your comment 🙌🏽🙌🏽",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Seems like husband need to learn that lesson on empathy. I find it appalling that he has no empathy for his wife who was stuck at home with three kids while feeling like crap. If he's so concerned about it, he should have stayed home to take care of the kids and cook healthy meals.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "*This*! NTA",
              "id": 44,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1061,
          "content": "“Remember that day Mom had her period and I finally kicked your ass at MarioKart??”",
          "id": 45,
          "comments": [
            {
              "score": 114,
              "content": "😂😂😂 yessssss!!",
              "id": 46,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 621,
          "content": "Exactly this. I just spent a week and a half in pure survival mode with my kids because we all had Covid and I was sick as hell. They watched more TV than they've ever watched in their *lives*. Normally they might watch a show or movie once a week or even once every couple of weeks... This was hours a day for days on end. A couple times I bundled them up in my bed, put a movie on the tablet and slept next to them. \n\n No one had much of an appetite, but we ordered food several times. And a lot of their \"meals\" ended up being apples and peanut butter because I just wanted to get something into them and they could keep it down. Oh, and popsicles. So many popsicles. I didn't make them do any school work (oldest was too sick to do the work that was sent home, and I literally didn't have the energy to make the kindergartner do his even though he felt better before the rest of us). \n\nLooking back, I don't feel even a single shred of guilt for any of the above. I felt bad about the food at the time, but no one wants to be forced to eat when they're sick and I eventually let it go. Desperate times, desperate measures and all that. u/Allincan, your husband can fuck all the way off, and I hope you make him handle them the next time he's sick.",
          "id": 47,
          "comments": [
            {
              "score": 199,
              "content": "I feel like this is good for mental health too. My husband and I work really hard, long hours and we have a three year old. It’s Saturday today. We hung around the house in our pajamas and watched movies and played in the playroom. It is ok! We are taught way too young to be productive all the time- and this leads to counterproductivity because our society is burnt out. Let them have a day or two sometimes!",
              "id": 48,
              "comments": [
                {
                  "score": 24,
                  "content": "My wife and I do this, too.   \n\n\nOne day of the weekend, or both mornings up until a set time, is recuperate time. We have an energetic 4 yo who has been at home more than at school the last few weeks, 2 energetic dogs who get worked up when the kid gets worked up, we're in the middle of major house renovations we're doing ourselves, wife has a 40 hour wfh job, and I have a 30 hour job I work on site. We need a break and use weekends for this.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 3,
                      "content": "My mother was also a very anxious person and constantly told my sister and I “get up and do something productive”. All the time. There was never a Saturday in our house like this. It has led to several conversations of guilt with my therapist where I shouldn’t be feeling guilty. Let the kids have a day!",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I’m glad you guys are doing better!  Being sick sucks and I’m glad you don’t feel guilty about anything. I honestly think you did a great job considering the circumstances and your kids learned a super valuable lesson about taking care of themselves, especially when they feel like garbage",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 356,
          "content": "I think the only danger this day has is the kids hoping for another sick day...",
          "id": 52,
          "comments": [
            {
              "score": 166,
              "content": "True, but if the kids have any empathy or sympathy they understand OP wasn't feeling well. And hope she doesn't have that often",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 84,
              "content": "[removed]",
              "id": 54,
              "comments": [
                {
                  "score": 31,
                  "content": "Maybe they should all get more \"sick days\" - honestly it sounds like the boys especially needed a chance to relax",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 64,
              "content": "I mean, unless they're gonna poison mom in the hopes of having a video game tournament, I think this 'issue' will self-regulate. 🤣",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Quick go sneeze on mom see if we get another day!",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 114,
          "content": "So they had a red snow day. \n\nThere's a reason kids love snow days, but they know they're rare, that's why they're special.",
          "id": 58,
          "comments": [
            {
              "score": 2,
              "content": "I’ve always been facinated by the concept of snow days. Not once, in my entire life, has school been closed because of snow. And it’s not for lack of snow! I live in northern Sweden, we get a lot of snow during winter. The most that’s ever happened is that PE changed from outdoor to indoor because it was too cold, but never because of snow. \n\nDoes it only happen in places that doesn’t normally get snow?",
              "id": 59,
              "comments": [
                {
                  "score": 4,
                  "content": "I grew up in one of the snowiest cities in the US, and we still had a couple of snow days every year. School buses would start their routes earlier than many snowplows, so if there was a nor’easter that dumped 3 feet overnight, it wasn’t a safe drive on our country roads even if it was soon cleared up enough for people to make it to work. \n\nIt did take a lot for school to be canceled, as every other day (all school year, basically) buses would do just fine driving on packed snow or salted roads with huge snowbanks. Sometimes a “snow” day was for other winter issues though, like when the windchill was -40F and the heating system at our school broke down.\n\nFwiw I’ve been living in southern states for the past decade and they don’t have the infrastructure or tires to deal with it, so yeah, the rare snow day every couple years is when it dips just cold enough for the roads to ice and disrupt the whole state for the day.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 2,
                      "content": ">School buses would start their routes earlier than many snowplows,\n\nThat’s very interesting. Here the snowplows can start as early as 4am if it’s bad enough (I really really hope no child was ever forced to ride a school bus whose route started earlier than 4am! That would be horrible)\n\nI guess it’s also a matter of how large your town is, come to think if it. I’ve never lived far enough away from school that I couldn’t either walk or bike, though I did take the bus in the winter. No school busses here, tho, just normal busses\n\n>like when the windchill was -40F \n\nFun trivia: -40 is where Celsius and Fahrenheit merge. It also really is cold as fuck 🥶",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "It generally happens in places that don't get much snow, so when there's a deluge we're overwhelmed. \n\nIn the UK we might get an inch or so over winter, not enough to stop daily life and it generally melts quickly. We don't have snow tyres or chains because we would use them so infrequently (and they cut up the roads if you don't have a lot of snow) we just have snowploughs/road gritters. \n\nSo when 6 inches or more (one winter as a kid we got 12 inches) is dumped on us, and the low pressure hovers so it doest melt by the next morning, we can't navigate it. \n\nIt's not a regular occurrence here, maybe once every 5 years or so there's enough snow to close the schools, and usually only for a day while the snowploughs clear the major routes.",
                  "id": 62,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 89,
          "content": "In our house, I used to call these days \"Mommy Holidays.\" Sometimes I'd preplan - I make the kids get ready for school and pack their bags, and then when we get in the car, I say, \"Surprise, Mommy Holiday!\" and I call them in sick, we pack our bags, we go out for a restaurant lunch, and then we go to the water park for the day. Other times when I had a terrible migraine, I say \"Today is a quiet Mommy Holiday. Go change into your comfy sweatpants, and you can play all the video games you want. I will order pizza for lunch. Mommy needs to lay down, so please don't yell. Don't answer the door; come get me if someone rings the bell.\" Both types of holidays were good, and now that my kids are grown or almost-grown, they all joke fondly about how they loved mommy holidays.\n\nTLDR your husband needs to chill. No one remembers a missed youth basketball game. They do remember that one day mom let us play video games all day and order doordash for three whole meals!",
          "id": 63,
          "comments": [
            {
              "score": 17,
              "content": "and kids will 100% remember the time their father yelled out them for missing a basketball game because he had no chill.\n\nThere was one time my father flipped out because I went to play in the pep-band (something I had to do regularly or lose points in class) instead of going to basketball practice. The type of fathers that get upset at things like this are the type of fathers like mine who no longer have contact with one or more of their kids.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "As someone who gets ill a lot and has chronic nerve/back problems what OP did doesn’t seem like a big deal. There are days I can’t cook so I order in. Heck my husband was out of town for a week and a half and I haven’t done the dishes for three days bc by the time I got home I was exhausted, I’d get my son food from the store and we’d talk during dinner and he’d watch an hour of shows before we went to bed together.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "My friend (who had 3 kids before I had my first) taught me that half the reason for screen limits was so that when you have the flu (or whatever) and daddy still has to work  the TV can be a babysitter.  If it's on all the time it doesn't work and you can't rest and heal.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Everyone needs a day like that sometimes OP, and it’s good for your children to learn that they don’t need to be productive 100% of the time, it’s okay to take a day to decompress when needed.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Especially a 13 and 10 year old. Other than making/ordering food, they're self sufficient enough to not hurt themselves. And she was taking care of the 3 year old. One day of this when you have a legitimate excuse is 1000% okay. If you guys have some lifestyle choices you've made that you want to adhere to, that's fine, but one day where you give that up because of extenuating circumstances is not the end of the world.",
          "id": 68,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3282,
      "content": "NTA\n\numm what was husband expecting you to do exactly? i would love to see him feed and entertain the kids while sick.",
      "id": 69,
      "comments": [
        {
          "score": 1026,
          "content": "I agree. OP, next time he’s sick, suddenly have to leave for the day. Seriously do this. He’s an asshole. NTA",
          "id": 70,
          "comments": [
            {
              "score": 373,
              "content": "Right!?! He's on about not being responsible and ragging on her choices, and how the one kid is not keeping his commitments to his team. Meanwhile, this dude fucks off for an entire day for his own pleasure and leasure. No regard for his responsibilities. Gtfo with that bullshit.",
              "id": 71,
              "comments": [
                {
                  "score": 44,
                  "content": "\"RAGGING\" LOL",
                  "id": 72,
                  "comments": [
                    {
                      "score": 9,
                      "content": "???\n\nrag 2  (răg)\ntr.v. ragged, rag·ging, rags\n1. Slang\na. To criticize or scold (someone).\nb. To criticize or complain about (something).\n\nhttps://www.thefreedictionary.com/ragging+on",
                      "id": 73,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Okay but if she does that and then she posts about it here it's just going to ESH. Why aim for that?",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -31,
              "content": "I wouldn't say that he's an asshole I guess it just depends on how you were raised cause there's nothing wrong about what OP did but logically but to me I just couldn't imagine that but that's because I was raised that if you weren't puking you are going to school. I'd says OP isn't TAH but I can see the husband's view.",
              "id": 75,
              "comments": [
                {
                  "score": 22,
                  "content": "\"I must always be working unless I'm actively releasing bodily fluids\" is a great way to get your classmates or coworkers sick with all sorts of non-digestive illnesses.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 213,
          "content": "In addition to feeding & entertaining the kids alone when he's sick, he can also skip his sporting event or call out of work when OP is sick since he's so concerned about \"neglect.\" Because good parents don't allow their kids to be neglected by anyone, right??",
          "id": 77,
          "comments": [
            {
              "score": 11,
              "content": "Why is this not higher? Take my upvote!",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 95,
          "content": "Did your husband know you were feeling bad? If so, why didn't he come back to take care of the kids?",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "This right here. This is the only comment that matters on this post. NTA, OP",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "And we all know how it is when men are sick. Ha.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -20,
          "content": "I think the kid missing his basketball game is kind of being glossed over",
          "id": 82,
          "comments": [
            {
              "score": 28,
              "content": "Ffs, its one game and op has brutal periods. Taking care of your health is more important than a kids basketball game.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "The kid is 13. If he really wanted to go to the game he could call a team-mate and ask for a ride over. He chose not to because he got to stay at home and do fun stuff. He’s old enough to make that decision. If OPs husband thinks that’s a bad decision, well, maybe he should reconsider going out all day and leaving his unwell wife to take care of the kids.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2257,
      "content": "NTA. You didn't \"neglect them;\" you made sure they were safe, entertained, and fed, while feeling like crap. Some days, that's all you can do.",
      "id": 85,
      "comments": [
        {
          "score": 562,
          "content": "Yeah. All still breathing, fed, in one unaltered piece. Hubbie needs to sit down and shut up. Until he has felt a bad round of period pain, he has no opinion. And they had fun.",
          "id": 86,
          "comments": [
            {
              "score": 219,
              "content": "Im another world she would buy him that period simulator machine. She could then pick her cramping level and have him wear it. Turning it on slowly till her level is reached and then he'd go about his day feeling only partial symptoms of what a period is like. \n\nNTA OP you did great. Don't let anyone tell you otherwise.",
              "id": 87,
              "comments": [
                {
                  "score": 199,
                  "content": "Wish I could stimulate the poops for him. Somehow simultaneously constipated and having diarrhea.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 67,
                      "content": "That’s honestly the *worst* part about periods, and off my BC I get the kind of cramps that lead to fetal position and nausea on the bathroom floor. Period simulators need to get on the period poops.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "Don't together the headache and backache.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 12,
                      "content": "And the back pain!  Why do periods suck so much?!",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "Just make sure she also gives him prune juice so he poops all day too",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 183,
          "content": "I thought she was going to say that she made the 13 year old feed and care for the others. NTA, momma still did the work.",
          "id": 93,
          "comments": [
            {
              "score": 95,
              "content": "Which is especially worth pointing out. No parentification at all. \n\nI think next time mom is sick, dad just needs to stay home/come home and take care of everything.",
              "id": 94,
              "comments": [
                {
                  "score": 102,
                  "content": "Even if she *did* have the 13 year old watch the others, if it’s once in a blue moon (like this day seems to be) it would still be fine. She was still in the house in case of emergencies that would’ve required her, and it definitely isn’t parentification to have the older sibling watch the youngers every now and then. Sometimes that’s just a sucky part of being an older sibling lol",
                  "id": 95,
                  "comments": [
                    {
                      "score": 58,
                      "content": "i think - as long as it’s age appropriate and only when SAHparent is sick - it’s actually good for the children including the eldest. it teaches important life skills and structure, the younger ones have a guide during a time when mum is sick. people are too quick to use the word parentification lol it’s just part of being a family sometimes",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Having a teen look after their siblings for 1 day while their mom is sick is in no way parentification, it would be baby sitting",
                  "id": 97,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Same! From the title I was thinking this was gonna go to a dark place, but no way. She still took care of all her kids from bed. That’s like some mom achievement right there 😂 I’m taking notes.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "Exactly. From the title, I thought OP didn't even feed them and maybe they ate junk food and candy all day, but OP ordered food for them and made sure they had something to keep them busy, even if they didn't do anything productive.",
          "id": 99,
          "comments": [
            {
              "score": 30,
              "content": "and like, this is ONE DAY during a pandemic. let’s cut the kids and mum have some slack about “productivity” amirite! hate that mentality",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Yes, this!",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Exactly! Parenting is rough ASF on the best of days",
          "id": 102,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1400,
      "content": "NTA\n\nSo let me get this straight:  your husband is regularly gone for work, leaving you alone to take care of 3 kids.  Then he goes out of town on the weekend and expects you to take care of the kids alone *again* because he wants to go to some sporting event… and he gets mad that you were sick and couldn’t be super mom *THIS ONE TIME*?????\n\nThat boy needs to learn to appreciate what you do!",
      "id": 103,
      "comments": [
        {
          "score": 410,
          "content": "For real, I think it's time mom took a long weekend at a spa or an airbnb and left him with the kids, preferably while he's sick. Let's see how well he does.",
          "id": 104,
          "comments": [
            {
              "score": 333,
              "content": "My husband is in the military, and can be gone for months at a time, so I have always been the primary caregiver of the kids.  While pregnant with my 4th I went on a girl's weekend with some friends, which included a spa day, leaving my husband alone with the other 3 kids (2, 4 and 6).  It was his first time having to take care of them by himself for an extended amount of time.  Normally it would be for just an evening, not a 3 day weekend.\n\nEver since that trip, he has amped up the \"you're doing great\", \"wow, look how nice this room looks\", \"thank you for doing the dishes\", etc.  He's always been great at doing his share around the house and taking care of the kids.  I'd regularly get to go out with friends.  Hell one time while he was deployed I was supposed to go out to a bar and watch male strippers with some friends.  (Yes he knew we were going to watch male strippers.)  My babysitter was sick and while he was on a ship on the other side of the world he managed to find a babysitter to watch the kids that night so I can go out with my friends.  But ever since that weekend he found a whole new level of appreciation for what I do as a SAHM.\n\nEdit: Thanks for the award!",
              "id": 105,
              "comments": [
                {
                  "score": 91,
                  "content": "If anyone is wondering what traits contribute to healthy relationships, this is a great example right here, appreciation for the efforts you put in to the life you share should be present.\n\nAlso, good on him for not clutching his pearls or unleashing that toxic masculinity that a lot of guys have when it comes to their partners partaking in something like male strippers.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 58,
                  "content": "Just out of curiosity, have the words “Honey, you’re my hero” come out of his mouth at any point since that weekend?",
                  "id": 107,
                  "comments": [
                    {
                      "score": 73,
                      "content": "Actually he said that last week after I took care of starting the insurance claim from his car accident.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 21,
                  "content": "We got really lucky and my husband was able to take paternity leave when our daughter was born. It was great for everyone because they got to bond and he and I went through allllllll the newborn stuff together. So when he went back to work and she and I were home all day, he COMPLETELY understood exactly what he was leaving me with",
                  "id": 109,
                  "comments": [
                    {
                      "score": 3,
                      "content": "This. My husband did the same and then had a 'daddy day' once a week the months after that, which means he is comfortable taking care of our daughter by himself AND knows how much work that is. Cannot recommend enough.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Yay! I love to hear you both respect and appreciate each other so much! <3",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "And a reality check. NTA.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 783,
      "content": "NTA.  If he's disappointed with your services as a housekeeping babysitting 4-star chef, he should ask for his money back.",
      "id": 113,
      "comments": [
        {
          "score": 122,
          "content": "I think he should experience this and that’ll shut him up.",
          "id": 114,
          "comments": [
            {
              "score": 95,
              "content": "NTA your husband is disconnected from reality or seriously lacking in empathy if he thinks you should have been chipper and driving around in pain. What a recipe for a traffic accident! Woman with multiple kinds of pain, belly and head, operating heavy equipment and endangering children. No maam, you did the right thing. He needs to apologize.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "100% see how hard it is for him to do what he expects op to do with all that shit going on",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -58,
              "content": "> I think he should experience this and that’ll shut him up.\n\nMaybe he already has and thats why he is commenting.",
              "id": 117,
              "comments": [
                {
                  "score": 13,
                  "content": "The husband has experienced what feels like being stabbed in your uterus for hours at a time (probably having waves of nausea, a headache, tiredness, etc)  while simultaneously having to look after 3 kids; including a toddler? I seriously doubt that.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Doing everything you said all by himself because his spouse decided to go to a sporting event that’s literally hours away.",
                      "id": 119,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 391,
      "content": "NTA. Unless next time he's feeling sick, you can spend the day out on the town and he can impress you with his magical magic that he performs with the children.",
      "id": 120,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 162,
      "content": "NTA, even if you’d just needed a rest day and weren’t unwell. We can’t all be cooks/cleaners/child minders 100% of the time. The fact that you were unwell and struggling to function means big credit to you, well done for providing for your kids the way you did. Their necessities were met.",
      "id": 121,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 139,
      "content": "NTA\n\nIt was ONE FUCKING DAY.\n\nTHIS WAS NOT NEGLECT.\n\nYou knew where the kids were. They were fed. You monitored the smallest one and had communication with the older ones. They presumably had showers the day before, so they were not substantially dirty. \n\nI bet your husband gets days off from HIS job. Does his boss call and yell at him for things that went on while he was home? \n\nWhat's going to happen when you get older, and can't move as fast, get tired more easily, etc.? Will you be 'fired' and he will upgrade to a younger 'employee' ? \n\nThis is not empathic or healthy behavior on his side. Take care of yourself, OP.",
      "id": 122,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 132,
      "content": "So on a bad day, you basically took a cheat day and allowed the oldest pair to play games while you did light work with the youngest? I don't think the kids are going to suffer by having one of these days once a month, hell they may even look forward to your next sick day when Daddy is around. Oldest get to play games and littlest gets Mummy to themselves",
      "id": 123,
      "comments": [],
      "relation": "Support"
    }
  ]
}