{
  "post content": "Hear me out...\n\nI [17M] am in high school and I have a few friends. Generally I DON'T have issues with people. I am quite nerdy and a bit reserved and keep to a few close friends. Anyway there is a girl in my class [17F] who is a total bitch, she is a bit nasty to people and stuck up. \n\nHowever she never really spoke directly to me before (though I'm willing to bet she has said things about me, as she does with many people). Anyway one day in class last week she decides to talk me and out of nowhere she says ''You are quite a weirdo aren't you, if you keep playing video games all day you will stay a loser virgin''. \n\nMy initial response in my head was WTF? Who even says shit like that? But after that initial response I just went full savage and said ''Yeah but at least I'm not a filthy whore like you. Imagine what your dead dad must think of you being the school slut? Go suck a dick''. \n\nYeah, it was completely savage...and I have an anger problem sometimes. Generally I AM a quite person, however there have been instances in the past when people keep prodding me I just explode. This was no exception...it is known in the school that her dad died last year, and that she is also known for being quite promiscuous. \n\nAfter I said that, everyone went quiet...she burst into tears and the teacher comes in and freaks out, he asks what happened and I get sent to head office. I was given detention and ordered to apologize. I said ''I'm sorry for expressing my opinion'' and I was given detention AGAIN for not giving a real apology.\n\nAfterwards, quite a lot of people came up to me and gave me high fives...they were all happy that I ''tore her down a peg'' and some even invited me to parties (I'm not even interested in going to them, but feels weird...). However some of her friends (mostly all guys) came up to me and said I am a horrible misogynist douche for saying what I said and that I owe her a real apology, I just told them to fuck off as well. \n\nThis has caused some tension with some of her female friends too, who said I am being evil. \n\nWas I wrong here? I thought what I did was justified given the circumstances for what I did but it has caused some issues with people.\n\n**TLDR - Called a girl bully a slut and that her dad would be ashamed of her after SHE sexually shamed me for being a virgin loser who plays video games...given detention because I didn't apologize, tensions with school mates.**",
  "id": 1,
  "comments": [
    {
      "score": 958,
      "content": "ESH - Did you really need to bring up the dead dad? ",
      "id": 2,
      "comments": [
        {
          "score": 326,
          "content": "It's this.  Too far.",
          "id": 3,
          "comments": [
            {
              "score": 177,
              "content": "If it had been left out there would be no impact.\n\nOP went from 0-100 and fucked up, hard, but I remember high school and some people really will not leave you the fuck alone until you go shock and awe on them. Not an excuse, but it is an explanation.\n\nESH is a good judgement.",
              "id": 4,
              "comments": [
                {
                  "score": 54,
                  "content": "ESH but yes this. People don’t leave you the fuck alone until you knock them down, HARD.",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 25,
          "content": "It was a heated gamer moment ",
          "id": 6,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Yes, he did. Play stupid games, win stupid prizes.\n\nThe most important part here is that she instigated the situation by insulting him. He is under no obligation to simply stay quiet and tolerate those insults. \n\n- The school administration probably wouldn't care much if he told them, and it would make the bullying worse as he would be labelled a snitch. \n\n- Milder reactions of anger or telling her to stop would also make it worse. That is what bullies lives for, their victims reacting in an angry and frustrated manner. \n\nSo really, hurting her emotionally to this degree is the only way he might guarantee that she will leave him alone in the future. \n\nThis is a classic example of everyone, Redditors and the school administration, white knighting for the female, even though she was the one who started everything. \n\nNo. Sympathy. For. Bullies. \n\n> she is a bit nasty and stuck up\n\nNasty people need to be put in their place. Going through tough life experiences is not a shield. ",
          "id": 7,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -2,
          "content": "Yes. Thats what makes it ",
          "id": 8,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 596,
      "content": "ESH. *Whoa.* You went full asshole with your \"dead dad\" comment alongside the \"whore\" and \"slut\" comments. Yes, your classmate was an asshole for her comment, but that doesn't excuse yours. Nor the adulation that you accepted afterward.\n\nNext time, remember... *kill them with kindness.*",
      "id": 9,
      "comments": [
        {
          "score": 318,
          "content": "> Next time, remember... kill them with kindness.\n\n''You are quite a weirdo aren't you, if you keep playing video games all day you will stay a loser virgin''.\n\n\"Well at least I don't need to bully people to feel good about myself.\"",
          "id": 10,
          "comments": [
            {
              "score": 122,
              "content": "That wouldnt work!",
              "id": 11,
              "comments": [
                {
                  "score": 24,
                  "content": "Why, because she wouldn’t leave crying or feeling bad about herself? You can defend yourself without tearing someone down.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 50,
                      "content": "It would be better for him to ignore her than give that answer. That answer would just fuel their bullying. ",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "This is high school though. You reply with something like that and you will be laughed at for such a lame comeback. ",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "Yes!",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Exactly ",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "Nah, tearing someone down earns you more respect. We live in a social hierarchy. She was trying to make herself feel better by stepping on someone else. He just knocked her down a peg. \n\nTalk shit, get shit.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "Or just \"it must suck that no one cares what you think\"\n\nYou can't just hurl names at people and expect that you won't get taken down for it. This girl is probably seriously fucking miserable. Don't let her get under your skin, make it clear you don't give two shits about her, and she will find someone else to project her problems onto. \n\nIf you come back at people like this with more insults you'll just end up in trouble, as in this case.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "“Your eyes are pretty”\n\n*she blush heavily and look away, random wind blow her hair gently, flower petal gentle flew with the wind as she side glancing him\n\n*he blush too, but still staring at her\n\n“Stupid” she said as she put her tongue out\n\n*she leave the classroom but hide behind the door and her Hearts is beating fast",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 103,
          "content": ">Next time, remember... kill them with kindness.\n\nThat rarely ever works, and never works in HS. Either ignore them or do like OP did and get viscous those are the only two ways to get someone to back off.",
          "id": 20,
          "comments": [
            {
              "score": 59,
              "content": "I was in HS too... and viscous comments only produce more viscous comments/behavior later on. The best way to avoid escalation is a judicious combination of walking away and *killing them with kindness.*\n\nRegardless of whether or not it \"works\" that has no bearing on whether or not OP or her classmate were assholes here.",
              "id": 21,
              "comments": [
                {
                  "score": 75,
                  "content": "“‘I was in HS too... and viscous comments only produce more viscous comments/behavior later on.’”\n\n‘You keep using that word.  I do not think it means what you think it means.’\n    \n   At least with that spelling.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 19,
                      "content": "> viscous\n\n**LOL!**\n\nDamn fat fingers.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 47,
                  "content": "Outside of a professional environment \"killing them with kindness\" really doesn't do much. Unless it makes you intrinsically feel better. I said in another comment that ESH, he was an asshole in his response but I get it. walking away or killing them with kindness often means you have to keep doing it time & time again because there are no consequences to the attacker. Some times its better to be an AH once so you don't have to keep putting up with it.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Yeah, I bet she won't try anything with him ever again.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Absolutely agree with this. If you don't say anything back, then they just keep picking on you until it really, really bothers you.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I would say it really depends on the situation with walking away being the best choice most of the time. Getting viscous is rarely effective and usually leads to making more problems then solving.",
              "id": 27,
              "comments": [
                {
                  "score": 9,
                  "content": "Ignoring them or walking away is definitely a good option, and would have been preferable. But sometimes getting viscous does make the person back off and leave you alone. I think everyone sucks here, but I don't think its right to heap more blame on OP since, she attacked him unprovoked in an attempt to humiliate him in front of his peers.  ",
                  "id": 28,
                  "comments": [
                    {
                      "score": 2,
                      "content": "> But sometimes getting viscous does make the person back off and leave you alone. \n\nYou're not wrong there, but sometimes getting viscous bring upon you much worse situations then the one you were in before like expulsion or jail time. \n\n> I don't think its right to heap more blame on OP since, she attacked him unprovoked in an attempt to humiliate him in front of his peers. \n\nI wouldn't put more blame on him either. But I think the difference between EHS and NAH here is mainly about how he decided to be viscous right back. I would agree with EHS while if he took a different approach it would be NAH. ",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "People keep saying this but it's really not true. Bullys don't go after the kids who fight back. They will just find easier targets. \n\n",
                  "id": 30,
                  "comments": [
                    {
                      "score": 2,
                      "content": "The bully isn't what I'm referencing when I say it usually leads to making more problems. I'm talking about things like getting expelled or getting into legal trouble. ",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "I agree with not bringing up the dead, that’s just messed up. HOWEVER, I’m a firm believer that you shouldn’t dish out what you can’t take yourself. \n\nIf she has the balls to diss someone, she shouldn’t cry about someone dissing them back. ",
          "id": 32,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 428,
      "content": "r/thathappened\n\n\nAnd, just in case it did, YTA. ",
      "id": 33,
      "comments": [
        {
          "score": 62,
          "content": "Same. Going with SHP.",
          "id": 34,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Agreed.  I was waiting for the whole school to show up and applaud him as he turned up for his detention.",
          "id": 35,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 0,
          "content": "Eh yer mam.",
          "id": 36,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -73,
          "content": "It did happen, but thanks.",
          "id": 37,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 244,
      "content": "ESH \n\nAnd you're just as much of a bully as she is. Congratulations. \n\nHer dad died. And you bring it up in front of everyone in the cruelest way. And by slut shaming her you bring down women who are free to express their sexuality how they see fit. \n\nI know she was mean. But what she said is far less than what you said to her. How can you even ask if you're an ass hole here.\nWhat you did was disgusting and petty and childish. ",
      "id": 38,
      "comments": [
        {
          "score": 102,
          "content": "Aside from the dead dad thing the response was pretty proportional. It’s not worse to call someone a slut than it is to call someone a virgin in that sort of derogatory way.",
          "id": 39,
          "comments": [
            {
              "score": 28,
              "content": "But by responding the way he did, he just promotes both ways of thinking - he supports the fact that being a virgin is bad by getting so angry about her admittedly asshole comment, and supports shaming women for being promiscuous ",
              "id": 40,
              "comments": [
                {
                  "score": 33,
                  "content": "[deleted]",
                  "id": 41,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I agree, ESH",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -2,
                      "content": "Um, it’s literally everybody’s responsibility.  Otherwise stigmas stay just that. If you can’t come up with something other than “dead dad” and “fucks a lot,” you should keep your mouth shut and keep it pushing. ",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "fuck outta here. he's supposed to be ok with being called a virgin loser just because you think it's not shameful, which it obviously is. \n",
                  "id": 44,
                  "comments": [
                    {
                      "score": 2,
                      "content": "He makes clear by his response that he is a virgin loser and should feel ashamed. I bet he's gonna be a real hit with the ladies now.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 13,
          "content": "absolutely not. responding with aggression to aggression doesn't make you a bully.\n",
          "id": 46,
          "comments": [
            {
              "score": 18,
              "content": "Telling someone to fuck off doesn't. Bringing up someones dead dad does. ",
              "id": 47,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": -34,
          "content": "[removed]",
          "id": 48,
          "comments": [
            {
              "score": 54,
              "content": "She called you a weird virgin. Yeah it sucks. And your sex life has nothing to do with her. But you fought fire with fire. \nExcept worse. Because you ripped into a scar I hope you never have to have the displeasure of experiencing. \n\nWe have choices. And we can choose how we respond to weak and scared people. By attacking her all you did was prove that you are a woman shaming bully, just like she is. ",
              "id": 49,
              "comments": [
                {
                  "score": 2,
                  "content": "OP did what needed to be done. Play stupid games, win stupid prizes.\n\nThe most important part here is that she instigated the situation by insulting him. He is under no obligation to simply stay quiet and tolerate those insults.\n\n•\t⁠The school administration probably wouldn't care much if he told them, and it would make the bullying worse as he would be labelled a snitch.\n\n•\t⁠Milder reactions of anger or telling her to stop would also make it worse. That is what bullies lives for, their victims reacting in an angry and frustrated manner.\n\nSo really, hurting her emotionally to this degree is the only way he might guarantee that she will leave him alone in the future.\n\nThis is a classic example of everyone, Redditors and the school administration, white knighting for the female, even though she was the one who started everything.\n\nNo. Sympathy. For. Bullies.\n\n> she is a bit nasty and stuck up\n\nNasty people need to be put in their place. Going through tough life experiences is not a shield.\n\nBy your logic, someone who is conceal carrying shouldn't be allowed to use the gun in self defence against unarmed assailants, because the damage caused by fists is not comparable to the damage done by bullets. By your logic, a woman who is conceal carrying may not shoot an unarmed man attempting to rape her, because being killed is worse than being raped. \n\nNo. No one is obligated to be a victim.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 1,
                      "content": ">By your logic, a woman who is conceal carrying may not shoot an unarmed man attempting to rape her, because being killed is worse than being raped. \n\nWe aren't talking about someone's physical safety here. We are talking about one low blow being worse than another. And in this case his was worse. So he was an asshole. That's the verdict. No one is white knighting because she's a woman. You can't bring up someone's dead family because they called you a nerd.\n\nBut considering you're digging at a cold thread, you don't care about anyone's opinion on your flawed logic. ",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -10,
                  "content": "You know people are supposed to fight fire with fire right? and one negative comment does not make someone a bully, fuck.",
                  "id": 52,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -20,
                  "content": "Oh god, here we go with the “Woman shaming” fuck out of here with that shit. The only part I agree with OP going too far was mentioning the Dead father. But everything else was justified. She insulted him first and he insulted her back. Simple. That turn the other cheek shit don’t work and never will.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 22,
                      "content": "How the fuck can you live in a society where it's shameful for women to be sexual? How is being a bully back going to help anyone? ",
                      "id": 54,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -1,
                      "content": "If that's really your attitude I hope you enjoy your lonely and miserable life. Forgiveness is one of the most powerful things out there. If you waste your time staying angry your going to alienate people and waste a lot of energy. ",
                      "id": 55,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 27,
              "content": "You didn't just insult her. You insulted her friends too. Who are probably just as sexually active. They DO NOT deserve to be ashamed of who they are and how they express themselves. I'm not surprised they're cold to you too. ",
              "id": 56,
              "comments": [
                {
                  "score": 0,
                  "content": "I mean she insulted all the virgins in the grade too then",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -24,
                  "content": "And she's insulting my friends by calling me ''loser virgin'' isn't she? By saying that being a virgin makes me a loser, she is extending that same logic to my friends, who are also virgins. ",
                  "id": 58,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Her being a jerk doesn't make you less of a jerk. Everyone was wrong here.",
                      "id": 59,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 28,
                      "content": "I get where you're coming from. That's why I said everyone sucks, not just you. You had no right to bring up something so painful for her just as much as she didn't have any right to call you names. But you have to grow up. Because all you're doing is hurting yourself. Don't be meaner. Be better. ",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -13,
                      "content": "Ignore them OP, you were justified for the most part. You were mostly NTA. I’m 17 myself and I see girls like the ones you encountered everyday at school, there’s nothing wrong with defending yourself.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "\"But they started it\" is not a good defense for anything other then self-defense in a violent fight. They were a jerk. You were just as much, if not more, of a jerk. You crossed a crazy line bringing up her dad, not that it would be ok with just the rest of the comment. Just walk away and ignore people like her, don't escalate.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": ">3.Accept your judgement  \n>  \n>This  sub is here for the submitter to discover what everyone else thinks of  the ethics or mores of a situation.  It is not here to draw people into  an argument you want to have, or to defend your position.  If people  start saying you were the asshole, do not take that as an invitation to  debate them on the subject... accept the judgement and move on.  If you  have valid reason to think a commenter needs more information or  misunderstood the facts of the conflict, you may give new information.",
              "id": 63,
              "comments": [
                {
                  "score": 2,
                  "content": "Ok fair enough.",
                  "id": 64,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 227,
      "content": "SHP. Definitely belongs in r/thathappened. Why do people make shit like this up?",
      "id": 65,
      "comments": [
        {
          "score": 7,
          "content": "Exactly ",
          "id": 66,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "As well as r/maliciouscomplience and r/murderedbywords potentially r/pettyrevenge?",
          "id": 67,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -49,
          "content": "I didn't make it up, but thanks for your concern lol.",
          "id": 68,
          "comments": [
            {
              "score": 63,
              "content": "... a bunch of random guys high fived you for calling a classmate a whore whose dead father would be ashamed as her? \n\nAnd that father..... Was Einstein! ",
              "id": 69,
              "comments": [
                {
                  "score": 20,
                  "content": "It was Abraham Lincoln* how dare you! And the girl was Britney Spears",
                  "id": 70,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "And then everyone started clapping!",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -15,
                  "content": "- They weren't random, they were acquaintances\n\n- They all hated her\n\n- This happened over several days\n\nThanks for your concerns though",
                  "id": 72,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Barring that this whole thing is fake, you sound like a total ass anyway, and the personification of if r/GamersRiseUp was real. ",
                      "id": 73,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "You overreacted because you felt defensive. Redirect your aggression, maybe. Get involved in sports and debate. You may gain admission to a competitive college and law school that way.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 140,
      "content": "> Afterwards, quite a lot of people came up to me and gave me high fives...they were all happy that I ''tore her down a peg'' and some even invited me to parties (I'm not even interested in going to them, but feels weird...).  \n\nAnd then everybody clapped!\n\n&#x200B;",
      "id": 75,
      "comments": [
        {
          "score": 34,
          "content": "Obama was there",
          "id": 76,
          "comments": [
            {
              "score": 14,
              "content": "High on pot-enuse",
              "id": 77,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "I was the tears",
          "id": 78,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 125,
      "content": "/r/thatHappened \n\nESH. Of course you were in the wrong for attacking her and then offering a false apology. ",
      "id": 79,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 89,
      "content": "YTA. She shouldn't have shamed you but you brought her dead dad into it. Not cool, dude, not cool at all!",
      "id": 80,
      "comments": [
        {
          "score": 51,
          "content": "Yeah holy shit that's going nuclear, those are legitimate fighting words. Making fun of sexual history is douche-y from both sides, but using a parent's death is horrible. And ofc this is hypothetical, this didn't fucking happen. Quite a lot of people gave him high fives? I'm surprised Einstein didn't start clapping.",
          "id": 81,
          "comments": [
            {
              "score": -14,
              "content": "Thanks for your concern, but it did happen. Maybe the way I described it was a bit movie like and cringe, people weren't literally running up to me and high fiving me, but they saw me privately after and some people did high five, most people just thanked me.",
              "id": 82,
              "comments": [
                {
                  "score": 24,
                  "content": "Fantastic! Then this is a learning moment- don't use people's dead family to insult them, it's a colossal asshole move. She was an ass, you were exponentially a bigger asshole. ",
                  "id": 83,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Ok but the party thing is hilariously false",
                  "id": 84,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "Ok so why is this not an ESH. ",
          "id": 85,
          "comments": [
            {
              "score": 27,
              "content": "Because his response was so disproportionately cruel.",
              "id": 86,
              "comments": [
                {
                  "score": 11,
                  "content": "She wasn’t disproportionately cruel in the first place?",
                  "id": 87,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Doesn't make her not an asshole",
                  "id": 88,
                  "comments": [
                    {
                      "score": 17,
                      "content": "No, but when one person’s behavior is 100 times worse than the other’s, I think YTA is a more appropriate judgment. ESH implies that everyone involved is more or less equally at fault.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "She fired an artillery shell. He responded with a nuke.",
                      "id": 90,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "A little kid comes up and kicks you in the nuts thinking it's funny. You respond by breaking the kids arms and smashing his kneecaps. Whose the asshole there?",
                      "id": 91,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "because he was worse by bringing her dad into it.",
              "id": 92,
              "comments": [
                {
                  "score": 0,
                  "content": "Maybe if she doesn't want it brought up, then she shouldn't be bullying other people",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 85,
      "content": "Going against the grain, but NTA.\n\nDon't dish it if you can't take it.",
      "id": 94,
      "comments": [
        {
          "score": 22,
          "content": "Thank you! seeing all these YTAs and ESHs has me disappointed",
          "id": 95,
          "comments": [
            {
              "score": 19,
              "content": "Its Esh cause he brought up the dead dad only. If he didn't he wouldn't be an asshole",
              "id": 96,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "Agreed. Not cool to bring up your dead father into this, but those kind of comments can trigger unexpected rage into some people.. Offensive behaviour never ceases to be offensive behaviour, so no matter how severe  is or not, always expect an offensive reaction.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "She was playing bitch games so she won a bitch prize",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -4,
          "content": "Right?\n\nPro-bullying fart fuckers can get bent.",
          "id": 99,
          "comments": [
            {
              "score": 10,
              "content": "I agree, same thing happened to me in middle school. This chick named Chloe would make fun of me for not having a gf ever and would brag that she was super sexual (this was MIDDLE school). Anyways I called her Ho'ey and she started crying. ",
              "id": 100,
              "comments": [
                {
                  "score": 5,
                  "content": "“Ho’ey” is hilarious ",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 65,
      "content": "R/thathappened\n\nI believed you up until:\n\n\"people gave me high fives and invited me to parties\"\n\nYeah sure they did. ",
      "id": 102,
      "comments": [],
      "relation": "Attack"
    }
  ]
}