{
  "post content": "I have a close friend from college who's getting married, and she's been asking for my help to contribute to her wedding. I think it's sweet that she's thinking of me, but I don't think it's a good idea for me to help out financially. \n\nMy friend and I have been close for a few years now, and I'm happy for her. She is struggling financially, and they have asked that instead of wedding gifts, people can donate to parts of their wedding ceremony (theres a registry and everything, like “table flowers” and stuff). I'm know she's trying to save as much money as possible for certain reasons unrelated to the wedding. But I just don't think it's right for me to be helping her out with the costs at this time. I'm a recent doctorate candidate (soon), am currently writing a memoir, and I dont know when I will have time to get a job - anything I give is just that much less time I can live on my own. Even if I could afford it, I don't think it's fair that I should have to help out when I know her fiance already has a job and could definitely get another, and some of his friends seem well off.\n\nI tried to explain my financial situation to my friend, but she's still asking for help, even a little. She suggested that I could contribute a much smaller amount than others, but I still don't think it's a good idea. I told her that if I was in a better financial situation I would be more than happy to help out, but right now it just isn't possible. \n\nMy friend got really mad at me and said that I was selfish, and that she expected more from me.  Our group of friends all pledged to help pay for each others weddings back in college, and she says that since she helped pay for my wedding ($550), that I should help her out, even if it's just $20. She is also threatening to tell our group of friends, just because all of them contributed to my wedding - but she completely ignores the fact that my marriage didn’t last even one year.\n\nI don't want to lose her friendship, and I really don’t want her to tell our friends - my financial situation is private. More importantly, I also don't want to be taken advantage of. AITA for not wanting to help pay for her wedding?\n\n***Edit: ok, after seeing all the reactions and misunderstandings here, I talked with a couple other friends in our group and showed them the post. They sent me some money ($100) to give to our friend for her wedding. I’m going to offer $5 at first and see if that is enough.\n\nCouple other points: \n - My friends fiancé agreed to purchase my ticket to fly, so giving up that money and not going is not an option\n - My friend did also give me a wedding gift which I returned\n - I do not have the money for a wedding gift, but I believe being there for her on her big day is a present itself - everyone laughs when I say “my presence is present enough” so I don’t think it’s as negative as others see it.\n - I have not been accepted into a school yet, I am starting to apply for PHD programs. I’m writing a memoir as a tribute and gift back for my experiences - and doing it now to prepare to become a doctor.\n\n***Edit 2: to clarify, I understood the $100 is to be used for ALL friend weddings in our group, not just the one now. I am NOT just pocketing the money. I am saving it for when others get married and that means I have to try to ration it out, for lack of a better word.\n\nNote - there are only three people left in the group who are unmarried: my friend, one other person, and myself.\n\n***EDIT 3: A LOT of people are asking about my memoir. I won’t be sharing details here so as to not take it off topic. Anyone can DM me for more info though\n\n***Edit 4: I offered the $5, and didn’t hear back for a couple days. So today I offered $20 as a gesture of good will, without waiting to hear about the $5. She said no, and even had the audacity to tell me I didn’t need to come to her wedding at all! I offered $25, then $50. Still nothing she just seemed to get more upset even when I INCREASED the amount. Idk what she expects literally more than double what she asked for, and it isn’t enough?",
  "id": 1,
  "comments": [
    {
      "score": 33997,
      "content": "Well I'm glad I withheld my judgment until I got to the end. I'm going with YTA because you didn't slip in until the second-to-last paragraph that the reason why she's asking you is because she contributed over $500 to *your* wedding, and now that it's your turn to chip in, you don't want to give her a red cent.\n\nYou said she was also asking for help with things like decorations. What have you offered to contribute for labor, since you are unable to give a single cent, because you are busy being a not-yet-doctoral student and writing a memoir?",
      "id": 2,
      "comments": [
        {
          "score": 11046,
          "content": "Not to mention, it’s not like OP’s friend was just like “oh here, have $500.” They all made an agreement.",
          "id": 3,
          "comments": [
            {
              "score": 6845,
              "content": "That was a stupid promise they made but OP also didn’t reject when her friend gave her money at her wedding, wether it lasted or not.",
              "id": 4,
              "comments": [
                {
                  "score": 6478,
                  "content": "But you see her wedding only lasted a year so their contributions didn't really count. /s OP is such the AH I can't see how they don't see it.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3934,
                      "content": "At least we know why her marriage was shortlived… YTA",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 225,
                      "content": "If the contribution doesn't really count, maybe OP should __*give it back,*__ then.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 217,
                      "content": "Well going by that notion I guess a refund (to the friend) is to be expected? Lol.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 108,
                      "content": "I'm still laughing over the memoir...the self importance over that tidbit has had me rolling.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 92,
                      "content": "Right!? Like her failed marriage has anything to do with it! And her friend said “even if it’s just $20” — she can’t throw her a twenty!?",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 49,
                      "content": "That bit was hilarious",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "It's like kim k not giving back the presents from her wedding to Chris. Op is just as greedy.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 24,
                      "content": "That's because OP is a \"**taker**\".\n\nOp takes money for their wedding.\n\nTakes their friend's time.\n\nI still want my friend\n\nI don't want my friend to tell my friend group that I and reneging on our promise.\n\nBut when it comes time to **give**.\n\nI don't have time to give to my friend's wedding.\n\nI don't have money to give.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "The fact that OP’s marriage was an obvious sham just makes it that much worse to me",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "Right?!  I read some stories on here all the time thinking, \"Thos can't be real.  How do they not see they're clearly TA?\"",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 214,
                  "content": "True. How long her relationship lasted was irrelevant. The point was they all agreed.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 210,
                  "content": "And I'm sure OP returned the $550 since the marriage didn't last.  You know we're supposed to return the gifts and stuff.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 8,
                      "content": "As long as the wedding happens gifts don’t need to be sent back. It’s all sent back if the wedding is called off. JS \n\nOp YTA",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "\"....*because all of them contributed to my wedding - but she completely ignores the fact that my marriage didn’t last even one year\"*\n\nErr I'll be honest, I bet they're regretting paying that money towards your wedding when it didn't even last a year. But if you expended the same effort towards your marriage as you do friendships, it checks out.",
                  "id": 19,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "What did it not lasting a year have to do with the friend giving her money? Just because it didn't last doesn't mean she shouldn't contribute. \n\nYTA Op. You are being taken advantage of. You are being asked to reciprocate.",
                  "id": 20,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 820,
              "content": "I love how OP justifies that by saying it doesn't count because the marriage didn't last.\n\nDid she return the money? No. So it definitely counts.\n\nAnd that's a LOT of money. Imagine buying someone a Roomba from their wedding registry, only for them to show up at your wedding with a $5 picture frame and a photo of themselves in it. ...After they promised to get you a matching Roomba.",
              "id": 21,
              "comments": [
                {
                  "score": 303,
                  "content": "Her friend would be happy with the $5.00 picture frame, and is begging for the picture frame despite giving her friend the high end roomba. And OP is over here like-nooo, that’s not fair. I promised to contribute a roomba, but the picture frame is too much.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 282,
                      "content": "Yeah, I wasn't even getting *started* on that part. Like, she got $550, but she's throwing a fit over $20 as a contribution *instead of* a gift. So really, she'd show up empty-handed. \n\nI still can't get over OP implying she doesn't want to be taken advantage of, when she's clearly taken advantage of everyone and now she's just throwing a tantrum for being expected to contribute *something*, as miniscule as it may be.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 97,
                      "content": "OP doesn't want to be \"taken advantage of\"!\n\nHow can a person be this dense???",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 86,
                      "content": "Well OP admitted she only made the promise because she thought her friend would never get married despite them all being in their early 20s. She also thinks it's cute to say \"my presence is the present.\"\n\nI... can't...I just can't.",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "She even phrases it as her friend's contribution being 'wasted' since the marriage didn't last. What does that even mean? Your friend should just forget about it, and give you more money if you get married again, hoping it won't be 'wasted' this time? \n\nReading through her comments, she is making \\*wild\\* leaps of logic (using that word loosely) to justify herself. Giving her friend a mention in the memoir? She's living off money people put into a gofundme (so people gave her more money)? I mean...come on.",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "While a lot of money, I would consider it a good price for realising what an absolute leech of a friend this OP is and cutting them off before they can take any more away.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 576,
              "content": "Oh wow…this took a turn. At first I was like, why would anyone expect someone else to pay for their wedding, then we get to the cliffhanger. \n\nOP you are an AH\n\nYou took $550 for your wedding and can’t even come up with $20 for your friend. Wow!\n\nYou are going to end up with no friends. \nYTA",
              "id": 28,
              "comments": [
                {
                  "score": 271,
                  "content": "At that point the $20 is even just symbolic. I’m currently beyond broke. I don’t have $20. Am I going to find $35 to go my adult friend’s recital in February for her hobby she loves? Yes. I will. I don’t know how, but I will make that happen because that’s what you do for friends.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 102,
                      "content": "But OP wants to spend the money only on herself. She was given $550 for a failed marriage, but doesn't want to even give $20 because she doesn't think she should get married (she mentioned it in other replies). OP is entitled and selfish.",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "Let your friend know your financial position, but how much you want to go. If it was me and my friends, I would gladly pay, have my friend come and not put them in a bad financial position.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "as someone with no friends within a distance i can afford to drive to go see, between travel and childcare expenses, this is so sweet. DM me some details about the recital, date, etc. and if you still are struggling to come up with the funds, i'll cashapp or paypal you something to help cover the cost of going to support your friend. i wish i had just one friend, like you <3",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 164,
                  "content": "I also think the way OP described the situation is really disingenuous. OP’s friend isn’t asking for people to pay for the wedding **and** give all the traditional shower and wedding gifts. She’s asking for parts of the wedding **as** the shower and wedding gifts. \n\nAt this point, registering for non-traditional things (like cash funds, honeymoon experiences, etc) isn’t even uncommon. I gifted one of my friends the personalized cake serving set she wanted to use at her wedding, because it was on her registry for her bridal shower. And we gave them cash to pay for their honeymoon as a wedding gift, cause that’s what they wanted. Fewer and fewer people are asking for crock pots and china, because most of us have all that stuff by the time we get married. Nothing wrong with asking for what they actually want and need, even if that thing is cash to pay off the wedding!",
                  "id": 33,
                  "comments": [
                    {
                      "score": 6,
                      "content": "The last time I gave a gift, for a wedding, that wasn’t cash was about 15 years. People want cash. So shouldn’t matter if you give it before or at the wedding. This poster is a knob.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "OP is definitely trying to hide intent with the title.",
                  "id": 35,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "And then the audacity to not want her friend to tell all her other friends how she didn’t help. She deserves no friend if she can’t help in any way. Bride sounds understanding and willing to take anything",
                  "id": 36,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "She's asking for help in lieu of a wedding gift. Basically help pay for the wedding but then don't bring a gift later. OP is such TA",
              "id": 37,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Oh, but didn't you hear OP? She said that her marriage didn't even last a year.  I mean clearly it's the friends meager contribution to her wedding that ruined it all. /s",
              "id": 38,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "But you are t considering her marriage lasted less than a year.  Monetary help doesn’t count if you marry the wrong person",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "And the friend is like \"I gave you $550 because of this agreement and you can't even do $20?\"  Your friend is being more than reasonable. \n\nYTA",
              "id": 40,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2146,
          "content": "ROFL,\n\nBut the $550 doesn't count because OP's mariage failed/s\n\n\"My marriage failed so i'm not going to honor the agreement I made with all my friends, but I don't want her to tell my friends the truth and for them to realise what a terrible friend I am\"\n\nThats such a bad excuse!!",
          "id": 41,
          "comments": [
            {
              "score": 1051,
              "content": "[deleted]",
              "id": 42,
              "comments": [
                {
                  "score": 326,
                  "content": "This is what struck me the most! Not only did her friends all contribute to OP’s wedding but she seems to think it doesn’t count since her marriage ended in less than a year! So their contributions don’t matter because you or your partner made bad choices lol! And the fact that she is even asking for a tiny contribution and not even expecting her to match what was given shows that this friend is very willing to accommodate OP’s situation totally. Honestly OP is right not to want to lose a friend like that. OP YTA. Tell her you will be there to help with as much of the laborious stuff as you can because you can give your time for free and get $50 together to give to her. It sounds like she would be very accepting of that but you don’t even want to offer a tiny amount for some reason. Two questions, firstly have you contributed to any of the others weddings (it sounds like a number of them put in for yours) and secondly do you dislike her fiancé or something? Seems like you have a reason for not wanting this wedding to happen and you speak about the event and the wedding party in quite a disparaging way.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 646,
                      "content": "OP, commented she only agreed because she thought her friend would never get married.\n\nImo, that comment made her 10000x worse to me.",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 86,
                      "content": "I found her saying it was sweet of the friend for thinking of her when it came time to contribute to the friends wedding patronizing. Also, she threw in how she was being taken advantage of at the end which is her getting ready with excuses when the friend tells the group of women who contributed to ops wedding. She doesn't have a real excuse so she's making one up. Friend gives 550 and op can't give 20 but the friend is taking advantage. \nYta and ops math skills are shit",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "Hahahahahahah",
                  "id": 46,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 276,
              "content": "I think OP is bitter about marriage and she could have money pouring out her rear end like a broken atm and she would come up with a reason why she couldn't. YTA.",
              "id": 47,
              "comments": [
                {
                  "score": 143,
                  "content": "Oh but she only agreed to the pact because she thought this friend would never marry. Ooof.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 100,
                      "content": "That was a low blow. OP seems to be full of herself and full of something else too.",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 98,
              "content": "I bet we can all guess why OP's marriage failed",
              "id": 50,
              "comments": [
                {
                  "score": 119,
                  "content": "ROFL, we can read all about it in her memoirs, if she ever publishes.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 74,
                      "content": "I can't wait for the chapter about how they lost all their friends!",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 56,
                      "content": "That’s the part that makes her an asshole- writing a memoir before you’re out of graduate school? Unless she’s a 78-year-old student… no one cares.",
                      "id": 53,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 45,
                      "content": "I’ll wager $550 that OP is going to ask her friends for money for self publishing, while being absolutely shocked that publishers aren’t bashing down her door to get first crack at the “memoirs” of a student",
                      "id": 54,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 91,
              "content": "Yeah, that was what got me even more than the dollar amount. Like, I get if you've fallen on hard times or are otherwise financially unable to give a friend $500 to pay for their wedding. But...I think the very short duration of OP's marriage makes it worse! I mean, to divorce after less than a year, there must have been insane amounts of red flags before the wedding, but they decided that they'd just go through with it (using everyone else's money) because the invitations were already sent and a bunch of non-refundable deposits had been made, I guess?!?",
              "id": 55,
              "comments": [
                {
                  "score": 9,
                  "content": "I love that OP says her marriage didn’t last as if that’s a reason to not have to stick to their pact. I bet she didn’t send the money back to her friends when they broke up  so why would that be her get out jail free card?? 😂",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "I can’t imagine why her marriage could possibly fail 😂 Clearly she’s still bitter about it and doesn’t want her friends to have successful relationships",
              "id": 57,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "I actually think it makes it worse, too. Like, the friend gave money for a wedding/marriage that didn't even last a year. So it was a completely wasted $550.",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Yeah, and if/when she decides to marry again I’m sure she’ll start sniffing around her friends for another contribution \n\nOP, YTA",
              "id": 59,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 822,
          "content": "YTA. I was going to judge the other way too until she gave me $550. Give her the money or expect backlash from your friends. It will be well deserved backlash.",
          "id": 60,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 494,
          "content": "Why the hell is OP writing a memoir? They sound like they're barely 30, struggling financially, haven't done anything of note. I guess there must be a massive ego to write about? At least they can include in it the time they made a deal with their friends, took all the benefits from the deal and then refused to uphold their end of the bargain in return.\n\nYTA",
          "id": 61,
          "comments": [
            {
              "score": 175,
              "content": "Agreed. No one wants to read or publish a memoir from someone who is in their 20s or 30s and is self absorbed and hasn’t really learned anything about life yet. She needs to get a job and help repay her friend.",
              "id": 62,
              "comments": [
                {
                  "score": 208,
                  "content": "OP states they want to share with humanity  all that they have learned about the human condition.\n\n\nWhich as a jobless 20 or 30something straight out of university with NO real life experience is probably almost nothing.\n\nGood writers go out there and live life. You can't write if you have 0 experience of the world outside your bedroom. No matter who you are, your drunken thoughts are not unique or special enough for a memoir until you live life",
                  "id": 63,
                  "comments": [
                    {
                      "score": 71,
                      "content": "> OP states they want to share with humanity all that they have learned about the human condition.\n\nA short chapter in a very thin book that no-one wants to read.",
                      "id": 64,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "Lololol. Not one single person is going to read this. She doesn’t have a job, no money, marriage didn’t last a year, she’s an awful friend. But she has so much life experience that she thinks people give a shit about it. Extra lol",
                      "id": 65,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "She's not even 25, but hey she's already been divorced which is something I've never done despite being in my 30s so idk.",
                      "id": 66,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "I went to graduate school- can I write a memoir as well?\n\nUnless you were born into poverty, grew up eating dirt, didn't go to school until you were 9 yet managed to go to Harvard on a full scholarship, no one wants to read what you learned about the human condition.\n\nYou might have something to say but you probably need to live a little more.",
                      "id": 67,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "Someone below pointed out she may mean a thesis or her dissertation. If English is not OP’s first language, that would make sense - a thesis is definitely often called a « mémoire » in French (though usually at the Master’s level).",
              "id": 68,
              "comments": [
                {
                  "score": 47,
                  "content": "OP commented later that it’s a personal memoir, not related to degrees.",
                  "id": 69,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "Masters level would make sense if OP is soon to be a doctoral candidate. Thanks for the call out!",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Nope, it's her personal gift to the world.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Ugh :S in any event OP was the AH but that makes it worse.",
                      "id": 72,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I'm expecting them to dedicate the memoir to themselves at this point",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "They can write about how to be a bad friend?",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "under 25 according to the comments. The memoir is OP's way of \"giving back to the world\"\n\nIf you could sell arrogance OP would be a billionaire.",
              "id": 75,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Thank you!  I was trying to compose this exact comment in my head.  I'm trying to figure out why OP even thinks someone would want to read it.",
              "id": 76,
              "comments": [
                {
                  "score": 6,
                  "content": "I feel that makes it worse. A memoir like what you'd get in a bookstore is arrogant enough for a 25 year old nobody, but I can see how a person might think there's money to be made in it, especially given the hype around Prince Harry's memoirs (Not that they are comparable figures in terms of public interest, but I can see someone self absorbed and clueless enough to think it's easy to write a bestselling memoir). \n\nBut a thesis? No thesis ever made serious money.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 427,
          "content": "Is it just me, or does the fact that OPs marriage didn't last a year make me think they should contribute even more?",
          "id": 78,
          "comments": [
            {
              "score": 158,
              "content": "Struggling to see how that part of the story is even remotely relevant...?! Why did OP think that would strengthen their case? LOL!",
              "id": 79,
              "comments": [
                {
                  "score": 13,
                  "content": "Just shows how smart and stupid one person can be. \nBook Smart = 10\nCommon sense = 0",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 100,
              "content": "Omg I laughed so hard. Op using that as a justification when it makes it *so* much worse. Your friends contributed money to your wedding that was completely wasted because you didn't even make it a year. And now you can't even return the favor. Op is a clown lmao",
              "id": 81,
              "comments": [
                {
                  "score": 8,
                  "content": "Yeah Ops friend paid for a *party* effectively. For $550 no less. Friend is asking for $20 as a symbolic gesture to support her *marriage*. I've never flipped so hard on my first judgement from a title on AITA before. I got whiplash.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 8,
                      "content": "She also commented she gave a gift of about equal value on top of the wedding donation. Which she returned and split the refund with her ex. So friend shelled out close to a grand before even attending her wedding.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 82,
              "content": "OP’s marriage was def a bad investment",
              "id": 84,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "And guaranteed that if it were OP who was getting married again, they’d expect everyone to chip in *again*. Y’know, because the last one didn’t count.",
              "id": 85,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 277,
          "content": "…maybe you could sell some of the gifts you got for your 6 month marriage on eBay.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 238,
          "content": "Also the friend was like ‘even $20 would be fine’ - I’d give a friend $20 for something far less important than a wedding.",
          "id": 87,
          "comments": [
            {
              "score": 190,
              "content": "Exactly. And the \"I don't want to be taken advantage of\"...like...your good friend gave you 500 dollars as a wedding gift after a pact you made to help each other financially when you get married, and you wouldn't even give them 20 as a wedding present?! \n\nThat's not being taken advantage of, that's being a stingy asshole.",
              "id": 88,
              "comments": [
                {
                  "score": 76,
                  "content": "The fact that this is in lieu of a wedding present makes it that much more appalling. OP’s question is essentially “AITA if I don’t get my friend a wedding present even though she gave me $550?”.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 36,
                      "content": "\"And even though I agreed I'd do the same in return.\"\n\nOP goes around telling peole they are lucky she shows up to their weddings apparently.\n\n\nDon't get me wrong, I explicitly told people we dont want or need presents for our upcoming wedding and have very much  told people their presence is the only present we would hope for. 0 expectations. But I would NEVER  go to a wedding and bring not even a card Bd a modest gift. \n\nNornally you wouldnt ask for a gift, that's rude. But These people had a pact and the fruend have generously- in turn she's asking for even  just a little gift. And OP is whining Bout being taken advantage of.\n\nLike, you cant get them a toaster or give them a 20 in a card?",
                      "id": 90,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "I gave my friends more than that as a starving grad student 20 years ago.",
              "id": 91,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 210,
          "content": "I think even without the $500 gift- op should be willing to contribute something.  It's customary to provide gifts when ppl get married. Sounds like the friend is probably asking for money in lieu of traditional gifts. Seems like OP isn't interested in contributing anything at all. If op doesn't want to give anything because they're cheap- they should just skip the wedding entirely. If they want to maintain this friendship- then they should attend and give some kind of gift. The $20 thing makes me think it really is about the thought that's important to the friend.",
          "id": 92,
          "comments": [
            {
              "score": 5,
              "content": "Yeah I was wanting specific amounts because it's 100% normal to give a gift, and the bride was asking for financial help in lieu of a gift. That seemed reasonable to me",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": ">The $20 thing makes me think it really is about the thought that's important to the friend.\n\nAbsolutely this. The friend is probably just totally shocked at OP's attitude. The friend is trying so hard to give OP an out that saves face - but OP just cant see it. She is so self absorbed she has no idea how the friend is feeling - maybe doesn't even realize the friend has feelings at all...",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "This is what I don’t get - would OP not have given a gift if she had gone to the wedding? As you said, her friend has asked for help towards the wedding in lieu of gifts.  So to not contribute when it was in lieu of gifts already made her TA but then it just got worse when it turns out her friend had contributed to her wedding! And somehow thinks because her own marriage lasted less than a year the contribution doesn’t count! OP, you should definitely not contribute, so that way the rest of the friend group knows what a bad friend you are.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 181,
          "content": "This is one of the many selfish people that come online that need to reflect.\n\n1. She talks about her financial position then says she’s writing a MEMIOR?!? OP sounds very young, inexperienced, unimportant and I really can’t imagine what would be in her memoir.\n\n2. Get a JOB OP this is the weirdest post I’ve ever read. You just got your doctorate and you have NO JOB, NO MONEY, wow…career student I guess\n\n3. You are not even trying to pretend to find a compromise. Hey, here’s $20! Hey, I don’t have cash but I can help setup and offer some of my time. You are so self centered and a terrible friend.\n\n4. I would not only tell the friend group but I’d make sure I post to Social media so everyone knows what kinda person you are\n\n5.  Who cares that your marriage lasted less than a year. You clearly make poor decisions now but your ex-friend still tried to help and contribute. What if her marriage only lasts a year?! Since your marriage only lasted a year, k think you owe her a refund.\n\nYTA",
          "id": 96,
          "comments": [
            {
              "score": 16,
              "content": "I like how OP has no job but suggests the friend’s partner should get ANOTHER job vs them just paying their part of wedding pact. Every sentence gets more and more entitled. Unbelievable \n\nOP- YTA",
              "id": 97,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "In case you missed it, she hasn’t even applied for doctoral programs yet",
              "id": 98,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 174,
          "content": "All this\n\nYTA OP\n\nYou’re asking us if it’s ok to only take and never give in a friendship? Well I can say no, and you’re the user in this equation not your friends. In case that’s a bit more direct and clearer.",
          "id": 99,
          "comments": [
            {
              "score": 28,
              "content": "And wouldn't be surprised if that's not the only relationship that Op is only a taker in \\*cough bitter about marriage lasting less than a year cough\\*",
              "id": 100,
              "comments": [
                {
                  "score": 5,
                  "content": "Lol that part cracked me up. The marriage lasting only a year makes the gift relatively bigger not less.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12913,
      "content": "Wait … am I understanding that your friend group all pledge to help with each others weddings and they all helped you but now you are backing out of a pledge you’ve already taken advantage of. \n\nIt doesn’t matter that you marriage didn’t last. You still kept you friend group to their word and they all stepped and honoured  that agreement but now that you have gotten what you wanted out of it you can’t even find a small amount to keep a promise you made. \n\nYTA and you deserve to be called out",
      "id": 102,
      "comments": [
        {
          "score": 4620,
          "content": "Yeah I legitimately have no idea how “my marriage only lasted a year” makes it better *at all*. It’s not like OP returned all the money when she got divorced.",
          "id": 103,
          "comments": [
            {
              "score": 986,
              "content": "Wonder why she got divorced lol….",
              "id": 104,
              "comments": [
                {
                  "score": 186,
                  "content": "Her loyalty , hm I understand",
                  "id": 105,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 231,
              "content": "It makes it worse! She wasted their money!",
              "id": 106,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 144,
              "content": "It makes it WORSE imo",
              "id": 107,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "Yep, they didn’t purchase a marriage for OP, they helped pay for their wedding, but somehow OP doesn’t understand the difference.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "So not only did they pay for OP wedding, the marriage was clearly rushed... bruh people are so fucking dumb",
              "id": 109,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Exactly. If that's her best argument then it's really more of an argument to give her friends their money back, not to avoid giving her friends money.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 611,
          "content": "Plus the friend said it doesn’t matter how much money, she’s not even asking for something reciprocal. She’s asking for the equivalent of 2 meals at Wendy’s.",
          "id": 111,
          "comments": [
            {
              "score": 294,
              "content": "Literally just wants op to show they care",
              "id": 112,
              "comments": [
                {
                  "score": 57,
                  "content": "$20 was too much? Was she planning a gift at all?",
                  "id": 113,
                  "comments": [
                    {
                      "score": 17,
                      "content": "No her presence is the present 🙄",
                      "id": 114,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 373,
          "content": "But, don’t you see, it’s because OP ‘doesn’t want to be taken advantage of’ - like she took advantage of her friends! That agreement was only ever supposed to benefit OP, not the rest of them so it’s absolutely unfair to hold her to it! Especially when she’s having to take the time to write her memoir that I’m sure will be wildly successful. /s",
          "id": 115,
          "comments": [
            {
              "score": 15,
              "content": "As they say \"accusations of a narcissist are confessions.\"  OP is telling on herself that she took advantage of her friends and doesn't want the same to happen to her!",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 194,
          "content": "WTF\n\n>...she helped pay for my wedding ($550), that I should help her out, even if it's just $20.\n\nSo OP is risking losing her \"friend\" & \"friend group\" over fecking 20$....\n\n\nAlso\n\n>My friend and I have been close for a few years now...\n\n>I'm a recent doctorate candidate (soon), am currently *writing a memoir*, and I dont know when I will have time to get a job\n\nWho spends ALL their time writing a memoir so early in life to the point they can't even work part-time. Most even published authors still have another main job.",
          "id": 117,
          "comments": [
            {
              "score": 47,
              "content": "That part stood out to me to. If it walks like a narcissist and talks like a narcissist…",
              "id": 118,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 78,
          "content": "She’ll probably expect them to keep their promise for her second wedding 😂",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Also in another post.\n\n>I just reconnected with an old friend.....\n\n >I want to send her some kind of a gift, but I no longer know what she likes,......\n\n>Budget is $20-50",
          "id": 120,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Right. OP should just give the $550 back.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Holy hell! In her edit her friends sent her $100 to contribute to this wedding, but OP is going to offer “$5 to see if that will be enough.” \nIs this real??",
          "id": 122,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "it says a lot about op that her marriage lasted less than a year 😅 deary me",
          "id": 123,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6936,
      "content": "Hang on a sec. She paid $550 for your wedding to help you and you aren't reciprocating like you already agreed? That makes it an easy YTA. Your marriage failing hasn't got anything to do with this. \n\n>my financial situation is private. More importantly, I also don't want to be taken advantage of.\n\nYet you'll happily take other people's money for your wedding. Don't make stupid pledges you don't intend on following through with.",
      "id": 124,
      "comments": [
        {
          "score": 1189,
          "content": "She's the one taking advantage of her friend. How in the world is she spinning this into her being taken advantage of? I'm so confused. Chick needs therapy to learn how to be a better person. She is very confused on what fair is.\n\nEdit- Taken to taking.",
          "id": 125,
          "comments": [
            {
              "score": 17,
              "content": "It’s projection. She knows she took advantage of her friend.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 536,
          "content": "She paid 550 plus a gift of similar value that OP returned to take the cash. Each comment from OP makes it worst... YTA x100",
          "id": 127,
          "comments": [
            {
              "score": 56,
              "content": "OOOF",
              "id": 128,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "I was gonna suggest she offer labor to make up for it (after seeing the pledge bit) but returning a gift for cash on top of all this, wow. The pledge was dumb, but if everyone else has done it, OP should too.",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Wowwwww",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 135,
          "content": "Funny how hers is private but she told her friend's to\nStrangers on Reddit.",
          "id": 131,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 127,
          "content": "Also OP admits that in addition to the 500$ her friend also bought her a gift!",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "The comment of “not being take. Advantage of”\nMakes absolutely no sense. Like what does she even mean? The friend said 20 is sufficient. You think someone who gave you 550 for your failed marriage is taking advantage of you by asking for 20? My god lady, go get a job and join us peasants in the real world",
          "id": 133,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 29,
          "content": "Apparently she’s living off of GoFundMe contributions. Doesn’t want to be taken advantage of. Perfectly fine taking advantage of others. The cognitive dissonance is astounding.",
          "id": 134,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "\"well that wedding failed so it doesn't count!\" wanna bet OP would expect her friends to contribute again to her second wedding?",
          "id": 135,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "I wonder if he asked for that much or if she just offered it",
          "id": 136,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6084,
      "content": "I have a title for your memoir: \"I AM the asshole\"",
      "id": 137,
      "comments": [
        {
          "score": 2478,
          "content": "Chapter 1: why my marriage didn't last a year",
          "id": 138,
          "comments": [
            {
              "score": 2150,
              "content": "Chapter 2: how I lost all my friends",
              "id": 139,
              "comments": [
                {
                  "score": 1950,
                  "content": "Chapter 3: how the internet agreed i'm the asshole",
                  "id": 140,
                  "comments": [
                    {
                      "score": 2007,
                      "content": "Chapter 4: Am I a narcissist because I’m writing a memoir before I’ve accomplished anything?",
                      "id": 141,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 51,
                      "content": "Chapter 4: Asshole Resurrection",
                      "id": 142,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "y’all are so funny lmao",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Chapter 10: How not to be taken advantage of by people you took advantage of",
              "id": 144,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 348,
          "content": "I knew OP was the asshole the second they said they’re writing a memoir 🙄",
          "id": 145,
          "comments": [
            {
              "score": 140,
              "content": "I know two people who are writing “memoirs” and they are biggest assholes to exist. So your comment checks out.",
              "id": 146,
              "comments": [
                {
                  "score": 17,
                  "content": "Dear ~~diary,~~ memoir…",
                  "id": 147,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "Exactly! I can see writing a memoir when you’re retired, to pass down to your kids and grandkids. But writing a memoir at a young age to avoid getting a job?! Seriously?!",
              "id": 148,
              "comments": [
                {
                  "score": 12,
                  "content": "Absolutely, if my dad decided to write a memoir I’d be thrilled and hang on every word but even with as interesting a life as he’d led I wouldn’t expect anyone else to be interested. And from the comments it sounds like OP is maybe 30-ish and has never even had a real job. What is there to write about?? And if OP somehow has crammed a memoir’s worth of life in before being a professional student, they’d be getting a publishing grant, not mooching off of friends.",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 69,
          "content": "This should be the top comment 😂",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "I’m immediately thought YTA after reading the memoir part.",
          "id": 151,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 42,
          "content": "Take my poor person gold 💫",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "She doesn't mention her age, but I can guarantee this is the type of memoir that no one asked for, but she's so self-aggrandized that she genuinely believes she's had a life that necessitates writing a memoir.",
          "id": 153,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3191,
      "content": "YTA. She contributed $550 to your wedding that didn't even last a year, the least you could do is help with at least $100, or  volunteer to help with the  wedding such as clean up etc. You said her fiance can get an extra job, why can't you get a job?. Seems like you're just lazy and not even a good friend.",
      "id": 154,
      "comments": [
        {
          "score": 847,
          "content": "I see why OP is now divorced…",
          "id": 155,
          "comments": [
            {
              "score": 468,
              "content": "Lol but she’ll be writing a memoir about it",
              "id": 156,
              "comments": [
                {
                  "score": 56,
                  "content": "I'm sure all 2 paragraphs of life experience will be super exilerating",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "\"How To Profit Off Your Friends Kindness\" by OP",
                  "id": 158,
                  "comments": [
                    {
                      "score": 5,
                      "content": "“How To Win Enemies And Lose Friends” by OP or “How To Freeload While Working On A Memoir”",
                      "id": 159,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "That’s so interesting you said she, I assumed OP was a man! Either way I’m sure the memoir will suck hard unless it’s “the assholes guide to scamming friends”",
                  "id": 160,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 118,
              "content": "Lucky man escaped",
              "id": 161,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2106,
      "content": "She helped pay for yours and you can’t even swing $20? YTA.",
      "id": 162,
      "comments": [
        {
          "score": 301,
          "content": "Lmao OP’s probably just mad now that her friend is getting married meanwhile her own marriage didn’t last. And it’s like yeah, that totally sucks! But it’s not your friend’s problem, it’s YOURS OP.",
          "id": 163,
          "comments": [
            {
              "score": 74,
              "content": "She’s so cheap it’s no wonder her own marriage didn’t last.",
              "id": 164,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 113,
          "content": "You know what else?  OP has Reddit Premimum - if she didn't have reddit premium for a couple months OP could contribute that $20.  WTF OP.",
          "id": 165,
          "comments": [
            {
              "score": 43,
              "content": "She NEEDS those because of her full time job being an influencer. 😂🤣🤣🤮",
              "id": 166,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 32,
          "content": "I feel like OP’s friend saying any amount is fine, even $20, is the real kicker here. OP’s friend is showing grace and consideration for her current financial circumstances and isn’t keeping a score card by trying to hold OP to the same level of contribution she made to OP’s wedding. That’s a kind and considerate friend that just wants her friend to show she cares by making ANY contribution that is within her current means. I find it very hard to believe that OP can’t offer ANYTHING at all. \n\nYTA for not even trying to consider how you could contribute in your current circumstances. And for thinking that bc your marriage only lasted a year, your friend’s contributions are somehow void?",
          "id": 167,
          "comments": [
            {
              "score": 11,
              "content": "Oh but she offered to mention her friend in her memoirs and help consult. That’s more valuable than $20! Baahaahaahaaa",
              "id": 168,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1553,
      "content": "Um, what?\n\nINFO: Are you going to her wedding? If so, then you are going to spend money anyway. Just give her that money for the wedding.\n\n>she says that since she helped pay for my wedding ($550), that I should help her out\n\nWay to bury the lede here. She helped you, but you just don't \"think it's right\" for you to help her in return?\n\nYTA",
      "id": 169,
      "comments": [
        {
          "score": 111,
          "content": "And they asked for cash in lieu of gifts. Gifts aren’t required but the title makes it sound way worse than it is. They simply registered for a wedding instead of houseware. Maybe it’s tacky, but it’s more useful to the couple. The title should say “AITA for not buying a wedding gift?”",
          "id": 170,
          "comments": [
            {
              "score": 46,
              "content": "The title should say \"How to take advantage of friends after they live up to their end of the bargain, but tell them they are taking advantage when it is your turn to give\"\n\nor more simply \"AITA for being the pot that calls the kettle BLACK?\".\n\nBTW--she claims her \"presence\" at their wedding is her gift to them. LMAO!",
              "id": 171,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Yeah, even without the money the person already got as a gift, they were trying to get out of even buying a gift for the other friend. \n\nWhat a dick.",
              "id": 172,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "You think she was gonna buy a gift? She was just gonna go. Get blasted at the open bar. She needs more experiences for her memoir after all",
          "id": 173,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 978,
      "content": "YTA\n\nI am sorry to say this, I do understand your financial situation. However, returning a favor is what a good friend should do. She seems like she is being understanding, asking for just a little bit. And no, just helping your friend (and she is okay with even 20 dollars) will not make you poor all of a sudden. I would show this gesture if she was my close friend.\n\nAnd she gave 550 for you, she doesn't even ask that much, come on!",
      "id": 174,
      "comments": [
        {
          "score": 783,
          "content": "She clarified in another comment that she currently lives off a gofundme her friends donated to. This makes it just so much worse.",
          "id": 175,
          "comments": [
            {
              "score": 429,
              "content": "Ohh\n\nPretentious and a freeloader\n\nGreat combination",
              "id": 176,
              "comments": [
                {
                  "score": 52,
                  "content": "But she doesn’t want to be taken advantage of🤪",
                  "id": 177,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Oooh \n\nThe irony",
                      "id": 178,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 202,
              "content": "Oh my god, she cannot be real.",
              "id": 179,
              "comments": [
                {
                  "score": 126,
                  "content": "Pretty sure she's not. Each comment seems designed to spark outrage.",
                  "id": 180,
                  "comments": [
                    {
                      "score": 24,
                      "content": "She’s just here getting fodder for her “online bullying” chapter of the memoir! Look how mean everyone is online /s",
                      "id": 181,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 68,
              "content": "Oh that’s just messed up. \n\nWhat’s the memoir about? How she screwed her friends over?",
              "id": 182,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 34,
              "content": "Ummmm, excuse me, she's writing a *memoir*.  Don't you understand that one cannot possible work while writing a *memoir*?  *Memoirs* are **the** most important thing, far more than working like some kind of peasant.",
              "id": 183,
              "comments": [
                {
                  "score": 8,
                  "content": "it would be funny if it wasn't so sad",
                  "id": 184,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "She’s a parasite",
              "id": 185,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "In another comment when asked what she'd get her friend as a gift if it were a more classic wedding situation OP said her presence was the gift hahaha",
              "id": 186,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "She what? Holy hell",
              "id": 187,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 73,
          "content": "This friend got her a gift worth about $550 as well, so she actually gave her $1100 towards OP’s wedding. oP then returned the gift to the store *FOR CASH*, and split it with the ex. None of that money has been returned to the friend",
          "id": 188,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 836,
      "content": "YTA. \n\nYou literally made this promise years ago and now you're backing out now after you already benefitted from it. She helped pay for your wedding. It's money instead of wedding gifts, which isn't a crazy ask, and she's literally asking for $20. \n\nYou come across as very narcissistic/self-centered in this. Literally this entire post is just \"me, me, me\".",
      "id": 189,
      "comments": [
        {
          "score": 108,
          "content": "She’s also living off a gofundme funded by… you guessed it…. Her soon to be ex friends!",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "She is writing a memoir... They are a fucking nobody and they are writing a memoir.",
          "id": 191,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 622,
      "content": "YTA - first and foremost because you are trying to twist the story in your favor. You barely mention that you are the only one in the group who doesn't fulfill the pledge to help each other - after everybody else kept theirs and supported your wedding. And thinking that writing your memoir would be a valid reason to not help your friend is ludicrous.",
      "id": 192,
      "comments": [
        {
          "score": 56,
          "content": "And also a valid reason not to have a job. Like that’s a long time to be not working and relying on the potential for income",
          "id": 193,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 44,
          "content": "Does anyone else get the feeling that OP made absolutely sure she was the first one to marry just so she could cash in from her friends and get her dream wedding, even knowing the marriage wouldn’t last? And also knowing full well she would then reneg on her promise to her friends because she’s already cashed in?",
          "id": 194,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}