{
  "post content": "I (17m) have two sisters, Alice (29) and Miranda (33). I am much closer to Alice than I am to Miranda. Miranda is also not on good terms with our parents. Alice has four kids and is currently expecting child number five, while Miranda can’t have children which her ex divorced her for. Miranda is very successful in life, she has a nice apartment, works a good job and earns a decent amount of money. Alice, on the other hand, is struggling financially. She had her first kid right out of high school and got pregnant with her second child soon after, so she decided to become a SAHM to her children while her boyfriend provides for them.\n\nMe and my parents try to help them out as much as possible, be it childcare or money, whatever she needs. I love my nieces and nephews. I take them to the park and play with the older ones, I really enjoy it. Miranda doesn’t help out with them, she says it’s because she’s too busy. Well, she works long hours, but she doesn’t have kids, so I don’t know what she does on weekends. She also doesn’t help out financially, which I find unfair, since she makes so much money and all she does is spend it on herself, although she does give us very nice gifts for Christmas and birthdays. My parents nag her about it, saying she should give some of her money to Alice monthly, and I agree with that.\n\nSo, here comes the part where I may have been an asshole. I was at Miranda’s place last week, as she baked muffins and invited me over to eat some and catch up. We got on the topic of Christmas presents and I told her some of the stuff I wanted. She nodded and said she would give our parents a coupon for a much needed vacation and Alice some clothes she had mentioned and also some new boots and jackets for her kids. I was a little stunned she didn’t have more for Alice, so I asked, “Why do you only get Alice the bare minimum? You can afford to help out more and you refuse to out of spite.”\n\nMiranda looked at me and laughed. She said it wasn’t her business to feed six people, that Alice was old enough to make her choices and live with the consequences. She knew what she was getting herself into and that she wouldn’t pay Alice’s way through life just because she kept having children she couldn’t afford.\n\nI was stunned at how cold she reacted. I asked her how she could live her life being so selfish and uncaring, and she got angry and told me, “Listen, kid, there are some thing you are way too young for to be discussing with me, and this is one of those. Drop the subject or get out.” I got really frustrated with her and said something I probably shouldn’t have. I told her, “No wonder your husband divorced you, even if you could have children, you would be a terrible mother.” Miranda got very quiet and told me to leave and never come back.\n\nShe has now blocked me on everything, and though I don’t agree with her not helping out, I’m starting to feel guilty for what I said. So, AITA?",
  "id": 1,
  "comments": [
    {
      "score": 50688,
      "content": "YTA. You went way too far with that comment. Shame on you. And Miranda is completely right. It’s HER money that SHE earned. She has absolutely no obligation to give HER money away if she doesn’t want too. You and your family expecting Miranda to give HER money to her sister that can’t afford her lifestyle is greedy. Yes your sister Alice kept having kids, it was HER choice to keep having them. No one owes your sister anything because of the choices SHE made, especially her sister.",
      "id": 2,
      "comments": [
        {
          "score": 17315,
          "content": "Right! Maybe instead of being mad at Miranda they should be mad at Alice for having more kids!",
          "id": 3,
          "comments": [
            {
              "score": 17642,
              "content": "Honestly. The irresponsibility of having not just one or two, but *five* kids you can't afford is staggering. Miranda sounds like the only responsible one in this story.",
              "id": 4,
              "comments": [
                {
                  "score": 16856,
                  "content": "Some people are so irresponsible because they grew up with people who weren’t responsible themselves. \n\nLike this: “She also doesn’t help out financially, which I find unfair... My parents nag her about it, saying she should give some of her money to Alice monthly, and I agree with that.“\n\nOP: your parents are flat out wrong, and you are wrong on multiple levels. Your poor sister Miranda; there’s no indication she never wanted kids, just couldn’t have them so was divorced and abandoned by her husband, and now is being vilified by her irresponsible and overbearing biological family. I hope she finds joy and fulfillment.\n\nEdit:\nI just realized that Miranda is giving gifts that she realizes are things that would be appreciated so much by kids who grew up in a financially struggling house. OP was 6 when both of his older siblings were out of the house and the financial pressure eased up. I expect he has had a much different experience than Miranda.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 8546,
                      "content": "This line stuck out to me \"Well, she works long hours, but she doesn’t have kids, so I don’t know what she does on weekends. \"\n\nHaving children is not the only thing a woman can do with her life. She probably does all kinds of things. Work, engage in a hobby, clean the house, see friends, pay Bill's, catch up on sleep, work out, work on finances, etc etc etc. Kids are not the be all end all and not having them doesn't mean you just sit in an empty void not existing.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4591,
                      "content": "I hope she finds a new family of her choosing.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3414,
                      "content": "Thank you!\n\nCan you imagine? Her husband leaves her because she can’t have children and then she had to watch her sister pumping out kids she can’t afford like a salad shooter or something….and then everybody gets mad at her for not financially supporting them!? \n\nI wish I could give Miranda a hug.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2076,
                      "content": "Have your relationship fall apart because you can't never kids and then be called selfish because you only gift so so much to someone else's. How ridiculous. She has her own expenses and can do what she wants with them. Gifting a holiday voucher to her parents and clothes for her sister and each of her kids- that's very generous, not everyone does that. She sounds like a lovely aunt and daughter.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1633,
                      "content": "“All she does is spend it on herself, although *she gets us very nice things for Christmas.*”\n\nHonestly stunned at OP’s “logic” here. I hope Miranda goes no contact with her entire awful family.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 775,
                      "content": "Life pro tip: don't have children you can't afford.\n\nWhy should Miranda have to help support Alice because Alice makes poor life choices? Choices have consequences. Choosing to have five children is a huge financial burden and if you can't afford it, then maybe you shouldn't do it. \n\nWhat's unfair is expecting Miranda to give her own money to Alice just because Alice chose to have a bunch of kids she couldn't afford. Miranda probably invited OP to her house hoping that maybe he would be the one family member who would care about HER. Nope. \n\nOP, Miranda was absolutely right, you are just too young to have an understanding of the complexities of relationships, children, and consequences. Those things come with experience which requires being an adult out in the world on your own. Not an adult like Alice (who is unable to take care of her own children) or your parents (who apparently encourage irresponsible behavior), an adult like Miranda who can take care of herself and her obligations.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 429,
                      "content": "Yes. Thank you for saying this. My brain was SCREAMING while reading this.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 41,
                      "content": "I hope the parents can’t afford the OP’s university fees because they’re too busy helping Alice and her many many kids.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "I’d like to upvote this comment 100 times.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Re: your edit- yeah, OP calls new boots and coats for the kids the “bare minimum” and in that point he’s right, but the blame is totally wrong. It’s a bare minimum that *the parents of these kids are not providing.* Boots and coats aren’t cheap, especially since kids grow out of them every year, but they’re *necessary.* Miranda is being responsible, not just with her own money but also in her choice of gifts for her sister’s kids- covering necessities that she has reason to believe aren’t getting taken care of otherwise. Miranda was absolutely right, OP doesn’t have the maturity, life experience, or common sense to be having this conversation as an equal.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2549,
                  "content": "Sometimes the black sheep of the family is the only sane nice person, I feel that may be the case here.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 983,
                      "content": "The “black sheep” is just the one who sees through all the bullshit.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 287,
                      "content": "AMEN! I’m going through a version of this now. You’re told to work hard, go to college and be a responsible member of society. You do all of that, only to have a pack of haters in your family. It’s crazy! I honestly feel really bad for Miranda, having to deal with all these entitled people in her family.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 87,
                      "content": "Your words are SO true!\n\nI wish I had another freebie award, but I just gave it to the top comment - which I can't possibly upvote enough.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "YUP, this happens so often. Like, how dare someone choose to live THEIR life for themself??? /s\n\nShe doesn’t have to be useful to be loved. Family is supposed to give unconditional love and OP’s entire family is placing conditions for love on Miranda. It’s toxic and crappy as hell. If love isn’t unconditional then she is more than in the right to choose to separate rather than bend over backwards trying to catch up with the goal posts that are likely constantly moving. She could give an inch and they’d demand a mile. She could give a mile and they’d demand 10, on and on. Seems like she wouldn’t be able to please them no matter how hard she tried.\n\nIt’s irresponsible to have 5 kids if you can’t afford them, Alice chose it though and Miranda is right, gets to deal with the consequences. Seems like Alice is used to being catered to and given things, so she just does whatever Willy fuckin nilly.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 361,
                  "content": "not a surprise she's not close to any of them. they all sound entitled as hell",
                  "id": 21,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 217,
                  "content": "This. When I found out I was pregnant with my son (a shocker as I was told it was unlikely I could get pregnant again), I knew I couldn't afford any more after him. \n\nThe pregnancy and birth almost killed me, making it so that if I did get pregnant again, I wouldn't survive through the entire thing. I still got my tubes tied because I don't want to take that chance. Even if I could have had more kids, I knew I couldn't afford any more!",
                  "id": 22,
                  "comments": [
                    {
                      "score": 15,
                      "content": "My brother and SIL literally paced their kids because they knew they couldn’t afford two in day care at once. So they didn’t get pregnant again until their oldest was about to start school. And they both have good incomes but with the cost of day care, they made the responsible choice.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "This is what got me first. She had her first kid right out of high school so let’s assume 18. Since she’s 29 now that means she’s having one roughly every 2 years… nothing wrong with that if you can afford that! She expects handouts and her parents and brother are feeding into that. Poor Miranda is out here hustling, still gives her family very nice gifts, and was dumped by her husband for something that was not only out of control but likely devastating. Miranda would be a great mother because her priorities are straight. Every single person in this story sucks except Miranda. YTA all the way",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "seen posts on here about women addicted to kids. some 18 year old guy said his mom was trying to have kid #10 and they were dirt poor and he wanted to leave. its like she is a baby addict.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I believe my mother was one of those people.  She had 9 - never mind we were Catholics, we weren't religious.  I think my mother used \"babies\" as her way of escaping life.  You have a built-in excuse of not being able to participate in anything because you have \"all these children\" to care for.  In turn, it made my mother the \"needy/special one\" who required lots of financial help and attention from family because she was so burdened.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": ">The irresponsibility of having not just one or two, but five kids you can't afford\n\nShe is irresponsible because OP and the parents help out anyway. I really think Alice is taking advantage of the situation; free childcare AND she gets money? No wonder she keeps having kids.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Right? Like I would never turn my kid out for being pregnant, and I would try to help, but I would be furious if they kept having kids they couldn’t care for. Life happens, and they are my kids and grandkids, so I would try to help, but there is a difference between,”Mom, dad, I am pregnant and scared,” and “Mom, dad, I am having kid number five for you to pay for.”",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "OP doesn’t seem to realize how much jackets and shoes cost for 5 kids either. Like damn. Especially if they’re even medium quality, that’s easily $500.\n\nEdit: Just reread it and it’s 4 kids, but still. Kid’s basics are expensive af when they grow out of stuff every year. A month ago I bought my toddler a whole new wardrobe that was too big in preparation for winter ($100 cuz I thrifted stuff and had to get shoes) and she’s already outgrowing all of it because she hit a huge growth-spurt.",
                  "id": 29,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "And then to not work on top of it.  Jeesh!",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "And Alice is plenty young enough to keep the conveyor belt running, particularly since the family is scrabbling to support her poor choices.",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1042,
              "content": "Miranda should definitely help alice by buying her some condoms and birth control /j \nYTA OP as well as your parents and Alice",
              "id": 32,
              "comments": [
                {
                  "score": 252,
                  "content": "If I were Miranda I'd just offer money for  anabortion in case Alice gets pregnant again, but that'd probably make it E. S H, as it is now YTA",
                  "id": 33,
                  "comments": [
                    {
                      "score": 308,
                      "content": "My nephew is kinda like Alice.  He called my mother (his grandmother) for money for the 90000 times and she said \"I'll pay for a vasectomy\" I about died.  It stresses my mom out badly when he asks for money (the only time he talks to her) because she gets so upset thinking about them doing without or needing something so she usually gives in.  Then of course when tax returns come out they are on some big vacation. She finally blocked him from contacting her.  She still loves and sees him at family functions although not much because he lives several states away and friends on Facebook but he can't message her directly anymore.  If it is a true emergency he can go through one of us or his mom.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 809,
              "content": "But obviously a woman's job is to squirt out as many kids as she can a a woman who doesn't and makes a lot of money is horrible",
              "id": 35,
              "comments": [
                {
                  "score": 886,
                  "content": "OP doesn’t even say if Miranda wanted kids or not. Just that she couldn’t have them and so was divorced by her ex for it, which would mean that she might have wanted them. Imagine how awful it would be to want something, be denied it, abandoned for it, push yourself into a different path to relieve the pain from being denied it, and then vilified for not being subservient to others.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 501,
                      "content": "Hell, it could’ve even been her husband that was shooting blanks. In some places the woman is just automatically blamed for not getting pregnant or worse yet, not “producing” a male heir.\n\nEveryone EXCEPT Miranda sounds like entitled assholes. Winter gear for 4 kids is very expensive. Source: We have 4 kids here, one in college, but still buy her necessities because we want ALL her focus on school. I would be extremely grateful to have family that could afford to gift them winter coats/boots. My son had a huge growth spurt and can’t wear the hand-me-down snow pants I was gonna give him and we managed to buy his coat and boots, but we’re struggling to get him snow pants this year. I can’t imagine the level of entitlement to think the older sibling should give a monthly allowance just because she popped out 4 kids. Honestly, if Alice was single or had one accidental kid and was struggling with unemployment this would be a more valid request…still not entitled to it, just asking for help in that situation would seem less tacky.\n\nEdit: My bad, Alice has FIVE kids, five kids they expect her older sister to help with. I’m confused as to why Alice and her partner NEED childcare help. She wants to be a stay home mom, but expects others to babysit their weekends away? This can’t be for real, who would have the balls to expect other people to support their bad choices this way??",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 256,
                      "content": "Pretty sure from the description it was \"can't\" rather than \"won't\", which (I agree) makes OP's comments even worse.  \n\nYTA OP.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "All of this^^^ My heart literally felt a pain reading that and imagining what Miranda would be feeling if she wanted kids but couldn't conceived/carry. The utter demoralization and betrayal of a loved one saying those words would be completely unforgivable... Ever. Even if Miranda did not want children and could biologically conceive, having her 17 year old sister who knows jack shit about life and love throwing the loss of her marriage in her face over that choice is horrific.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Yup. If OP is correct that she “can’t” have kids, chances are she found out because she tried, or because she had some medical situation that revealed/caused infertility. Most people who simply don’t want kids never bother finding out if they can or not. Also the family narrative around her divorce would likely be much different if she and her husband split because he wanted kids and she didn’t. Saying he left her because she can’t have kids is much harsher.\n\nAlthough now that I think about it, OP’s family seems the type to harass any daughter about having children until she pops some out. Maybe Miranda *doesn’t* want kids but told them she can’t just to shut them up. Either way she has no obligation to fund her sister’s brood and the family is way out of line.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 695,
              "content": "Right? Why is OP not helping financially? At 15 I dropped out of hs to get two jobs. He's 17- a lot of schools will let you go half days. No reason he couldn't have school and a part time job, and just donate his whole partime check to the sister. He doesn't need it, why isn't he helping out?? \n\nObviously that's a dumb way to think. OP needs to grow up a bit more before he starts judging those around him.",
              "id": 41,
              "comments": [
                {
                  "score": 254,
                  "content": "Good point. OP I hope you turn over your entire paycheck to Alice to help.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 24,
                      "content": "For your entire life lol",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 105,
                  "content": "OP sucks, but he does say in the post that he helps her with childcare and money. Obviously that still doesn’t mean Miranda should have to help out.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 460,
                      "content": "Which is actually pretty fucked up.\n\nAlice, and whoever is knocking Alice up, are fine taking money from a minor and using him for childcare, as well as their parents, and Miranda, and presumably his family too.\n\nStop having kids you need everyone else to drop their lives to take care of for you!",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "Where do you live that school will allow half days so the teen can work? I’m just curious. If OP feels this strongly about supporting his older sister he should absolutely stay single and dedicate his extra money to supporting her!",
                  "id": 46,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Texas (United States), mind you I'm 30. They might have changed things by now since you've brought it up 🤷‍♀️ but I knew a lot of kids who would lie about having 'work' and being able to just leave early whenever they felt like it. Unfortunately, I needed a full time and a part time job to support my mother and brother, so I had to drop out.",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Judging by this family that is what he is gonna end up doing for the rest of his life. Paying for Alice's 8th and 9th kids winter gear.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 349,
              "content": "Agree, but I want OP to go to Alice and tell her what a selfish person she is. She has so many kids when Miranda has none. Maybe Alice should give Miranda her kids and make her sister happy. That seems to be his logic for the money, why can't he think along the same lines for kids? \nIndeed there are many cultures where parents give their children up to their siblings who have none and can afford to give them a good life. This way the kids have a good life and hopefully Miranda has kids.",
              "id": 49,
              "comments": [
                {
                  "score": 207,
                  "content": "And that evil Alice is having 5 kids out of spite, because Miranda can't have kids, no less! \n\nAlso, it's \"adorable\" how OP only helps with the \"fun\" stuff regarding kids: play with them, go to the park, etc, not even full-time babysitter. Why, OP? because childcare is difficult probably, eh? \nAlso, what is OP getting kids for Christmas? why not get a good job and support them? \nsmh \n\n/s obviously",
                  "id": 50,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 24,
                  "content": "That’s also a great idea! If Miranda still wants kids this is absolutely the perfect solution. Since Alice enjoys popping them out so much, she could even do a surrogate pregnancy for Miranda and that way Miranda gets a newborn, not some hand-me-down 5 year old lol. The kids get new winter gear, Miranda gets a fresh baby. I love it!!",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 150,
              "content": "SERIOUSLY!  \n\nThey're mad at the one not making terrible decisions.  Yet they give a pass to the one that keeps making the situation worse.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "YTA - I already hated the first half of the post. Op wondering what Miranda could be doing with her spare time. Oh I don't know, having a fucking life outside of children. The audacity of them thinking she should help our Alice when Alice is old enough about contraceptives!",
              "id": 53,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2526,
          "content": "OP sounds incredibly naive, and honestly needs to grow up. Yes, it's kind to help your siblings. But you don't OWE them financial support, especially because you're single and child free (and not even by choice, this poor lady). \n\nThe sister is an adult who made a choice both not to work, and to have a large family.\n\nETA: obvious YTA. OP was needlessly cruel.",
          "id": 54,
          "comments": [
            {
              "score": 914,
              "content": "I can guarantee that there is a whhoooollleee lot of history between those sisters (and parents) that OP knows nothing about.  He is only 17 now.  They were around 17 when he was born.  Even now he would still not be included in all the \"grown up conversations\" in most families.  He was definitely not involved in any disputes or anything like that between them and their parents.  \n\nAlso, the audacity to call her selfish when by his own admission, she is more than generous with gifts.  Buying parents a vacation?  Buying 5 SETS of winter boots/coats!?  Presumably was originally planning to buy OP whatever crap they rattled off wanting before OP decided to attack her for no good reason.  She sounds incredibly charitable to her family!",
              "id": 55,
              "comments": [
                {
                  "score": 770,
                  "content": "How much do you want to bet that Miranda gets next to no presents from these people in return because \"Miranda can afford to buy things for herself?\"\n\nWhether or not someone is well-off is not the point of gift-giving at all, but I'm guessing the double-standard is pretty wild.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 282,
                      "content": "Of course Miranda doesn't get anything! She's so \"selfish\" already, so why would they reward her \"selfishness\" with getting her a present!? 🙄",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 204,
                      "content": "This. My fiance makes considerably more than most of our families so we buy for all the kids (14 on his side and 4 on my side). We can't go all out (cuz SO MANY KIDS! plus we have 3 of our own) but most people on his side have decided that because we make more, our kids don't \"really need gifts\". \n\nHonestly, I wouldn't care if they didn't get my kids stuff but don't single them out.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 114,
                      "content": "I'm sensing she didn't get much emotional support through her divorce. Poor Miranda.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "how much you want to bet OP knows only what his family has told him about Miranda's divorce and what they have told him is wrong?  I wouldn't be surprised in the least that regardless of if they physically couldn't have children the bigger factor in the divorce would have been constant badgering to give up both his and Miranda's money to support Alice.  That would be hard to deal with even if they tried to go low contact with the family",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 157,
                  "content": "RIGHT?  1 set of boots and coats on the cheap end is going to cost at least $50 per kids, but probably closer to $100.  Clothes for her sister?  Especially if she needs maternity?  That's insanely expensive.  OP has probably never has to make do when it came to the necessities and has no idea of the cost.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 33,
                      "content": "That was my first thought - boots and coats for that many kids? We're easily talking HUNDREDS of dollars. She's not being stingy at all!",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Exactly. OP is 17. No idea how much that stuff actually costs or how difficult it is to come up with when the parents are struggling. It's a generous and thoughtful gift in my opinion.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": ">Buying 5 SETS of winter boots/coats!?\n\nThis was a moment when I realized OP has no idea what things are worth. 5 sets of solid children's winter gear could easily be a thousand dollar expense, 500 minimum. To call that \"selfish\" is wildly out of touch.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": ">Buying 5 SETS of winter boots/coats!? \n\nThis gets me. Kids need new sizes of this stuff every year and it's not cheap. I have 2 kids and if family members offered to buy my kids winter jackets, snow pants, and boots I'd be so grateful.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 775,
              "content": "Definitely naïve, he casually passes over his siblings bad relationship with their parents as a side note when we can see a demonstration of why she would chose to do so in the post",
              "id": 66,
              "comments": [
                {
                  "score": 708,
                  "content": "Seems like OP was not yet born or an infant when the relationship dynamics between his parents, Alice, and Miranda were happening. OP really needs to grow up and learn some background and definitely compassion. Miranda has had a hard life - she doesn't have a good relationship with her family, she is unable to have children, and the man she married left her because she couldn't. It's heartbreaking to think of how broken and alone she may have felt. And then OP has a tantrum and swoops in with the lowest of low blows. She had him over for muffins she baked! She must have felt she had some relationship with him and then so hurt and betrayed all over again when he said what he did. \n\nOP if you read this, those muffins were wasted on you. You don't deserve Miranda's Muffins!",
                  "id": 67,
                  "comments": [
                    {
                      "score": 201,
                      "content": "Yes! She went through all that and then her baby brother threw it in her face!",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 110,
                      "content": "nor he deserves her christmas presents!",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Miranda probably has to spend a good chunk of that money on therapy for the familial and relational trauma she's got from her \"family\".",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "THIS. I felt so sorry for Miranda because she baked muffins for her brother and that is how he treated her.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Oh definitely. Miranda's old enough to be OP's mom, so I'm sure the family dynamic already has some oddities.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 200,
                  "content": "The baby of the family and a nice age gap. I remember my siblings as babies and that got me off of having one real quick.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Haha that’s so true! Probably mostly only seen there parents opinions on the situation",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 463,
              "content": "[deleted]",
              "id": 75,
              "comments": [
                {
                  "score": 436,
                  "content": "I'm 17 and I know not to act like that. Age is not an excuse to be an asshole",
                  "id": 76,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 438,
              "content": "OP has clearly been indoctrinated by the family to believe the way he does but he is dead wrong and I’m betting once he starts his own life and is earning his own way in life that he will bristle at the idea he’s expected to help Alice and her family with more unwanted children. Miranda is getting those kids things that are needed because that’s what you do but she shouldn’t have to. No one made Alice have that many kids when she couldn’t afford to do so.",
              "id": 77,
              "comments": [
                {
                  "score": 95,
                  "content": "I can't wait for this to happen to OP actually",
                  "id": 78,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 185,
              "content": "Incredibly naive and apparently not very thoughtful. Like, imagine saying that the person who completely has her shit together, makes a lot of money, and knows how to manage her time and energy would be a terrible parent while fawning over the person who doesn't have enough sense to stop having children they can't afford and just dumps their responsibilities onto other people and complains when they don't joyfully take on her shit.",
              "id": 79,
              "comments": [
                {
                  "score": 15,
                  "content": "🥇🥇💥💥🏅🏅🏅💥💥🎖🎖",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 179,
              "content": "Exactly.  YTA OP you sound like an entitled brat.",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 128,
              "content": "Plus he can’t imagine what a woman does on the weekends without kids? I don’t have kids and work long hours, my weekends are for relaxing from those long hours.",
              "id": 82,
              "comments": [
                {
                  "score": 30,
                  "content": "You KNOW he’s heard that one from his parents. Or when HES forced to babysit on the weekends, he’s like why doesn’t she have to be here?\n\nIt is blatantly obvious in his storytelling how everyone treats Miranda and Alice. Miranda is the workaholic who never has time for her family and “spends all her money on herself” while Alice got pregnant right out of HS and wants to be a SAHM so everyone should help her because, babies.\n\nI was kind of on his side because he’s obviously been indoctrinated to believe this garbage and he’s still basically a kid. But he made that comment solely intending to hurt her because he feels like he and his family are SO superior to her. \n\nHey OP, Miranda is right. It is not her responsibility to help her sister deal with a decade of poor choices. She doesn’t owe any of you anything and I hope she cuts all of you off.",
                  "id": 83,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Agreed, reading it you could tell he was raised in an environment that was poor. But even he knows he went too far. Imagine asking your sister for presents then insulting how she spends her money the next? Imagine thinking a woman has to dedicate her time to children when she’s not working? OP thoughts clearly come from the parents but he’s almost a legal adult, it’s time for him to act like one. ~~Hopefully this comment section opens his eyes, or helps a little.~~",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 121,
              "content": "Of course he is. He’s a child that has been given the responsibility of watching nieces and nephews for a decade and thinks it’s normal",
              "id": 85,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "Plus Miranda does help! Is OP not doing the math on boots and coats for 5 kids?!! That’s gonna be hundreds.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 621,
          "content": "I seriously don’t understand how some people can say such horrible things to their siblings and genuinely mean it. Never mind the fact that OP’s logic is wrong, she’s a major a-hole just for that comment.",
          "id": 87,
          "comments": [
            {
              "score": 425,
              "content": "OP is a guy 🙄🙄🙄 makes it a million times worse. Useless nippled teenager telling a grown successful woman something like that in her own home.",
              "id": 88,
              "comments": [
                {
                  "score": 260,
                  "content": "This right here, who are you at 17 years old to come into someone else’s home and tell them how to allocate their earnings. I would laugh in OP’s face too, I feel bad for Miranda.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 30,
                      "content": "I used to think $100 was a lot of money because the only thing I HAD to pay for was gas, and it was $1.79 a gallon.\n\n17 year olds generally have no idea what's up.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "And after she tactfully tried to steer the discussion a different direction when he was massively out of his depth. She’s almost twice his age. This was not the subject to insert his opinion.",
                  "id": 91,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 317,
              "content": "Last time I tried nagging my siblings for their approval of plans to take care of our grandfather, my sister replied that the only reason I'm the only one of us concerned about Pap's care is because \"you have no life.\" There is no low siblings won't stoop to when they feel guilty.\n\nOn a more relevant note: YTA. Alice's kids are Alice's responsibility - that's the way parenting works. You had it backwards: clearly Miranda would make a much better mom than Alice or you wouldn't be nagging Miranda to be her niblings' mom because theirs is highly unsuited for the task.",
              "id": 92,
              "comments": [
                {
                  "score": 57,
                  "content": "Damn I always get sad when I hear such mean siblings. I'm really close to my elder sister and the only relatives we hate, we hate together lol",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 523,
          "content": "People are so triggered by child free women. They’re out here minding their own business, living rent free in other peoples minds. It’s truly comical. Miranda was right. Alice chose to have and keep her children. Not judging her for that, but it’s true. She made her own choices. It isn’t Miranda’s job to provide for them. She didn’t make those kids. \n\nYTA, op.",
          "id": 94,
          "comments": [
            {
              "score": 150,
              "content": "Miranda isn't even childfree, she's infertile. Which makes it even crueler that her family thinks she ought to be bankrolling her sister's choice and ability to breed like a rabbit.",
              "id": 95,
              "comments": [
                {
                  "score": 42,
                  "content": "Definitely agree! The fact that op threw her infertility in her face was uncalled for. He knew EXACTLY what nerve he hit when he said that. It sounds like Miranda has come to terms with the likelihood that she won’t ever conceive, but I know it probably still stings. I mean, her husband divorced her over it. Op needs to grow up.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 398,
          "content": "Yep. Miranda was right and OP is too young to know what has happened previously in Miranda and Alice’s relationship. OP seems to be heavily influenced by Alice and his parents, otherwise I’m not sure where he came up with these ideas. Alice is a grown adult who made her own choices. Miranda’s lack of financially supporting her sisters choices has nothing to do with how Miranda would be as a mother. OP is so far off base here and such an asshole. Hope he gets his head out of his ass, understands where he went wrong and how he has no basis for any of his comments or beliefs about Miranda, and gives a heartfelt apology through letter or whenever Miranda gives him a chance to do so.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 326,
          "content": "Miranda gave you a warning, you chose to ignore it.",
          "id": 98,
          "comments": [
            {
              "score": 56,
              "content": "This. And, wow. In a conversation where OP was dictating his demands for Christmas. The entitlement \n\nI hope Miranda cuts you all out, OP",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 289,
          "content": "And maybe Alice would have more money if she didn’t chose to have five kids. Don’t have so many kids if you can’t afford them. It’s not up to Miranda to be the bank account for Alice’s bad decisions.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 256,
          "content": "“She doesn’t have kids so idk what she does with her weekends”\n\nLike…she lives her life??? Shockingly people can do that without children???\n\nYTA",
          "id": 101,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 208,
          "content": "Op should drop out of school, get a full time and then give his entire paycheck to Alice",
          "id": 102,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 174,
          "content": "You said it all. Her family treats her like she should be her sister's own personal bank account and her brother just threw her worst fears in her face. \n\nGood luck to earn her forgiveness, OP. You'll need it. YTA.",
          "id": 103,
          "comments": [
            {
              "score": 12,
              "content": "If I were Miranda I wouldn't bother forgiving any of these mooching assholes. Just leave them to their misery supporting their spoiled sister's ever-expanding litter of kids she can't afford, and go live a happy carefree life with people who respect her independence and healthy boundaries.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 18713,
      "content": "YTA\n\nYour parents are also AH'S.\n\nYour sister Alice is also an AH.\n\nJust because Miranda can afford to take care of Alice's children doesn't mean it's her responsibility. Who are you to need to understand what Miranda does on the weekends or what she spends her earnings on? It's not fair??? Miranda is right. \n\nAlice is old enough to understand how to use condoms. If she's struggling with money at the 3rd kid, then struggling more at the 4th then why the hell did she get pregnant with a 5th? There's the selfish sibling for you and its not  Miranda, wakey wakey. Alice is the one who seems to expect the rest of the world has to provide for the kids she keeps irresponsibly having.\n\nBtw you are not just cruel for what you said. You're also entitled and childish. You made an active decision to help Alice and her kids. Either you do so selflessly or you choose to stop, but you don't cry about \"that's not fair\" when someone else makes a different choice than you with their own time and money.",
      "id": 105,
      "comments": [
        {
          "score": 6092,
          "content": "I hope OP is not going to grow up and become one of those you encounter who thinks that because a coworker has no kids or is single, that they should be expected to put in longer hours than others or cover for others etc\n\nOP - huge, huge YTA and you’re in for a rude shock. Someday you will see how much of an AH you were to Miranda and just how completely right she was - and worse, how generous she actually is and you do not seem to give a $hit.",
          "id": 106,
          "comments": [
            {
              "score": 4241,
              "content": "Yeah, how is getting winter jackets and boots for FOUR children \"the bare minimum\"?? They are NOT cheap.",
              "id": 107,
              "comments": [
                {
                  "score": 1811,
                  "content": "Exactly, I bet she chooses good quality clothes so you’re looking at up to three hundred pounds for everything.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 1201,
                      "content": "Where i live it would be close to $300 *each* for a full winter set warm enough for our harsh winters. \n\nI just spent $180 (on sale) and my kids 2yrs.\n\nOP is way out of line.",
                      "id": 109,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 327,
                      "content": "More that that. A decent winter coat costs about $75-150 US.",
                      "id": 110,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 729,
                  "content": "OP is only 17 so I’m thinking he’s naive about adult life. Winter clothes are hella pricey, especially if she’s buying higher quality stuff.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 640,
                      "content": "It makes me wonder how well off Miranda actually is.  Sometimes kids think people who work a lot make a lot.  unfortunately that is not always the case.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 406,
                  "content": "OP is 17 and clearly does not buy their own clothes. Just bought boots and winter coats for my two children and it cost me close to $450. A $900 gift for my niblings is insane; we spend around $50/child for birthdays and Christmas for niblings.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 211,
                  "content": "To me, she's getting them necessities, not wants. Which is responsible. I'd much rather have people give my kids what they need over what they want any day!",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 92,
                  "content": "FIVE children.",
                  "id": 115,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "5 kids. And Alice is expecting her 6th.",
                  "id": 116,
                  "comments": [
                    {
                      "score": 12,
                      "content": "It says she has 4 kids and is expecting her 5th.",
                      "id": 117,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "100% this. OP doesn’t know what he’s talking about, not even close, and needs a serious reality check about how the world works. Miranda was right that he isn’t grown enough to be having those conversations with her, his sister who is twice his age. YTA big time.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "The bare minimum for gifts for niblings is zero. In other words, there is no obligation. Most of my uncles/aunties didn't give me gifts at my birthday or Chirstmas and nobody cared.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 429,
              "content": "> how generous she actually is and you do not seem to give a $hit.\n\nYep! \"Here's all the expensive stuff I want but can't afford now let me tell you what else you should be doing with all that money you earn.\"\n\nOP isn't just riding the gravy train, he wants to drive it.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 80,
              "content": "[deleted]",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Or get passed up for promotions because \"Johnson has a family to feed\"",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Guessing OP isn’t turning down his own Xmas and Bday gifts from Miranda and giving that money to Alice, eh?\n\nIt’s ok Miranda spends the money on him. But she’s an asshole if she spends it on herself. Make it make sense.",
              "id": 123,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1447,
          "content": "Speaking from experience, Miranda is freaking TIRED on the weekend. Not adjust physically but also emotional. I feel devastated for Miranda right now. She did “well” so now she needs to carry the entire family?",
          "id": 124,
          "comments": [
            {
              "score": 671,
              "content": "I want to find Miranda and give her a hug. She needs it with this codependent family dynamic.",
              "id": 125,
              "comments": [
                {
                  "score": 209,
                  "content": "I want to give her a plate of freshly made chocolate chip cookies, because who doesn’t like homemade cookies?",
                  "id": 126,
                  "comments": [
                    {
                      "score": 112,
                      "content": "I'd like to volunteer to clean her house, do her yard work, and run her errands so she has at least one day to just RELAX.",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "And some more cupcakes!",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Ugh same, I wish I could link up with the poor woman. She's 100% invited to my Thanksgiving and Christmas. I'm not well off, but i do handmade gifts and I bet she'd love a nice hand made quilt",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "No joke.  This aita struck an emotional chord with me more than any in recent memory. Screw this kid.  Tell Miranda I'll buy her a drink and want to be her friend.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "We need to find Miranda, declare Monday Miranda’s holiday and do nice stuff for her.\nLet’s find a nice day spa for her.\n\nWatch us find out “lots of money” is only $50k/year in east California and she’s a nurse or an adjunct professor or something.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 332,
              "content": "I am 100% Team Miranda here. I have no kids and I can barely move on the weekend, outside of doing the basics (groceries, house cleaning, laundry, etc).",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 518,
          "content": "I Just found interesting how Miranda is the selfish one for not giving Alice and the kids more gifts but OP isn't willing to give up his gifts(plural) so she can do so, he just thinks she should keep pulling money out of her pockets for them at call...",
          "id": 133,
          "comments": [
            {
              "score": 230,
              "content": "Yup, OP could have gone in and been like “I’m really concerned for Alice and the kids, please use the money you would have spent on things for me and get them more.”",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "And OP is old enough to work too. Give up his own money before he giving demands to his sister. Should be a good sum considering he doesn't need it for rent while living with his parents.",
              "id": 135,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 518,
          "content": "If my math is right, OP became an uncle around the age of six. He was raised with his nieces and nephews and has probably heard his whole life that Miranda is selfish for not helping out and what does she do with her time when she doesn’t have kids. \n\nThey are all major major assholes. \n\nExcept Miranda.",
          "id": 136,
          "comments": [
            {
              "score": 35,
              "content": "Even before that, I imagine a new baby would make a then 16-year-old see the parents as “selfish and uncaring”. In fact, it seems like her entire adult life has had the family continuously fawning over new babies. Idk how her feelings about kids have changed through the years, but it sounds like she’s confident in her beliefs. \n\nThe other part that he might not realize is that Alice is not entitled to the kind of support OP and his family give her. She *is* old enough to take care of her own kids, and that is NOT Miranda’s problem.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 102,
          "content": "Yes you’ve got time to grow up, don’t follow your parents attitudes.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "And Miranda still has the generosity to gift her parents a 'much needed vacation'. Miranda is not a selfish person here.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": ">Just because Miranda can afford to take care of Alice's children\n\nI am honestly not even sure that she can? From what OP describes, she has a decent professional job and a nice apartment. That is not the kind of fuck-you money that could just absorb a significant amount of the financial burden of a family with FIVE kids. I think OP is genuinely bent out of shape that Miranda is choosing to like, fund her own retirement instead of subsiding her sister's reproductive choices.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": ">that's not fair\" when someone else makes a different choice than you with their own time and money.\n\nIn one of my other replies I said there is some resentment towards Alice but it is projected on to Miranda. \n\nI feel like the parents are tired of providing for their nearly 30 year old daughter and probably also babysit frequenty; so much so that they are taking things out on Miranda who... 'does not do anything'. The OP is brainwashed by them to believe the same.\n\nYet however they do not call out Alice because of her 'woe is me' mentality and her being the fave child (Miranda ain't it) hence why the latter mentioned gets crapped on.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "OP has put himself  in a “parentification” situation for some reason? Maybe guilt? \n\nAnd now is mad that the other sibling isn’t “pulling her weight” and miserable like him \n\nOp is 17! He has NO business being this helpful to his VERY adult sister. I understand helping with babysitting or something, but money? That is crazy to me. \n\nHis sister is right, she has no obligation to help Alice . it’s cruel to equate the way Miranda treats Alice  , to the way Miranda may treat her children. Not to mention bringing up the fact that she could not have children..\n\n\nYTA OP \n\nI hope this  is a troll",
          "id": 142,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": ">Who are you to need to understand what Miranda does on the weekends or what she spends her earnings on?\n\nOP apparently thinks that if you don't have kids you have literally nothing to do, and nothing that you should spend money on. Kids!kids!kids! are apparently *everything*, and the only thing that can justify your existence. \n\nWith this attitude I'm kinda surprised OP hasn't knocked anyone up yet, but I'm sure it's just a matter of time - I mean, he has to justify his existence somehow! \n\nWhat an asshole.",
          "id": 143,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10748,
      "content": "YTA.  And very condescending as well:\n\n\"Well, she works long hours, *but she doesn’t have kids, so I don’t know what she does on weekends*. She also doesn’t help out financially, *which I find unfair, since she makes so much money*\"\n\nOn weekends, she probably has a wonderful time doing hobbies, spending time with friends, or just vegging and watching TV.  What she's *not* doing is wiping little noses, changing diapers, listening to temper tantrums, cleaning up messes, or mediating childish spats.  Some people enjoy that and some don't.  Her life sounds admirable and pleasant.  Alice on the other hand has 5 kids, no career, isn't even married, and struggles financially.  My guess is Miranda doesn't want to waste a lot of her hard earned money on Alice, who shows no signs of improving her lot in life or becoming stable and independent.",
      "id": 144,
      "comments": [
        {
          "score": 3325,
          "content": "As someone who likes to use her weekends to do dumb adult things (catch up on chores, run errands, etc.) and then do absolutely nothing (relax, play games, watch TV, read the books that keep accumulating on my bookshelf), I was seriously like \"WTF\" when I read that line! I need that downtime to recuperate, and since Miranda works long hours, she likely needs that brain recuperation and downtime even more over the weekend! Just because someone doesn't have children does not mean their life outside of work is empty or hollow.",
          "id": 145,
          "comments": [
            {
              "score": 1060,
              "content": "You forgot to add NAP. It’s the most important one.",
              "id": 146,
              "comments": [
                {
                  "score": 438,
                  "content": "As a CF adult career woman, that’s the best part of the weekend sometimes!",
                  "id": 147,
                  "comments": [
                    {
                      "score": 79,
                      "content": "It sure is!",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I say \"nap\" but I mean \"go to bed at 1PM and rise from the dead next morning at 10AM\"",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 382,
              "content": "OP (if they're not just a troll, they haven't responded to any comments) probably doesn't get that because he's 17m, probably has it easy just going to school and maybe working a couple hours.  \nBut oh god do you just need that time for yourself as you get older. I knew I got old when at 25 I tried to skip sleep for a night and felt miserable after lol.    \ni remember doing it in my late teens and still feeling refreshed.",
              "id": 150,
              "comments": [
                {
                  "score": 124,
                  "content": "I feel like I'm an old lady at 26 because yeah, I need my sleep and my downtime. I love kids, but at this point in my life, the thought of having to spend my weekends chasing after and taking care of them after a busy week (M.A. student finishing up thesis) just terrifies me.",
                  "id": 151,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "He probably was also raised with the belief that women need to be mothers to have anything meaningful in their lives, given his confusion that an adult, childfree woman would actually have a *life*.",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 364,
          "content": "YTA \n\nShe works for HER money and is entitled to do with it what she will. \n\nBeing a PARENT is all about sacrifice and putting your kids first. Alice and her BF are the ones responsible for making good choices to improve the lives of the kids they have.\n\nAt some point the parents went from being a crutch to enabling Alice’s lifestyle and choices. Those kids don’t deserve that and either someone puts their foot down and makes them face reality or they’ll continue leeching on the goodwill of family until you’re also expected to help finance their life.\n\nMIRANDA didn’t choose to not have kids, it’s just the cards she was dealt. You need to face reality and after doing so sincerely and genuinely apologize to her. \n\nAnd if you can’t do so then YTA far and beyond this encounter.",
          "id": 153,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 343,
          "content": "Running a household takes a lot of time especially if you work long hours. OP is too young to understand this. Miranda's comment was spot on.",
          "id": 154,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 279,
          "content": "OP thinks that every woman needs to become a baby machine to justify their existence 🤦🏻‍♀️",
          "id": 155,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 95,
          "content": "Yeah she does things on weekends like all people should, including a 17 yo who has been giving his up to babysit.",
          "id": 156,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 64,
          "content": "People who think that folks with no kids aren’t doing anything have no imagination. Like, what does OP do on the weekends?",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Also, it's quite common for someone to want their own kids but not want to be responsible for someone else's. The willingness to act as her sister's babysitter has almost no bearing on Miranda's ability to parent.",
          "id": 158,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Or, you know, maybe she spends it in therapy for dealing with a shitty family that treats her so poorly after she went through the trauma of infertility AND divorce.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": ">Alice on the other hand has 5 kids, no career, isn't even married, and struggles financially.\n\nI don't want to be judgemental, but Alice doesn't sound like a smart person.",
          "id": 160,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "As a child free person I have zero trouble filling my weekends and this comment made me seethe",
          "id": 161,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7486,
      "content": "YTA, in a big way. Your sister is 100% right about Alice and her choices. Your comment was unspeakably cruel. I feel terrible for Miranda. She’s done well for herself and instead of being happy for her, her family seems to think she needs to be a cash cow for her sister’s choices. \n\nYou need to apologize to your sister ASAP. If she doesn’t want to speak to you again, you need to respect that and back off. You really messed up here.",
      "id": 162,
      "comments": [
        {
          "score": 2458,
          "content": "Seriously, Alice can’t afford winter coats and boots for her kids and still decides to have another one? That’s messed up. \n\nMiranda is giving the kids essential items since they’re blameless. But she’s not rewarding her sister with lavish gifts because then who knows how many more kids she’d have and expect Miranda and others to pay for? Ridiculous.",
          "id": 163,
          "comments": [
            {
              "score": 1309,
              "content": ">Miranda is giving the kids essential items\n\nNot just essential; clothes, winter coats and boots are expensive. She is definitely not doing the bare minimum when buying these for 5 children.\n\nOP is just a child that parrots what their parents saying and doesn't even know the meaning of selfish.",
              "id": 164,
              "comments": [
                {
                  "score": 297,
                  "content": "Exactly! Assuming they are of good quality, winter coats and boots could easily run $300 per kid or more (so $1200+, since a baby doesn’t need boots and a separate coat). That is a very generous gift, even if Miranda is well off!",
                  "id": 165,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Even at all Walmart only, total per kid is easily 100. She's easily spending 500 or close to minimum",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 57,
                  "content": "And she’s providing things that could be handed down.\nBut noooooooo, Auntie Miranda makes sure everyone has new stuff every year!\nThis means that Alice can sell this stuff after a season.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "That's my take. Especially with his sister's reply saying he's too young to be discussing it. Miranda knows that her younger brother is just spouting what the rest of the family is saying and really not critically analyzing it for himself.\n\nEdit: Corrected pronouns",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "That was my thought on that line as well. She's not giving them the \"bare minimum\", she's giving them essential things that Alice as a mother should be able to provide, but can't, I'd say that is more than enough for Miranda to provide. It'd be like OP getting mad at her for buying the kids food instead of toys and never wondering why the kids need food in the first place. Good on Miranda for setting boundaries and bettering herself despite her family.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "My uncle had this mentality because my grandmother mopped up every mess he made from the age of 18 to the day she died (he was in his 50s).\n\nHe was quite shocked to realize that not only was the gravy train derailed but that we weren't having any of his shit anymore. \n\nGood for Miranda for making it clear that when her parents die she's not stepping up not now not ever.",
              "id": 170,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 508,
          "content": "They're probably the type of family that thinks a women's only real accomplishment is having children. Therefore all women who don't have kids should be contributing to those who do. I actually really feel for OP. ~~She's~~ He's been groomed to take care of and sacrifice for kids that aren't even ~~hers~~ his and feels as though not doing that is incredibly selfish.",
          "id": 171,
          "comments": [
            {
              "score": 273,
              "content": "OP is male, which frankly make his thoughts and comments even more out of line.",
              "id": 172,
              "comments": [
                {
                  "score": 76,
                  "content": "I bet his family all sided with the husband when he left and thought he was being completely reasonable.",
                  "id": 173,
                  "comments": [
                    {
                      "score": 35,
                      "content": "This is what I thought! I also bet Alice was thrilled, since her baby daddy still won’t marry her. Either that, or they’re not married so they can get more benefits. I bet she was super jealous when Miranda found a man who wanted to marry her, without even having any children together, and both of them having good jobs, with no government benefits. She probably was thrilled to see Miranda knocked down a peg when he left, and the reason makes her feel superior.",
                      "id": 174,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 28,
                  "content": "When I read the title and then the ages of the people involved, I knew OP was going to be the asshole. Turns out I was right.",
                  "id": 175,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "OP is a male. He just holds the same beliefs as his misogynistic family.",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "OP is a boy. I thought the same until someone referred to them as he and went back and double checked. \n\nWait until they realise they are looking to settle down and raise a family and realise they can’t afford it because Alice has bled them all dry.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "This is the impression I also get. They seem to think it’s justified that her husband left, like, “good for him,” and they seem smug about it, like they’re in a “better” group, along with her husband, of the fertile.\n\nLike, can you even imagine? You tell your parents your husband left you because you’re infertile, and they’re like, “well, I don’t blame him. You can’t do the one thing you should.”",
              "id": 178,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 81,
          "content": "I find it very funny that OP is saying Miranda would be bad mother. Is Alice a good mother? for continuing to have children when she can barely provide for the ones she has? OP, your sister was right - you are too young to understand. Why should Miranda be held responsible for Alice's bad choices? The comment you made was very cruel. It sounds like your family doesn't support Miranda bc all of you are so too busy supporting Alice - you can support both at once but sounds like you aren't. I would have cut you off if I was your sister lol",
          "id": 179,
          "comments": [
            {
              "score": 22,
              "content": "Honestly, I disagree that OP is too young to understand, which makes him even more of an AH to me.\n\nI think that 17years old is defo old enough to understand that infertility is a sensitive topic and one no 17 year old male should be commenting on.\n\nWith a basic reproductive biology class, some common sense, and critical thinking, anyone could see that OP was a giant gaping monstrous asshole.",
              "id": 180,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "I was thinking the same. Is it being a good parent to keep having children you can't afford? \n\nMiranda's success does not mean she has to support struggling family members. Sounds like OP should get a job doing whatever so he can continue to enable Alice's poor decisions. /s\n\nOP is such an AH and hopefully Miranda cuts off her entitled family members. I don't understand why some people feel entitled to a family members success. \n\nYTA",
              "id": 181,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5595,
      "content": "YTA, a big one.\n\nMiranda said it best:\n\n>She said it wasn’t her business to feed six people, that Alice was old enough to make her choices and live with the consequences.\n\nYou, your parents, and Alice have a lot of nerve expecting Miranda to support Alice's poor choices. Not one of you are entitled to a penny of her money. It is also none of your business what she does/doesn't do on weekends.\n\n\nEdit: Thank you for the award.",
      "id": 182,
      "comments": [
        {
          "score": 2889,
          "content": "The fact Miranda’s husband left her for her infertility… devastating. Now her family wants her to financially support her younger sibling with 5 kids and no job? And they attack her infertility when she refuses?! I’m sick. My heart breaks for Miranda. I hope she finds people in her life that support her and love her unconditionally one day..",
          "id": 183,
          "comments": [
            {
              "score": 842,
              "content": "Yes. My heart is breaking for Miranda. She must feel awfully alone. Her husband left her for something (I’m assuming) is beyond her control, and now her own family throws that shit in her face. I hope she has a whole bunch of loving, supportive friends she can turn to. Because god damn",
              "id": 184,
              "comments": [
                {
                  "score": 73,
                  "content": "This, but emphasize that her entire adult life (since 16) has had her family so invested in the next baby.",
                  "id": 185,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "Seriously! Like I want to go find Miranda and be her friend now. I don’t have kids either Miranda! Let’s go spend money on cool adult only trips and fun stuff!",
                  "id": 186,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 231,
              "content": "100% this! Not being able to have children is an immeasurable grief! Not getting it acknowledged by her family, and her brother throwing a comment like that must have hurt her so much.",
              "id": 187,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "I wouldnt be one bit surprised if the truth was her family expect Miranda and her husband to support her sister  was a huge factor in deciding to divorce.  Infertility may have exacerbated the problems but being hounded by her family and watching her be hurt by her family hounding her probably was worse.  OP wouldnt know the truth of the divorce, only what he was told by the parents",
              "id": 188,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "It's absolutely sick. Miranda sounds like a bad ass despite coming from this family. Hard worker, thoughtful gift giver, she's dead on it isn't her responsibility to take care of and pay for Alice's family, and told OP to get out and not come back. Absolute BA. OP you and your family are horrendous to Miranda. I can't believe you would attack her health issues when she didn't give you the money you wanted. YTA, you and your whole family",
              "id": 189,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Exactly... how does OP think Miranda FOUND OUT she couldn't have children?? *Probably by trying to have them*.\n\nWhich means she WANTED kids. She wanted a family. And her husband LEFT HER because she couldn't give him that...\n\nOf course she threw herself into her career! What else was she supposed to do with her time?? Wallow in misery and sadness and spend her extra hours at home by herself?",
              "id": 190,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "My heart breaks for her too!  She needs emotional support but isn’t getting it.  OP said she should be giving her money monthly for the kids but since when did an aunt or uncle pay child support for their nieces and nephews?  It’s ridiculous!",
              "id": 191,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 95,
          "content": "I just want to point out that Miranda is also not exactly stingy towards Alice's kids, even if OP and their parents want to demand more out of her.\n\nMiranda is voluntarily outfitting four children with new coats and boots for Christmas. *FOUR children* that aren't hers! And instead of understanding how large an investment it takes to give *completely new* coats and boots to four children (while, let's face it, at least two of them could probably get by with hand-me-downs), OP thinks that this represents doing \"the bare minimum,\" and is foolish enough to rip into his sister for not providing someone else's kids with more.",
          "id": 192,
          "comments": [
            {
              "score": 18,
              "content": "This is what I thought. Sounds like she's being pretty generous as far as aunts go.",
              "id": 193,
              "comments": [
                {
                  "score": 15,
                  "content": "Right?\n\nWho is this privileged twit who's \"stunned\" that his sister would *only* buy clothes for Alice, plus boots and coats for her four kids?\n\nHe must think she sneezes gold coins if that seems to him like she's cheaping out.\n\nNot to mention she's apparently funding an entire vacation for two parents who obviously don't like and disparage her?\n\nKid doesn't know a gift horse when he sees one.",
                  "id": 194,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "It seems they feel entitled to her money *and* her time. His comment about not knowing what she does on the weekends makes me think that Miranda likely doesn't \"do her share\" of the childcare for Alice. Which is further BS because Miranda doesn't owe her time to anyone. If she's working long hours she likely savors every moment of her quiet weekends.\n\nI know Reddit is quick to call for NC but if my family constantly gave me shit for not giving my time and money to my irresponsible, perpetually pregnant sister I'd be ready to peace out. \n\nOP, YTA and you owe your sister a SERIOUS apology for being little snot. You and your greedy family need to back the f off Miranda and show her some respect.",
          "id": 195,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "And on top of that, boots and jackets can be pricey. She was giving them a really helpful gift and then gets insulted for it.",
          "id": 196,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3141,
      "content": "Oh wow. Miranda is 100% right and YTA.",
      "id": 197,
      "comments": [
        {
          "score": 773,
          "content": "OP if you see this send us your sister Mirandas info so we can be the responsible siblings without a sense of entitlement to her hard work that she never had since clearly you're a naive idiot.",
          "id": 198,
          "comments": [
            {
              "score": 77,
              "content": "I would love to send Miranda a nice Christmas gift.",
              "id": 199,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "I would 100% send Miranda a Christmas card and a nice pile of dog shit to everyone else.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Right??? I want to hang out with Miranda and invite her over for dinner and wine where she doesn't have to be the responsible one in charge for once.",
              "id": 201,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2475,
      "content": "Yup, YTA. That was an extremely low and hurtful blow. And your sister has no obligation to spend her hard earned money on anyone else. You have no idea what type of history the two sisters have with each other. Alice really does sound like she keeps having kids she can't afford. Her and her boyfriend are the ones financially responsible. Not anyone else. Would I ever deny my nieces and nephews necessities? Absolutely not. And it doesn't sound like Miranda is either. You are the AH and owe her a massive apology.",
      "id": 202,
      "comments": [
        {
          "score": 549,
          "content": "Also keep in mind the kid is only 17. He may know a lot but he doesn’t know everything. He doesn’t know how hard it’s been for Miranda to want children and not be able to have any and go through a divorce because of it. Her husband promised to stick by her for better or worse and left her from what we can tell, is no fault of her own. Miranda has money because she went to school and works really hard up her career ladder to get where she is.",
          "id": 203,
          "comments": [
            {
              "score": 287,
              "content": "Also, he has probably been brought up for the last 10 years believing that people should help with their sibling's kids. Miranda doesn't do this while he has to so that has likely resulted in A LOT of resentment from OP to Miranda.",
              "id": 204,
              "comments": [
                {
                  "score": 45,
                  "content": "This! I bet any time he complained about it, his parents stoked the fire with, “omg. You don’t want to be selfish like Miranda, do you?! At least you’re doing right by your family, unlike her!”",
                  "id": 205,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 238,
              "content": "I feel bad that OP is spoonfed this pile of horseshit beliefs by his parents and Alice everyday. Hopefully, this comments section is a wake up call that his favorite sister isn't the victim he thinks she is. It's so hard to know right from wrong when you're raised like this.",
              "id": 206,
              "comments": [
                {
                  "score": 27,
                  "content": ">his favorite sister isn't the victim he thinks she is.\n\nYeah, 5 kids isn't something that just befalls you, like a car accident or leukemia.  Sister is the cause of her own struggles.",
                  "id": 207,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Oh, this this this. I wanted children and have none and it's gut-wrenchingly painful even with my husband's support. I can't imagine how awful it's been for Miranda and then a slap in the face like this... OP, you're going to need to be the world's best brother to make this up to her.",
              "id": 208,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "My guess is that between the two sisters, Alice is the favorite, and as such the entire family (except Miranda) coddles/enables her. I'm not saying Alice is a bad person, but if you can't afford the kids you've already got, you really shouldn't have another.",
          "id": 209,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2230,
      "content": "YTA - a judgmental, unpleasant one at that. \n\nIt's not Miranda's job to subsidise Alice's irresponsible behaviour. If she is already struggling financially, why have another child? Oh, because you all keep bailing her out, that's why!\n\nMiranda got her s**t together and isn't a burden on anybody else. Maybe you should see her as an example instead of the baby-machine sister condemning her kids to poverty.\n\nYou owe Miranda a huge apology. Your comments were apalling.",
      "id": 210,
      "comments": [
        {
          "score": 586,
          "content": "Miranda sounds like a role model to me",
          "id": 211,
          "comments": [
            {
              "score": 358,
              "content": "I know, right?\n\nTellingly, OP has not responded to a single comment. Hopefully the responses will hit home and he re-evaluates the values the rest of the family are pushing.",
              "id": 212,
              "comments": [
                {
                  "score": 43,
                  "content": "Yeah, OP only asked because they thought they were in the right, and now that the internet has handed down judgement (which I fully agree with, OP was a huuuuuge AH to his sister), OP can't stomach it. It's the well known \"can dish it out but can't take it\" phenomenon",
                  "id": 213,
                  "comments": [
                    {
                      "score": 19,
                      "content": "The whole time I was reading I was thinking \"so this is what it's like when someone on the other side submits a question\" because usually we get people in Miranda's position with the whole family against them making them doubt themselves.",
                      "id": 214,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I think she’ll also be a great mother. I really hope that happens for her.",
              "id": 215,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "[deleted]",
          "id": 216,
          "comments": [
            {
              "score": 29,
              "content": "OP had the nerve to request things for Christmas then shame his sister for not spending more money on Alice… I hope he realizes how much his parents and sister are screwing Miranda over.",
              "id": 217,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2150,
      "content": "YTA for your comment. ESH as a family to Miranda but I would add one thing that I think people are missing here.\n\nOP: you are 17 which is old enough to get your ass whooped internet style on AITA for being cruel. But you are also still a kid and I think it’s important to look at the **age gap** here. Both Alice and Miranda are quite close in age and then you are so much younger they are pretty much another generation to you right now and had a whole childhood before you arrived. You are the ‘only child with older siblings’ age gap gulf that means you have a totally different sibling and parent dynamic to their upbringing so you honestly have no damned idea what might run deeper.\n\nAlso Alice had her first kid around the age you are now so your niblings are closer in age to you that your siblings who I believe are full sibs right not half with a remarriage? So you don’t really remember much of a time when Alice wasn’t having kids and your parents weren’t focusing a lot on Alice and their grand kids so it sounds like its been normalized that you as only maybe 5 or 6 years older as uncle have been parentified into caring for or sharing your childhood with your nieces and nephews. Alice has been taking your childhood to raise her FIVE kids. Your mom and dad were complicit in that and by the sound of it at least expected Miranda to pay her dues finanicially by big ticket gifts to you and them if she refused to physically parent any of the minor kids or her sister.\n\nOP: Miranda set a boundary not to enmesh herself in a toxic situation that you have been done dirty by too. You are the only son so there might be some golden child/scapegoat dynamics here too. But here’s the thing, a gilded cage is still a cage. You are giving up your weekends when you should be studying, dating, making friends, being a teen, having a job and establishing self and independence to look after your sister’s kids that their two parents amd your two parents can’t raise. You are mad at Miranda when it’s you who runs the risk of still being at home at Alice’s age giving up your life to give her kids your chances and not realising the person here to model yourself on is Miranda. She is the person who can also help you disentangle yourself but her attempts to keep herself ‘clean’ of the mess resulted you flinging shit in her face.\n\nAnd here’s the kicker. Miranda can and does survive and thrive without the enmeshed shitshow of your family. She will be just fine without you. But you just fucked yourself and destroyed the one ally you could have had to help you realise you are in a sinking ship. The lifeboat sailed because you didn’t just vent your genuine issues to Miranda like an overwhelmed teen might reasonably do and apologised. You went so low and so cruel you sailed her off by cutting the tow rope. The fact you went there when and how you did shows that you had been thinking and sitting on this and she knows that while she kept a spot on her raft for you until she knew, you never had any room for her.\n\nMiranda will very likely take this last cut and free herself and create a whole new life without family. You will feel the trappings of this asshole moment forever **because you still don’t think you were wrong. You still think you had a point and she’s overreacting**. You are mad because Miranda is exposing your asshole not because you’ve blushed at the realisation you are one. You aren’t apologetic. You are just sorry you kicked your lifeboat too hard and can’t catch it.\n\nAt this point continuing to try to contact Miranda is not apologising or peacemaking. It’s justification and it comes from the wrong place for her to trust you. You have to leave her be and see if she ever trusts you again by how you act. Trust is built with a spoon and broken with a shovel as they say.\n\nWhile Miranda is out of your life you might want to look at the people actually driling holes in your boat though as to why your ass is also wet…",
      "id": 218,
      "comments": [
        {
          "score": 419,
          "content": "This comments is it\n\nExcellent point that he’s been parentified and the family dynamics. He’s been in it so long, he’s been blinded to that fact since it’s his normal. And parentification shouldn’t be normalized",
          "id": 219,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 273,
          "content": "This is the comment I was looking for. I'd give you awards if I could.\n\nOP, you were indoctrinated from a young age with this mentality. You still don't have enough life experience to see that you're a victim of your family too...wait until you start earning money as an adult and they expect you to spend both your spare time and spare money on Alice's family too.",
          "id": 220,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 174,
          "content": "Boy I was scrolling looking for a comment that dove into the ages and how that plays into the situation. Hard YTA and yes it was profoundly cruel — but a 17 yo raised in this situation probably hasn’t had much of an opportunity to understand just how extreme it is. I hope he takes this in and starts to see another perspective on it.",
          "id": 221,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "Great comment especially this.\n\n>You are giving up your weekends when you should be studying, dating, making friends, being a teen, having a job and establishing self and independence to look after your sister’s kids that their two parents amd your two parents can’t raise.\n\nAlice is using him for free childcare for sure.",
          "id": 222,
          "comments": [
            {
              "score": 37,
              "content": "If OP was choosing to spend time with the little kids and enjoying it and it was enriching his personal life and development I think that would be something valuable and to have pride in.\n\nBut despite him being so horrible to Miranda I find it tragic that OP’s youth is being spent for him partly because Alice had her first kid in her youth. It is an intergenerational cycle where one sibling having a teen pregnancy can impact their whole family of origin trajectory as much as their children’s life trajectory.\n\nOP has been failed if he is expected to repeat Alice’s path but with *her* children not even his own. He has been vile here but I don’t like the idea he misses the chance to have chances. That probably just ends up making him more vile  and misogynistic down the road…",
              "id": 223,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "I have never given an award before, but this comment deserves it. This is the only comment I’ve seen on this thread thus far that actually delves into the complexity of the situation, rather than throwing straight heat at 17 y/o OP that certainly wouldn’t be able to understand much of the depth of this entire situation, given his age. It was a low blow that OP took on Miranda, that is certain. But OP needs this kind of feedback rather than the other mostly unhelpful, accusatory remarks that likely disregard the significant factors that play into why this all happened in the first place.\n\nNow if OP sees this and takes it to heart, that’s a whole different thing.",
          "id": 224,
          "comments": [
            {
              "score": 25,
              "content": "Thank you so much. Both my parents are the same ‘only child with siblings’ huge gap to their sibs and thus I have seen how in how in one, they were expected to parent themselves because ‘grandbabies!’ with older sibling and in the other my parent remains seethingly resentful their older siblings did not dedicate their teens and early 20s to raising them as if a surprise sibling 15 years younger was a gift not a massive derail.\n\nMy partner is 13 years older than her sister and they have never lived together due to economics and it takes a huge amount of work for them to retain a sibling dynamic not parentification. I think big age gap sibling scenarios tend to have similar extra pink flags as age gap dating unless handled equally carefully.\n\nBirth order and gender plays a huge role in families anyway and to a certain extent all siblings have different parents to each other even if they grow up in the same family because each ‘combination’ varies on personality, age, circumstances. Add in very real differences like stage of life of parents (young vs now grandparents) or huge social changes. The older ones are firmly millennial. OP is Gen Z. Parents are probably Gen X and they are the ones who straddle pre-digital and post and most likely to have an almost ‘split’ attitude because of it. I’m 43 and the number of my peers who were wildly unconventional pre internet who have teen kids or young grandkids and gone really trad and vice versa throws me. I don’t recognise a lot of my Gen X peers because they got sort of forgotten between boomers and millennials and often did not learn good boundaries so raise equally screwed up kids as them but think they broke their parents’ patterns.\n\nI’ve rarely seen really big age gap sibling relationships go easily unless the parents were very emotionally aware throughout. And since I’m Irish my sample is skewed. There was a horrifying number of people I know with ‘big age gaps’ who discovered their sister was their mother. We had a very dark joke about ‘what you got for your 18th: a car or a new mum?’ Spoiler, no one I knew got a car 😬",
              "id": 225,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Oh, absolutely this.\n\nOP, hun, YTA here. Your sister Alice is playing your entire family. The only ones obliged to pay a dime for those children are her and her boyfriend; anyone else giving them time, money, or attention is purely at the givers discretion. She likely already takes advantage of whatever state assistance to help raise them, as well as pools in money from their father, her (and your) parents (whose main focus should be raising their own underage child), and then nabs time away from you (at your age, time is both money and opportunities you won't be offered later). I understand helping because you love her and the niblings, but she has taken extreme advantage of all of you, proceeded to pop out yet more children, and then is asking for yet more. There is absolutely no reason for this woman to have five children, one or two oppsie babies I can see, but five? She having them intentionally and excessively. She doesn't support herself, isn't married, and lives off of other people; she cannot afford to take care of herself by herself to begin with and has five little lives depending on her. She needs to get her shit together. \n\nMiranda has her shit together, she'll be fine without having to deal with you and your families nonsense.",
          "id": 226,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1898,
      "content": "YTA. Your parents are too because I'm pretty sure you started developing this opinion because you hear them being entitled and making similar comments. Alice's financial straits are largely her own fault although it feels a little harsh to say that. If she was struggling at the beginning with two children, there is no reason she should be about to have a fifth child that she cannot afford. However, her choices are her choices. That doesn't mean Miranda needs to cover for her choices by offering up money she has worked hard for. Miranda likely realizes that Alice will never turn things around if people continue to fund her life for her. No one is ever entitled to help from anyone. Miranda seems like she has a good head on her shoulders, she always buys \"really nice presents\" according to you for all of you which costs a fair bit of money in and of itself. And here you are, backstabbing her by hitting her with the lowest of blows. Do not be surprised if your relationship is never the same after this.  \n\n\nEdit: I JUST SAW YOUR REASONING IN THE JUDGEMENT BOT! YOU SAID \"My wording was extremely harsh and t**hough I believe there's some truth behind them**, I think I shouldn't have said what I said.\" HOW ON EARTH IS THERE ANY TRUTH BEHIND YOUR ACCUSATION THAT SHE WOULD BE A HORRIBLE MOTHER? I was giving you the benefit of the doubt a bit before because you're young, and I know that as teenagers - even at 17 - we're heavily influenced by the perceptions around us until we're able to get out into the world and actually grow into ourselves, but damn, that just cemented for me that you are 110% an asshole. Wow.",
      "id": 227,
      "comments": [
        {
          "score": 413,
          "content": "This was my thought as well. I’m guessing a 17 year old didn’t form this opinion on their own. The parents and probably Alice have probably said things that have implanted that in his head. \nAlso yeah impossible to know what kind of mother she’d be. When she couldn’t have kids by choice or because she was unable her priorities wouldn’t be the same as someone who is mothering 5 children so how in the world would anyone know what kind of mother she’d be. OP, honestly you and your whole family need to apologize for this way of thinking, YTA big time.",
          "id": 228,
          "comments": [
            {
              "score": 117,
              "content": "Totally agreed! Although if there is a bad mother in this story it is obviously Alice. I know it is bad, but I do look down on people that have a large number of children they can’t support. My sister is one of them too. \n\nYTA OP I don’t know how you possibly think you have the right to speak this way.",
              "id": 229,
              "comments": [
                {
                  "score": 28,
                  "content": "It’s definitely a selfish mother because she’s serving her own desires at the expense of her kids. A parent is a finite resource and there’s only so many hours in the day and so much energy and attention to give, and that’s not even including holding down jobs or household tasks. Everyone’s circumstances is different BUT there comes a point where there will not be enough Mom or Dad to go around, and it sounds like Alice has absolutely exceeded what she can capably handle alone.",
                  "id": 230,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "OP somehow thinks any woman who isn’t making a matyr of herself to any children in the vicinity is terrible mother material?\n\nOP how about you’re going to be the worst kind of father if God forbid you ever knock someone up, with that attitude towards women and motherhood? See how that works? How that feels pretty unfair to you?\n\nYou want Miranda to pay for little extras for the kids but she’s bloody well buying them necessities of life (and coats and boots for 4 growing kids, soon to be 5, is not cheap!) which their actual mother is failing to provide! Alice is failing as a mother! But you’re choosing to blame Miranda, and that’s weird.",
          "id": 231,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "To me it looks like Miranda would br a wonderful mother. She is responsible, financially stable, bakes muffins to her terrible brother and gives generous and very considering gifts to her family even though they don’t deserve it.\nThe terrible mother is the one having child number 5 while not being able to afford it .-.\n\nThat being said I hope Alice is not stuck im an abusive relationship because this is the only reason I wouldn’t call her extremely irresponsible for having 5 children she can not afford",
          "id": 232,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}