{
  "post content": "Throwaway account, English is not my first language, I’m on mobile - I apologise. \n\n\nI (27F) have been married with my husband (M32) for three years and haven been dating for a little over 5. My husband has this friend (F31) ‘Mary’. They’ve known each other since they were in high school and she’s considered ‘one of the boys’, if you may. That basically means she’s always invited to all the fishing trips and stuff, which I don’t mind at all, I trust my husband. \n\n\nWell, my problems with Mary started when she first found out I’m half Romanian. It started kinda innocently, with her asking me to say certain words, teach her some insults etc which didn’t necessarily bother me, but it usually put me on the spot whenever we were out with my husband’s group of friends. It only escalated to her googling stuff about Romania and asking me ‘are you a vampire? do you bite your husband by the neck?’ to ‘are you a gypsy? I bet you’ve got some of that gypsy blood in you’ (which is just blatantly racist)\n\n\nLast week, me and my husband organised a mini BBQ with our friends and Mary was invited by my husband despite me telling him she makes me uncomfortable. He said he had talked to her about her remarks and she’s been understanding so it’s unlikely she’ll say something this time.\n\n\nIt was midnight and there were about 4 of us left and I accidentally spilled some red wine on Mary’s jeans when I tripped over a carpet. All hell broke loose. Mary started saying that I’m a witch and I’m trying to ruin her life and this whole thing is part of my ritual and I’m just a ‘immigrant gypsy trying to ruin my husband’s life’ and I’ve poisoned my husband against her. I started crying and profusely apologising. When she wouldn’t drop it, I kicked her out and banned her from ever coming to my house again. \n\nAITA for doing this? My husband insists that Mary was just drunk and talking nonsense and he would talk to her. He also told me I’m way too sensitive about my heritage and I’m an a-hole for banning her. Mary has since given me a half hearted apology but I’m still not ok with her.\n\n\nEDIT: I guess this is the update some of you wanted. Sorry I’m still a mess and idk how coherent I am. We’ve talked. He admitted to being in and out of an affair with Mary in the first 2y of our relationship and she wanted to win him back I guess. I called my mom to come help me pack some stuff and im out. Thats it. Mary can have him I’ve been gaslit for years and it took a reddit post to realise. Oh the irony. thank you reddit.\n\n\nEDIT2 and probably the last one for a period of time: \n\n\n\nA lot of people seemed suspicious of Mary and my husband’s friendship/relationship etc and have asked if I ever suspected anything. No, I didn’t. Me and my husband had (or I thought we had) a very strong relationship, based on communication and honesty (guess it only applied to me). Also, Mary is very close with all the boys in the said friendship group. The other wives raised concerns in the past but they’ve all been shut down by the boys in the group or by Mary herself. I guess I always respected their friendship group because they were very close for so long and it felt unfair to change that because of me. As far as I’m aware, the other wives feel the same - plus Mary has been in a LD relationship for about 2 years and always claimed she’s focusing on her career, she’s too busy etc so none of us ever saw her as a potential threat. \n\n\n\n\nBut now it just makes me think there could be more to this story. But I’m tired, as of right now, I am just exhausted. My Romanian witch blood won’t let me live until I find out the whole truth but I need time.\n\n\n\nThank you to everyone who took the time to reply to my post, message me (even the ones that insulted me further - it was semi-funny) and thank you for the awards! I’m sending virtual hugs to all of you! Aveți grijă de voi!",
  "id": 1,
  "comments": [
    {
      "score": 30170,
      "content": "NTA \n\nI think your husband needs to re-evaluate the fact that he’d be friends with someone that’s so disrespectful to his own wife",
      "id": 2,
      "comments": [
        {
          "score": 19826,
          "content": "Also 'just drunk' is not an excuse. If that is how you are when drunk, then don't get drunk.",
          "id": 3,
          "comments": [
            {
              "score": 7337,
              "content": "I think the saying goes drunk words are sober thoughts",
              "id": 4,
              "comments": [
                {
                  "score": 2634,
                  "content": "A drunk man’s word is a sober man’s thought. (Or in this case, woman’s)",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2231,
                      "content": "Or 'a drunk mouth speaks with a sober tongue'.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "In vino veritas.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 993,
                  "content": "God I really hate this saying so much. As someone who has struggled with alcoholism in the past, let me tell you, this is not true at all. That being said, drunk or not, a person is responsible for the state they are in and how they act. Being drunk isn't an excuse for how she acted, and her actions have consequences. NTA",
                  "id": 8,
                  "comments": [
                    {
                      "score": 495,
                      "content": "I'm also a recovering alcoholic and never said anything while drunk that I didn't think while sober. \n\nIt's not a psychotropic drug that alters your thinking, it just lowers your inhibitions.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 147,
                      "content": "I'm with ya on this. When I was drunk once, I was talking with a friend and told him how much I was into another friend's sister and wanted advice on how to make that happen.\n\nThing is, I WASN'T into her. Never was before, never was after. To this day, I have zero idea where that came from. Because to your point, that could have started some unfortunate drama among my friends group if the guy I was talking to started spreading it around.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Yeah that phrase is bull shit. I have said some really fucked up shit when drunk that i don't remember only to be told what i said and sober me will be like \"I'm sorry, I said WHAT?\" Because I just cant believe it.\n\nI mean, I've never said anything super deplorable but I've definitely said things i DON'T mean because i was just being an asshole who wanted to play devils advocate.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I agree! I’ve told plenty of lies while drunk. (That sounds so boastful!) I found I was more likely to be untruthful when I’d been drinking. Lucky for me — and I guess everyone I know — I don’t drink much anymore.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 317,
                  "content": "[deleted]",
                  "id": 13,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Always upvote Uncle Kurt; although he was a little hard on my dear friend the semicolon.\n\nSirens of Titan for life, muthafucka!  Brrt brrrrt!",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "Based on the data on alcohol, dose, and psychotropic effects, I imagine it is an inverted U shape- up to a point, the wine/alcohol reduced inhibitions and you say things you mean...but normally don't say out loud.  But with higher dose, you go back into \"untruth\" of spoken words- in part because you are tripping into auditory and visual false information land.  Just a thought (see my post above, we have a body of literature that speaks to alcohol and hallucinations, and other psychotropic effects in the neuroscience community- Happy to post some citations here too if needed).",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 276,
                  "content": "In vino, veritas.\n\n\nIn wine there is truth",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 159,
                  "content": "I really hate this saying. Alcohol is a drug, would you say the same thing about meth? A cracked out person's words are their sober thoughts? Probably not, eh?  People can become a totally different person when they're drunk. I'm not trying to say what her friend did was okay, I'm just saying that not all drunk sayings are sober thoughts.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 82,
                      "content": "I agree so much. I don't drink because when drunk I'm a major asshole. I can think up the nastiest things to say to someone sober but I don't because I'm trying to be a nice person. I'm not going to dwell on some dark nasty thoughts sober. Drunk, I have a flicker of a mean thought and think it's hilarious and build on it. I'll say things to my best friends that I know are things they are sensitive about. No I didn't actually think you looked fat, I just knew that would really get to you if I said it. I'm a raging drunken asshole, that definitely doesn't make my drunken comments truth. I'm Sober 5 years.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 139,
                  "content": "NTA \n\nWhile this phrase may not be necessary true for everyone, it certainly is in Mary’s case. She’s had said racist / insensitive comments in the past while sober. \n\nYour husband is the asshole, choosing a friend with an awful attitude towards his wife over his wife. He needs to treat you with respect and put down his foot with Mary or cut her out of his life.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 106,
              "content": "If I was into that kinda thing I’d give you gold\n\nI’m someone I hate when I drink, so I don’t drink, being drunk isn’t a valid excuse, it doesn’t stand up in court \n\nAlso nta",
              "id": 20,
              "comments": [
                {
                  "score": 61,
                  "content": "My wife knows I am drunk when i start saying 'i love you' too much. Not that i get drunk very often but i am a happy drunk. I get more mellow. But as you say I've known people who turn mean. If that happens,  then that sucks but indeed, then itbis up to upu not to get to that point.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 64,
              "content": "Ikr drinking doesn't make you racist.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "I'm a dick when I'm drunk. I haven't been drunk in almost 5 years.",
              "id": 23,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 477,
          "content": "WOW... So NTA and the husband's friend strikes me as racist and/or harboring jealousy. She's trying to accuse OP of wrong doing but has no basis, so she's going with otherworldly means as if that doesn't make her look entirely crazy. I'm half Romanian as well, and while my father never bothered to pass on the culture or language, this would piss me off too. \nI'm also not above embracing the stereotype and privately pretending to cast a curse to really mess with her head, but that's just me.",
          "id": 24,
          "comments": [
            {
              "score": 124,
              "content": "Mary also sounds like a complete idiot, saying that OP is a vampire or a witch.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Exactly this.  Her husband is supposed to be his wife's biggest advocate.  If he knows she's sensitive about her heritage, then don't let others rag on her about it.  \n\nI've been married for close to 20 years and I have *never* called her an *a-hole* or anything else that wasn't her given name.",
          "id": 26,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Fucking A this right here",
          "id": 27,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "My BF is Romanian and we live in Canada. He jokes about gypsies sometimes. We both laugh. However, if anyone ever tried to repeatedly make fun of him/be racist and he told me it made him uncomfortable, I'd kick that person out of our damn house so fast she wouldn't have time to apologize. The fact that OP's husband seems to have done shit-all for her is really telling.",
          "id": 28,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Disrespectful, rude and racist.  Disrespectful to the husband by default.  Not at all interested in his \"her friend's\" best interest.\n\nHusbands a TA 1st.  Needs a huge priority check",
          "id": 29,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Op you really need to show your husband this post. Not sure why he is being willfully blind and disregarding his wife’s feelings.",
          "id": 30,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "This is my initial reaction. I don't care of you're my brother, you disrespect my wife, we're gonna have a big fucking problem.",
          "id": 31,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "He also needs to consider why he jumps to his wife being too sensitive about her heritage (OP, you aren’t) rather than his friend is extremely racist (she is).",
          "id": 32,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "One of the biggest red flags that i ignored with my ex, that i think about every day, is that his friend called me the n word and he did nothing about it. I kick myself for not leaving then. OP, your husband needs to get his stuff together.",
          "id": 33,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8571,
      "content": "NTA. She's being racist and your husband should be standing up for you. Maybe down the line if her behaviour improves and you forgive her you could consider rescinding the ban, but unless that happens you're doing a reasonable thing and he should be in your corner on this one.",
      "id": 34,
      "comments": [
        {
          "score": 6619,
          "content": "Honestly, I don’t know if I’m ever gonna be ok with her. What I didn’t mention in the post is that these remarks have been going on for YEARS. \n\nFor example, Mary watched that movie 365days around March and apparently two friends call each other ‘curva’ and started calling me that. In Polish, that could be considered a joking way to address a close friend. However, in Romanian is considered a derogatory (it means prostitute but like, worse) term and pretty much no one would use the word when referring to a friend. When told to stop, Mary said I’m too sensitive. \n\n\nI am just tired of being insulted.",
          "id": 35,
          "comments": [
            {
              "score": 3920,
              "content": "It means the same thing in Polish. It’s not a friendly thing for like 99.999% of people. Mary is terrible and I’m sorry your husband has misplaced loyalties.",
              "id": 36,
              "comments": [
                {
                  "score": 2936,
                  "content": "I’m sorry, I was just assuming that there could be a different connotation to the word in Polish as from what I gathered, the two girls refer to each other as such in that particular movie. I apologise if I offended any Polish speaker.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 2138,
                      "content": "It’s probably like in English, calling a woman b**ch. it’s derogatory, but two close friends may do so, because of the friendship.",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 93,
                      "content": "[deleted]",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 64,
                      "content": "Some friends have hte kind of relationship where they will use verbal insults affectionately (like going up to a bunch of friends and saying, \"Hey, bitches,\"). However, unless you have that kind of *friend* relationship, it is an insult. And yes, \"kurwa\" is an incredibly derogatory word to use against someone. Mary is bullying you.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Oh no no, \"kurwa\" in Polish is the worst word you could call a woman. If someone called me that's they would absolutely get their ass kicked. But you didn't offend anyone, you just didn't know :)",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Curva is a derogatory world in Eastern Europe. It is very offensive in Ukraine and Russia. I did not know it was Polish in origin.",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "You friend's husband is bullying you. The \"you're too sensitive\" or \"i was just joking\" while consistently dismissing how it affects you in favor of her perception of the situation is bullying. Your husband should clean his eyes because Mary is being racist and a bully. Of course, NTA. Also, it feels like these insults are more like passive agressive micro-agression. Are you sure she doesn't hold a sort of grudge on you? Be strong OP",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 79,
                  "content": "Neither is it in any other eastern European language that I know of (Hungarian, Russian, and Ukrainian)",
                  "id": 44,
                  "comments": [
                    {
                      "score": 75,
                      "content": "Slovak and Czech don't consider it nice either. I can't think of an eastern European language where it really is a nice word",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 64,
                      "content": "Same in Serbia, we do curse a lot for fun ( like way too much), but when we use kurva, it's serious..",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Im Croatian and its the same thing, Kurva is like a very cheap prostitute and we would never call our friends that unless its an inside joke.",
                  "id": 47,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 346,
              "content": "I’d start calling her a dirty whore anytime she called me a “curva”, since it means the same thing. \n“Hi curva”\n“Hey dirty whore” \nI bet she’d at least stop that one pretty quick. \n\nAlso, try putting it to your husband this way — it would in no way be acceptable to use the “n word” (from what I know, Gypsy is a pretty offensive term but I’m very sorry if this is actually an inappropriate comparison) and it wouldn’t be okay to say anything along the lines of “you’re trying to do a ‘n-word’ voodoo ritual on me”...",
              "id": 48,
              "comments": [
                {
                  "score": 216,
                  "content": "Oh no, it's pretty much on the same level racial epithet wise, it's just that violence against travelers/Roma hasn't had as much attention in the English speaking world as antiblack racism (which isn't to downplay either, I hasten to add).",
                  "id": 49,
                  "comments": [
                    {
                      "score": 108,
                      "content": "Europeans will tell you \"no I'm not racist at all\", but then go into a 30 minute diatribe about how the Romani are nothing but a bunch of lying, dirty, thieves that should be purged from country.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 47,
                      "content": "I’m not Romani or black so I didn’t want to speak for anyone but I thought it was pretty similar in terms of offensiveness.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 66,
                  "content": "The correct name, as far as I know, is Roma. It is the name of their nationality. Gypsy may or may not be offensive, but as far as I know, true gypsies and Romanian people are DIFFERENT nationalities altogether.",
                  "id": 52,
                  "comments": [
                    {
                      "score": 67,
                      "content": "Yes, gypsy has become a slur, which is why it's not recommended to call the Romani people gypsies especially if you are using it negatively. In Romania, it's used as an insult to call someone dirty or a thief. I know I can only speak from my experience, but from the people I knew and my own family, our biggest problems with them is that we have different moral compasses. We are very against the fact that Romani engage in child marriage. We don't like to be associated with this. We want to let them stay because they need to be somewhere, but we don't approve of some of the parts of their way of life. \n\nAnd you are also correct that the Romani people are not Romanian. They are travelers who mainly settled in Romania because Romania was one of the few countries that didn't kick them out and let them stay without citizenship. We are one of the only countries that didn't force them to assimilate in order to stay in the country. They have their own culture and speak their own language, though many I've seen are able to speak other languages at least a bit to get around. \n\nIt's hard to compare what the slur is closest to (definitely not to the N-word though), but I think it would be close to a combination of wetback and terrorist)",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 208,
              "content": "Honestly...how do you keep loving a man who is okay with this scenario?\n\nAnd no, he is lying if he says he is not okay with it. If he wasn't he would have banned her himself.\n\nHe is failing you as a husband and you need to hold him accountable.",
              "id": 54,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 139,
              "content": "She wants your husband.  He needs to cut all contact if he wants to stay married at this point.\nLots of these \"one of the guys\" women friends are just unrequited love on the part of one of the participants. Usually the woman.",
              "id": 55,
              "comments": [
                {
                  "score": 14,
                  "content": "What the husband is doing is wrong, he should be standing up for his wife and should have cut off Mary long ago. What Mary is doing is extremely wrong, shes being a huge, gaping asshole and is insanely racist. I agree with those points wholeheartedly.\n\nHowever, it's the next part of your post that's a HUGE issue in it's own right.\n\n> Lots of these \"one of the guys\" women friends are just unrequited love on the part of one of the participants. \n\nBut saying things like that in this day and age are part of what makes it harder for women to integrate into male dominated fields and sounds almost eerily similar in spirit to what US Vice President Mike Pence tends to imply about ALL women and is why he refuses to be in a meeting or anything pertaining to his job 1:1 with a woman. That immediately starts a huge inequality problem.\n\nIt's basically like saying \"women cant be trusted\" which is horrifically sexist. Similar to the lie that anyone that's Bi-sexual \"cant be trusted to be monogamous\" because they'd forever have a \"wandering eye\" for the gender they're not dating. Do you see how damaging both of those are?\n\nHetero women can be in male dominated friend groups or fields of work without things going thirsty. We're humans looking for friends with similar interests, in places that most other women dont have an interest which skews the gender balance. We're not sex fiends wanting to jump on every dick.\n\nI hope you didnt mean it that way, but its something that I and other women with interests in things like technology or cars still deal with... And its exhausting because it's still a sentiment that holds everyone back.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 109,
              "content": "Okay so don't take this as an advice because it would only escalate things further but **I** would give her a taste of her own medicine, warn your husband about it and start doing exactly the same to her. She calls you a witch, you call her a stupid old instult, she calls you a gypsy, you call her by a stereotype according to her heretage she calls you a romaninan insult, you translate it and act like it was just the fun new way you are addressing each other until everyone notices how insulting she is and how uncomfortable she makes you\n\nAgain, bad advice but I would go for it, you seem to be made out as the bad one no matter what",
              "id": 57,
              "comments": [
                {
                  "score": 17,
                  "content": "[deleted]",
                  "id": 58,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Yeah that's what I meant with it would possibly escalate things further.... \n\n\nI know girls like that and I just hate them so much\n\nMaybe I would seek out to everyone beforehand and tell them she hurts me. If they are not understanding I would announce to do the same to her so they can see it from both sides? Idk seems like loss loss",
                      "id": 59,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Part of me wants to just be like, \"Pretend to actually be a witch and yell out some gibberish and then tell her you just placed and Ancient Curse on her so she cries and goes away.\" \n\nBut that's petty and also means OP would have to play into the stereotypes and racist ideas being thrown at her so probably overall a terrible idea. But also I would be tempted to do it myself.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Best would probably be to just cut her off everytime with \"do you really want to be so bluntly racist in the current climate?\"",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 64,
              "content": "That's horrible, I'm sorry you've had to deal with her for so long. That's a totally reasonable stance for you to take. I don't think that you owe her forgiveness ever, I more meant that if you were ever going to forgive her it should only be after she's clearly shown she's grown and changed and that your husband is being unreasonable by expecting you to do so right away.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "polish person here. we don't call each other \"kurwa\" unless we're super, super close friends and we know it's not meant as an insult it is. i think they do say it in derogatory manner because that's an instult, like in your language.",
              "id": 63,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 29,
              "content": "Friendly? Girl I have lived in Poland and kurwa is something I would only hear my flatmates say if they were *pissed*",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Curva (in polish kurwa) means whore. Not bitch (bitch=suka). And kurwa is one of the worst things you can say about someone. It is different when you say it to the air like when you hit your foot on the furnuture. Is still means whore but you don’t insult anybody like this and we are using it a lot that way. Saying kurwa about other people is just unacceptable.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "OP I am so sorry you have to endure this abuse from this woman (and it is abuse), and the disappointment of your husband not standing with you in support against this awful behabiour. Firstly, you have every right to not accept being abused like this, especially in your own home - NTA at all. Secondly, it sounds like your husband may be extremely nonconfrontational and is unwilling to have a proper discussion with her about her blatant racism towards you. It's possible he is trying to keep the peace amongst his friends, but what it boils down to is he is complicit in this behaviour by not standing up for you. This is more than just a  failure to set boundaries in the way she communicates with/teases you, this is clear cut racism and it's very disappointing that your husband expect you to accommodate her.\n\nThirdly, if I may suggest something, it sounds like you and your husband may benefit from the help of a therapist to act as a mediator to help him hear you and understand how hurt you are by his failure to support and prioritise you, and to help him find a means to stand up to Mary, put his foot down with her in the way she treats you and, if needs be, step away from his friendship with her if she cannot break down her racism and sincerely apologise to you. His inability to stand up for you is a huge failure to you as your partner, and I hope he comes to realise this before it is too late.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 304,
          "content": "[removed]",
          "id": 67,
          "comments": [
            {
              "score": 24,
              "content": "yeah, 'too sensitive' – i mean, i was furious throughout the entire post but that comment made me scream. literally.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I kind of wonder if there isn't anything else going on with them.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4530,
      "content": "NTA. Why does your husband want to be friends with someone who is so awful to you?",
      "id": 70,
      "comments": [
        {
          "score": 3574,
          "content": "He insists that ‘that’s just how Mary is’ and ‘Mary doesn’t understand your Romanian roots, why not educate her?’ Well, because every time I tried, she’d just say I’m boring.",
          "id": 71,
          "comments": [
            {
              "score": 2115,
              "content": "Have you said that to him? She sounds like a dog whistle to be honest.",
              "id": 72,
              "comments": [
                {
                  "score": 2187,
                  "content": "Yes, I have. I honestly don’t know why he’s acting like this around Mary. Every time she does something wrong, he seems to just... not acknowledge it?",
                  "id": 73,
                  "comments": [
                    {
                      "score": 2019,
                      "content": "[deleted]",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1064,
                      "content": "It's sounding more and more like you have an issue with your husband, not with Mary. Usually someone as rude as her would disappear from your life, but for some reason your husband is keeping her around. Worse, he's letting her treat you with contempt. \n\nNTA, your husband is the A, and he's encouraging Mary to be rude to you.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 269,
                      "content": "Over generalization here, but something my SO said to me that makes sense:\n\nGuys tend not to call their friends out for shit. \n\nGirls tend to call each other out, which is why girls tend to lose more friendships than guys. \n\nYour husband is excusing a lot of bad behavior from his friend. Thats problematic in general, but extra problematic that it's directed towards his wife.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 167,
                      "content": "Your husband needs to reevaluate his friendship with her or find himself sleeping on the couch.\n\nSeriously. He needs to cut ties with her. That behavior is toxic, disrespectful, and racist. If he refuses to do so, an intervention with a therapist would be a great idea.\n\nHis loyalties are in the wrong place. She sounds jealous, and he's enabling her. Even if she's not jealous, he's still enabling her. Don't let your husband treat you like second best or anything like that.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 139,
                      "content": "Has there ever been a thing between them? I'm guessing he had feelings for Mary at one time, and there is still something there.",
                      "id": 78,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 77,
                      "content": "Men only really go this hard for women (that they’re not related to) they want to or have fucked. \nIf I was you I’d be more concerned that my husband puts his ‘friends’ feelings above yours.",
                      "id": 79,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "NTA...\n\nIf Mary is one of the guys, you need to ask your husband if he would be okay with his actual male friends treating you like this. Don't focus on that she is female, focus on that she is an asshole and you wouldn't tolerate this treatment from a male friend either.\n\nI would like to point out that because she is female and have known them since high school, those male friends may feel more protective of her and just associate her assholery to being female, so have been trained to turn a blind eye to her actions.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "honestly, if I was in this scenario, and one of my husband's friends was being cruel about my Italian-American background, I am 100% confident that he would no longer include that friend in his life.\n\nMy husband has his flaws, but I know his moral compass is strong and that he cares about my feelings. I KNOW this. And I feel like, if you can't be sure that you're his priority, there's a very serious issue that comes down to how much he respects you, which seems like it's not very much.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Knowing someone for ~16 years can cloud your judgement of them",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "What's a dog whistle?",
                  "id": 83,
                  "comments": [
                    {
                      "score": 7,
                      "content": "According to Urban Dictionary, it's like a subtle homewrecker",
                      "id": 84,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 446,
              "content": "\"That's just how she is\" is such a lame bs copout. He's telling you he'd rather you be uncomfortable (even in your own home!) and disrespected, than he stand up to a friend he knows is doing wrong. AH move right there.",
              "id": 85,
              "comments": [
                {
                  "score": 184,
                  "content": "“That’s just how she is” is always such a shitty, meaningless argument. How “is” she? Racist, mean, and disrespectful to your wife? So we’re making an exception for her because all those terrible qualities are just an inherent part of her being?",
                  "id": 86,
                  "comments": [
                    {
                      "score": 27,
                      "content": "Seriously i HATE people using this as an excuse for a shitty aspect of their personality. \"That's just how _ is,  you need to not be so sensitive.\" Or maybe I'm not  feeling sensitive, I'm being disrespected by a massive fuck nugget. Gah.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 177,
              "content": "> He insists that ‘that’s just how Mary is’ \n\nThe response to that is 'I don't put up with crappy people who are racist and abusive, that's just how I am.'",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 138,
              "content": "It's not your job to educate her on Romania. Why doesn't your husband educate her on not being a racist asshole?",
              "id": 89,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 86,
              "content": "thats just how mary is, calling people witches and saying speak american in the market",
              "id": 90,
              "comments": [
                {
                  "score": 53,
                  "content": "Don't forget the gypsy blood, gosh darn that Mary is a real spitfi...asshole. Mary is an asshole.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 8,
                      "content": "give her some time and she'll have a short mustache going off on gypsy and jews",
                      "id": 92,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 57,
              "content": "Nope. It's not your job to educate Mary to make her a better person. It's up to Mary to educate Mary to make her a better person. \"Just how Mary is\" is an obnoxious, ignorant cow. NTA.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "You shouldn't have to educate anybody to be respectful. One thing is asking about certain words, events or other cultural things, but assuming crap and being intentionally hurtful is not \"not understanding\", that's being an asshole.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "That’s when you reply “well this is just how *I* am- and I don’t tolerate someone who is racist”",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Well, clearly she understands enough to make you uncomfortable and hit close to home but that’s it. \n\nI’m really sorry that she’s doing this. Being an old friend does not mean that she should continue to be a friend nor does it grant her the right to behave like the back of a horse. NTA",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Probably had sex with Mary or wants to at some point.",
          "id": 97,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3066,
      "content": "NTA. Mary sounds like a racist. Maybe she's jealous there's another woman in the group now? Her remark about how you're turning your husband against her makes me think she feel threatened by you. Your husband should be sticking up for you. They both owe you an apology.",
      "id": 98,
      "comments": [
        {
          "score": 1575,
          "content": "I don’t know how she’d feel threatened. ‘The boys’ plus Mary still go and do stuff as a group without involving me or my husband’s friend’s girlfriends/wives. \n\n\nThis arrangement never changed because of me or anyone else.",
          "id": 99,
          "comments": [
            {
              "score": 1582,
              "content": "I think it might be more along the line of \"I want to be the only women in their life\".",
              "id": 100,
              "comments": [
                {
                  "score": 573,
                  "content": "I agree with this. She might want to be the only woman. Unless she's kind of is just a racist to everyone. But, this seems like it's only happening to OP.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 458,
                      "content": "Maybe it's only happening to OP because her husband doesn't have a spine.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 231,
                  "content": "This is exactly what it is. My husbands friend group used to have a woman like this. She didn't want to be with any of them romantically, but she still wanted to be the most important woman to all of them, and she was VERY territorial when one of them would start dating. Coincidently the only one who still talks to her is the only one who isnt yet married.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 95,
                      "content": "Queen Bee wannabe. Classic.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "As a recovering Queen Bee, I can tell you that it's exactly this.\n\nBeing the only girl in a group of friends, presents  a uniquely powerful position. Men often subconsciously treat female friends, differently than male friends. Not necessarily better or worse. Just differently.\n\nIt goes to your head.\n\nShe's posturing because she feels threatened by you. I'm glad you found out about them, before you spend even one more ounce of energy on these two.\n\nI wish you the best of luck in this new chapter of your life. You just shed some dead weight, now you're free to spread your wings and fly.\n\nYou're going to be great. \nXO",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 161,
              "content": "[deleted]",
              "id": 106,
              "comments": [
                {
                  "score": 87,
                  "content": "I’d put money on this being the reason for her nastiness.",
                  "id": 107,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "According to the edit, you nailed it.",
                  "id": 108,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 43,
              "content": "How does she feel/act towards the girlfriends/wives?",
              "id": 109,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "Honey she wants to fuck them. She's trying to make herself look likenshes the only one th as t gets them but she's trying to get with them.",
              "id": 110,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "Maybe it’s because your husband won’t cheat on you or entertain her advances. \n\nShe sounds like she’s got something for your husband since she used those specific words.",
              "id": 111,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Have you talked to the other girlfriends/wives?  I wonder if they have issues with her, too.",
              "id": 112,
              "comments": [
                {
                  "score": 9,
                  "content": "It's a valid question, but if she did this OP would have to be SUPER cautious. Otherwise this would just create a gossip type situation that could blow up in a really bad way.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "She wants your man and wants him to leave you. But she's just a tease, all she wants is to have fun and dump .",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Before you leave your home or do anything, consult a lawyer",
              "id": 115,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 102,
          "content": "I suspect even more than these is that Mary never learned how to cultivate relationships with women. She probably feels like joking like that is an appropriate behaviour because the guys, while not enjoying it completely, don't say anything about it. \n\nNow her interactions just reinforce the \"not like other girls\" and \"one of the boys\" attitude. She doesn't realize that she's the one poisoning the well.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "This was my thought exactly. This whole thing feels like she's manufactured drama between the two of you. I know various countries in Europe have had issues with discrimination against Romanians, but if this is the US she is either a seriously xenophobic asshole or this is less about OP being Romanian and more about her not being the only girl in a group of guys.\n\nRegardless of which it is, husband is being a huge asshole by inviting this woman over to harrass her.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3030,
      "content": "This sounds like Mary...is acting like  a hugely jealous girlfriend.  And because her behaviour has been enabled for so long, she feels entitled to threaten whomever she chooses. She dosnt like that you are centre place for you husband. Not her. \n\nYour husband needs to grow a pair here and acknowledge that whatever Mary may have been allowed to get away with before.....that shit stops NOW. \n\nAsk how he would feel if you had a male friend that was allowed to insult him in his own home.while you went away on trips with him?  He needs to step in here...and speak to Mary, with you,  as a couple. You both need to make it clear, that non of this BS is acceptable. She is racist,  offensive, rude and being drunk is never an excuse. She is being nothing more than a toxic bully and that you both have no problem in removing her from your lives.  A friend would not do this to her friends wife.  A husband would not put his friend feelings before his wife.   Ask your husband which woman he has married. You are not playing mistress to her. She sounds like shes trying to play it to you though. Husband needs to stop enabling her behaviour and making excuses. Mary needs to step off entirely until she can learn to be respectful. Or not be welcome at all. Your house. Your rules. Do not let this go.\n\nEdit...just to add...what exactly do you think she would be like if you had children? They would have a mixed heritage....she going to potentially bully them too?  I can just see how this will keep going if you dont stop it....\n\nSecond edit...thankyou kind strangers for the awards x\n\n\nEdit 3: op I have just read your update. Im so sorry you had to find this out in such an awful way. You deserve so much better. Do not think the other wives and girlfriends wont be tearing her down over this, and your husband.  It will re evaluate the whole friendship group. Certainly no female in this group will trust her again. Sending you big internet hugs and I wish you a peaceful recovery from this. I truley hope you find happiness in the future xx",
      "id": 118,
      "comments": [
        {
          "score": 310,
          "content": "THIS! OP please read this.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 140,
          "content": "This is so well put!! I hope OP reads/has read this. Needs to be higher up. The point about future children - I would never allow a potential racist NEAR any children let alone my future ones. Absolutely unacceptable behavior being enabled by husband and “the boys.” He needs to put a stop to this.\n\nEdit: read your update. I’m so sorry Mary and your husband have been such trash to you. You deserve so much more and I hope you find that!",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 128,
          "content": "THIS! OP please read this.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "After reading the update she put on her post, everything makes so much sense now.. not that it excuses everything, but at least we all know now why her husband never stood up for her in the first place. I’m so sorry, OP. But I am so glad you’ve taken the garbage out of your life and I hope you find someone who treats you with respect <33",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Her just being drunk is not an excuse. Unless Mary herself is acknowledging that she is inappropriate when drunk is therefore not drinking anymore. \n\nAlso I’ve seen a few comments that your husband suggests you educate her? Fuck that! It is not your responsibility to educate someone that is racist against you,  unless you legitimately feel like doing so. It is absolutely your husband’s job to remove someone who is making accusations. \n\nWhat NORMAL adult human in 2020 is accusing another adult of being a witch to their face ? \n\nI get the vibe that the husband is super against causing a ripple that will affect the whole group but this is so beyond a women like making a petty comment about OP’s cooking or something. She was accused of being a literal witch ?!??!?",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": ">A husband would not put his wife's feelings before a friends\n\nUm, you might want to edit that.",
          "id": 124,
          "comments": [
            {
              "score": 15,
              "content": "Oh bugger....not what I meant... I'll change it now should be a husband would not put a friend before his wife x",
              "id": 125,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "This needs to be top comment!!!!!!",
          "id": 126,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1315,
      "content": "[removed]",
      "id": 127,
      "comments": [
        {
          "score": 1005,
          "content": "Mary is a bit of ‘I’m not like the other girls’ type. She considers my husband’s friend group (only males, excluding the girlfriends/wives) her main friend group.",
          "id": 128,
          "comments": [
            {
              "score": 846,
              "content": "[removed]",
              "id": 129,
              "comments": [
                {
                  "score": 719,
                  "content": "The other wives/girlfriends rarely speak to her because she doesn’t really speak to them. When we all go out, Mary is either just hanging around with the boys only or finds a reason not to come.",
                  "id": 130,
                  "comments": [
                    {
                      "score": 38,
                      "content": "It would appear he simply expected her and you to be like the \"other ones\", which is reasonable, but Mary sure isn't allowing that to happen. Maybe you could get him to have a good talk with her about treating you like she treats the other SOs?",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Have you ever spoken about Mary with the other wives/girlfriends? Ever heard of any other social blunders she's committed? \n\nPerhaps you're not the only one who's witnessed her shittyness.",
                      "id": 132,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 369,
              "content": "Oh, she's a \"cool girl\". Watch your back.",
              "id": 133,
              "comments": [
                {
                  "score": 199,
                  "content": "Right? Yikes. That type of girl is so red flaggy to me. They prop themselves up in the perceived hierarchy by stereotyping and pushing down other women. It's gross.  You can like stereotypical dude things without shitting on your own gender.",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 137,
              "content": "...because she's probably done this to other women, and they won't spend time with her anymore.",
              "id": 135,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 60,
              "content": "\"I'm not like other girls\" is usually code for someone who is easily threatened by women - someone who thinks they're unique, when really they're just insecure. They don't fit in because they're an asshole - it's self fulfilling.\n\nOP I'm sorry this is happening. Mary is toxic and disrespectful and your husband should be backing you up. That's not okay. Definitely worth a serious conversation, and if he doesn't take that conversation seriously, gigantic red flag.\nETA words",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Those type of girls are just awful. And it’s sad, like...why don’t you want to be friends with other women?!? Women are great!!",
              "id": 137,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "That’s fine, they can all still be friends, she just doesn’t need to come to your house.  I don’t go in 99.999% of houses and I’m fine.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 979,
      "content": "NTA. I would seriously have a sit down with your husband and see what the deal is. Your are his WIFE and if he will not defend you against clear bigotry and hatred, then what will he actually stand up for?",
      "id": 139,
      "comments": [
        {
          "score": 601,
          "content": "I honestly don’t know. It just seems like every time Mary does something wrong (just in general) he just kinda brushes it off",
          "id": 140,
          "comments": [
            {
              "score": 648,
              "content": "That’s a major red flag. He is not considerate of your feelings and how Mary’s comments make you feel. There is some sort of loyalty/attachment that he has for Mary that, for some reason, does not extend to you.",
              "id": 141,
              "comments": [
                {
                  "score": 88,
                  "content": "Check out OP’s update bc you were right on the nose with it",
                  "id": 142,
                  "comments": [
                    {
                      "score": 82,
                      "content": "Oof. OP if you see this, you are much better for that conversation and you don’t need him. What an awful person and you truly deserve better. Take some time for yourself and practice some self-care.",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 62,
              "content": "Do you and your husband plan on having kids? Is she an example of the type of adult you want around your future children? Will your husband brush it off when she starts to attack the kids? This is something you should bring up to your husband and talk about.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Exactly. I don’t think anyone should ditch their friends for a partner without a solid reason, and this is a solid reason. His friend isn’t being a friend to him at all. She should respect the husband enough to not insult the wife, and husband should respect his wife enough to shut down horrible racist behavior directed toward her. \n\nOP didn’t mention children, but if they have children now or at some point in the future, will the husband tell his kids the same thing he tells his wife? Sorry, son. I know you’re only four and sobbing hysterically, but that’s just the way she is.",
          "id": 145,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 783,
      "content": ">  ‘are you a vampire? do you bite your husband by the neck?’ to ‘are you a gypsy? I bet you’ve got some of that gypsy blood in you’\n\n>  this whole thing is part of my ritual and I’m just a ‘immigrant gypsy\n\n**Never** tolerate such aggression. Never ever. React immediately and react hard, at any costs. If you compromise on this, you're lost, you'll become a slave. I hope you understand what I mean. It is zero tolerance and immediate hard reaction or it is you losing self esteem, social status and everything.\n\nFrom my vast experience, the best reaction is to attack the aggressor with his own weapons, questioning his identity and heritage. Re-establishing symmetry.\n\nAs for your marriage, I'm afraid your husband will have to choose between you and \"Mary\". Make no compromise.",
      "id": 146,
      "comments": [
        {
          "score": 622,
          "content": "Going all Vlad Țepeș, I see. \n\n\nI tolerated it because I thought she was just uneducated. It became increasingly hurtful when I explicitly told her ‘this is NOT ok’ and she continued. \n\n\nI’m not going to retaliate and ‘attack’ her because I’d just be getting down to her level and I’m better than that but I will definitely cut her out of my life completely.",
          "id": 147,
          "comments": [
            {
              "score": 629,
              "content": "If you ever do interact with her again and she starts up, LOUDLY shame the shit out of her.\n\n\"OH NO! POOR IGNORANT MARY THINKS I'M A GYPSY WITCH THAT'S GOING TO CURSE HER! POOR FUCKING MARY THAT WAS RAISED SO TERRIBLY THAT THE ONLY WAY SHE KNOWS HOW TO WORK OUT HER JEALOUSY THAT HUSBAND MARRIED ME AND NOT HER IS TO BE A RACIST SACK OF SHIT! OF COURSE I'LL FORGIVE YOUR BEING THE SCUM OF THE EARTH BECAUSE BEING A MEAN, HATE-FILLED,  EXCUSE FOR A HUMAN IS JUST YOUR NATURE.\"\n\nThen turn to your husband and say \"Did I do it right?\"\n\nIf he's going to pick Mary's feelings over yours, maybe he'll have her stop coming around if she's the one who leaves crying.",
              "id": 148,
              "comments": [
                {
                  "score": 81,
                  "content": "Love this.",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 72,
                  "content": "And if Mary and husband get upset, tell them they're just being \"too sensitive\"",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 92,
              "content": "She can't be cut from your life,  yet still remain in your husband's.   Complete oxymoron. If she is in your husband's life,  then she is still in yours. I hope that makes sense?  An ultimatum is what I would go with here,  but it's your choice at the end of the day.  I just think its time you stop being so passive, and stand up for your sensibilities, right to feel/be validated, and right not to take bigotry from an ignorant, soggy spam sandwich.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "I had a boss who suddenly became a complete asshole to me once he found out I was Romanian, because his neighbors were Romanian gypsies. Glad that job didn't last long, it was pretty annoying. No one I've ever met has treated me like that over my background, except for the Quebecois who hated on me thinking I was American. That was a fun time in high school. \n\n100% don't tolerate that behavior. I hope your husband gets educated himself and realises his friend is TA and he should stand behind you.",
              "id": 152,
              "comments": [
                {
                  "score": 9,
                  "content": "[deleted]",
                  "id": 153,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I'm also Canadian, but I lived in Arizona for just about a decade, so when we came back to Canada i had to finish the last 2 months of grade 10 in a French school and boy did they ever hate me.\n\nI've come to notice that francophones dont mind anglophone tourists, but if you're an anglophone living there permanently, they have a problem with you. It was an interesting 5 years in Montreal. Wouldn't live there again, but I'd love to visit again one day (I live in the west coast now).",
                      "id": 154,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "You know, he had his moments. He had this weird notion of tough justice.",
              "id": 155,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Yes, cut her out at all costs. I can’t imagine forcing my partner to endure abuse from someone because...they’re nice to ME? I’m so sorry this happened to you.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 589,
      "content": "Nta,\n\nBut the fact that your husband glands over her racist obnoxious remarks is concerning. \n\nStay away from that evil.",
      "id": 157,
      "comments": [
        {
          "score": 104,
          "content": "*Stay away from that evil*\n\nExactly! That right there! Mary is the wicked witch, not you! \n\nFrom your replies I can see that she tries to avoid the other wives/gfs of the group too - That’s very telling and shows that Mary is the problematic one. It’s your house and you are permitted to invite/not invite whoever you want, so why would you want someone who insults you?\n\nSpeak directly to your husband and advise him that he hasn’t held up his end of the partnership by supporting you, if you want to have a get together with “the group”, invite the wives and gfs and leave out the old witch, you may find that some of the other ladies have had certain issues in the past with her too.",
          "id": 158,
          "comments": [
            {
              "score": 14,
              "content": "My experience with 'one of the boys'-women is that they're often very Very territorial, messy and overall obnoxious. \n'not like other girls'- misogyny mixed with obvious racism in Mary's case.\n\nThey see themselves as the 'only' women that is worthy of being part of their clique, and all the other women/gfs/partners are there to disturb their role as only women.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 411,
      "content": "NTA, Mary is racist  and hubby should frow a pair. \nI would  also question him being so protective  of her.",
      "id": 160,
      "comments": [
        {
          "score": 187,
          "content": "Exactly. In other comments OP said this has been going on for years. Why isn't he defending his own wife?",
          "id": 161,
          "comments": [
            {
              "score": 125,
              "content": "Who knows but it ain't good. \nNormal people  don't take the racists side. \nEven the op is making excuses for Mary. No not all foreigners  think  think romanians are gypsies, vampiers, witches or any other stupid shit.( you may ask how do i know, I am also have romanian, and have  lived  in other countries and no one in my whole life has said anything of the shit Mary says).\nAre people curious? Yes \nDo people actually believe  vampires and witches exist ? Generally the non educated folk with the brain  capacity  of a thimble seem to believe and coincidently many are also racists.\n\nAnd the fact that  Mary  insisted on calling  her the romanian version of an evil prostitute whore even after bring told not to for various reasons.\n\nMary most likely likes her hubby and never got out of the  friendzone and hubby either  has lost his marbles  both the upper ones and the lower ones, or worst case acenarious he actually  likes Mary not just as a friend",
              "id": 162,
              "comments": [
                {
                  "score": 8,
                  "content": "I was gonna say something similar...my father is half Slovak and is in fact the gypsy kind, a few times heritage has been brought up in conversation and I’ve mentioned this, no one has even batted an eye. I’ve never been made fun of for it or called a witch, so the fact someone is going so hard on something so stupid, there’s more here that OP isn’t aware of I think.\n\nEdit: I said he’s Romanian because I had that word in my head while I was typing. My father is half Slovak through his mother, and his grandmother was a “Gypsy” that my great grandfather fell in love with and brought to the US to start a family away from Europe because of the stigma attached to my great grandmother.",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "My first boyfriend was from Romania, I was mostly interested in all of the food he and his Dad would get into. Lol\n\nThey would have a spread that spanned the entire kitchen counter and have a feast. Just because. No other reason.",
                  "id": 164,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Exactly it seems to me she likes the husband and is try to poison the marriage.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}