{
  "post content": "I'm the mother of a 17 year old girl. The legal drinking age where we live is 18 but the average age kids start drinking is 13, usually in a field somewhere with gut rotting cider and a parent at home worried sick about where the child is. My daughter never did this, but she did start drinking in controlled environments (she looks significantly older than what she is so being asked for ID has never been an issue) like pubs and at home or at friends houses when she was 15.\n\nI'm pretty laid back when it comes to rules like that, mostly because my parents were extremely strict and got mad at me for everything. My rules on substances are no hard drugs, no aftershock and no tequila. But I don't get mad if my daughter tells me she's expiremented with certain things. I've created a safe space for my daughter, she tells me pretty much everything and I respect her boundaries and privacy.\n\nI've raised a very responsible young adult and I'm extremely proud of her and glad for the relationship we've got. The problem is with her father. He's American and wasn't in her life much until last march when he came to visit his parents in my country and ended up being trapped here and decided to move here permanently. She was 16 at the time. \n\nHe called over last Friday night completely unannounced, when myself and my daughter were having a few drinks with my partner and one of her friends and he was absolutely appalled at the sight of our daughter having a beer. He stormed out and on Saturday morning, I got a text saying that he was going to contact child services about this and that it was completely wrong of me to allow this and participate with her.\n\nI told him my daughter having a few drinks at home is not actually illegal here and technically there's no minimum drinking age when supervised by a parent. I also reminded him he's not her legal guardian and wasn't in her life from the ages of 2 to 16 so he doesn't get much of a say.\n\nNeedless to say, he thinks I'm a massive a-hole for allowing my daughter to drink alcohol under the legal age. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 4703,
      "content": "For me personally I say NTA. \n\nI truly feel like doing something bad and getting away with it is 99% of the reason why kids do it. If you take the mystery away, teach them safety and responsibility from the get go you’re far more likely to end up with adults who know how to drink responsibility. \n\nGranted that’s not in every single case some folks are just wired to overindulge, not knowing when to stop. It’s also no to say allow your teenagers to go on benders every other weekend. I’m just saying giving them a safe space knowing they can come to you for anything leads for a much healthier parent/child relationship and a lower probability of substance and alcohol abuse problems.",
      "id": 2,
      "comments": [
        {
          "score": 2531,
          "content": "This might just be a culture clash. In Europe it really isn't that big of a deal, whereas Americans are a lot stricter with it. \nBut it is a bit rich of the dad to show up after 16 years and criticize OPs parenting (especially if she has a really close relationship with her daughter).",
          "id": 3,
          "comments": [
            {
              "score": 379,
              "content": "This is true. But it also depends on where in America you’re at. The laws differ from state to state for reasons I will never understand. The state I grew up in had very lax laws concerning alcohol and minors. But where I live now teenagers would get their butts whooped for it.",
              "id": 4,
              "comments": [
                {
                  "score": 129,
                  "content": "Most states have very lax laws when it comes to parents letting their children have alcohol. In my state 5 year olds can legally drink with parental permission. Obviously you can't get the kid drunk, but a little champagne or wine on special  occasions is generally acceptable even with very young children. Only 9 states actually outright ban minors drinking even with parental permission.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 41,
                      "content": "Not sure the rules in my state, but growing up my grandfather would dip my binky in his wine and give it to me same with coffee in the morning then later on life they'd buy me frozen margaritas to sip on with them. My family almost always had some sort of alcohol with dinner, usually just one glass, including us kids so we grew up with a good relationship with alcohol",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": "> The laws differ from state to state for reasons I will never understand.\n\nSincerely - what part of it is hard to hard understand? It's not something the constitution assigned to the federal government, so it is regulated on the state level and states have wildly different values, electorates, and political machines.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 331,
                      "content": "Why aren't you just 50 diffrent countries like everyone else lol.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "No, the drinking age is 21 in all 50 states and has been since Ronald Regan was president.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "And that's just stupid.  One country should have one set of laws.  States are a hangover from 17th century politics and slavery compromises.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -1,
                      "content": "Cause you need atleast five years of American schools to understand or care about what you just said.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "I didn't necessarily mean laws, but more the attitude. Of course this isn't universally true.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Yep. My state's laws allow underage kids to drink under parental supervision, but because of cultural attitudes I wouldn't dare give her a beer or glass of wine in front of any other adult.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Ya know……now that you’ve specifically pointed that out. I realize while I used the laws to demonstrate the differences it was in no way clear that I wholeheartedly agree with your culture clash assessment and just wanted to share that it’s not even just Europe/America culture clash. \n\nAmerica can’t even get its sh!t together within its own country and somehow we’ve managed to clash with ourselves and the attitudes are just so different depending on the region you find yourself in.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Yep.  In all honesty, it's not our laws that are the issue when it comes to alcohol (well... for the most part).  It's our mindset towards alcohol in general here in the US.  We're largely raised to view it as something taboo/for adults only, and that mindset persists even into adulthood to some extent.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Yeah, in my state it is legal as long as the kid is drinking on private property supervised by a guardian and it is not a deadly or above the legal limit to drive, so basically, don't give your kid alcohol poisoning or get the plastered.\n\nNTA OP",
                  "id": 16,
                  "comments": [
                    {
                      "score": 0,
                      "content": "Which I really feel like is common sense but then again….. ‘murica so it must be explicitly stated. Lol",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "No, 21 is the law in every state.",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 0,
                  "content": "Drinking age varied until the federal govt gave the states a lot of money to repair roads and infrastructure in exchange for making the Drinking age 21.\n\nStates are responsible for the health, safety, and welfare of its residents and the feds only interfere when they give conditional $$.\n\nFed govt has limited enumerated powers and the states have everything else.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -61,
                  "content": "In America the law for underage drinking is the same in every state, it’s illegal plain and simple! There is no leeway. It’s not legal.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 46,
                      "content": "This is incorrect - federal drinking age is 21, but in many states minors are allowed to drink with a parent or guardian present. I'm from Texas, and started having a small glass of wine with dinner at restaurants when I was about 15. By 17, my parents were letting me have a bottle of beer or the occasional cocktail at home. \n\nThe (wonderful) result is that by the time I hit college I knew how to handle myself safely around alcohol.",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 31,
                      "content": "[removed]",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 21,
                      "content": "It's legal in 41 states for minors to drink with parental permission and especially in the parents house. Some states even allow for children to get drinks at restaurants and bars with parents present. Some states the minimum age is single digits. My state is 5. Might want to actually learn the laws before stating things like that.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 78,
              "content": "I mean I’m in California but grew up in an area where underage drinking was really rampant. But my parents had a fully stocked bar in the house that they never checked the levels of, they always had parties and drank every weekend. There was no mystery or thrill to me. So when everyone my age was drinking cheap  beer on the weekends, I never did because I knew it was gross. I did try hard liquor well before it was legal but never benders or in excess. I’m now a social drinker who likes cocktails for the taste and not a buzz",
              "id": 24,
              "comments": [
                {
                  "score": 40,
                  "content": "If you are in it for the taste and not the buzz I highly recommend a chocolate milkshake.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 39,
                      "content": "Good cocktails do not taste like chocolate milkshakes.",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "I was drinking from 14 openly at parties. But then again UK drinking culture is not one to boast of. We have a huge problem.",
              "id": 27,
              "comments": [
                {
                  "score": 18,
                  "content": "But it did let me witness a future groom dressed in a chicken suit pissed with his mates on a Ryan Air flight to Prague lol",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I was going to pubs from 14, nightclubs (when I wasn’t working in them) from 15 and had had enough by 23 and was more than happy to stay home most of the time. I think we tend to start earlier and finish earlier than Americans. Also when I went out people didn’t drink as many shots is they do in the USA. Shots meant being pissed to early and having to go home early when everyone wanted to be there until then end! \n\nNot a culture to be proud of but it was fun at the time! Can’t think of anything worse now.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Depends on the parents, but here in the U.S. parents to tend to be over cautious with their kids and really try to keep their kids from drinking. \n\nI started drinking at 14 myself. My parents had no clue until I was 18 or so but I made sure if I was drinking it was with people I knew and we were staying at that location until sober or til the morning. Same as you I was pretty over drinking by 23. Now I'm primarily a social drinker, but have the occasional week or two a few times a year where I'll come home every day and have a couple while playing video games.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Right? Where the hell have you been? OP got this far without him I think she knows what she’s doing!",
              "id": 31,
              "comments": [
                {
                  "score": 2,
                  "content": "'How dare you let our daughter drink underage -- you're a terrible mother and I'm going to report you!' Says the guy who's been absent the past 14 years and knows nothing about the local/national laws.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "I have a rule for my kids, they haven't reached the age yet but its there. (I'm also American) The rule is drinking can be done at home and supervised (though I'll try not to cramp anyone's style) but any friends have to have permission to stay over and their parents and I have to have talked about my rule and anyone who drives needs to hand over their keys. Minimum age to experiment with drinking is 15 (wine coolers/light beers). I still have a few years to figure out how to deal with what happens if the rules are broken.",
              "id": 33,
              "comments": [
                {
                  "score": 6,
                  "content": "You might want to check your homeowners insurance and the local laws. In many places it's fine to give your kids alcohol but if you give it to their friends it's a felony.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Yeah, with you and your kids and your family you can do what you want, but involving anyone else is a bad idea.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "What are wine coolers?",
                  "id": 36,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Low alcohol content drinks for people who don't drink hard liquor.",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Basically fruit punch with a drop of alcohol.....",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Gut rot in a bottle",
                      "id": 39,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "The strictness level is why kids go crazy in university",
              "id": 40,
              "comments": [
                {
                  "score": 6,
                  "content": "Also the legal drinking age being 21 doesn't help",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "When I came to college in the US I was so shocked by the college drinking culture and how much binging kids did! I swore I would teach my kids how to enjoy a drink without it being a big, taboo thing so they wouldn’t be that college freshman barfing, being taken advantage of, etc. Drinking was not a big deal to me, I knew how to handle it, and I didn’t feel like I needed to get my fill in the second I didn’t have parental supervision.\n\nNTA OP, sounds like she loves, respects and trusts you.",
              "id": 42,
              "comments": [
                {
                  "score": 2,
                  "content": ">each my kids how to enjoy a drink without it being a big, taboo thing so they wouldn’t be that college freshman barfing, being taken advantage of, etc. Drinking was not a big deal to me, I knew how to handle it, and I didn’t feel like I needed to get my fill in the second I didn’t have par\n\nI agree totally.  By the time you get to college why don't they already know their limits?  Finding out amid a bunch of strangers is frankly asking for trouble and I think the parents have some responsibility for not preparing their kids properly for the experience.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Not all Americans.\n\nSource: Catholic relatives.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Did an exchange program at 16 and had a glass of wine at an event we went to. Fellow American friends freaked TF out saying it's absolutely not allowed until 18....the day prior I was at a wine tasting where I was told 16 is perfectly acceptable to drink wine",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -3,
              "content": "I’m American and, yes, I’m appalled at a child being given more than a watered down sip. \n\nIs it really acceptable in Europe for a child to have “a few drinks”? I’m in my sixties and I never have more than one cocktail or two glasses of wine.",
              "id": 46,
              "comments": [
                {
                  "score": 4,
                  "content": "Well yes, all my friends in their teens had beer or wine with their parents or at dinners.    \n\nNot a big deal",
                  "id": 47,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "You wouldn't really give a child alcohol.  Maybe only a sip here or there to try. The first time I tried alcohol was when I was a child (maybe like 5/6?) and it was the foam from my dad's beer (I obv hated the taste). But it's normal for teenagers to drink with parents especially beer or wine. Legal drinking age for beer or wine is also 16 here but it's normal to already have tried those earlier.\n\nEdit to add I'm in Germany, this won't universally apply for Europe. For example Sweden is a lot stricter with alcohol.",
                  "id": 48,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Yes absolutely normal.",
                  "id": 49,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 111,
          "content": "Right? My parents told me when I wanted to start drinking to come to them and they would get me some drinks so we could see where my tolerance was before going to a party. I think part of it is that alcoholism runs in the family so they want us to be as safe and educated as possible. \n\nWhen my sister started going to parties I told her that I would get her what she wanted as long as she promised she’d only go through me and would tell our parents where she would be. They gave her a few drinks to make sure she knew how it would effect her/how many drinks were safe. My sister and I as a result have a very healthy relationship with alcohol. I’ll maybe drink once or twice a month on a weekend if I’m with friends or watching a movie with my dad but that’s it. \n\nOne of my friends parents were SUPER strict about alcohol and drinking it underage. She was on an exchange from Mexico and was insanely excited about this big bush party. One of the other exchange students I was friends with came running up to me crying and screaming that she needed help. Some of the guys thought it was funny to give her tons of drinks and laced a few with Molly. We had to get three of our friends boyfriends to carry her down the hill to her host family after someone got her to throw up some of the alcohol. She ended up getting her stomach pumped and was sent home early, but it could have been a lot worse had our friend not ran for help. I really don’t think she would have gone to such extremes if her parents hadn’t been so strict with her.",
          "id": 50,
          "comments": [
            {
              "score": 108,
              "content": "> but it could have been a lot worse had our friend not ran for help.\n\nIf any teens are reading this: it's always best to go get help. Kids die from alcohol poisoning all the time. I promise you, whatever the fallout might be from adults at the time, that will blow over and is not worth risking someone's death to avoid.",
              "id": 51,
              "comments": [
                {
                  "score": 38,
                  "content": "THIS^ but also it’s important to know that in many US states, if you are a minor that calls 911 for a friend at a party where you have been drinking that the authorities won’t arrest or charge you for drinking underage. It’s important to know what to do in these situations and to have a designated friend who is sober enough to handle emergencies (have a mom friend in your group, kids)",
                  "id": 52,
                  "comments": [
                    {
                      "score": 45,
                      "content": "Another piece of advice: if you're ever even asking \"should we call an ambulance?\", **call an ambulance**.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "In college, a roommate who was a close friend of mine at the time was brought home from a sorority party by her big who just dumped her in bed and left. She was cold, pale and unresponsive. We were asking her questions and the only thing she responded to was us asking \"should we call 911\" to which she said \"no\". We ended up calling anyway because we were afraid our friend was going to die. The ambulance arrived, took her to the ER, and she got her stomach pumped, but it contributed to us falling out because she was so upset over the bill for the ambulance. I don't remember the exact amount but it was over $1k and we were all very poor at the time. I remember feeling really guilty that she had to pay that, but I'd still do the same thing over again if I had to because that's a small price to pay over death.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "There’s a frisbee golf course named after a kid in my hometown for this exact reason.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 61,
              "content": "My uncle had a very unique way of keeping my cousins out of trouble with alcohol—he exposed them in a safe way to it, and then he taught them to only really appreciate the high quality stuff. So when they went to college they just weren’t interested in the terrible booze that was being passed around at parties.",
              "id": 56,
              "comments": [
                {
                  "score": 38,
                  "content": "> only really appreciate the high quality stuff.\n\nThat's genius",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Dad did that, here pal try this new bourbon.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "My brother got me drunk for the first time before I went to college because he wanted to make sure I did it in a safe environment & knew what to expect. And my parents let me have a beer or glass of wine when I came home during college before I turned 21. It just makes sense to me to educate your kid (or younger sibling) & let them figure it out in a safe space.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": ">Some of the guys thought it was funny to give her tons of drinks and laced a few with Molly.\n\nIf you're trying to blame *anyone* but \"the guys\", then you're part of the problem. They drugged a girl for lulz. No kind of parenting would've protected you from that kinda shit.",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "NTA my family is American but also took the European approach. Teenagers were always offered wine, champagne, margaritas, etc when the adults were drinking at family events and holidays. It was never treated as a big deal and it helped you learn what your tolerance was under controlled adult supervision. \n\nMy sister doesn’t drink because she doesn’t like the taste, but myself and cousins all went to college and were perfectly fine because we knew how to drink responsibly unlike some fellow students who grew up sheltered. My aunt even gave me tips on which alcohols not to mix lol so as not to make yourself sick before I went off to school. \n\nI think as long as you modeling responsible drinking in front of her, it’s actually beneficial. Plus it’s important for her to know that if she ever does overindulge and needs to call for help that you are available and won’t be angry.",
          "id": 61,
          "comments": [
            {
              "score": 2,
              "content": "My mom saw this in college. She grew up in a house where a glass of wine with Friday dinner was allowed once she hit 16 (this was when US drinking age was 18). Then she went to college where half the students grew up in completely dry counties. The dry raised ones went crazy while the ones like my mom never had an issue. \n\nMy mom would let me have a hard cider (I didn’t like the taste of beer or her wine) once a week with dinner once I hit 16. More on holidays as I got older. And I never had an interest in partying. But the kids I grew up around for whom it was horribly forbidden did and some got in legal trouble for it. I am 28 and have only ever gotten hang-over drunk once in my life, and it was at my aunt and uncles on Christmas Eve with my family when we were staying at their house (so no one was driving). I credit it to my mom’s European approach to learning alcohol limits.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": ">Granted that’s not in every single case some folks are just wired to overindulge, not knowing when to stop.\n\nThis is actually another reason why allowing your teen to experiment in the safety of your own home or controlled environments can be a good thing. If you see that they struggle to have limits, even with guidance and boundaries, then you have an opportunity to address that before it has a chance to really hurt them.",
          "id": 63,
          "comments": [
            {
              "score": 5,
              "content": "Yes, yes, yes!!!!  THIS is exactly why I've always felt it was safer to ease into it with your family.  Wouldn't you want to know and prepare for that BEFORE your child is a legal adult who \"doesn't have to listen to you anymore\"?",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I'm an American who's going to be raising my kiddo in a country with very different thoughts on alcohol consumption (currently expecting). Culturally having an occasional glass of wine while pregnant is normal here (I didn't so please no shaming). I understand my child will probably start having beer and wine as a young teen and have no plans to stop him. I'm hoping I'll be able to teach about drinking responsibly during this time. I imagine by 16 he will occasionally having a glass of wine with dinner. OP is absolutely NTA, I understand why the father was upset with his American background but he needs to understand his daughter is not an American and drinking is different.",
          "id": 65,
          "comments": [
            {
              "score": 8,
              "content": "When i read this post I could almost visualize the American father lol I could damn near point you to the region he grew up in with this very strict views on alcohol.",
              "id": 66,
              "comments": [
                {
                  "score": 5,
                  "content": "What were you thinking? Puritanical NE or Southern Baptist?",
                  "id": 67,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yes!! It has to be one of those",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Great comment",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "THIS. I offered to allow my children to drink at home safely if they wanted. Neither did. Neither drinks. NTA",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I agree 1000000% \n\nMy parents were fairly open with alcohol (we are American) and other than a few rough nights in college, I’ve never really cared much about it. It was just there, ya know?\n\nI think you’re spot on!",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Except alcohol is an extremely addictive amd unhealthy substance.  It is foolosh to think 99% of teenagers only drink because it is \"wrong.\"",
          "id": 72,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1547,
      "content": "NTA\n\nHere in Germany it would already be legal for her to drink beer and whine without her parents. Having a (few) beer with your parents with 17 is really nothing to worry about.",
      "id": 73,
      "comments": [
        {
          "score": 464,
          "content": "Same in Denmark. It's an American thing.",
          "id": 74,
          "comments": [
            {
              "score": 343,
              "content": "Well they were founded by Puritans they weren't really party people",
              "id": 75,
              "comments": [
                {
                  "score": 227,
                  "content": "To quote Robin Williams ‘the puritans who were so uptight the British kicked them out!’",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 143,
              "content": "I think America might be the only nation with that high of a drinking age. We are basically taught by public schools to fear it. It's so backwards. Nevermind if a major war happens. Totally cool for us to get drafted and kill people, though.",
              "id": 77,
              "comments": [
                {
                  "score": 129,
                  "content": "If I might (as a non-American) make one small defence of their system, the US is much bigger and more spread out than any European country, and their public transport situation is very poor. Driving is much more a necessity of life for the average American than the average European. So they have to have a lower driving age. And, because teenagers, therefore a higher drinking age.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 63,
                      "content": "This is exactly how the drinking age was raised. Deaths from drunk drivers in the 80s were insane. There was so much public outrage that the Reagan administration, In a weird reversal of usual policy, threaten to withhold money from states unless they change the drinking age to 21.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Although I grew up in Europe, at that time the public transport system was atrocious (there were no nighttime buses or anything). \n\nMy father for all his faults always made me promise that if I was intoxicated or not able to get home without endangering myself to call him even in the middle of the night when he was asleep. He promised he would not judge, complain or be angry. And true to his word he wasn't (I only did this once when I was in the middle of town with no way home and a bit sloshed).\n\nThat would always leave me with a way out of what would otherwise be a dangerous situation.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I've never thought of that. Interesting perspective! Thanks for your input.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Yea, in Canada we are even more spread out with generally an even worse public transportation system. But it's still 18 or 19 drinking age depending on the province. And we still were drilled with 'no drinking and driving' in high school before we were legal to drink, cause just being below 18 didn't mean it wouldn't happen. \nAlso, my parents always told me and my friends if we needed a ride because the person driving might be drinking we could call them (not totally uncommon). Anytime, anywhere, no questions asked. I never had to take them up on it, so don't know how 'no questions asked' would have played out.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I would consider having more drivers a reason to lower the drinking age. It's better if people find their limits BEFORE you allow them to drive.\nThe fact the US has a [relatively high percentage of accidents involving alcohol](https://www.forbes.com/sites/niallmccarthy/2016/08/11/the-worst-countries-in-the-world-for-drunk-driving-infographic/?sh=2d4f3b152f5cwith) compared with other developed countries seems to support this.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "America is basically a nation of recovering alcoholics. Prior to prohibition alcoholism was so widespread and bad and focused on hard liquor, not beer, that the US went crazy and went through prohibition. When that was done we never went back to the european style of drinking.\n\nA lot of states act like recovering alcoholics.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "A lot of american states allow drinking at home with your parents permission",
              "id": 85,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "I would like to further comment, as an American, it's not an entirely American thing. Most people I know of have parents who allowed them to drink with them. In Texas it is legal to drink underage with an adult. At home parties I was pressured to drink if anything.",
              "id": 86,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -3,
              "content": "OP clearly isn't American, though. Our drinking age is 21, not 18.",
              "id": 87,
              "comments": [
                {
                  "score": 13,
                  "content": "OP mentioned that the father is American.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Oh, my bad.",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "I think they're referring to the daughter's father, who's American",
                  "id": 90,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 43,
          "content": "yoke secretive innocent imagine rock pie encourage scandalous rhythm nine\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
          "id": 91,
          "comments": [
            {
              "score": 7,
              "content": "Adults don’t suddenly wake up at 18 able to handle drinking. Having a drink at dinner and learning moderate drinking is how you end up able to handle yourself and not acting a complete fool the second you hit adulthood. I’m fairly sure supervised drinking from parents is not only legal it’s just responsible parenting to send your kid into adult situations prepared and accustomed to it",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 42,
          "content": "Absolutely NTA. Legally allowed to drink with parental supervision and way better than the daughter drinking shit white cider in a field with a load of idiots where there might be drugs. This kind of supervised, relaxed drinking allows young people to develop a healthy relationship with alcohol, not having to hide it and not going mad when they get a rare chance. The mostly absent Dad sounds like a regressive prude.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "True. Legal drinking age for beer and wine (and the like) is 16 - 14 with parental supervision (even in public). Hard liquors are legal for 18+ young adults.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "As an American living in a 16-year-old limit country in Europe, I gotta say it’s weird that my 16 year old can order a beer when we’re out at a restaurant. But I agree with the OP. Creating a safe place and trust is way more important than making rules you can’t enforce and expecting the kids to adhere to some other country’s rules for unclear reasons. It’s not like kids drive here at that age either. And he knows he can call me if things get out of hand. NTA.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1112,
      "content": "NTA. It takes the taboo and thrill out of it. I 100% believe that here in the US, drinking culture among teens/young adults is way worse than it should be because it's seen as some sort of \"right of passage\" when you turn 21 instead of something to be enjoyed responsibly.",
      "id": 96,
      "comments": [
        {
          "score": 259,
          "content": "Exactly right. I'm in a country where the legal age is 18 too. Drinking wasn't made a big deal of in my home, it wasn't banned. I didn't have much interest at all though. I had a sip here and there, and didn't really like it. \n\nWhen I was 17 I went to a party with a friend, on the way out of my house my parents said \"don't drink too much and if you do call us, don't drive\"...me, \"Okay, bye.\". That was the first party where I had more than one drink. My friend was like \"did you tell them you were going to be drinking?!\", I was like \"nope, it's the first time they've ever said anything like that\", shrug. Still not sure how they knew I had planned to drink that night 😆.",
          "id": 97,
          "comments": [
            {
              "score": 159,
              "content": "They knew because you were 17 and going to a party :p",
              "id": 98,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 47,
              "content": "I grew up in Australia, my Dad fixed machines at various wineries so if I was with him while he worked, I'd get to do some wine tasting.. I was about 7-10yo at that time, the only bad things about it is, I now have a very expensive taste for wine, the cheap stuff just wont do..LOL \n\nOn weekends my parents went wine tasting with friends, all us kids got to taste it as well. Nothing was ever said, none of us were ever drunk either. Nor did we ever spit it out.",
              "id": 99,
              "comments": [
                {
                  "score": 9,
                  "content": "My grandmother, in front of my parents who were ok with it, gave me a small glass of fancy wine. It tasted bloody awful and I did not touch the crap for years. I had another sip of wine at my aunts years later (out of a plastic cup because I am classy) it also tasted like crap. I don't drink any alcohol at all now because I have associated alcohol with bad tastes.\n\nBrilliant move by my family.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I think this is the real trick.  Give your teenagers a taste of good alcohol and they're much less likely to overindulge on the cheap gross stuff they'll have access to.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "At 17 I got drunk for new years on tequila. Put me of drinking for a while. So a few weeks later when I refused wine during sunday lunch my dad knew what was up. He was laughing at me, said in a sing-song way \"youuu gooot druuunk\" and then \"serves you right, you will learn from it. Well more wine for the rest of us\".",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 71,
          "content": "Yeah, I live in the US and I'm 18 while most of my co-workers this summer are between 20-24 and the number of stories I've heard from them about their/others 21st birthdays are *insane*. Like, drink till you black out insane. These stories are told with *pride*. I do think that if the legal drinking age was younger like it is in Europe then we (US) probably would not have these stories be common place. Keep it up OP, you sound like a responsible parent . NTA.",
          "id": 103,
          "comments": [
            {
              "score": 14,
              "content": "The drinking age in the UK is 18, and we still get those type of stories (and a whole binge drinking culture to boot!). There's no easy answer, really.\n\nMy mum was like OP when I was a kid, buying us booze because she'd rather we drink safely at home than get in trouble elsewhere. Still didn't stop some of us acting like idiots, unfortunately.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Lol you’re wrong. People get just as drunk in Europe as they do in America. America has lower overall alcohol consumption and alcoholism than most European countries.",
              "id": 105,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "It's funny I was having a discussion with a friend the other day, we both work in fields with a lot of interaction with youth (think 15-24) and we've both noticed since weed has been legalized in Canada, there has been a significantly noticable increase in the abuse of harder drugs.  Like, I employ youth in a fairly affluent area, and there would always be the drinking and weed, but I've never had to deal with kids coming to work on coke until after legalization.  But in the last 3 years I've seen multiple kids tale time off to go to rehab for hard drug issues.\n\nAnd it kinda makes sense.  They're chasing that rebellious feeling of doing something they aren't supposed to do, but then the hooks get in alot harder than with booze or weed.",
          "id": 106,
          "comments": [
            {
              "score": 26,
              "content": "> and we've both noticed since weed has been legalized in Canada, there has been a significantly noticable increase in the abuse of harder drugs\n\nWithout actual data I would hold my doubts on this.  No way there has been a significant uptick in teen drug use post pot legalization and it not be screaming front page news.",
              "id": 107,
              "comments": [
                {
                  "score": 2,
                  "content": "Well I'm not sure there IS actual data yet.  The most recent report on drug use among youth was published in 2019 and most of their data was from 2017.  We are still a couple years out from seeing long term impact stats of legalization.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 0,
              "content": "This is complete and utter bullcrap.  The favts don't back up your anecdotes.  Stop trying to demonize marijuana.",
              "id": 109,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I’m almost 40, but I had an interesting study abroad experience when I was in college years ago. From the US, studied in Australia. We drank about the same in a week as they did, but they spread it out over 6 or 7 nights while we crammed it in 2 or 3. They also had a lot less focus on liquor(it was there, but there wasn’t the mad rush to get wasted like we did). 1000% recommend the Aussie method, so much less trouble.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 499,
      "content": "[deleted]",
      "id": 111,
      "comments": [
        {
          "score": 305,
          "content": "I love the idea of this guy calling child services about this in the UK. I can just imagine the confusion at the other end of the phone “ok sir, so just to confirm you’re calling to tell me that a 17 year old is having a beer at home with her mum…?”",
          "id": 112,
          "comments": [
            {
              "score": 90,
              "content": "Yeah exactly they would be like hmm nope sounds fairly normal to me!!!! I was having a glass of red wine with Sunday lunch from about 12 - it’s so normal in the UK!!!!!",
              "id": 113,
              "comments": [
                {
                  "score": 22,
                  "content": "Plus its legal to drink in private at home from 5 up",
                  "id": 114,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Sure I can’t ever remember being refused a sip - and I do mean a sip - of my parents wine/beer. They just used to like me pulling a funny face and saying yuck!!!!",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "[deleted]",
              "id": 116,
              "comments": [
                {
                  "score": 2,
                  "content": "My parents have pulled similar tricks. \n\nSip of beer at 5 = bleh\n\nSip of fancy wine at 9 = bleh\n\nSip of regular wine at 18 (out of a plastic cup) = bleh\n\nI don't drink. ever.",
                  "id": 117,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "Love the fact it's legal to have a beer or wine in a restaurant/ pub with a meal at 16 with *any* adult being there, not even your parents lmao. The rules on underage drinking are so chill if the parent is the one giving the alcohol anyways I bet they'd just tell him she's not breaking any laws.",
              "id": 118,
              "comments": [
                {
                  "score": 9,
                  "content": "If it is the UK (which it sounds like) drinking at home with parents is completely legal from age 5 anyway",
                  "id": 119,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "As a social worker, that was pretty much my thoughts reading this. Obviously there may be a lot more context needed. The daughter's age, and the circumstances described would get him some advice, hung up on, and then laughed at by the office.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 465,
      "content": "*laughts in german",
      "id": 121,
      "comments": [
        {
          "score": 148,
          "content": "*laughs in Russian 🍻",
          "id": 122,
          "comments": [
            {
              "score": 108,
              "content": "*chuckles in Jamaican",
              "id": 123,
              "comments": [
                {
                  "score": 62,
                  "content": "*toasts in Italian",
                  "id": 124,
                  "comments": [
                    {
                      "score": 2,
                      "content": "*santé in French",
                      "id": 125,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 87,
          "content": "*laughes in Scottish 🏴󠁧󠁢󠁳󠁣󠁴󠁿🥃",
          "id": 126,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 84,
          "content": "*Laughs in English",
          "id": 127,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 65,
          "content": "*yodels in Austrian German",
          "id": 128,
          "comments": [
            {
              "score": 19,
              "content": "Da Bayer. As Bindeglied zwischn de Österreicher und Menschm.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 54,
          "content": "*Cries in American English.",
          "id": 130,
          "comments": [
            {
              "score": 1,
              "content": "Right tho",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 54,
          "content": "*laughs in romanian",
          "id": 132,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 50,
          "content": "*laughs in french",
          "id": 133,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 43,
          "content": "*laughs in Brazilian",
          "id": 134,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 39,
          "content": "*Giggles in Mexican",
          "id": 135,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 37,
          "content": "*laughs in Slovenian",
          "id": 136,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 251,
      "content": "NTA NTA NTA NTA!!!\n\nCensorship and heavy restrictions end up reinforcing opposite extremes and create toxic addictive habits. Introducing things that can be dangerous if used irresponsibly in a safe space filled with trust and teaching restraint and responsibility this way is the best way to avoid toxic extremes. \n\nI think you're doing a great job cultivating a close relationship full of trust and showing that you respect your child enough to give them some sort of agency in their decision and equipping them with knowledge. \n\nYour husband can gtfo.",
      "id": 137,
      "comments": [
        {
          "score": 2,
          "content": "Uh... husband?",
          "id": 138,
          "comments": [
            {
              "score": 2,
              "content": "good point. My bad - the father\\*",
              "id": 139,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 216,
      "content": "NTA - your daughter's father is doing the typical American asshole thing of trying impose American laws/customs on others. (Full disclosure: I am American.) \n\nWith that said, it should be noted that alcohol is truly addictive (rather than just habit forming) because it activates the dopinergic mesolimbic projections and damages the frontal lobe to basal ganglia connections. This is especially a problem for people whose brains have not yet finished myelanation, which finishes around 25 years old. As such, teenagers are especially susceptible to alcohol addiction and should be restricted to consumption at levels well bellow what would be safe and responsible for an adult. \n\nOf course, since teenagers are likely to drink whether you \"let\" them or not (as you pointed out), consumption of alcohol under responsible adult supervision is the best damage mitigation option. This is probably why many countries that are more forward and scientific in their policy-making than the USA have laws like yours where drinking is not illegal under adult supervision. \n\n&#x200B;\n\nSo yeah, you are definitely NTA.",
      "id": 140,
      "comments": [
        {
          "score": 29,
          "content": "[deleted]",
          "id": 141,
          "comments": [
            {
              "score": 2,
              "content": "Agreed, this guy is not living within reason and needs to read the country he is in. I do wonder if he had a severely bad interaction with drinking and it turned him against underage drinking. Maybe an accident or seeing a friend die from excessive alcohol. His actions might make more sense then.\n\nI just checked my state's minimums because while I knew Europe had a younger drinking age, I had no idea other states varied so much. I live in a state with absolutely no drinking under 21 unless you are calling EMS for another teen who is in need of medical assistance due to drinking, wild. No drinking until you're 21 was highly pushed on all teens in high school. I remember a police officer/guest speaker coming in to explain how if you are at a party and standing within 6ft of a drink you would be charged with underage drinking, essentially ruining your life according to him. Turned me off of alcohol to the point where having a sit down dinner at home to try my first drink the night before, yes before, I turned 21 was anxiety provoking. Is that a healthy relationship with alcohol? Idk, I never drank more than 2 drinks in one night and have stayed away from other mind altering substances too.\n\nNow I don't drink at all out of choice, very low tolerance and don't like feeling drunk after a few sips, but I'm not offended by other's drinking. As long as they are being responsible about it, not driving or jumping off the roof (a coworker broke her pelvis doing that), it doesn't bother me. I do get excluded from talks about alcohol because people assume I'm a prude about it, had someone apologize for sending me a pic of a fancy drink they made. Its weird the division we make about these things. \n\nI wish we lived in a different state or could reasonably expect to move somewhere that I could comfortably teach my kid that maxing out on alcohol the night you turn 21 is not needed. That there is a way to have a good relationship with alcohol that doesn't include getting sloshed anytime you drink.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "As an American whose mother let us have small amounts of wine and alcohol supervised at home or with dinner together as teenagers, I can absolutely say that it helped us have a very healthy relationship with alcohol (we also have older family members that were alcoholics) and I plan to do the same with my own future children.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "False.  Not wanting teenagers to drink isn't just an \"American Custom,\"  it's friggin common sense.  Alcohol is a terrible blight on the world.  It is am extremely addictive substances that kills more people than most other durgs people try to demonize. \n\nPeople would be responding much differently if she was having her kid do magic mushrooms, and THAT would be leagues safer.",
          "id": 144,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -1,
          "content": "> your daughter's father is doing the typical American asshole thing of trying impose American laws/customs on others.\n\nI mean, if he has joint custody of their daughter, then he should get an opinion how she's raised. OP is NTA for letting her daughter drink in a safe environment, but she should have looped the other parent in on it beforehand. This isn't him trying to impose his will on random strangers, it's him not being comfortable with his own daughter drinking underage, which is something different parents have different mindsets on. It probably exacerbated things that he wasn't informed of it. I have to think OP asked her daughter to lie about it/keep it quiet as well if she's been drinking for a couple years and he didn't know. It's not cool to make unilateral parenting decisions like that without at least telling your coparent.",
          "id": 145,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 169,
      "content": "In the UK, 18 is the age it is legal to *purchase* alcohol. At ~~13~~ 16 you can order a glass of wine with your meal in a restaurant (with your parents). Drinking at home with your parents is legal once you reach the age of 5 (although this is discouraged by doctors).\n\nAmericans have some very strange alcohol-related hangups. In France you can buy beer at McDonald's",
      "id": 146,
      "comments": [
        {
          "score": 29,
          "content": "Not quite true, it's 16 not 13, and you can have a beer or glass of wine!",
          "id": 147,
          "comments": [
            {
              "score": 4,
              "content": "Yeah, I looked it up afterwards. I always thought it was 13 for some reason.",
              "id": 148,
              "comments": [
                {
                  "score": 2,
                  "content": "I think it was changed fairly recently?\n\nI'm 25 but do remember having a pint with my old man with a Sunday dinner in a pub once when I was 14ish",
                  "id": 149,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "[deleted]",
          "id": 150,
          "comments": [
            {
              "score": 15,
              "content": "For drinking age? Yes it is.\n\nThe federal govt strong-armed the states into having the legal age to consume and buy alcohol to 21, by stating that if the states didn't set it to 21, they'd lose a portion of their funding.",
              "id": 151,
              "comments": [
                {
                  "score": 19,
                  "content": "A parent can give their children alcohol before 21 in the majority of states.",
                  "id": 152,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "This was due to the lobbying by Mothers Against Drunk Driving.",
                  "id": 153,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 92,
      "content": "NTA in the US it isn’t illegal for a parent to give their child a alcoholic beverage, so I don’t see what her father is going on about.\n\nEdit: I didn’t realize it varied state to state I apologize for saying the US and not certain states in the US",
      "id": 154,
      "comments": [
        {
          "score": 63,
          "content": "That’s not quite true; it depends on the state. There are about 13 or so that prohibit giving alcohol to any minor, even if it’s your child.",
          "id": 155,
          "comments": [
            {
              "score": 22,
              "content": "I just looked it up and Florida is one that bans minors drinking under parental supervision!  I’m shocked, I would not have called that.",
              "id": 156,
              "comments": [
                {
                  "score": 5,
                  "content": "Yeah, I was once thrown out of a restaurant for taking a sip of my dad's beer when I was 19. We were all very confused.",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Arizonian here, and we have the same law. So shocking, especially in such a red state! /s/",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "Depends on the state.  That said, I doubt that any parent is ever charged with providing alcohol to their own children for the children to drink with the parents.",
          "id": 159,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "I’m not entirely sure about that but do know that the drinking age in the US is 21 so it’s a different mentality.  That being said, letting the kids drink with their parents is definitely a thing and I agree that this teaches some responsibility about it.  As long as they know that either driving or getting into a vehicle with someone who has been drinking is an absolute no and there will be consequences for that stupidity.",
          "id": 160,
          "comments": [
            {
              "score": 12,
              "content": "There are several states where you can order alcoholic beverages for your child at restaurants.\nUS has weird laws.",
              "id": 161,
              "comments": [
                {
                  "score": 2,
                  "content": "Yup, when I was 15i say at a bar in Texas with my mom and she ordered us both beers. The bartender had to give it to her and she to me, but totally legal",
                  "id": 162,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -40,
          "content": "It actually is illegal. Where did you get that information? Not trying to be a jerk but that’s just not true.",
          "id": 163,
          "comments": [
            {
              "score": 29,
              "content": "It's legal in 41 states to provide your children with alcohol. My state you can give your 5 year old alcohol. Obviously if you let the kid get blackout drunk it's a problem for CPS, but a little glass of champagne on new year's eve or wine on Christmas is perfectly legal.",
              "id": 164,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "https://www.washingtonpost.com/news/wonk/wp/2016/05/18/where-teenagers-can-legally-drink-in-the-u-s-yes-really/",
              "id": 165,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "As MANY people have told you, it is not illegal. It depends on state laws. Many states allow people under 21 to drink while accompanied by a parent or guardian.",
              "id": 166,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 55,
      "content": "If this is the UK, which I suspect it is, father will get laughed out of anywhere if he tries to complain about a 17 year old having a quiet drink at home with their mum.\n\nTell him to get tae fuck.",
      "id": 167,
      "comments": [
        {
          "score": 12,
          "content": "same here (austria) and probably many other countries, people would piss themselves laughing at the father's attitude. and then pay the daughter a round of beer. and then laugh some more.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}