{
  "post content": "Throwaway in holes my son doesn’t read this. \n\n I (42F) have two children. Suna (20F) and Jae (25M). I am a widow, and am fortunate enough to have a well paying job as well as my late husbands life insurance. Once my children started working, I have always told them that I wouldn’t ever ask them for rent, as I want them to save up for when they would either move out or if they would want to pursue higher education. We live in a three bed room apartment for roughly $2200 a month. \n\nFor further context, my daughter is a fairly independent person and cooks her own meals, takes care of her own laundry and even helps me around the house with the cleaning. She even gives me about $200 biweekly just to help out. \n\nI cannot say the same for Jae, as I usually have to clean his room and do his laundry because he lets it pile up in the laundry room. As for my meals and Jae’s, I only end up cooking for myself as my son usually eats out or eats at his girlfriends house. \n\nMy son had recently asked if his girlfriend, Anais (23F) would be able to move in, as she’s being evicted due to some issues with her landlord. Anais is a very sweet girl but we don’t interact much as she doesn’t come over too often. Her and Jae have been dating for about a year. \n\nI told him that his girlfriend moving in would undoubtedly change the rule I had set in place about charging rent. This is because as a couple, they’d need to have some set responsibilities, just as they’d have if they would rent a room someplace else or move into an apartment. I told him rent would be $750 a month, how they split it is up to them. I also let him know that they are more than welcome to use any of the groceries I buy, they can even request me to bring certain stuff home when I go to the market, but I will not be cooking for them. I also let him know I would not be cleaning their room nor will I be in charge of doing their laundry. \n\nMy son was enraged and started demanding why I am doing a sudden 180. I told him that he’s a grown man and these are things a couple should find a solution to. I told him that he can either agree to these requests or him and Anais would have to find someplace else to live. \n\nHe hasn’t spoken to me in three days. I understand why he feels like I might be unfair, since I did say I wouldn’t charge him rent, but adding an extra person to the household is an exception to that rule. My daughter understands why her brother is upset but ultimately agrees with me in that I should not be the one to take up what should be their responsibilities.\n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 11036,
      "content": "Definitely NTA. And I would be very, very careful about letting someone move in knowing they had been evicted from the last place.",
      "id": 2,
      "comments": [
        {
          "score": 1994,
          "content": "This. You’ll also need to add them to the lease so your rent will probably go up.",
          "id": 3,
          "comments": [
            {
              "score": 220,
              "content": "[removed]",
              "id": 4,
              "comments": [
                {
                  "score": 16,
                  "content": "Hey cheese did nothing, leave it alone !",
                  "id": 5,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "You leave my cheese outa this! I love me some mature cheddhaaa! 😋 🤤\nLife is always better with extra cheese! 🧀",
                  "id": 6,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 217,
              "content": "I've never heard of this... Where is it that landlords charge by the tenant, and not a flat rate for the unit?",
              "id": 7,
              "comments": [
                {
                  "score": 159,
                  "content": "If someone is being added that has an eviction in their record, I imagine the rent would increase if allowed at all.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 174,
                      "content": "That's...not really how rents or increases work. The landlord couldn't increase the rent in the middle of the lease term. They could potentially try to increase it when it comes time to renew the lease, but they would probably do that anyway periodically.\n\nMore likely they'd just get denied.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "I don't know that a landlord would have much say in this depending on the state. The landlord may want to raise rates, but there are some things called laws that sometimes prevent them from eaking out every crumb of profit they could possibly generate.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Answering as a previous leading agent. The rent would not go up, however, based on the rental history, including the upcoming eviction, and background check...OP could be charged an extra deposit, or the applicant could be denied, and if that happens, OP could be evicted herself if the son moves the gf in anyways.\n\nI say NO GO!! OP is NTA.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Not necessarily does an evicted person raise the rent.. usually landlords need to know how many people live in the rental unit. They are not necessarily financially responsible, but things like water and sewer usage, trash services are all increased for each person in the unit. Some municipalities have occupancy tax or fees.so all residents of legal age must be noted.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 26,
                  "content": "It's common in my experience in utilities included rents. Adding another person increases the cost of utilities so they add on more rent to compensate. Like if you rented a 1 bedroom apartment with utilities included, a single person would be charged less than a couple.",
                  "id": 13,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "I can't speak for everyone but my apartment lease (Vancouver, BC) has a $50 increase for additional tenants added. So when my boyfriend moved in, it increased an additional $50",
                  "id": 14,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "Wear and tear increase as dwellers increase.  This may decrease the value of the property quicker than expected.  Also, most leases have you add the names of the tenants, any change can be a grounds for eviction as you broke the lease.",
                  "id": 15,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "most places in the USA. More people involve more wear and tear on the property. A guest can't stay more than a certain number of consecutive days.",
                  "id": 16,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -2,
                  "content": "[deleted]",
                  "id": 17,
                  "comments": [
                    {
                      "score": 38,
                      "content": "In some places it is. That’s definitely a thing.\n\nSource: am 50 and have lived in *plenty* of apartments",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 26,
                      "content": "It absolutely is based on the number of tenants in some apartments. Before hurling insults, you should make sure you're right.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "Lol ok buddy",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 39,
              "content": "💯 do not let her move in without having them fill out some sort of paperwork. Maybe have a lawyer draw up a sublease or some sort if agreement.",
              "id": 21,
              "comments": [
                {
                  "score": 33,
                  "content": "I would not let them move in at all.  The son is 25 and wants a live-in relationship with GF.  That's fine, but they need to find an apartment and live independently from OP.  Wanting to live together means they need to manage their lives like grown ass adults, not co-habitating at mom's.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "this depends on the landlord/management company’s policies. i’m an LC and our management company doesn’t up rent; we just require an application, $50 for the app, and run the new occupant through a background check (if they are 18 or over).",
              "id": 23,
              "comments": [
                {
                  "score": 7,
                  "content": "Which would exclude this Anais person because she has been evicted for a reason.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 824,
          "content": "Yeah... \"trouble with the landlord\" can mean a lot of things.",
          "id": 25,
          "comments": [
            {
              "score": 525,
              "content": "Eeek.  I had trouble with a landlord once and was evicted.  It turns out that I had done absolutely nothing wrong at all.  I was married, my husband and I were both students and decided to live separately for the year to be closer to our respective campuses in our enormous city.  We'd hang out, do regular quiet student stuff, and occasionally socialise with other people in our homes.  One of my flatmates and one of his friends met, started dating, and it ended badly so my flatmate told our 81 year old landlord, who lived in another state around 4000km away, lots of wild stories.  She'd have conversations with him for four hours or more several times a week.  Somehow another flatmate thought I was a prostitute and having random men visit my bedroom all the time.  The only person entering my bedroom was my husband while we studied together, and on one occasion he stayed for a week while I was very sick and he was taking care of me.  Being the racist little SOB the flatmate was, he didn't realise that all the different men he was seeing were simply my husband wearing a different shirt each time he visited.  The SOB was Chinese, my husband Taiwanese.  Bad blood from China, Taiwanese dude just kept to himself due to prior horrible racist attacks.\n\nWhat the actual fuck.\n\nSo now I have an eviction on my record.\n\nThe couple that dated, that was a massive fireworks display of failure.  The guy was decent, my flatmate not so much.  She ended up stalking and assaulting him at a different house, and was arrested.  She does not have an eviction on her record.\n\nFuck student living.  Fuck it right in the ear.",
              "id": 26,
              "comments": [
                {
                  "score": 214,
                  "content": "My husband and I got an eviction notice handed to us because our landlord wanted our home for his daughter. Fuck landlords right in the ear.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 71,
                      "content": "That happens all the time here now.  There's a difference between a lease not being renewed and an eviction here.  Any new rental you apply for has a form where you're supposed to tick a box indicating whether or not you've ever been evicted before.  No box to explain why.  It's an automatic rejection if you say yes.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "My disabled son and I were evicted in mid winter because our batshit landlady thought we were using too much water.\n\nSpoiler, we weren’t and she did the same thing to previous tenants. Now she’s not allowed to rent that space because she didn’t pay taxes on her earnings and didn’t get any permits when she remodeled the basement. \n\nToo bad. So sad. Ya messed with the wrong person, Anne",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "Uhhh was it an actual eduction? As in, ordered by a court and enforced by a sheriff? \n\nOr was this more of the run of the mill “time to move out we want the house back” letters?",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -8,
                      "content": "That's a pretty legit reason to end a lease?  Family needs the space.  And it wasn't your home, it was your rental.  Getting possessive over something you never owned isn't very rational.",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -10,
                      "content": "God forbid he help out his own children.\n\nMoving family into a property, to me, is one of the legit reasons for a change in who lives there.",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -10,
                      "content": "Sorry but this in one of the few exemptions for landlords to regain possession were I live and it actually makes sense to me. Sorry you had to relocate but your landlord hate is misplaced",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -24,
                      "content": "Maybe I'm wrong but isn't it the landlord's place and they can put who they want in the house?",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 150,
                  "content": "Okay, that was a wild ride. Damn.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 14,
                      "content": "For real!! 😳",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 45,
                  "content": "so an actual prostitute just needs to have the johns wear the same shirt and therefore they are the same guy?",
                  "id": 37,
                  "comments": [
                    {
                      "score": 19,
                      "content": "ok i skipped the comment above because it was long but i'm gonna scroll back up and read it",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -3,
                      "content": "I hadn't thought of that.  Not my style.\n\nI guess the sexworker (not prostitute, dawg) would leave a shirt in the letterbox for them to scratch themselves into before ringing the doorbell or something, then put it back on their way out?  Damn, I hope they don't get that mixed up and be accidentally mistaken for a studious husband.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 40,
                  "content": "Just an fyi, if a tenant gives me a long, rambling story about a bunch of crazy circumstances where they are always misunderstood and people are out to get them, it's a red flag.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Yeah, I'm not a landlord, and I'm side-eyeing that story. I'm in the US where cross-racial identification is definitely an issue, but I wouldn't buy that a Chinese person thought one Taiwanese person was a different person every time because of his clothing.",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "It sure was an adventure.",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "Yeah student living is nuts, sorry you went through that! \n\nWhen I was a student I lived in housing that was owned by a slumlord property management company that rented out shitty housing to students. They sent us maybe 5 eviction notices because the house next door kept throwing these massive parties, and for some reason they thought we were the ones throwing the parties. I mean we went to them lol, but we sure as hell weren’t throwing them. I finally contacted my school’s student legal help who called the management company. Idk what they said but the management company apologized and stopped sending us notices. \n\nIf anyone is experiencing this kind of stuff as a student currently, I highly recommend asking around your school for resources!",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 77,
              "content": "Depending on where they live it could not be her fault at all. Australia is in the middle of a nation wide housing crisis with rent increases of anywhere between 30% and 150% are becoming common. Her landlord issues could be pure greed.",
              "id": 44,
              "comments": [
                {
                  "score": 27,
                  "content": "Wouldn't they just say she can't afford her rent anymore if that were the case though",
                  "id": 45,
                  "comments": [
                    {
                      "score": 16,
                      "content": "If the landlord is an asshole and has done other small things to harass her (I’m thinking more annoying shit than illegal shit), then I can see someone describing it as “landlord issues” because the landlord is the issue, on the whole.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "Pure greed.... like expecting to live with your boyfriends family for free? I realize that entitled and not greed, but come on, nothing is free.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 59,
                      "content": "We have no idea what the gf expects. We only have what OP said and their sons reaction to this.",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 41,
                      "content": "Yeah, he’s 25. Time to grow up.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "It's not landlord greed, it's a supply problem. Most of these housing crisis is due to high demand with low supply and thus people with the means are offering to pay more to secure apartments. Why the hell would any landlord not take the best deal they are offered?\n\nIf they list a property for X a month and then are deluged with offers, then they have massively underpriced the apartment. If some of those offers are for 1.5 to 2 times the listed price, is it greed to want to take those offers or just good business sense? The most desirable apartments will always fetch top dollar because there will always be someone well off enough to offer above listing.",
                  "id": 50,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "I mean... living with a leech in control of your home is what I'd class as trouble lmao",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "And none of them good",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "No it doesn’t, it just means “I didn’t follow the rules and was a horrible tenant” because anyone who WASNT says “i had a horrible landlord that did xyz and now I really need a new place to live I just can’t stay there again.” “Trouble with the landlord” is niceties for “I sucked and they threw me out”. Especially a young girl, they’re vocal when wronged lol",
              "id": 53,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 0,
              "content": "Usually means they weren’t paying their rent, which explains why son blew up about them having to pay it.",
              "id": 54,
              "comments": [
                {
                  "score": 8,
                  "content": "Could also be any number of things that aren't her fault - landlords are perfectly capable of being AHs without provocation, like anyone else.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Frequently, in fact!",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -2,
              "content": "People will only tell you the landlords bad bit and never anything they did wrong. 100 percent his gf was probably not honest as to why she got evicted.",
              "id": 57,
              "comments": [
                {
                  "score": 6,
                  "content": "Either is possible, tbh.",
                  "id": 58,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 226,
          "content": "NTA. However, you did help create this monster by still doing son's laundry & room cleaning. You should have stopped long ago. Son is being an entitled jerk, and is waiting for you to fold. If he does \"accept\" your offer, you need to sit down nothe him & his gf and lay it all out. GF needs to know what's going on too.",
          "id": 59,
          "comments": [
            {
              "score": 112,
              "content": "I’m going to go the next step and say YTA for reinforcing unfair patriarchal standards for both your kids.    \nApologize to your daughter.  Require your son to maintain his own space and clothing, or he will put it on his girlfriend and maybe end up single.",
              "id": 60,
              "comments": [
                {
                  "score": 16,
                  "content": "Exactly. Better said than me.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -6,
                  "content": "I’m sure if her daughter didn’t clean her own room and laundry, mom would do it for her too. It’s just that females are cleaner and it’s no surprise to me that the daughter would take it upon herself. Dudes are the opposite, if he actually had his own place it would be just as messy without a doubt. The mom doing his laundry and cleaning up after him is just her wanting a clean house. Now that he wants his girlfriend to move in, she doesn’t want to do that stuff for him anymore bc she’ll have to decipher what’s his and what’s hers and she shouldn’t have to do that. She has every right to put up boundaries with someone who isn’t her child. And if he wants to let another person into the house with his family there’s no reason they shouldn’t pay rent and clean up after themselves. In my opinion OP is NTA, I wish I had a parent who could charge me just a fraction of the rent and let me move my SO in.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 14,
                      "content": "There's absolutely zero evidence that women are somehow, magically, naturally cleaner than men. They're just socialized to be cleaner and often raised to believe it's their responsibility to take care of their environment. \n\nGirls are praised for being calm, clean, and tidy while boys get approving chuckles and \"boys will be boys\" comments as they run through the mud and throw toys everywhere. Girls are given dollhouses and encouraged to go help mom in the kitchen, while boys are given sports equipment and told to play outside. In traditional households, girls are raised to cook, clean, and do laundry every day, while boys' chores are mowing the lawn once a week and taking out the trash occasionally.\n\nIf the daughter can take care of herself and the son can't, it's most likely due to the way they were raised.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Don’t call women females “dude”",
                      "id": 64,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "Also OP needs to be able to evict them when she becomes pregnant and they expect OP to watch the baby.\n\nNTA",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "Umm.. op is definitely an asshole for enabling her son to the point he refuses to clean or do his own laundry at 25.",
          "id": 66,
          "comments": [
            {
              "score": 2,
              "content": "Amen!",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Yeah, and it can be a giant hassle evicting someone you've allowed to move into your home. Like even if it's \"just a place to stay awhile\", if they receive mail there, it's a legal residence, and legalities apply. You can't just kick them out without jumping through several legal hoops. I've heard so many nightmare stories, including my wife being forced to allow her abusive ex to live with her (she was staying with her mother at the time). Fortunately, hotter heads prevailed and the guy ended up getting beaten pretty badly by my now BIL and never tried stepping foot in the property again without permission. He's currently a crackhead deadbeat dad and will hopefully be in jail or dead soon.",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "This. My brother had a GF like this. Except I don't think she ever really asked to move in, she just kinda *stopped leaving*. She always gave me terrible vibes. Turns out she was a raging (raging!) alcoholic. They found out when they found their two alcohol cupboards empty. She'd gone through about 40 bottles of spirits in about 8 weeks. She was tiny too, so she'd obviously built up quite the tolerance. Couldn't (wouldn't) kick her out either, cause obviously she had nowhere else to go.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Listen to this OP. There are justifiable reasons why owners evict their tenants.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Yup.  There's a reason most landlords won't rent to someone with an eviction on their record, especially a recent one.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "Yeah, sure on Reddit we hear horror stories about landlords, but that is usually the vast minority of cases. If you are getting evicted over \"issues with landlord\", you probably fucked up, but not in a \"I didn't pay\" sort of way. Or somebody is lying about the reasons, which is also not good.",
          "id": 72,
          "comments": [
            {
              "score": 22,
              "content": "This is the landlordiest reply I've seen in a while",
              "id": 73,
              "comments": [
                {
                  "score": 0,
                  "content": "Not really. I'm not a landlord, but I've had enough experiences on the other side that people usually get evicted for1 of 2 reasons. Not paying or completely fucking shit up in a place. Doesn't sound like a pay issue based on what the son said (could be since he balked at how he would have to pay rent now), but more like a violated lease issue (got a pet, had friends overnight that were not supposed to be, broke things in the house, made a mess of the place, etc.)",
                  "id": 74,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3770,
      "content": "NTA you should have stopped doing his laundry a long time ago. His dirty underwear can pile up in his room (which he also should have been cleaning himself for a long time) for all you should care. It sounds as though he has no idea of how to adult, at 25. That's bad news for Anais. You'd be doing her a big favour by giving her an unblemished view of how well he can take care of himself and things, which she probably isn't getting currently. You shouldn't do it for free though, and stick to your decision.",
      "id": 75,
      "comments": [
        {
          "score": 1237,
          "content": "Ps I would also notify him that if he continues to show you disrespect, he can be out by the end of the month. Shape up or ship out, ain't nobody got time for tantrums from a 25 year old!",
          "id": 76,
          "comments": [
            {
              "score": 446,
              "content": "Sounds like OP has a 15 yr old with 10 years experience.",
              "id": 77,
              "comments": [
                {
                  "score": 101,
                  "content": "Nah. My 15 year old knows how to do their own laundry and clean up after themself.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Which is great, but one of the things about kids in their mid-teens is that they are simultaneously convinced that their parents owe it to them to continue doing things for them, and that the world should recognize that they are great big grown-ups now who deserve freedom and self-determination (funded by their parents). They don't consciously believe that, but a kid who doesn't display that assumption in one way or another is unusual indeed. It's normal for them to feel that way, because they are at a strange in-between stage, but apparently there is now a 25 year old man who feels that way.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "It blows my mind than fully grown adults don't know how to do their own laundry and such. My 13 yr old has been doing his own laundry for years. It's seriously one of the easiest chores for a kid to learn, especially if you have front load machines so height isn't an issue.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Slightly OT, but I really wish my parents had encouraged this sort of behaviour and asked us kids to do chores around the house, but nah, I literally had to fight for the right to do that when I visit, even when I've lived alone for a long time now. My older brother still lets our mother do everything for him when he visits.\n\nSome narcissistic parents will purposefully infanitilize their children to make them dependent on the parent. I was fully and far into adulthood, and my mother would still get mad at me if I didn't let her do my laundry and change my sheets. It was gross.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": "Nice one. I'll borrow it if I may.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "I think OP was being very generous in offering to take care of the groceries. And smart to call the son out.\n\nIf he wants to live as OP's kid still, saving up for adult life, that's one thing. But if he's jumping into adult life by becoming head of a household himself, then he has to stop living as OP's dependent.\n\nKids don't get to live with their girlfriends. Adults do. Son has to pick which one he wants to be.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Word",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 135,
          "content": "This, I was doing my own washing in high school",
          "id": 85,
          "comments": [
            {
              "score": 70,
              "content": "I started at 12",
              "id": 86,
              "comments": [
                {
                  "score": 32,
                  "content": "I started at 8",
                  "id": 87,
                  "comments": [
                    {
                      "score": 130,
                      "content": "I was a fetus when I started",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 48,
                      "content": "When I was 8 I boiled and starched my own linens, and then started work full time as a laundress.",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "My mom got a stool bcs I was too small to reach the knobs or inside the machine",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "Agreed with this as NTA but I’m gonna say, even after I moved out and my mom would come over she would take care of my laundry and tidy my apartment even after I told her she didn’t need to. It did work work out mainly for her because I lived close to her work and she would come over on her lunch breaks, make something for herself and take a nap. I miss that amazing woman. When I did live with her after she divorced my dad I would gladly pay her rent and help with food and other things even if she didn’t ask.",
          "id": 91,
          "comments": [
            {
              "score": 37,
              "content": "My Mum is like this, I go to the toilet and when I come back she is cleaning the oven 🙄😅 bit as she says I am her baby and a single Mum who works full time, she wants to help when she can so I usually set a side some simple jobs, not the oven as she is getting on now.",
              "id": 92,
              "comments": [
                {
                  "score": 14,
                  "content": "I’m the oldest and have raised children of my own, but my 75-year-old mother doesn’t know how to not help. She comes over and starts on some project. I now keep a couple small things ready for her—like mending, so at least she’ll sit down for a moment. Love that woman.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "It seems to be a mum thing. My mum recently visited me (I am living abroad) and I told her I had been working OT to take time off when she was here so the place was a bit of a mess and she offered to clean.\n\nMy nan always cleans the oven when she visits my mum too, that woman loves to clean ovens",
                  "id": 94,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "Since rent is one of life’s biggest expenses, you shouldn’t really let them not get used to that expense.",
          "id": 95,
          "comments": [
            {
              "score": 2,
              "content": "I like the idea of having them pay into a savings or investment account.  That way you are helping them save toward home ownership, or at least first/last rent, but also they get used to living in a normal budget.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "Anais seems not to have figured out adulting either with getting evicted.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Agree. 25 years is plenty long enough to \"parent\" this child.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Yep!  Son should have been handling his own stuff long ago.  Son’s attitude can be directly traced to mom coddling him.  I hope this clarifies things for her and she can do a course correction to force her son to grow up.",
          "id": 99,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1980,
      "content": "NTA. \n\nBut stop enabling him. Stop cleaning for him. If he can’t keep it clean and you don’t like that, then he needs to move out. \n\nHe’s 22. Stop babying him. \n\nThe entire reason he’s mad is because you’ve spent his entire life coddling him and cleaning up after him.",
      "id": 100,
      "comments": [
        {
          "score": 772,
          "content": "Yes to all of this, except he's not 22, he's 25. She should have stopped cleaning his room 15 years ago at least and stopped doing his laundry at the very least when he became an adult. If he leaves piles of laundry in the laundry room, he should be told that that's not how adults behave and to stop doing that or he'll have to leave. \n\nI don't want to blame OP for how he's turning out, but she's at least partly to blame. The good news is he does have time to learn to be an adult, but if she doesn't do anything soon, there'll be no hope and he'll be a useless adult forever.",
          "id": 101,
          "comments": [
            {
              "score": 643,
              "content": "I kinda do want to partly blame OP. 20-yr-old daughter takes care of herself as an adult. 25-yr-old son doesn't. Maybe I'm reading too much into this, but it seems likely the daughter has been raised to think that's her job, and son has been raised to think it's a woman's job to look after him :/",
              "id": 102,
              "comments": [
                {
                  "score": 176,
                  "content": "I totally feel you. I think the only reason I'm only partly assigning blame to op is she lost her husband and I'm sure sometimes when you're raising two kids alone you do what you can do. But he's an adult now, and it's way past the time that he should learn to take care of himself.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Agree with this. Also, it may have affected the kids differently when their dad died, depending on their ages. They have to find a new normal pretty quickly, and it can be easy to miss developmentally-appropriate milestones when the shit's piling up. I'm inclined to give OP a pass too, but it's time to cut the strings",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 76,
                  "content": "There's a chance the kids were BOTH raised the same way, but the daughter saw the burden on her mother, whereas the son didn't.\n\nSome people will just continue to take advantage, whereas others would hate doing that.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "💯",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I'd cut her some slack on it (even if continuing to clean and do the laundry for him so long certainly didn't help): at this age, lots of women I knew wanted to be independent and self-sufficing while lots of boys still basked in momma's care. Maybe because we women are infantilized enough as it is on a daily basis, we want to act sooner like adults? And if all your friends find it normal to clean for yourself, you'll start to think so too. If on the contrary your friend's laundry and meals are still handled by their moms, you won't find it weird if yours still do it too.",
                  "id": 107,
                  "comments": [
                    {
                      "score": 41,
                      "content": "Teenage girls do more housework than teenage boys on average and we as a society expect and enable it.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Yeah, it's also cultural. Like there's a 9-year old boy living in a village in Siberia, chopping wood and helping his mom clean fish so the family has dinner. If a man is acting entitled about chores I'll send them this video with the exact timestamp: https://youtu.be/lj5GXZaE7qs?si=k8ejgwTLXo-mlEld (12:07)",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I’m with you. I don’t think OP is an asshole for wanting to establish rules for a new tenant/roommate. But they’ve done their son a huge disservice for not having established similar rules before this.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "That's what I got from this, it's a big ick.  Imagine dating someone who doesn't do their own laundry or clean their own bedroom...",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Its sadly not unusual for parents to raise their kids with stereotypical gender roles which includes the expected household chores aka women do the cooking, cleaning, laundry etc. Not accusing OP of this but its a bit suspicious if you look at the difference with her daughter especially if you consider that the daughter is even younger and that OP is still cleaning his room and doing his laundry, there is no need for him to learn those things if his mother keeps doing it for him",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Partly? The son has been an adult for 7 years.\n\nEven if he went to college, he would have been out of college for 3 years. \n\nOP screwed up by not setting milestones long before now. A long checklist of things he had to do or otherwise pay rent. No rent, you're out.",
                  "id": 113,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "I think he's lazy & OP has enabled this and just picked up after him, at 25 it won't take long for him to learn to look after himself, she says her daughter is independent & has given OP her take on this which is reasonable too.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Agree.  People have blasted me for years that I would charge one of my children 200 a month for rent once they become adults and are finished with school. This includes college by the way. As long as you're in school I will provide what I can for you. After school get a job and pay rent.  The rent keeps me from having irresponsible adults living in my house but is cheap enough that they can also save money I've always had that rule to prevent this from happening. There's no reason why a25 year old in the workforce is living for free while mommy takes care of him. That's ridiculous.  Oh and I discussed this with my children while they were in high school so they knew the expectations when they became adults.",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Agreed. And it’s a disservice to his current and future love interests. Trust me. I married that man once upon a time, and he’d like to say “stop acting like my mom” and I’d respond with “then stop acting like a child.”",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "This ☝️ 💯",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "Yeah holy crap, enabling is definitely the right word. No wonder he threw a tantrum when he was faced with the possibility of having to look after himself lol.",
          "id": 118,
          "comments": [
            {
              "score": 24,
              "content": "Yep, OP is definitely reaping what she sowed.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "And looking at the way her daughter reacts vs her son, i feel like he’s been treated differently his whole life.\n\nBetcha she was doing her own chores long before. \n\nMany parents treat their sons differently even when they don’t realize it. And when they see the repercussions, they act surprised.",
          "id": 120,
          "comments": [
            {
              "score": 11,
              "content": "Big time ✨ Boy Mom™ ✨ golden child vibes. ESH -- him for his entitlement and behavior, OP for enabling him while able to see how a 20-something living at home should act.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Exactly, everyone's in here yelling \"hahaha man he has no idea how to be an adult lol\" and like, *of course he doesn't*!  He's not blameless here but also *some*one needed to teach him *some*thing at *some* point.",
          "id": 122,
          "comments": [
            {
              "score": 2,
              "content": "Right?! I often wonder if my teens should know how to do more so that they ready when they leave home in a year or two. \n\nPosts like this make me feel better. And since one did all the laundry in the house yesterday and the other made dinner, I guess I’m doing okay and can rest assured they won’t end up like this dude (not that I was actually worried about this extreme!) lol",
              "id": 123,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "> He’s 22. Stop babying him.\n\n25\\. That child is 25 years old.",
          "id": 124,
          "comments": [
            {
              "score": 3,
              "content": "I know. I was corrected earlier. That just makes it even worse.",
              "id": 125,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 785,
      "content": "NTA - but why isn't a 25 year old paying rent - and doing his own laundry???",
      "id": 126,
      "comments": [
        {
          "score": 538,
          "content": "Him not paying rent is up to OP. But he can't do his own basic chores???",
          "id": 127,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 248,
          "content": "[deleted]",
          "id": 128,
          "comments": [
            {
              "score": 115,
              "content": "Same here.\n\nHowever I do think doing some chores is fair game, considering they are living there. Or, at least clean up for themselves (and I am saying this is the lowest bar).",
              "id": 129,
              "comments": [
                {
                  "score": 34,
                  "content": "[deleted]",
                  "id": 130,
                  "comments": [
                    {
                      "score": 2,
                      "content": "In many places people don’t consider parenting a burden, people are happy to provide for their kids.\n\nEspecially in countries where wages are low compared to cost of living and children have to save their full paycheck for over a decade to afford a downpayment.\n\nI know this is a new thing for the US, but that’s the way its always been in other countries.",
                      "id": 131,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Besides parents who usually want their children to move out and have their own home don’t usually charge rent..",
              "id": 132,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "My parents charged every one of their kids a small amount of rent for any time spent living home after 18 but not going to school.\n\nThe thing is, they put it in an account and returned all of the money plus interest when we moved out for good (so they were trying to train us on paying rent and/or saving some of our money, not just charging rent).\n\nThe son is the story is learning nothing by having everything taken care of for him.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I see it as less \"adult child should be paying rent\" than \"adult child should be contributing toward the household\" in SOME way. He's giving nothing - if it isn't rent, than he should be pitching in with groceries and caring for the household through chores. \n\nMom, you've got a critical failure to launch and while you bear some responsibility here, good for  you for finally taking steps in the right direction. Tell son your 180 is because he's reached a quarter century and is still acting like he's 5 years old.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 80,
          "content": "Ikr if you're still living with your parents the least you can do is do your own laundry or do the dishes.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "I can see why laundry would be washed together in the family. It is just more efficient to throw everything together once the washing machine is full with a certain type of laundry, rather than everybody washing their own stuff in a half-filled machine.\n\nThat still does not explain why he would not take part in the common effort.",
          "id": 136,
          "comments": [
            {
              "score": 44,
              "content": "Because he doesn't have to and faces no repercussions for being lazy.\n\nHe is now finding out there will be repercussions and his partner will cop them too, where he might have painted a picture of a free B&B to his partner. Probably knowing she will not be his maid. So he is suddenly faced with being an adult.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I do each person's laundry separate. It usually fills the machine--two or three times over, sometimes, in my husband's case. I don't do sheets and/or towels separate though, just throw them in whatever hamper is going to the washing machine next.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "At the LEAST the son could politely ask Mom to do his laundry - maybe she will maybe she won’t her choice - but to dump it and walk away? Entitled",
              "id": 139,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "and cleaning his own room?!?",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "In OP's case I get it, but it feels insane to me that people will charge their children rent under normal circumstances.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 430,
      "content": "NTA, don’t let her move in.  I can see the big red flags already.  You should also tell him that his maid is retiring forthwith, and start charging him rent!  Your son will only get worse with age, just like the smell of cheese.",
      "id": 142,
      "comments": [
        {
          "score": 124,
          "content": "Yep. His reaction was a red flag. He was expecting the free accommodation, meals and cleaning to continue. \n\nNTA.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 237,
      "content": "NTA- For saying you'd charge rent but maybe for allowing a 25yo capable grown man to live at home and think being mothered how you do is actually acceptable or even normal.   \nThere's no way.   \nI mean an adult who's not capable sure but unless you left out a disability or something this is insane and he needs to learn to be an independent adult.",
      "id": 144,
      "comments": [
        {
          "score": 53,
          "content": "In some cultures, especially South Asia they don’t encourage children to move out before marriage. Parents like to keep you around as long as possible, and sometimes see their kids living alone as shameful if they aren’t married. I had to “run away” at the big age of 21 just to have some independence and peace of mind lol. And my parents are typically progressive for my country. It’s just not as big of a deal to live at home.  \n\nThat being said, OP’s son should do more chores and lift some weight around the house. He is being babied.",
          "id": 145,
          "comments": [
            {
              "score": 2,
              "content": "Been through the same. I just left with everything. Now I live in a house with my fiance and my dog. 🤣 I'm 22 and the only one without debt or financial problems.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 192,
      "content": "Seriously?\n\nYou are N T A for demanding that your son grows up.\n\nBUT \n\nYTA for waiting all those years and basically now drop cleaning responsibilities on him, because now he has a gf to clean for him and do his laundry. \n\nYou, lady, are sexist. You raised your kids in a sexist way.\n\n-The daughter of course learned how to clean up after herself, \n- Son not so much and you still did the laundry for a 25 yo\n\nThat poor girlfriend will have to do all the cleaning and cooking because you raised a son who cannot adult.",
      "id": 147,
      "comments": [
        {
          "score": 120,
          "content": "I don't see why this isn't an element in more comments. She's not stopping because she wants him to grow up, she's stopping doing these things because he now has a different woman to do them for him. The gendered aspect of this is so obvious. Her daughter wasn't \"more independent\" but more was expected of her. She's babied this man and now is handing him off to another woman to baby. The only thing he's being asked to do is pay rent, she's clearly expecting the girlfriend to do the chores.",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "Not only this, but accepting rent money from the 20 yo daughter while the 25 yo lives rent free? That is not okay! Definitely YTA, not for asking the son for rent, but for everything else!!",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "YES! this is exactly why I was so turned off about this post. OP needs to get it together and finish actually raising her son to be a full capable adult. The person I mainly feel sorry for is the daughter, I bet she's done her brother's laundry also and cleaned his mess. Girlfriend should NOT be moving in and the son needs to stop throwing a temper tantrum.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Complete YTA for all the reasons above. Your son is an incompetent, inconsiderate, jerk and you raised him that way.",
          "id": 151,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 129,
      "content": "NTA. You're right, he is a grown man. It's shameful that he still needs his Mother to clean his room and clothes.",
      "id": 152,
      "comments": [
        {
          "score": 28,
          "content": "It’s shameful that she does it for him.",
          "id": 153,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "If only somebody had raised him better. His mother, perhaps. OP YTA for failing to raise your son and assuming his gf would take over for you",
          "id": 154,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 110,
      "content": "NTA! Your son is a grown ass man, you clearly have been coddling him a bit too much by cleaning his room, doing his laundry, cooking for him etc, and honestly he’s upset because it sounds like he was raised to feel entitled. \n\nI can’t help but notice the gender divide between the two as well, and it makes me think that you raised your son to think that as the first born/male everyone else would take care of him, but your daughter had to learn that she had to take care of herself. \n\nI know that you can’t go back and reraise your son to be a better person, but it’s way past time that he learns that lesson. Honestly, you should make them pay rent and let him know that in a year, he will be expected to move out and start life on his own. That poor gf though is going to be in a terrible place when he inevitably starts trying to force her to do all the things you have been doing.",
      "id": 155,
      "comments": [
        {
          "score": 5,
          "content": "Exactly this",
          "id": 156,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 94,
      "content": "Ma'am your son is a spoiled brat. \n\nWhy are having to clean up a 25 year old man's bedroom and doing his laundry? Let his room get messy and let his laundry pile up and suffer the consequences of a disgusting room and no clean clothes to wear.\n\nBy the time I reached double digits, 10 years old, I was expected to keep my room clean or face a long ass lecture about cleanliness. That was enough to keep my room clean. The only time my mom has done my laundry as an adult is when I've been too sick to get out of bed and it was a kindness to her sick daughter. \n\nYou're NTA over this situation with the conditions you've put on for his girlfriend moving in. Y T A over how you've been babying Jae who again is a grown ass man. He should be embarrassed that mommy still cleans his room. He's literally throwing a childish tantrum because he isn't getting rent free housing with a built in maid and chef.",
      "id": 157,
      "comments": [
        {
          "score": -7,
          "content": "I look after my teenager as they have long covid but I still clean their room. We've had a few rows but the ground rules are clean home and easy access of you can't do it then it still needs doing. I get them to help with what they can. It's difficult sometimes to break a habit and I hope they will help more as they get better.",
          "id": 158,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}