{
  "post content": "Throwaway because reasons...My boyfriend (40M) and I (33F) have been together for five years and are trying to organize our next holiday. He's settled on a destination and so excited at the idea of a family trip. We're looking at flights that will likely be at least 9 hours long with business class flights, resort stay, and plenty of experiences. He makes significantly more than me but we will split the cost of the holiday 50/50 including my child's costs.\n\nThe problem is he does not want to let my child (13) on to the same class on the plane as us.He thinks that my child should be grateful to be getting an international trip and just enjoy the movies and whatever other amenities there are on the flight. That they can pop up and visit us whenever in business class and that it's not worth the extra cost, even if he were a millionaire.\n\nI feel like it's weird to sit apart from my child for a 9+ hour flight, even if they're comfortable enough on a plane and I'd probably prefer to downgrade my flight if bf is unwilling to split that specific cost.He thinks I'm being weird for wanting to make that concession and it's not a big deal for child to fly alone.\n\nSo, WIBTA or am I being a helicopter and stressing over something silly?\n\nEdit To Add: Just as a further explanation for why he's against it.   \nHe has a view where children might not appreciate the value of business class and that his parents went on business class while he flew economy on his own.\n\nHe absolutely wants to enjoy the business class for himself for the long haul on a nice plane. He's fine with me sitting in economy also or bumping up my child at my own cost, even though he disagrees morally and thinks I'm being kind of silly, he would accept it.\n\nHe has spent plenty of money and time on my child, for birthdays, events and milestones. They get along well and have had very few upsets. Every now and then I've had to stick up for one or the other but I feel like that's to be expected with blended families.",
  "id": 1,
  "comments": [
    {
      "score": 25772,
      "content": "YTA. So we already know he doesn't like your kid, what other huge red flags are you ignoring with this guy?",
      "id": 2,
      "comments": [
        {
          "score": 6803,
          "content": "I do wonder about these step dads. Do they stay in the relationship because they can’t live without the mother or is it because they see a woman who is weak and needy and he knows they will allow him to abuse their kids to make himself feel superior?",
          "id": 3,
          "comments": [
            {
              "score": 2531,
              "content": "A lot of my single girlfriends are dating men with kids even tho they don’t want/like children. They only see them when the kids are with their moms. It’s playing with fire because they don’t want to be a step mom or even meet the kid but they keep continuing to date the guy and get serious. \n\nSo they are building a relationship with these men seeing the kids as something that they can avoid. I think when couples get serious they continue to act like the child is something to get over.",
              "id": 4,
              "comments": [
                {
                  "score": 1114,
                  "content": "The parent needs to realize that if they marry someone like this and something like death occurs this adult who doesn’t want kids might end up caring for the kid.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 916,
                      "content": "There is a reason that there is the trope of the evil stepparent in fairy tales and folk lore.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 483,
                      "content": "This is going to sound nuts, but it actually happened. My mom knew someone who had a step dad who put all the kids up for adoption when the mom died at a young age. Luckily for them, their aunt took them all in.   \n\n\nBut I was so shocked. Like HOW can you do that? This was in Canada and it wasn't like the guy was poor, he just didn't want to deal with them. And the best part of the story was he tried reconnecting, they all refused and he acted like the victim.   \n\n\nAnd when he found out (small community), one of the girls was getting married he freaked out that she wouldn't invite him.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 605,
                  "content": "They should expect the unexpected! If something happens to the mother, those guys will most likely end up as full time dads. \n\nOp YTA for even considering it, and he's a giant gaping AH for suggesting it. \n\nWhat happens if, or more likely when, there is turbulence, and everyone has to remain seated. You'll leave him to be someone else's responsibility then? \n\nAnd no kids can't just wander up and down into first class. Normally there's a premium area inbetween. On Virgin flights we've been on another floor! They are pretty strict about who they let in to first class. \n\nWhat'll be the next thing he won't be rich enough to appreciate? If you agree to this what's to stop it seeping into every day life?",
                  "id": 8,
                  "comments": [
                    {
                      "score": 403,
                      "content": "Or what happens if, God forbid, they are seated next to a creepy creepster who tries to pull something shady on an unaccompanied minor? Shudder. YTA for even considering leaving your child to fend for themselves while you & boyfriend sip champagne in Business Class.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 302,
                      "content": "And if something happens to you on the trip,  such as illness, broken bone, etc, he will be the adult responsible for your child in a foreign country. This guy is a mistake you are making because he offers perks like trips.  Better to be with a regular,  every day guy who embraces both you and your child. Do not even consider this trip. Next, he will have your child eating, sleeping, touring unsupervised in a foreign country.  Red flags. Cancel the trip and the relationship.  Your first obligation is to your child, not your romantic interest.\nEdit: typo",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": ">They should expect the unexpected! If something happens to the mother, those guys will most likely end up as full time dads.\n\nI'm literally living that reality. I adopted my step-son shortly after my daughter was born, in case something happened to my wife. \n\n&#x200B;\n\nWell, something happened to my wife. Apparently, her parents and family didn't know (because we barely talked to them) I adopted my step-son, so they were planning on taking custody of him when my wife died. Fortunately, I adopted him, so they couldn't do anything legally.\n\n&#x200B;\n\nNow I have in tutoring for Dyslexia and getting him help with his Autism, something my former in-laws did not do with my late wife's autism.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 333,
                  "content": "There was a post this week because the dad left his daughters in OP’s house and they went through her closet and wore her shoes and clothes. She doesn’t want the kids in her place at all, but she won’t break up because she LOVES him so much!!! Too bad her bf doesn’t love his kids as much! And the other where OP was child free and didn’t want bf’s 4 year old. Then the mother married a man who was also child free and no one wanted that poor little girl just because her parents married assholes.\n\nChildren always come first!!! Always!!",
                  "id": 12,
                  "comments": [
                    {
                      "score": 132,
                      "content": "Christ, I am positive I couldn't be with someone who didn't adore my cats, never mind someone who actively disliked my children.\n\nReally don't understand this mindset, being a single parent sucks, I totally get that. But parents willingly allow other adults to move in and marginalise their kids (who arent adults and dont have the luxury of just choosing a different family) and justify it, how exactly?\n\nDont get me wrong I often think some parents get carried away thinking the world needs to bend over backwards for your kids, but demanding that any partner that becomes part of your life and family fits in well with your existing dependents seems like the absolute minimum bar to hit...",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 116,
                      "content": "I think with that one, the OP was happy to live apart until the kids were moved out and was fine to spend time with the kids, just not to live with them. Then her bf just dropped his kids off in her house/apartment unsupervised and without permission, which is super messed up, even if you're dating someone who loves kids. \n\nWhile that OP probably should have broken up with her bf when she found out he had kids, her bf shouldn't have dated her at all since she made her opinion on children known from the outset and also her bf seemed to have been trying to push her into a childcare role when she said she didn't want that. \n\nIn this case, OP WBTA for sitting in business class while leaving her daughter in economy and she's also an AH for dating a guy who seemingly doesn't like her kid.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 70,
                      "content": "There was one a while back where the  mom’s kids were booked in economy, but the SO, partner and HIS kids were booked in FC.",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": ">no one wanted that poor little girl just because her parents ~~married~~ **are** assholes.\n\nFTFY. The childfree partners need to take themselves aside and have a stern word with themselves, sure, but the parents are the ones who are supposed to be putting the children they created before their own wants.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I read that one too. The good news is they broke up.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "\"Children always come first!!! Always!!\"\n\nI don't have kids, don't particularly want kids, but even I see this sentence as the absolute bare minimum law for all parents!! If I ever get into a relationship with someone that has kids, I wouldn't want to stay with him if he ever *dared* put my needs above those of his kids! The new significant other does not become top priority until those kids are grown and off adulting successfully on their own!",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I saw this. I was so mad for the little girl.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 102,
                  "content": "As a millennial growing up watching The Parent Trap and witnessing Meredith Baxter, I would never consider dating single fathers if I wasn’t willing to meet their child and potentially be a stepmom.\n\nEdit: Meredith Blake",
                  "id": 20,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Meredith Blake, Vicky Robinson in the original. Meredith Baxter is the actress who played the mom in Family Ties.",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 96,
                  "content": "[removed]",
                  "id": 22,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Sorry but this is ignorant, I am childless but am great with kids. Don’t assume to know why people are child less.",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "I found out the hard way (as a single mom) to only date men who had children.",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "It depends on the people involved.  My daughter has always wanted kids.  She recently broke up with a boyfriend because he *didn’t* want kids.  She is talking about fostering-to-adopt as a single parent if she doesn’t find a partner with whom she can start a family by the time she is forty.  If she met a man with children, she would throw herself into being (one of) their mother(s).",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 58,
                  "content": "It's totally playing with fire. All they need to do is read some of the recent Reddit posts where the mother ended up married to someone who didn't want kids, and dumped the child off with dad, or the mother got sick, etc. It's a failure on the part of the parent as well. If you have a child, you are putting that child's well being at risk by getting involved with someone who doesn't want to be around them.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 6,
                      "content": "And can we talk about the current articles these past two years of *adult men fondling teenagers and young women on international flights*?????\n\nOP, please don't leave your daughter alone.  She may be fine on the flight, but...\n\n...will you be able to live with yourself if someone harassed her?\n\nFucks sake.  Your boyfriend is not a catch.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Yep. And as a 38 year old woman who was abused by my stepfather while my mother sank into alcohol abuse before finally leaving that toxic marriage after 15 years, that shit fucks kids up. My mom was with my stepdad from when I was 10-28, and it gave me lots of trauma to deal with. He was charming and rich, and only turned nasty after they married. It was awful. It should’ve been a red flag to my mom that he had no relationship with any of his adult children, but I digress.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 336,
              "content": "Seriously. My husband would have flown on some discount airline and gotten to the destination a day late if it meant either his or my kids could have a positive experience. \n\nHe would NEVER have suggested any of his or my kids be treated like a second class citizen. Doesn't OP's child deserve the same?",
              "id": 29,
              "comments": [
                {
                  "score": 103,
                  "content": "Same with mine. It blows my freaking mind that there's parents like OP who literally question whether they should be the bare minimum loving parent and her spouse who gets into relationships with parents but they don't want to include the children.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 168,
                      "content": "It's honestly saying to the kid, I really don't want you with me, but since you have to be because I'm shagging your mother, I'm going to spend the least amount possible on you, and you should be grateful.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Well , note the comment that his parents treated him the same way . So, he sees this as normal . If this was two teenagers , I’d feel differently about it cuz teens always “ need their space “ from parents anyway but a child ? Nope",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Exactly! When my husband and I have looked at plane tickets he’ll suggest HE fly coach to save money, and say to me and my daughter “you ladies can fly first class, I’ll take coach.” He’d never say one of us should be the one to downgrade.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 224,
              "content": "It’s not even a stepdad, it’s a boyfriend. And he wants to act like the kid doesn’t exist on the flight. He’s probably thinking if he can manipulate OP into being separated on the flight then she will be more likely to abandon the kid in the hotel for dinner out, dancing, a show or whatever. And the more he can separate OP from their kid, the harder he will go. \n\nI’ve had 2 stepdads. The first hated me and wanted me out of their lives, I was 12. I knew he was a snake when I met him. Mom didn’t listen. And he really tried to get me to commit suicide, his mom too. They had a baby, he was out of our lives before my sister was 3. \n\nAlso, he’s makes a lot more money than OP but they’re splitting the cost of vacation? I bet he’d be footing the whole bill if the kid wasn’t coming along. He’s punishing OP for having a kid. He’s an ass. \n\nDump this guy or YWBTA to your kid.",
              "id": 34,
              "comments": [
                {
                  "score": 12,
                  "content": "Damn, tried to get you to commit suicide?!? What a fucking asshole. I'm sorry you had to deal with that shit.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Thanks. They almost succeeded, I didn’t take enough pills, they found me at home on the bathroom floor crying. Rushed to the hospital, epicac syrup and vomited until I had nothing left. Then made to feel like an idiot by the mental health “professional” on staff because “you’re just a kid, what are you depressed about?” \n\nAnd the next day it was brushed under the rug. I wanted to stay home from school, I just wanted some peace and quiet. Was told no as no one was able to stay home from work with me and she was sure I’d try it again. Went to school with broken blood vessels all over my face snd throat. No looking into therapy (too much money), no change in how I was treated. Mom was a useless moron who wonders why we don’t have a relationship.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 205,
              "content": "YTA- this is not a one hour flight, this is a 9 hour flight and your child would be alone. There’s been so many stories recently about people being inappropriate with children on a plane, as a parent, I would not ever leave my child unattended for that length of time in an area that I couldn’t easily get to them. You’re a family you should be travelling as a family.",
              "id": 37,
              "comments": [
                {
                  "score": 9,
                  "content": "This was my first thought. How come biological parents never think of someone taking advantage of their kids? What about memories? Don’t you want to make memories with your son?",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 126,
              "content": "I see you’ve gone back in time and met all of my mother’s boyfriends . The cruelty was a feature not a bug. She loved it. This mother knows damn well how shitty this is or she wouldn’t be questioning this.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": ">it because they see a woman who is weak and needy and he knows they will allow him to abuse their kids to make himself feel superior?\n\nSpot on!",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Good points",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "My mom is with a guy who doesn’t like us and now it’s just them two in my mom’s 4 bedroom home. I honestly feel robbed of being in my mom’s life because I would still be living with her and in turn, talking to her more. But nope. She wanted to be with a man who clashed with her 3 kids and he gets a nice cushy life once the kids left.",
              "id": 42,
              "comments": [
                {
                  "score": 8,
                  "content": "My own mother will always center a man in her life over her own children. I grew up independent because that was the only choice on the menu.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "My stepdad has spent the entirety of his 20 year marriage making himself feel superior to me and my mother. This is exactly the type of thing he would have pulled as OP is describing. I feel sorry for the child bc over time this type of behavior erodes a child’s self worth/esteem. I imagine there’s many other ways he’s making the child feel that way but this is the only one OP is picking up on",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Both",
              "id": 45,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 459,
          "content": "What he wants matters most. His comfort etc matter most. And she’s accepting it because he buys them things 🤦🏻‍♀️ OP he tolerates you kid at best and that likely won’t last too much longer.",
          "id": 46,
          "comments": [
            {
              "score": 137,
              "content": "Just wait until they get married they his true side will come out \n\nLike every wicked stepparent they are only playing nice until they have their partner locked in",
              "id": 47,
              "comments": [
                {
                  "score": 65,
                  "content": "After 5 years of dating (at their ages) not sure marriage is coming.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 48,
                      "content": "40 year old guy that clearly doesn’t like her kid, yeah no, the guy is a bum and has zero plans of marrying the mother. Sad. But at least he buys them things!",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 31,
              "content": "She's paying her half of the trip.",
              "id": 50,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "I've dealt with a stepfather who did the same thing he took over the house with his country shit (rusty tools,beer and trash everywhere,random scrap metal, ect. And only wanted my mom for partying and sex...after my mom got pregnant with his kid and he realized that she didn't want to go to the bar every night or have sex he turned to meth and when my mom finally went back to work he'd leave the child with me or my brother then leave to \"go to the bar\" then spend hours off god knows where doing god knows what and the entire time he accused my mom of cheating and constantly called me and my brother \"lazy ass MFS\" or \"punk bitches\"...hes in prison now",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "He’s not buying her things. He makes significantly more and they go 50/50, so she’s paying for him to be shitty to her son.",
              "id": 52,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "I bet he's going to want the kid out as soon as he turns 18 as well.",
              "id": 53,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 434,
          "content": "Finding out that his parents did this when he was a kid changes the game— he truly thinks that this is something that “real” *parents* do.  So he isn’t just some jerk who doesn’t care about her kid— he is treating her son how he thinks actual parents treat their kids, how would treat his own son, how his parents treated him, etc. \n\nTotally different than “I’m not wasting my money on your spawn who should be thankful I allowed him to even come on my trip with my girlfriend.”\n\nNAH",
          "id": 54,
          "comments": [
            {
              "score": 294,
              "content": "Having shitty parents doesn’t excuse you being a shitty parent yourself.\n\nIn fact, it should teach you empathy and a desire to *do better*.",
              "id": 55,
              "comments": [
                {
                  "score": 119,
                  "content": "Sigh. \n\nSure, it might be bad to actually do it. But here, being the A is a matter of *why* he doesn’t want to spend the money, or *why* he thinks it’s ok for the son to sit separately. Is it because he’s selfish and a jerk who doesn’t care about her son at all? \n\nOr is it something he thinks that normal *parents* do, and in his mind, he’s acting like a normal parent would, and thus is considering the situation as a parent to the kid, which is not at all A behavior (even if he’s *wrong* about whether it’s normal parent behavior)?\n\nThat’s the important question here.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 89,
                      "content": "No way in hell would my parents have ever paid for us to fly business class. Once on a trip when my brother and I were both middle grade, but I certainly wasn’t 13, my dad got upgraded while flying w just us to England and he LEAPT to the front of the plane. But I am Gen X and that was so standard.\n\nI can’t imagine sitting apart from my kids now, but they’re 9 and 7. When they’re teenagers? I think I’d ditch them for a free upgrade too. (Depending on how they feel about it, obvi. Not sure my older son would feel ok.)\n\nNot sure this is a terrible moral issue, provided it’s true the man is generally nice to the kid, and provided the kid’s on board.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 57,
                      "content": "There's a difference between thinking it's normal parenting in the abstract, based on his own experience only, and continuing to do so after he gets pushback.\n\nHe's rationalizing the hell out of what is a weird and bizarre idea that will totally backfire in the relationship with his stepchild.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I’m mixed on this. I don’t think it makes someone a shitty parent to have certain luxuries reserved for grownups. For instance, if we had people spend the night when I was a kid, the kids were expected to sleep on the couch while grownups got beds. I do this with my own kids. It’s not because kids are intrinsically second class, it’s because kids can usually sleep through anything without being sore the next morning. A night in a sleeping bag is really uncomfortable for a grown up.\n\nI would also be ok with great steak for grown ups will the kids get burgers. Kids often don’t appreciate food or leave it half-eaten. I don’t want to waste expensive food if it won’t be appreciated.\n\nI was all set to call the guy an asshole, except the kid is 13, the kid is getting a big international trip, the mom says the guy is nice to her kid, and the guy isn’t saying the kid HAS to sit alone. He’s saying it’s up to the kid and the mom but he’s not paying to upgrade the kid.\n\nSo long as it’s really true that the guy is nice to the kid, then I would choose to either sit with my kid if my kid is anxious (my older kid is anxious), not if my kid is chill (guessing where my younger kid will be at 13, he wouldn’t care at all, so long as he had skittles and movies.)",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "The way y'all are talking you'd think this guy is making her kid sleep in a cupboard under the stairs.",
                  "id": 60,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "My husband has four kids of his own and he would totally let his own kids sit in economy while he's in first class. I've only got one child, so I'm way more indulgent because we just have a different only-child dynamic. We've actually had this discussion waiting in line to check in for a 14 hour flight. (His youngest was still in high school and mine in middle school). The airline had signs about discounts on last minute upgrades; my husband said if the price was right we could upgrade but the kids (one mine, one his) should just be glad to go on such an amazing trip. He's a very loving father but just doesn't see the need to be overly indulgent.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I agree though I still say YTA\n\nI don't think he's some evil man that hates her OPs son, OP even claims that he's otherwise a great parent for the kid.  It just sounds like he has this really weird thought process regarding this specific thing, then we find out it's because that's how his parent treated him.\n\nDoesn't make him a monster or OP a bad parent for being with him, like some of these ridiculous comments claim.\n\nStill, OP should not leave her child to sit alone on a flight imo, regardless of what her husband thinks",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 237,
          "content": "How does he not like the child?  I agree he being a duck about this one issue and if I were mom I'd sit with my son or upgrade his seat of I can afford it, husband has no problem with that. Also he's never had an issue and has been like a father to the boy financially and with time. He was raised that way so he doesn't see the issue. Idk how you correlate the two and how you got upboted so much",
          "id": 63,
          "comments": [
            {
              "score": 157,
              "content": "I agree, these responses are so over the top. Eesh.",
              "id": 64,
              "comments": [
                {
                  "score": 94,
                  "content": "Always is. The redditors that comment in AITAH always lack nuance, take an extreme position and have the emotional control of a child",
                  "id": 65,
                  "comments": [
                    {
                      "score": 83,
                      "content": "It’s honestly disturbing seeing interactions between OP and some redditers. “Just admit you hate your kid and just want bf to spoil you” like, WHAT?? \n\nI honestly hope OP doesn’t take this shit too seriously. She doesn’t need to uproot her relationship/life because of people on Reddit.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 134,
              "content": "Exactly. When I was 15, my family went to Aruba. My parents flew first class and my sister and I sat in economy. I think this is far more common than people think. I do not for a second believe that this alone is a red flag or an indication that the boyfriend hates the child. He just thinks it’s silly to spend hundreds of dollars so a 13 year old can fly business class. I get that. I’m just about always in the opinion of the majority in this subreddit, but here I disagree. NTA.",
              "id": 67,
              "comments": [
                {
                  "score": 21,
                  "content": "But you had your sister so you were not flying 9 hours alone! Huge difference. What your parents did was acceptable. Leaving a 13 year old alone for 9 hours is NOT in any way acceptable. Do you not see the difference?",
                  "id": 68,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I think you misread 13 as 3?",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Right, we never had that kind of money growing up but I have friends that did and first class came up in conversation once and 2 of them always flew in economy away from their parents and one did when their parents got upgraded. It’s really not that crazy. You’re 100 feet away from your teenager… it will be all right.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 99,
              "content": "Yeah I think so say he “doesn’t like the kid” is a huge leap. My parents left my brother and I im economy while they sat in business all the time when we were teens.\n\nThat said, I do think it would be weird to force a 13 year old to sit alone in a different class. It would be different if he could sit with a sibling but that’s not the case here.",
              "id": 71,
              "comments": [
                {
                  "score": 27,
                  "content": "That's a good compromise, if there was a brother or sister that could sit together, I think that would be ok. The kids would probably enjoy not having the parents there. But the kid on his own? Surely that's a YTA lol",
                  "id": 72,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Every kid is different. I would have rather sat by myself on a plane away from my mom and brother than to have to sit next to my brother at that age. I might have felt a little left out sitting alone but I feel like by 14, I would have preferred it. I don't know why she doesn't just ask the kid what he prefers. Maybe he'd like to sit alone. Maybe not. Just ask him. Does anyone talk to their kids anymore?",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I agree with this. If they had a sibling and to save some money for the trip itself, fine!! But his reasoning for this is not fine .. that the kid won’t appreciate business class and he wants to enjoy his own flight .. clearly doesn’t have any real respect for the kid of the woman he’s dating.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": ">that would be ok. The kids would probably enjoy not having the parents there. But the kid on his own? Surely that's a YTA lol\n\nI was an only child who also did this. It was never a big deal. I was 14 or 15 when they started doing this. It never felt like a punishment, it was always framed as a chance for me to be more independent. My mom always came back check on me several times a flight. I have lots of issue with how my parents treated me as a kid, but this is not one of them.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "Thank you! I was feeling like I was in bizarro world reading the top comments here. Weirdos acting like making a teenager sit in economy on the way to a nice vacation is the equivalent of sending them to the gulag. I don't know if it's delusion or privilege, or both, but it's disturbing to read. Nothing here raises flags for me.",
              "id": 76,
              "comments": [
                {
                  "score": 11,
                  "content": "I think it’s moreso the reasoning. “Kid won’t appreciate business class and I want to enjoy my flight.” Kids not a 4 year old who will cry and be distracting. Kid is a teenager who will probably put on headphones and watch a movie or nap. BF Never suggested to do this to save money for the trip upon arrival, he wants the kid somewhere else on the plane to “enjoy his flight.”",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 142,
          "content": "All of them. He has money so she will sacrifice her kid.",
          "id": 78,
          "comments": [
            {
              "score": 130,
              "content": "I wasn't even done reading the post and I was already pitying the kid.",
              "id": 79,
              "comments": [
                {
                  "score": 109,
                  "content": "Feeling sad for the kid as soon as I read \"my partner doesn't want the kid to sit with us because he should be grateful for the trip and the mom is entertaining this idea at all.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 55,
                      "content": "That's one of the reasons I was feeling sorry for the kid... that their mother was apparently willing to be in a relationship with a jerk like this.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "The key word is \" adjust\"  So that OP can enjoy the benefits of a well off SO with a questionable attitude towards children.",
              "id": 82,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 119,
          "content": "Even if he likes the step kid, sounds like they don’t agree on how to raise kids.",
          "id": 83,
          "comments": [
            {
              "score": 121,
              "content": "Yeah, he thinks it's \"normal\" for kids to fly alone in economy while the parents fly in business because his parents did it to him.\n\nI would NEVER do that to a kid of mine. Especially if I could afford it.",
              "id": 84,
              "comments": [
                {
                  "score": 57,
                  "content": "It's not normal, but that was his experience growing up. There are a lot of things people grow up thinking isnnormal that the greater societal world doesn't. That doesn't actually make him an ah, just out of touch. He is definitely being borderline, ah, though. I think a 13 year old is not only able to appreciate something like business class but is able to 'appreciate' that he's in economy while his parents are in business. The kid isn't going to be able to just come visit either. \n\nOP, you need to have a serious discussion with your bf. Show him this post even. If all 3 of you do not fly in the same class, there will be a problem. Either your kid is going to feel rejected and like he doesn't matter, or that both of you don't matter (although he won't feel like you rejected him if you sit in economy). Do not let this become a thing. It's something that will fester and taint every single thing after it. If i was in your position, I would demand that all 3 fly the same class, a different destination or mode of transportation is picked, or don't go on a vacation with him. The only other thing to do would be to ask your son how he feels about it as part of the decision-making process. Maybe he doesn't care as long as he gets to have fun when you get there. He's old enough to start speaking up for what he wants, what he's ok with, and how certain decisions would make him feel overall",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I flew alone at 14 with no other parents on the plane lmao. This is not a big deal to be 10 seats away from your parents. I mean 😭",
                  "id": 86,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Have you ever seen Home Alone? Parents in first, kids in economy. Not saying it’s right but it isn’t some wild idea and the kid is 13 not 3.",
                  "id": 87,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 118,
          "content": "But his parents did the same! And look how it made him turn out fine!! Oh wait ...",
          "id": 88,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 100,
          "content": "I disagree. My bf loves the shit out of me, and we fly internationally every now and then. The impracticality of spending that much on air travel, at times, is silly. Anytime he says he wants to fly business class, i always volunteer to fly a lower class because i legit don't need my airline ticket to be 4× the amount. It's not the end of the world to sit in economy plus for a 9 hour flight, and the kid IS already being given an experience that a HUGE amount of the population will never get to experience.\n\nIf OPs SO legit grew up with parents that forked out for business class for themselves and put him in a lower class, but the SO never saw this as a sign of not liking him, then it's perfectly reasonable to continue this with his own family.\n\nAnd it's a bit dangerous to buy business class for kids and grow them to be accustomed to this at such a young age.\n\nJust because you CAN afford something doesn't mean you have to/should do it.",
          "id": 89,
          "comments": [
            {
              "score": 123,
              "content": "If it's truly meant to be a lesson, they can all sit in economy.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "So just because you CAN afford to sit with the child on a long haul flight  doesn't mean you should? We've got different definitions of should...",
              "id": 91,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Your logic doesn’t apply, your both adults. And the boyfriend isn’t the kids dad. It’s obvious why this is cruel.",
              "id": 92,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "You're two adults making a decision. You're not a 13 year old child with a mother, and stepparent in a different class. You're comparing apples, and oranges.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "Just tell your kids that you appreciate the luxuries that dick provides…",
          "id": 94,
          "comments": [
            {
              "score": 7,
              "content": "He doesn’t even provide them! She makes way less money but he insists they split things 50/50! Then wants business class plane tickets knowing she can’t easily afford to upgrade her kid’s ticket.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 62,
          "content": "You did read the part where she says he makes considerably more money than she does?  If you've got enough green, it obscures the red flags.",
          "id": 96,
          "comments": [
            {
              "score": 3,
              "content": "Did you miss the part where she says they're splitting 50/50?",
              "id": 97,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10020,
      "content": "YWBTA if you travel in a different class from your child.\n\nYes, a 13 year old can travel in a different class fine. Heck, they could travel alone. But there’s just something unsettling about a parent being on the same flight but in a different seat class.\n\nDoes your boyfriend normally disrespect your child?",
      "id": 98,
      "comments": [
        {
          "score": 3388,
          "content": "It’s unsettling because it’s planned. If it happened unintentionally I think everyone could roll with it. But deliberately putting your 13 year old far away from you because it’s a waste of money is very unsettling.",
          "id": 99,
          "comments": [
            {
              "score": 979,
              "content": "OP said that's how he grew up, his parents would fly first class and put him in economy. Not sure if that makes it better or worse.",
              "id": 100,
              "comments": [
                {
                  "score": 1937,
                  "content": "I think it helps me understand why he might think this is a good idea, but it isn’t one.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 544,
                      "content": "This. Just because that was how it happened to him doesn't mean he should do that or expect OP to do it.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 402,
                      "content": "Yeah, this is the \"It didn't do *me* any harm\" school of dealing with childern. *sigh*.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 201,
                      "content": "Kind of reminds me how my mom used to not do stuff for me as a kid (example: pay for school dances, sports, etc) because “well *my* mom didn’t do any of that for *me*” \n\nLike okay, just because your parents made decisions that weren’t in your best interest doesn’t mean you treat your own kids that way “in fairness” like what?\n\nThat hurt me a lot as a kid so I make it a point with my daughter to try to give her all of the experiences I missed out on.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "This was SOP in my family, it was great, I felt independent.",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 228,
                  "content": "I mean, this was pretty normal 30+ years ago. Go back and watch Home Alone, all the kids are in economy while the parents are in first class. \n\nI personally don’t think it’s the end of the world, but the thing that makes me side with OP is that the kid would be alone. Not because the kid is too young, but because it makes the kid *singled out*. If there were a pack of kids and they were all in economy, fine. But one person sent to sit separately from the others is hurtful.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 212,
                      "content": "Are you really suggesting using Home Alone as a metric for what was normal in the 90s?",
                      "id": 107,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 123,
                      "content": "Or he might be like \"cool, I get to sit away from the adults while I deal with being an angsty teenager\" \n\nHonestly guys, if I was 13, I would be 100% cool with not sitting next to my parents on a 9 hour flight. Honestly, I think a lot of teenagers would even prefer it.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I feel like that’s a plot point to explain why they didn’t realize one of their kids was not with them through an entire international flight rather than an example of standard behavior for the times though?",
                      "id": 109,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "But they were in economy WITH THE OTHER KIDS. They weren't by themselves.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "To me, thinking back to 13, I would have loved to sit by myself. I could watch whatever R rated movie I wanted without getting hassled by my mom. I don't really think it's that big of a deal either, honestly.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 108,
                  "content": "At best it gives us hope he might be fixable. \n\nIf you are raised in a toxic situation long enough, your normal meter gets skewed to think what you are experiencing is the norm. Maybe the responses to this post will allow stepdad to do some serious reflection on his childhood and how it shaped him.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 53,
                  "content": "I feel like you lot didn't travel a lot when you were young. This has happened to me multiple times. I'm in my 30s and I joke that my relationship with my parents is comically good. Business class is expensive and the kid isn't even gonna really care that much. Business class tickets cost A LOT more. Sometimes like 4 times as much. A flight that long is probably like at least $500 and that's super cheap, could easily be double that. So we're looking at $500-$1000 just for the kid to travel without it being business class. Then he's presumably gonna eat and do things. The fact that he's having the experience is super cool. Most 13 year olds have never been outside of the country they were born. Certainly not 9 hours via flight away.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 11,
                      "content": "So I agree with the money side and that PERHAPS the kid won't really care.  But 13 is old enough for them to decide for themselves, so the parents should just ask the kid.\n\n&#x200B;\n\n> The fact that he's having the experience is super cool. Most 13 year olds have never been outside of the country they were born. Certainly not 9 hours via flight away.\n\nAs far as the OP and also you repeating the comment about the kid should be happy with what he is given because most 13 year olds don't get an opportunity...that part feels gross to me.  The options here is not going on a trip vs not going on a trip.  The option here is sitting near your family vs sitting by yourself.  Like it would be gross if the ENTIRE 2 week vacation the kid gets something \"lesser\" because you can justify it with \"most children don't even get this kind of opportunity\".  \n\n\nLike if the husband is paying for the entire trip and makes the wife sit in economy because - hey most adults don't get the opportunity to go out of the country.",
                      "id": 114,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "Way better. He isn’t saying “your kid isn’t worth spending my money on”, he’s saying “this is something parents shouldn’t spend our money on”. Totally different mindset and no longer is indicative of general feelings of “I don’t want to waste my money on you” towards her son. \n\nIt’s the difference between rethinking this relationship and going “awww honey” while\nyou explain why you don’t want to do it here, and whyz",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I am remembering flying with my parents at 13, and I did not want to sit with my parents (family of 4, and the 3/2 configuration of the airplane, I always volunteered to be the one left out to my own seat)\n\nI wonder if OP even asked the kid?  I'd be happy to sit in coach away from my parents and play my Gameboy (okay I'm aging myself, but still).\n\nOP's husband, however, sounds entirely insensitive to what the **communication** and **weird financial arrangements** are.",
                  "id": 116,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "My parents did it too. Personally I loved it. Several hours where I could play video games nonstop and generally do whatever. When I got older they asked me if I wanted to fly business with them, I said no every time.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 116,
              "content": "My stepson is 13. If this happened unintentionally to us I would take the economy seat and he could sit with his mum in business. I somehow doubt that's how it would pan out for the OP's sitch.",
              "id": 118,
              "comments": [
                {
                  "score": 13,
                  "content": "I have a real son and would totally let him sit in business class with my fiancée/his step-mom while I sit in economy. Not sure how I’d feel as a man attempting to take priority over women and children, so why not put them first together",
                  "id": 119,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 77,
              "content": "Exactly. It’s not about the child being old enough to sit on there own but deliberately excluding them from part of a “family” trip.",
              "id": 120,
              "comments": [
                {
                  "score": 57,
                  "content": "The flight? I did a lot of travelling around that age as I'm from England but moved to the US. I don't think many 13 year olds want to sit next to their parents for 9 hours straight. And if they do, you know what they're gonna do? Pop in ear buds and ignore them for that stage of the trip. How many flights have you been on where you just chatted the whole time? We all try to fall asleep as quick as possible.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 40,
                      "content": "Agreed!! These comments are wild lol",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I absolutely wanted to sit next to my parents at 13. I flew all the time (military brat) and I wanted to be next to at least one of my parents always. 1) they always had all the snacks and money to be able to buy something if we needed it 2) they are excellent napping pillows, especially at 13 3) I did not feel safe sitting on my own next to strangers for that long. Maybe it’s because I’m a woman, but being stuck next to a random man for that long sets off allll the alarm bells for me. I didn’t even like being trapped in a seat by a man on the bus during college.",
                      "id": 123,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "My parents took me travelling a lot when I was younger too. When I was 13 I would absolutely have been uncomfortable and stressed out to be sitting next to complete strangers for 9 hours. Even if I was just gonna play on my DS or something, having a parent next to me was a source of comfort and meant I had someone I could rely on in a confusing and unfamiliar environment.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "And the child probably will not be able to “pop up to visit” in business class. Flight attendants will send the child back to her/his seat.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "It doesn't even sound like the issues is it being a waste of money, but a \"Know your place\" sort of thing.\n\nIt's super unsettling to me.  putting a 13 year old with strangers for 9 hours when you're on the same flight.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": ">If it happened unintentionally I think everyone could roll with it\n\nIn which case, I would give up my business class seat for my kid to be more comfortable and sit with my wife. And I'm sure my wife would agree to switching off halfway through the flight where she sits in economy and I sit in business class with my daughter.\n\nWhen you have a kid, your kid's happiness should take precedent over your own, and a kid should not have to endure a 9 hour flight by themselves seated uncomfortably next to strangers while their parents enjoy cozy business class.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 490,
          "content": "As a professional who travels business class internationally, it is not acceptable for children or others to \"pop\" onto business to visit. YWBTA if you booked your child separately in economy.\nBF is an AH. Just because his parents set a poor example by leaving him behind when they upgraded (AH move) is no reason to continue the practice. His kid-won't-appreciate-business shtick is a red herring. Agree with others that he may not like or welcome your child. He's being disrespectful & mean.",
          "id": 128,
          "comments": [
            {
              "score": 110,
              "content": "Agreed, most of the time they curtain off 1st and business class so the plebs can't access them.",
              "id": 129,
              "comments": [
                {
                  "score": 95,
                  "content": "One time my wife got upgraded because of her status but I didn't. Me and one of our chihuahuas rode in economy, with him in his bag under the seat. When I would go up to use the bathroom I would peek through the curtain to see her and our other chihuahua (out of her bag!) covered in a white down blanket, reclined and watching a movie together. The other half was living quite large.",
                  "id": 130,
                  "comments": [
                    {
                      "score": 166,
                      "content": "How did you decide which chihuahua got the upgrade?",
                      "id": 131,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Hahaha, I bet the Econ dog is still bitter to this day.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "Agree. I've flown BC a number of times on various airlines. They will absolutely shut down passengers wandering up to the front of the plane to \"visit\".",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "My daughters are 16 and we all flew business class for the first time this summer. They absolutely appreciated it. You are right, they don't let people pop in. YWBTA",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "And depending on the kid, they would absolutely appreciate business class! I flew with my then 8yo daughter business class once (points upgrade) and she still talks about it now, over 6 years later.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 249,
          "content": "Somehow it would feel more humane to just leave the kid at home than to begin their trip with a passive aggressive lesson in how grateful they should be just to get to go. He CAN get the business seat for the kid, he doesn't WANT to because he has some interesting ideas about raising kids with values.\n\nOP, end of the day, that's your kid and yes, YWBTA if you ignored what you want to do as a parent (not leave your child alone during a long international flight) because you're getting bullied by your boyfriend.\n\nEdit: just noticing the detail about splitting the cost of a very expensive trip 50/50 despite the fact that he makes \"significantly more\" than you. Doesn't sound much like a family holiday to me. That's just not how families roll. It's amazing you still feel in the one down position and unable to do what you want for your own kid despite paying half the cost for the trip.",
          "id": 136,
          "comments": [
            {
              "score": 83,
              "content": "I wonder where it ends. “We are going out for dinner, you should be grateful for our leftovers or order room service”\n\n“We are going on this excursion — you will just watch from the shore”\n\nAlso if OP and ~~wife~~ boyfriend have BC seats they’ll get access to lounges at the airport. Are they doing to leave the 13 year old alone in an airport (for potentially hours if there’s delays?).",
              "id": 137,
              "comments": [
                {
                  "score": 48,
                  "content": "OP and boyfriend\\* \n\nI don't know why I think it's significant they're not married, but I do. There's weird power stuff going on and I think boyfriend has made OP feel *grateful* to be with him, otherwise she wouldn't be wrestling with his opinion of how she parents her kid.",
                  "id": 138,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Yes and where does it stop? OP is allowing Bf’s behavior to go on rather than his breaking the cycle. At this point it sounds like OP is setting herself up for condoning the Bf’s behavior. Plus, being together 5 years??? How has he treated her son…not just with materialistic things?\n\nYTA OP. You’d be surprised how much kids notice these things. Why should it be a problem for your son to sit in business class if you’re footing half the cost for this trip? Seems like you’re setting yourself up for literally keeping a running list of who paid for what. \n\nSpeaking from experience…my father chose his wife over keeping an already shaky relationship with me but we could be civil and actually have a conversation. She never liked me from the beginning (I was 12) but clearly made it known how she adored my brother. Mind you, she 10 years older than me and I was looking forward to an older sister. Sadly she wanted me out of their lives. I’ve forgiven my father for throwing me out at 15 but I can’t forgive this. \n\nYTA OP for even considering choosing the BF before your son.",
                      "id": 139,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "OP needs to watch Flowers in the Attic.",
          "id": 140,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "My parents used to do this with me and my brother. I saw it then the same way I see it now: that they valued their comfort over ours. The communication will be loud and clear.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "In the BF's defense, this is how his parents handled flying when he was a kid. It's his refusal to consider doing anything different that is concerning.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "here’s the thing. it COULD work under certain circumstances, just not these.\n\nthis actually happened to me as a kid. I was 10, my siblings and I were 12, 16, and 19. my family went on vacation overseas, it was mostly an anniversary trip for my parents but they were excited to be able to take us all with them (we mostly only travelled for familial obligations when I was a kid). the one thing my parents did specifically for themselves that trip was upgrade themselves to business and leave my siblings and I in economy for the flights (out and back). it was absolutely fine, but that doesn’t mean it’s a good choice for every family.\n\nmy siblings and I were always super well behaved (more so than we are now lol) and comfortable on flights. not every kid would be (flights are stressful!) and might need to be with a parent. it also helped a ton that my two oldest siblings were plenty old enough to make sure us younger ones were ok. both of my oldest siblings had already travelled on their own before and were comfortable. the biggest thing was absolutely that we were in a group, and a cohesive one at that.\n\nif it had just been me, an only child, sitting alone in economy because my stepdad didn’t want to spend money for me to sit next to him? yeah I’d be pissed. I’d feel unwanted. my parents just wanted one part of their trip to be just for the two of them. it’s been over a decade and I still think it was totally fine. and other times my parents travelled (really only when they had 1-2 kids) and upgraded their plane seats? they took the kids up with em. god they’ve got so many stories of the many flights they took for work, family, etc. over the years.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I have seen video of young people, mainly girls, being harassed by their seatmate. 13 is too young to stand up to this on their own.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": ">something unsettling about a parent being on the same flight but in a different seat class.\n\nNot to mention the fact that grown women get sexually harassed and even assaulted on flights with an uncomfortable frequency. Are you really okay leaving your 13-year-old kid by himself sitting next to God knows who?\n\nThe business class is not for him to \"enjoy\". It's for the adults to enjoy, but the kid is part of the group and should be included. I'd feel like shit if my mom booted me to the back of the plane while she and her boyfriend were sipping on free cocktails for 9 hours.",
          "id": 145,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6883,
      "content": "Sit in economy with your son. Let your boyfriend sit in business class alone. If you start letting him exclude your son he will think it's okay and continue pushing that boundary. \n\nYWBTA",
      "id": 146,
      "comments": [
        {
          "score": 2981,
          "content": "Seems like my gut is probably leading me the right way.",
          "id": 147,
          "comments": [
            {
              "score": 2386,
              "content": "And whilst you are in economy, think about the fact that your bf is happy with you sitting separately from him because he doesn’t think your son - who is old enough to be aware of this, is worth a business class seat. \n\nBecause that it what it comes down to. \nHe should be grateful that you are taking him on holiday? It’s like he is talking about a dog that shouldn’t travel in the cabin but be kept in the hold.\n\nYes, you are fortunate to be going on holiday. Lots of us can’t afford this. But that he was prepared to separate you two adults from your son in a way that states what you are ‘worth’ or ‘deserve’ makes a huge statement to that kid. \n\nIf he had a child who also had to be in economy, then he would be a bit of an A, but that would ameliorate this situation. But he doesn’t. So it becomes a clear statement of your son being of less worth, of less value than you two. As a bio dad he would be an A for doing it. But as a stepdad it is a HUGELY DAMAGING thing to do. Surely your son will question why you and him are in economy and SD is in business? And I would be fairly certain that SD would tell him why. I think even you and him in economy will be odd.  \n\nThis *will* cause issues down the line.",
              "id": 148,
              "comments": [
                {
                  "score": 933,
                  "content": "This. I can imagine how that conversation will go. \n“Mom, why are you and I sitting back here when Dick gets to sit up front?” \n\n“Well honey, Dick thinks you’re an ungrateful little shit, and he doesn’t think you deserve to sit in the nicer part of the plane.” \n\nAs someone who grew up with a stepdad, I can say that this situation would have eternally damaged my relationship with him.",
                  "id": 149,
                  "comments": [
                    {
                      "score": 545,
                      "content": "My dad flies a TON for work and has all the perks. When we were kids (maybe like 8 and 10) he was able to upgrade his ticket (and a companion ticket) to first class. He traded for my economy ticket and let my brother and I fly first class on a 6 hour flight, and came to check on us occasionally (we had flown a lot). \n\nMy dad is not the most socially aware, he’s also 6’2” and could easily have used the extra legroom but he thought it was so fun to watch us get excited over flying first class. That’s a dad move. Sticking your kid in the back? Yeesh",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 84,
                      "content": "My stepdad was a real dick and even he wouldn't have pulled that crap.",
                      "id": 151,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 103,
                  "content": "u/selecthighlight8827 Exactly this. He talks about her son as if he is a pet and not a human being!",
                  "id": 152,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Jesus, even I took my Corgi in business class with me.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 81,
                  "content": "But you don't understand, a 13 year old(iirc) can't appreciate not being super cramped in economy while his parents chill in business class",
                  "id": 154,
                  "comments": [
                    {
                      "score": 73,
                      "content": "I've had one trip where I shared a first-class row with a kid (maybe 13).  He was very polite, well behaved.  He certainly appreciated where he was sitting.\n\nHe even offered me his shrimp cocktail, as he didn't like shrimp.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "He isn't actually taking them on holiday of she's gotta split costs. More than split costs.",
                  "id": 156,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 225,
              "content": "It’s shocking that your boyfriend is fine not sitting with you for the flight either. He’s willing to die on this hill to prove a point and doesn’t care that you’ll be separated. He’s a major AH.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 184,
              "content": "Girl just dump him.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 111,
              "content": "Listen to it, friend. It's there for a reason. \n\nYour boyfriend is a couple years younger than me and is acting like a 1%er from the \"Greatest Generation.\" \n\nAre these the values you hold, where children are treated as less than adults? If not, get out. (And truly, I don't think you believe this, but bf blatantly does.) Is this how you want your own child to be treated? 13 y/o kids aren't stupid. They are fully aware of how the adults in their life feel about them.",
              "id": 159,
              "comments": [
                {
                  "score": 7,
                  "content": "[deleted]",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 60,
              "content": "So this guy clearly doesn't like your son, treats him as second class, and doesn't mind travelling separately from you.  You need to set your son down somewhere far away from your BF and ask your son what your BF is doing when you are not around, because I guarantee that sending your son to the back of the plane is the tip of the iceberg.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "Get rid of this one. He's asking for permission to treat your kid like shit and you be ok with it. This is him toeing the line, see what he can get away with and what you'll push back on.\n\nI promise you, this is only the beginning. \n\nAny partner who doesn't treat your kid like their kid ain't shit.",
              "id": 162,
              "comments": [
                {
                  "score": 8,
                  "content": "Yeah 100% this will just get worse - and its already really bad",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Sounds like that now that your child is a teen, he is going to start making this remarks or earning things, appreciating, being lucky to be around and included when your boyfriend allows it. It wouldn't surprise me that from now on he starts excluding him because he is old enough to stay behind and he doesn't know how to appreciate or deserve to do stuff. I know you've been with this guy for a while, keep an eye on those things and stick to your kid, if he is just stsrting with this it will get worse.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Thinking back to being 13 (a very long time ago).  My feelings would be hurt if my parents did this.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Why are you paying 50/50 if he makes significantly more than you?",
              "id": 166,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "But if your gut is also staying it’s okay to date this guy, I wouldn’t trust your gut",
              "id": 167,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "Better yet, take the trip without the boyfriend.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "TBF her kid's ticket is her responsibility. He gave his opinion on what it should be but by OPs own admission he would accept if she bought her son a business class ticket.",
          "id": 169,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3297,
      "content": "YWBTA.\n\n>it's not worth the extra cost\n\nThere's no reason for any of you to be in business class if that's the case.",
      "id": 170,
      "comments": [
        {
          "score": 851,
          "content": "Rewrite it as “THEY’RE not worth the extra cost” and it becomes clear why this would be a bad idea.\n\nYWBTA if you let your boyfriend send this message to your child.",
          "id": 171,
          "comments": [
            {
              "score": 176,
              "content": "Especially because he isn't paying for her to be in business class either, since they are splitting the trip 50/50 despite him earning significantly more.",
              "id": 172,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 166,
          "content": "I also don’t understand the not appreciate it part - we recently flew out to Israel from the uk on BA and the 5 of us got unexpectedly upgraded to business class and it was a really great experience.\n\nMy kids are 8, 13 and 15 and all three of them totally appreciated it.  They loved getting cosy in the lie-flat “beds” with the duvets on - getting the little toiletry bags - eating the amazing food and ordering ridiculous amounts of drinks (us parents totally appreciated that too).  Putting up the dividers between them and having their own little space to chill out.  \n\nAs much as we enjoyed it we wouldn’t dream of going up front and leaving the kids behind on our next trip although we did joke about doing it with them.  \n\nMy husband used to fly a lot on business (uk-USA) and said economy gets you there just the same and he’d rather have more money to spend on the accommodation/food when we get there than waste it on a relatively short trip.  He did/does know families that do the parents in business and the kids in eco though but he said it isn’t fair and won’t do it with ours.",
          "id": 173,
          "comments": [
            {
              "score": 44,
              "content": "100%. I travelled business class with my two daughters (aged 12 and 16 at the time) and they LOVED it. Absolutely loved and appreciated every little thing about it",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I especially don't understand the people saying that because a 13 year old is small, they wouldn't appreciate the extra space.....\n\nAs a 5'2\" adult, I can attest that being small does not make economy as comfortable as business class. Not even close. Especially for a long-haul flight where you're trying to sleep.",
              "id": 175,
              "comments": [
                {
                  "score": 5,
                  "content": "When I was 13 I was at least 5'7 so would I have deserved it more than an adult at 5'2 or would I have not deserved it since I was 13? They act like everyone is the exact same size!",
                  "id": 176,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Because adults like this dude prob had parents who thought \"eh hes a kid he doesnt need comfort or luxury / he should be thankful hes going at all\" and now he thinks kids to be subjected to that too.  Yes, a child probably wouldnt have some sort of health need requiring business (legs back etc), but either do most people who sit in business, its just a nicer ride.  BF is def just like \"eh he's a kid he wont know the difference, im cheap.\"",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Absolutely. At 13 I would be over the moon if I got to sit first class. \n\nAlso, him saying the kid should just appreciate that he got a paid international trip. What was the kid supposed to do? Pay for the trip themselves or stay home alone? Like of course your parents are going to pay for it. You can hardly earn money yet.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Especially when he said even if he was a millionaire. Shows he’s not even really thinking about the money. Just wants the kid out of the way or get “revenge” because it was done to him.",
          "id": 179,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Didn't she also say he's a millionaire? If he is he could easily afford it. Way to tell OP's child that they're not worth being around. \n\nAlso, just because I strongly dislike and don't trust this guy: His parents doing that to him as a kid does **not** make it okay, even if it is true. \n\nHe says he's afraid the kid would get spoiled. How does he know? It sounds like he's not even interested in getting to know OP's child. \n\nI agree that this guy is testing OP's boundaries regarding her kid. And she needs to make it clear in words and actions that her child comes first. \n\nIt would be ***awesome*** of her to stick up for her kid by sitting with them in economy. I hope she does, and that she seriously considers whether this relationship is worth continuing. \n\nI was raised by big spenders who consistently told me how worthless I was, and there are no words for how eagerly I would have traded in the material goods and trips if I had parents who were simply loving, supportive and present.\n\nGiven the way OP is leaning, she's not the AH, but her boyfriend is a scummy AH.",
          "id": 180,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2854,
      "content": "YTA, and it’s WAYYYY deeper than a seating plan on an airplane.   \n\nThis man has been your partner for 5 years and when planning a “family trip” you first say “*he’s* settled on a destination.” Then you tell us he makes significantly more than you, but makes you split the cost with him 50/50 and pay for your child, who has been in his life since they were just 8 years old. Mmkay.   \n\nHe thinks your child (not young adult by the way - 13 is a child) should be “grateful” to be going on an international trip…. One that he decided on and won’t pay for. Does your child get a choice? In your boyfriend’s extensive experience in raising children, do children get a choice to decline these lavish trips where they are abandoned in economy for 20 hours worth of travel?   \n\nFor those who don’t have kids: 13 is typically a middle school aged child.  \n\nIt’s not worth the cost even if he were a millionaire??? That statement alone would have me packing my bags, but not you, huh?  \n\nHe’s fine with you downgrading to join your child in steerage, ooh sorry: economy, but would remain in business class so **he** can enjoy **himself.** What a generous and loving partner, and a beautiful way to start your “family trip.”   \n\nWhen discussing the fact that “he doesn’t want to **let** your child into the same class of plane as you,” he says he thinks you’re being weird and silly? So he’s selfish, cheap, AND dismissive of your feelings and concerns? What a guy.  \n\nAs a human person, a woman, and a mother… what the actual fuck are you doing here? You need to take a step back and really take a look at the 500 red flags you just danced around while telling this story.  \n\n🚩Editing to add [this](https://reddit.com/r/AmItheAsshole/s/6vk5xJw9jc) very insightful comment made by u/eclecticsed further down the thread because I think they’re dead on:  \n\n> You're going to a lot of effort to avoid giving this child a gender, and I think it's possibly because you believe people will be more upset if they find out your kid is a girl, maybe assuming girls are more likely to be harassed and/or assaulted at that age when left alone. But just so you know kids of either gender can have that happen to them, and regardless of whether your child is a boy or a girl, this is still a shit parenting move. Your boyfriend sounds like a sociopath.\nYes, you would be the asshole if you went along with this.",
      "id": 181,
      "comments": [
        {
          "score": 313,
          "content": "I was in grade 9 with a job at 13 and I'm \\*still\\* nodding right along with this.",
          "id": 182,
          "comments": [
            {
              "score": 92,
              "content": "Typically kids going into 9th grade (the start of high school) here are 14, but I’m sure there are a few who start at 13. Either way, they’re fully middle school maturity at that age and I wouldn’t call them young adults by any stretch.  \n\nI’m sorry you had to start working so young, I recognize that was probably out of necessity and it couldn’t have been easy for you.",
              "id": 183,
              "comments": [
                {
                  "score": 9,
                  "content": "that's kind of you to say, but I can't imagine I'd be the person I am without my past.  and I truly love my life, so it was definitely worth it.",
                  "id": 184,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Well that’s beautiful. 🤍",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I knew a couple people who were 13 when they started high school but their birthdays were in September so they turned 14 within a month of starting high school. They didn’t have jobs though.",
                  "id": 186,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 150,
          "content": "This man has had five whole years to fuck up your kids with this attitude maybe get him out now before it's too late",
          "id": 187,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 83,
          "content": "You took me out when you said \"steerage\"!!!🤣🤣🤣",
          "id": 188,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "Really good catch on some of that word choice",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "All that! And not only YTA, you’re delusional to think, after u/amacatokay ‘s explaination, that yours is a blended family. It might be for you, but not for your boyfriend. I hope you see the massive amount of red flags  here.",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "In a weird way, I think OP needs to be honest if some part of her is with this man because he’s a millionaire. Lol",
          "id": 191,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "This thread has me learning that even after years of therapy I still don't know what a healthy childhood looks like. Everyone's ripping the shit out of this couple and I'm just sitting here like \"is that really bad enough to be a red flag?\" Because my family's red flags were so, so much worse, this seems completely benign in comparison. Damn.",
          "id": 192,
          "comments": [
            {
              "score": 7,
              "content": "Some of us have the misfortune to only recognize those things in hindsight, it was a bucket of cold water kind of thing for me too, years ago.",
              "id": 193,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "Dude as a father you summed this up so well. If a woman I was with tried to do this with my kids it would be a deal breaker. Like even if they caved and let the kid in business class, I would forever be suspect about how they actually feel about my kids. I couldn’t do that long term.",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "This is the only answer op should read and heed.",
          "id": 195,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Right, he makes a lot more than her and they’re splitting expenses equally? I don’t think this guy even cares about her much less her kid",
          "id": 196,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1733,
      "content": "'Family' trip...  \n\nSounds like your BF would rather have your kid stay at home. \n\nYes, YWBTA.",
      "id": 197,
      "comments": [
        {
          "score": 243,
          "content": "YTA. Stay at home last minute and pack his shit. Put it in the garage and change the locks. \n\nEdited for accuracy",
          "id": 198,
          "comments": [
            {
              "score": 46,
              "content": "No need for the last part - post mentions he's her boyfriend, so it's enough to move out if it's his house, or kick him out if her house.",
              "id": 199,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1536,
      "content": "YTA. While I'm all for letting children earn their privileges because that gives them a self of accomplishment and teaches them to make decisions early on, this ain't it chief. \n\nThat's like going on a family trip by car but letting your kid ride the bus instead because he won't be able to appreciate the leather seats on my Mercedes.",
      "id": 200,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1242,
      "content": "YWBTA. Just sit with your child in economy, let him sit in business. It's a family trip. You're in it together. Why would you make your son a 'second class' participant?\n\nI think that in general, it's very bad form to exclude people from parts of a shared experience, whether they are children or not doesn't matter.\r  \n\r  \nWhen you go out for dinner, don't pick the expensive options yourself and tell them to have something cheap. If you cannot afford the restaurant for all people you invite, just go to a cheaper place. If you want a fancy meal without your children, leave them at home. But don't take them with you, and let them watch you eating oysters and caviar while they get fish and chips.\r  \n\r  \nThe same applies here.\r  \n\r  \nAnd if you're worried about entitlement: Sit in economy together. Lead by example!",
      "id": 201,
      "comments": [
        {
          "score": 399,
          "content": "A very good example on a much lower cost scale, thank you.",
          "id": 202,
          "comments": [
            {
              "score": 454,
              "content": "Also, your BF is a AH for making you pay half if he earns significantly more than you, sounds like his parents fucked him up and he hasn't been able or willing to unfuck himself.",
              "id": 203,
              "comments": [
                {
                  "score": 77,
                  "content": "BF seems to have the “main character” vibe.",
                  "id": 204,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "I will also bet he regularly uses the justification “It made me who I am today”. The tough love technique hasn’t worked too well, in that case.",
                  "id": 205,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "Note that BF has \"settled on the location\".\n\nHis decision of where to holiday, OP just follows.",
                  "id": 206,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "It’s not about the class that you’re in. It’s about doing something together as a family. Why is the class you’re sitting in a factor in this supposed “family” vacation? You could be flying spirit, the point is that you all are together. Don’t exclude your son from what is supposed to be family.\n\nAlso, flying gives a lot of people anxiety, including adults. I flew once with my 17 year old and we had really bad turbulence. I remember her gripping my arm and squeezing it so tight, while giving me the most panicked look. I assured her that I was there and we would be okay. There’s nothing I could actually do if things went south, but I helped ease her anxiety. I was glad that I was able to be there for her. If anyone needs a companion on a flight it would be the child, not the adult man.",
              "id": 207,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 563,
      "content": "You're happy having a boyfriend that feels this way about your child? Sitting in different classes aside, read back what he said. That's OK with you? Wow. I feel really sorry for your child. That man doesn't like him/her. YTA (a big one).\n\nAlso this relationship doesn't sound equal, he calls the shots because he earns more, but you're ignoring the fact that he doesn't like your child, so you'd also ignore this fact.",
      "id": 208,
      "comments": [
        {
          "score": 188,
          "content": "...and they're paying 50-50. So he's calling the shots, but OP pays just as much.",
          "id": 209,
          "comments": [
            {
              "score": 97,
              "content": "Yep she’s paying 50% of the costs despite making significantly less than her boyfriend of *five years*. \n\nAre you all planning on getting married? Have you talked about what your finances are going to look like then? Red flags everywhere. YTA for even having to wonder if it’s ok to leave your kid in a different class than you.",
              "id": 210,
              "comments": [
                {
                  "score": 5,
                  "content": "Yeah… I could never date someone who wanted to split everything 50/50 despite making much more than me. Equity over equality.",
                  "id": 211,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Yep, you're right. Just lousy behaviour all around and judging from her replies OP just does not care. She will stay with this man at the expense of her child. Her child will need therapy in later life.",
              "id": 212,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "It's crazy she's paying for two people (kid and herself) but they're still splitting it 50/50. So, she's actually paying 75%  of the trip for a cheapskate who makes \"significantly more\" and has been in the child's life since 5 years old, but is still separating parenting to only her, and not committing  to anything besides \"boyfriend\". And he is calling the shots? Make it make sense. He picked a location, you're basically paying for it all. Wtf is this??? Just plain sad.",
              "id": 213,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 407,
      "content": "Your bf doesn’t see your child as family. What does that tell you?\n\nYWBTA.   \nHe is a bigger AH.",
      "id": 214,
      "comments": [
        {
          "score": 63,
          "content": "She WBTA also if she stays with this guy and he continues to exclude her child from things. She needs to take a step back and think about how this is going to play out in the long term.",
          "id": 215,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}