{
  "post content": "So I (43M) don’t think I’m in the wrong here, but my mother is very angry at me, and my best friend said I was a horrible person for saying what I did and I’d be lucky if my girlfriend didn’t put me out with the garbage, since I decided I wanted to act like trash.\n\nMy girlfriend (34F) is a preschool teacher and for some reason I can’t explain she dresses like Ms. Frizzle. Like a dress with the pattern of whatever they are studying. She makes a lot of them herself, now including matching masks. The kids love it, and the parents seem to think it’s great. I don’t like the amount of attention she gets honestly. I’d prefer if she came home and changed before running any errands.\n\nOn Friday, she helped my mom with something after work and she was still in her weird dress. I have told her before I don’t like when she dresses that way, but she tells me I don’t have to like it, but I have no right to tell her how to dress. I was upset she went out like that with my mother, and told her that my mom said she was embarrassed and to ask that she please not dress like that again if they’re going out. I was not expecting her to call my mom and apologize. When my mom asked what she meant, she told her what I said. My mom was furious, explained she doesn’t have a problem with how my girlfriend dresses and thinks it’s great she spends extra time doing things to engage her students. My mom then yelled at me for lying to my girlfriend and trying to throw her under the bus because I was being an insecure jerk.\n\nMy girlfriend and I got into a huge fight. I said she should be embarrassed to be seen in public like that. She said the only thing she was embarrassed by was me. She hasn’t spoken to me or done anything for me since. My friend said I was horrible and called me trash. I shouldn’t have lied, but I think my girlfriend should take what I think about her clothes into consideration and I’m not sorry for expecting her dress more appropriately in public. Am I really such an asshole here?\n\nEDIT: I’m sure you all will be pleased to know we broke up tonight. She said I’m to controlling and narrow minded so she broke up with me.  ",
  "id": 1,
  "comments": [
    {
      "score": 39903,
      "content": "YTA. \n\n> I have no right to tell her how to dress. \n\nyup.\n\n> My mom then yelled at me for lying to my girlfriend and trying to throw her under the bus because I was being an insecure jerk.\n\n\n\nyup.\n\n> She said the only thing she was embarrassed by was me.\n\ngood for her, honestly.\n\n> I’m not sorry \n\nand that's why you got dumped.",
      "id": 2,
      "comments": [
        {
          "score": 12718,
          "content": "That was incredibly perfect. Everything this person said is true. Also she’s a preschool teacher trying to make children happy I would love her.",
          "id": 3,
          "comments": [
            {
              "score": 5697,
              "content": "Hell, I want to hire her as my personal dressmaker. I don’t work with kids anymore, but I do work from home so the dress code is pretty flexible. I want fun-patterned dresses and matching face masks! People like OP just suck all the joy out of life. It’s like the guy who was upset that his girlfriend loves Disney movies. People can enjoy things, good lord. Life doesn’t have to be boring just because you passed the age of 18.",
              "id": 4,
              "comments": [
                {
                  "score": 1927,
                  "content": "I made myself a bathrobe out of dinosaur print fleece. Life's too short!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1026,
                      "content": "I made a poncho out of mermaid print fleece. So sparkly !",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 453,
                      "content": "It's on my list to learn how to sew my own clothes! And when I do, I'm going to pick out cute patterns and make stuff, and I dont give a damn what boring people like OP think! \n\nLife is too short for beige",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 213,
                      "content": "I just bought Christmas dinosaur pajamas.  They're adorable (and comfy). I'm 43. (The pjs are at target. Come in male female and kids sizes for the whole family).",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "This sounds amazing!",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 836,
                  "content": "Remember the guy that threw his girlfriend's glasses away because they were jars? This is exactly the same controlling bullshit.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 638,
                      "content": "Here's me, sat wearing my glasses, wondering how the hell this girl is wearing jars for glasses..?? Turns out, not what it was about. Lol",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 225,
                      "content": "These two are peas from the same AH pod for sure. They should date each other and have a full life of hatefully undermining each other's harmless sources of happiness.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 82,
                      "content": "No!! Do you have a link? I must’ve missed that one!\n\nAlso like 95% of my glasses are jars so...",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "or the one who threw his gf's socks because they didn't always match!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "And the guy who burned all of his gf’s colorful socks because he hated them, and was angry that she wasn’t grateful that he bought her a bunch of black and gray ones.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I remember that one so clearly. Why are women not allowed to have frivolous things that make them feel good and hurt no one?",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 549,
                  "content": "Been out of the classroom for awhile, but this post has me thinking of ideas for a few new education-inspired outfits. OP is just jealous that his girlfriend is more interesting than he is.\n\nYTA, OP. But, your mom sounds cool.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 517,
                      "content": "I love that his mom just dressed him down entirely with zero tolerance for his shit. His best friend, too. Seems like everyone in OP’s life knows who the true gem in their relationship is. 🤷🏼‍♀️",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 210,
                      "content": "Right?! His girlfriend sounds like a DELIGHT! \n\nOP, YTA. It's too bad you got dumped because it sounds like your wonderful ex could have really loosened you up and taught you how to enjoy life more. If you care to change and learn how to be less controlling and a better person (lying on your own mother in order to get what you want?! Dude!), I advise you to get therapy, but if you're fine with the way you are, then just leave this awesome woman alone because she is way to good for you.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I have no financial connection to this but check out svahausa.com if you haven’t. It’s all STEAM and education themed clothing. Every time I wear my glow in the dark constellation blouse, I get tons of compliments. \n\nAnd OP OF COURSE YTA.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 503,
                  "content": "I had to reread this to get that he is actually **43** and not **13**.   There is no way that someone as cool as this woman was really going out with this knuckledragger, is there?\n\nOP is so much the A.  More than words can say.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 164,
                      "content": "If OP was the last man on earth I'd happily embrace a life of bachelorette-hood. Better to be alone and find happiness in life experiences than resign myself to marriage with this grumpy old man.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I do frankly suspect a troll - how could a woman who sounds so cool and creative and confident be with such an obvious AH long enough to even MEET his mom?",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "I personally love how he’s a decade older\n\nLord, what a stereotype",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "He's also 9 years older than her and trying to dictate how she dresses while making her feel like she'd offended his mother ... so an all around class act",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "Dude same... I hate this phrase, but for real, the *audacity* of this bloke. Holy... \n\nOP, you are a horrible person. Im glad she left your insecure ass. And im glad that she loves *herself* enough to not let you shit on her happiness. \n\nRead a book on healthy relationships, fix yourself. \n\nRidiculous that youre even acting this way at *43 fucking years old!* \n\nJfc - your own mother told you you were being an ass and you still argued loooool",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 224,
                  "content": "I aspire to dress like Ms frizzle! It is my goal in life! (I am a teacher I do work with kids I love it and I wear funky shoes and my boyfriend loves them so much he bought me a pair(\n\nYta op the big giant ass.",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 168,
                  "content": "I like to sew and I make some clothes like this! I buy old bedsheets at the thrift store and make dresses out of them. I have a dress made from Star Wars sheets, one from dinosaur sheets, etc. I know it’s not for everyone, but it makes me happy, and I like being called Ms. Frizzle when I wear them. (I’m definitely not OP’s gf btw, as I am hella single.)\n\nBut if my partner ever said what he said to me about them, I would be so hurt. It’s not just the way she dresses, it’s also a deeply creative process AND part of the way she does her job. I couldn’t handle being with someone who I embarrassed with my self-expression and creativity.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 14,
                      "content": "If you ever sell your stuff, PM me. I can’t sew and I wish I could for reasons just like this, so I buy all the time from independent geniuses like you. xx",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Hopefully OP’s gf is hella single by now too",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "The bedsheets are a genius idea. I'd love to see photos of some of your stuff! I haven't made a dress yet (it intimidates me), but I've made several skirts.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 122,
                  "content": "I want her to be my girlfriend. She seems cool as hell.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 20,
                      "content": "I’m already married but I want her to be my new best friend!",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Shooters shoot. OP seems single enough hahaha",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 63,
                  "content": "Check out Svaha - they have a ton of fun dress patterns - I have a constellation themed one from them and they put pockets on everything!",
                  "id": 35,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I looooove Svaha! I have the constellation dress AND the circuit board dress, and I can’t even tell you how many compliments I get.\n\nAs for dressing for one’s students: I have a friend who is now a tenured professor at an Ivy League university, and when she does her undergrad art history survey course she actually does dress to each week’s theme. We are all in awe of her.\n\nOP, omg YTA. For not understanding why your gf does this for her ore-schoolers, for being embarrassed to be seen with her, for disliking the attention she gets, for lying to her about your mother’s reaction to her, and for being YET ANOTHER guy who is dating a woman but just won’t let her do what makes her happy.",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "I can’t sew to save my life 😩 which is one of my greatest sorrows. (I have dyscalculia; I just can’t do it, despite many attempts to learn).",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 833,
              "content": "Kids LOVE that stuff. Anything to get kids more excited about learning is great. And the fact she goes the extra mile to make these outfits HERSELF just goes to show how passionate she is about her job. Teachers like this are gems and their students appreciate it. \n\nEven if you dont like the \"look,\" it's sad you don't see her passion and fall more for her because of it. She should be with someone who does.\n\nYTA",
              "id": 38,
              "comments": [
                {
                  "score": 274,
                  "content": "Totally. OP sounds like a joyless, mean, petty bore. She is going to do SO much better.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 17,
                      "content": "And a liar and a bully, as well.  I'm glad  he showed his unpleasant, nasty, controlling colors early enough that this lovely woman doesn't have to waste one more breath on him.  YTA",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 182,
                  "content": "YTA no question. Just wanted to mention even the high schoolers like these fun outfits. I do it myself as a high school teacher. My husband supports me and thinks it's cute and it makes staff and kids happy.  The only thing embarrassing here is that she had to apologize for a lie. YOU caused the embarrassment, not her.  Grow up.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Right? There’s an art teacher on TikTok who showed up in my For You page, and I followed her because she has these amazing dresses and outfits. Bright, colorful, always themed, kind of like an arty Ms. Frizzle. I bet everyone loves her, just like OP’s ex-girlfriend.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Hell  I teach college classes and my students freak when I wear something like my tshirt of The Dark Side of the Moon album cover when we do light refraction. And I make sure to do it every damn quarter.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 401,
              "content": "I would've loved it if one of my teachers dressed like Mrs. Frizzle",
              "id": 44,
              "comments": [
                {
                  "score": 396,
                  "content": "SAME.\n\nYTA, and a big one. Who gives you the right to tell her how to dress, ESPECIALLY since everyone seems to love it and think it’s great. You need to get over yourself and not criticize her for putting in extra time to make the kids happy. Goodness just listen to yourself, you had to throw your mom under the bus to try to get her to stop, your mom. I can’t even believe how rude and self centered you are.\n\nYou are the fucking asshole.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 144,
                      "content": "Agreed! I think it’s funny that OP seems so embarrassed by her manner of dress and yet it seems like everyone else thinks it’s fab. Read the room, OP.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "I wouldn't be surprised if she left him and won't be coming back.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "Exactly! And it is preschool! Exactly the time to get kids enthusiastic about learning!",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "My kindergarten teacher had all these awesome vests, and wore such bright colors. Reminds me of this lady. I have many fond memories of her classroom.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Me too! I grew up watching The Magic School Bus and was kinda sad none of my (elementary school) teachers dressed like her. My middle school drama/music teacher came pretty close and had the same super bubbly personality and dedication to students! I still remember Ms. G very fondly and hope she remains the same optimistic, joyful and happy person she was with us kids.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 249,
              "content": "I had a 6th grade teacher that did stuff like this. He was a history teacher and always went all out. He came to school one time in armor! I looked forward to his class every day. I don't understand why this is such an issue for OP or why he feels the need to be a controlling AH about it.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "I'm picturing his gf as Jess from New Girl, she deserves better. YTA",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "For real. I'm in school to be a teacher right now and this woman sounds like my style inspiration. I've already told my husband I want to dress like Ms. Frizzle and match the topics we're learning about that day and he love the idea. YTA for sure, OP.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Oh I dunno that it was *perfect*. I think you and the person you’re replying to are in the wrong for not pointing out that the person who called the op trash was unnecessarily insulting.\n\nTo trash.",
              "id": 54,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "As a fellow Early childhood educator I also try to wear things that will help me engage with my kids. It forms better attachments and I've never had a parent or my boyfriend complain about trying to be a better educator through my clothing. If op was my boyfriend I'd leave him too.",
              "id": 55,
              "comments": [
                {
                  "score": 6,
                  "content": "Hey good luck! You’ll make a great one",
                  "id": 56,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Thank you! I try to be better every day!",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Hell, I'm not a preschool teacher and I would love a Periodic Table pattern skirt. Or a star chart, or the timeline of the Cretaceous Period...\n\nHell, I'm wearing a shirt with a picture of Einstein on it right now on a random Tuesday.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Right?!?\n\nI find it amazing to have matching outfits with the learning curriculum. This teacher sounds amazing. I'll take a Ms Frizzle for a teacher 😄😄😄😄",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1395,
          "content": "Holy f*ck, OP you are TOTALLY THE AH! YTA!!!\nAll the points listed above. \n\nYour ex is AMAZING and a phenomenal teacher, and there's nothing wrong with wearing whatever she wants wherever she wants as long as she's not violating a dress code that's gonna get her kicked out of somewhere or fired. \n\nGood GOD what an AH. \n\nI want to befriend your ex. She sounds amazing.",
          "id": 60,
          "comments": [
            {
              "score": 235,
              "content": "She does sound awesome! I sew as a hobby, and I think I might just buy some novelty fabric and make an awesome Miss Frizzle dress in honour of her!",
              "id": 61,
              "comments": [
                {
                  "score": 60,
                  "content": "This has almost inspired me to take up sewing and make my own Miss Frizzle dresses too. Time to hit up my mom for some sewing advice, I know she'd love that.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 145,
              "content": "YTA\n\nI think a lot of people love her more than OP does. Holy Smurf, I love her! Awesome teacher skills.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This! YTA , a massive one OP",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1260,
          "content": "This is one of the most clear-cut YTA posts I've ever seen.  When I first read that she was a preschool teacher, I thought you were going to say that she's dressing like a stripper or something, but making her own dresses that have some relevance to the subject that she's teaching is awesome!  And why the hell did you tell her that your mom said that she was embarrassed, when your mom said nothing of the sort?  You're such an asshole, like big time.",
          "id": 65,
          "comments": [
            {
              "score": 339,
              "content": "> And why the hell did you tell her that your mom said that she was embarrassed\n\nThat’s not surprising. It makes his mum the “bad guy”.\n\nHe clearly doesn’t know his Ex at all, though, if he thought she’d just change how she dresses without checking in with mum.  And that apology was absolutely checking in to verify the story.\n\nAnd he thought his mum should lie for him?  No indication she has a history of coddling.\n\nIn fact, it’s so cut and dry, I’m suddenly questioning the veracity of the story at all.",
              "id": 66,
              "comments": [
                {
                  "score": 42,
                  "content": "Yeah, you may be right.  It's so obvious, I can't imagine anyone who is even slightly reasonable thinking that this behavior is okay.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Oh believe me, these people exist all too often. My ex-fiance was just like this. Which is why he's an ex and also why he could never understand why he'd had so much trouble with relationships and had never had a successful one. Like OP he lied and threw people under the bus to bolster his claims and also to try to make it so that he was never at fault for anything.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "But so many people aren't even slightly reasonable.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Well I mean if a guy thinks this is embarrassing behavior, do you really expect him to be reasonable? I definitely believe this story -there are way too many stories out there of older men who unsurprisingly haven’t managed to have a long term relationship before, date someone younger then start demanding changes because obviously their opinions matter the most and the women need to change themselves for him. Reasonable thinking would be “wow, i like her but we’re clearly not compatible so i’ll find myself someone who dresses the way i like”",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "It does have the feel of something hand crafted by a skilled artisan.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Even if she did dress \"like a stripper,\" that's no excuse for him to be an asshole.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1007,
          "content": "“She hasn’t spoke for me or done anything for me since.” \n\nWHAT DO YOU THINK SHE SHOULD DO FOR YOU AFTER THAT?! \n\nYou lied to her, disrespected her, and think that you’re entitled to tell her not to dress a certain way. Apparently you need to go back to school, since you’re acting like a child!\n\nYTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA!!",
          "id": 73,
          "comments": [
            {
              "score": 209,
              "content": "And you know what's particularly awful about it? Clearly dressing like this an putting in extra effort is something that gives her joy. It makes her happy. And that's the one thing he's determined to shit on. \n\nDTMFA.",
              "id": 74,
              "comments": [
                {
                  "score": 7,
                  "content": "I’m sitting here trying to figure out DTMFA\nAll I can come up with is - the mother fkin asshole",
                  "id": 75,
                  "comments": [
                    {
                      "score": 9,
                      "content": "“Dump the motherfucker already.” Coined by Dan savage.",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 70,
              "content": "AND USED HIS OWN MOTHER AS A PAWN IN HIS LIES",
              "id": 77,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1005,
          "content": "Also notice he´s pissed beause she´s not doing stuff for him anymore. Poor baby had to get of his arse and make his own dinner or something.",
          "id": 78,
          "comments": [
            {
              "score": 408,
              "content": "he doesn't like that she gets attention, who is going to change his diaper now that he's pissed mum off?",
              "id": 79,
              "comments": [
                {
                  "score": 337,
                  "content": "I bet Mom is hoping that she gets the girlfriend in the split.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 83,
                      "content": "Adult adoptions are a thing. She could totes trade up.",
                      "id": 81,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "Poor Mom must have been hoping GF was The One, and OP might finally leave home.",
                      "id": 82,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "Mom would TOTALLY trade up if she got rid of OP and got the girlfriend!",
                      "id": 83,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 210,
              "content": "I noticed when I reread it. She hasn't done anything for me..whaaaa!",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 161,
              "content": "He doesn't seem to realize he has been dumped.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 61,
              "content": "Doing stuff like helping HIS mom with \"something\".",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "That was the part that made me finally think this was fake. I mean, how can someone be so shitty and not even realize it?",
              "id": 87,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 809,
          "content": "He’s mad because he went after a woman a decade younger than him, probably thinking he could tell her what to do and get her to do everything for him, and she turned out to not be a pushover",
          "id": 88,
          "comments": [
            {
              "score": 295,
              "content": "“Hasn’t done anything for me since” Yep selfish prick right here. Everything was in that sentence.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 187,
              "content": "and other people pay attention to her, this is so not what the OP thought he was buying when he went for the \"Diana\"",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 61,
              "content": "I didn't notice the age difference. His mom is probably mortified, knowing he will never, ever find a normal woman. If he ends up \"happy\" it's going to be with some silent, sulken, bitter woman.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Dating mid-forties with mid-thirties isn't in the inherent danger zone. I'm glad the younger member of the relationship had the maturity and intelligence to toss him to the curb.",
              "id": 92,
              "comments": [
                {
                  "score": 9,
                  "content": "We don’t know how long they’ve been dating though, OP doesn’t say",
                  "id": 93,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Bet cash money he's *conveniently* not going to make that \"mistake\" next time and by *sheer coincidence* the next GF will be 23 or something",
              "id": 94,
              "comments": [
                {
                  "score": 7,
                  "content": "Came here to say that actually.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "OP needs to get to the root of and resolve their control issues. YTA",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 772,
          "content": ">She hasn’t spoken to me or **done anything for me since.**\n\nAlso this point, 5 simple words  perfectly capture what an entitled little brat this 43 old man is.",
          "id": 97,
          "comments": [
            {
              "score": 138,
              "content": "Holy shit, I didn't even realize he was 43!",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "THANK YOU! “Done anything *for* me”? Major barf. \n\nGirlfriend seems like a delight. I hope she never does anything for, around, about, with, etc him again.   \n\nYTA a billion times over.",
              "id": 99,
              "comments": [
                {
                  "score": 6,
                  "content": "Yup, she sounds wonderful and I really hope she can find someone who at least loves her passion if not her dress sense.",
                  "id": 100,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I’m sure she will! Plus to call and apologize to mom shows she’s a class act. If she’s in the market for a BFF, I’m available.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I was looking for this comment! Like WTF thats just creapy.... damn",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Oh god, he’s forty three!???! I missed that; and just assumed he was in his twenties. Because that’s not how middle aged men act.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": ">She hasn’t spoken to me or **done anything for me since.** \n\nThat stood out to me too, I'm so glad his GF dumped him and I hope she keeps on being her fun badass self while this sad old fart stays alone and doesn't bring anyone else down with his boring, entitled, controlling attitude.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 748,
          "content": "Also:\n\n>\"She hasn't spoken to me *or done anything for me* since.\n\nBoo fucking hoo. She's a preschool teacher and already has enough children to take care of.\n\nYTA",
          "id": 105,
          "comments": [
            {
              "score": 11,
              "content": "Haha, I laughed! Wish I had gold.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 400,
          "content": "Yes!!! I love girlfriend's , I mean ex girlfriend, witty comebacks and the malicious compliance of her CALLING HIS MOM TO \"APOLOGIZE\". Either homegirl knew his mom didn't really say that and wanted to hang him or she planned to clap back, either way, well played. 👏👏👏👏\n\nSorry, YTA OP, a huge one. Better aim for 2 decades instead of one in that age gap next time, my girls in their 30s ain't taking that shit from you.",
          "id": 107,
          "comments": [
            {
              "score": 142,
              "content": "I feel like it’s kind of cynical to assume it’s malicious compliance, though. It sounds like she’s just really sweet and was actually sorry at the idea she may have embarrassed his mother. \n\nI think I may have done the same thing in her situation, particularly if I liked the mother and believed she had been embarrassed.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "😯😯😯😯😯omfg that just hit me! A GROWN ASS MAN in his FUCKING 40S just tried to use \"my mommy doesnt like it\" as an excuse and even worse a lie! I can't handle how pathetic and insecure that is!\n\nEdit: As a girl in my 20s I would also advise he leave us alone and take his bullshit somewhere else.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "PLEASE don't suggest he go Younger 😬",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 253,
          "content": "You forgot \n\n'hasn't spoken to me, or done anything for me since\n\nThat sentence jumped out at me done anything for me...... like what??",
          "id": 111,
          "comments": [
            {
              "score": 15,
              "content": "Yes.. that was a red flag for me too. Wth?!",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Also this:\n\n&#x200B;\n\n> Am I really such an asshole here? \n\n&#x200B;\n\nYeah man, you are.",
              "id": 113,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15820,
      "content": "YTA\n\n> for some reason I can’t explain\n\nhere's the reason: \"*The kids love it, and the parents seem to think it’s great.*\"\n\n> She hasn’t spoken to me or done anything for me since.\n\noh poor you, she hasn't done anything for you?  but she's your property, why isn't she attending to her duties?\n\nmaybe it's because you lied to her.\n\nor because you're a controlling jerk.",
      "id": 114,
      "comments": [
        {
          "score": 2716,
          "content": "Dear lord I hope she dumps his ass.",
          "id": 115,
          "comments": [
            {
              "score": 1206,
              "content": "From the sounds of his post, I think she has.",
              "id": 116,
              "comments": [
                {
                  "score": 469,
                  "content": "Oh thank god.",
                  "id": 117,
                  "comments": [
                    {
                      "score": 385,
                      "content": "I hope the mom keeps in touch with her. They seem to have a healthy relationship",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Just in case you haven't seen the edit yet, she dumped his ass.  Good for her!",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "My exact reaction 😂",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Socially distanced party at my crib!!!!",
                  "id": 121,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "She has",
                  "id": 122,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 205,
              "content": "My ex was just like him. He wanted me to \"slut [my] look up\" because it embarrassed him that I \"dressed like a 40 year old woman\".  Yeah, apparently business casual means you're prematurely aging.  I didn't waste another second on him.",
              "id": 123,
              "comments": [
                {
                  "score": 132,
                  "content": "I've had it go both ways. A boyfriend who wanted me sexier, and one who wanted me less sexy.  \n\n\nBOTH TIMES it was because of how they felt other people looked at me. Fucking hell why can't we just be ourselves.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Don’t you just live men who think how you look to them is infinitely more important than how you look to the entire rest of the world.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "She did, he edited the post!! Thank god she left him",
              "id": 126,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "I hope she shuts a car door on his fingers.",
              "id": 127,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 767,
          "content": "omg i missed that he was complaining she hasn't done anything for him. lmfao that's what he's most concerned about, not that everyone in his life thinks that he is an asshole",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 338,
          "content": "That line made my blood instantly boil. If you are talking about another person like that, you don’t deserve those people.",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 204,
          "content": "[deleted]",
          "id": 130,
          "comments": [
            {
              "score": 9,
              "content": "God, I hope so. I pray that this woman doesn't stay with this entitled jerk.",
              "id": 131,
              "comments": [
                {
                  "score": 8,
                  "content": "According to the edit, she broke up with him.  I’m relieved OP didn’t succeed in extinguishing her spark.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 86,
          "content": "it would have made my entire life to have a fun teacher like that when I was young. this dope doesn't know what he lost.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "Adding to the reasons why she’s doing this: maybe she just enjoys it? She gets to practice a craft and get better at sewing while making her students happy and excited. That’s super gratifying!",
          "id": 134,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": ">here's the reason: \"*The kids love it, and the parents seem to think it’s great.*\"\n\nAlso: SHE likes it. It's an aesthetic. I have friends in their 30s who dresses exactly like that. Bowties in the hair, sparkly shoes, cute patterned dresses etc. He's acting like adults aren't allowed to wear anything other than beige.   \nNot to mention that she makes the dresses herself. I mean.. sewing is dedication and a fantastic hobby and she's obviously skilled at it and enjoys it very much.   \nAnd I know for a fact that 99% of the people who stare at her thinks she looks amazing and she puts a smile on their face.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "And don’t forget, he doesn’t even have the courage to give her his own honest opinion. He blames it on mom because he knows it’s wrong. Time to toss out the trash",
          "id": 136,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "> for some reason I can’t explain\n> \n> here's the reason: \"The kids love it, and the parents seem to think it’s great.\"\n\n\n\nALSO\n\nMaybe she just GENUINLY LIKES IT.  Not everyone has to look like from a fucking factory. OP is mad that his GF has the confidence to not care abt what anyone says and to just wear what she likes and he thinks thats a BAD thing. Imagine the insecurity.\n\nAgain, OP you're an asshole. Genuinly. I typed it out for you.",
          "id": 137,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "I hope his mum dumps his ass too",
          "id": 138,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12893,
      "content": "Bro.... What? YTA Mrs. Frizzle is a treasure, she is not to be disrespected",
      "id": 139,
      "comments": [
        {
          "score": 2832,
          "content": "If I had a teacher like that when I was in school I would’ve loved it. Enthusiastic teachers are the best",
          "id": 140,
          "comments": [
            {
              "score": 900,
              "content": "I had multiple teachers like that in high school and they were hands down the best teachers the school had to offer. They just put so much effort into their lessons you can’t help but to appreciate them.",
              "id": 141,
              "comments": [
                {
                  "score": 46,
                  "content": "I can tell you that one of the things experts in the field of education have discovered over the last few decades is that unashamed enthusiasm is highly contagious in a classroom setting.\n\nEven if they're not personally interested in a particular subject, the fact that someone is so passionate about it can give participants pause and pique their interest, even if it's just to figure out why the hell the teacher is nerding out so much over the subject.\n\nAdditionally, people who are interested in a subject to the level of a hobbyist (as in they find it actively entertaining to learn, think and talk about that subject) tends to know how to highlight the most engaging aspects of a subject.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I would have failed physics in school if I didn't have the greatest physics teacher ever. He was fully enthusiastic about teaching, always gave me a chance to improve my grade by making presentations about really cool topics that got me hyped too. He'd let us do experiments and you could just feel how much he enjoyed teaching. Especially since he didn't have to, he had a Dr. and could have worked anywhere else, but he loved teaching.\n\nHe also was a huge metalhead and made sure to pass that love on to us as well lol. We'd play metal music quizzes, and he'd come dressed in his metal outfit. At school parties, he'd play. It was awesome.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 225,
              "content": "Yep. They make the biggest impact on their students.",
              "id": 144,
              "comments": [
                {
                  "score": 3,
                  "content": "Honestly having teachers that care enough to make school fun is a treat. If they can do it with a wardrobe change and just enjoying themselves it’s a huge improvement over the guy who just shows up and you know is counting the days until retirement",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 165,
              "content": "Enthusiastic teachers can change lives",
              "id": 146,
              "comments": [
                {
                  "score": 17,
                  "content": "We need more of them!! Not ones who quit being enthusiastic because their crybaby bf is embarrassed",
                  "id": 147,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 120,
              "content": "[deleted]",
              "id": 148,
              "comments": [
                {
                  "score": 15,
                  "content": "Haha! I had a teacher who never repeated a tie all year (these weren’t crazy fancy ones). It was always fun to see what he’d be wearing this time and if he’d fuck it up and repeat before the year was over.",
                  "id": 149,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "My principal (at one of my high schools-the good one) wore bowties every single day of the year. For his birthday, just about every student in the school wore one to celebrate him. He'd heard about our plan (gee, a school full of teenagers unable to keep a secret? Shocking I know).\n\n\nSo he went out and bought himself a regular tie to wear that day. Awesome dude.",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1133,
          "content": "I'm trying to imagine an episode of The Magic School Bus where Ms. Frizzle's old-ass, shitty boyfriend shows up and starts telling her how to dress.  \n\n\nIt also makes me wonder how he dresses. A lot of the guys his age I know are wearing like...free shirts they found in a case of beer.",
          "id": 151,
          "comments": [
            {
              "score": 372,
              "content": "Ms. Frizzle is too smart to fuck with dumbass dudes.",
              "id": 152,
              "comments": [
                {
                  "score": 316,
                  "content": "The voice actress for Ms. Frizzle is a lesbian, and it's my headcannon that the character is too.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 146,
                      "content": "Don’t you mean *both* voice actresses for *both* Ms. Frizzles?",
                      "id": 154,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 22,
                      "content": "I’m pretty sure the Frizz is canonically a lesbian.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Her name is Lily Tomlin, and she's a legend.",
                      "id": 156,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "I’m a straight woman but I’d totally date Ms. Frizzle.. and I wouldn’t tell her how to dress!",
                      "id": 157,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Frizzle these in a relationship with someone who is like hardcore into history or literature and they come into school wearing all kinds of crazy historical reproductions of outfits or dressing up like fictional characters.",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Ms. Frizzle is too smart to fuck with dudes, period.",
                  "id": 159,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1030,
          "content": "So I was a science teacher with red hair, and my students GIFTED ME A Ms. FRIZZLE COSTUME.   \nI took it to be the greatest honor my students could bestow. A bunch chipped in and it was a whole thing. I once wore it while chaperoning a dance and became the stuff of legend.",
          "id": 160,
          "comments": [
            {
              "score": 131,
              "content": "That is the most lovely and wholesome thing I’ve heard all day 🥰🥰",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "I have a friend who is a high school science teacher. She isn’t a red head but she she has an awesome Miss Frizzle dress she busts out for fun school events.",
              "id": 162,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "I am now crying!  I was a science teacher and a HUGE fan of Frizzle!  I love your school babies!!!!",
              "id": 163,
              "comments": [
                {
                  "score": 17,
                  "content": "When I think of these moments, I really miss teaching. \n\nBut then I think of all of the other stuff that went with it, and I'm glad I'm not doing it anymore. Particularly in the current moment...",
                  "id": 164,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I feel ya!  I will go back after COVID vaccine and DeVos is gone!  So next school year.",
                      "id": 165,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 278,
          "content": "OP was dating Miss Frizzle. If that's not living the dream, I don't know what is.",
          "id": 166,
          "comments": [
            {
              "score": 18,
              "content": "Honestly! She sounds like a treasure and this man literally doesn't deserve her. I don't understand how even making up this story doesn't make him feel a deep sense of dread as though he's lost something precious.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 78,
          "content": "Damn straight!",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": "There's even a super popular videogame that recently released a character with ms.frizzle themed skins since everyone loves the frizz so much.",
          "id": 169,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Fr he said she makes her own dresses and I had trouble reading the rest because I was fantasizing about how I might be able to make my own",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Didn't know who Ms Frizzle was. Looked it up. Saw a woman in a dress.\n\nI cannot for the life of me understand OP's position. What does inappropriate clothing mean in his world? Modest, home made, and suited to the situation? An actual statement of the wearer's personality?\n\nMaybe he'd prefer she wore only high street fashion and blended in with everyone else? Can't have women going around with personalities.",
          "id": 171,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 10791,
      "content": "YTA.  You...don't understand why a preschool teacher would dress in bright, fun, educational outfits?  This *can't* be for real, can it?",
      "id": 172,
      "comments": [
        {
          "score": 2156,
          "content": "My coworker wears fun, patterned dresses. We work with college students and everyone likes how she combines her personal quirky taste with nice dresses. OP is YTA.",
          "id": 173,
          "comments": [
            {
              "score": 664,
              "content": "Hell i work at an auto repair shop. With my husband. I wear the most random leggings. My favorite are the ones with multicolored cat heads on them. My husband has never once complained about the way I dress. He laughs sometimes when I forget to do laundry and come to work in 4 different patterns looking like I got dressed in the dark.. but he has never said a word. Haha. OP is definitely YTA.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 128,
              "content": "Whenever I wear something a little out there, the only response I ever get is happiness! Whenever I see someone wearing something bright or patterned or out there, it makes me smile and brightens my day! I have never looked at someone in a “weird” outfit and been embarrassed for them! \n\nimagine being that boring and uptight and miserable, couldn’t be me",
              "id": 175,
              "comments": [
                {
                  "score": 18,
                  "content": "I work as a painter, so my clothes have to be paint clothes. So I often find shirts with wacky sayings on them and leggings with rainbows or unicorns on them, because I can. I frequently make people laugh with how I dress and make people (and myself! since I'm stuck in crusty paint clothes!) happy. Life's too short.",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Yeah, I teach college students and wear Miss Frizzle-esque skirts when I teach. It's what I like to wear and it makes me happy.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Yaaass. My college physiology prof always wore dresses with cells, neurons, or other fun anatomical patterns. It was so fun and just adds extra energy into the classroom. And again, this was my senior year in college. I can’t imagine how fun it is for preschoolers. This guy is so beyond being the asshole.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 867,
          "content": "“I started dating a preschool teacher and for some reason she behaves in a manner appropriate to her profession??” Like sorry bro, dating an educator, you’re going to be dealing with fun dresses, silly sweaters, and funky themed earrings. Young kids love it, older kids love to prove how over it they are by pretending to hate it. Unfortunately, some 40-odd year old men are still stuck in that 12 year old phase of being embarrassed by the concept of having fun and giving a shit about things.",
          "id": 179,
          "comments": [
            {
              "score": 145,
              "content": "This teacher sounds amazing, and you’re right, many teachers do silly stuff to get the kids’ attention. My husband has to deal the dumbest t-shirts that reference English; “Metaphors be with you,” etc. That’s the life.",
              "id": 180,
              "comments": [
                {
                  "score": 29,
                  "content": ">“Metaphors be with you,”\n\nOmg I want one lol",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Haha, my husband (HS history teacher), has a black plague costume he wears when he's teaching it..... a \"got history?\" shirt thats reminiscent of the got milk ads...... a bunch of history themed coffee mugs.... an early 1900's outfit when teaching about the industrial revolution.... a picture of Teddy Roosevelt on his desk..... etc etc\n\nHis students think he's goofy as hell but they LOVE that he loves history, and it really helps them learn. The excitement is contagious! \n\nBeing married to/with a teacher is actually an experience because of this! They love what they do (they have to cause they get paid garbage)... and I love that he's so into it!",
                  "id": 182,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Your hubby sounds like one of our former history teachers. We would often wear our silly content-related tees. (I teach English) Kids really do love it. Anyone can find the metaphors tee off Amazon, btw.",
                      "id": 183,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "When I was in seventh grade, I had an English teacher that taught us the Just So Stories. I was a basic Southern California kid that didn’t know much about Kipling (or any of the discourse surrounding him now TBF) and I was so taken with the idea of the ‘Stute Fish that I made her a ‘Stute Fish hat, out of tinfoil, cardboard and extra-large googly eyes. I’m not even a crafty person, I just really liked the idea of this tiny little trickster. Apparently she loved it so much she wore it every time she taught “How the Whale Got His Throat” for years, until it fell apart. That lady fired my love for literature. If OP doesn’t understand how important it is that teachers create engagement opportunities with every tool they’ve got - visual or otherwise - then they don’t deserve to be dating an educator.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I work in adult education and nothing changes.\n\nAdults love it just as much as kids, you're staring at the same teacher all day, you've got so much on your mind (many of our students have children to care for, and night shifts to work) so it's nice to have a little fun.\n\nYou can't take yourself too seriously when you're a teacher. You have to be willing to be embarrassed if it helps others learn, or stay motivated and engaged.\n\nAfter a few weeks of dressing for the job, you don't feel embarrassed, you see the good that your style brings out in others, and it brings you just as much joy to wear.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 204,
          "content": "Literally can't. It's a negative karma farmer for sure.",
          "id": 186,
          "comments": [
            {
              "score": 21,
              "content": "What's the point of that?",
              "id": 187,
              "comments": [
                {
                  "score": 49,
                  "content": "There's this tendency on Reddit towards a \"whoever cares the least wins\" type contest. Negative karma farmers get to feel superior by getting a rise out of people, because caring is lame and emotions are weakness.",
                  "id": 188,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "I wonder if the \"GF\" wrote this. For validation or for getting over a shitty bf. 💁",
              "id": 189,
              "comments": [
                {
                  "score": 9,
                  "content": "thats what i suspected as well",
                  "id": 190,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 109,
          "content": "It can’t be. This seems like AITA porn.",
          "id": 191,
          "comments": [
            {
              "score": 11,
              "content": "Even if it's probably fake, the scary thing is that it's plausible. I've known a few people who are like this. The explanation is actually painfully simple: it's severe insecurity.\n\nMy brother in law is very similar with my sister. Very controlling of her due to childish insecurities about how she appears in public. And the concerns are benign at best. Hell, even my own father was like this with my mom, which may help explain why my sister tolerates it as normal. One of the many reasons that I never cared for my father. As you can guess, if someone is like that, then they're obviously shitty in many other ways, as well. This is just one very specific example of a much broader issue, which is the insecurity and general naivete.\n\nSo yeah, fake or not, this is plausible. If anyone wasn't aware of this aspect of humanity, then accept my Welcome to the Human Brain.\n\nAlso, I've seen more bizarre traits than this that are even more bafflingly naive. And I've only been alive for three decades. I'm not shocked at anyone calling this fake, but I'd be truly dumbfounded if people are this unaware of the dark side of psychology being plausible.",
              "id": 192,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 18,
          "content": "My husband is a secondary school English teacher and while he normally wears quite sombre suits, he offsets them with wacky bow ties and waistcoats with Shakespeare quotes on them. He has been teaching for 12 years now and has grown adults sometimes come up to him and tell him they loved his classes and the way he dressed. It makes me so damn proud! \n\nI'm glad the OP's girlfriend had some sense here. Seriously, I want to be her friend.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Smh I seriously can't tell if he's trolling or not",
          "id": 194,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "Seems like a troll",
          "id": 195,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "This is the first time I’ve hoped a post was fake.",
          "id": 196,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7285,
      "content": "[removed]",
      "id": 197,
      "comments": [
        {
          "score": 1443,
          "content": "Doesn’t seem like she is anymore",
          "id": 198,
          "comments": [
            {
              "score": 106,
              "content": "Oooooooh was there an update? I want to enjoy OPs salty tears from losing such an awesome GF",
              "id": 199,
              "comments": [
                {
                  "score": 21,
                  "content": "there's a small edit at the end of the post",
                  "id": 200,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Nice I didn’t see that edit earlier. OP got what he deserved",
                      "id": 201,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 313,
          "content": "If someone googles the definition of insufferable, I bet his picture would be right next to the description.",
          "id": 202,
          "comments": [
            {
              "score": 11,
              "content": "It would be the description",
              "id": 203,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 232,
          "content": "He's single (now at least)at 43 for a reason 🤷‍♂️",
          "id": 204,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 63,
          "content": "If he really has that much of a problem with it, they shouldn’t be together",
          "id": 205,
          "comments": [
            {
              "score": 14,
              "content": "Sounds like she dumped him since she hasn't spoken to him since",
              "id": 206,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "Oh i just ment back and read his comments trying to defend him self. What a trash human, his friend hit the nail on the head. And in the process I saw the username they used which made me want to vomit. 100% YTA OP and someone as terrible as you does not deserve someone as amazing as your (hopefully) ex.",
          "id": 207,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "she hasn’t spoken to him or “done anything” for him (because you know, even when you and partner get in a huge fight it’s totally normal to sit and lament how they’re no longer catering to your needs) since friday, i think it’s safe to say she’s on the way out! or at least i hope so.",
          "id": 208,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6396,
      "content": "YTA\n\n>I don’t like the amount of attention she gets honestly\n\nTranslation- I’m insecure and don’t like people looking at what I consider mine. \n\nLook, your mom and friend are right. You acted atrociously, you lied, you seem to think your opinion should hold more weight than her own, and when called out, you act like everyone else is being unreasonable. Why exactly do you think she should take your opinion on how she dresses into consideration? Do you take her opinion into consideration because it certainly doesn’t sound like it.",
      "id": 209,
      "comments": [
        {
          "score": 2357,
          "content": "Am I the only person who wants the girlfriend to post the dresses? She makes them herself and she makes sure they tie in with the lesson plan. AND makes matching face masks. She is a genius and I want to be her friend.",
          "id": 210,
          "comments": [
            {
              "score": 787,
              "content": "I want her to teach my kids honestly. Someone who puts that much thought, effort and enthusiasm to teaching must be an outstanding educator.",
              "id": 211,
              "comments": [
                {
                  "score": 153,
                  "content": "She’s confident & capable at her job. It makes him jealous and insecure.",
                  "id": 212,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 361,
              "content": "I literally have three dresses in my online shopping carts that would make Ms Frizzle proud, if I saw OPs ex girlfriend out and about I would run over to exclaim over her clothes. I am in my mid-30s and can WEAR WHAT I WANT. Heaven forbid that include a dinosaur dress.",
              "id": 213,
              "comments": [
                {
                  "score": 213,
                  "content": "Now I desperately need a dinosaur dress. With pockets.",
                  "id": 214,
                  "comments": [
                    {
                      "score": 109,
                      "content": "I just dropped HECKIN' BIG MONEY on an Elhoffer Design dress. They do fandom inspired clothing in small runs, and I've got a Loki dress, and I'm eyeing the Commander dress as well. Bonus: POCKETS.",
                      "id": 215,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "[This](https://www.hersecretcloset.co.uk/products/lindy-bop-rare-joy-green-dinosaur-dress?variant=32715490787412&currency=GBP&utm_medium=product_sync&utm_source=google&utm_content=sag_organic&utm_campaign=sag_organic&gclid=CjwKCAiAkan9BRAqEiwAP9X6UVLKrl18wvVODijr-S7fW2WeRVWTp31DbrrQs_Lanw39CthHibaNoRoCh5UQAvD_BwE) is one of my favourite dresses I own and yes, it has pockets. They have other designs with dinosaurs, space, dragons, unicorns etc that would make Miss Frizzle proud. My other favourite is [this](https://www.pinterest.com/pin/148126275232838839/) because it's dogs in flying saucers! Dogs in space, what more do you want?!?! And [this](https://images.app.goo.gl/C1N7HmjK3DHyGNGf6) sausage dog dress brings all the compliments to the yard! I always get atleast one compliment everytime I wear it. Beware though, people will tell you about every sausage dog they've ever met and liked. Oh, the large sausage dogs are pockets! [This](https://joanieclothing.com/barbara-dinosaur-print-button-through-shirt-dress.html) is another awesome dinosaur dress, I can't remember if it has pockets, but according to the website it does, so there you go! They also have a nice section on their website for \"dresses with pockets\" which is awesome. \n\n//forever gutted about lindybop going into administration.",
                      "id": 216,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 160,
                  "content": "[deleted]",
                  "id": 217,
                  "comments": [
                    {
                      "score": 12,
                      "content": "You must be op's nightmare. Also, glow in the dark constellations?! On a dress?! WHERE?! \n\nYTA, op.",
                      "id": 218,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "I am simply not secure enough to wear a popsicle dress.",
                      "id": 219,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": ">YTA with oak clusters\n\n*chefs kiss* perfection. You sound amazing!",
                      "id": 220,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Omg you sound so cute",
                      "id": 221,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "You are amazing!",
                      "id": 222,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 32,
                  "content": "I feel like this thread needs to know about [Svaha](https://svahausa.com/collections/adults-dresses).",
                  "id": 223,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I'm 30 and make ally own clothes - and random people coming up to me telling me I look like ms frizzle MAKES MY DAY. it's something I've been working towards for like 3 years now. Dress making is hard and takes a lot of time & energy. \n\nSure as hell hope OP is now single. He doesn't deserve a creative spirit like that.",
                  "id": 224,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "honestly I want to be best friends with this lady and have matching outfits she sounds fucking amazing",
              "id": 225,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "She sounds so cute and wholesome?? I swear from the title I thought he was gonna be mad about his gf dressing in like, tight or revealing clothes or something NOT IN CUTE WHOLESOME THEMED DRESSES \n\n(Either way he would suck)",
              "id": 226,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Those kind of dresses are in style anyway? I'm thinking of modcloth and the like. OP is not only an ass, but out of touch.",
              "id": 227,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 124,
          "content": "Ya this is likely why he is with someone so much younger than him",
          "id": 228,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 109,
          "content": ">I don’t like the amount of attention she gets honestly.\n\nNobody has ever said this about their partner without being The Asshole. The amount of attention another person gets has nothing to do with you, and frankly is not something they can control, let alone something YOU should try to control. Your girlfriend could walk around in a bra and thong and I would say take a hike and let her find someone who is secure enough to let her be herself. YTA.",
          "id": 229,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 109,
          "content": "His mom, his friend and his gf all seem like smart and reasonable people. I'm not sure how the hell this guy hasn't been ejected from their lives up til now with how utterly obnoxious he so clearly is.",
          "id": 230,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "I mean, I totally get the desire to be together in public without extra attention sometimes. Juts blend in to the crowd an be \"off\" in our own world instead of frequently interacting with others. The discussion would be something more about how OP loves how his wife does such an amazing job with her dresses and students and he loves that about her and at the same time he wants to be able to focus on just them when they're out and about sometimes and that interacting with strangers frequently changes the dynamic of the evening. It moves attention to people outside of their group and from whatever the social reason is, which usually is no big deal but sometimes might be worth a change of clothing. It doesn't sound like she always wears these amazing sewing creations though, just that sometimes she comes from work. So OP YTA and I'd totally dump you for the shit you pulled here.",
          "id": 231,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "I totally thought the same thing when I read that line!! I work with kids and have a lot of of interesting clothing items. I sometimes like to be very fashion forward with my street clothes and even started wearing my work stuff  with my regular street clothes. A lot of times they are a big hit and draw a lot of attention. The only negative thing my boyfriend has ever said was that sometimes he feels he looks plain next to me. \n\nOP YTA 100% your girlfriend and mom deserve better smh",
          "id": 232,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "No, no NO!\n\nYour interpretation is all wrong!\n\n\"I don't like the attention you get, which may be negative, ***because it is a direct reflection of me.*** \n\nAny comment or look that *may* be negative is actually a comment or look about ***me***.\n\nLike \"look at that (negative). Oh! And that guy with her MUST be a (negative) too! Let's laugh at the (negative) couple. Or just him for choosing to be with a (negative).\n\nLike how did I let my 1700s wife out of our home like that?\"",
          "id": 233,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Completely unrelated but I’m intrigued by your username",
          "id": 234,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "I noticed that ugly guys tend to be the most controlling since they have a chip on their shoulders",
          "id": 235,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3753,
      "content": "This has got to be fake. It just has to be. Nobody could possibly be this dense. But just in case you aren’t some sort of attention seeking Internet personality, yes YTA. 100% YTA.\n\nYour girlfriend is dressing in a way that makes herself happy. She is not dressing inappropriately for her profession nor for any sort of every-day activity. The fact that her wardrobe embarrasses you is your problem, not anybody else’s. On top of that you tried to shame her and make it seem like you have more support for your stance by lying about your mother’s opinion which is disgusting, manipulative behavior. \n\nIf you can’t get over yourself and this, she should absolutely break things off with you and find someone who actually loves who she is. Freeing you up to find someone who, idk looks the way you want them to.",
      "id": 236,
      "comments": [
        {
          "score": 418,
          "content": "I mean... look at the username. Obvious troll",
          "id": 237,
          "comments": [
            {
              "score": 217,
              "content": "My thoughts exactly. Nobody posts asking if they're TA and then says something like \"I'm hardly insufferable\" when they clearly are.. This person is a troll.",
              "id": 238,
              "comments": [
                {
                  "score": 16,
                  "content": "If this is a troll then... it's a really, oddly specific troll.",
                  "id": 239,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "Troll or not there's one thing we can all agree on: OP is definitely white. \n\nI don't know that I can articulate why, but whether it's fake or real this post contains fragrant notes of a particularly white variety of Shitty Boyfriend Bullshit",
              "id": 240,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Well, he succeeded amazingly. He got trending on Twitter and everything",
              "id": 241,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Pretty sure it's a throwaway",
              "id": 242,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 203,
          "content": "100% a troll. Can’t believe people fell for it.\n\n- kids love it. Parents love it\n- I hate it\n- Im a liar\n\naM I tHe AsShOle??",
          "id": 243,
          "comments": [
            {
              "score": 89,
              "content": "Still more fun to read than most posts on here lately. Everything basically rounds out to \"someone did an obviously horrible thing to me and I responded in a completely normal and justified way. AITA?\" \n\nI wanna here from more legit assholes! Nothing will ever beat the guy who ate too much sandwich.",
              "id": 244,
              "comments": [
                {
                  "score": 24,
                  "content": "lol omg that was a wonderful read. While I generally agree thats how most posts go, sometimes I feel like I'm the sole dissenting opinion. This sub loves revenge even if its not productive, constructive, or in any way good. Its like \"my boss made a rude comment so I called her a bitch and have to talk to HR, am I the asshole\"\n\nCommenters: NAH! SHE Deserved it! Fucking bitch. How dare she?\nMe: Um, you shouldnt talk to your boss that way, you can literally get fired and ruin your life. If you hate work, try to find a new job but being rude back to your boss is not helpful. \n\nHell there was a post the other day, like yesterday maybe, about a teenager who was rude to her mom and everyone was like \"YEAH FUCK HER\" and i was the one of the few being like, your mom sucks (now i remember, she was racist against asians and asian shows), but you live in her house. You can give a message that racism isnt okay without calling her a racist bitch. Diplomacy here goes a long way sometimes. \n\nBut yeah, most legit assholes wont post here because assholes arent usually self aware enough to know they were being assholes....",
                  "id": 245,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 100,
          "content": "Yeah the replies convinced me this is a troll",
          "id": 246,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 45,
          "content": "The writing style is way off for a “43” year old too.",
          "id": 247,
          "comments": [
            {
              "score": 10,
              "content": "Id say its an appropriate writing style for a immature person :)",
              "id": 248,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Plus, I don't hear many 43 year old people referencing Ms. Frizzle, isn't that a little shy of their age group?",
              "id": 249,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 39,
          "content": "God I hope this is fake. It’s frightening to think there are people this delusional walking around.",
          "id": 250,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "\"Take the dumbest person you know, and understand that's there's dumber people than them.\" I think this is one of those cases- I want it to be a troll but some people really are this fuckin stupid in reality so....",
          "id": 251,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3194,
      "content": "YTA.\n\nIn what world is she “inappropriate”? She sounds like she has confidence and a personality.",
      "id": 252,
      "comments": [
        {
          "score": 684,
          "content": "Which is obviously more than can be said for OP.",
          "id": 253,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 219,
          "content": "The only thing I could think of is that he considers her dresses immature or something a cosplayer will wear. But he *knows* she's a teacher and if he's been dating her a while, why is this bothering him *now?*",
          "id": 254,
          "comments": [
            {
              "score": 171,
              "content": "If true - and though it seems like trolling I have dated enough insecure men to know it's quite possibly real - more than anything it seems like he doesn't like that people (especially men) notice her in public.\n\nShe's getting attention from people who aren't him and he can't stand it.",
              "id": 255,
              "comments": [
                {
                  "score": 122,
                  "content": "Hit the nail on the head. His ego is so massive yet so fragile that he’s threatened when she doesn’t blend into his shadow.",
                  "id": 256,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2438,
      "content": "YTA Even mommy thinks you're an ass, that should be a hint.",
      "id": 257,
      "comments": [
        {
          "score": 543,
          "content": "Right?! If this was my son, I'd be down a son and up a daughter! Wow!!",
          "id": 258,
          "comments": [
            {
              "score": 16,
              "content": "Fr, OP deserves to be disowned",
              "id": 259,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 178,
          "content": "Dude is 43 and still using his mom as an excuse",
          "id": 260,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1352,
      "content": "YTA and honestly you seem very controlling. I’m not even going to bring up the age gap which  already red flag. But the fact that you think you have any right to tell her how to dress is appalling. Also you mentioning that she hasn’t done anything for you since getting upset?!! She’s not a toy. She’s not your maid or your property. YTA OP. big time. And I honestly hope she has enough self worth to leave you.",
      "id": 261,
      "comments": [
        {
          "score": 348,
          "content": "[deleted]",
          "id": 262,
          "comments": [
            {
              "score": 136,
              "content": "[deleted]",
              "id": 263,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 169,
          "content": "43-34 isn't a concerning age gap at all.",
          "id": 264,
          "comments": [
            {
              "score": 80,
              "content": "This. The age gap between me and my husband is 36-46. If he had ever said anything like this to me I would have told him to eat shit, and he knows this. He wouldn’t say anything like this, though, because he’s not a joyless asshole. Pre COVID we would regularly run errands and pick our kids up from school in full body animal suits (kigurumi). \n\nAnd OP, in case I wasn’t clear, YTA.",
              "id": 265,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "i’m usually critical of age gaps, but by the time you reach 34 i don’t think a 9 year age gap is significant at all. \n\nunless you are talking mental age gap, in which case OP is definitely lagging behind his partner by a good 15-20 years.",
          "id": 266,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 54,
          "content": "The age gap is not the problem, my husband is 9 years older than me and would never treat me like this",
          "id": 267,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "In that range age gaps don't matter that much.",
          "id": 268,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "9 years is not a big age gap when you’re 30+. A 27 year old dating an 18 year old is obviously a huge imbalance/abuse of power, but this is very different. \n\nThis guy is obviously an absolute controlling asswipe, but it’s not a reason to further stigmatise age gap relationships between mature and consenting adults.",
          "id": 269,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "The age gap is not the issue I think you’re a little conservative",
          "id": 270,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}