{
  "post content": "AITA here in this situation? I recently bought ingredients to cook my own food with my own money. So my dad often would use the kitchen to lounge and cook but it's usually once or twice a week. So after cooking my meal, my dad came home from eating out since he's lazy. I just came back from the gym and cooked my food for almost an hour. Him seeing the kitchen not up to his standard starts mouthing off about how dirty it is, how disgusting the area looks like and so on with sarcasm thrown in.\n\nI was so hungry after cooking that I wanted to eat first before cleaning up and still prior to that, I actually washed up the pots before indulging in my food.\n\nMy dad had too much to say and I just couldn't take it, my plate was still 3/4 full and I just had to throw it down the trash. I am so pissed off right now. What's his fucking problem? Is it wrong for me to cook? For me to eat? For me to wash it later after my fucking meal? What the fuck is wrong with him? I'm 24 so I'm an adult not a kid.\n\nAm I the ass hole? He said I'm a cry baby for taking it to heart. How are you going to finish your food when you hear a piece of shit mouthing off at what you cooked and how oily the table is.\n\nEdit: there is something that I have to add. My dad is jobless. Good for nothing men living in a house with expenses paid by my mum and me so him telling me to off what to and not to do when he contributes nothing is what made me even more pissed off",
  "id": 1,
  "comments": [
    {
      "score": 21,
      "content": "NAH. Dude just eat and tough it out. If hes always like this then let it wash off you. You made a big deal out of nothing. You didnt have to throw away the food you made. You did that all on your own. He didnt make you throw it away. \n\nAnd if this is an everyday thing. Clean as you go whike you cook. Its not that hard. I do it. And so does my chef of a fiance. Its easier to maintain and it doesnt get you yelled at. Yeah you're an adult, but youre acting like a 17yo.",
      "id": 2,
      "comments": [
        {
          "score": -7,
          "content": "Thing is, I would have cleaned it if I wasn't starving after the gym . I just haven't eaten after I worked out and my first priority is to eat since I haven't ate anything the whole morning. I get that I did the food throwing to myself but he's been on it since I was a kid. I had it with this particular incident.",
          "id": 3,
          "comments": [
            {
              "score": 12,
              "content": "But again no one made you do anything. You overreacted to something that he has done since you were a kid. Why not just tell him you'll clean it when you're done eating and to leave you alone. If hes still acting like that plug some headphones in and tune him out. Then go clean the mess. There was no reason to get so upset and throw food out that you spent time and money on. Im not siding with your dad, because he sucks, but im not siding with you either. You acted immature in the moment and he got what he wanted. \n\nWhich was you cleaning the mess right then and there, all while wasting food that you just made. If it was half of it, it would have taken you what 10 more minutes to eat the rest, THEN go clean ? Thats not long. Yeah hearing your parents bitch at you for nonsense sucks but i definitely wouldn't have thriwn away perfectly good food just because he was a jerk.",
              "id": 4,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "You're being childish, even if your dad is being unreasonable. You are getting housing out of living with him. It sucks to live under someone's rules, it also sucks paying rent and upkeeping property.",
              "id": 5,
              "comments": [
                {
                  "score": -5,
                  "content": "Read my edit. If it actually helps",
                  "id": 6,
                  "comments": [
                    {
                      "score": 12,
                      "content": "It kind of made it worse because you really stooped to his level.  Based on the edit you really should have ignored him.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Do you have a job?",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "... it doesnt, there’s nothing wrong with stay at home men.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "It doesn't it just shows that you have resentment towards your dad and because of that think you shouldn't have to keep things to his standards. Your dad sounds like a piece of work, but if you know he doesn't like the kitchen to be a messy, then clean as you cook. Waiting all day to eat and then making a mess while you cook (instead of cleaning as you go) is no one's fault but your own but you act like these things are out of your control.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Working out on an empty stomach isn't healthy.",
              "id": 11,
              "comments": [
                {
                  "score": 0,
                  "content": "I usually wake up and go straight to the gym to workout. Come home after and eat. I don't really like to eat in the morning",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "How are you gonna throw away your food you cooked bc your dad yelled at you. Come on OP, grow up you're 24, not a kid. YTA.\n\nEdit",
      "id": 13,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 9,
      "content": ">I'm 24 so I'm an adult not a kid.\n\nNot when you live in your parent's house.\n\nYTA. \n\nIt is his kitchen, so yeah, he might be upset that he comes home and it is trashed. You threw 3/4 of your meal away because you couldn't take it? Sounds like an issue. I would also assume that the fact that you were hungry post-gym probably added to it.",
      "id": 14,
      "comments": [
        {
          "score": 3,
          "content": "Yup",
          "id": 15,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -7,
          "content": "Yeah at least you get it. I was so hungry at that moment of time. Had nothing in my system the whole morning till lunch. And technically the house is under my mums. She pays the bills everything. My dad on the other hand is jobless",
          "id": 16,
          "comments": [
            {
              "score": 7,
              "content": "I get it. I 100% get it, because I have been there before.\n\nMy advice while you are living there would be to try to clean as you go. I.e., you throw some chicken on the grill, and while it is cooking, you throw away the trash you had out of clean the plate you had the raw chicken on. Or things like that.\n\nAnd besides that, I would just try to understand how hunger affects your emotions. It is pretty hard in the moment, but after the fact you often think; \"Why was I even that mad about that? Seems like a small issue\" and you can eventually attribute that to just the fact that you were hungry and irritable.\n\nDon't throw away your meal though lol, especially if you took the time to cook/prep it yourself. Sounds like a major waste.",
              "id": 17,
              "comments": [
                {
                  "score": 0,
                  "content": "Well i did clean up everything minus the oil stains on the stove and my plate and utensils. Everything else was taken care. All I wanted to is to have a nice meal but I can't stomach down my food with my dad cursing at me for such a minor issue. He thinks he's always and will always be right no matter what anyone else thinks. He smokes, he spends his money courtesy given by me since he's jobless on lottery tickets and worse of all, he constantly ask money from everyone even when I've given him enough money to go by.\n\nI regret throwing down food that I worked hard on but I really couldn't think of anything else at that moment",
                  "id": 18,
                  "comments": [
                    {
                      "score": 3,
                      "content": ">He smokes, he spends his money courtesy given by me since he's jobless on lottery tickets\n\nDon't give him money.\n\n>I regret throwing down food that I worked hard on but I really couldn't think of anything else at that moment\n\nGlad you regret it.\n\nYour explanations make it move a bit from YTA to ESH. \n\nBut overall, he is your father and you still live with him. If it is as bad as you say it is, then make progress to moving out. Start saving up money instead of giving it to him to gamble away, and make a solid plan and timeline to give up.\n\nYou threw away your food and lowered your caloric intake because you got upset. You are hurting yourself, not your dad.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "They’re married, it’s his too",
              "id": 20,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "ESH.  He should lighten up but you should ignore him.  Nobody told you to throw away your food.  \nAlso it may be time to move out.",
      "id": 21,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "Move out",
      "id": 22,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "ESH  You both overrracted. A lot.",
      "id": 23,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "What are you crying about?",
      "id": 24,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "ESH just go eat in your room, take yourself out of the situation. He’s the AH for getting on you but you’re kinda TA for just not walking away and wasting food",
      "id": 25,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAITA here in this situation? I recently bought ingredients to cook my own food with my own money. So my dad often would use the kitchen to lounge and cook but it's usually once or twice a week. So after cooking my meal, my dad came home from eating out since he's lazy. I just came back from the gym and cooked my food for almost an hour. Him seeing the kitchen not up to his standard starts mouthing off about how dirty it is, how disgusting the area looks like and so on with sarcasm thrown in.\n\nI was so hungry after cooking that I wanted to eat first before cleaning up and still prior to that, I actually washed up the pots before indulging in my food.\n\nMy dad had too much to say and I just couldn't take it, my plate was still 3/4 full and I just had to throw it down the trash. I am so pissed off right now. What's his fucking problem? Is it wrong for me to cook? For me to eat? For me to wash it later after my fucking meal? What the fuck is wrong with him? I'm 24 so I'm an adult not a kid.\n\nAm I the ass hole? He said I'm a cry baby for taking it to heart. How are you going to finish your food when you hear a piece of shit mouthing off at what you cooked and how oily the table is.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 26,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 27,
      "comments": [],
      "relation": "No"
    }
  ]
}