{
  "post content": "A friend of mine is a hair stylist and I asked about changing my hair from an auburn color to dark brown and grey bayalage. She said it could be done and that it would take a long time. When I asked how much it would be, she said we will work that part out and that we could trade... her doing my hair, and I would make her some jewelry (I am a silversmith).\n\nGot first round of hair done, went from the auburn to a light brown/dirty blonde. I was there for 7 hours, we had lunch, had some beverages and there was other down time while the product did its thing. The process was one round of bleaching then rinse and dry, one round of dark color applied then rinsed and dried, and then a grey color applied, rinsed and dried.There are 2-3 more sessions needed to get it to where I want it. It's no where near done.\n\nWe got together after and she chose some jewelry and put together some pieces I will make for her. I still owed her $200 in cash after all said and done.\n\nAfter she left, I added everything up and the total was $990. \n\nI was shocked.\n\nI asked her if that was for just one session or the whole thing and she said that was just for the first session and that it won't cost that much the next time around. She made a comment that I need to charge more for my jewelry in the future and I let her know I was being conservative with my prices and didn't charge retail....I charged family/friend prices. (All this was through text)\n\nI think that if your going to be charging your friend $1K for a service, that should be disclosed up front. I expected it would be like $300. Bad communication there, perhaps on both of our parts.\n\nHad I had known it was going to be $1K to do my hair with her, there is no way I would have gone through with it. In my eyes, that is outrageous and I do not have that kind of money to spend on my hair, and never would.\n\nPart if me wants to go back and say if she is charging full price, then I need to charge full price for my product as well and that the price of my jewelry has changed. Also that if she knew going into to it how much it was going to be (which she did say in a text) that that should have been disclosed and it was kind of dirty not telling me.\n\nThe other part of me is saying suck it up, don't say anything and just not go back to her to finish my hair. Lesson learned.\n\nAITA in this situation?",
  "id": 1,
  "comments": [
    {
      "score": 98,
      "content": "ESH \n\nSo yeah she shoulda told you up front how much \n\nYou shoulda done your research. It cost me 700-800 to dye my hair purple. Look it up. And you couldve asked her also how much it would be.",
      "id": 2,
      "comments": [
        {
          "score": 118,
          "content": "Whose dying your hair for $700, Queen Elizabeth?! I've gone to professional stylists all my life, I've had every colour under the sun and the maximum I paid was $400. And that was for several colours including getting fully bleached, black underneath, red on top and a perfectly blended rainbow fringe. Unless her friend is a celebrity stylist, she's absolutely taking the piss with her prices! $900 for one session... She's not a hair stylist, she's a scam artist!",
          "id": 3,
          "comments": [
            {
              "score": 10,
              "content": "My hairdresser (Master Stylest) worked in Honolulu and the most I ever paid was $385 (after tip). And that was the highest because it was my first session towards an almost platinum balayage with extra treatments. OPs so called friend is delusional.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -33,
              "content": "ok cool",
              "id": 5,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "Wtf\n 700 dollars to dye your hair purple. Wtf was in the dye? Precious jewels?",
          "id": 6,
          "comments": [
            {
              "score": 19,
              "content": "I get my hair cut and my roots/ombré redone at the same time and it costs me around 240$",
              "id": 7,
              "comments": [
                {
                  "score": 7,
                  "content": "You are all getting your hair cuts done bye the faery queen herself.\n\nmy hair are a very nice pink color. with bleaching, color and haircut, it costs me 120 euros. Admitedly, my hair is short. Maybe it would be a bit more expensive if it would be longer. Not 700 usd or god forbid 900.\n\ni could invest in a decent retirement plan if I put 1000usd as often as I go to the hairdresser",
                  "id": 8,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I mean I leave in Canada. 220CAD is about 165$ US dollar/141 euro",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "This doesn’t seem THAT far fetched to me. I’ve dyed my hair purple (natural color is a medium brown, so I had to do some balayage/overall lighten-ing first) and my hair is at the middle of my back. About a decade ago when I dyed my hair black (same length) it cost $300 at a MasterCuts. I could see a multistep color session (bleach, toner, color) & any necessary conditioning as a result of the coloring process running $700, especially at a salon, even if it’s a chain.",
              "id": 10,
              "comments": [
                {
                  "score": 15,
                  "content": "Tf are you guys doing. Even when I was getting my hair dyed by professionals it didn't cost me more than 70€ and that was during ny edgy long hair phase. I am talking almost all the way to my hip. That included cutting, dying parts of it red and the rest black. Nowadays I dye or  bleach myself, never spending more than 30 dollar since I buy bulk.",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -25,
              "content": "ok cool thanks for the feedbag",
              "id": 12,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "May I ask why it cost so much? I had mine done professionally to go from black to platinum blonde (never again!) and it was around 300$ all said and done. I’m from Canada, and this was in Alberta so I’m not sure if the location factors, but 700 seems like so much I am wondering why it would be so much more?",
          "id": 13,
          "comments": [
            {
              "score": -5,
              "content": "Nice I love Canada!! Im in america\nHonestly idk I had never gotten my hair dyed before. I know they charge by the bowl and my hair is super thick so they had to use alot so I'm guessing that was most of the charges. and of course they had to bleach it and all. I was there for about 5 hours. \n\nBTW i appreciate you being polite and not being aggressive as other commenters have been to my comment!",
              "id": 14,
              "comments": [
                {
                  "score": 3,
                  "content": "No worries, I was just genuinely curious. My sister had the same thing done as me and t was cheaper for the same reason, they needed less product. I guess depending on the stylist experience and ability they could charge more as well. \n\nI wouldn’t worry about other comments, some people just could never fathom spending that kind of money in hair. I couldn’t either anymore, but in high school I was guilty of dropping 800$ on extensions lol. And I’m sure your hair looked amazing too. At least I hope so!",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 93,
      "content": "ESH.\n\n>I think that if your going to be charging your friend $1K for a service, that should be disclosed up front. \n\nIt should. But you should have been absolutely clear on what it was going to cost before agreeing to it. I do think 1k is madness, but unfortunately I think changing the price of your jewelry now would be an AH move. \n\nWhat I would do, if I were you, is tell her you're flabbergasted by the price and ask her to give you a $200 discount. Tell her you won't be going back, and you'll still be giving her the jewelry, but that will be the end of it.\n\nAnd next time, know exactly what you're signing up for.",
      "id": 16,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 68,
      "content": "She isn’t even charging full price, she is charging like double of what anyone else would. I paid outrageous amounts of money in salons before but it wasn’t a friend, it was an upscale salon... \nit also sounds like she did it in her downtime or at home, in which case, you should have only been charged for the product. \nShe knew EXACTLY what she was doing, that’s why she never told you how much it’s gonna be. \nNTA but there isn’t much you can do now. It’s all been said and done. Maybe tell her you won’t proceed with finishing this project with her and see if there are any local places that offer a free consultation where they quote how much it would cost.",
      "id": 17,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 54,
      "content": "NTA it is completely reasonable to say that if she is charging full price so are you. Don’t let her take advantage of you - $900 for a hair color change (not even that dramatic IMO) is completely ridiculous.",
      "id": 18,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 28,
      "content": "NTA. Shes ripping you off. 1k on hair is sooo overpriced. Only celeb stylists can get away with charging that much. Give her the agreed price and find someone else to finish it.",
      "id": 19,
      "comments": [
        {
          "score": 5,
          "content": "To be fair OP needs a really complex comb-over.  /S",
          "id": 20,
          "comments": [
            {
              "score": 13,
              "content": "Showed this to my aunt (professional hair stylist.) she called this a full on scam. 800 for the full service. 1k on the first session alone is a rip off.",
              "id": 21,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 27,
      "content": "NTA: I would be livid if someone knew they were going to charge me that much and didn't say anything. That being said you also didn't check the price. \n\nYou may end up losing money on this and you've learned something about your \"friend\".",
      "id": 22,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 25,
      "content": "I went from dark brown to platinum blonde, only did two sessions and was only there for about three hours each session. Total I paid was maybe $600. She’s definitely over charging and you should just pay a salon hairdresser to do it because your friend is ripping you off. \n\nI would tell her you felt like you overpaid and then call a salon and ask for pricing and go there.",
      "id": 23,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 21,
      "content": "ESH. I’m a hair stylist and I see two major problems 1) you’re right. It’s a big no-no for her to preform such an extensive service without telling you exactly what’s going on/giving you an estimate of the cost. And 2) You undervaluing your work doesn’t mean she should undervalue hers. She didn’t way overcharge. Seven hours and who knows how much product adds up quickly. Grey hair needs nearly perfectly white hair underneath and getting to that from red hair is.... whoa boy. It takes a lot. Sometimes it’s just straight up unachievable in a way that won’t melt you hair. \n\nThat being said... just talk to her. Sticker shock from these insane hair transformations is really common and a good stylist should be able to come up with some reasonable solutions. But you also need to keep in mind that it is A very labor and skill intensive process and at the end of the day... a luxury service. She’s completely within her rights to charge what she thinks is fair. If she’s any kind of friend worth keeping, she will understand and want to come to a solution that will make you both feel better.",
      "id": 24,
      "comments": [
        {
          "score": 10,
          "content": "[deleted]",
          "id": 25,
          "comments": [
            {
              "score": 8,
              "content": "Okay... so you clearly have no idea of the cost breakdown or processes involved in something like this. There is no “sitting around waiting for hair to dry.” Likely, extra product accounts for ~$200-300. Then it was a triple process. One process routinely costs $200-300 depending on the location and stylists experience. And people have to pay for the “down time” aka processing, because the stylist often cannot take another client in that time. It gets so complicated that most stylists charge by the hour for a custom color like this. For someone at my salon that is fresh out of beauty school, they start at $90 an hour, and it goes up depending on what kind of color they want, the amount of hair they have, or any other add ons. If you think that’s crazy... cool. I get that. But this is also a very labor intensive process that is not a necessity, but a luxury.",
              "id": 26,
              "comments": [
                {
                  "score": 6,
                  "content": "I went from red to pink in a professional salon. It took 2 bleachings and coloring/styling. Costed me 120 euros.\n\nwhat are your products made of ? Faery powder and unicorn tears ?",
                  "id": 27,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Red to pink is a very easy transition, it’s basic color theory, and the pigment itself obscured a lot of imperfections that become hugely apparent in very light/pastel colors. And you had one solid color in the end. Even then, I’d say you got a hell of a deal or prices are just very different in the US vs. Europe. \n\nNot only is Silver or grey hair the hardest look to achieve and maintain, you and OP had completely different processes done. OP had a color correction from Auburn (which is usually a level 5 or 6 with heavy red tones needing to be taken to a level 10 and all NRP removed) a balayage with a base color, then a fashion color application on top of that... your example isn’t even remotely a good comparison to what OP asked for. Then there’s the fact that price varies drastically depending on what city/country you’re in. Additionally, not all color lines are equal. Although... I can promise there were no unicorns of fairies hurt in the creation of the line I use. One of their biggest points of pride is that they’re 100% vegan and certified cruelty free. I couldn’t tell you if it’s better than or comparable to the line you used without more information. But yeah, it makes a difference.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "[deleted]",
                  "id": 29,
                  "comments": [
                    {
                      "score": 3,
                      "content": "You’re absolutely right... the friend should have been more upfront. But you seem to be arguing that her time and skills just aren’t worth what she charges. You’re  being a condescending about her prices, especially given that you are clearly not very familiar with the industry. A thousand dollars, while very expensive, is not out of the realm of normal given what she started with and what she asked for. And if you could find it cheaper near you... great. Congratulations. And it’s equally condescending to say that the only thing she deserves to be paid for is when she’s standing there, touching the clients hair. Time in her chair is valuable. You and OP are belittling her friends profession because you think you know better. The fact is, you don’t know. If a stylist can’t get people to pay her prices... she’d lower her prices or go out of business. I’m here, as another professional in the same industry with years of experience, saying she should have been clearer about the price but that she didn’t overcharge or cheat anyone and you’re telling me all the reasons I’m wrong with no experience or expertise to back it up.",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "*edit* I was hoping I could attach a photo of color before and after but I can't...still learning this platform:)\n\nI am in no way undervaluing her time, skill and cost of products, I do understand all of that plays a factor in price. \n\nIt really was both of our bad...I was too trusting of the \"we'll work it out\" answer to the cost before it was done and had my own assumptions about what I thought that should be (I did research as well). I should have asked more in depth questions. And she should have been upfront of what it would be from the beginning.\n\nAnd yes hair (and jewelry) are both luxuries.",
          "id": 31,
          "comments": [
            {
              "score": 1,
              "content": "I’m sorry, I don’t see a photo. It would really depend. You said somewhere else that you have pretty long and thick hair and you’re in California, which is kind of what I thought just based on the price. Without knowing much else, I would tell you it would likely cost about 700 at my salon. But I’m in Denver, so my base prices aren’t as high as The ones you would generally see in California. From there it could go up depending on a few other things like whether you’ve ever colored your hair before (and if your friend told you you needed at least two more sessions to get you to silver, it makes me think she’s trying to break through some old color on your ends). California is notoriously expensive, especially in more urban areas, but a triple process with grey hair as the desired result is no joke.",
              "id": 32,
              "comments": [
                {
                  "score": 2,
                  "content": "I thought I could attach a photo but I can't, sorry! Still learning the platform.\n\nI just need to have more of a conversation with her us what it boils down to. And no matter what the outcome, lesson learned. I appreciate the perspective and comments from you!",
                  "id": 33,
                  "comments": [
                    {
                      "score": 2,
                      "content": "That’s probably for the best. But don’t let her off the hook, she absolutely should have had a discussion with you about the price before she even touched your hair with color of any kind. If she took a detailed hair history, she should have had a reasonable estimate from the get go. It’s not cool that she sprung it on you at the end like that.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Agree. ESH",
          "id": 35,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 15,
      "content": "NAH - I think this was an example of just poor communication. That's honestly not crazy expensive for the amount of work she'll need to put into your hair to get what you want. Balayage is expensive just in general, plus there's all the bleaching that needs to be done, and the fact that doing it right so that your hair doesn't get screwed up typically adds a premium cost.  \n\nI think it would be worth it to have a discussion with her (when you're calm) about expectations in terms of a trade and if she's giving a discount or not, and then don't give her a discount on your products if she's not doing the same for her services.",
      "id": 36,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 13,
      "content": "Wife is a stylist and grey is one of the hardest colors to get to and takes lots of work to get there from anything, especially a brown or other darker colors. It seems pretty standard for that long, color corrections can be even more expensive and take longer as well.\n\nI'm going to go with NAH, but it is important to ask pricing before major jobs like this take place, they could have given you at least a rough estimate of hourly charge(if they handle that stuff as a color correction and some do because it is that much of a pain in the ass) or even a normal price for the service with a side note of it can go higher depending on how your hair reacts/behaves.\n\nJacking up your pricing does seem a bit assholish after the fact when it was all just a lack of communication to begin with. Hair stuff is expensive.",
      "id": 37,
      "comments": [
        {
          "score": 2,
          "content": "Sorry, you just reminded me of my grandmother. Not the wording or anything, just the difficulty getting to grey. You see, my grandmother had a nickname when she went to school that essentially was calling her a cotton-top. Before she graduated high school her hair was completely white. Bet a lot of women would like that problem nowadays. No need for the bleaching step. 🤣",
          "id": 38,
          "comments": [
            {
              "score": 2,
              "content": "Lol, I'm actually naturally pretty grey (partially) and want a way to let my natural hair color grow out and not have to dye my hair anymore. But still look cool 🤣",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}