{
  "post content": "\n\n2 weeks ago my son [Ethan, 27]and his wife [Jess, 30] bought a small one story house in the town we live in. After settling down they invited us for a small party for the occasion.\n\nWe sat for dinner and talked about the house a bit. Me, my husband and Jess continued conversing after Ethan excused himself to take an important call. Jess showed me the original key to the house and I asked if she made copies yet and she said no. I said she should and also give one copy to me as well. She looked at me funny and asked why she should. I explained that it is necessary so that it could be used in emergencies. she rudely said \"I don't know what kind of an emergency that would require you having a key to our house, sure won't be a fire incident!\". She obviously didn't seem to have any idea that a fire incident wasn't what I meant and I got offended by her sarcasm. I pointed out that it's not just her decision because this is my son's house as well. She smiled at me trying to be polite and stated that only the ones who contributed towards the house get a copy and that I really don't need one anyway. Also assured me that my son will have the same answer for me. Basically saying \"Don't bother bring this up with Ethan, he'll tell you the same thing\" but I did and she spoke on his behalf the entire argument repeating what she said over and over. Things escalated to her calling me pushy and me telling her she was being unnecessarily rude and disrespectful .\n\nMy husband and I left in a rush and I felt horrible. My husband went on and on about how paranoid and controlling I was to basically be \"demanding\" a copy of the key to the new house but again I stated that I was just trying to be helpful and taking extra precautions since anything could happen but he insisted I overstepped and ruined Ethan's and Jess's joy for their new house as well as dinner.\n\nI genuienly do not think what I said was out of line and I'm not sure why Jess reacted so intensely. I think my request was innocent.",
  "id": 1,
  "comments": [
    {
      "score": 43991,
      "content": ">My husband went on and on about how paranoid and controlling I was to basically be \"demanding\" a copy of the key to the new house\n\nHe's right. YTA\n\nEdit: So this blew up quickly. Thanks for the upvotes and awards.",
      "id": 2,
      "comments": [
        {
          "score": 35818,
          "content": "It's all about phrasing.\n\nDo people *offer* copies of their keys to trusted family members in case they get locked out / need their plants watered / etc.? Yes, definitely.\n\nThe key word is offer, though.  You said to two adults \"you'll need to give me a copy of your key,\" which is why YTA. And then you doubled down by continuing to push. Even if you'd said \"hey, if you wanted us to keep a copy of the key for you for emergencies\" and then left it alone, you wouldn't be TA. \n\nSo phrasing. And I imagine, tone.",
          "id": 3,
          "comments": [
            {
              "score": 10286,
              "content": "This is exactly what I was going to say - if she had phrased it as advice and suggested that they offer a key to a close friend or neighbor in case of emergencies then it would have been taken completely differently. She DEMANDED a key, which makes OP look creepy and seem like they want to look around the house while they are gone.\n\nOP - YTA",
              "id": 4,
              "comments": [
                {
                  "score": 12349,
                  "content": "**It's all about the attitude.**\n\n>Things escalated to her calling me pushy and me telling her she was being unnecessarily rude and disrespectful.\n\nOP is both pushy *and* unnecessarily rude and disrespectful (of their boundaries). It's their house - she doesn't get to demand copies of the key. That was out of line. \n\n*Offer* in case of emergency, yes.\n\nDemand, no.\n\nIt seems like OP is really disrespectful to DIL in general. She thinks that Ethan's call can overrule Jess's and he has more of a say regarding the house.\n\nYTA.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 7418,
                      "content": "Furthermore, keys to a house is a “two yeses, one no” type of decision. With a “no” on the table it was already resolved.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 439,
                      "content": "Precisely. Both my parents and my husband’s have keys to our house. We OFFERED these keys, and these keys are only used to take care of our cat when we are out of town or if we specifically request them to use the keys. It’s about respect and attitude.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 374,
                      "content": "My aunt and uncle have a spare key to my apartment.\n\nHowever thats because my elderly grandma, my aunts mum, lives with my sister and myself and if she falls and niether of us are there, or she cant get ahold of us (we both work, my sis has school and I have regular appointments)  then my aunt who doesn't work can get into the house to help her/call an ambulance.\n\nBut thats because there is a chance of emergency where entering the house would be extremely time sensitive and a lock smith would  probably be too long of a wait.\n\nFrom the sounds of this post this isnt the first time the DiL has dealt with OPs controlling behavior.\n\n even tho OP said \"it isnt just her (DiLs) house\" she tried to bypass her DiL and would of probably just used her sons \"yes\" (if he said so) to get keys made.\n\n So kinda hypocritical if that was her plan when talking to her son.\n\nI think that DiL interjected the convo between OP and her son because it sounds like OP was trying to use her son to interfere/overstep with their boundaries and probably wanted to see if she could make him cave and give her a key.\n\nThere may of even been a pattern of this behavior in the past.\n\nAlso OPs husband wasnt on board with this thing and even called her out on it and (again) it sounds like this probably isn't a one off thing. Heck, DiL also said a key wouldnt be needed incase of a fire (so its possible that she used that \"reason\" before).\n\nTbh DiL was probably repeating herself and being a \"broken record\" in order to not allow wiggle room for OP to try and change DiLs or her sons minds",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 244,
                      "content": "Also the fact that MIL tried to undermine OP and go to her son was totally disrespectful. I’m glad the husband stuck by his wife’s side.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Judging by the daughter-in-law’s response, this is probably not the first time OP hah been pushy, or over stepped. Maybe OP should peruse r/justnoMIL and read up on other stories about pushy MILs. If she recognizes herself, it’s not too late to work on changing her behavior and improving her relationship with her son and DIL.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "You can tell by DIL reaction this isn’t the first time OP has been rude and disrespectful to her. The very thought of thinking you can go over a grown adult’s head by asking their spouse is so laughably disrespectful - that is what my four year old does when I say no the a lollipop (but even he isn’t being disrespectful, just doesn’t know any better).\n\nYTA op.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "This is where I come down on so many AITAs. Offer or ask, once, sure. But what gets characterized as an offer is so often a repeated demand that OP won’t drop , and that’ll nearly always put you in AH territory.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Yup. I think it’s telling she waited to bring it up until OP’s husband left the room, then basically threw it in DIL’s face that she was going to try to “go over DIL’s head” so to speak to demand it from her son after Jess already told her no. It really looks like she was intending to try to steamroll DIL.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "It strikes me as super manipulative that OP started by cornering DIL without her son present, and then went to her son to “override” the no she got.  \n\nFeels like this is either a power game where she wanted her son to overrule DIL in the first place, or she’s trying to pit them against each other for some reason.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 640,
                  "content": "Definitely. And OP made it completely clear that she was overstepping rather than just being thoughtlessly 'helpful' when she argued with Jess that her son could overrule her decisions in the house she just bought. \n\nThis was obviously a dumb and entitled attempt at a pissing contest with her daughter-in-law. \n\nBig YTA, OP.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 115,
                      "content": ">This was obviously a dumb and entitled attempt at a pissing contest with her daughter-in-law\n\nAnd she lost it. Epically. If the OP was wondering where her son's loyalties lie and how much power she has in the dynamic, she knows now.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 266,
                  "content": "That's exactly what she wants to do. She'll wait til she knows everyone is at work or out of town(including her husband), and then go in her son's house as if she owned it. She'll read all their mail, look through their bedroom closets and drawers, *specifically,* and if she's anything like MY mother was, will be sitting there with any \"contraband\" displayed on the coffee table DEMANDING AN EXPLANATION ABOUT ALL THIS when they get home from wherever they went. \n\nOP,  YTA.  So hard.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 122,
                      "content": "So glad my ex-MIL never got a key! It was bad enough that she would show up @ 7:30 am for a “visit” when I had a baby. Since my baby didn’t sleep through the night until she was 2, I tried to get all the sleep I could when she would sleep. Nothing squirrels the day like a OCD clean freak showing up to your messy house while you’re still in your pajamas with a messy house and a screaming baby that SHE woke up.\n\nSorry for the rant. She’s been dead for years and I still get furious with her antics.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "OMG. And I thought *I* had the world’s most controlling mother! Mine had a key to my house because she would pick up my daughter from day care and bring her home while I was still at work—I was divorced from my Evil Starter Husband and needed the help. The key was supposed to be used only for that or emergencies. But she took it upon herself to let herself into my house whenever she damn well felt like it. (I had a key to her place, too, but never used it.)\n\nShe did lecture me once about a very private Polaroid my daughter—preschool age at the time—found in my nightstand (and I still have my doubts as to whether it was really my daughter who did it), but at least she didn’t display it on the coffee table!\n\nShe did, however, once show up and clean my house while I was at work, and then get all butthurt that I was not falling all over myself with gratitude. I was pissed. I had a lot of clutter, but I knew where things were. And she decided where to put things away in *my* house, and there were several things I never saw again until I was packing to move a few years later! She loved to pull stunts like that—do something I didn’t ask her to do, didn’t want her to do, and then expect to be thanked.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Holy shit! What!? That's madness.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "....and when she finds birth control pills or condoms during her surprise inspections she'll add accusingly \"and it's no wonder I don't have any grandchildren yet!!\"",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 239,
                  "content": "This was totally a conversation to have with her son too. Why OP waited until he left the room and then accosted his wife, I do not know... or now that I think about it, maybe I do.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 24,
                      "content": "You do.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "*\"Why OP waited until he left the room and then accosted his wife, I do not know... or now that I think about it, maybe I do.\"*\n\nShe did it because she didn't want to approach them as a united couple. She figured if she pressured each of them separately, one or the other would cave. Then she could put the screws to the other with the \"Well, so-and-so said it was fine\" trick.\n\nI'll bet that when Copter-Mom was a child, she often tried playing her own parents against each other to get permission, favors, a bigger allowance, etc.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "My dad used to say, “If you go looking for trouble, you’ll find it.”",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 131,
                  "content": "Or drop in unannounced.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 110,
                      "content": "Or drop in while they're at work.\n\nEasier to snoop that way.",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 90,
                  "content": "> if she had phrased it as advice and suggested that they offer a key to a close friend or neighbor in case of emergencies\n\nAnd if she _let it go_ when it wasn’t received well.  This looks like a good idea gone south through miscommunication and not knowing when to shut up. YTA",
                  "id": 28,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Eh, I get the feeling that DIL said 'No' right off the bat because OP has a long history of being pushy and nosy.  No good ideas gone south, just pure self interest and meddling poorly hidden under a cheap tacky veneer of 'well meaning'  that would fall off in just a week or two if she got her grubby mitts on a key.",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "It wasn't received well because it wasn't a good idea. DIL must have had past experience with OP overstepping boundaries. I wonder if OP will now announce to her son that DIL said *yes*, and try to get him to make her a copy. Sure hope DIL went straight to her hubby to tell/warn him about the convo.",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 78,
                  "content": "Look around while they're gone or barge in while they are expecting alone time in their new home.",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 57,
                  "content": "because she totally would have",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "But *gasp* if she only offered, what if they decided to give the for emergencies key to…someone *else*?! \n\n/s\n\nShe wanted control and power.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "We all know what kind of things OP would probably consider an emergency. She'd probably show up if they didn't respond to a text in an hour and say \"Well, I thought maybe something had happened so I decided I'd just come check on you\", \"I thought that painting in your living room was just so ugly and I couldn't stop thinking about it, so I got rid of it for you\", etc...  The casual way that OP just demanded a key as if it was totally normal then flipped her lid when being told no is just so creepy.  \n\n\nNot only was she creepy and demanding, she apparently has no respect for her DIL.  DIL isn't allowed to say no to her, only her son is apparently allowed to say no to her (and she probably thought she could bully him into a \"yes\").  OP, YTA.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 463,
              "content": "I agree… I have my parents house keys and my parents have mine, but it all boils down to the tone. OP sounded like she was giving an order (hence YTA), and quite possibly DIL immediately imagined OP was going to use the keys for more than emergencies",
              "id": 35,
              "comments": [
                {
                  "score": 788,
                  "content": "It also smells to me like a situation where mother in law already has trouble understanding boundaries.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 443,
                      "content": "Yes.  I got the strong sense that there's a lot more context to this story.  I wonder what their relationship is normally like.\n\nETA:  It looks like in another comment the OP said that her DIL suddenly stopped visiting with her son six months ago, but OP has no idea why.  Missing missing reasons all over this one.  She literally has no idea why her family suddenly stopped visiting and she never bothered to ask?",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 298,
                      "content": "Right. The fact that Jess brought up that OP should not even bother bringing it up with Ethan, because he’s going to have the same answer tells me a lot. It sounds like she has tried to lay down boundaries before with OP and when OP doesn’t get her way, she tries to persuade Ethan to go against his wife. Jess may sound curt and dismissive, but I’m guessing that niceties have not worked with OP in the past and this firm boundary setting is necessary.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 192,
                      "content": "Exactly. They have been grey rocking them for 6 months. And the OP\"s hostility isn't coming from nowhere.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 91,
                      "content": "I bet there's an upcoming post to r/justnomil",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Ding! Ding! Ding!  I feel so bad for DIL, because just reading OPs tone is like nails on a chalkboard.   And the way OP was trying to pit DIL and husband against each other is appalling!  Clearly based on DIL's response, I have a feeling that is a regular occurrence as well.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 396,
                  "content": "We gave my MIL a key for emergencies and she used to stop by to do things in the house that she felt was “helping”. I found it incredibly intrusive and wish we hadn’t given her one. This MIL sounds like the DIL may have a reason to be cautious.\n\nEdit: we have moved and haven’t shared our new keys! Thanks for all the well wishes!",
                  "id": 42,
                  "comments": [
                    {
                      "score": 170,
                      "content": "Yep. /r/justnomil is full of stories of pushy MILs using their key to snoop through their adult children’s belongings while they’re out of the house. Probably what OP’s DIL is worried about.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 108,
                      "content": "You're allowed to change the locks it's your house. 😉",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Yep, and I think when OP started insisting on having a key, alarm bells started going off in DIL's head. I wouldn't be opposed to giving my parents and my in-laws spare keys to our home in case of an emergency, but once someone starts telling me to make them a key, I'd be instantly suspicious and wonder what they're really planning to use it for.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I have a key to daughter's house. I have never gone over unless asked.",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "This would be my parents. Though, some things are nice like dropping off meat from the market by them so I don’t have to trek down there. We opted for an electronic lock with passcodes that I can let them in remotely or they can only use their code during specific times so they have to give me a heads up. Works like a charm!",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "My daughters MIL did that, she would literally do their laundry and put it away - including undergarments. My daughter was mortified and it took her months to get up the nerve to stop it.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I moved back to my hometown a few years ago and bought a house. After changing all the locks, I did give keys to my family members. However, I knew that it would be used to stop by unannounced. Sometimes it's great, like the time I came home from work to find out my parents had come over and cleaned my yard up. Other times, it's annoying, like when I'm sleeping in on a Saturday and my mom decides to stop by to chat at 9 in the morning. \n\nBut YTA for demanding a key. It's up to the owners of the house to decide who gets access.",
                      "id": 49,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "Change the locks.  Just asking for the key back won't mean she didn't make a copy.  Then when she calls that she cannot get in, ask her what the emergency is.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 191,
              "content": "I bet this is not the first run in with MIL for wifey.\n\nYTA",
              "id": 51,
              "comments": [
                {
                  "score": 7,
                  "content": "That was my thought too. I am glad the daughter-in-law has asserted personal boundaries. Nobody gets a spare key “just because”. Much like respect, and trust, you have to earn it. \n\nOP, lay off. *Let them tell you what they’re going to do — butt out and stop being intrusive.* If they lock themselves out, oh well. A spare is helpful, but not mandatory. And who says you’re the one who gets to have it???? YTA, op! You should apologize.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I think it's also about \"asking\" for a spare key. Even in OP's recounting of her story she never actually ASKED for a key, she DEMANDED a key. Then got offended when she heard no.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Based on the automatic response of her daughter in law, I believe this is not the first time she has overstepped boundaries in regards to them.  Her husbands words in the car seem to confirm this.  On the face of it, I don't find her request for a key to be out of bounds, especially if they are the closest relative to her son/DIL.  But the almost visceral reaction of the DIL, and her assurance that her husband will back her up, leads me to believe this is more than a simple request for emergencies - at least in their minds.  How much has she meddled in their lives in the past?  How many boundaries has she crossed previously?  I imagine her son/DIL have already had this discussion about his mother's access to them.  Perhaps we should check r/JUSTNOMIL to see if the DIL is posting about this same thing.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "This. OP thinking it makes sense to have a copy of the key is fine. Telling your DIL to give you one then essentially telling her that her feelings don’t matter and you’ll just get the key from your son? YTA.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Also why her necessarily? One of my brothers has a key to my house for emergencies. When I worked in another state a trusted friend had a key. I have never utilized a parent for that - not that there is anything wrong with that I just used the person who I trusted who lived closeby. Sometimes parents forget their kids have grown up.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Yep. She didn't offer and when she told MIL no, it should have been dropped.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": ">So phrasing. And I imagine, tone.\n\nLet me put on my Captain Obvious hat to say that what we're really talking about here is '***intent***'.\n\nWhat is OP's ***intention*** in asking?  It's clear that her ***intention*** was a bit of control with a heaping of entitlement on top.  OP is the matriarch, so she NEEDS to have a key just in case, and don't ask WHAT case because it doesn't matter.  She's the matriarch, GIVE HER THE KEY!\n\nLet me also suggest that seeing how quickly DiL went from incredulity to defense to offense...\n\n...that this is far from the first time that OP demanded power and privileges that she didn't deserve or earn.\n\nOP is YTA and if she doesn't change she may just find herself cut off from her son and any/all future grandchildren.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Don’t forget basically saying “and my SON has more control over this anyway and will override you” effectively telling her she means nothing and ranks higher than her son’s wife. Oy. YTA",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 703,
          "content": "Exactly! YTA OP no means no but you kept pushing. I'm wondering though if DIL has a copy of your house key and wether you'd be open to give her one.",
          "id": 60,
          "comments": [
            {
              "score": 19,
              "content": "Doesn't really matter because the DIL would never even want to enter the MIL's house. I can imagine the MIL easily agreeing to giving her son a key to her house. But it's just not the same. \n\nBetter not to bring it up at all or else the MIL will say: I gave you a key to my house, so where is my key?",
              "id": 61,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 472,
          "content": "Yes.  YTA.  If you were really “just trying to be helpful” You would have accepted  her saying “NO” the first time.  Furthermore, just because it is your sons house, you do not have  the right to ask (demand) a copy of the key.  I have a feeling you are the type to come over (uninvited), start snooping through drawers (to “look for something”) and then clutch your pearls when you find their sex toys.\n\nADVICE:  check out the “justnomil” sub.  Learn how not to be a pain in the ass MIL before your son decides to go low contact with you for pissing off/frustrating/annoying his GF/wife.",
          "id": 62,
          "comments": [
            {
              "score": 71,
              "content": "If her DIL is on Reddit, I'm pretty sure that we'll be seeing a post on there shortly.",
              "id": 63,
              "comments": [
                {
                  "score": 71,
                  "content": "Maybe.    The DIL seems like the type that can handle herself though.  She shut this shit down with quickness!  Her FMIL is in for a rough and bumpy ride if she doesn’t get her head out of her ass!",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Exactly. \"Ethan why do you have those disgusting sex vibrators in your house!?!?!? AND A FAKE BLACK PENIS?!?!?!?!?! You weren't raised that way!!!!!!!\"",
              "id": 65,
              "comments": [
                {
                  "score": 23,
                  "content": "I for sure was not raised on fake black cock.\n\nWe were an organic household.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "When **i** purchased my home, my husband and I weren’t even engaged at that point.  His mom requested a copy of the house key, just in case of an emergency. And then couldn’t understand my confusion, because she lives in a different state, almost four hours away. \n\nMy own mother- who lives 20 minutes away- doesn’t have a key. \n\nAnd the ONE TIME my mil house sat for us, she did all of the laundry, including stripping OUR bed and put everything away. Which absolutely wasn’t cover for her snooping through everything.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 302,
          "content": "Glad her husband is willing to call out her bullshit at least",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 191,
          "content": "> this is my son's house as well\n\nUhmm she's very entitled to be honest",
          "id": 69,
          "comments": [
            {
              "score": 19,
              "content": "Yeah I'm failing to see how she takes the words \"my son's house\" and somehow gets \"my house.\" Her adult son also does not owe her a key.",
              "id": 70,
              "comments": [
                {
                  "score": 13,
                  "content": "Because parents like this see their children as purely an extension of themselves that they get to lord over, as opposed to a separate human being who’s no longer in the joey pouch.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 123,
          "content": "He is.  And I’m willing to bet this is exactly why OP won’t be getting a key to their house - she won’t respect their boundaries and will push and bully to get her way.\n\nYTA",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Piggybacking to add:\n\nDid anybody notice the tidbit where OP gave us this interesting line: \"She obviously didn't seem to have any idea that a fire incident wasn't what I meant\"\n\nFollowed by this nice tidbit: \"but again I stated that I was just trying to be helpful and taking extra precautions since anything could happen\"?\n\nOP is a liar, a potential snoop, and an AH.",
          "id": 73,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "I wonder how OP would justify herself snooping in their house?",
          "id": 74,
          "comments": [
            {
              "score": 26,
              "content": "Cleaning, it's always cleaning. They're just so helpful:/",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "“I called you both (son and daughter-in-law) and since you didn’t pick up, I thought it might be an emergency and let myself in to check on you. When I was there, I noticed some things. What on earth is your clean laundry doing just sitting in a basket getting wrinkled? My son’s shirts in the closet aren’t ironed either!”\n\n-OP, probably",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "This. Normal people don't get upset if their offer of helping is rejected. The fact that you kept pushing the issue shows it was not about being helpful. It was about you inserting yourself into and taking control of their accomplishment.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Indeed you sound like an overcontroling menace...\nItt is totally not up to you to decide anything about this new family, you had yours, once dear son of yours leaves the house your 'responsability' is over. You better apologise to your daughter in law about putting her in a place 'where it is not only her to decide' because this will explode in your face and righteous so. Respect her, your son choose to live his life with her. Up to you if you want to be part of that or end up lonely crieing on some facebookgroep for 'estranged parents' not knowing why your baby cut the ties with you. \n\nSomething in my gut says you will not, so better brace yourself: your winter is coming. \n\nYTA \n\nBIGTIME",
          "id": 78,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 19085,
      "content": "[deleted]",
      "id": 79,
      "comments": [
        {
          "score": 4499,
          "content": "But the house is small! Surely that must make a difference, else why would she mention it?",
          "id": 80,
          "comments": [
            {
              "score": 2584,
              "content": "[deleted]",
              "id": 81,
              "comments": [
                {
                  "score": 1520,
                  "content": "It is small so faster for her to snoop through while they are at work.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 852,
                      "content": "[deleted]",
                      "id": 83,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 609,
                      "content": "This is it. Against our better judgment we gave my in-laws a key. We went on vacation soon after and they apparently let themselves in and snooped around. We only knew because our bathroom has a dim \"nightlight\" switch that they hit and didn't notice because it was daytime. The next time they went on vacation my husband let himself into their house and took the key back.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Exactly",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 368,
                  "content": "It seemed to imply that there is something childish about a small house.  Like son and DIL are only practicing being homeowners, therefore mommy dearest must step in and be in control.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 52,
                      "content": "They won't even make me a single grandbaby, can you believe that!?",
                      "id": 87,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "Yep",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 245,
                  "content": "*nods head in agreement* YTA",
                  "id": 89,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 440,
              "content": "Yes, it’s a mere one story and we know how many more emergencies occur without a second or third, her son is barely safe as is and should consider moving home now.",
              "id": 90,
              "comments": [
                {
                  "score": 76,
                  "content": "On the plus side, fire incidents are less of a concern in a one story.",
                  "id": 91,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "You've clearly talked to my mom",
                  "id": 92,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 124,
              "content": "[deleted]",
              "id": 93,
              "comments": [
                {
                  "score": 26,
                  "content": "Or \"They aren't giving me any grandbabies.\"",
                  "id": 94,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "Or \"my son is a perfect angel baby and I don't understand why he married that girl when he could have done so much better.\"",
                  "id": 95,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "Glad I'm not the only one that noticed this unnecessary bit of information.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "And it’s only one story. And the party was small.  As soon as I read that first paragraph, I already knew she was TA",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 693,
          "content": "[removed]",
          "id": 98,
          "comments": [
            {
              "score": 417,
              "content": "[deleted]",
              "id": 99,
              "comments": [
                {
                  "score": 337,
                  "content": "By the DILs auto response I’d say this kind of demand is a very common occurrence.",
                  "id": 100,
                  "comments": [
                    {
                      "score": 76,
                      "content": "I feel like she read a post or two on justno & shinied up her spine cause her MIL is very overbearing. I’m happy for her for standing up to her MIL like that. Go DIL 🥳",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 89,
                  "content": "Yep. I’d bet a key to my house that this was just one more overbearing MIL thing in a LONG string of them. I see son and DIL going LC or even NC in the future if OP doesn’t learn about healthy boundaries.",
                  "id": 102,
                  "comments": [
                    {
                      "score": 9,
                      "content": "They have already been grey rocking her for the past 6 months.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Even if it was the first it *definitely* won't be the last. OP very clearly has zero respect for DIL.",
                  "id": 104,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Yep. I have an overbearing MIL. Husband and I both got incredibly hacked off with her attitude, demands, power plays etc and she is indeed “grandma we don’t see that often”.\n\nShe seemed/seems unable to accept he is an adult, and should be treated as such, and really can’t grasp that he and I are a team.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 441,
          "content": "I get the strong feeling this exact scene played out between her son and daughter-in-law earlier that day:\n\nSon: Mom and dad are coming over for dinner to celebrate the new house.\n\nDiL: Oh god I'm gonna have to deal with your Mother tonight? You bought extra wine right?",
          "id": 106,
          "comments": [
            {
              "score": 41,
              "content": "Sounds like a convo I recently had with my husband. A few weeks ago he told his father we were looking to move states (we currently live 1+ hrs away from them) and actively looking for houses in this other state. When he got off the phone I asked him if he told his dad not to tell his mom (we agreed to tell her when we put an offer on a house and it got accepted) and he said “No, I forgot, but he’s not going to tell her anyway, he doesn’t care about that stuff”. Y’all, not 5 minutes later she is on the phone screeching about “my baby is moving away from me!!”\n\nThe real kicker is that he *THEN*, after he gets off the phone with her, tells me that she’s going to “hang at our place” for a few hours because she’s going to catch a flight out to go see his sister for thanksgiving (we live 5-10 min away from an airport) and that I’d be alone with her for at least two hours before he was able to get home. I glared at him and told him he better be bringing me home my favorite bottle of wine because I’d now have to deal with his irate mother for two hours. She arrived the next day, and as our dogs go to greet her she immediately says “oh my babies! You’re going to be moving so far away and I’ll never see you again!”  I just bit my lip and said “hello to you too MIL”.\n\nI can’t wait to move.",
              "id": 107,
              "comments": [
                {
                  "score": 32,
                  "content": "My MiL nagged me for YEARS to “let” her son/us “move back home”. It didn’t stop til we had a baby, who they honestly aren’t very involved with even during in-person visits. I think she remembered all of a sudden how she doesn’t really like kids lol. I found a retired woman in our neighborhood to babysit and my son loves her so much and she enjoys spending time with him. \n\nGrandmothers are overrated.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Omg my friend has a MIL like this. We had several talks about her and I warned her to keep her guard up and that she may cause a divorce. Same thing, always telling her son to move closer etc. Constant nagging her son about all sorts of stuff. Well he’s finally home now. They’re going to be divorced. I’m sure she’s happy as a clam now now that both her GROWN sons in their 40s live at home now with mommy. Honestly I’m glad, all her nagging was making him mean and verbally abusive to my friend. He’s was always trying to please his mom yet his mom didn’t like her and was constantly undermining her.  My friend stands her ground and won’t let her MIL get her way but her constant nagging has turned their relationship into a very toxic situation.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 228,
          "content": "Justnomil territory for sure. I wonder if she’d show up unannounced and let herself in? Or move furniture around? Or clean things and accidentally inspect all their private stuff? \n\nYTA - let them be adults.",
          "id": 110,
          "comments": [
            {
              "score": 80,
              "content": "This is exactly why my MIL doesn't have a key. When husband was a kid, she would go in his & siblings' rooms and \"tidy\" everything up when they were at school - and other violations of privacy like trying to snoop on his phonecalls, and invasive questions like asking him at age 13 if he had pubic hair. And to this day she doesn't understand why he has anxiety around privacy and says, \"but I'm your mother! I love you!\" \\*eyeroll\\*",
              "id": 111,
              "comments": [
                {
                  "score": 7,
                  "content": "EWWW! She asked HER SON whether he had PUBIC HAIR?  If she wanted to know whether his body was maturing, she could have asked if he was growing armpit hair yet, or asked her husband to get the info, if he would. And at 13 you know this kid was MORTIFIED (and rightfully so)!",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 136,
          "content": "[Oh, look what I found.](https://www.reddit.com/r/JUSTNOMIL/comments/79socp/jnmilitw_and_the_emergency_key/)",
          "id": 113,
          "comments": [
            {
              "score": 33,
              "content": "That was a great read! I especially loved the James Earl Jones dad/husband. “LEAVE. IT.” LOLOLLL made my morning.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "LOL! Thank you, I needed a good laugh.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "That was beautiful, thank you for sharing",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": ">Oh, look what I found.\n\nThat was glorious. Thank you!",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 128,
          "content": "[removed]",
          "id": 118,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 63,
          "content": "What kind of emergency would there be anyways that the mom could handle somehow better than emergency services? She's gonna fight off some home buglars? Yeah it's convenient to have a key, but it's kind of weird to be so insistent on having one.",
          "id": 119,
          "comments": [
            {
              "score": 24,
              "content": "Or they lock themselves out…? They see the cat knocked over the water bowl on their day trip and need someone to refill it? Agreed it’s weird she’s so insistent, but it’s not uncommon for someone to have a copy of your house key.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Well, I mean giving someone a key is not necessarily an off the wall thing. Water pipe issue, health issue, accident, etc. \n\nBut the MIL is bang out of order.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "\"Emergency\" in this context doesn't literally mean the kind of thing you'd call 911 for.\n\nSome trusted friends have a key to my house. The reason for this is mostly so that if I lock myself out of my house, I know someone with a key and don't have to wait for or pay for a locksmith. That's not truly an emergency, but I'd call it one if I were locked out of my house in below freezing weather at 2 a.m.\n\nIn the same vein, I live 6 hours from my hometown. If I got a call that one of my parents had become critically ill, I could just lock up my house and go immediately to them, because my friends have a key and could feed my cat or turn down my thermostat or whatever I didn't think to do in my panicked rush to get home.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 59,
          "content": "Right like what if they want Jess mom to have a key???\n op sounds  like my mother and I'll bet that would drive them INSANE",
          "id": 123,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 25,
          "content": "You just *know* op would find many “emergencies” to stop by unannounced and just walk into their house all hours of the day and night too.",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Exactly this. My inlaws have a copy of out house keys, just in case. My parents do not. Why? My inlaws live 10 min from us, my parents over an hour. It's logistics. I also have a key to my parents. Just in case. Because my siblings live farther away than I do. Again, logistics. People offer keys. You don't demand them. \n\nOP, YTA",
          "id": 125,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 9219,
      "content": "YTA. It’s their house and their choice who gets keys. When she said no the first time, you should have dropped it. Your husband and Jess are right, you’re being pushy and controlling and that behavior ruined the dinner.",
      "id": 126,
      "comments": [
        {
          "score": 710,
          "content": "True. I mean, we let my mom have a key because she lives 5 minutes away. Just in case we lock ourselves out of our apartment. But just demanding a key and not letting it go when told no is giving the impression OP wants the keys to \"check\" for \"emergencies\" behind her son's and DIL's backs.",
          "id": 127,
          "comments": [
            {
              "score": 931,
              "content": "My mother always has a key to all my apartments but it’s specifically because she would never, ever dream of demanding one. I’ve also told her a thousand times she can let herself in at any time, but she insists on getting stated permission no matter what. This is why I trust her. \n\nShe snuck into my apartment for the first time ever this year to hide Easter Eggs around my apartment. Except, she made up a fake appointment in town and got permission from me to use my bathroom if she needed to, first. She said she felt guilty the whole time that she was in there for “other” reasons. I squealed in joy when I found the first egg and knew what was up. \n\nWant people to trust you? Be trustworthy. Just that simple.",
              "id": 128,
              "comments": [
                {
                  "score": 294,
                  "content": "That's such a sweet story. :)",
                  "id": 129,
                  "comments": [
                    {
                      "score": 379,
                      "content": "It was such an absolute delight and she told me she was so nervous I would be upset that she was “messing around” my apartment. It was SO cute. I went to pop something in the microwave and there was an egg and I exclaimed, out loud, “you little sneak!!” and immediately went on the hunt. It was awesome. She put candy and quarters in the plastic eggs. \n\nI’ve given her blanket permission to enter my apartment so many times. She even lived here for six months between apartments and she *still* says she doesn’t feel right invading my personal space without permission. She’s a gem. In turn, I treat her living space the exact same way. Because of this, we both know we can rely on the other person for any domestic help we may need from watering the plants to being able to pop in and use the bathroom in an emergency.",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Aww, the egg thing is adorable.\n\nI think my mom kinda “demanded” keys during my last move (I gave them to her to get copies made because I was exhausted and didn’t want to deal with it lol) but that’s more because we’ve got an ongoing understanding and she has never abused them. My sister and I also have copies to each other’s apartments bc we live closer to each other than to our parents but we’ve never used those either. And it’s entirely because we both have locked ourselves out before.\n\nMy mom “gets” to do this because in nearly 10 years of me living independently she has never, not once, come into my house uninvited. The arrangement ends the second I have reason to believe she has or would.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I love her so very much on your behalf.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 75,
              "content": "Exactly! I would never give someone a key if they repeatedly asked for it— it’s a red flag. OP, there’s very little chance you’ll ever get a key to their house after the way you behaved. There’s absolutely no reason you need a key so badly that your repeated requests ruin a family get together/celebration OTHER than something nefarious. Your weird insistence now makes you a poor candidate for ever having a key.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Yup. The “right” way to ask for a key is to ask if they’d thought of leaving a spare with a friend or family member, leaving it open for them to offer or to say “thank you, but that’s already covered” and everyone gets to remain on good terms either way…\n\nThis was a naked request for a key to go snooping with.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "\\*MIL walking in on OP and hubby having sex\\*\n\n\"You weren't answering your phone so I thought it was an emergency!!\"",
              "id": 135,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 518,
          "content": "[removed]",
          "id": 136,
          "comments": [
            {
              "score": 1054,
              "content": "An offer like \"Congratulations on the house. If you would ever need us to water plants or handle an issue, we would be happy to.\" is enough.\n\nI wouldn't even mention a key. If someone wanted to accept that offer and furnish a key, they will do so.",
              "id": 137,
              "comments": [
                {
                  "score": 357,
                  "content": "OP made sure she will never be the person that will be asked for favors when son and DIL need help.",
                  "id": 138,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Maybe OP was trying to get out of any future favors and this was all an elaborate ruse...",
                      "id": 139,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "Right. \n\nOP didn’t make an offer. She didn’t even make a request. She made a demand.￼ \n\nOP, You set the tone for the conflict with your entitlement and your pushiness. \n\nYTA",
                  "id": 140,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 24,
                  "content": "This is it. And what OP could say now (in a card) is:\n\n\"I'm sorry for the conflict last week. I communicated poorly and I understand that I was being pushy and rude. What I wish I had said is 'If you would ever need us to water the plants or anything we will be happy to' and then dropped the issue. I just want to apologize, let you know I won't be bringing this up again, and congratulate you on your home.  Love to the both of you, Mom.",
                  "id": 141,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Sure, but only if she means that. Which it doesn’t sound like she does, she’s stuck on the key. Her apology note would probably be more along the lines of “I understand that you felt I was being pushy, however I was simply trying to be helpful and believe having a spare key would be beneficial for both of us if something happened and I needed to get in to check that you were okay.”",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "For real. Can you imagine someone coming up to you and saying \"hey I'm going to need a copy of your house key\" like, first of all, when did we decide this? Second of all, what the hell? I'd be so creeped out if anyone came up to me and told me that. A simple, \"hey if you ever want me to help you out in the house, let me know.\" Besides, getting the key to someone's house is the ultimate trust level. You can't just ask for it. Only the owners of the house can decide, jointly, if someone should get the house key or not.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Yeah, after the first no, maybe just reiterate that it's useful for someone trusted close by to have a spare key in the event they wanted someone to check on the place while they're out of town or in the event that someone locks themselves out (and that person doesn't have to be you). \n\nThen let it drop. They're adults, they'll figure it out. \n\nA lot of my wife's family lives nearby and only one or two keys on my key ring actually go to my house. Another 5-6 are for family, and I appreciate that they trust me, but sometimes I honestly wish I didn't have the burden of taking out the trash because someone forgot before a trip.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5856,
      "content": "YTA. \n\nYou don’t ask for a copy of a key to someone’s house. Even if it is your sons. If they offer, fine. But no. You don’t ask. It is rude. And overbearing.",
      "id": 145,
      "comments": [
        {
          "score": 359,
          "content": "[removed]",
          "id": 146,
          "comments": [
            {
              "score": 132,
              "content": "Exactly. If nothing else, YTA for trying to force your son to choose a side between his mother or his newlywed wife",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "Hahahaha. I love this. It should be a line of merch.",
              "id": 148,
              "comments": [
                {
                  "score": 17,
                  "content": "What did it say?",
                  "id": 149,
                  "comments": [
                    {
                      "score": 41,
                      "content": "It said \"Significant others before mothers\". \nSeriously, I wish I could go back in time and have this emblazoned on hoodies, t-shirts, hats, cups, and everything else to wear every time I had to sacrifice something important to make good on promises my husband made to his Jocasta narc mother. \nMaybe it would have been cheaper to just buy iron ons since that was pretty much a daily occurrence.",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 27,
              "content": "The above comment was stolen from [this one](http://np.reddit.com/r/AmItheAsshole/comments/rm3sb6/aita_for_asking_my_son_and_daughter_inlaw_for_a/hpjr6zn/) elsewhere in this comment section.\n\nIt is probably not a coincidence; here is some more evidence against this user:\n\nPlagiarized | Original\n-------- | -----------\n[NTA - you shouldn’t even...](http://np.reddit.com/r/AmItheAsshole/comments/rm3433/aita_for_expecting_my_brother_to_uninvite_my_soon/hpjrbt5/) | [NTA - you shouldn’t even...](http://np.reddit.com/r/AmItheAsshole/comments/rm3433/aita_for_expecting_my_brother_to_uninvite_my_soon/hpjprt5/)\n[INFO - bachelorette party...](http://np.reddit.com/r/AmItheAsshole/comments/rm2ahh/aita_for_being_hurt_that_i_wont_be_sat_with_my/hpjrdpp/) | [INFO - bachelorette party...](http://np.reddit.com/r/AmItheAsshole/comments/rm2ahh/aita_for_being_hurt_that_i_wont_be_sat_with_my/hpjpf4v/)\n[NTA. It sounds like a sca...](http://np.reddit.com/r/AmItheAsshole/comments/rm2f37/aita_bought_a_used_car_now_the_previous_owner/hpjrcq4/) | [NTA. It sounds like a sca...](http://np.reddit.com/r/AmItheAsshole/comments/rm2f37/aita_bought_a_used_car_now_the_previous_owner/hpjo1wq/)\n\nbeep boop, I'm a bot -|:] It is this bot's opinion that  [/u/studyabrvxcvdag](https://np.reddit.com/u/studyabrvxcvdag/) should be banned for karma manipulation. Don't feel bad, they are probably a bot too.\n\nConfused? Read the [FAQ](https://www.reddit.com/user/reply-guy-bot/comments/n9fpva/faq/?plagiarist=studyabrvxcvdag) for info on how I work and why I exist.",
              "id": 151,
              "comments": [
                {
                  "score": 8,
                  "content": "Good bot!",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 332,
          "content": "I mean it does make sense. My mom has a copy of our house key, as does my dad and mil.\n\nIt came in handy when my husbands house keys were lost and it was 1am. Rang my mom up who came round with the key.\n\nOp is YTA for being so pushy, and making it a choosing game between the mom and the wife? Like they made a genuine request, they got told no and should have left it at that.",
          "id": 153,
          "comments": [
            {
              "score": 400,
              "content": "It makes sense for SOMEONE to have a spare key in case of emergencies. \n\nBut OP didn't just offer advice about making sure that someone trusted had a key. She took it upon herself to demand a key for herself, even when her DIL clearly wasn't comfortable with that idea.\n\nI would argue that OP's behaviour is a clear demonstration of her lack of respect for their boundaries (and for DIL in general). So no, it doesn't make sense for her to have a key. In fact, it makes perfect sense to give a key to almost any family member or friend EXCEPT her.",
              "id": 154,
              "comments": [
                {
                  "score": 67,
                  "content": "My house has an electronic lock on the side door (by the garage, where we come in 90% of the time because it's easier to punch in a code than it is to use the key). If you know the 6-digit code, you can punch it in and get in. Even better, I can reset the code whenever I want! (it's not connected to the internet and it's just powered by 2 AA batteries, but I can manually put in a new code at the door pretty easily.) So if there was an emergency, I could give out the door code to someone trusted and tell them to take care of the emergency, and then later change the code.\n\nI actually use this a lot when I have visitors staying the night. I set a new code for the door and tell the visitors that code, so they can come and go as they like. And once they leave to go home, I change the door code again.",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Yes the whole \"make exactly two copies of the key.. an extra for you and one for me\" seems odd. It could have been phrased as \"It might be a good idea to make some copies just in case. If you would like you could keep a copy at my house for safekeeping.\" \n\nI have a key to my brother's house, and myself, my brother and my mom all know the codes to my house and mom's house. It is handy and practical (just yesterday I had to drop off things at their houses and could let myself in) but important in my opinion to let them know and ask permission before entering said house. A key (or code) is not permission to just march in whenever you want unannounced. OP seems like the type to do just that, which is why they seem hesitant to give a key to OP.",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "We have a hidden lock box with a copy of our key in our backyard for emergencies like that.",
              "id": 157,
              "comments": [
                {
                  "score": 7,
                  "content": "Same. If I'm locked out the house I don't want to wait for someone else to arrive to let me in. Having a key hidden on the property, in your car (even in one of those magnetized boxes under your car), etc. makes much more sense.\n\nThis is also why I put a lock with a key code on my front door. No more keys to worry about and I can set multiple codes so that if someone else did need to enter my property I can give them a guest code and then disable it later if I no longer want them to have it.",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "And why did she ask the DIL in the first place? Why not her own son? Seems she was looking for an opportunity to clash with the DIL.",
          "id": 159,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "I asked if my friend, after she moved to a new house, wanted me to keep a key at my house for emergencies.  She said she hadn't thought of that and agreed it was a good idea.  \n\nThe key  hangs in our garage which has key code access (of which my friend knows, as well as knowing the key access to our house).  Even if someone broke into the garage, the key chain don't have her address or name, instead it's a souvenir from a trip we took together a decade ago.  The key hasn't been moved since it was hung up but if there's an emergency, it's there to be used. \n\nSo I did ask but if she said no, I would not have pressed and would not have been offended.  Her place is her place and I respect that.  \n\nI think the difference here is that we have a history built on trust and respecting boundaries. \n\nBy DIL's reaction, I suspect that OP has shown in the past that she's has not respected boundaries and privacy.\n\nEdit:  I forgot to put in a YTA for OP",
          "id": 160,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "She didn’t even ask. She DEMANDED.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4943,
      "content": "YTA.  You don’t get to demand a key to someone else’s house, and trying to override a wife’s wishes in her own home by acting as if you have rights in your son’s home is going to put you on a fast track to never being invited.  Her reacting as intensely as you describe suggests that you have a problem with overstepping generally. Take a hard look at your own behavior.",
      "id": 162,
      "comments": [
        {
          "score": 2015,
          "content": "I have a strong feeling she has a history of overstepping boundaries and being invasive while claiming, \"I'm just trying to be helpful!\" and daughter-in-law has had enough.",
          "id": 163,
          "comments": [
            {
              "score": 519,
              "content": "Yup, totally agree.  Jess reacted how she did to OPs demand for a key because I'm guessing this was just one more time that OP has tried to boundary stomp.",
              "id": 164,
              "comments": [
                {
                  "score": 520,
                  "content": "What do you bet that the reason Jess was so sure that Ethan would back her up is because before they even moved in, Jess said “No way in hell are we giving a key to your mother” and Ethan agreed.",
                  "id": 165,
                  "comments": [
                    {
                      "score": 75,
                      "content": "Hahaha. This.",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Or maybe Ethan said, \"Let's give your mom (or your/my brother/sister) an emergency key, cuz there is no way in hell my mother is getting one!\"",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "Also to add, this sounds like my mom and I wouldnt doubt if \"my husband and I left\" is more like \"I threw a fit and made him leave\".",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "The response \"well it's my sons house, too, we'll see what he says\" tells me this happens **a lot**.",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Ya nobody like a Helppy Helpington",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "\"I'm the victim here!\"\n\nI've been through this with my mother.",
              "id": 171,
              "comments": [
                {
                  "score": 10,
                  "content": "I’m going through this right fucking now and this post pissed me off lol, hope you’re doing better friend!",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Yep, there is no way this is the first time she’s acted this way.",
              "id": 173,
              "comments": [
                {
                  "score": 8,
                  "content": "This has missing missing reasons all over it.",
                  "id": 174,
                  "comments": [
                    {
                      "score": 10,
                      "content": "That's the phrase I was looking for. Missing missing reasons. This post drips of it.",
                      "id": 175,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I think we should have a term for when daughter-in-laws have had enough, and are putting their foot down.\n\nMy vote is for: Daughter In Law Decided Officially. \n\nIf only I could find a way to abbreviate that…",
              "id": 176,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 432,
          "content": "How crazy is it that OP doesn’t realize this would be a 2yes 1no situation? Sure, it’s her sons house too, but if DIL doesn’t want her having a key to the house then it doesn’t matter if the son does really. DIL is entitled to privacy in her own home and would be within her rights to “overrule” if OPs son wanted OP to have a key.",
          "id": 177,
          "comments": [
            {
              "score": 46,
              "content": ">DIL is entitled to privacy in her own home and would be within her rights to “overrule” if OPs son wanted OP to have a key.\n\ni dunno about the actual laws, but im pretty sure if you dont want someone in the home, even if the other homeowner wants that person in the house, you can call the police and have them removed. its basically a 1 consent rule for people in your house.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 96,
          "content": "Yeh. To me they wouldn’t give it to her because they know she’ll just turn up INSIDE their house un announced because “I have a key so I just let myself in”",
          "id": 179,
          "comments": [
            {
              "score": 7,
              "content": "Yup; seen enough of those stories on Reddit. Like the MIL who kidnapped the baby in the middle of the night to “give son and DIL a break”? Smh.",
              "id": 180,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "I was thinking the same thing",
          "id": 181,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2571,
      "content": "YTA. You are not entitled to a key and your DIL and Husband are right.\n\nThere's a difference if you asked if they needed someone to house an extra key but you didn't.\n\nI get the feeling you're the kind of MIL that might let herself in randomly to 'check' there are no 'emergencies' without prior permission.",
      "id": 182,
      "comments": [
        {
          "score": 612,
          "content": "From the way she talks it is obvious she has no sense of personal boundaries",
          "id": 183,
          "comments": [
            {
              "score": 440,
              "content": "\"I called and you didn't answer your phones. Both of them! I thought for sure something was wrong. I had to come check on you!\"",
              "id": 184,
              "comments": [
                {
                  "score": 95,
                  "content": "As she walks in on them having sex.",
                  "id": 185,
                  "comments": [
                    {
                      "score": 56,
                      "content": "On their 1 year anniversary after telling her they were celebrating alone at home.",
                      "id": 186,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 25,
              "content": "She clearly has no sense of boundaries. “Oh you said no? I will just ask my son and push on this issue until you say yes”",
              "id": 187,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 342,
          "content": "This. Especially if they don’t answer a call or text immediately—“I didn’t hear from you and I was worried!” 🙄. Just. NO.",
          "id": 188,
          "comments": [
            {
              "score": 82,
              "content": "This is exactly what would happen",
              "id": 189,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "I can just picture her barging in on them having sex because they didn’t answer a call so she was worried and then heard suspicious noises when she got there.",
              "id": 190,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "\"I was so worried I tore your house apart and didn't put anything back\"",
              "id": 191,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 238,
          "content": "An emergency for her would be her son didn't answer his phone or a text immediately I bet",
          "id": 192,
          "comments": [
            {
              "score": 189,
              "content": "Or \"I saw on Facebook you two had \\[something cheap, pre-made, frozen, delivery, etc.\\] last night, and I was worried my son wasn't being fed properly, so I came over to make a *proper* home cooked meal for dinner tonight! Oh also I organized your mail, and saw a few things needed cleaning, you don't mind do you? I'm just trying to help!\"",
              "id": 193,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 86,
              "content": "Yeah this 100%\n\n\"You weren't answering your phone I was worried, I came over to check you were okay what else was I supposed to do as a loving mother!?\"",
              "id": 194,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 37,
          "content": "Yeah the whole time I was reading this I was thinking man if this lady had a key she would def be the type to use it frivolously",
          "id": 195,
          "comments": [
            {
              "score": 15,
              "content": "My former MIL had no boundaries with her daughter (very enmeshed, codependent types). She would get bored and let herself into her daughter’s home (even when said daughter—and daughter’s husband and kids—were not home), and repaint the interior. Sometimes she redecorated completely, and threw things away that she didn’t like. She was wealthy and took pride in being pushy and would get perilously wounded when told no—crying, silent treatment, you name it. 🙄",
              "id": 196,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "My thoughts exactly. OP didn't bother to give any justification beyond \"it's for emergencies\" - not even to give an example of an emergency - and immediately tried to get her son to overrule his wife. Massive red flags right there.",
          "id": 197,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "Well it’s her son after all, therefore her property, thus making the house her property as well.\n\nDILs are just a pretty thing to cook, take care of the house for sonsband, produce grandkids and being obedient all the time to the holy MIL, EVERYONE knows that.",
          "id": 198,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Not even just to check in. \n\n\"I was close by and wanted to drop by\" and let's herself in because \"well, I have a key\"\n\nAnd it would get worse if they have kids. This lady wouldn't take having a key to their house as only for emergencies like she claims. She would take it as a right to come in and drop by as she pleases because she has a copy of the key.\n\nYTA lady. And I hope for the sake of the relationships involved, you apologize sincerely and never bring it up again.",
          "id": 199,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Yup, all she had to do was change her phrasing to “if you want to leave a spare at our house in case you get locked out or need us to water plants/feed pets while you’re away, you’re more than welcome to” and then drop it if the answer was “no.”",
          "id": 200,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2309,
      "content": "Yeah YTA. It's a good idea to suggest they make copies and give them to someone close for safe keeping. It's even not too bad to suggest yourself as a possible candidate. \n\nBut instead, it sounds like you just told her what she should do. Then when she disagreed you pushed and pushed. And then you brought it up again with your son in the hopes of arguing it further. \n\nIt's their house, their key. You pushed things too far.",
      "id": 201,
      "comments": [
        {
          "score": 400,
          "content": "So does an \"emergency\" include just letting yourself in whenever, and going through their things? Maybe looking at the bank statements, looking at private items in their bedroom, rearrange their furniture?\n\nHell, maybe OP should pee on the floor in the living room to assert dominance over her.",
          "id": 202,
          "comments": [
            {
              "score": 124,
              "content": "You can find these stories and more on Reddit",
              "id": 203,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "I’ve read such story here. Mil left her feces in the kitchen on the counter out of spite. I don’t remember the backstory but this is something you remember.\n\nETA: in a plastic bag. The shit was in the plastic bag.",
              "id": 204,
              "comments": [
                {
                  "score": 11,
                  "content": ">Mil left her feces in the kitchen on the counter out of spite. \n\nOk enough Internet for this year",
                  "id": 205,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "Even if she doesn’t do that, I’ve seen and heard far too many stories of parents/in-laws getting a key, then acting like they can just always let themselves in with the key. Deciding to pop by unannounced, seeing their car in the driveway and then just letting yourself in. Or knocking on the door and when they don’t come within two seconds, immediately letting yourself in.",
              "id": 206,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1278,
      "content": "Sorry, your intentions were good but YTA. You should have waited until it was offered and DEFINITELY not pushed back during the celebratory dinner. \n\nIf there has been a chance of their coming round to your point of view it's likely gone now.",
      "id": 207,
      "comments": [
        {
          "score": 727,
          "content": "going directly to the spouse and putting them on the spot shows that her intentions were absolutely not good lmao",
          "id": 208,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 283,
          "content": "I’m not sure her intentions were good.",
          "id": 209,
          "comments": [
            {
              "score": 109,
              "content": "I'm reasonably sure, in fact, that they were not.",
              "id": 210,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 111,
          "content": "> Sorry, your intentions were good\n\nI don't think they were",
          "id": 211,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 71,
          "content": "It’s not even unreasonable to ask/offer, but she should’ve done it in front of both of them and backed down as soon as she got resistance.",
          "id": 212,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": ">If there has been a chance of their coming round to your point of view it's likely gone now.\n\nYeah, even if it would end up being helpful at some point, no one is giving OP a key now on principle after this fiasco.",
          "id": 213,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "Intentions were not good",
          "id": 214,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "May I ask what the good intentions were?",
          "id": 215,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "I don’t believe for a single second that her intentions were good. Pretty pathetic excuse actually. That’s literally what emergency services are for…",
          "id": 216,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 845,
      "content": "YTA- If they needed an emergency person with an extra key, they would have given it to that person on their own. Also, your DIL and your son are a team. Assuming he’d go against his teammate in an argument with you is not great. You overstepped boundaries and instead of backing off when she reinstated them, you kept toeing over that line and refusing to apologize for it and move on. Let them have their space.",
      "id": 217,
      "comments": [
        {
          "score": 205,
          "content": "It's a good idea to have a spare key, stored with a trusted person in case it's needed in emergency.\n\nIt might be a good idea to suggest that good idea to a new home owner, who might not have though of it.\n\nit's not a good idea to demand or feel entitled to a key.",
          "id": 218,
          "comments": [
            {
              "score": 139,
              "content": "Right? \"Make a copy of your key, and get a fire extinguisher pronto\"  is good advice to a new homeowner. \"Give me access to your home\" is ... a different pile of drama.\n\n\neta: if even one person adds a fire extinguisher to their home as a result of this, i can die happy",
              "id": 219,
              "comments": [
                {
                  "score": 10,
                  "content": "Indeed. \n\nIt's hard to tell how much of the problem is with the tone that the advice was given, and how much was that the son & wife knew the score already and said \"just no\" to MIL.",
                  "id": 220,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "It's an okay idea to suggest that person is you. Explain the kind of emergencies you might use the key for and how you would absolutely never overstep their boundaries. But that's the furthest you can go. Insisting is too much.",
              "id": 221,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "\"but ItS *mY* sOn'S hOuSe!!\"",
          "id": 222,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 838,
      "content": "Info Did your inlaws ask for a copy of your house key when you and your spouse got a place to yourselves?",
      "id": 223,
      "comments": [
        {
          "score": 82,
          "content": "SCORCH!",
          "id": 224,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 33,
          "content": "Not even ask, mf DEMAND.",
          "id": 225,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    }
  ]
}