{
  "post content": "Husband (56M) loves shopping.  This drives me (52F) insane as we have way too many \"things\", but if it brings him joy to have 37 cases of tomatoes and 8 litres of olive oil, whatever. We can afford it, so I just ignore his semi-hoarder habits and carry on. If this is the biggest problem we have, life is good.\n\nHowever... this sunny afternoon, the Sunday before Christmas, we were out for a nice day running errands.. UNTIL he suddenly decided to go to Costco. \n\nI HATE shopping - period. I especially hate Costco. Going on the Sunday before Christmas is a hard NO for me and I said so in a bitchy tone  as soon as he entered the zoo like parking lot because hey, I was bitchy about it ... who TF goes to Costco on this day - during omnicron surge -  unless they are insane. The parking lot was overflowing, can only imagine the inside. \n\nHe peeled out of the parking lot very angry and said IWTA for not sucking it up and going to Costco with him. He likes it and I should join him in doing things he likes. \n\nHe goes to Costco weekly for random shit we don't need, is retired and can go any day, any time, and without me. Every day of his life, alone, I DGAF. Or, could ask me to go any  quieter afternoon with him. \n\nAITA for not turning my frown upside down and enjoying F-ing Costco w him. He is totally sulky about this now.",
  "id": 1,
  "comments": [
    {
      "score": 1519,
      "content": "[deleted]",
      "id": 2,
      "comments": [
        {
          "score": 276,
          "content": "Agreed, they definitely need to communicate in a healthier manner. The way OP talks about her husband makes him seem like a nuisance just for having extra food and liking Costco, and wanting her to go there with him....maybe you just don't like your husband anymore OP",
          "id": 3,
          "comments": [
            {
              "score": 103,
              "content": "If he's buying food only for it to go bad, OP take it to the charities BEFORE it goes bad. At least do that. Tomatoes and olive oil? I'll make ya a big pot of Tuscan chicken. YUM.",
              "id": 4,
              "comments": [
                {
                  "score": 27,
                  "content": "Here's hoping the husband at least bought 10 cases of canned tomatoes rather than fresh!",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "How do you know they don't?",
                  "id": 6,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "NAH.Obviously some of you haven't been to a Costco or your Costco is not crowded. Lol\n\nShopping can be a chore or recreation, like driving or cooking. If both people don't want to recreationally go to Costco, then it's a chore\n\nFor example:I might drive more for work and it's a chore. If my husband wanted to drive to the coast for recreation, I might want to opt out on a long recreational drive. Just ask, don't just start driving to the coast. Especially if you are retired and I get 2 days off a week, like in the case of OP.\n\nRetired active adults are like teenagers... Costco is their mall. The idea of going to either without a purpose and necessity right before Christmas to a working adult is crazy. That's like driving to the airport for fun. \n\nOP needs to thank her husband for being a Costco hero and letting her not have to go.",
              "id": 7,
              "comments": [
                {
                  "score": 3,
                  "content": "I live near one of the busiest Costco's in all of CA & I avoid it like the plague this time of year. (I refuse ot go on ANY weekend ANY time of year,, for that matter, because it's a zoo...I will only suffer through maybe on a Monday at 10 am). Hubby doesn't mind because he likes the samples so he handles it for me (he's a saint)\n\nI'm with OP here & would have done the same thing...Costco the Sunday before Christmas is a HARD no from me.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 95,
          "content": "I’m not convinced it’s not a problem either. He’s obviously retired early, but if he lives long and has bought unnecessary vats of Crisco and mega packs of pasta for decades, it could become an issue financially.\n\nWhen I lived in the states we used to go to Costco but it was very particular items that we used a lot of regularly, that we would stock up on.",
          "id": 9,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 59,
          "content": "I also get the distinct impression she just doesn't *like* him.",
          "id": 10,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I’m sorry, I’m still fairly new to the sub, what does ESH mean?",
          "id": 11,
          "comments": [
            {
              "score": 38,
              "content": "Everyone sucks here. It’s a vote for when both parties are being aholes",
              "id": 12,
              "comments": [
                {
                  "score": 4,
                  "content": "Thanks!",
                  "id": 13,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 33,
              "content": "Everything should be in the sidebar for this sub, but I know that can suck to access when on mobile. The mods are pretty fast to ban people though so you should probably take a sec to check their rules!\n\nEither way, here are all the voting terms:\n\nYTA\t= You're the Asshole (the person who posted here is in the wrong)\n\nNTA\t= Not the Asshole (the person who posted is not in the wrong but someone else in the story is) \n\nNAH =\tNo Assholes here (no one, including the poster, did anything wrong)\n\nESH\t= Everyone Sucks here (everyone, including the poster, fucked up or is wrong)\n\nINFO\t= Not Enough Info (the story is a mess and we can't judge)",
              "id": 14,
              "comments": [
                {
                  "score": 2,
                  "content": "Thanks!",
                  "id": 15,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "I thought inf.o is a request for more information, not a judgement?",
                  "id": 16,
                  "comments": [
                    {
                      "score": 2,
                      "content": "It's kind of both. The short form is also a judgement in that if enough people write top level comments saying \"info\" and don't edit them after getting their questions answered, the overall verdict per the flair is \"not enough info.\"",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": -19,
              "content": "Everybody’s Shitty Here",
              "id": 18,
              "comments": [
                {
                  "score": 5,
                  "content": "Thanks",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 459,
      "content": "Jesus, I even kind of like Costco but you couldn’t pay me to go in there the Sunday before Christmas. Could you have just stayed in the car while he went in? \n\nNTA",
      "id": 20,
      "comments": [
        {
          "score": 90,
          "content": "Maybe, but they probably would've been sitting in the car for an hour at least.",
          "id": 21,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "I DO like Costco and I avoid that place at all costs the week before any holiday. Especially when there’s omicron happening. If he wants to convince her going to Costco with hims not that bad, he couldn’t have picked a worse time to do it.",
          "id": 22,
          "comments": [
            {
              "score": 18,
              "content": "I like Costco too but go when it's not busy like Friday night or Saturday morning.  Going in the afternoon on the weekend is just asking for trouble.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Right?!",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Yeah I used to do Instacart in the past. One time I went the day before Easter and the parking lot was PACKED. I went around for 5-10 mins before i had to call Instacart and be like ‘yeah I can’t find parking anywhere, that customer might have to cancel their order’",
          "id": 25,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 380,
      "content": "Did your hubby have food insecurity growing up? This type of behavior usually results from trauma.",
      "id": 26,
      "comments": [
        {
          "score": 85,
          "content": "Actually this is a interesting theory. My grandmother does and does this exact same thing with shopping.",
          "id": 27,
          "comments": [
            {
              "score": 22,
              "content": "My grandparents do the same. They’re from China - grandma is a retired doctor, grandpa a retired civil engineer. And even that wasn’t enough $ for them to be able to feed their kids sometimes, my grandma had to sell off a few family heirlooms just to have food.\n\nGrandpa loves wandering through Costco and getting free samples. During holiday season he would literally take a little ziplock bag in his pocket so he could have a to-go bag of free snacks and he keeps those little plastic sample cups too 🤦🏻‍♀️",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "Could be, but more likely a bored retired guy who enjoys walking around the giant warehouse and taking his time to do so.",
          "id": 29,
          "comments": [
            {
              "score": 19,
              "content": "My parents go to various flea markets every weekend. Their house is starting to look like Emporium Galorium, but less organized. But it makes them happy. What else are they going to do with their weekend, throw a wild party? They are like toddlers, they get cranky when they're bored.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "I'm also curious if he's a prepper and just doesn't think OP would understand.",
          "id": 31,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "This occurred to me too, which made me lean toward OP being the AH.",
          "id": 32,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "That’s the first time I’ve heard of this! This totally explains my sister and brother in law! Thank you for the insight",
          "id": 33,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 174,
      "content": "Question: Does he go places that he doesn’t want to, to be with you?",
      "id": 34,
      "comments": [
        {
          "score": 89,
          "content": "I feel like the problem is that he seems to be shopping frequently for things he doesn't need",
          "id": 35,
          "comments": [
            {
              "score": 5,
              "content": "[deleted]",
              "id": 36,
              "comments": [
                {
                  "score": 2,
                  "content": "I would LOVE to see the comments to this exact post, verbatim, but with genders inverted....",
                  "id": 37,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "OP says it's not a financial problem and him going to Costco isn't a problem. She just doesn't want to go with him, that's all.",
              "id": 38,
              "comments": [
                {
                  "score": 1,
                  "content": "Never mentioned the waste of money he's doing. Considering how much he's shopping, he's shopping too much to reasonably eat everything he buys",
                  "id": 39,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 143,
      "content": "NTA\n\nI made an a point a long time ago that while I will do things I do not enjoy, I will not do things I loathe.\n\nOf course, that could explain why I’m divorced. Lol",
      "id": 40,
      "comments": [
        {
          "score": 33,
          "content": "I think that’s a legitimate boundary. 😂",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "LoL idk, sounds like a reasonable boundary to me",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I feel you, part of the reason my last relationship ended was because I didn’t like walking around Walmart for an hour and couldn’t pretend to like it. I thought I was being reasonable by asking her to go with her friends but I guess not.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Lmao explains why you're here ruining everyone else's relationships",
          "id": 44,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -36,
          "content": "Yes divorce seems like the best option here. Op seems to hate her husband",
          "id": 45,
          "comments": [
            {
              "score": 15,
              "content": "Found the husband",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 76,
      "content": "NTA: This one is a no-brainer. Don't go to Costco on a Sunday afternoon if you have options.",
      "id": 47,
      "comments": [
        {
          "score": 43,
          "content": "And especially don't go the Sunday before Christmas....😬",
          "id": 48,
          "comments": [
            {
              "score": 4,
              "content": "Last year I went to Costco before New Year's (which is a big deal in the country I currently live in) and it was a total nightmare.\n\nNever going before a major holiday again omg...",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 53,
      "content": "I think hubby can go to Costco alone.",
      "id": 50,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 41,
      "content": "Esh communicate your thoughts before getting mad",
      "id": 51,
      "comments": [
        {
          "score": 28,
          "content": "He didn't communicate anything to her before just pulling the car into the Costco parking lot though. I don't blame her for being pissed about that.",
          "id": 52,
          "comments": [
            {
              "score": 13,
              "content": "That’s why they all suck",
              "id": 53,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 38,
      "content": "NTA. If you should respect the things he enjoys, he should respect the things you don’t enjoy.\n\nOr minimally compromise on shopping there together when it’s not the worst possible time…a weekend, before Christmas, in a major illness outbreak.\n\nRespect is a two way street and nothing stops him from buying his 8 pack of peanut butter on his own.",
      "id": 54,
      "comments": [
        {
          "score": 10,
          "content": "Yeah it's bad enough going shopping when you already don't like shopping, but going there today is absolutely asking for trouble.",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -4,
          "content": "[deleted]",
          "id": 56,
          "comments": [
            {
              "score": 10,
              "content": "I didn’t say anything about divorce, did I? I’m pretty sure some middle steps can be taken before they get there.",
              "id": 57,
              "comments": [
                {
                  "score": 6,
                  "content": "This person is trying to start crap, they already said the same thing on another comment",
                  "id": 58,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Oh it’s Reddit, I never know if it’s failed reading comprehension or trying to start crap. Usually a combo. 😂",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 26,
      "content": "ESH.\n\nBut if the ages were just a tiny bit higher, I’d assume my mom wrote this post so you’re not alone, OP.",
      "id": 60,
      "comments": [],
      "relation": "No"
    }
  ]
}