{
  "post content": "\nI am in college and I have a 2 person dorm to myself after my roommate dropped out last semester. So when something was put on my dorm room door, I know it was aimed at me.\n\nAnyway, I was getting ready for bed a few nights ago, and I heard a bunch of giggling and bumping right outside my door. I looked out the peep hole and I saw these two girls who room together on my floor giggling, looking really drunk, and sticking something to my door. They were having trouble doing it because drunk...\n\nI had my phone on me and I put it up to the peephole and took a picture through it because I felt like something nasty was going on, from the way they were giggling about me being trailer trash, and I really didn't feel like having some confrontation, I had an 8 am midterm and wanted to sleep. The picture came out... Unflattering, to say the least.\n\nSo anyway a few hours later, I got up out of bed to use the bathroom and saw that the thing on the door was the \"trash\" sign from the trash room where the garbage and recycling goes in the building.\n\nI was put off by that, there's honestly been a good bit of bullying going on in my dorm and the RAs don't really care. I haven't been the subject of it before but a girl I'm friends with has been treated like shit by a couple people on the floor and the RAs of the building don't do a thing but give platitudes like \"oh there's two sides to every story\" \"oh adjusting to college is hard and things can get tense living close by\"\n\nSo I didn't really think the RAs would do anything. I took a picture of the sign.\n\nThe next day, after my exam was done with, and I had some time to think about what I wanted to do, I decided to post the picture of my door, and the picture of the girls taping up the sign, on my dorm's Facebook page.\n\nIt's a page usually used to organize events and such, but here's what I posted.\n\n\"Jane Doe and Jen Schmo put this trash room sign on my door last night, calling me \"trailer trash\" while they did it. \n\nBut all I'm thinking right now is that this kind of nastiness and bullying is trashier than any damn thing I ever saw in the trailer park I grew up in. (No, I'm not ashamed to say that) \n\nNo amount of money can buy class, I guess..\"\n\nAnd this has kicked up a big fuss, like a lot of arguing in the dorm, which I've mainly steered clear of. And my RA was mad I didn't tell her, to which I said \"oh so you could do nothing at all like you've done when (my friend) gets disrespected and bullied? Lol nah\"\n\nShe was pissed I said that too, saying that the school has a disciplinary procedure that doesn't involve public shaming. I was like \"well, you could of fooled me.\"\n\nAITA for how I posted the pictures and called them out?",
  "id": 1,
  "comments": [
    {
      "score": 7704,
      "content": "NTA. Public shaming is a 100% valid response to public bullying.",
      "id": 2,
      "comments": [
        {
          "score": 1663,
          "content": "I would normally disagree, being a teacher. It’s dangerous to do things this way. Mob justice generally isn’t proportionate. But when the proper authorities, in this case the RAs, won’t get involved a bit of public shaming is just what’s called for, in my opinion. Bullies get away with shit because people refuse to stand up to them. No one wants to be next on their radar so they stand idly by. Being called out for their shit is barely public shaming, anyway. It’s just naming the culprits. It’s not like they were pilloried in the lobby of the dorms with signs calling them trashy. NTA.\n\nEdit - Hey guys! Guess what?! I just got my very first abusive message! And in keeping with the public shaming theme I’ll tell you exactly who it was! It was /OnlyTheBestAdvice, just below this comment, and they told me I was without question the most worthless individual on the planet. Told me I have no worth, no value, and nobody would miss me if I were gone! That I am nothing. I think someone woke up on the wrong side of the bed this morning...",
          "id": 3,
          "comments": [
            {
              "score": 536,
              "content": "If teachers genuinely gave a shit, and actually did something about the bullying, more people might care about your concerns about “mob justice.”\n\nBullies get away with shit because authority figures routinely let down the victims.\n\nNTA",
              "id": 4,
              "comments": [
                {
                  "score": 141,
                  "content": "I think it's more complex than that. Many teachers do care, but are forced to work within crappy systems and adhere to bully prevention policies that don't work.\n\nIn most schools, bullying programs treat, kids that have conflict with one another, occassional rudeness/meanness, behavior that is the reaction to ongoing bullying, and actual bullying as all the same thing. That dilutes the effectiveness of any efforts, because everyone is a bully and everything is bullying.\n\nGet tormented for a year, and finally tell your bully to go fuck himself? Guess what, now the school labels  you as a bully.\n\nTwo kids have a bit of beef with one another, but neither is actually a bully. School labels them both as 'bullies'.\n\nNext is the fact that most bully programs are based around the idiotic notion of reconciliation. That means that victims of bullies get to sit down with them, and try to find out ways that THEY can get along better with the person who's been tormenting them. Which is absolutely fucking stupid. In what other situation would you make a victim sit down with their attacker and figure out how to get along with them?\n\nLike i said, dumb. But teachers are forced to work within them. Most teachers I know absolutely hate it, especially when they are forced to give the victim of bullying a referral for defending themselves.\n\nThen there's the issue of social manipulation. Teachers are just as easily subjected to this as anyone else. Bullies know how to turn on the charm, and are usually very smooth in a social sense. They often target kids who struggle with emotional regulation, the kids they know they can needle until they get a strong reaction. Or just normal kids who hit their breaking point. But, because teachers are just as taken in by this kind of manipulation, they often see the bullies as well-spoken, charming, and popular, and the victims as maladjusted kids who just need to stop being so awkward/emotional/angry.",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "You’re generalizing based on the most extreme cases, which are generally the only ones we hear about. Bullies are regularly given detention, suspension, and even expelled depending on the severity and consistency of their bullying. Don’t let the media’s sensationalizing get the better of you. Think about how ignorant it is to assume teachers as a whole don’t give a shit because you’ve read or heard about some that don’t. Obviously there are bad teachers out there, just as with any job. I know it’s human nature to equate the majority with the minority we know about, but try to think more critically. \n\nDepending on the size of the school there could be as many as a couple dozen or more teachers in each. Depending on the size of city there could be as few as one school for all ages or as many as multiple for each age bracket. Class sizes are up over thirty students in each classroom in major population centres. Teachers with a full class load can have upwards of 120-150 students a day. Obviously some might be repeats if they’re teaching multiple subjects, but you get the point. Some bullies are extremely adept at not being caught and even ingratiating themselves to the teachers. That doesn’t mean the teachers don’t care, just that they may not see. And often teachers have their hands tied if they don’t witness the bullying directly. I’ve often been forced to address issues with the entire class, rather than the individual, when I have no immediate proof something happened. It would be ridiculous to assume that because some teachers either don’t care or are just oblivious all must be the same.",
                  "id": 6,
                  "comments": [
                    {
                      "score": 165,
                      "content": "Are we pretending the systemic failures don't count because the ones doing the failing have reasons?",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 55,
                      "content": "> You’re generalizing based on the most extreme cases [...] Don’t let the media’s sensationalizing get the better of you.\n\nFirst, you assume that people's only experience of bullying is how it is portrayed in the media instead of, you know, being bullied themselves. I know that, personally, my opinion of how teachers handle bullying didn't come from movies or newspapers; it was personal experience as a bullied kid going to every single teacher and school admin I could contact to ask for help, only to be turned down every single time. I only stopped being bullied when I fought back against the guy who'd been bullying me relentlessly for year and broke his nose - but of course, then I was punished for it.\n\nJust like police screeching \"just a few bad apples!\" while actively protecting cops who kill innocent people, educators don't get a free pass for systemic issues that cause bullying. \"Zero tolerance\" rules are the most pro-bullying rule imaginable, yet they are the norm in schools, *criminalizing being a victim.* School administrations famously avoid taking any side when bullying happens (unless the bully is the son of someone rich, famous, powerful in the community or who gave money to the school, then the school will actively side with the bully), and teachers who let bullying happen just because it would be a headache for them to save a kid are never disciplined. This is a systemic problem fostered and encouraged by the set of rules that you guys keep in place, not an isolated incident or two.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 45,
                      "content": "By the way. Personal experience here of a 3/4 of a year of bullying from nearly my entire class in grade 7. I was soundly blamed by my principal for my trauma. Needed to move schools to make it stop, those kids literally kicked my ass down the street the day I left for good. The principal had reasons but I still slipped through his care. Something has to be done about those situations.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 45,
                      "content": "[deleted]",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "Bullies don't see it as punishment that they don't have to go to school. I assume you went to school at some point; how many bullies did you know who gave a fuck about their grades or attendance? They just come back after their suspension or go back after detention and beat the kid up for snitching. I speak from experience, here.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "You'd be fooling me lol. I was bullied for YEARS and nothing was done about the bullies. I often got in trouble for crying in class after the bullies did their thing. I finally snapped and fought back, and guess who they tried to give the suspension to? Thankfully my parents stood up for me and prevented it.\n\nSame exact thing happened to my brother a few years later. And my cousin, when she was assaulted by her bully in the school parking lot a few years ago. I have yet to believe schools will do anything about bullies. They only seem to punish victims when they fight back.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "\"Media sensationalism\" ain't it hon.\n\nWe're talking about *our* experience. While the plural of anecdote isn't data, millions of kids (and former kids) can't *all* be wrong.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I like how it's ridiculous to think that all or most teachers don't care based on experience with \"some teachers\" but you seem to be assuming most schools are as proactive as yours.\n\nBased on my own experience, OnlyTheBestAdvice is right. Teachers routinely let me down when I came to them about the harassment I faced. They usually took actions that were ineffective, took no action at all, told me I wasn't really being bullied, or they joined in. I did have a handful of teachers who were proactive at bullying prevention, and it was less about punishment afterwards and more about shutting down the behaviour immediately and firmly, in front of everyone. \n\nJudging by other people's comments here, and literally everyone else I've talked to in real life who was bullied, \"authority figures letting down victims\" is the norm, not the exception.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "In my experience, nope to this. My son was routinely bullied by a kid and his group of goons from Kindergarten until the little asshole moved away in the middle of third grade, and his remaining buddies still enjoy poking at my boy periodically (currently in fourth grade). Despite knowing exactly who the culprits were, and having corroboration from witnesses (my son wasn't his only target, just one of his favorites), the teachers and principal basically just shrugged and called it a dispute between students. Since the boy was never caught in the act of touching or harassing my kid, the school did not consider it something they needed to deal with. My son was not safe in class, at recess, or even on the bus.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Eh... I've been bullied, been ostracized... I have the experience, the media isn't going to \"get the better of me.\"\n\nAnd people clearly have been misreading my earlier comment, so I'm reposting it because I'm trying to give OP some advice - *because I've dealt with bullies like this before*. ^((My judgment is at the bottom.))\n\nHaving been bullied, and seen others bullied, was why this post was a difficult thing for me to automatically make a judgment on. On one hand, the two girls *are* bullies. On the other hand, OP's action can also be considered that of a bully - *according to the school*.\n\nIf you had first shown the evidence to the RA and, after coming to no satisfactory conclusion, then decided to post the images, then I would've immediately said that you were n-t-a for sure. Instead, you did it preemptively, without considering the fact that having had evidence of the girls' actions to present on this occasion may have actually incurred some disciplinary actions on your behalf against the miscreants. By going around the procedures that have been put in place, this would likely negate any possibility of it being solved properly because now the girls could point to your actions as being the actions of a bully. By not presenting it properly, they might suggest that the whole thing was fabricated from the get-go. (*This is not a joke - I've seen this happen several times to the victims of bullies.*)\n\nPublic shaming can work, true, but if you have evidence and decide not to bring it to the authorities (RAs) in place first, do not be surprised if, the next time you need assistance from said authorities, that they will be disinclined to listen to you since your actions not only shamed the girls but also would've reflected poorly on them if they don't take action against your actions now, which is a concern I have for you. No, that action would not be appropriate, but RAs are still people and can make bad judgment calls the same as anyone else. (Remember to **CYA** \\--  *make sure to keep records of any unseemly behavior aimed towards you now from the RA*. If the RA tries to bully you, collect that evidence!)\n\nI do find it understandable that you might have jumped the gun in your fervor to dispense justice on those who did wrong against you and your friend. I would hope that maybe having some sort of mediation between you and the girls with the RA can get this poor behavior of their's resolved. If they cause more trouble and you get more evidence, go to the RA first... and if the RA still won't take appropriate actions to get them under control, then you go the public shaming route and, this time, be sure to include the reason why you did so - ***that your complaints are going unheard***. After all, public shaming works on those who are authority figures too.\n\n# Still, NTA.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Case in point: the current president of the United States \n\nlmao. (but also facepalm, as I am an American)",
                  "id": 17,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yeah that is correct coming from a middle of the road American.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "A big part of the problem is that even when teachers do care, they don’t have proper training for the situation. The typical teacher approaches to bullying can actually make it worse, or the bullies just get better at hiding the abuse. Administrators need to ensure their teachers and staff have proper training on research based ways to prevent and stop bullying",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Yeah a lot of teachers who watched Gum being thrown in my hair on a daily basis, *really could’ve fooled me* that they give a **** about kids being bullied. I’ve been to four different school districts and oh, upwards of 16 schools. Never once did I have a teacher who would do anything when I was bullied but when I did something back you can bet your ass that I was suspended.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "Maybe if bullies weren't too fucking stupid to realize that they themselves are actually the massive assholes that they are, they would stop treating other people like garbage.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 91,
              "content": "I agree! I am hoping this helps shed some light on the fact the RA’s aren’t doing what they should be...which is why she was probably mad. Some public shaming could cause issues, but sometimes that’s what it takes for people to get the message that they are assholes. OP, I’m hoping you have some people on your side as well!",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "My name has the word ‘gay’ in it, I told my teacher when kids were bullying me. She said ‘oh they mean the nice gay’ just so she could do nothing. I’m sorry but you saying you’re a teacher gives nothing to your comment. You can have your belief whether you’re a teacher or not, but being a teacher doesn’t give you anymore insight to it, considering most teachers are just humans who act the same way as the RA.",
              "id": 23,
              "comments": [
                {
                  "score": -4,
                  "content": "Sorry, but yes. Me being a teacher gives me insight into teaching. Your being bullied gives you insight into being bullied. I was as well, for what it’s worth. I was always overweight as a child and never did a teacher help me. They didn’t see it. Your teacher was naive and maybe a bit burnt out. My being a teacher gives me insight to understand what teachers go through and the real issues. She maybe shouldn’t have been a teacher. She may not be anymore. Everyone has that one teacher they hated but they leave them at the end of the year and have no clue what happened to them. For all you know she was fired at the end of the year and someone else replaced her. To be this upset about how teachers don’t care because one teacher was insensitive is short sighted and honestly a bit self centred. Your best experience, as upsetting as I’m sure it was, isn’t the norm.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 9,
                      "content": "[deleted]",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "> Your teacher was naive and maybe a bit burnt out.\n\nCome on. That's not naivete. That's just  not wanting to do something about it. I'll grant that it's maybe even feeling powerless about doing anything about it. But, no teacher actually believes that students mean the 'nice' kind of gay.",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Teachers at my school always seemed to turn a blind eye to bullying. Until one of the kids that was getting bullied stood up for him/herself and then got punished.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "(Wait.... did the teacher just say \"shit\"?)\n\nJk but I agree. Hardly public shaming. NTA",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Please please tell me that you reported it!!! There is absolutely no excuse for some to say those things because they disagree!!",
              "id": 29,
              "comments": [
                {
                  "score": 2,
                  "content": "I tried to find a way to report the message specifically but I couldn’t. If I report one of his comments I figured it wouldn’t be as clear what I’m reporting. This is my first time having to report anything on Reddit. XD\n\nEdit - I was able to report the message on my PC. I normally only surf Reddit on my phone and it’s not nearly as robust as the PC version apparently...",
                  "id": 30,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Good! I use mobile too and have heard it’s harder to use. I’m guessing they were banned because the profile is completely gone",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I will say that we had no idea the situation surrounding her friend or the RAs response. OP didn’t give the RA a chance despite having no prior personal interactions regarding bullying with him/her.",
              "id": 32,
              "comments": [
                {
                  "score": 1,
                  "content": "And it's entirely possible that most of the RA's response will be invisible to OP and the friend.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "EXACTLY!!",
              "id": 34,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "This, also report them to dean of students",
          "id": 35,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "I wouldn't even call this public shaming. It's simply reporting the truth.\n\nOP didn't call them names, didn't call for justice, didn't say their names or what room they are in. Just a picture and description of their actions. If they don't want the public to know what they're doing, they shouldn't do shitty things in public.",
          "id": 36,
          "comments": [
            {
              "score": 5,
              "content": "Public shaming and \"reporting the truth\" are not mutually exclusive. In fact in some cases they are one and the same.\n\n>OP didn't call them names, didn't call for justice, didn't say their names or what room they are in. \n\nSo you didn't even read the comment. The OP did say their names - and of course everyone knows what room people are at in a college dorm. She also called what they did was nastiness and bullying, not just describing what they did.\n\nI don't think OP did anything wrong by saying that, but it's clear you didn't even read the post based on your description of it.",
              "id": 37,
              "comments": [
                {
                  "score": 2,
                  "content": "I agree OP was justified.\n\nI did read the post, thank you. What OP posted to the facebook forum:\n\n> \"Jane Doe and Jen Schmo put this trash room sign on my door last night, calling me \"trailer trash\" while they did it. \n\nIf she used these names (and not filling in for reddit), then she used anonymity names. No one is named Jane Doe or Jen Schmo, unless you're a dead body in a Law and Order episode. I'm not really sure where OP \"called what they did was nastiness and bullying\" as you said it, but guess I can't read.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Why would someone write \"Jane Doe\" in the context of a college dorm? Obviously people know who other people are in your dorm. Writing Jane Doe would make no sense. She wrote their actual names but didn't want to put their real names in this post. \n\n>I'm not really sure where OP \"called what they did was nastiness and bullying\" as you said it, but guess I can't read.\n\nYes, you clearly are not reading. It was literally the sentence after what you quoted about Jane Doe.\n\n>\"Jane Doe and Jen Schmo put this trash room sign on my door last night, calling me \"trailer trash\" while they did it.\n\n>But all I'm thinking right now is that this kind of nastiness and bullying is trashier than any damn thing I ever saw in the trailer park I grew up in. (No, I'm not ashamed to say that)",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Do you know the \"Streisand effect\"?\nNTA though.",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Agreed 100%",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "ESH, OP way less, but hear me out before you drown me in downvotes...\n\nI don't blame OP. Not at all. Not even a little. But in the real world, this isn't the way things are handled. If I had my coworker, let's call her Fran, do some shit to me, I would be expected to handle things through the chain of command like an adult. If I post something back showing what Fran did on our internal company Facebook type page, I am going down with the ship, so to speak. It is my concern that OP could be subject to the same policy she is fighting against.\n\nIf the RA doesn't do anything to help, just like in the real world, she reports to someone. There is a higher power. And that is where you take it. Not to Facebook.\n\nBut again... I dont blame OP.",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I don’t even think what the OP did was “shaming” she reported facts with evidence, just as if someone had been caught on camera stealing a package or striking a car.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3099,
      "content": "NTA if the girls didn't want to be exposed as bullies then they shouldn't bully people.",
      "id": 44,
      "comments": [
        {
          "score": 1300,
          "content": "To put this another way, if they didn't want to be publicly shamed, they shouldn't have acted shamefully in public.",
          "id": 45,
          "comments": [
            {
              "score": 153,
              "content": "wouldnt taping a trash sign on her door constitute as public shaming? the same audience was able to see it as op's fb post.",
              "id": 46,
              "comments": [
                {
                  "score": 98,
                  "content": "I believe that is literally exactly what they’re saying.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 42,
              "content": "I love this.",
              "id": 48,
              "comments": [
                {
                  "score": 12,
                  "content": "I agree.  One of those \"if I could I'd give gold\" moments.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "Agreed 100% NTA.  The only reason the RA is pissed about it is it makes her look bad/incompetent too - if she was doing her job, the public shaming probably wouldn't have been necessary.  She is trying to make the OP feel bad acting like she did something wrong, but it's really more about trying to cover her (the RA's) own ass.",
          "id": 50,
          "comments": [
            {
              "score": 4,
              "content": "Exactly. The RA fucked up, and wasn't doing her job.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1507,
      "content": "NTA - The authorities who were supposed to arbitrate this, the RA’s, had proven apathetic and untrustworthy. They’re just mad because they got called to the carpet for being lousy at their assigned roles. \n\nYou shed a light on where the system was broken. Now maybe it can get fixed and start working again like it should.",
      "id": 52,
      "comments": [
        {
          "score": 190,
          "content": "Absolutely NTA, why would someone bother interacting with the provided systems if nothing is going to come of it. Those girls were caught in the act, if they're embarrassed by their actions, maybe they will think twice about doing it again.",
          "id": 53,
          "comments": [
            {
              "score": 108,
              "content": "I learned at like 6 that the adults at my school didn't give a fuck I was being bullied and would just tell me to ignore it. I stopped telling anyone because I knew nothing would happen. If a six year old can learn it, of course a young adult will too.",
              "id": 54,
              "comments": [
                {
                  "score": 64,
                  "content": ">\"Act like it does not bother you, and they'll grow tired and stop.\"\n\nWhat it really means is:\n\n>\"Act like it does not bother you, so we can rationalise it as roughhousing, boys being boys and all in good fun, as none are sad and don't have to actually do anything.\"",
                  "id": 55,
                  "comments": [
                    {
                      "score": 31,
                      "content": "I'm female but it's the same thing, kids are kids it can't be serious. What they are literally following you around the playground yelling and throwing things at you? Just ignore it, I promise they will totally get bored this time :) even though it has never worked before. When my mum was shocked after I mentioned how bad the bullying was when I got older I told her the truth, I didn't see any point in telling her as she's just go to the teachers that'd once again do nothing about it. Why make her worry if she can't help me?",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "The only reason I would is so they don’t have the excuse of “you should’ve contacted us, we would’ve solved it!” No you wouldn’t have.. “you never know because you didn’t do it!”",
              "id": 57,
              "comments": [
                {
                  "score": 3,
                  "content": "That's true, it can be helpful to cover all bases but I still wouldn't change my judgement all the same.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Me either. Wholeheartedly justified.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 80,
          "content": "NTA, also as a former RA, there are definitely superiors above them. \n\nYou can go to another RA of the building or another building, or go above them to the Coordinator, which is basically their boss. Then above them would be the admins of Resident Life. \n\nRAs are fellow students and usually just do it for the free room and board (or other perks), but Coordinators and Admins are not, this is their full time job. Ones who ignore issues like this won’t keep their job.",
          "id": 60,
          "comments": [
            {
              "score": 14,
              "content": "I was about to suggest this. OP needs to go up the chain. At my undergrad, the RA's were supervised by the Resident Director, and then the RD's reported to the Director of Residence Life. The Director then reported to the Dean of Students, etc.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 624,
      "content": "NTA\n\nI always tell people to keep the same energy. I don’t care that their drunk they wanted to be mean girls and be bullies so they got publicly shamed. \n\nEvery choice you make in life has a consequence both good or bad. Can’t say I blame you.",
      "id": 62,
      "comments": [
        {
          "score": 274,
          "content": "Honestly being drunk is such a shit excuse. Alcohol doesn't randomly turn you into an asshole, it makes you stop hiding that you are one.",
          "id": 63,
          "comments": [
            {
              "score": 53,
              "content": "In vino veritas",
              "id": 64,
              "comments": [
                {
                  "score": 3,
                  "content": "[deleted]",
                  "id": 65,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I also think the girls are the A here, but I disagree with this statement. Alcohol removes your inhibitions, but that doesn't make it reveal your \"true self\" because your inhibitions are part of who you are. It's part of learning how to behave in good and socially acceptable ways.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Right? Drunk me just becomes a more social Liz Lemon. I'll order shit tons of food and share it before consuming like 80% of it.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Get a bottle of beer. Dump half the contents. Now you have the perfect excuse for anything ^/s\n\n^^Disclaimer: ^^stay ^^away ^^from ^^the ^^driver's ^^seat ^^of ^^any ^^vehicle",
          "id": 68,
          "comments": [
            {
              "score": -8,
              "content": "Well, if I only drink half a bottle, I certainly still could drive :D",
              "id": 69,
              "comments": [
                {
                  "score": 4,
                  "content": "Unfortunately there are still many places (such as where I live) where you're not allowed to drive if there's any amount of alcohol in your blood, so to many redditors here that comment does apply.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 2,
                      "content": "How is that unfortunate? That's a good thing , you shouldn't drive with any alcohol in your system.",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 289,
      "content": "NTA. Hell with those girls You did take it to the next level for sure. You will know soon enough if you've started a helpful bigger conversation or it bites you in the ass. If you want the conversation work with the RA to get things going.\n\n I do like that you posted a photo, evidence style, of  the girls acting like drunken assholes which made you feel bullied. You told folks with the girls did, showed what they did, and posted YOUR  name to it.  I think when people get away with nasty shit by staying anonymous it gives them no reason to stop.",
      "id": 72,
      "comments": [
        {
          "score": 6,
          "content": "This is exactly why bullying will never stop - because they stay anonymous all the time. Sometimes, no matter how hurt someone may be, calling it out publicly is the only thing that can really pressure them.",
          "id": 73,
          "comments": [
            {
              "score": 3,
              "content": "Yep.Cowards hide- once a light is on them they scatter like insects",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 198,
      "content": "NTA fuck the girls.",
      "id": 75,
      "comments": [
        {
          "score": 115,
          "content": "So fuck them but N in TA?",
          "id": 76,
          "comments": [
            {
              "score": 42,
              "content": "I can't tell if people are missing the joke here or what, but this is funny\n\n\nEdit: the guy had 12 downvotes when I first replied",
              "id": 77,
              "comments": [
                {
                  "score": 16,
                  "content": "I know right?",
                  "id": 78,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "But also don’t fuck those girls",
          "id": 79,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "that's how you get in jail",
          "id": 80,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 157,
      "content": "NTA. \n\nI suspect this will now come up when potential employers google their names if it's on a public Facebook page... but tbh the employers need to know what sort of person they're recruiting and how they'll fit into a team, so that doesn't really change my vote.",
      "id": 81,
      "comments": [
        {
          "score": 73,
          "content": "[deleted]",
          "id": 82,
          "comments": [
            {
              "score": 11,
              "content": "I also believe that they can remove tags from the post, so people will only be able to see the names written down, but without any (virtual) link to their actual page. \n\nDoesn't mean that an employer won't be able to find the post (if public) and link the names to the girls in his head.",
              "id": 83,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 13,
          "content": ">I suspect this will now come up when potential employers google their names if it's on a public Facebook page...\n\nNot a chance unless the post goes viral. When you have friends tag you on meme pages those don't show up. Plus the fact that it's a small group and most likely private. You'd have to do some hardcore digging to stumble upon that.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 130,
      "content": "NTA. Do stupid shit, win stupid prizes.",
      "id": 85,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 93,
      "content": "NTA. Calling out assholes generally does not make you an asshole.",
      "id": 86,
      "comments": [
        {
          "score": 9,
          "content": "I know! Since when has calling out assholes become bullying!? I can't stand the hypocrisy.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 85,
      "content": "NTA\n\nMy roommate and I were \"bullied\" (I use quotes because they were really, really trying to bully us but we thought they were all idiots and just ignored them/generally didn't care). They knew that we'd both slept with guys that lived in their residence building that I guess they knew (not their friends) and they used to say \"woo woo!\" like a train whistle when they saw us, calling us the \"hoe train\" (real clever). We'd just laugh and roll our eyes. Then one day we were all going to some dorm event in buses and they were on our bus. As some point they started in with the clever \"woo woo!\" train whistle and one of their *own* friends - a guy who was casually dating a girl I knew from school - stood up on the bus and said, \"Listen, it wasn't funny the first time and it's still not funny so how about you STFU and sit your asses down\" and they were so humiliated they shut their mouths and never bothered us again :)",
      "id": 88,
      "comments": [
        {
          "score": 9,
          "content": "That guy is awesome.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}