{
  "post content": "Alright so this one messes with me a bit because it happened with a fairly close friend of mine and my wife says I'm an asshole for this.\n\n&#x200B;\n\nContext: I'm a 38 year old and I work in the banking industry and I'm a Partner at a fairly prestigious firm in my country and I earn well over a million on most years (this is important later down).\n\n&#x200B;\n\nRecently I got a yacht and invited some of my friends and their SO's over to stay the weekend and have a nice weekend boat trip.  All was fine until Saturday evening after dinner, we sat around the table and were talking about life and our careers especially how far we've come since college.  Jordan (one of my friends) decided to bring up careers, which is something I don't like discussing about myself because it often incites jealousy and arguments but anyways.  We effectively did like a \"go 'round the circle\" thing, and when it was about to be my turn I excused myself to \"go to the toilet\" but everyone else caught on and they said something along the lines of \"we know what you're trying to pull, just tell us\".  I said that I work in the financial industry and I make 100k (we were also discussing salary for some reason).  From the look my wife gave me, Jordan caught on and said \"Stop bullshitting and tell us what you actually make\".  I said \"Ok fine, I lied, 100k is my bonus, I make 500k\" which isn't true either.  At this point it was easy to tell that I was lying because I was going slightly red and my palms were sweating a lot.  Jordan once again caught on and said very loudly \"Just goddamn tell us what you make, and I'll leave you alone\".\n\n&#x200B;\n\nThen I finally told the truth.  \"I make 3 million in a bad year, and 8 million on a good year, ya happy now\".  Jordan's face essentially contorted into a vicious sneer and proceeded to start calling me a \"Corporate sleezbag\" and that I \"leech of people's hard work and defraud the government\" etc, none of which I do,  as I literally sacrified my social life and health at one point to get where I am now.  He continued unleashing his vitriol at me for 15 minutes, and I was calm until he started attacking me personally, saying that I was a shitty greedy person and that I should go drown myself because I embezzled from hardworking people like him, which again neither of which I do because I don't even work in consumer banking I work in corporate finance.  I finally snapped (something which I do very rarely because I get really terrifying) and screamed at him to get his ass out of my boat, and called him every swear word under the sun, including \"pansy ass cunt\" among other things and didn't stop for a solid 10 minutes. I effectively just dragged him out of my boat and told his girlfriend to \"fuck off and find a new dick to suck, because his won't stand anymore\".  After which I just sat in the cabin and stared out the window.  Now here I am at home and my wife won't speak to me because she calls me an asshole for doing all that.\n\n&#x200B;\n\nAITA?\n\n^((I'll edit the post as necessary))\n\n&#x200B;\n\nEDIT1: Just to let you guys know, this is a throwaway for obvious reasons.  \n\n\nEDIT2: Ok, so I've realised that I'm an absolute asshole for screaming at Jordan's girlfriend and I'll apologise to her as soon as I can get in contact.  And I'm going to have to talk with my wife about what happened and to see if we as a couple can move past this.  I also need to apologise to my other friends for them getting caught in the middle of my screaming, and I need to cut all ties with Jordan.  - I'm an idiot for loosing my shit.",
  "id": 1,
  "comments": [
    {
      "score": 1019,
      "content": "ESH/NTA (bit of both).  The screaming was a bit much (and your comment to his gf was way out of line),  but you were absolutely justified in chucking him off the boat. That conversation was probably intended to dig into your finances - it's a subject generally well avoided for this very reason.",
      "id": 2,
      "comments": [
        {
          "score": 282,
          "content": "Thanks for your response, I definitely shouldn't have spoken to his girlfriend like that at all.  Although I'm really curious about why Jordan did this in the first place.",
          "id": 3,
          "comments": [
            {
              "score": 286,
              "content": "Jealousy and spite. I'm in the \"working poor\" class  myself and have had to leave certain groups of online friends because I was struggling with resentment, which didn't feel good.  Jordan did not learn how to step back and deal with your own emotions instead of making them someone else's problem.  \n\n[I'm still friends with them individually, but as a group, they can't fathom the way life is for anyone making under 6 figures.  And while I understand that they worked hard for what they do have, they lack perspective and I don't want to feel angry towards them because they were dealt a different hand than I was. ]",
              "id": 4,
              "comments": [
                {
                  "score": 47,
                  "content": "Yeah, I’ve been on both sides of this. Growing up my fam was lower middle class, my mom was a massage therapist and would bring me with her to clients’ houses to play with their kids, and some of these houses were just ridiculous (whereas my family lived in a 400sq foot apartment). As a kid though I didn’t feel any resentment, and I’m still friends with some of those people. When I started making more money though, some of my “friends” were just so spiteful about it. I guess just I don’t get it. Feels bad man",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Except Jordan makes 150$k a year. This is the equivalent of the top 5 percent of earners going after the top 1 percent of earners.",
                  "id": 6,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "Yeah she wasnt part of the problem and you basically called her a whore. I wouldnt apologize to your friend but I would apologize to her. It's not fair to throw sexual insults to women cause you're angry",
              "id": 7,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "I am not saying he should have attacked you for your income, but during a time when income inequality is at all time highs and moneyed interest is controlling political parties, you may want to take a moment to think about this perspective:\n \"I embezzled from hardworking people like him, which again neither of which I do because I don't even work in consumer banking I work in corporate finance. \"\nYou may not have ever engaged in illegal activity of embezzling directly from someone, but the corporations are squeezing the working class and telling them to work more hours with less value for their work. A company shouldn't be hiring staff unless they've decided they are necessary for the company to function as planned.  But financially the companies are telling the working class their time isn't worth a living wage, even if that time is what makes the lifestyle of the elite possible.",
              "id": 8,
              "comments": [
                {
                  "score": 26,
                  "content": "Assuming his story is true, I think his friend crossed the line when he got personal. I totally understand where he's coming from. A lot of people are screwing over the little guy and he's obviously one of them, but that doesn't mean he can attack OP personally. He should stay away if he can't deal with it, or at the very least avoid the topic of money. \n\nThe only one I feel sorry for in this story is the GF. She sounds like the only innocent person here.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "OP isn't responsible for any of what you said above.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Nowhere in my argument did I say he was. I was making a point that other people don't see those problems coming from the consumer sector, they see them coming from the corporate sector. OP was saying none of the ”friend's\" rant applied because he works in corporate, not consumer. I was saying the argument was coming from a larger problem that does include his sector. The embezzlement comment seemed directed at the way society currently squeezes the working class for labor, not \"I think you have personally embezzled from consumer accounts\". Either way my verdict is ESH. I have a feeling everyone present viewed it as a giant dick measuring contest between the two and were cringing at the hostility of both. I can't imagine addressing a friend the way either of them did. Going after the girlfriend that lewd way was horrendous.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Yeah she wasnt part of the problem and you basically called her a whore. I wouldnt apologize to your friend but I would apologize to her. It's not fair to throw sexual insults to women cause you're angry",
              "id": 12,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Honestly, from the way you wrote this story doesn’t sound to me like it’s legit. You’re telling me that a guy smart enough to make 3-8 million dollars a year can’t just say “sorry, I don’t feel comfortable discussing finances” instead of lying to him twice before caving against your will? Not to mention that his reaction is waaaay over the top. This sounds like a shitpost.",
              "id": 13,
              "comments": [
                {
                  "score": 3,
                  "content": "R/humblebrag",
                  "id": 14,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "People who make a lot of money are no better than anyone else, including their social skills.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 0,
                      "content": "People can be poor and have great  social skills, but it’s kinda impossible to go from nothing to earning 8 million a year if you’re stupid and socially awkward.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Willing to bet he planned to do this. Probably held a grudge against you forever. I've read stories like this often - sometimes it's hard to maintain friendships with obvious wealth differences. You hear it often about people who get a sudden windfall of wealth (lottery, inheritance) and it even turns family members against each other. It sucks but, this might have been completely unavoidable on your part, your friend's jealousy/emotions overran him and you had to kick him off the boat.",
              "id": 17,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "In the future, just say I don't discuss my finances. My dad was very private about finances, although we were middle class. He would straight up tell people. It's personal, like your health.",
              "id": 18,
              "comments": [
                {
                  "score": 4,
                  "content": "Definitely, and bow out of those conversations as soon as they start - \"oh, I don't discuss salary,  does anyone want a drink while I'm up?\"\n\nLetting it go around to you and then trying to back out looks cagey, like you're happy to snoop on your friends salaries but won't share your own.\n\nThat said, your \"friend\" sucks. Who TF plays petty games like that?\n\nI do find it amusing that OP didn't want to incite jealousy with their success... on their yacht...",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "OP, I married someone who makes almost 4x what I make. When the topic of finances comes up I always try to steer away or make a joke about something everyone can identity with( ex: $38 to fill up my gas tank?? Whaaaaatt?!?)\n\nYou aren’t the asshole for kicking someone off your boat or making a lot of money. But sometimes you have to just change the subject or say something like “I do pretty well for myself. I did have to save up for this boat though!”",
              "id": 20,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 447,
      "content": "Wow... ESH\n\nYour boat and your party and all. But, your friend should have behaved nicer and not pushed you on something you were obviously uncomfortable talking about. \n\nYour friend ALSO shouldn’t have gone after you when he found out an answer he didn’t like (my grandfather always told me “never ask questions you don’t know the answer to”)\n\nHowever, you chose to go overboard with your reaction alienating everyone who was there in a lapse of self-control. If you’re hosting an event like that, it’s best to stay cool and shake these things off.\n\nEdit: some grammar things",
      "id": 21,
      "comments": [
        {
          "score": 120,
          "content": "Mm, now that I think about it, I went way over the line.  I suppose what really pushed me over the line, is the fact that my wife did nothing to defend me as well.  Thanks for your comment.",
          "id": 22,
          "comments": [
            {
              "score": 151,
              "content": "It’s very possible that your wife didn’t defend you for a couple of legit reasons  (non-confrontational, this was your fight with your friend, she was really caught off guard when the friendly game turned into a fight and froze, very few of us know what we are going to do in a fight until it starts) but if my husband was screaming at people I’d probably want to get off the boat too.  Is screaming and losing your shit out of the ordinary for you?  \nDid she support you when you were sacrificing your health and life for this company?  \nI find it very interesting that this comment goes from “well I was poorly behaved BUT it was her fault” pretty darn quick.  Like if she was actively agreeing with them that’d be something to explore in therapy with a counselor.  But if she just didn’t join the fray while you were screaming about Jordan’s dick?  That probably also requires a counselor too but more for your anger management.",
              "id": 23,
              "comments": [
                {
                  "score": 73,
                  "content": "I don't think he's blaming his wife. I think he's saying that it was the fact that his friend was ripping him apart, and no one, including his wife, stood up for him, that pushed him over the edge.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 42,
                      "content": "I can see that but again I’m not sure what he expected her to do in the moment when a friendly game soured and he started ripping into his friend’s dick.  He mentions it again in other comments that call out ESH.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "Did you read the post? The dude was going off at OP for 15 minutes.\n\n15 minutes.\n\nCan you sit and have someone do that to you for 15 minutes while your wife and all your friends are just sitting watching it happen without losing your cool?\n\nIf you can then congratulations, you're the calmest person on planet Earth.\n\nAnd I would expect my friends to defend me in a situation like that, if they didn't then they wouldn't be worthy of the term \"friend\"",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "I'm not blaming my wife because she supported me wherever I went, I'm just a bit miffed that she didn't bother saying anything to me after I calmed down.  I shouldn't have said those things to Jordan's girlfriend and am going to apologise to her once I can get in touch with her.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 2,
                      "content": "You behaved like a douche canoe. What could she have said that would have satisfied your needs? YTA btw. Why on earth do they pay you so much if have to run to the toitoi to avoid a question? \n\nNo one is worth that much. Jordan was right. He’s a dick for bringing it up on your boat at your social event, but saying you’re ok because your in corporate banking? C’mon.",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "I personally think you had every right to call him out on it. He was being an asshole about it and you did have every right to do what you did. You didn't want to tell him and he pushed you. I do think you went over board bring his girlfriend in to it though it was a funny comment. I do find it strange though as to why your wife thought you were an asshole?",
              "id": 29,
              "comments": [
                {
                  "score": 2,
                  "content": "Uhhh maybe because he attacked this guys GF for no reason? Like who does that lol what an asshole, OP and Jordan are made for each other",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I feel bad for all the people trapped on the boat having to deal with this drama",
              "id": 31,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "This falls under the \"don't ask questions you don't really want the answers to.\"  He knew you made a lot of money and had all those insults in his brain about you already he just needed you to confirm it.  If your my friend and you make 8 million i want to see you make 10 or 20.  Not to be at my level.  He deserved the insults he got.  Good on you",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Fight or flight, with heavy emphasis on the flight. Do you do this often? Your wife sounds like she was frozen in shock or disbelief, as were the rest of your friends. Both of you were extremely rude and extremely confrontational, completely trashing the societal norms for a supposedly friendly get together. The two of you are major assholes for subjecting everyone else to such a crass display of poor manners. ESH.",
              "id": 33,
              "comments": [
                {
                  "score": 1,
                  "content": "Could you sit idly by for 15 minutes straight while someone verbally berated your husband while they’re a guest on your property? I get maybe being in shock for a minute, but 15? I get why he might be a bit upset his wife didn’t have his back. \n\nHe shouldn’t have made the comments to the guy’s girlfriend though.",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -1,
              "content": "Fight or flight, with heavy emphasis on the flight. Do you do this often? Your wife sounds like she was frozen in shock or disbelief, as were the rest of your friends. Both of you were extremely rude and extremely confrontational, completely trashing the societal norms for a supposedly friendly get together. The two of you are major assholes for subjecting everyone else to such a crass display of poor manners. ESH.",
              "id": 35,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -2,
              "content": "Fight or flight, with heavy emphasis on the flight. Do you do this often? Your wife sounds like she was frozen in shock or disbelief, as were the rest of your friends. Both of you were extremely rude and extremely confrontational, completely trashing the societal norms for a supposedly friendly get together. The two of you are major assholes for subjecting everyone else to such a crass display of poor manners. ESH.",
              "id": 36,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": ">(my grandfather always told me “never ask questions you don’t know the answer to”)\n\nSo how did education work in your Grandfathers world?",
          "id": 37,
          "comments": [
            {
              "score": 50,
              "content": "I assume they meant questions you don't *want* to know the answer to",
              "id": 38,
              "comments": [
                {
                  "score": 1,
                  "content": "Lol yeah probably, I just find it amusing when people make blanket statements like that one ;)",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Hehehe... Overboard...",
          "id": 40,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 340,
      "content": "Am I the only one that sees this as extremely far fetched?",
      "id": 41,
      "comments": [
        {
          "score": 102,
          "content": "Depending on the size of a boat, it's a costly endeavour. There is mooring fees and maintenance. Not something you'd want to do if it would eat into your finances heavily.\n\nAlso, there is plenty of wealthy people in the world that aren't film stars, celebrities or sports personalities.\n\nAnd corporate finance is definitely a lucrative career. Look at wolf of Wall Street as an example, I know the film might be a bit hyperbolic, but it's based on a real person.",
          "id": 42,
          "comments": [
            {
              "score": 25,
              "content": "Yeah, and that's not exactly a movie that *celebrates* that kind of lifestyle.",
              "id": 43,
              "comments": [
                {
                  "score": 12,
                  "content": "Oh yeah, definitely agree on that.\n\nI just meant it can show you how easily someone who does well in finance can be wealthy.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 6,
                      "content": "That is a movie about how fraud can make you wealthy.",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "8 million a year jesus christ...",
          "id": 46,
          "comments": [
            {
              "score": 72,
              "content": "Yeah and that's not even that high for the industry if you've been working at it for a while. My brother graduated with his MBA in 2016 and has been working in corporate finance since then. He makes at least $1m/year and every year his pay goes up significantly. It would be realistic to assume that within 10 years he could be making $5-8m/year. His bosses make $25m or more. \n\nOf course, the quality of life is terrible. My brother has no life, hates his job, hates everything. Used to drink and smoke weed excessively just to come down from all the adderall everyone there takes to get through their 18-20 hour workdays. And every year, he swears he's going to quit, and they throw a six figure bonus at him to get him to stay, so he stays.\n\nI make six figures but nowhere close to what my brother makes. I would not change jobs for the world, and I intentionally chose not to go down the path my brother took. There is literally not enough money in existence to make that lifestyle worth it for me. I'll work my 50-60 hours a week, take my lesser pay, and have a life outside of work, thankyouverymuch.",
              "id": 47,
              "comments": [
                {
                  "score": 25,
                  "content": "For what though, how could you possibly make that much money doing someones finances. School teachers make a fraction of a fraction of that and they do important work. Makes me sick to think we pay the absolute wrong people an absurd amount of money. Thats just me though what do I know",
                  "id": 48,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Yeah I really don't care if its unpopular or seen as bitter, I personally believe making that much money is immoral. People with jobs that have a positive social impact such as teachers and doctors etc. get paid a pittance compared to finance. It's all a big money showering circle jerk that I want no part of.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "I think conflicts like this will become more common as people's distaste and awareness of inequality increases.  What OP is making in a year is enough for several families to live off of and never have to work again.  It's a little crazy.  I'm not saying what he's making is wrong, or immoral.  I do think that the attitude towards it will only get worse with time.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "He is not \"doing someone's finances,\" he likely works in corporate finance so the customers are mid-sized to large corporations generally.",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "But the thing is, it’s not possible for our government system to pay each teachers a million dollars a year. The government does not have that much money to spend. However, private companies do have that much money to spend (and also likely require much fewer employees than the education system.) We dont have a society that pays people based on what careers are thought to be “more important”, that is way too subjective. Instead we pay people based on the resources we have and how expendable any particular employee is based on their skill set and performance. I think this is fair but that is just my opinion.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "He’s not a personal financial advisor, he works for a very large bank doing corporate finance, corporate restructuring, etc. I was talking to him recently because someone asked me for information on how to get to his position, and he told me to make sure they know they’ll hate themselves for doing it. So don’t worry, yes he makes a shit ton of money, but he’s miserable.",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 0,
                      "content": "He gets paid millions but he makes the company tens/hundreds of dollars while investing/handling the flow of billions of dollars. \n\nThere is a *lot* of money out there changing hands...",
                      "id": 54,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -1,
                      "content": "I think conflicts like this will become more common as people's distaste and awareness of inequality increases.  What OP is making in a year is enough for several families to live off of and never have to work again.  It's a little crazy.  I'm not saying what he's making is wrong, or immoral.  I do think that the attitude towards it will only get worse with time.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "It will sound obnoxious but that’s kind of average for OPs age assuming he started it after uni/MBA.\n\nMy ex retired at age 32. He’s also an ass but not because of the money thing",
              "id": 56,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "8 million what though? Zimbabwean Dollars?",
              "id": 57,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 43,
          "content": "Likely shit post. Agreed.",
          "id": 58,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 40,
          "content": "Seems like a kid wrote it",
          "id": 59,
          "comments": [
            {
              "score": 24,
              "content": "Exactly! The guy isn’t even confident enough to smile politely and say “Sorry, I don’t feel comfortable talking about it”, but lies twice before turning red and caving in?",
              "id": 60,
              "comments": [
                {
                  "score": 8,
                  "content": "Most people who are so high up making this much money in a professional environment usually conduct themselves in a decent manner and know etiquette. If this guy works in such a fast paced and high strung environment you would think he could hold his temper...",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 27,
          "content": "Is 8 mil a year max actually yacht money? And how does this guy's friends have no idea how much money he makes- have they seen his house or any other (I'm assuming expensive) possessions? Why would you weekend on someone's yacht if you're that violently opposed to wealth?",
          "id": 62,
          "comments": [
            {
              "score": 22,
              "content": "All good points. However, 3-8 million a year invested well turns into a lot of money. Not all yachts are $30+ million super yachts. You can buy a very nice 80-90 ft yacht for $1-3 million. \n\nHowever, this post sounds BS and you're absolutely correct on everything else.",
              "id": 63,
              "comments": [
                {
                  "score": 6,
                  "content": "It's fucking dumb. If my friend invites me to hang on his fucking YACHT I don't need to see his W2 to know he makes a shit load of money.",
                  "id": 64,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "I was thinking more about the operation costs. I know those superyachts take several million a year to keep going, so I figure even a smaller one has a lot of ongoing cost. (And yes, for the record, I AM mad at myself for how much time I've spent thinking about yacht budgeting because of this post.)",
                  "id": 65,
                  "comments": [
                    {
                      "score": 4,
                      "content": "It's not a superyacht, it's just a reasonably sized 3 room yacht that doesn't require me to spend tons of money on.",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Also: why would anyone believe someone makes $100k/year if they are on a yacht owned by that someone? It's just not a believable lie.",
              "id": 67,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": ">Is 8 mil a year max actually yacht money? \n\nYachts are basically just any pleasure boat. They don't have to be massively expensive to be classified as a yacht.",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "Seems like a fucking kid wrote it",
          "id": 69,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "I referred to himself as \"extremely terrifying\" at which point I laughed out loud.",
          "id": 70,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "No, you’re not. Seems like a day dream gone too far",
          "id": 71,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 224,
      "content": "YTA for what is obviously a shit post. This was written by a child.",
      "id": 72,
      "comments": [
        {
          "score": 162,
          "content": "Seriously. “People get jealous and weird when they find out how rich I am” “I’m really terrifying” and “find a new dick to suck because his won’t stand anymore.” \n\n\nEither OP is a huge shitposter or he’s a 13 year old in a 38 year old’s body.",
          "id": 73,
          "comments": [
            {
              "score": 35,
              "content": "Plenty of people in finance fitting the latter description",
              "id": 74,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "And so proud of his bad temper. Big man.",
              "id": 75,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "God yes. Just a kid with some random fantasy about being powerful",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "Also why would anyone believe you only make $100k when you’re literally on YOUR yacht..",
              "id": 77,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 104,
      "content": "NTA he has no right to give you shit nor do they have a right to know what you make. Someone clearly insecure and jealous.",
      "id": 78,
      "comments": [
        {
          "score": 17,
          "content": "Aye to that.  I shouldn't have talked about it in the first place.",
          "id": 79,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 61,
      "content": "ESH- Corporate greed is a very real threat to the lower middle class.  You should do a little research about what your former friend is upset about.  Also, be careful who you invite on your yacht. \n\nAlso, I sacrifice my free time, family time, and health for my job and I make  $50,000 a year.",
      "id": 80,
      "comments": [
        {
          "score": 124,
          "content": "Are you fucking kidding me? Asshole goes off for 15+ minutes on op’s boat and you think op needs to research corporate greed? What a fucking joke!",
          "id": 81,
          "comments": [
            {
              "score": 33,
              "content": "Ppl are crabs in a bucket on Reddit unless you live in a one bedroom apt and can only afford ramen then you are greedy bastard to ppl here.  It’s a race to the bottom with the misery olympics",
              "id": 82,
              "comments": [
                {
                  "score": 18,
                  "content": "Look who has a bedroom!",
                  "id": 83,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "You can even afford internet, you greedy corporate asshole! I have to use supermarket wifi in order to tell you how privileged you are!",
                  "id": 84,
                  "comments": [
                    {
                      "score": 1,
                      "content": "You have a phone I have to sneak into the public library and use one of their computers.  You privileged bourgeoisie jerk",
                      "id": 85,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Seriously lol. The guy got invited to a weekend long trip on a private yacht. Probably all expenses paid for too. The 'friend' is just a massive jealous dickwad, regardless of the topic he ranted about.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 51,
          "content": "I understand that its a threat to people in general, but I'm not even involved with anything like that.  My job is purely client focused now.  And yes, I need to double check who I invite (if at all) next time.  If it helps, Jordan makes ballpark 150k which isn't bad.  Thank you for your response my dude.",
          "id": 87,
          "comments": [
            {
              "score": 59,
              "content": "150k is fucking great, he has no right to be that upset, or upset at all, about how much you make.",
              "id": 88,
              "comments": [
                {
                  "score": 30,
                  "content": "Exactly",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": -1,
              "content": "The laws are stacked to help the corporation.  Totally not your fault.",
              "id": 90,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -2,
          "content": "How much you invest in your career doesn't entitle you to anything.\n\nHe was successful doing so, you might be a little less, life is not meant to be fair sorry.\n\nCorporate greed has nothing to do with the issue, his friend is already rich af but is just jealous he didn't get the same career",
          "id": 91,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -12,
          "content": "If you're getting paid $50,000 it's because you're worth $50,000.\n\nHate to break it to you but OP does an extremely difficult job that you have to be extremely intelligent, skilled and disciplined to do and works a lot more than you.\n\nThis notion that people like OP sit down smoking cigars all day is complete rubbish, new investment bankers usually work 120 hours a week, do you work that hard? Are you as smart as them? Can you do what they do?\n\nBill Gates (the most charitable person in the world) once said \"If You Are Born Poor It’s Not Your Mistake, But If You Die Poor It’s Your Mistake\"",
          "id": 92,
          "comments": [
            {
              "score": 11,
              "content": "This must be written by a teenager. That's not how the real world works. \n\nHard work has a very low correlation with wealth. Shit, I work 25 hours a week and make over 100k. I bet 80% of people making minimum wage work harder and longer than me.",
              "id": 93,
              "comments": [
                {
                  "score": 1,
                  "content": "You’re the first rich person I’ve met who claims they don’t work hard. Teach me your ways, senpai?",
                  "id": 94,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Not the person you're asking, but one of the answers is software development. Become a freelance engineer and you can easily make six figs working part-time hours. \n\nI can think of 100 jobs that would require working longer and harder than I do, and I outearn them all.",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 0,
                  "content": "[deleted]",
                  "id": 96,
                  "comments": [
                    {
                      "score": -1,
                      "content": "Yeah, I guess it errored when I posted. Congratulations on how much money you make. Are you claiming that you work 5 times as hard as every one of the millions of people working minimum wage jobs?\n\nAdditionally, regarding your argument of negating: it's nonsensical. I was rebutting the claim that money is not always proportional to the amount of work. All it takes is one case to negate an \"always\" claim.",
                      "id": 97,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "This must be written by a teenager. That's not how the real world works. \n\nHard work has a very low correlation with wealth. Shit, I work 25 hours a week and make over 100k. I bet 80% of people making minimum wage work harder and longer than me.",
              "id": 98,
              "comments": [
                {
                  "score": 3,
                  "content": "Yeah that poster completely ignored individual circumstance. In the US, upward mobility in financial class is only available to a small percentage of the population and the adept are fighting their way through that narrow gap. It's honestly probably easier to jump income brackets posting daily pics of your ass on Instagram than through college routes (not judging, just using it as an example that it's not always the most skilled that rise to the top.) The pool of legacy students at elite schools expands with each generation, pushing out merit based applicants.  My sister got a partial academic scholarship to Stanford. The girl is wicked smart and not saying that because I'm her sister. She was a cheerleader with homecoming the night before ACTs. She fell asleep during the math section, but I didn't want to try and wake her and get flagged for cheating (I was next to her.) She woke up at the buzzer the procter set for ten-fifteen minutes before time. She got a 36 on the math section... She didn't tell me about the Stanford scholarship until we were 20. It was her life dream to attend Stanford, but she didn't want to tell the family because she still couldn't afford to go.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Bill Gates never said that. It's astounding to me how people willingly ignore reality and accept this prosperity gospel crap that judges and punishes poor people and rewards rich people.",
              "id": 100,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "When I started out I was working the sterotypical 100+ hour weeks, but as I got my promotions the hours started coming down.  Only when I reached MD, was when I only had to work approx. 60 hour weeks.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "This must be written by a teenager. That's not how the real world works. \n\nHard work has a very low correlation with wealth. Shit, I work 25 hours a week and make over 100k. I bet 80% of people making minimum wage work harder and longer than me.",
              "id": 102,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -22,
          "content": "So? How dumb is your comment, honestly. You make 50k a year because they are enough people who can do the same work that you will be missed by your employer 50k worth. He makes millions because he is one of the few with the knowledge and ability to provide that service. He is tge asshole because there is a corporate greed problem?? Are you an asshole because some men abuse their partners? Oh no shame on this guy for achieving something and you being peanut butter and jealous.\n\nI am jealous of your salary, do I go off on you for being born in a richer country and possibly achieving more than me? Should I shame you for complaining about 50k when in my country that would put you in the top 10%? Goddamn dude, don't blame op for succeeding. Your corporate greed comment is utter nonsense.",
          "id": 103,
          "comments": [
            {
              "score": 10,
              "content": "I never blamed him.  I never claimed to be jealous. Why are you being like this??",
              "id": 104,
              "comments": [
                {
                  "score": 0,
                  "content": ">Corporate greed is a very real threat to the lower middle class. You should do a little research about what your former friend is upset about\n\nThis to me seemed like blame. I don't know why I got so passionate about this but I was very upset about your comment for some rason. I think I went too far and I apologise.",
                  "id": 105,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": -1,
                  "content": "Your comment at the end about how you also try and you earn 50k smacks of jealousy.",
                  "id": 106,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -8,
                  "content": "Because your comment was fucking stupid dude",
                  "id": 107,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Rude.",
                      "id": 108,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 45,
      "content": "ESH. You both took it too far .",
      "id": 109,
      "comments": [
        {
          "score": 29,
          "content": "It's trashy to talk about money. If my friend invited me onto HIS yacht, I'm going to assume he's a millionaire and not get weirdly jealous and tell him to go kill himself out of jealousy.",
          "id": 110,
          "comments": [
            {
              "score": 9,
              "content": "Yeah I dont get it \"friend bought a yacht. He prolly only makes 12k a year\"",
              "id": 111,
              "comments": [
                {
                  "score": 0,
                  "content": "friend bought a yacht. prolly ate ramen every day to save for it.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "True, I should've taken it and vented about it later.",
          "id": 113,
          "comments": [
            {
              "score": -6,
              "content": "dont be too hard on yourself though. You took 15 min of verbal abuse? I dont know if I could have done 5 without saying something.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 42,
      "content": "NTA \n\nYou're not the asshole for defending yourself.",
      "id": 115,
      "comments": [
        {
          "score": -27,
          "content": "What really pissed me off, is that my wife didn't defend me at all.  She just sort of sat there with her eyes wide open.",
          "id": 116,
          "comments": [
            {
              "score": 105,
              "content": "I wouldn’t have jumped into an argument between my husband and his longtime friend either.",
              "id": 117,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "I can see how from your perspective the fact that your wife didn't defend you must have made you feel very abandoned. You needed her support but she didn't provide it and so you had deal with the situation on your own, and that sucks. \n\nBut, if your account of how things happened is accurate then I don't think your wife getting involved would have necessarily helped. When more people join an argument then it tends to lead to more escalation and anger and things may have got even more out of hand than they already did. And so your need to feel defended and supported would directly contradict a broader goal of not wanting the situation to get too out of control - if your wife had got involved and it turned into a slappy catfight between her and Jordan's girlfriend or something, would that really have been a better outcome? \n\nThe key thing is that Jordan is the asshole here. His behaviour was the problem. You and your wife both responded differently to an emotionally overwhelming situation and both of you could have perhaps made better/different choices, but feeling angry/resentful towards each other is pointless when neither of you were the source of the problem. If you try and have a calm chat with each other at some point about what to do if a similar situation arises again, what you both need/want/expect from each other when things like that happen, and what you don't want to repeat from this time then that'll serve you well going forward. But the important thing is to keep blame out of that conversation, because the only person to blame is that asshole Jordan.",
              "id": 118,
              "comments": [
                {
                  "score": 5,
                  "content": "I think it's because she made a face when OP said he made $100K. \n\n\"From the look my wife gave me, Jordan caught on\"",
                  "id": 119,
                  "comments": [
                    {
                      "score": 11,
                      "content": "That's true, although OP said Jordan himself earns 150K pa so he would probably realise 100K isn't plausibly yacht-money, with or without a look from OP's wife.",
                      "id": 120,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Well, we can’t all control our facial expressions easily.",
                      "id": 121,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Then have her post an AITA and we can judge her point of view.",
              "id": 122,
              "comments": [
                {
                  "score": -11,
                  "content": "Ehh, she doesn't like reddit neither does she like posting online for some reason.   ¯\\\\\\_(ツ)\\_/¯",
                  "id": 123,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Too busy modeling in Canada, right?",
                      "id": 124,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -4,
                      "content": "I didn't think she would.",
                      "id": 125,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Everybody knows about fight or flight, but there is also the \"freeze\" reaction. In stressful situations, women are more likely than men to freeze.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Fight or flight, with heavy emphasis on the flight. Do you do this often? Your wife sounds like she was frozen in shock or disbelief, as were the rest of your friends. Both of you were extremely rude and extremely confrontational, completely trashing the societal norms for a supposedly friendly get together. The two of you are major assholes for subjecting everyone else to such a crass display of poor manners. ESH.",
              "id": 127,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "Fight or flight, with heavy emphasis on the flight. Do you do this often? Your wife sounds like she was frozen in shock or disbelief, as were the rest of your friends. Both of you were extremely rude and extremely confrontational, completely trashing the societal norms for a supposedly friendly get together. The two of you are major assholes for subjecting everyone else to such a crass display of poor manners. ESH.",
              "id": 128,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "Fight or flight, with heavy emphasis on the flight. Do you do this often? Your wife sounds like she was frozen in shock or disbelief, as were the rest of your friends. Both of you were extremely rude and extremely confrontational, completely trashing the societal norms for a supposedly friendly get together. The two of you are major assholes for subjecting everyone else to such a crass display of poor manners. ESH.",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "Fight or flight, with heavy emphasis on the flight. Do you do this often? Your wife sounds like she was frozen in shock or disbelief, as were the rest of your friends. Both of you were extremely rude and extremely confrontational, completely trashing the societal norms for a supposedly friendly get together. The two of you are major assholes for subjecting everyone else to such a crass display of poor manners. ESH.",
              "id": 130,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -2,
              "content": "I agree NTA but I am shocked that your wife didn't stand up for you as she is obviously benefiting from it so she should have been just as upset about it one for someone attacking her husband's character and secondly because what kind of guest goes on someone's boat, partakes of there hospitality and then essentially craps on them. This whole thing sounds like a setup they are on a freaking yacht and asking how much people make and that is something you don't generally do but they should of had an idea that you made more than them already as they were on your yacht. That is generally not a middle class boat unless it was old and had been restored by the owner.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 34,
      "content": "Yta for an obviously fake story.\n\nIgnoring the story is pretty shit, who in the world would claim a $100,000 salary while having friends over on their yacht, even 500,000 it would be pretty insane to splash out on a yacht, I love the classic \"using a throw away for obviously reasons\", that all the shitty stories use, when theres obviously no need to use a throwaway because the story is so unique anyone in real life would instantly recognise the fiction.",
      "id": 132,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 32,
      "content": "ESH - when I read the title I thought you were a kid. A 38yo man screaming at his friend and calling him a pansy ass cunt. What a classy act. I would be MORTIFIED if my husband acted that way. Plus, you could have easily refused to answer and changed the subject. But you didn't.\n\nYour friends suck too. Who the fuck sits around asking each other how much they make? You need to grow up and find new friends. This is just shameful.",
      "id": 133,
      "comments": [],
      "relation": "Attack"
    }
  ]
}