{
  "post content": "TL;DR Co-worker gets annoyed with a running joke I make.\n\nI (21NB) work as a cashier at a supermarket. My manager (27F) says Jesus Christ whenever she gets frustrated and after a few weeks of that I started responding with, \"Where!?\" I make a show of it, open my eyes really wide, look around quickly. She gets a kick out of it and it's sort of our thing now. I do the same with other co-workers and managers but my one co-worker (17F) got annoyed with it and I guess it's been building up for a while since she finally snapped at me the other day. She said, \"Stop doing that, that's so annoying.\" I responded with, \"OK, Sorry. I won't do it with you.\" She says, \"No. Stop doing it period. I can hear you every time you do it and it's super annoying.\" I backed away from her after that and only planned on not doing it with her but now that I've had time to think, maybe I should stop doing it all together. AITA?\n\nUpdate:I don't know how other people update their posts so I'm just gonna do it like this.\n\nSo the general vote was everyone sucks. I suck for repeating the joke and she sucks for being rude about it. I'll take others' advice and change it up a bit. Side note, the manager that I originated the joke with quit for medical purposes. Guess she really did get sick of the joke . . . In all seriousness, thank you for the feedback, and thank you for the advice. Seeing as the issue is resolved I probably won't be returning to this post.",
  "id": 1,
  "comments": [
    {
      "score": 1359,
      "content": "No judgement but stupid jokes get old pretty fast.\n\nEdit:  Adding judgement after all.  ESH.",
      "id": 2,
      "comments": [
        {
          "score": 60,
          "content": "Put in your vote so you'll get the top comment, which will give you more points!",
          "id": 3,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 53,
          "content": "Yeah it’s just cringe at this point.",
          "id": 4,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 47,
          "content": "Maybe for some people 😂🤭\n\nMy wife and I have some running jokes for a decade or so, and we are still amazed how they „never grow old“ 😂",
          "id": 5,
          "comments": [
            {
              "score": 129,
              "content": "The difference is this is between you and your life partner, who chose to be together. Between you and coworker number 5 it's different calculus.",
              "id": 6,
              "comments": [
                {
                  "score": 8,
                  "content": "Well number 5 doesn’t want the joke but now wanna dictate to never hear the joke again anywhere, and thats too controlling imo, if the rest of the team still find it funny.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 50,
                      "content": "The thing about employment is that it typically isn't a stand-up theater or a popularity contest. The goal is to work. The fact this seems to happen often and the joke is described as disruptive, loud, and potentially alienating to customers and coworkers alike makes me less inclined to find the person wanting him to knock it off in the wrong here.\n\nNot to say that work can't be fun, but it should endeavor to be a positive workplace over a funny one. She may be the only one saying something, and she is saying it rather rudely, but I doubt she is the only one thinking this way.\n\nMy vote is ESH, though as far as these threads go its a pretty low grade of asshole here.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 40,
          "content": "Yeah ESH. This has nothing to do with God/religion. Brush up on and refresh your material OP.\n\nGetting 2nd hand cringe just picturing this show on repeat.",
          "id": 9,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 30,
          "content": "I have a co-worker who makes dumb nonsense jokes all the time. The urge to whip your head around and throw a stapler at them is strong when it's the sixth time you hear that dumb childish joke in a day",
          "id": 10,
          "comments": [
            {
              "score": 8,
              "content": "Y’all should say something lol",
              "id": 11,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "\"Repeat until funny\" is the motto in my house.",
          "id": 12,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "See I did something like this at work once and EVERYONE was like “stop making that joke it’s dumb” but not everyone is upset here",
          "id": 13,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "No one here can appreciate a good bit",
          "id": 14,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "I don’t know, if I got to dictate what jokes my coworkers get to make in the building, a lot of them would have a lot less joy in their lives. It’s a supermarket. None of them want to be there. The coworker is 17. She needs to learn to live and let live. If this is annoying enough that the only solution is for this joke to never be made when she’s in the building, she’s going to have a really hard time when she has an actually annoying person as a coworker and has to learn that she doesn’t just get to put her foot down and tell them to stop doing everything they do because she doesn’t like it.",
          "id": 15,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "Eh, I would say that cussing at work also gets old pretty fast.",
          "id": 16,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 660,
      "content": "NAH, but honestly, I'd be going crazy if I had to hear the same joke every day as well. How annoying.",
      "id": 17,
      "comments": [
        {
          "score": 67,
          "content": "welcome to working at any place that deals with the public and you check them out . item didnt scan \" guess its free then huh?!\"",
          "id": 18,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 580,
      "content": "YTA I’m annoyed just reading this post. I can’t imagine having to hear this joke over and over again at work.",
      "id": 19,
      "comments": [
        {
          "score": 60,
          "content": "Where?????😱😱😱",
          "id": 20,
          "comments": [
            {
              "score": 27,
              "content": "Oh wow you're so quirky, not like other girls",
              "id": 21,
              "comments": [
                {
                  "score": 26,
                  "content": "Thank you.☺️ Sometimes I eat pasta and watch Netflix. Crazy, right? 🤪",
                  "id": 22,
                  "comments": [
                    {
                      "score": 6,
                      "content": "With a spork?",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Definitely",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -7,
                  "content": "Just want to point out OP is non-binary and should not be misgendered. I know that's not what you're doing but this is a good moment to point out OP is non-binary and non-binary people aren't boys or girls and shouldn't be referred to as he or she (they is preferred but some non binary people prefer \"it\").\n\nThis is extremely important and while it isn't obviously relevant to OP's story we should still have a conversation about this and be clear not to misgender them/it.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Huh? That wasn't directed for non-binary OP, it's for a different user 🤨",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Damn, you must be fun at parties",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Huh? That wasn't directed for non-binary OP, it's for a different user 🤨",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 0,
                      "content": "Dude, Op can deal with a few people missing that, and I'm sure they'd be fine with it for the joke.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "Cry about it",
              "id": 30,
              "comments": [
                {
                  "score": 0,
                  "content": "Why is Gamora? 🐻",
                  "id": 31,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "It's up there with an item not scanning and the customer goes \"guess it's free then!\"",
          "id": 32,
          "comments": [
            {
              "score": 4,
              "content": "“Savings? More like spendings!”",
              "id": 33,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 268,
      "content": "I mean, its funny the first few times, but it sounds like it would get kinda annoying pretty quick. I'd probably get annoed with it pretty quick... You're slightly YTA here. You don't need to stop, but really should just tone it down to only do when it is just you and the manager having your little in-joke.",
      "id": 34,
      "comments": [
        {
          "score": 17,
          "content": "Yep, slight YTA, but I was leaning toward N-A-H. It wasn't harming anyone up to this point, though it's not at all surprising the same joke told over and over would get old in a group setting. OP should be a little more self-aware of how his jokes affect others before needing to be told he's annoying people.\n\nMany class clown type people like myself may be able to relate to this: I myself have found that in general, running gags like this really only work when there is variety. This is exponentially more important when the joke is a public joke and not 1:1. Once it's the exact same joke every time, it gets old fast, and then has to be discontinued because yes, it becomes annoying. At that point the joke only works when it's 100% unexpected after having been dead for a long time.",
          "id": 35,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 161,
      "content": "YTA. Sure it's funny the first few times, but if you do it every time it loses the humor and DOES get annoying.  Throw it out once in awhile, where it's a surprise comedic comment, and it'll probably go over better.",
      "id": 36,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 149,
      "content": "YTA. Making the same joke repeatedly is beyond obnoxious. Get some new material.",
      "id": 37,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 112,
      "content": "YTA\n\nNo one likes hearing the same joke ad nauseam \n\nEven if it was funnier.",
      "id": 38,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 55,
      "content": "NTA borderline NAH.  I wouldn't call you an asshole, but yes, making the same joke over and over gets very annoying.",
      "id": 39,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 48,
      "content": "Yeah...you are 21 ....its funny first time but  quickly gets boring and then annoing ..lol",
      "id": 40,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 38,
      "content": "This isn't an AH situation but I would find it really annoying and unfunny after the first couple of times of hearing you say it.",
      "id": 41,
      "comments": [],
      "relation": "No"
    }
  ]
}