{
  "post content": "Last month while pregnant, I went to my  39 week checkup. The doctor had been concerned because the baby was not in the right position for birth. So I was told that they were going to do an \"external cephalic version\" (ECV), which is when the doctor uses her hands on the belly to cause pressure for the baby to move into the right position. While doing this, I was being monitored by their computer,  and the baby's heart was also being monitored.  It was very uncomfortable but I know the doctor was being safe. \n\nUltimately, it did not work, so they scheduled a c-section for the following week, but told me that if the baby had moved to the right position by then, they would induce me for a vaginal birth.\n\nThe day of the ECV, I told my extended family including my MIL. She is from Mexico and likes to do traditional home remedies and treatments for her ailments.  One of the traditions she has is visiting a \"sobadora\". Which is like a masseuse that claims to fix many problems using their herbal oils and chiropractic techniques. Well she suggested that I go to this woman to turn the baby, and that way I could avoid the c-section.\n\nI told her many times that day that I wouldn't trust someone to work on my belly without monitoring my baby's heart. I thought she understood that I was against this idea, but the following morning she knocked at my door and she had the sobadera lady with her.\n\nI tried to be nice to them and tried to explain how I wasn't comfortable letting her touch me, but they kept insisting.  It got to the point that i was so angry that I yelled at both of them to leave because the sobadera was not a doctor and she is not qualified to do any treatment on me. They left, but my MIL called me an ungrateful snob.\n\nThe following week my baby had still not moved, so I did end up getting a c-section. But my baby is healthy and I am grateful to the doctors who helped deliver her to me safely. \n\nBut now it's been a couple weeks since my argument with my MIL, and even though she loves on the baby, she is very short with me and she told me I should apologize for how rude I was to her. I don't want to apologize because I feel she was the one who was out of line. My husband was always supportive of my decision and was backing me up, but somehow,  my MIL still doesn't get that she was inappropriate in what she was asking me to do. My sister in laws both said that I should have given it a chance since it could have helped me avoid the c-section, and that I acted like a-hole to the sobadora my saying she wasn't a doctor.\n\nSo AITAH for the way I refused the traditional treatment?",
  "id": 1,
  "comments": [
    {
      "score": 4219,
      "content": "NTA\n\nYou had every right to say no. You said no politely enough times that you needed to use a more emphatic response. What else would they have wanted you to do to get rid of them \"more politely\" when they refused to leave? Politely and quietly call the police and request that they get physically dragged out and arrested?\n\nThere is a time and a place for traditional medicine. However, when there is such a significant possibility of harm to your unborn child that the doctor was monitoring the baby's heartbeat when he performed this procedure, there is no chance I would have allowed this unknown person to practice on me and my child in your situation. \n\nI assume your MIL meant well. However she is absolutely wrong. She refused to respect your boundaries, demanded that you allow her to risk harming you and your baby regardless of what you chose, and is throwing a rudeness tantrum because you defied her when you had every right and an obligation to do so. Her judgement is so far gone right now that I would not allow unsupervised contact with your child.\n\nI hope someone can explain this to her so that she understands.",
      "id": 2,
      "comments": [
        {
          "score": 1424,
          "content": "Agreed. And jumping in to add that “good intentions” are not a get out of jail free card.    \n\nYour MIL ignored you and your “no thank you” numerous times.  \n\nShe owes you an enormous apology and I would suggest that she is never alone with your child until she does. \n\nNTA",
          "id": 3,
          "comments": [
            {
              "score": 406,
              "content": "Yeah, she seems like a real liability around the child. NTA.",
              "id": 4,
              "comments": [
                {
                  "score": 259,
                  "content": "Usually I would role my eye's at this statement thinking poster just wanted to esculate the situation but this time, she may have a point. I don't think I would allow her to babysit. She may give something to the baby that you are not agreeable with.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 172,
                      "content": "Even if there isn’t a risk to the baby from MIL (which I think there’s potential for..), her attitude toward you needs to turn around. Your husband, OP, her son, needs to tell her to knock it off or she’ll risk not seeing her grandkid for a while.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 98,
                      "content": "This sounds like a MIL that would take the baby to get their ears pierced even if the parents didn’t want to.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 41,
                      "content": "Exactly. The fact that she’s into home remedies is enough reason to not have her babysitting.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Yes - don't have a link but am reminded of the terrible one where the MIL killed the baby by oiling its hair with coconut(?), baby had an allergy.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "She sounds like the type that doesn't believe in allergies",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Or, like in my case, not give the baby something. My traditional medicine MIL didn’t call when my four year old had a fever… instead she made him oregano tea and I found out he was sick hours later…",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "Seriously, adults can do all the complementary medicine they want, but no essential oils or herbs on OR in newborns and children.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Herbs and oils has to be a new sobadora thing, the lady i go to only uses lotion and maybe some vicks. There was one who used the ointment with the horse on it. \n\nI like sobadoras as much as the next mexican but not when pregnant. Too much can go wrong so quickly.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": ">Yeah, she seems like a real liability around the child\n\nMy first thought here was, \"So she tried to murder your baby and now somehow you have to apologise for not letting her?\"\n\nI wouldn't let this woman alone with the baby for 40 seconds while I run to pee, never mind let her babysit.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 141,
              "content": "I don’t care what your intentions are, do not bring a stranger to my home to try to manipulate my uterus",
              "id": 15,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 78,
              "content": "The road to hell is paved with good intentions.",
              "id": 16,
              "comments": [
                {
                  "score": 69,
                  "content": ">The road to hell is paved with good intentions.\n\nI have always loved Mercedes Lackey's expanded version of this proverb: \"The road to disaster is ordered by the righteous, planned by the well-meaning, and paved with their good intentions.\"",
                  "id": 17,
                  "comments": [
                    {
                      "score": 53,
                      "content": "Here in Germany we have this proverb: the opposite of “well” is “well-meant”.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Upvote for quoting 1 of my top 3 favorite authors.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Not only not alone w/child but NC by that side until an apology and recognize that you and your husband's boundaries are honored.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "And what even is the intention here? She'd rather a chance the baby might get hurt or die than risk her DIL not having a vaginal birth? A c-section didn't make the baby any less of a baby or the mother any less of a mother.",
              "id": 21,
              "comments": [
                {
                  "score": 2,
                  "content": "Yea, it really makes no sense.  The only thing I can imagine MIL thinking, i guess, is it didn’t work at the hospital, so let’s try this, but yea, why??  She obviously does not not have enough education to realize it’s the same thing only far more dangerous.  Its just selfish AF behavior at this point.",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I would have said she shouldn't be around the baby period until she apologises.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -9,
              "content": ">She owes you an enormous apology and I would suggest that she is never alone with your child until she does. \n\nFFS. What do you think is going to happen? MIL will put baby back into the womb and then bring in the sobadora to reposition her? Give me a break.",
              "id": 24,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 435,
          "content": "Herbal remedies are for minor things not big life threatening things.\nA sore throat? Tea with honey.\nCancer? Time for chemo/radiation.\n\nTrying to shift a breached baby without monitoring and the possibility to do an emergency c-section just screams for things to go wrong. That should only be done if there are no other choices. And only if the mother agrees.",
          "id": 25,
          "comments": [
            {
              "score": 148,
              "content": "Shifting a baby in the womb can cause bleeding in the placenta as well as a raised heart rate in the baby which  is why they monitor the baby during ECV. No way in hell would I allow some stranger to randomly do a home version unmonitored.\n\nEdit: wrong word",
              "id": 26,
              "comments": [
                {
                  "score": 70,
                  "content": "Also it could cause the umbilical cord to be wrapped around the baby / baby’s neck! This is why the monitor the baby’s heartbeat and do it in a medical environment so they have the option to perform an emergency caesarean if there are complications",
                  "id": 27,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Typically, ecv has a very small chance of causing a nuchal cord. That's generally a problem when there's extra amniotic fluid, causing more space. But still, yes, I agree with medical all the way for this.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "Even if all the potential dangers didn't exist (they very much do). What exactly do they think the doctor was trying to do? \n\noils - usually used in massage to help relax muscles. An ECV includes a muscle relaxer\n\nmasseuse, chiropractic techniques - physical manipulation to move the baby. *Thats what an ECV is*\n\nThey weren't just offering something unsafe, they weren't even offering anything that hadn't already been tried",
                  "id": 29,
                  "comments": [
                    {
                      "score": 15,
                      "content": "And even then - the OP said No. Whether the actions proposed by the MIL could be harmful or not, the bottom line is the pregnant person, OP, said no. That is enough. I don't care if MIL's feelings are hurt or OP didn't respect the MIL; the point is OP said No and that is the end of it. MIL could've wanted to pray over the baby and if OP said no then the answer is no.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I'm not an expert by all means, not a doctor, but is it possible it could also completely tear the placenta, too?",
                  "id": 31,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Yes that's why it gets bleeds and they monitor",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Hence, why these things are safely done at the hospital with real time ultrasound imaging To make sure this doesn’t happen!  So agree!",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 97,
              "content": "Especially if you’re planning to shift them in a way that’s a medical procedure. If we are talking doula style moving baby where it’s basically yoga and rocking to encourage baby to move then fair enough but this doesn’t sound like that",
              "id": 34,
              "comments": [
                {
                  "score": 127,
                  "content": "Even if it was gentle methods, and OP didn't want to, she was within her rights and doesn't deserve the boundary stomping.\n\nBTW my doula did successfully help my breech baby move into position with movement and positional rocking. Doulas and midwives are awesome!",
                  "id": 35,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Oh sorry to clarify I totally agree no means no. I meant MIL was an ass for suggesting it in the first place, if it was the doula yoga stuff then I’d think she wasn’t an asshole for suggesting it but then she doubled up when she didn’t respect the no.\n\nFTW I didn’t have a doula but did the yoga stuff for a back to back baby and then a breach and they birth turned successfully",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "I was breeched in utero so my mom’s OB told her to get on all fours and rock front to back. She said in a day or 2 I flipped. When I decided to do it again, she did her rocking and I flipped. This was in the early 80s. Sometimes doctors know helpful tricks too.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "The practitioner was going to do rebozo sifting. Which is the \"first sister of balance\" that Spinning Babies appropriated from parteras, and is practiced in L&D wards around the world. \n\nRegardless, mom said no",
                  "id": 38,
                  "comments": [
                    {
                      "score": 4,
                      "content": "“…practiced *in L&D wards*…”",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 78,
          "content": "It sounds like MIL didn't want to admit that she didn't have control over the situation",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "MIL showed up on OPs doorstep with someone prepared to manipulate her baby with absolutely no idea what she was going to do or how and no medical monitoring if something went wrong. No sane person would agree to that.",
          "id": 41,
          "comments": [
            {
              "score": 0,
              "content": "I wouldn’t be surprised if MIL hadn’t even told the sobadora that it was serious enough that the doctor was monitoring the baby’s heartbeat & played down the risk factor just to get her to come.\n\nSo the masseuse was probably being misled that this was just something preventative & completely unaware of the risk. Not only was she taking your health for granted I bet she was also setting up the sobadora for liability too. And if there was a language barrier she still may not have realized she was being played when OP started yelling at MIL.\n\nTrue, this is all speculation on my part but even if the sobradora isn’t a medical professional I think anyone with common sense would hesitate if they understood the actual risks & what had already been tried.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "The road to hell is paved with good intentions as they say and some people are too mired in tradition to see things any other way. There are also people who believe they are right and no matter evidence to the contrary will you ever be able to change their minds.  \n\nBased on the MIL reaction, calling the police was definitely a possibility if the yelling at them didn't work. Hard agree with not leaving her alone with the newborn whatsoever. That's just a recipe for disaster that I don't want to even think about.  \n\nOP NTA",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Also, to add. There are a number of essential/herbal oils that are unsafe for women during pregnancy that could cause preeclampsia, growth restrictions, fetal death and congenital disabilities.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "> What else would they have wanted you to do to get rid of them \"more politely\" when they refused to leave?\n\nThe real answer is that MIL didn’t want to provide a way to get rid of them, politely or not. She wanted her way, and was going to be mad no matter how politely she refused.",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "I 100% agree with this: NTA\n\nYour body, your boundaries, and your doctor's best advice were followed.  MIL may have meant well but she is in the wrong. I hope that there is a way for her to come around to peace with your decisions.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Hate to be that person, but even OP indicated the doctor was a woman. Weird of you to use male pronouns for the doctor, might want to check into that.",
          "id": 47,
          "comments": [
            {
              "score": 3,
              "content": "My bad. Normally I try to check when I am referring to someone whom  someone else has mentioned. \n\nI assume I was focusing on the appointment I have tomorrow, as my appointment happens to be with a male physician this time. If I was guessing about OP's situation, I would have assumed female as in my country, a majority of obstetricians are female. Now I am curious to see how it is in other countries. I shall google ...",
              "id": 48,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "> Politely and quietly call the police and request that they get physically dragged out and arrested?\n\nI love it! The visualization in my head of that is funny to me. Anyway, I also agree that I would not allow her to be around my child alone.",
          "id": 49,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1376,
      "content": "NTA  \n\n\nLOL excuse me what? I am Mexican and this is ridiculous. Sobadoras are **NOT** doctors and they are supposed to be very in sync with \"vibes\" so this lady trying to touch you against your will is not even a good Sobadora.  \n\n\nTell your Husband to stop this now and please be VERY careful because your MIL might try to take your daughter to the Sobadora which is extremely dangerous.",
      "id": 50,
      "comments": [
        {
          "score": 335,
          "content": "Yeah, don't leave babe unsupervised with MIL until she figures out that she fucked up.",
          "id": 51,
          "comments": [
            {
              "score": 73,
              "content": "Right!! She's the type to feed them with menudo or pozole at 3 months because the milk doesn't fill them.\n\nIt's a struggle to fight with outdated practices, because abuelitas knows better than doctors. 🙄",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "Uphill battle for poor OP for sure.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": "Correct me if I'm wrong, but I was under the impression sobadoras also didn't do chiropractic adjustments, but instead did massage, cupping, and pressure point work (along with the energy and herbal aspect). If this one also does chiropractic work, it's so much more dangerous too. Not only could the baby be hurt, but she could have been left with permanent injuries from \"adjustments\" too. In my experience chiropractors are so much more pushy and predatory than anyone else. My pregnant SIL went to what was supposed to be a nursing class, and instead it was a baby chiropractor trying to get people to sign up to bring their infants in for adjustments after they're born. I totally agree about OP needing to be very careful watching the baby. Though honestly if someone treated me like that, they wouldn't be seeing the baby or around me at all.",
          "id": 54,
          "comments": [
            {
              "score": 23,
              "content": "Well they do handle many types of issues but you are supposed to be willing to try, like if you have constipation they would do a pellejo.. which is literally pulling on your back to make it better although the pellejo also includes a tea which might or might not contain a laxative so who knows. Or they claim they know how to fix injuries involving bones.. \n\nWhat happened to your SIL is pretty scary! I hope she and her baby are doing well.",
              "id": 55,
              "comments": [
                {
                  "score": 7,
                  "content": "My parents took me to a sobadora once for \"empacho\" & all she did was push on a ball I had on my upper stomach which later turned out to be pancreatitis. She just made it swell up & hurt even more.\n\n Sobadoras are sketchy to me tbh. I also had a breeched baby & I couldn't imagine letting one of them touch me. OP is so nta.",
                  "id": 56,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "The claims about bone injuries sound sketchy. I imagine that is a thing where some are perfectly fine and others take it to an extreme as is unfortunately done with so much traditional medicine. Luckily for SIL, we have a lot of nurses in our family and my chronic pain experience with all kinds of doctors and homeopaths, so she always gets into from us first before trusting things. Her and the baby are healthy after needing a C-section like OP. I certainly mix western and traditional medicine, but man the ones who push and get there under false pretenses are scary and can be so good at it. Apparently the office they were at was super nice, so a lot of people were interested, and she had all these products she was trying to get people to buy too. They never learned nursing at all lol. My physical therapist is highly specialized and she sees a number of babies who were injured by people like that.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I’m sorry, what could an infant possibly need to be adjusted for? Would they adjust if the baby is gassy? Colicky? Constipated? I am all for holistic care and using complementary medicine when appropriate, but i can’t think of a single case where a reputable doctor would advise a new mother to have her infant or child adjusted. \n\nMy nephew was permanently injured during birth due to a very short period of compression in his spine. It wasn’t diagnosed until he failed to thrive and stopped hitting his milestones. It was catastrophic to his development and he never recovered. He is 20 years old and cannot speak, feed himself, walk, recognize anyone (including his parents) and will live in a home for life because his parents are too frail to carry him and care for him any longer. This happened at a reputable hospital with full medical supervision. I can’t imagine what might happen in a private office where they make you sign a waiver of liability before they see you.\n\nIn the US, where I am from, the study of chiropractic medicine is much less rigorous than medical school, and is on the level of quackery in many ways. I can’t speak to the level of education or skill needed to be recognized in other countries, but I wouldn’t let any of my family be seen by one here, let alone a helpless infant.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1022,
      "content": "NTA.\n\nYou MIL doesn't seem to understand the concept of **consent**. You could not have been more clear about the home remedy, and the way your MIL tried to bully you was crazy aggressive.\n\nThis is a warning sign for the future. I have a hunch that if she disagrees with you with anything about how you raise your family, she will just step in and do what she thinks is right. Take your kids to her special healers. Baptize them in her own religion. Whatever. \n\nYou will need a **master class in boundary management**.",
      "id": 59,
      "comments": [
        {
          "score": 4,
          "content": "I agree. Whether or not the person she offered could have helped successfully or not is beside the point. When making medical decisions for your own body you don’t need to give ANY reason for declining someone’s suggestion! \n\nOP was NTA and did what she wanted to do with her own body. Everyone should have the right to do this.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 473,
      "content": "NTA\n\n26 years ago my daughter was in the frank breech position.  My doctor also attempted a version which was unsuccessful.  C-section was the only way to go.  The c-section revealed that my daughters umbilical was short, very short, like roughly 6 inches long according to the doctor.  Had the version been successful it would have torn the umbilical cord and likely killed my daughter.  And that doctor's office was attached to the hospital and the OR was just down a  hallway from the office.",
      "id": 61,
      "comments": [
        {
          "score": 159,
          "content": "I had this same experience a few months ago. Absolutely terrifying. My daughter’s cord was the shortest my OB had ever seen and was wrapped tight around her neck. Her version worked but she flipped back. Babies know what they’re supposed to do. If they’re breech, there’s likely a reason.",
          "id": 62,
          "comments": [
            {
              "score": 81,
              "content": "I’m so glad you and your baby are ok. But saying “babies know what they’re supposed to do” is just wrong. Not only is it inaccurate, it’s at best ignoring all the babies that end up being seriously injured or die in utero due to doctors not catching issues or, at worst, suggesting that the babies who died did so because they were too dumb or inept to “know what they’re supposed to do”. I mean, saying “babies know what to do” seems to just ignore the plethora of things that can go wrong. \n\nBiology is messy and before humans became advanced enough to know even rudimentary medicine, lots of babies and mothers died because pregnancy and child birth is dangerous.",
              "id": 63,
              "comments": [
                {
                  "score": 24,
                  "content": "You’re so right. Thank you for this reminder u/hmartin430",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "Yes. Mine wasn't breech but the doc could tell that his head hadn't dropped into the correct position. They did an exam (can't remember what it was now, it's been 19 years) but they could clearly see that his head was too big and my pelvic opening too narrow, so much so that attempting a vaginal birth could have been life threatening for both of us. Had a c-section the following Monday.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Sometimes the reason is just that they can flip though. My daughter was always in the right position until the day I went in for an induction. They tried to flip her but it was only partially successful. Decided to give it a couple days and went home and did a bunch of inversions and she flipped back the right way so I was able to avoid a C-section.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 102,
          "content": "Yeah, I think some people don’t realize that babies who are breech are often in that position for a reason. My cousin’s baby was breech and the doctor unsuccessfully attempted a version. A day later she stopped feeling the baby move, and they couldn’t find a heartbeat. She had to give birth to her stillborn son in an excruciating 40 hour delivery where he was found to have the cord wrapped multiple times around his neck. My cousin has never seemed to connect the stillbirth to the version, but I can’t help but think they’re related. Her son would’ve turned 5 yesterday.",
          "id": 67,
          "comments": [
            {
              "score": -76,
              "content": "That's just some patriarchal BS scaremongering to make the obstetricians look like heroes. Combined with historical/fantasy TV shows showing breech babies getting stuck and the mother also dying. 99% of breech babies, without medical intervention would be born with no issue. C section is not the only option.",
              "id": 68,
              "comments": [
                {
                  "score": 40,
                  "content": "Eh. TV shows overestimate the danger, but I feel you're underestimating the danger. A very quick look at recent studies indicates breech birth does significantly increase the risk of death or disability. You're right though that c-section is not the only option and may not even meaningfully change the outcome.",
                  "id": 69,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "Where did I say anything about any of what you said? An ECV is an intervention, and I thought I made it pretty clear that I didn’t think it was the right decision. The baby also died after the intervention, so I’m not sure how I’m making the OB look like a hero. I never made any judgment about a vaginal birth vs a CS. \n\nBut also, it’s ridiculous to throw out a specific percentage like that without referencing the study where it came from because otherwise it’s pretty clear there is no study and you are making a baseless claim rooted in your personal opinion. I don’t know how you or anyone could make a claim about how breech babies would have done under a different type of birth. That’s entirely speculative, has no real scientific basis, and ignores the fact that breech vaginal births do at least require assistance by someone, and how smoothly the birth goes can be highly dependent on how much knowledge, training, and experience that person has.",
                  "id": 70,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "This story should be higher. \n\nI’m wondering if folks are unwilling to blatantly state how absolutely stupid and dangerous it is for a sobadora to manipulate a breech baby in utero . \n\nAbsolutely not. Now if one is in a village in Mexico with no doctors or hospitals, I’m not gonna judge, but as the above terrifying account from u/MormorTrine clearly demonstrates, this is not a technique to be attempted without extreme care and under very specific medical conditions. \n\nOP: NTA. \n\nIn cases like these respect by submission to cultural practices is not warranted, you mama did well. Let’s hope MIL can move on soon. Congratulations on your new addition! ( autocorrect said “adventure”- haha! ) 🙏🏾💕",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "> The c-section revealed that my daughters umbilical was short.\n\n\nI was born from an emergency c-section. I'm my mom's first child (she lacked experience in knowing how the birth should be like) and doctors treatment my mom horribly saying it was not time to start pushing. She kept saying the left side of her body felt numb. Doctors and nurses kept ignoring her.The result? My mom had a heart attack and they had to deal with both the heart issue and me being born. I didn't cry. No one told my mom what had happened to the baby. My godmother had to chase doctors around the hospital to find out what had happened. My mom only got to see me 9 hours after my birth and I was \"all covered in bruises\". Not actual bruises. There was an issue with the umbilical cord, it was too short and I nearly died. So did my mom. The c-section saved both our lives.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "The risks are exactly why I declined having the ECV done. The fact it is only done in a controlled OR setting tells me the risks are not negligible.",
          "id": 73,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 278,
      "content": "NTA. At all.  In any form. \n\nYou declined to go to the sobadora politely. Your MIL crossed the line by bringing the woman to your home and demanding you see her.  That late in your pregnancy with the complications on your mind....they were all lucky you were as polite as you were, even when you were demanding THEY leave YOUR home. \n\nAlso NTA for pointing out that a sobadora is not a doctor. They're not doctors.  Thats a fact.",
      "id": 74,
      "comments": [
        {
          "score": 14,
          "content": "Yeah, my doc had to attempt a version as well. She wouldn't do it until we were in the OR just in case. Also they hurt so fucking bad.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 196,
      "content": "NTA ---- Ask your MIL if she'd let a car mechanic perform open heart surgery on her.",
      "id": 76,
      "comments": [
        {
          "score": 115,
          "content": "\"Valves are Valves aren't they? I've changed all 16 Valves in a Chevrolet, you've only got four!\"",
          "id": 77,
          "comments": [
            {
              "score": 34,
              "content": "Ok but what happens when you need a 14-inch wrench and you only have an 18-inch??",
              "id": 78,
              "comments": [
                {
                  "score": 22,
                  "content": "Just stick a bit of gum on there to make up the difference!",
                  "id": 79,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Bailing wire, duct tape, and beer cans. It was good enough for Dad!  lol",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 172,
      "content": "Babies can die when you attempt to turn them. They had to turn my youngest and I could tell the doctor was a little nervous. I had several electrodes on my stomach that monitored the heartbeat, a nurse was doing a sonogram while the doctor turned the baby and I also got a massive dose of Terbutaline to make my uterus relax. It's not something amateurs should be doing.",
      "id": 81,
      "comments": [
        {
          "score": 53,
          "content": "My sister had an ECV with my niece. There's a reason they do them in the OR. They nearly had to do an emergency c-section and deliver my niece right then and there because sis's blood pressure shot up and baby's heart rate decreased. Luckily, they leveled off, but it was close there.",
          "id": 82,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 109,
      "content": "NTA. \n\nYou aren't the asshole for not allowing a non trained non medical \"massuse\" harm your child. She could have caused a miscarriage or still birth. She could have harmed you physically or harmed the baby. If a doctor wasn't able to get your baby to \"move\" then some quack wasn't going to be able to do it at all none the less in a SAFE manor where she didn't injure the baby or get the cord wrapped around it's neck by moving it the wrong way.",
      "id": 83,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 94,
      "content": "NTA. Think about denying access to your baby until MIL apologizes for ignoring your autonomy.",
      "id": 84,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 91,
      "content": ">One of the traditions she has is visiting a \"sobadora\". Which is like a masseuse that claims to fix many problems using their herbal oils and chiropractic techniques.\n\nWhat idiotic bullshit. Good on not doing that.\n\n&#x200B;\n\n>the following morning she knocked at my door and she had the sobadera lady with her.\n\n\\+\n\n>she told me I should apologize for how rude I was to her.\n\nOh, fuck that noise. MIL is a bossy asshole. That doing what she wanted rather than trusting an actual doctor is worse, since you would have endangered your child if you listened to it.\n\n&#x200B;\n\nNTA",
      "id": 85,
      "comments": [
        {
          "score": 20,
          "content": "And you just know if something went wrong, it'd be, \"It's your fault, you should have just said no.\" Honestly.",
          "id": 86,
          "comments": [
            {
              "score": 8,
              "content": "\"I didn't mean for this to happen! I had good intentions!\" And you used them to try to force a quack onto your DIL. Be better. Can't believe these types of people",
              "id": 87,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}