{
  "post content": "Last Wednesday 9/22 I asked a coworker if she wanted to go to our local amusement park, they had decorated the park for the Halloween season and I thought it might be a good idea to ask her if she wanted to go, we usually talk for while when I’m getting off and she’s just getting in so I thought she might like me, when I first asked, I specifically asked “are you doing anything next Saturday and want to go out to the amusement parking and get dinner?” She instantly lit up and and said yes, that she had nothing going on and that sounded like fun, and she would be down to go, I said cool I’ll hit you up later in the week about it.\n \nI text her that same Friday 9/24 about our plans, no response, was left on delivered, but she can still post on her Snapchat the whole weekend, first red flag 🚩. Then Monday rolls around, and she sees me at work and didn’t even try to talk about our plans, so I hit up a mutual coworker and asked her if she was mad at me, all she said was no, she just gets busy, which is understandable but our job we are constantly on our phones, no reason she can’t get back to me super fast, I’m able too. \n\nSo Monday after work she finally hits me back up apologizing for the lack of response, still says she’s down to go, i said cool me too, Thursday rolls around and she texts me what she should bring and what time we should meet on Saturday, I told her to meet me at 4pm and bring a jacket and maybe some snacks if she wanted and we would get food after, she said that was ok. \n\nSaturday morning when I’m at work she texts me this big paragraph that basically says she doesn’t want to go if her 3 sisters can’t go, her parents were forcing her to take them even though she’s 24 years old but we could go off and do our own thing once we got inside, I asked her if she could go with them another time, I wanted it to be just us, and she said if they can’t go she won’t go. So I said that was ok, her mom had already bought their tickets a while ago and “this was the perfect time to use them”🙄. \n\nI get there at 4pm, like we had talked about 3 times at this point, and text her saying I was there, and asked if they were close, a few minutes later I get a text saying they were running late and would be there around 4:40, I said cool I’ll just go get a beer and hangout and wait, 4:40 rolls around so I make my way back to the front gate and wait, nothing till about 5 saying they just left, hour late at this point, so I continue to wait, we live in the same area and it’s only 20 minutes away, 6 pm rolls around and I’m getting irritated, she finally calls me and says that they were there and asked if I could come out and give her her ticket, I told her that she said her mom had bought their tickets so I had just bought mine. She gets irritated and goes and buys her own ticket, I’m inside waiting for her and I see one of her sisters that also works with us, they come over and and immediately start ignoring me, didn’t get introduced to the other two that I’ve never met before second red flag 🚩. \n\nAt this point we’re still waiting for the girl I actually tried to go with, she finally gets through the gates (over two hours late) and comes over towards us, walks directly past me without saying anything or even looking at me, third red flag 🚩 and I want to go home and we haven’t  even been on any rides yet. While we were in line for the rides, no one spoke to me, I had some exciting news and when I told them they didn’t even care. I felt like a Fifth wheel all night and it was my ideas in the first place. After about 3 rides the 4 girls wanted to get food, so we were walking to the food court and I asked her if she wanted to split from her sisters after we got some food and do our own thing, like she said in her text we would, she said no, her mom told her not to leave her sisters, who were between 17-20 and had their own cellphones. So I told her how I felt, I said I thought this was gonna be more of a date, that’s why I invited you to an amusement park, usually when a guy wants to do something big like that, it’s usually a date, I said it was my idea to come today and I’ve been treated like a 5th wheel all night, she then proceeds to say that it’s just how her family is, her dad said if she left without them to not come back and if she would have known it was a date she would have said no, she’s not interested dating right now because of an ex she had over 2 years ago, like I understand guys suck, but I’ve been through some shit in the last year I’m trying to get past, my ex was pregnant with twins and they were stillborn, I wasn’t interested in dating for a long time but I hate being lonely so this was me trying to get back out there. \n\nEnded up leaving at 8pm because I wasn’t gonna keep getting treated like a 5th wheel. \n\nAITA? \n\nTLDR; asked a coworker on a date to an amusement park, she brought her three sister, I got treated like a 5th wheel and told her how I felt and left early.\n\n\nEdit: formatting",
  "id": 1,
  "comments": [
    {
      "score": 83,
      "content": "I can't read that never ending wall of text without paragraphs. I got maybe to the middle?\n\nShe's not that into you and you're in the wrong thinking it was a date. Us women get trashed for assuming every guy wants to date us, we get trashed for refusing guys \"without giving them a chance\" and then we get trashed for \"leading them on if we're not interested\", so there's no way for us to win.\n\nIf you want to ask a coworker on a date, say it's a date. If you make it sound like a casual walk, it's possible she will misunderstand or treat it like non-date because you never specified it was a date. We're not mind readers and guys hate on us when we overthink, so make your intentions clear and act accordingly.\n\nSay it's a date, she says yes, treats you like a fifth wheel - never go out with her again, it's done. She says no, at least you know she doesn't want to date you at all.\n\nESH",
      "id": 2,
      "comments": [
        {
          "score": 1,
          "content": "How are you top comment? Like you're clueless and didn't even read the full post. Op isn't TA you are.",
          "id": 3,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 58,
      "content": "ESH.  She sucks for being super late and bringing family along uninvited to an event organized by someone else.\n\nYou stuck for not being clear in your intentions. If you want a date, ask her on a date. Asking to \"hang out\" is wishy washy and can be interpreted very broadly.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 45,
      "content": "YTA. You didn't ask her on a date. You asked her to meet you somewhere for a day out. Guys and girls can do that as friends as well as couples on dates. You were the one putting your expectations onto her and the situation without ever bothering to get her take on it. Maybe she'd been having a really crappy time and was just looking forward to a day out where she could feel safe.\n\nYou're talking about all her red flags, but they're not quite as big and bright as the ones you're waving here. This honestly makes you sound like a little bit of an incel.  Next time you want to ask someone on a date, make sure they know what you're asking and accept it if they say no. Yeah it sucks she brought her sisters but then I've been met by friends and their siblings for days out, because parents then don't have to worry about any jealousy, everyone is out of the house for the day, and parents get a bit of peace.\n\nSeriously dude. She didn't owe you a date here. You owed her some respect for her position and situation.",
      "id": 5,
      "comments": [
        {
          "score": 5,
          "content": "He asked her out, not only to the amusement park (which sort of could just be considered \"hanging\") But out to dinner afterwards. Sounds like a date to me.",
          "id": 6,
          "comments": [
            {
              "score": 25,
              "content": "Huh?  I have work friends I have dinner with all the time and it has NEVER been a date.",
              "id": 7,
              "comments": [
                {
                  "score": 2,
                  "content": "After spending the entire day at an amusement park? This was a multiple event day.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 15,
                      "content": "So...what does multiple event have to do with it?  We also go golfing or to Top Golf.  We go to Dave and Busters and then to dinner.  We've gone apple picking, to a local museum and to a zip line park. \n\nMultiple events does not a date make.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "I mean, okay. Sure... didn't realise going out to dinner with a friend makes it a date. If that's the case I've been on a LOT more dates than I realised. It's not a date if the other person isn't aware of it. When she explained about bringing her sisters he could've just said \"ahh, I thought this was a date, no worries we can arrange something together alone another time and just have fun today\". He had so many options to clue her in that it was a date he was expecting. When he did ask her he then got annoyed that she wasn't in a position to date. We don't know what her home circumstances are and she was clearly just excited about a day out doing something fun with a friend. OP is TA here and needs to work on his communication.",
              "id": 10,
              "comments": [
                {
                  "score": -7,
                  "content": "My exact text back to her when she said her sisters had to come was “Oh…. I was kinda hoping it would be just us, not to be rude, but do you think you could go with them some other time?” \n\nI did try. I was just going with the flow because she also said once we got inside we could split up and go our own ways. After 3 rides they wanted to get food, so when we were in line, and I had the chance to talk to her I asked if she wanted to split up from her sisters and she said no, that’s when I brought up I thought i was going to be a date.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 15,
                      "content": "The problem here is, you still didn't bring up the date aspect until the very end. When you said you'd thought it would be just you two, that still doesn't make it a date. Instead you just sound like someone annoyed that you'd have to include your friend's siblings. You need to take a long hard look at your attitude towards women and your expectations of them, because whilst that may have been the given behaviour when women weren't allowed to work and vote and all that stuff... it's sure not the case now in 2021.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "That still doesn’t make it clear you wanted a date. If you want someone to know you’re asking them out you have to be explicit. Friends and coworkers grab dinner all the time.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "If a coworker asks me to go to dinner I would absolutely NOT think it was a date. They would have to be pretty damn explicit for me to think a coworker was asking me out. \n\nOP - things don’t go your way sometimes. Sometimes people don’t want to date you. Move on and don’t be a jerk about it.",
              "id": 14,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -10,
          "content": "And what red flags am I waving?",
          "id": 15,
          "comments": [
            {
              "score": 24,
              "content": "The assumption that it was a date and not specifying that it was a date. THEN  complaining that she could not read your mind in thinking it was a date.",
              "id": 16,
              "comments": [
                {
                  "score": -51,
                  "content": "If I was a single girl and a single guy was to ask me if I wanted to go to an amusement park and get dinner, I would assume it’s a date, if I just wanted to hangout with her, I would have suggested hiking, or maybe taking my dads boat out. You should really use context clues 😊",
                  "id": 17,
                  "comments": [
                    {
                      "score": 48,
                      "content": "Why on earth would someone think the amusement park is a date but taking your dad's boat out is platonic?? \nContext cues need to be logical, this isn't.",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 20,
                      "content": "You do not know what assumption means 🙃",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "I get what you’re saying, a guy at work asked if I wanted to go to the fair, and I specifically am not going with him unless it’s in a group, (not a date)\n\nSo I’m just going alone next week,  lol",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Thats just what you assume girls are like, not what they are all like ( stop making generalizations based on gender ). You don't know this because you are, in fact, not a girl and I highly doubt you have communicated with girls on a personal level deep enough to understand the way they view things.\n______\nYou never asked her on a date, just to hang out. Its your own fault in this situation because you failed to communicate properly.\n_______\nYTA",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "It's honestly a little amazing you can't see the red flags. You're a walking red flag. If in your messed up world going on a date vs going to hang out depends on the money being spent on the occasion then someone reaaaal badly fucked you up along the way. What you're saying here is \"oh I don't value friendships enough to put real money into their quality time, if they want to do the expensive things then they'd better date me\". You didn't ask or clarify with her you just assumed it and then got shitty that she wasn't on the same page. She didn't owe you a date. You need to reevaluate your approach to life man.",
              "id": 22,
              "comments": [
                {
                  "score": -6,
                  "content": "If my best friends were to ask me if I wanted to go to an amusement park, go skydiving, or even underwater basket weaving and didn’t have the money to pay for it of course I would pay for them, guys and girls. But if I am “dating” someone and I spent money on a museum or concert or movie tickets, that’s a date. If we were to just be at my place, playing with my cats or in the hot tub, that’s a hangout. There’s a difference.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I can't even reply to this because arguing with stupidity is futile. You're TA if you think paying for a girl makes it a date without actually confirming that aspect with her, and is the exact reason I refuse to let guys pay for anything on dates - the sense of entitlement that goes with paying for me is absolutely not worth it. Pay or don't pay, but next time at least clue the girl in up front by using explicit wording not ridiculous money based logic.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "Are you for real? What an entitled mentality. Men and women can be friends. People also don’t typically expect to be asked out on a date by a coworker. If a coworker asked me to hang out I would NOT think it was a date.\n\nPeople aren’t mind readers. If you want to ask someone on a date, make it clear. Don’t get pissy that they didn’t read your mind.",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 29,
      "content": "[deleted]",
      "id": 26,
      "comments": [
        {
          "score": -3,
          "content": "ROFL in no circumstance have I ever heard anyone say the words, \"would you like to go on a date with me\".  Most commonly, \"Would you like to go to dinner\" or \"Would you like go to the movies Friday.\"",
          "id": 27,
          "comments": [
            {
              "score": 13,
              "content": "It's a shame you're not in a circle of people who practice \"enthusiastic consent.\"",
              "id": 28,
              "comments": [
                {
                  "score": -2,
                  "content": "[deleted]",
                  "id": 29,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Except “Cool, it’s a date then” doesn’t confirm it’s a date-date. In fact, the phrase is used more frequently as confirmation for other get-togethers, from work meetings to group hangouts. https://www.dictionary.cambridge.org/us/amp/english/it-s-a-date There are lots of less ambiguous ways to clarify that a romantic date is a romantic date.",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -3,
              "content": "EXACTLY!!!! I’ve never asked a girl specifically on a date, always, movies and dinner, amusement park and dinner, stuff like that.  My exact wording to her was, “are you busy next Saturday and want to go to the amusement park and get dinner? They decorated for Halloween and I think it would be fun if we went.” She immediately lit up and said yes she had nothing going on and would be down to go.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 21,
      "content": "YTA - She had red flags, but you are a red flag.\n\nClearly she had a lot going on but still tried to make it work to hang out with you. She warned you her sisters would be there. And this was only a date in your head. An actual friend would have understood that sometimes family comes up and makes things weird or challenging for a day. But you are not her friend. Just a confusing failed romantic pursuer",
      "id": 32,
      "comments": [
        {
          "score": 7,
          "content": "Her family already had bought tickets previously and didn’t know when to go, and when I ask her to go it’s all of a sudden the perfect time to go? That’s fucked. Why put me in that position?",
          "id": 33,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11,
      "content": "ESH\n1) you should’ve been a little more clear that you wanted it to be a date and not just hanging out. sometimes people just wanna be friends/friendly\n2) she shouldnt have ignored you the whole time or she should have tried to reschedule\n3) she isnt obligated to go on a date with you. you seem mad she isn’t ready/willing to date you, and that’s a big red flag\n4) idk whats wrong with her parents but its clear they have a lot more going on with her that you aren’t aware of",
      "id": 34,
      "comments": [
        {
          "score": 0,
          "content": "I’m not mad that she isn’t ready to date again after her ex, I don’t blame her, everyone needs time to heal. \n\nShe seemed very excited when Initially asked her to go, almost like she had been waiting for me to ask her out.  that’s why I thought it was a date. \n\nOf course she’s not Obligated to do anything with me, we’re coworkers, should could have just said no, she did it before when I asked her to some over, smoke and play with my cats. Im just persistent, and no I don’t bug her to do something every week.",
          "id": 35,
          "comments": [
            {
              "score": 10,
              "content": "Whoa, why do you think she's not ready to date _at all_? \n\nThat's another example of red flag, incel behavior--the idea that she's rejecting you because she's not ready to date at all, vs, her simply not wanting to date you.",
              "id": 36,
              "comments": [
                {
                  "score": 3,
                  "content": "She told me she wasn’t ready to date…. I said it in the original post….definitely not a incel.",
                  "id": 37,
                  "comments": [
                    {
                      "score": -2,
                      "content": "Not saying you are an incel, saying that the behavior (as I understood it) from your comment came across as incel type behavior/language. \n\nI completely missed in the wall o'text post that she said as much re: dating.",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9,
      "content": "NTA\n\nSounds like a date to me - until you agreed to go with her whole family. Should’ve pulled the ripcord right then and there. From there she shows you that she’s incredibly rude and narcissistic.",
      "id": 39,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "Your timeline makes no sense. Sounds like you went on Oct.2 but 2 weeks of talking about it started Sept 29??\n\nYTA just for that and the wall of text. And for trying too hard too be chill when this girl gave you plenty of signals she did not want to date.",
      "id": 40,
      "comments": [
        {
          "score": 3,
          "content": "Typo, 9/22",
          "id": 41,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "NTA but very poor communication all around, she’s the AH for being so late and ignoring you but not for it not being a date",
      "id": 42,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NTA, even if it wasn't a date & just hanging out she was an AH. Going to do something WITH someone implies doing something together, not hanging out with her sisters & everyone ignoring you. However, you chose poorly to keep trying after it was clear she didn't even care to be around you at all.",
      "id": 43,
      "comments": [],
      "relation": "Support"
    }
  ]
}