{
  "post content": "This happened yesterday.\n\nMy husband and I went to the gym, worked out and then opted to take a sauna together. The sauna is about 8 ft x 10 ft and was already occupied by two other couples. They were engaged in a very loud conversation when we entered, so we just laid down our towels, sat down and minded our own business. \n\nProblem is, the conversation just kept going and one woman in particular was so loud. Any time there would be a lull in the conversation, I would hope it would end, but the one especially loud woman would start it back up again, starting every sentence with an extra loud “SO!” It wasn’t just the volume that was obnoxious, but the content of their conversation was a lot about how old they are and being old sucks (I know they were 22-27 in age because they said it multiple times, my husband and I are 50, for reference.) and how much they can’t wait to move out of our city. \n\nI kept my eyes closed trying to ignore them, but at one point I leaned over, whispered in my husband’s ear that I wish they would shut the fuck up. I’ve never had an interaction with a stranger where I asked them to be quiet that has gone well, so I kept on ignoring them. \n\nUnbeknownst to me, my husband decided to take matters into his own hands and stare at them with a shocked/disgusted face. I opened my eyes when I heard the loud one say, “you could just ask us to be quiet instead of being passive aggressive about it!” It devolved pretty quickly after that. I know she said she could be as loud as she wanted because it’s always like that in the sauna (not true.) She also made the “we were here first!” argument. Finally, the loud one’s girlfriend got up, stormed out, slammed the door so hard it bounced back open, and started yelling, “I’m going to ask about the RULES!” I imagine she found out that the rules are to keep your voice down and be respectful of others because she didn’t come back and the manager was really nice to us as we left. \n\nSO! Are we the assholes for wanting the sauna to be quiet-ish and my husband staring at the loud people and me jumping into the fight or are they the assholes for not following the rules and not reading the room?",
  "id": 1,
  "comments": [
    {
      "score": 285,
      "content": "ESH. You and your husband for talking about them passive-aggressively for having a conversation in a public sauna. They obviously heard you talk about them. And them for talking loudly in the first place in a small enclosed space, and being dramatic about it slamming the door.\n\nThey should have been more considerate of other people in a shared space. Doesn't matter who was there first. And you can't control other people, so if you're so bothered by their loudness, either politely ask them to quiet down, or leave.",
      "id": 2,
      "comments": [
        {
          "score": 128,
          "content": "The \"read the room\" comment is quite laughable too. YOU entered the room, read the fact that it was loud, and stayed, and yet want them to read the room? They did read the room, it was loud and chatty with two people not participating. \n\nJust because OP wants it a certain way doesn't mean that's the RIGHT way, and definitely not the only way.",
          "id": 3,
          "comments": [
            {
              "score": 74,
              "content": "True but at the same time if you’re using a public space, expect to have to lower your voice out of respect sometimes",
              "id": 4,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "But sauna etiquette is that it's quiet, that's the right way",
              "id": 5,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 153,
      "content": "ESH, them for being loud. And you guys for not being adults, just fucking ask them to quiet down. The manger could have been really nice to them leaving to. Telling your husband  “I wish they’d just shut the fuck up” within earshot of said members is not respectful at all.\n\n And the whole reading the room? The whole rroom was talking together until you arrived. You didn’t like the read of the room and wanted it changed to your liking, honestly the more I take this apart I lean more towards Y T A",
      "id": 6,
      "comments": [
        {
          "score": -98,
          "content": "I whispered it in his ear, there was no way they could have heard me.",
          "id": 7,
          "comments": [
            {
              "score": 112,
              "content": "It's a tiny, heavily insulated room. They heard you.\n\nAnd even IF they didn't- you clearly whispered something nasty to your husband who immediately started screwing his face up and eye fucking them constantly right after. \nTrust me, they know exactly what you were on about right there.",
              "id": 8,
              "comments": [
                {
                  "score": 42,
                  "content": "Totally, and whispered or not. Trying to paint themselves as the respectable people in the situation is laughable.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Right? Everyone was happy and enjoying their time till the wet blankets came rolling in with their staring problems. \nImagine being pressed about a few minutes in a fucking sauna that aren't exactly the way you want.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": " I am also in my 50s.  I feel like my 20 something year old kids can hear a falcon on a cloudy day.  They could hear you.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 5,
                      "content": "r/UnexpectedPrincessBride",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "People can talk in the sauna. Get over yourself.",
              "id": 13,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 72,
      "content": "[deleted]",
      "id": 14,
      "comments": [
        {
          "score": 14,
          "content": "Thank you for inadvertently explaining what ESH is to me, I see it a lot in this sub and assumed it meant something along the lines or equally shared asshole, but didn't want to ask 😂",
          "id": 15,
          "comments": [
            {
              "score": 7,
              "content": "I still always read it as \"equal shit heads\"",
              "id": 16,
              "comments": [
                {
                  "score": 1,
                  "content": "That works too!",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 55,
      "content": "ESH except you. Your husband full on staring at someone in a sauna is honestly super weird. The other people there were insufferable - sauna is obviously meant to be quiet/relaxing.",
      "id": 18,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 25,
      "content": "Yta.  It's a public gym and a public sauna.  You have no business telling people to be quiet.",
      "id": 19,
      "comments": [
        {
          "score": 35,
          "content": "Aren’t public saunas usually quite spaces? I don’t remember visiting a sauna which wasn’t a quite place and I visit public saunas a lot. The fact that they didn’t come back after contacting management, makes me believe that this sauna is no exception.",
          "id": 20,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "It is in the rules though:\n\n>rules are to keep your voice down and be respectful of others",
          "id": 21,
          "comments": [
            {
              "score": 17,
              "content": "Them they call an employee, it’s called being an adult",
              "id": 22,
              "comments": [
                {
                  "score": 14,
                  "content": "I don't think asking someone politely to keep it down is \"not being an adult\", granted that's not what OP's husband did.",
                  "id": 23,
                  "comments": [
                    {
                      "score": -3,
                      "content": "I agreed with both statement",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15,
      "content": "ESH. \nIt's a small room- they likely weren't being that loud and everyone else was fine with it before you showed up. It's a small room- they all heard you \"whisper\" to your husband. Who then leered at them all creepily.\n\nIt's half an hour tops you would have had to \"suffer\" in your luxury sauna without perfect quiet. First world AH Problems right here.",
      "id": 25,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 14,
      "content": "YTA- they were there first?? You read the room! And for all you know, one or more may have had hearing loss and can’t wear hearing aids in a sauna environment. Even if they didn’t- they don’t all have to suddenly change because the wannabe Beckhams have arrived. \nYou want a totally silent sauna? Go buy one. But being in an environment where everyone pays their way, you can’t police it. And your husband is an absolute creep for leering at them.",
      "id": 26,
      "comments": [
        {
          "score": 13,
          "content": "Woah… I wouldn’t like to be in a sauna with you… no zen-sauna vibes in the Fragrant Ship 😭😭😭🤣",
          "id": 27,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Ew. Are you the loud sauna lady? Or are you the loud person in the coffee shop/library/restaurant shrieking and yell-talking?\n\nIt doesn’t matter who was there first. it’s not your home, it’s a public space. That means you need to lower your voice volume. It’s called being respectful of others. \n\nAlso, “Wannabe Beckhams”? What does that mean? “If you want a totally silent sauna go buy one” How about “if you wanna be loud, go home, turn the shower to hot, let the bathroom steam up, and sit on the floor while you yell-talk”?",
          "id": 28,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11,
      "content": "ESH",
      "id": 29,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "Is there a quiet rule in your gym's sauna?\n\nAsk the mngt to post it next to the door to help avoid future instances.\n\nOtherwise, they were there first and do have a right to talk.  When it comes to voices, it's hard to enforce what is loud versus quiet as it's very subjective (unless you are measuring it with a device) and some people just talk very loud naturally.",
      "id": 30,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "ESH \n\nThey were loud, but staring at them is not a nice way to deal with it.\nHonestly “ not reading the room” are you, if there are 2 chatty couples I would went to another steam room, luckily our gym has several.\nPeople do chat in saunas",
      "id": 31,
      "comments": [],
      "relation": "No"
    }
  ]
}