{
  "post content": "I (40f) was a single mother to my daughter, Amy (15f). I came out 3 years ago and married my wife Jenna (42f) last year. She has a daughter, Nora (13f). We all live together as I have full custody of my daughter. It was kind of hard for her to adjust to having a second mom, but they got along well.\n\nThe girls have their birthdays very close, only two days apart, so we decided to have a joint birthday party for both of them, since Nora had a hard time making new friends (they moved in with us and she's very shy). Most of my family lives out of the country, so the gifts were sent a week early. It was a huge bag, with at least 20 gifts. The party was nice and we opened the bag at night once everyone left.\n\nJenna handed out the presents as she took them out. After 12 gifts in a row just for Amy, I checked the bag and froze to see that there was only one gift for Nora, from my parents. She pretended it wasn't a big deal, but as she opened the present I saw her eyes drop. It was a $15 tumbler from Walmart. Not to sound ungrateful, but Amy's gifts were much more expensive (lots of gift cards over $100, a new phone, limited-edition Funkos, designer clothes and lots of cards wishing her a happy birthday).\n\nNeedless to say, I blew up the family chat, calling out my parents, siblings, and extended family who sent gifts for not considering Nora and my parents for the cheap gift. No one took me seriously since: *\"It's not our duty to give gifts to someone else's kid\"* and *\"Amy deserved them, since I didn't even throw her her own birthday party\",* emphasizing that Jenna and Nora are my problem, not theirs.\n\nNora was clearly hurt, since it's not the first time my family has left her out. At night, I asked Amy to share some of the gifts with her stepsister. Not all of them, just a couple of gift cards and some of the new clothes. Amy refused. This surprised me, since she never had a problem with sharing and even though she and Nora are not BFF's, they usually get along. After asking why, Amy started crying, saying that she never wanted a joint birthday party, and that I force her to share everything with Nora. They share a room for space and I make sure they're both invited to the same parties and sleepovers, so that Nora won't be left out. If they don't invite both of them, then either of them goes.\n\nAmy stated that she at least wanted her own gifts to be hers alone. I scolded her for being selfish with her stepsister, grounded her and took a couple of the presents to give to Nora. She turned them down because she didn't want problems with Amy and it felt like pity. Since then, Amy has been cold to all of us. I just wanted my two girls to be closer with the joint party and have the same things. AITA?\n\nClarification: Jenna and I bought gifts for the girls (their own tablets), as well as their friends. Nora also received gifts from her extended family, but they sent for Amy as well.",
  "id": 1,
  "comments": [
    {
      "score": 61450,
      "content": "YTA, you are basically asking your daughter to share her complete identity with Nora. Her room, her stuff, her family, her friends, her birthday party, the parties she goes to, sleepovers.... is there anything really HERS? This can't be good for her development. She needs to be her own person.",
      "id": 2,
      "comments": [
        {
          "score": 18285,
          "content": "Yes! And Nora needs that too, how will she ever be able to be her own person and build her own relationships if everything in her life is based on a step sister who barely seem to like her?",
          "id": 3,
          "comments": [
            {
              "score": 4383,
              "content": "To be fair the girls might genuinely get along with each other. Considering that they're close in age and are going through the same situation of having to adapt to the new reality. At some level I do think they understand each other. (Nora had to leave behind her own life, room, friends -Amy is also aware of this- and now she's watching her stepsister being forced to make similar sacrifices.)",
              "id": 4,
              "comments": [
                {
                  "score": 7414,
                  "content": "They might get along now, but if OP keeps this behavior up, resentment on Amy’s (and possibly even Nora’s) part is practically inevitable.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3034,
                      "content": "Amy will eventually get tired of this, I also had someone shoved down my throat because family this, family that! And guess what 10 years later I'm not friends with this person.\n\nMaybe If we weren't forced to basically act as the best of friends who share \"Everything!!!!!\" Maybe we would be friends, I feel for Amy.\n\nOP is major AH because I was Amy a few years ago and this is personal for me.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 867,
                      "content": "Yes. OP can want them to be close but forcing it will only create resentment. I mean Amy can’t go places if Nora isn’t included?  This is way over the top.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 218,
                      "content": "That resentment has apparently already started based on the post.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 185,
                      "content": "Yup, unfortunately 😞",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 164,
                      "content": "This is exactly what happened with myself,  & a foreign exchange student we hosted when I was 17. Initially,  we liked each other a lot, she was 16, we had a similar temperament,  & similar compatible personalities.  Sharing a room was fine, we were both mildly messy,  & respectful of each other's stuff,  & space. \n\nAt first,  I introduced her to my friends,  & things were going great.  Then my parents decided that if I was going out,  she had to go out with me,  otherwise I had to stay home. She didn't always want to come with tho, if it was a concert,  or a party,  or the beach, she was game,  but we also had quiet nights of just hanging out at someone's house,  or playing games, & those had no appeal to her. Then she made friends at her school (I was in uni, as I graduated early), & wanted to go out with them,  but she wasn't allowed if I didn't go with her. They liked shopping,  going to the mall to just hang,  things that had absolutely no appeal to me.  We still went with each other,  & invited our own friends,  but it was obvious the other one wasn't enjoying it. \n\nIt started to chafe at our tentative friendship,  & made cohabitation difficult. Until we decided to play the system.  We'd leave the house together,  I'd drop her off to do her thing,  & I'd go do my own thing,  then pick her up before curfew so we could arrive home at the same time. Things improved after that,  & when she went home,  we were on friendlier terms, but eventually lost contact completely.  \n\nI can't help but think that if my parents hadn't been so invasive,  & pushy,  we might've never fell out with each other.  At least now,  I can laugh at how ridiculous our arguments must've sounded,  her ranting in German (which I had intermediate knowledge of), & me ranting back in Spanish (similar level as my German), all our plotting was done in English tho, lol.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "And Nora is likely painfully aware of this, as she declined the presents knowing Amy was not on board.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "If my mom forced this on me all hell would’ve broken loose. And that’s because I was shy as a kid. This is far too far.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "Yup the the moms are going to wonder where everything went wrong.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "And then they’ll never have a chance at a relationship.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Also the oldest is not going to be close to her mom",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1079,
                  "content": "At that age 15 and 13 are very far apart",
                  "id": 16,
                  "comments": [
                    {
                      "score": 813,
                      "content": "Yes, they might not hang out with the same crowd. And they are old enough to chose their own friends, this part of having to go to the same parties and sleepovers is way over the line. YTA.\n\nIf your stepdaughter got sad because she didn't get any gifts it was your fault not your daughter's. You shouldn't have made it a big event to open gifts when you were not sure there weren't gifts for her. You said she received gifts from her own family, if they were all mixed together she wouldn't have being upset. Your daughter is innocent in all this, all she did was receiving gifts from other people, she doesn't control any of this. But you do.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 490,
                      "content": "At 15, kids usually are in their sophomore year in high school; at age 13, that's 7th/8th grade. There's a world of difference in maturity, interests, and privileges. \n\nThat the mother has the mandate they both get invited somewhere or no one gets to go really sounds like fun. It's no wonder the older girl wants her own space and gifts. Grounding her for wanting what's hers is unconscionable.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "15 and 13 years old are not close in age. A teenager matures at such a rate it is more akin to a 30yrs old and a 25yrs old woman.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "My sister and I have this age gap and at 13 and 15, we were NOT friends. We had a lot of the same interests and liked a lot of the same things but wanted nothing to do with each other. She started hanging out with my friends around that age because her friend group kicked her out or something and I H A T E D it. I feel like OP really does mean well here and didn't recognize how awful this actually is in practice but if those two are anything like my sister and I, this \"share everything\" plan is the worst possible call.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Oh wow I missed that part. I was picturing them as the same age, which would be weird enough on its own to basically force girls who met 3 years ago to play twins but at least the sleepovers and school group stuff would make sense. But 13 and 15? That's pretty much the exact peak age when sisters who grew up their entire lives with each other hang out the least!",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 40,
                  "content": "Two years age difference is a lot in teenage years.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "But they’re not close in development. 2 years isn’t a big difference in age, but during the teen years it’s a huge difference in emotional and social development. One is in high school, the other in middle school. It’s a big difference.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "I want to take a second to commend Nora for being so mature in response to the whole ordeal.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "They’re similar in age but I think y’all are forgetting that even a 2 year gap as kids is pretty significant. Amy is either a freshmen or sophomore in high school and Nora is in middle school. I know when I was in high school we didn’t want anything to do with middle schoolers lol. The idea that both of them have to be invited to all parties and sleepovers together is crazy. Great way to ostracize Amy from her new high school friends and make her resent Nora.",
                  "id": 25,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 31,
                  "content": "I think the fact Nora turned down the stolen gifts is a good indicator this poor kid understands how Amy is treated is wrong.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "The kids seem the most mature ones here.\n\nOP is very unwilling to put in the right but difficult parental effort into proper blended family parenting. Sure, he can't just ignore Nora, but forcing Amy to share/give so much of her self and what is rightfully hers from the people *she* has a relationship with and not Nora is a recipe for disaster.\n\nInstead of making Nora and Amy understand the dynamic and work to make sure both of their needs are met, he decides to throw a tantrum instead and get mad at his family.",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "If they’re given the space to grow as individuals they might potentially have a really good relationship but OP is quickly ruining any chance of that.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "I wouldn't want to bring my sister to everything. Sometimes you want to talk about private stuff with your friends and not your step sister.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4145,
              "content": "Exactly! Teens aren't stupid, Nora's gonna pick up it's all Amy's life, friends, events, things - that she's just being tacked onto as a somewhat unwanted extra hangaround, out of pity. It's devastating for a teen's self esteem to be forced into situations where you're painfully aware you're being *tolerated* due to mommy's orders. And do you even know if she *wants* to become Amy2? Have you asked either of them?\n\nLet them have their own parties (and lives) ffs OP instead of trying to force-squeeze Nora into Amy's everything. You're going to make them resent each other.\n\nAlso, you don't have the right to take things other people have chosen to give Amy and decide they're going to Nora now. If I buy a gift I intend it to go to the recipient, and not for their parent to redistribute to charity as they see fit. \n\n\nYTA OP, YTA",
              "id": 30,
              "comments": [
                {
                  "score": 1520,
                  "content": "This, she STOLE gifts from her own child, gifts that others bought... WTH is wrong with OP...",
                  "id": 31,
                  "comments": [
                    {
                      "score": 840,
                      "content": "[deleted]",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 408,
                      "content": "Not to mention she also PUNISHED her! Who TF does this?! Poor kid not only had her presents stolen but got locked in the tower by her evil (not step) mother (grounded).\nHow much you wanna bet that OP will be shocked by the YTA ruling and double down rather than make amends? I would really like an update to see if she actually does right by Amy, cause her next excuse will be \" but I already gave them to Nora, I can't take them back now\" and not even see the effing irony. \n\nI mean I feel for Nora, but OP and Wife should have anticipated this.  I mean Amy can't go anywhere unless Nora's invited and that's plain bullshit.",
                      "id": 33,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 203,
                      "content": "And don’t ever have a joint party again.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "Exactly. OP keeps that sh*t up, and she'll find Amy, and all her belongings gone, when she turns 18, or apply for emancipation.⚠️",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "And the fact Nora refused the gifts should have communicated loud and clear that OP is TA.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "And then GROUNDED HER  for not being happy about it. \n\nYTA, OP",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "I totally agree  .  Beside  Nora might receive gifts late.  Doesn't Nora have her own grandparents?  Aunt,uncles ,and dad. She might receive gifts later.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 15,
                      "content": "she did op even said she did. they sent both girls gifts",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "You make sure they’re invited to the same parties and sleepovers. \n\nTo me this is much worse than forcing your kid to share gifts (which was a bad move). Does Amy not deserve any privacy at all? A tiny corner of her life that’s just hers?\n\nDo you want her to feel nothing but resentment for Nora? I get that you were trying to do the right thing but those gifts were not yours to share. How often do YOU share your car or your washing machine or your new clothing with people who don’t have those things? We ask of kids things we don’t do ourselves.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "The Mother stole from her daughter. If I buy my niece a nice gift and it was taken from her, and given to someone else I would be furious. I would have bought the stepdaughter a gift also, but since I don't know her it would have been less, than for the child I had known, and loved for years.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 397,
              "content": "….and will like her less and less, the more they’re forced to “bond.”",
              "id": 42,
              "comments": [
                {
                  "score": 33,
                  "content": "This is the one point I agree with. Can't force bonding, and the attempt will only drive them further apart.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Agreed, having your family reject one child is a problem, but it’s a separate problem that is not at all solved by making your other child bear the burden you, as an adult, should be dealing with. It’s the parent’s job to protect the child’s sense of love, family, and self-worth, not their sibling’s job. It won’t even work— forcing these kids to share everything as a solution won’t make up for a lack of affection from other parts of the family. That’s not the solution. \n\nOP should know their family doesn’t consider one of their kids and take their own measures— check in about presents ahead of time, balance it out with what you feel appropriate, etc. \n\nThat is your job and your partner’s job to navigate, and not done by making these children share every relationship and item they have. \n\nAs people have pointed out, this “convenience” approach from you (because collapsing your obligation to two different, autonomous children with different needs and family circumstances *just makes it easier for you, not your children*) is likely harmful to both these kids. Don’t do that.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Major YTA. You want your daughter to share her life with your stepdaughter down to a joint party. Ok good youre in love and all but let AMY live her life without having to share what's meant for her. This is disgusting it's not Amy's fault. Like seriously 😒",
              "id": 45,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3043,
          "content": "I even wondered if Nora even WANTS this type of inclusion. I hated having to be made to interact with people who didn’t want me there and kids don’t hold back which would be worst than just not going. She could just do something special with Nora while her daughter goes out to reassure their relationship and maybe build hobbies together",
          "id": 46,
          "comments": [
            {
              "score": 771,
              "content": "Yes! \n\nAs an introvert who struggles with social situations, this is awful. It’s hard enough being in social situations where you aren’t entirely comfortable, but being forced into situations where you can sense your presence isn’t wanted… AWFUL. I’ve been put into some situations like that in my life, and remembering them still haunts me decades later. I’d rather be home alone than anywhere I’m not wanted, 100% of the time.\n\nETA: I used the word “situations” a lot in that paragraph, and it’s stressing me out. 😅",
              "id": 47,
              "comments": [
                {
                  "score": 133,
                  "content": " I wonder if OP is an extrovert who thinks all introverts just need more socialization to be “fixed”.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Wouldn’t doubt it. I experienced this a lot, too. I had extroverted friends in high school who would invite over a boy I was crushing on to one of their houses and lie about it to get me there because “you need to stop being so shy”. All this did was ramp up my anxiety, and make me stop trusting my friends.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "100% this. For god's sake I WANTED to be let alone sometimes. I wasn't sad, lonely or shy just needed my own space 😂. I still cringe thinking of the crap I was dragged into.\n\nOP, YTA. Sorry. I know you desperately want this new family to work and please Jenna, but you're trying way too hard and punishing Amy and Nora as a result. Just, try to let go and let things happen more naturally. \n\nPlease try to give the girls their own physical space. It must be a nightmare being trapped together like that. And - apologise to Amy. She knows YTA and you're not being fair.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I do that with the word just. I feel like I use it all the time and I stress over whether it's annoying to other people. I see you, friend, and you're fabulous.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "When I was a kid I had social anxiety and didn't have many friends, and if I ever tried to turn down an invite to hang out, my mum woukd scold me and tell me that I had to ring them back and say that actually, I coukd come.\n\nFirstly, this only gave me the idea that I coukd never say no to anyone. This created problems later in life.\n\nSecondly, overriding my decisions and taking away my agency just gave me less social confidence, not more. \n\nThirdly, the reason I turned down hanging out with these people wasn't just because \"I'm shy.\" They weren't people that I vibed with or particularly wanted to be friends with. Because of my mum's interference  I ended up being friends with people for years that I didn't particularly love or want to spend time with.\n\nI've always been someone who prefers having a few very close friends, as opposed to being friendly with lots of people. And when I find my besties, I KNOW. My life is much easier now that my only friends are with people I've chosen, as opposed to people I feel obligated to hang out with. (Though obviously there are friends of friends and colleagues from work and so on... you can't always like everyone you interact with, but everyone that has a strong role in my life is there for a solid reason now).",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "And why is OP's wife not stepping up to help her own daughter?? Does \"Jenna\" not have to take her bio daughter's feelings into consideration, instead of putting it ALL on OP to be the \"bad mom\"? Before they even graduate from high school,both girls are going to move on to their own adult lives and OP,Jenna, and each other, will soon be in the rearview.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "1. Age difference: very awkward\n2. Different personality: very awkward\n3. Hanging out with people that tolerate you because they have no choice: incredibly awkward\n4. Being a shy child that is forced to hang out with older children: incredibly awkward.\n\nTrust me. Nora doesn't want this at all",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I’m betting both parents have never asked the kids what “they” want!  They just took it upon themselves to force the kids to do things together because of their own insecurities.  Teens need their own space and friends.  But they both essentially forced this ideal on their kids instead of seeing what the kids wanted.  \n\nPlus, parents that throw joint parties are terrible and cheap in my eyes.  And since the girls aren’t even blood related and just moved in together for only about a year it’s even worse that they make them share their special day like that.  Maybe if they were 1-3yo and don’t know any better, but teens?? No bueno!!!",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1847,
          "content": ">YTA, you are basically asking your daughter to share her complete identity\n\nWhy stop there? I mean why not get them the same hair cut and same clothes? /s\n\nOP -  YTA\n\nEdit: my phone sucks today lol \n\nOP , by forcing Amy to share things , you are gonna make her resent the SS .\n\nYou idea to bond them thru sharing is starting to have an reverse effect \n\nYou need to apologize and make up for this with ONE ON ONE mother and daughter time.\n\nAlso INFO : now it clear your family sucks, seeing as know your married.\n\nBut my question is this OP \n\nDoes your family support your sexuality but hate who you are married to? Or are they not accepting of your sexuality?",
          "id": 56,
          "comments": [
            {
              "score": 758,
              "content": "Why stop there, why not have Amy give Nora a year of her age, then they're both 14?  Also start calling them one name like \"Normy\" or \"Amora\" or \"Bennifer\".\n\n&#x200B;\n\nOP - YTA",
              "id": 57,
              "comments": [
                {
                  "score": 31,
                  "content": "Mfw you call a girl Normy\n\nThats like calling your son \"Average\"",
                  "id": 58,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 320,
              "content": "Good point. Teens don’t bond through sharing. Unless they’re sharing resentment towards their parents :)",
              "id": 59,
              "comments": [
                {
                  "score": 39,
                  "content": "This! My parents never forced my brother and I to hang out together, and treated us both as our own completely separate and different people. As a result, we hung out (by choice!) tons growing up, to the point where some of his friends call me their sister.\n\nIf you force it, it won’t happen. You have to let the bonding occur organically.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 289,
              "content": "Forced sharing is also just lazy parenting.\n\nIt requires no involvement from the adults, no active engagement or investigation into who the kids are as people, it doesn't allow the kids agency per their participation; it's the parenting equivalent of throwing a steak between two dogs.\n\nIf OP really wants the girls to have shared experiences, she should take them on family days; mommy and me paint and sip classes, mini-spa days, group book shopping, jewellery making classes etc.\n\nThese are also great ways to get to know their girls better like learning their styles, their favorite colours, what kind of genres of media they respond to, and what kind of activities they enjoy (are they high intensity people or low intensity people?).",
              "id": 61,
              "comments": [
                {
                  "score": 14,
                  "content": "That's the part that got me. Ok, new life new wife, but you're demonstrating that N is an afterthought to you. \nYou and your wife need to be doing more to help N get comfortable in the new home, family, etc. Plan things for all of you to do together and then by all means apart. If A has plans w friends and N doesn't it is YOUR responsibility and your wife's to help her socialize or just hang w her. You should have looked to see how many presents were in the bag and for whom. \nYou could have held back some to give to A later when N wasn't right there if it was a 5-1 breakdown of gifts. I'm pretty sure you already knew the type and quality of gifts your family gives if A is 15 and this wasn't the surprise you think it was.",
                  "id": 62,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "kind of baffling that OP is this awful at parenting.",
              "id": 63,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1379,
          "content": "*’How to make stepsisters hate each other- a guide by OP’*",
          "id": 64,
          "comments": [
            {
              "score": 49,
              "content": "+ruining relationship with their daughter lmaoo",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "*a step-by-step guide",
              "id": 66,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1060,
          "content": "And then you remember there’s a two year age difference and it’s even worse. It’s not a significant gap as adults, but there’s a big difference between the average 13 year old and the average 15 year old. The older one and her friends probably don’t want what feels like a little kid tagging along all the time and the younger one probably feels out of place with the older teens. It’s not fair to either of them.",
          "id": 67,
          "comments": [
            {
              "score": 393,
              "content": "Totally right.  No wonder Nora hasn’t made friends…she’s being made to hang out with older teens and they’re not going to be her friends.  It’s one thing to ask for Amy to take her shopping once in awhile, etc. But making a rule that Amys friends have to invite Nora everywhere, including sleepovers, is ridiculous.  Amy will resent her, and you, and Nora won’t have any social life of her own.  Amy had no life now, thanks to you.  I, sure her friends will,start not including Amy because they’re tired of the younger kid tagging along.  They don’t know her, so can’t even complain about parents, etc as who knows what Nora might tattle on.  With your family, I can understand you want them to include Nora and they should.  Find a way to talk more to them about including Nora in the gift giving, etc. But forcing the joint birthday and everything else just doesn’t work.  Certainly won’t make your family start sending gifts to Nora if they feel she’s a reason their relative, Amy, isn’t getting to live her own life.  Back away now. YTA.",
              "id": 68,
              "comments": [
                {
                  "score": 44,
                  "content": "Nora's situation is totally OP'S and wife's fault. They are being lazy. Instead of signing Nora up for activities she likes where she can make friends they are Instead obviously lazy AF, expecting Amy to do the work for them. Tbh, if I were Amy, I'd call my grandparents to come get me and ask to live with them because at least she'll be around someone who gives AF. \nThis post triggered me so bad.",
                  "id": 69,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 41,
                  "content": "Exactly what HS freshman wants a middle schooler hanging out with them. This will just hurt Amy’s social life and ruin Nora’s self esteem cause she’ll know she’s not wanted around.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 177,
              "content": "I can't believe that OP won't let her daughter go to a party/outing if her stepdaughter isn't also invited. Very few 15 year olds want to be forced to hang out with 13 year olds. That could be the difference between middle school and high school. The 15 year olds are starting to learn how to drive and the 13 year olds are just able to see PG-13 movies in the theater alone.\n\nI agree with everyone that the more OP forces them to be together, the more both girls will resent her & her wife and will take longer for them to even see if they like each other.\n\nOP, YTA.",
              "id": 71,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 27,
              "content": "This is exactly what I was thinking. At that age, a two year gap is HUGE. OP shouldn't be forcing them to attend all the same events. Smh",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "And like, it sucks to admit this but the younger one is going to feel left out. The older girls won’t want to include her on everything even when she’s forced to hang out with them. They’ll purposefully leave her out of some conversations, develop their own inside jokes, etc. It’s going to alienate the younger daughter even more. \n\nOP, put Nora in some gd activities where she can find her own friend group. Art classes, soccer, youth empowerment camp. Help her for goodness sakes, don’t just dump her onto your daughter. YTA",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 874,
          "content": "[deleted]",
          "id": 74,
          "comments": [
            {
              "score": 93,
              "content": "It seems like this was just the straw that breaks the camel’s back. With being forced to share everything it finally broke her",
              "id": 75,
              "comments": [
                {
                  "score": 26,
                  "content": "right? If OP hadn't glued Nora to her hip Amy might might have been more sympathetic & gracious about sharing some gifts / letting her borrow some cloths or even picking something out they could both use like a computer game or something cool for their room.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 30,
              "content": ">forcing people together literally never, ever works. Half the posts on this sub are blended family problems, and this is a common one. It often leads to a large amount of resentment and children going LC/NC once they're older.\n\nIt is just *mindblowing* to me that someone who even knows this sub exists could be unaware of this.  As you say, it's not like this is a rare cause of conflict in the stories here.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I just thought of something reading your comment, did ops new wife's family not send gifts for Nora,",
              "id": 78,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 774,
          "content": "And honestly the same goes for Nora. She won't have an example and a chance to try stuff out for herself, she just has to... Become Amy? YTA indeed",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 277,
          "content": "Best response.",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 115,
          "content": "Right. This goes so far beyond the gifts. OP isn't giving her daughter any autonomy over her own life. \n\nFrankly I'm surprised her daughter doesn't absolutely hate her step sister yet, considering how much their relationship was forced by OP.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "Not to mention, how will OP’s family react if gifts intended for Amy went to Nora? It might not seem fair to OP, but they spent their money on Amy. So those gifts belong to her. OP needs to let Amy have her own identity.. because right now, it sounds like the girl can’t breathe without having to cater to a sibling she didn’t ask for and Nora ends up constantly stuck in the middle. Both girls are being let down here.",
          "id": 82,
          "comments": [
            {
              "score": 28,
              "content": "Yes, I was drawn to the fact that Nora refused Amy’s gifts because she didn’t want to create more problems with Amy. \n\nLet that sink in, OP. The 13 year old recognized that this situation is a potential landmine and acted to mitigate it. While you, the adult, are basically throwing gasoline on the fire. \n\nI’m not trying to be harsh to you here, I’m just hoping you will understand that the actual child is handling this better than you are currently, and will adjust your responses. This is not the time to be so heavy handed. This is the time to back off, give both Amy and Nora the space to adjust to their new realities, and work forward slowly. Stop trying to force them.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 25191,
      "content": ">I make sure they’re both invited to the same parties and sleepovers…If they don’t invite both of them, them neither of them goes.\n\nAmy isn’t allowed to have her own friends?!?!  You seriously don’t let her socialize unless her sister is with her?!?!?!   Not to mention, maybe Nora doesn’t want Amy there when she hangs out with her friends.\n\n\nSounds like Amy is dealing pretty well with - losing her dad(?), having her mother come out, having to share her mom with her new wife, having to share her space and things with a new sister….after 14 years of it being just the two of you.  She has NOTHING TO HERSELF.  And she can’t even go out with her friends on her own.\n\n\nDo you see Amy’s struggles at all???  Or are you so focused on the pretty picture in your mind and being Nora’s hero that you don’t see your all the changes your own daughter is going through?   \n\n\nYou have compassion for Nora, and that’s wonderful!  But you are sacrificing your own daughter’s happiness for Nora’s.  Just because Amy doesn’t complain doesn’t mean she isn’t struggling and hurting.\n\n\n(Yes, your parents are jerks-that was a horrible thing to do.  But maybe they did her a favor if it wakes you up to how awful you are being to your daughter.  I’m wondering if she’s complained to them, or they just see how she’s treated now). But you tried fix it the totally wrong way.  You punished Amy for your family’s awful behavior.\n\n\nListen to what Amy is telling you.  She’s been polite long enough.  You are not bringing them closer; you are driving them apart.  YTA",
      "id": 84,
      "comments": [
        {
          "score": 6129,
          "content": "It doesn't even sound like OP is doing Normal any favors--she has a hard time making friends so she's being sent to sleepovers with girls two years older than she is? That's not going to help. Nothing in this story sounds like it has been for the benefit of either child.",
          "id": 85,
          "comments": [
            {
              "score": 3226,
              "content": "And forcing a 15 year old to hang out with the 13 year olds too, if Nora has any friends of her own. Which would probably harm Nora's ability to maintain friendships outside of school.",
              "id": 86,
              "comments": [
                {
                  "score": 1496,
                  "content": "Yup. Amy's friends are going to start excluding her and she'll end up being a social pariah.  They need to enroll Nora in some activities, Girl Scouts, sports, ballet, or something to develop her own clilque.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 547,
                      "content": "Yup, if Amy can’t go without Nora they’ll just stop inviting Amy. They probably already have.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 576,
                  "content": "[deleted]",
                  "id": 89,
                  "comments": [
                    {
                      "score": 52,
                      "content": "I've had a family friend who was about 3 months older than me, but because he fell into a different academic year we had almost entirely different social circles with nearly no overlap. School acts as the foundation of a lot of friendships at that age, so even a year of difference is enough to make someone an outsider to any given social group",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "I’ve always been pretty close to both my siblings - 2yr older sister and 3yr younger brother - and even as teens we did have some friends in common and would do some things together. But not *everythjng*, jeez. That’s just weird.",
                      "id": 91,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 899,
              "content": "The autocorrect here made my day. Poor Normal. She didn’t ask for this either.",
              "id": 92,
              "comments": [
                {
                  "score": 294,
                  "content": "Lmaooooo same. Poor Normal, can't even have her own name 😂",
                  "id": 93,
                  "comments": [
                    {
                      "score": 51,
                      "content": "Poor Normal, even the robots don't like her. :(",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "Autocorrect got you on the name but I wholeheartedly agreed",
              "id": 95,
              "comments": [
                {
                  "score": 36,
                  "content": "It’s definitely not normal what they’re doing to Normal.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "And giving her her sister's gifts - she even said she doesn't want them because it feels like 'pity', which it was, to be honest. And that sucks to feel like that. BOTH girls have basically let OP know her methods are not helping, but hurting.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Amy is in High School and Nora is still in Middle school. That is a HUGE divide.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "> t doesn't even sound like OP is doing Normal any favors--she has a hard time making friends so she's being sent to sleepovers with girls two years older than she is?\n\nWorse than that, she's being sent to sleepovers where she almost certainly isn't wanted. I'd bet a shiny penny that when Nora is invited, it's only because Amy's friends see that as a tolerable cost of being able to spend time with their friend.\n\nOP is setting Nora up to have her heart *crushed* repeatedly because she's being forced to socialize with people that in all probability resent her inclusion. Super YTA.",
              "id": 99,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "Thinking of myself when  a 13 year old ,especially with social anxiety, I would have felt embarrassed and awkward going to sleepovers with older girls not to mention everything else. I hope this changes for Nora's sake , I feel for her .",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": ">\tshe has a hard time making friends so she’s being sent to sleepovers with girls two years older than she is?\n\nThis was my first thought. I’m a guy, so I have no idea what it’s like to be a 15 year old girl, but my guess is that high school girls don’t want an eighth grade tagging along all the time. Once in a while, maybe, but every event? Nora likely feels a little uncomfortable because I’m sure at least one of the girls has made a comment at some point.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1505,
          "content": "I’m going to give the grandparents a tiny bit of a break here. They live out of the country, and may not ever have met this child that they’re supposed to suddenly love and know preferences for. So yes, they could have asked for appropriate gift ideas and done better, but they’re not totally wrong that they aren’t responsible to be equal in gift giving for a child they don’t know, who isn’t their grandchild. Doesn’t Nora’s bio-family do things that aren’t for Amy?",
          "id": 102,
          "comments": [
            {
              "score": 621,
              "content": "They probably assume that Nora's family will send gifts to her and they will get gifts for Amy. They don't even know Nora. They have no relationship with Nora.\n\nIt would be nice of them to give gifts to Nora but there is no reason to think that they assumed Nora would get no gifts or to assume Nora's family would give Amy gifts.\n\nThe family was trying to make up for the rough situation that Amy is finding herself in and OP just made the entire situation worse. She will wonder why Amy leaves to live with other family members as soon as she can.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I agree, this is really OPs fault. She should never have combined the party and if she wanted to do something for Nora she should have made sure to let everyone know ahead of time.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 944,
          "content": "Not to mention the age gap- 13 and 15 could easily be an 8th grader and a sophmore, or a freshman and a junior\n\nEven IF they were full blooded siblings, this would be absurd",
          "id": 105,
          "comments": [
            {
              "score": 463,
              "content": "The difference between a 13 and 15 year old is huge. This is absolutely bonkers for OP to insist that the girls do everything together. I’m sure the 13 year old is just as upset about it as the 15 year old.",
              "id": 106,
              "comments": [
                {
                  "score": 34,
                  "content": "Right, 15 year old me was a totally different person than 13 year old me. Not to mention some of the things 15 year old me talked about were probably inappropriate for a 13 year old.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 81,
              "content": "As a mom of a 13YO and 15YO I agree. It’s absolutely horrible of OP to do this. If I tried to do this with my girls (and yes - one of them has friends and the other doesn’t, as well), I could count on plenty of resentment coming from both of them.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "i was thinking a 7th grader and a freshman",
              "id": 109,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "So true! Children see 2 years difference between them waaaay different than we see when we’re adults.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Exactly- 2 years at that age is practically equivalent to a decade later on in life! You grow and change so fast during puberty, either Nora is going to be left out and excluded, or try to grow up WAY too fast to fit in. OP is harming both girls here",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 581,
          "content": "wow.. just wow. not only does op suck, but the family is taking it out on the kid too. the kids are more mature than op, and op is selfish and childish af for how shes acting. \n\n> we decided to have a joint birthday party for both of them -\nno, YOU decided. did they actually get a say? and if they did, was it genuine or just to please you? \n\n> The party was nice and we opened the bag at night once everyone left. - why did you open them when everyone left? dont you normally open them at the party? \n\n>  I checked the bag and froze to see that there was only one gift for Nora ... and then; \n\n> Clarification: Jenna and I bought gifts for the girls (their own tablets), as well as their friends. Nora also received gifts from her extended family, but they sent for Amy as well...- they got other gifts. yes the distribution isnt even, but she didnt just get a tumbler. rude, yes, but dont ignore other info.\n\n> \"Amy deserved them, since I didn't even throw her her own birthday party\", - theyre taking this out on kids. you fucked up, so theyre taking it out on a kid??\n\n> Nora was clearly hurt, since it's not the first time my family has left her out...- probably because of your attitude. its not her fault. \n\n> At night, I asked Amy to share some of the gifts with her stepsister. Not all of them, just a couple of gift cards and some of the new clothes. Amy refused. This surprised me, since she never had a problem with sharing and even though she and Nora are not BFF's, - youre forcing them to share, when they arent even close. she doesnt argue to keep the peace\n\n> Amy started crying, saying that she never wanted a joint birthday party, and that I force her to share everything with Nora. They share a room for space and I make sure they're both invited to the same parties and sleepovers, so that Nora won't be left out. If they don't invite both of them, then either of them goes. - LISTEN TO YOUR KIDS! they need their own shit, and their own space. ffs jeez. \n\n>Amy stated that she at least wanted her own gifts to be hers alone. I scolded her for being selfish with her stepsister, grounded her and took a couple of the presents to give to Nora. She turned them down because she didn't want problems with Amy and it felt like pity. Since then, Amy has been cold to all of us. I just wanted my two girls to be closer with the joint party and have the same things. AITA? \n\nSo she was given gifts, and you stole them. they are forced to share already, and you steal them? she felt like it was pity, because it was. \n\nmy god your kids are more mature than you are. you called her selfish for wanting to keep what was gifted to her? YOU ARE STEALING THEIR STUFF!! and you want to call her selfish? nah.",
          "id": 112,
          "comments": [
            {
              "score": 13,
              "content": "OP “checked the bag and froze” then a few sentences later states that Nora was hurt because it wasn’t the first time OP’s family left her out….Please explain why OP was so surprised?? Maybe if she had left it alone, Amy would have realized Nora was feeling bad and would have WILLINGLY chosen to share with Nora. Obviously, Amy has some positive characteristics if it has taken her this long to complain. But taking away Amy’s choice caused her reaction. OP grounding her for her feelings was excessive. She doesn’t even recognize that she has completely turned Amy’s life upside down.\n\nAnd when are people going to stop assuming that others, especially their own families, have to adjust or accommodate THEIR life choices?? It would be nice and generous, yes, but NOBODY is obligated to you.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 518,
          "content": "OP isn't sacrificing her daughters happiness for Nora. OP is sacrificing her daughters happiness for herself. OP never said her stepdaughter wants her intervention. Everything OP does seems to be for OPs own satisfaction.",
          "id": 114,
          "comments": [
            {
              "score": 160,
              "content": "This is a good point. It doesn’t sound like Nora wants any of this, but rather that it’s all being done for OP’s sense of self-satisfaction. I can only imagine how humiliating it would be for a 13YO girl to be forced to accompany her 15YO stepsister on all social outings, all the while acutely aware that her presence is unwanted. I pity both girls. This is a recipe for breeding resentment between the two.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 429,
          "content": "Ooh I missed this part, OP is working real hard to make sure Amy and Nora grow up to resent each other 🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 187,
          "content": "*Not sister, step sister. I was a teenager when I acquired step siblings. They are not my siblings.",
          "id": 117,
          "comments": [
            {
              "score": 36,
              "content": "This!!\n\nI understand that step-siblings can sometimes have a very close relationship, but that depends entirely on them and their circumstances (the ages they were brought together being a huge factor). Some step-siblings are never going to have that kind of relationship, and that’s ok. \n\nWhether Nora and Amy end up being super close or just “relatives” is for them to figure out. OP needs to back off and give them the time and space to do so, and stop trying to force it just because she’s got an idea in her head about them all being this happy, cohesive family unit.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 63,
          "content": "Those girls are going to hate each when they grow up or strangely bond over how ridiculous their mom has been.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Yeah. I was so thinking by the end of the post that the family were sending a signal, recognising how much OP'S daughter has lost. \nI bet she doesn't even have 1:1 time with her Mum anymore. How utterly fucking selfish. Poor daughter.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "This\n\nI mean ffs the kid can't even have her own bday presents. Soon Amy won't have any friends because kids don't like being forced into relationships. If inviting Amy means her SS has to come too the solution is to not invite Amy. The fact that she can call her daughter selfish while ignoring how selfish she is being herself is amazing to me. She wants her daughter to think about Nora's feelings while punishing her daughter for having feelings of her own that don't align with her own, poor kid",
          "id": 121,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8180,
      "content": "YTA, I know you are trying your best, but your mistake was to have a joint party in the first place. Amy is a teenager and is developmentally looking to forge her own identity. This means not existing as a package deal with Nora. It's also cruel to take someone's birthday presents away when it's not her fault that your family was not as generous with Nora. It's up to you and your spouse to make sure Nora has a good birthday too. \n\nI think you need to talk to your wife about how y'all want to coparent your teens. It's incredibly inappropriate to expect their friends to invite them as a package deal to parties. They are teenagers, it is completely normal to have different social circles. There are twins out there who have separate friends.\n\nI also want to stress, that it is very common for biological sisters who grow up together to not like each other. The fact that Amy and Nora are not besties is not a failure to blend your families. Stop forcing it.",
      "id": 122,
      "comments": [
        {
          "score": 3058,
          "content": "Is she trying her best?  I think she’s being a terrible parent to her kid.",
          "id": 123,
          "comments": [
            {
              "score": 1335,
              "content": "If this is trying her best, I am truly sorry for her child.\n\nI imagine if she keeps this up, she will create a rift between herself and her daughter that won't heal.",
              "id": 124,
              "comments": [
                {
                  "score": 109,
                  "content": "If she wakes up now and fixes this she'll be okay. People make mistakes. The important thing is acknowledging those mistakes and doing your best to rectify them.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": "Would not surprise me if Amy started to look at colleges and universities far from home to finally get a break from being Nora's emotional support animal. Probably wouldn't even come home for breaks and summers.",
                  "id": 126,
                  "comments": [
                    {
                      "score": 26,
                      "content": "She is definitely turning into the ESA for Nora and it sounds like it’s not Nora even wanting it or needing it!",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Honestly. I can see this turning into a NC deal from Amy towards OP.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 729,
              "content": "I mean she stole from her child AND grounded her for having legitimate feelings.",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 332,
              "content": "Agreed. She is absolutely not trying her best. How many books on blended family's would tell her she is doing this incredibly wrong and going to cause massive lasting rifts? She isn't trying at all for either kid, she's trying to make herself more comfortable at their expense and their relationships detriment.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Is she trying her best or trying to control the narrative? In her self serving rant she never once mentioned her spouse and her feelings on the matter. Just a whole lot of patting herself on the back while she is ruining the relationships between the rest of the family.",
              "id": 131,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "She's trying something, lol. Unfortunately for her the end result is driving a big, fat wedge between the step sisters, and herself and her daughter, and her daughter and her new wife... also the daughters' individual friend groups being forced to invite the other sibling.\n\nEvery action OP takes in this post is an overcorrective mistake that is doing exactly the opposite of what she wanted to have happen. Embarrassing she can't see it lol.",
              "id": 132,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 866,
          "content": "Nevermind that they have different social circles, they're different ages. If I was Amy's friend at 15, I would stop inviting her to sleepovers knowing we'd be stuck with her 13 year old kid sister who I have no relationship with!",
          "id": 133,
          "comments": [
            {
              "score": 359,
              "content": "Once her and her friends hit 16 and have more freedom and some might have cars I’m betting she’ll get left out of group invites to the mall, or movie or whatever they do because who wants a 14 year old to tag along? She’s setting her daughter up for isolation from her friends.",
              "id": 134,
              "comments": [
                {
                  "score": 32,
                  "content": "Holy carp, I'm the same age as OP and would be mortified if I was this totally ignorant of teenage dynamics. I understand it and I don't even have a kid. 40 years of life and she actually believes that a person can \\*make\\* people be friends. And where is the wife in this? Why isn't she stopping OP from trashing her kid's self-esteem? Because even if some of Amy's friends put up with Nora, it isn't like they are going to have classes in common or anything to talk to about with her.",
                  "id": 135,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 125,
              "content": "Yeah, two years is a LOT at that age! It’s ludicrous to expect them to have the same friends",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Honestly! Didn’t OP ever learn that you don’t invite yourself (or guests) to other people’s homes? Who says the parents of these friends are even ok with having an additional, younger(!) kid added to the mix when they’re hosting their child’s actual friends? I would be mortified if I was Amy!",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5789,
      "content": "YTA absolutely \n\nYou’re trying to force this one big happy family dynamic. You expect your family to jump on board pretty quickly and just accept and treat Nora like your own and they haven’t.\n\nYou don’t solve that by stealing your daughters presents from her family and sharing them with Nora, that’s only going to build resentment between them.\n\nYou’ve found who you are and accepted it and created a new life, good for you. But in the process you’ve robbed your daughter of her own space, her own celebrations, her own friendships and her own gifts. Then you punish her for not being accepting of it.\n\nThat’s just crappy on multiple levels.",
      "id": 138,
      "comments": [
        {
          "score": 1639,
          "content": "I’m often surprised by just how often grown ass people seem to believe that just because they’ve fallen in love with a person, their children will love their parent’s new partner AND kids just as much immediately.",
          "id": 139,
          "comments": [
            {
              "score": 855,
              "content": "Also... potentially unpopular opinion... just because someone in your family marries somebody new does not mean you need to buy their new step kid a gift.\n\nOP only got married a year ago. \n\nI have aunts and uncles and cousin who I haven't seen in a year who still love me dearly. Hell, I haven't seen one of my grandparents since before the pandemic! \n\nSo, my point is, have these relatives even met this child? If not or if have met them twice or less... I don't feel they are financially obligated to buy a teenager gifts just because one of their relatives married someone nee",
              "id": 140,
              "comments": [
                {
                  "score": 263,
                  "content": "Not an unpopular opinion with me and I grew up with divorced parents so blended/extended families were my norm my whole life.\n\nReality is you have YOUR family and then you have extended family - some may treat you like their bio family and some may not. Does it make you a bit jealous seeing a stepsibling get presents from their bio family and you don’t? Sure. But part of growing up (and being taught to be a decent human being by your parents and guardians) is accepting that that feeling is part of life. It’s no different than going to school after the Christmas break and seeing some other kid have the best new shoes/iPhone/headphones/whatever. Maybe it’s ‘not fair’ they have them and you don’t but that’s life.\n\nThere’s a very odd culture where people expect you to fall in love with your extended family and see them as your own family, but honestly sometimes that doesn’t happen and it’s fine. YOU can choose your own family and that’s awesome, I’m a big believer in that, but that ends at yourself. You do not get to make that choice for your parents/siblings/children/whoever else, only yourself. So if you love your new spouse/their kid like your own great! But your children do not have to have the same feelings you do.\n\nIt blows my mind people have that expectation, especially parents who remarry - you’re basically shoving two strangers together and saying, ‘There you’re sisters and now you love each other!’ Not how it works lmao.",
                  "id": 141,
                  "comments": [
                    {
                      "score": 14,
                      "content": "YUPP\n\nMy dad has spent the last one and a half decades trying to blend the family every time he gets a new girlfriend with kids. Talks up how great they are, forces them to attend our birthday celebrations with him and tries to guilt trip us when we don't reciprocate because we know we weren't invited by the kids and we have nothing in common with those kids, are all of different ages, interests and needs,  and we all know no meaningful friendship could come of the time spent together. The only thing we actually have in common is resentment of parent's antics intruding in our own lives and time. \n\nHe's nearly completely estranged 4/5 of his blood children. He's still got one at home and I don't think his chances are great for not messing this one up because he won't listen to the advice of any of his grown progeny.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "This! My step-dad has been with my mother for over 20 years and I didn’t get any gifts from his family other than his mum but my brother who is my step-dads kid did but I never got offended in any way, even when my dads side of the family would give my brother gifts I understood families are all different and didn’t take it personal in the slightest.\n\nI think this story makes it seem worse than it is because they had a joint party, if they had separate parties this probably wouldn’t have been noticed half as much.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 143,
              "content": "When my cats want my boyfriend to move from their spot on the bed, he moves. Can’t imagine trying to force my child to let this new kid be her little clone and then steal her birthday presents so I look like a hero",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I’m always surprised by the adults who force their kids to socialize with someone they don’t want to socialize with and then punish them for responding normally to that \n\nIt’s like they have no social awareness of group dynamics and friendships amongst kids. Even though they went through 12 years of schooling.\n\nJust woke up adults and didn’t have a childhood full of these scenarios to learn from",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 286,
          "content": "And honestly, I genuinely want to know how much time the family has spent with Nora. I wouldn't know how to shop for someone who I've seen four times, doesn't speak much (presumably on the shyness statement) and for all of max ten minutes each time (which is a very generous measurement, coming from a former quiet kid). So the best I can do is try to match the $ in gift card form, which I feel lacks thought.\n\nBut more importantly, OP, you're being a shit parent to both of them. They need space. I fucking loathed my sister because I had to share everything with her (sans clothes themselves but the styles matched which SUCKED) and I was responsible for her because she was younger. I assume with you forcing Nora into your daughter's social circles, it's probably going to turn out approximately the same if you don't cut it out.\n\nTldr: I think YTA, more than a little unreasonable and frankly, a thief of your daughter's joy.",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Not to mention it’s obvious the family loves the daughter a lot, and she’s going to tell them that mom stole some of her presents to give to the step daughter, which is only going to build more resentment from the family.",
          "id": 147,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4782,
      "content": "Is this a rage–bait post? Yes, YTA. \n\n*First, y*ou forced your children into a joint party as opposed to celebrating each of them on their own day. (Would it have been that big a deal just to make two cakes? \n\n*Second*, rather than checking the present situation in advance, you *assumed* your family would somehow give equal presents to Amy and to Nora even though they never treated them equally in the past? Why, oh why would you make that assumption? In other words, Nora's discomfort at the gift–opening is on you for managing it poorly.\n\n*Third*, you took your older daughter's gifts and gave them to another person. What on this green Earth were you thinking? Do. Not. Take. Other. People's. Stuff. Didn't you learn that in kindergarten? \n\n*Fourth*, in what universe do you think repurposing your daughter's gifts and making her share her party is going to help your family grow closer? Forced sharing drives wedges between siblings; forced sharing drives wedges between children and parents. \n\nYou need to sincerely apologize to Amy. Then rethink your strategy for blending your families.",
      "id": 148,
      "comments": [
        {
          "score": 884,
          "content": "Not to mention forcing a 15 year old to constantly hang out with a 13 year old. Development happens insanely fast in those years and a 2 year difference is a lot! Telling a group of 15 year olds they have to hang out with a 13 year old is a recipe for bullying",
          "id": 149,
          "comments": [
            {
              "score": 219,
              "content": "One is in middle school and the other in high school (typically). It’s great to be friends at home, but let them have their own friends otherwise!!",
              "id": 150,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 339,
          "content": "You’re correct I’m fuming !",
          "id": 151,
          "comments": [
            {
              "score": 47,
              "content": "Same. This post was one f-up after another, in rapid succession. Ugh.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 306,
          "content": "I wonder often if the victim of TA makes these posts to then go and show TA what an A they are being.",
          "id": 153,
          "comments": [
            {
              "score": 45,
              "content": "I wonder that about AITA sub and advice columns all the time!",
              "id": 154,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "I would have thought that, too; had the OP not answered several comments, damning herself more and more with every word she typed.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 41,
          "content": "I feel like it has to be rage bait because the OP is so overly clueless and big on adding enraging details. On the other hand, awhile back on instagram I saw some lady boasting about how if you invite one of her kids to a birthday party, you have to invite all of their siblings, because *family*. And she had like 7 kids or something.",
          "id": 156,
          "comments": [
            {
              "score": 14,
              "content": "I saw that, too. Obnoxious. No one is required to cater to your entire litter of kids just because their kid happens to be friends with ONE of them. Talk about entitled. Like, don’t be surprised when all 7 of your kids are friendless and they all hate YOU.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "This 100% . Poor Amy",
          "id": 158,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1928,
      "content": "YTA. Everything you’re doing to build closeness (sharing a party, sharing gifts, only letting them go to parties both are invited to) are only going to push them apart. Your lack of understanding that your daughter’s life has been drastically changed too is a serious problem.",
      "id": 159,
      "comments": [
        {
          "score": 336,
          "content": "This. I’m honestly surprised by how mature the 13 year old is. She hid her disappointment over the difference in gifts, but she probably understood that her stepsister’s grandparents and aunts/uncles owe her nothing. And she refused to take any of the gifts that OP stole from her stepsister, because she values their relationship more than the material items.\n\nOP is too busy trying to play one big happy family at the expense of her own daughter and is putting her stepdaughter in awkward situations that could easily mean that Amy starts bullying Nora, but it also seems like Amy has been mature enough to just begrudgingly accept OP’s BS until the last straw.",
          "id": 160,
          "comments": [
            {
              "score": 120,
              "content": "I agree! Nora was so mature.\n\nNora and Amy sound like great kids and OP is failing the both of them.\n\nLike she keeps talking about how she’s doing this for Nora but has anyone asked Nora what she wanted??",
              "id": 161,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1600,
      "content": "YTA, this makes me so incredibly sad for Amy. Others have outlined all the reasons why what you did is horribly wrong\n\nJust to add something others haven’t- your wife isn’t Amy’s ‘second mom’- she’s her stepmom, or, given Amy’s age when you and wife got together, she’s her ‘mom’s wife’ and THAT’S IT. Nora isn’t her sister, she’s her step sister or her ‘mom’s wife’s kid’. That’s it! She doesn’t owe her any sort of relationship or any sort of sibling bond.\n\nIf you don’t share blood, someone becomes your parent because you CHOOSE that in your heart, someone becomes your sister because you FEEL that in your soul. What you’re doing is ensuring Amy never chooses your wife and Nora, and never feels for them what you want her to feel. You’re setting her up to resent them, and ultimately hate them, through every, single thing you’re doing.",
      "id": 162,
      "comments": [
        {
          "score": 277,
          "content": ">If you don’t share blood, someone becomes your parent because you CHOOSE that in your heart, someone becomes your sister because you FEEL that in your soul. What you’re doing is ensuring Amy never chooses your wife and Nora, and never feels for them what you want her to feel. You’re setting her up to resent them, and ultimately hate them, through every, single thing you’re doing.\n\nAMAZINGLY SAID.\n\nEspecially after looking at OP's username.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 148,
          "content": "It’s even sad for Nora. Even she knows better how the adults in her life are doing it wrong.",
          "id": 164,
          "comments": [
            {
              "score": 105,
              "content": "I agree, and Nora will end up being hated by someone who could have been a friend. She’ll feel the resentment which will be coming her way and that will impact on her.",
              "id": 165,
              "comments": [
                {
                  "score": 73,
                  "content": "I would have felt like such a loser if I had a stepmother trying to engineer all this. I can't imagine Nora's happy either.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "I agree with everything said.\n\nAlso, happy cake day!",
          "id": 167,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1353,
      "content": "YTA. You are making your problem, your child's. You are also trying to guilt your family. You should just have bought your step daughter a BIG gift on your own instead of trying to mess up your daughter's birthday.",
      "id": 168,
      "comments": [
        {
          "score": 401,
          "content": "Forreal, like if you care about the gifts so much then just buy her some on your own? Why are you expecting a bunch of strangers to this child to drop hundreds of dollars on her?",
          "id": 169,
          "comments": [
            {
              "score": 105,
              "content": "AND she wants them to spend hundreds of dollars on a girl they more than likely don't know at all.  My heart goes out to Amy.",
              "id": 170,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 183,
          "content": "My grandparents never bought more then 1 gift for my half brother, and he understood that they weren't his grandparents. Where are the step daughters grandparents at?",
          "id": 171,
          "comments": [
            {
              "score": 125,
              "content": "Plus it sounds like the gifts were shipped so how many times has op's family actually met Nora? \n\n2 yrs doesn't sound like a lot but in teenage girl yrs it's huge. They aren't going to have the same friends. Do they even have anything in common?\n\nYou grounded your daughter for doing nothing wrong and actually stole her property. \n\nI know we teach children to share but do adults share everything like we expect kids to do? Do you let people just take your property, car,house,clothes,money? No you don't.\n\n\n\nEdited to add stuff",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1266,
      "content": "YTA. You might think you're doing right but you're going about it a terrible way.\n\nFirstly, I agree with your daughter on the joint birthday party's. Idk if it's just me or how I was raised but to me it just seems lazy at its core. My brother has his birthday 2 days before Christmas, my mum made a point to *NEVER* mix these 2 into 1 for him and would deliberately tell all my family to get him separate gifts for each event. It might be easier for you but in essence you're taking away **their individual** special day.\n\nSecondly, punishing your daughter because of your family's indifference to your stepdaughter? REALLY? They are *HER* gifts, you don't get to demand that she share them and then punish her because she doesn't want to. Are you out of your mind?! She doesn't get her own birthday, now she can't even have her own gifts because you feel bad? **SO YOU FORCEFULLY TAKE THEM ANYWAY** and are somehow surprised your daughter is \"cold\" towards you.\n\nYou say you want them to get along but all of your actions will make your daughter hate Nora because you give her what Amy will perceive as special treatment. You're on the fast track to your daughter moving out as soon as she can and never coming back to visit, so if you don't want that for your future then you best fix your mistakes here.",
      "id": 173,
      "comments": [
        {
          "score": 671,
          "content": "Yeah. Dude your child isn't an emotional support dog for your stepdaughter. If your daughter can make friends, let her enjoy them. If your stepdaughter is unable to make friends, try to get her to be more outgoing, not hijacking on someone else's invites to sleepovers. Do you know what happens when someone is forced to take their sibling every where? People stop inviting them because they can't enjoy anything or say their inside jokes because someone else will be there. Go out to the neighborhood and invite people for your step daughter's birthday, stop making it your daughter's responsibility. It isn't upto her to provide your stepdaughter with friends. Even if it was her own sister, she had no obligation. And if there is another room, give her another room. Stop suffocating the child. You're the reason your family hasn't warmed upto your stepdaughter. Because you're treating the child they love badly. You can just randomly demand they provide gifts for a girl they don't know. But after some time they would have warmed up if you weren't using your own kid as a scapegoat for being popular and social.",
          "id": 174,
          "comments": [
            {
              "score": 65,
              "content": "100% this. Never even touched on the shared rooms but you're absolutely right.\n\nHer attempts to try and get them to like each other is exactly the reason her daughter will grow to resent her.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "“You're the reason your family hasn't warmed up to your stepdaughter. Because you're treating the child they love badly.”\n\nSo true! My dad’s side of the family has never liked me and they treat my siblings way better. So to make up for it, my mom’s side of the family is really nice to me. People notice this stuff.\n\n(I am not a step-child. I am biologically related to my parents, siblings, and extended family)",
              "id": 176,
              "comments": [
                {
                  "score": 16,
                  "content": "Plus poor Nora was put in a very awkward situation. She looks upto her stepsister, so knowing that she is only hanging out with her because of the mother is upsetting. Which is hundred percent not Amy's fault. OP caused this.",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Maybe Nora doesn't want more friends. Maybe she is an introvert who is happier that way an OP is forcing her into situations with Amy's friends she doesn't know and possibly doesn't like who may resent having to include their friend's younger stepsister. And it's not like all teenagers can keep thay resentment under wraps. I feel bad for both Amy and Nora. Also, your family is not obligated to give presents to Nora. Maybe do more things with both families so that everyone is included.\n\n**Edited to fix typo because my thumbs are dumb.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "You make so much sense! Amy is probably saying offhand how she really would have wanted her own party and other things to these relatives that her mom is doing to her and they are just trying to make her feel better by doing the only thing they could buy her some nice presents just for her. All this further alienating Nora and her mom from OP’s family.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 163,
          "content": "100% agree, the joint party was mom’s idea not theirs. It would be different if they were like cool let’s do this together but if has been imposed and their day taken away. As a fellow Xmas babe, I know the struggle of bday being overshadowed \n\nHow mom didn’t anticipate there could be differences in what the family gives shows how ignorant she is being. Sure it’s lovely when blended families go smoothly but on some level extended family are always going favor, especially when it’s new and they have no relationship. \nMom is totally YTA here",
          "id": 180,
          "comments": [
            {
              "score": 37,
              "content": "You have my thoughts as an Xmas child, I understand 🙌.\n\nAnd I didn't even touch on the fact she won't let her daughter go out to something if her stepdaughter isn't invited as well. I get you want to make sure one of your kids aren't excluded in everything but by punishing her daughter this way, she's almost ensuring her daughter will end up hating her step-sibling.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "I have a question… why doesn’t it seem the mother of Nora is involved in this story?",
          "id": 182,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 652,
      "content": "YTA. Amy has had her life severely changed in the past year. From being the only child and living with her mom (getting all your attention) to living with two strangers and having to adjust to a new family dynamic (and therefore, less of your attention). She now has to share a room with a stranger, have this stranger invited to all activities she goes to, and if Nora isn't invited then neither of them can go (?!). Her entire sense of individualism is being stripped of her. \n\nYou should've asked the girls (separately) before hand if they wanted a joint party, and not to mention, you should've just looked in the bag ahead of time to see the gifts (or taken some of your own money and bought Nora her own gifts!!!!). YTA for asking her to share the only things she has to herself. If you really felt that bad for Nora, you and Jenna could've bought her her own gifts with your own money. Remember, this is new for your side of the family too, and since you mention most of them live out of the country, I'm assuming most of them haven't even met Nora and don't know her that well, so why would they spend hundreds of dollars on a child they don't know? \n\nPlease apologize to your daughter and let her live her life independently of Nora. Forcing them to be friends and forcing Amy to share her gifts with Nora is not only going to create resentment towards Nora, but you as well.",
      "id": 183,
      "comments": [
        {
          "score": 205,
          "content": "Agreed. Blended families don’t mean blended birthday or identities. YTA OP",
          "id": 184,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 116,
          "content": "Great response. I'm so horrified by this if Nora isn't invited you can't even go bull. They aren't even the same age! She's forcing this poor girl on everyone and I'm sure it makes her uncomfortable",
          "id": 185,
          "comments": [
            {
              "score": 41,
              "content": "That is absurd. A group of 15 year olds presumably freshman/sophomores don’t want to be forced to hang with middle schoolers.",
              "id": 186,
              "comments": [
                {
                  "score": 36,
                  "content": "Seriously. Maybe get Nora involved in some extracurriculars/sports/some kind of hobby that she's interested in? Rather than ruining Amy's friend dynamics. It will also put strain on Amy and her friends because now every time they want to do something they know that her little sister will have to tag along. Won't be soon before Amy loses her friends to this too.",
                  "id": 187,
                  "comments": [
                    {
                      "score": 28,
                      "content": "And Amy will hate OP, OP’s wife, and Nora.",
                      "id": 188,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}