{
  "post content": "My gf and I have a child, due to financial issues we haven’t been able to live together until now. She’s been vegan about a year, and wasn’t when we met, I have always been an omnivore and never suggested that would change. Now that we found a place, she now says that she doesn’t want to live with me if I don’t agree to go vegan. I responded with [this](https://i.imgur.com/rd4a9Ck.jpg) after my frustration reach epic levels AITA?\n\n**Edit**: our child is being raised vegan against my wishes but in the interest of compromise I leave it alone and made sure our child eats as complete a diet as possible. \n\nCurrently I only eat meat 2-3 days a week at most. I already agreed not to eat meat around here, my meat eating at “our” place would be limited to when she isn’t there. \n\nI forgot to mention I have a child from a previous relationship that will be living with us, and that child is expected to go vegan as well.\n\n**Edit 2**: I agree with anyone that says my response was immature and counterproductive.\n\n**Update 1: we spoke and this summarized what I said:**\n\n“Yesterday doesn’t sit well with me, your attitude towards it is controlling, and the fact you’re not willing to even explore compromises is troubling. For instance, the few times I eat or cook meat could be done when you aren’t home, I could get a small bar fridge to store meat, there’s a million solutions that could have been discussed if you really wanted this to work. Your attitude surrounding it is controlling and unreasonable, I am asked to make incredible sacrifices because you’re unable to compromise, or unwilling to. This will become a pattern, because you know I want this more than you, and you won’t have to compromise cause I’ll cave to have our family.\n\nYou have a right to state how you feel, as I do. If you choose to ignore my feelings entirely up to you. But the lack of communication about this isn’t going to change anything. I want you and this family, but I’m not rolling over and changing every time you decide you believe in something else, compromise is a two way street, and if we aren’t going to walk it together as equals, in ideas, feelings, respect, and communication, then we say goodbye now. “\n\n**Addition: I feel like I should add this reply I made to a militant vegan here **\n\n~~https://reddit.com/r/AmItheAsshole/comments/d2bg73/_/ezuc01f/?context=1~~\n\nI replied to the wrong comment and now I can’t find it.\n\n**Update 2:** All she’s said to me is “I’m dreaming of a future that I won’t have. “ not sure what that means but I don’t want to go down any more rabbit holes today. I think I’ll try tomorrow evening to talk to her, I’ll give her time to consider my words abs to collect her thoughts. Right now I want to think about everything that’s been said here, specifically about my younger child being vegan, my family, what’s best for everyone, and most importantly what kind of future do I see with her right now.  I’ve read every comment, and this has turned into a very spirited debate. I believe there’s merit to reducing meat intake for your health and for the environment, but I don’t believe in extreme knee jerk reactions to anything. I have reading to do..\n\n**thoughts:** I am not criticizing vegans, and in the reply (to the wrong comment) that’s causing me to get hate mail, I was referring to a specific subset of vegans, I would have expressed similar sentiments to a religious fanatic that was forcing his or her beliefs to me. \n\nI support her right to live the life she wants, and to eat what she wants. I want the same accommodation. \n\nWas I the asshole here? IMHO Yes in some ways I was. Is she the asshole for the ultimatum? Possibly. What I know for sure is I don’t think I’ll ever understand how this “lifestyle” and diet is a reasonable justification to change the nature of the family at its core. \n\nSome have called me a pushover, that may be true, but I’m trying my best to navigate waters that are unfamiliar to me, and to make the best decisions for me and my family.\n\nI am reading most of your comments, and to those who say I’m being intolerant, I’m not, I’m seeking compromise. To those who say a child should be raised as a vegan, I agree and have from the start, that choice was made unilaterally and the safe guards and information gathering  we agreed to hasn’t happened.",
  "id": 1,
  "comments": [
    {
      "score": 8789,
      "content": "NTA. You have a child together and she's refusing to combine your households just because of some stupid food.\n\nShe needs to compromise. Maybe get a mini-fridge for your meat products. She's trying to push her food choices onto you, that's controlling.\n\nYour text of course wasn't nice but I get your point and that she pushed you to that state. She really is prioritizing something stupid over her family. Nobody is forcing her to eat meat.",
      "id": 2,
      "comments": [
        {
          "score": 2061,
          "content": "Excuse me if I'm wrong but I'm curious, isnt it important for that kid to eat meat and things like that",
          "id": 3,
          "comments": [
            {
              "score": 2513,
              "content": "Yeah, unless the parents are super heroic it can be hard for kids to get the nutrients they need without meat products.  It takes a lot of extra work. \n\nVegetarianism is a lot easier on kids. You can still eat cheeses, milk and eggs, butter, etc, all common and easy sources of essential fats and dense energies.",
              "id": 4,
              "comments": [
                {
                  "score": 592,
                  "content": "Ohh, ok thanks for the answer, I thought I was about to get downvoted asf cuz its reddit, but damn thanks for that explanation",
                  "id": 5,
                  "comments": [
                    {
                      "score": 449,
                      "content": "Reddit is anti-vegan. According to the ADA:\n\n>Well-planned vegetarian diets are appropriate for individuals during all stages of the life cycle, including pregnancy, lactation, infancy, childhood, and adolescence, and for athletes.\n\n[Source](https://www.ncbi.nlm.nih.gov/m/pubmed/19562864/)",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 24,
                      "content": "It's true. Vegetarian diets are good enough for kids. Back here in India, a majority of our populace is vegetarian due to religious beliefs and kids do get the necessary nutrients from a staple indian diet.\n\nIn fact, I was a vegetarian till I was about 12 as well up until I had an awakening and met my one true love i.e. Chicken.\n\nThe substitutes for going full vegan are just too damn expensive at least in India. \nPlus I'd never abandon my Butter Chicken",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Yes, it is dangerous to even potentially question the \"wisdom\" of vegetarianism on Reddit.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Reddit is very anti vegan. What people don't realize is that a diet itself cannot be healthy or unhealthy. Just because you're a meat eater, doesn't automatically make you healthy. Case in point, MOST people in the US aren't vegan yet MOST people in the US have heart disease, cholesterol, hyper tension.... so just like being a meat eater doesn't guarantee health, being a vegan doesn't mean illness- it depends on how you feed the child. Are you feeding them real, nutrient dense fruits and vegetables, or are you feeding them fake soy-crap? If you are a meat eater, are you feeding the child local, organic, pastured-raised, grass-fed meat, or are you feeding them supermarket hot dogs? It all depends.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "What, you thought the whole of reddit was vegan?",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 90,
                  "content": "[deleted]",
                  "id": 11,
                  "comments": [
                    {
                      "score": 79,
                      "content": "As someone whose parents went through a vegan phase (thankfully they didn't stick with it), I would disagree with you. If you want your kid to go that route then at most go for the vegetarian diet, your comment itself does a very good job of portraying how much of a chore a vegan diet can become, especially for a kid who doesn't know better and HAS to follow what mommy and daddy tell them. I remember every breakfast having a basket on the table with a bunch of supplements and my mom getting on my case for not \"taking all my vitamins\".",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "If it's not that hard, why is it every other day that a news article comes out that a vegan family kills their child due to malnutrition?",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "Have you tried raising a young child vegan?\n\nBecause if you haven’t, then no offense, you have no idea what you’re talking about claiming it’s “not that hard.”\n\nYoung kids are picky AF. They will choose not to eat anything. They will scream and fight and make you late for work.\n\nYour entire comment assumes rationals actors. Kids are not rational actors.",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "The fact that you have to take anything as a supplement kind of proves that it's not a *great* diet.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 54,
                  "content": "I don’t know how true this is but I’ve heard those who are raised vegan, can’t process meat later in life so the parent would be making a life long choice for their kid before they are able to decide what they want to do.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 67,
                      "content": "That's true for anyone who doesn't eat meat for a number of years. It can be done again but it's a slow process as the body isn't used to digesting animal products and can make them feel very sick.\n\nI'm not vegan or vegetarian but I know a lot of people who were vegetarian in high school and later in life tried to eat meat again but couldn't stomach it. I only know one who actually eats meat again.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "I'm essentially a vegan (not by choice but by life-threatening dairy allergies and being vegetarian). I do have some immune system issues bc of my allergies but for the most part nutrient-wise I've been doing okay, there are many alternatives to dairy and meat products out there. I do need to take them in quite frequently (tbh I don't exactly know what frequently is compared to most diets) but so far I haven't had much need for supplements and maintain a fairly health diet.\n\n&#x200B;\n\nBut yes, it's a LOT of work. From birth I've basically only eaten homecooked meals and ready-made snacks (again, mostly because allergies make cross-contamination an issue) but I can imagine that children that are vegan require a lot of extra care if you  take it very seriously (based off of experience).",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "my toddler has always refused to eat meat in almost any form, and it's been a struggle at time. He eats a LOT of eggs and hummus. I still try to sneak meat into things occasionally because I don't want him to lose the ability to digest it and get really sick if he tries it in the future, because apparently that's a thing that can happen (although I haven't researched it deeply). If he wants to be vegan or vegetarian when he's older I will support it completely, but I want that to be HIS informed choice.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I'm curious how this:\n\n> unless the parents are super heroic it can be hard for kids to get the nutrients they need without meat products\n\nand this:\n\n> Vegetarianism is a lot easier on kids. You can still eat cheeses, milk and eggs, butter, etc, all common and easy sources of essential fats and dense energies.\n\nmatch up. For example, cheese isn't a \"meat product.\" Why wouldn't a vegetarian diet for children require \"heroic\" efforts as well if \"meat\" was so important?",
                  "id": 20,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 176,
              "content": "Considering that \"financial issues\" are a thing for OP and gf yeah, yeah it is.  Healthy veganism is *expensive*, doubly so for a growing child.  So the kid's almost guaranteed to be malnourished if the gf is raising it vegan.",
              "id": 21,
              "comments": [
                {
                  "score": 142,
                  "content": "[deleted]",
                  "id": 22,
                  "comments": [
                    {
                      "score": 142,
                      "content": "Unless you live in a food desert. Over 23 million Americans live in areas with limited access to affordable and nutritious food and more than half of them are low income. Healthy veganism in such places would, I imagine, be pretty expensive.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Ok. It you can’t expect a little kid to just eat beans tofu and vegetables that’s just mean",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 96,
                  "content": "[deleted]",
                  "id": 25,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Absolutely this. I have celiac disease and people are always telling me how expensive that must be, having to buy all those gluten free foods. They’re talking about bread, pasta, cookies, all prepackaged foods. Being gluten free is no more expensive than eating a normal diet if you stick to foods that are naturally gluten free like fruits, vegetables, rice, tofu, and for omnivores like me, dairy and meat.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "Oh yeah, just shove a pill down a kid's throat.  Because we all know just how well kids take to that kind of stuff.\n\nHowabout do the sensible thing and just feed the kid like a normal human instead?",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 65,
                  "content": "This is not true at all. Whole food veganism is considerably cheaper than eating an omnivorous diet. The majority of calories for vegans come from cheap things like rice, beans, lentils, peas etc. Add some fruit and vegetables, which a healthy person should eat either way, and you have a complete diet.\n\nThe idea that veganism is expensive is myth not at all based in reality.",
                  "id": 28,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "Explain how meat and cheese are less expensive than vegetables lol. Have you ever grocery shopped before and bought vegetables? Genuinely wondering now 🤔",
                  "id": 29,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "What are you talking about?! Vegan food is the cheapest food out there..",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 117,
              "content": "The kid can get protein from other non-meat sources but the big issue here is that the vegan girlfriend is forcing her lifestyle on everyone without any room to compromise about it.  That's shitty, controlling behavior & I'm with OP, she either learns to compromise or the relationship is over - if she's this bad about dietary choices, who knows how bad she'll be (or already has been) in other aspects of their lives.",
              "id": 31,
              "comments": [
                {
                  "score": 3,
                  "content": "Yes, here we are back to the topic. I forgot it.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "Vegetarian and vegan diets can certainly go wrong but keep in mind that a healthy diet isn’t dependent on the inclusion of meat. People are quick to talk about protein and B12 (which I won’d disagree is important) but there are plenty of kids eating a worse diet of fast food , sugary cereals, and barely any veggies. And I’d argue that that’s a MUCH bigger issue.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "not necessarily.  it will be harder to provide a more balanced diet potentially but its certainly not impossible to do",
              "id": 34,
              "comments": [
                {
                  "score": 61,
                  "content": "It also matters for your genetic heritage. I am from an island nation and for me. Vegan is not possible. I tried when I was dating a girl who was a pro vegan. It just didn't work. I got sick real fast and was never feeling healthy. Some people can't do vegan. For instance the Inuit people have sustained them selves on a diet of mostly seal fat for thousands of years. Because of this most Inuits can't be vegan.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Not saying you're wrong, because I don't know anything about what you're saying, but a lot of people feel shitty while their body adjusts to the vegan diet and a lot of people become ill eating a vegan diet because they aren't making sure they are eating the right foods (to get everything they need). Certainly a vegan diet needs some thought if you're going to do it, and I guess even more thought if you have special dietary requirements due to genetics or health issues.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "This is interesting, and seems like something that would be interesting to pursue. A proper vegan diet shouldn't be a whole lot different macros besides higher in different amino acids and probably higher carbs. Were you making up for fats? What animal producys do you eat right now and how much?",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 22,
              "content": "It’s not completely necessary. My personal views are that kids should be exposed to as many different things as they’re willing to consume, but I know many people who have a restricted diet for whatever reason and their child, by proxy, tends to eat the same way since most families aren’t cooking two separate meals. As long as vitamin levels are good and there’s healthy variety, they don’t ~need~ meat or dairy.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "All of this thread is false. Beans are great, legumes are great, a shit ton of meat eaters have absolute garbage diets. Vegans need to be similarly as careful as everyone else. Take your vitamins, don't eat prepackaged garbage and your probably fine. We're fucking omnivores we DON'T NEED meat. \n\nIf she went vegan for moral reasons you really need to address those differences. I think this is INFO. What's her side, because that's an asshole text.",
              "id": 39,
              "comments": [
                {
                  "score": 47,
                  "content": ">If she went vegan for moral reasons you really need to address those differences.\n\nWhy?  People's moralities are different.  You can't force other people to abide by your own personal morality.  He's already going above and beyond by offering a second fridge and cooking meat when she's not in the house.  Fuck that noise.  Don't want to eat meat for whatever reason?  Fine.  Leave other people alone.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "Not really. \n\nIt is possible for a kid to have a complete plant based diet. Ill bet dollars to Donuts that someone in your family tree was poor serf who only lived on bran porridge for years.",
              "id": 41,
              "comments": [
                {
                  "score": 7,
                  "content": "Serfs actually ate healthy. You can find a lot of studies and discussions on it. Will caught game and fish were eaten about once a day, along with hearty breads and greens from the garden.\n\nLords ate like shit. Refined breads and meats, constantly.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I mean, I doubt that serf was super healthy. Until the consequences of b12 deficiency were discovered, there were a whole lot of people misdiagnosed with dementia",
                  "id": 43,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "A vegan diet can be healthy in all stages of life- seeing a plant based dietician is recommended.",
              "id": 44,
              "comments": [
                {
                  "score": 49,
                  "content": "> seeing a plant based dietician is recommended.\n\nRecommended is a bit light. If you are not seeing a dietician (or are one) it is likely (depending on it's age) you are undernourished the child and thus abusing the child",
                  "id": 45,
                  "comments": [
                    {
                      "score": 31,
                      "content": "[deleted]",
                      "id": 46,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 23,
                      "content": "A huge portion of the population is failing at basic nutrition. \n\n> [Some 85% of Americans lack essential vitamins]\n(https://www.theguardian.com/lifeandstyle/2015/feb/10/nutrition-hunger-food-children-vitamins-us).\n\nIt's a lot easier to avoid malnutrition when you actually pay attention to what you eat, where it came from, and what it's made of- like vegans have to do by default to actually be vegan.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Lmao you are misinformed and pushing ignorance. This sub has a hard on for hating on vegans lately.",
                      "id": 48,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "[deleted]",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "There are many healthy vegan kids and it’s totally possible to have a balanced diet as a vegan and grow strong. There are far more unhealthy non vegan kids out there than unhealthy vegan kids. *from an omnivore\n\nEdit: this whole “you have to eat meat and dairy to be healthy and balanced” is total bullshit and I get so tired of hearing it. Yes, there are shitty vegans out there. But there are tons of shitty omnivores as well and repeating bullshit lines like the above when they’re untrue is shitty.",
              "id": 50,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 360,
          "content": "[deleted]",
          "id": 51,
          "comments": [
            {
              "score": 54,
              "content": "All kinds. This is a power play. When they break up...and they will this will be a wedge used by the mother to interfere with custody and visitation. It is also easier to alienate the father due to an us and them view point. It was one of the things used by the mother of my kid to attenpt to prevent her from going to family events or even to restaurants. Its changed now. Vegan options.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "[deleted]",
          "id": 53,
          "comments": [
            {
              "score": 6,
              "content": "I had a buddy in college whose LDGF wouldn’t let him eat meat.\nObviously he still ate meat all the time. Like ALL THE TIME. But then when she’d visit he’d go full vegetarian and would tell all of us to make sure we didn’t let her know that he ate meat.\n\nI really couldn’t grasp it. I told him he had to break up with her and he didn’t understand why.\n\nNobody but my mother gets to tell me what I can and cannot eat and even she hasn’t done so since I was like 12 - that shit is so fucked up. Unless you’re allergic, how does it affect you in any way what someone else eats?\n\nFWIW my buddy broke it off with her ~a month later because she was a psycho and cheated on him... I was a supportive and comforting friend but definitely got in an “I told you so” or two",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "It's probably not just about food. Being vegan can be about morals too. INFO. Compromise is definitely a thing, but is she doing the cooking and you're making her cook meat or do you cook your own meat meals? Are you forcing your kid to pick between the two diets? INFO",
          "id": 55,
          "comments": [
            {
              "score": 22,
              "content": "This — controlling someone’s diet is one thing, but I totally understand wanting your partner on-board with your moral decisions.\n\nVegans think eating meat is on par with murder. She’s justified in putting *her* kid on a vegan diet and wanting to live in a vegan house.\n\nWhat bothers me is how all-or-nothing she was, and that she waited until they chose a house to be this way. If going vegan was a condition of moving in together, she should have voiced that ages ago. And then maybe they would have decided to keep dating and not move in together.\n\nThis is both ESH and NAH. I don’t think the GF is a jerk for wanting to live in a meat-free home, but she’s a jerk for how she went about it. OP isn’t a jerk for not wanting to change his diet - that’s his choice! - but his reactions are rude.",
              "id": 56,
              "comments": [
                {
                  "score": 51,
                  "content": "Just a thought, it's not just her kid. It's their kid. It sounds like he agreed because he felt he didn't have another choice. Both parents should have a say in the diet an upbringing if their child. \n\nIf they're not married, and have no legal custody agreement he would be screwed if she decided to up and leave with their child because he pushed back on the veganism. Depending on the state you're in fathers in non-martial relationships can find out they have very few assured rights to their children. It can just be easier, and safer, to acquiesce to your partners wishes in these situations, no matter your concerns.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "it’s his child as well.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 15,
                      "content": "And she’s also forcing OP’s other child, who’s not related to her, to go vegan? Fuck that.\n\nThat’s just one way to make sure your stepchildren will resent you forever. I know that because my mom and dad broke up when I was just a few years old and my mum started dating her current husband a few years later. Now I don’t have any complaints towards him because he was always nice with me and never forced anything on me. But I still felt that feeling like he’s trying to replace my real dad and I did not like it. I didn’t really warm up to him until quite a few years later. If he had forced shit like that on me though, I would have hated him forever. And I can guarantee you that OP’s child will feel the same towards her if she starts forcing things on the child.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "He cooks his own meals. He won't even cook when she's in the house. It's stated in the post.",
              "id": 60,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Text is 10/10, conveying completely justified anger in a humorous way.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "OP is definitely NTA. She’s being selfish in not wanting to compromise and OP is 100% correct that this will spill over onto everything. Being vegan is a choice not a freaking religion. My husband and I choose to eat mostly vegan meat alternatives but I would never tell him not to have his occasional ribeye. That would be selfish and ridiculous.",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "NTA, fuckin vegans man.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "> She's trying to push her food choices onto you, that's controlling.\n\nI can't imagine being with someone who would try and control my food choices in my own home.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I'm vegan too and my wife eats meat. I went vegan a few years after we got married. She has seen the same information I've seen and come to a different conclusion. I respect that. We assumed some natural boundaries to make it work. I don't cook anything not vegan. I don't give her a hard time about it. Respect is part of love. And honestly it says a lot that she won't even show you that much respect.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4236,
      "content": "NTA My wife is vegan and she will only cook vegan so I eat about 95% vegan. She is cool with me cooking and grilling whatever I want, but I only bother once a month or so. If we go out or order in she is fine with me eating meat/cheese. If your girlfriend is going to be that much of a stickler with zero compromise I say head for the hills.",
      "id": 66,
      "comments": [
        {
          "score": 1545,
          "content": "Agreed NTA. This is exactly the way my boyfriend (omni) and I (vegan) are. Since I do most of the cooking, he eats entirely vegan at home. He could cooke meat at home, but can't really be bothered. When we go out to eat or go to a friend's house, he always chooses meat however. It's an easy compromise for us. In my eyes, its a huge win because he's eating way more vegan meals than he may have otherwise and I will take what I can get!",
          "id": 67,
          "comments": [
            {
              "score": 629,
              "content": "Hello, reasonable person. We don’t see your kind very often.",
              "id": 68,
              "comments": [
                {
                  "score": 232,
                  "content": "Most vegetarians don’t force their agenda on others. It’s just the ones that do are very vocal. Being a vegetarian, I do it for environmental benefits but I also just don’t like meat that much. That being said, I would never force my belief on someone else, and from my experience, most vegans/vegetarians don’t",
                  "id": 69,
                  "comments": [
                    {
                      "score": 85,
                      "content": "[deleted]",
                      "id": 70,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 60,
                  "content": "Oh they exist. They’re just busy doing their own thing, being reasonable and compromising, and most people aren’t the least bit bothered by that. \n\nIt’s the in your face, militant ones that people judge vegans/vegetarians by, unfortunately. Fortunately, most vegans/vegetarians I know are more like this person. I like meat, but I’ve been trying to cut back on eating it as much, too - and my friends are always happy to share great vegetarian recipes with me.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "You do *see* them very often you just don't hear them because they keep it to themselves. Very few vegans will call you an animal murderer, what they will do though is give you a very clear understanding of the environmental effects of a meat-based diet, inhumane conditions in slaughterhouses, information on how to get all amino acids from plant proteins, and delicious vegan recipes. I lived with a vegan for three years and he was a great dude, never preachy or condescending but extremely helpful on so many social and political issues. Because of him I eat *far* less meat than I used to and have become overall more conscious of my diet.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 127,
              "content": "I was an omni, love cooking all the things.  What it is, doesn't matter.  I particularly like cooking for people I'm dating.  Fancy breakfast is my go-to move after a night together.  Dinner is great.\n\nDated a girl who was vegan for a while.  Cooking for her was fairly easy as curries offer a lot of options, are not super difficult, and a pretty fun.  Plus I was going through an Indian cuisine phase because most of the engineers I worked with were from India.\n\nMan I missed real cheese though.  Steak, chicken, brats, all those are O.K. but I could live without.  Cheese tho?  Not so much.",
              "id": 73,
              "comments": [
                {
                  "score": 97,
                  "content": "Cheese is the number one reason I haven’t gone vegan from vegetarian. It’s just too good",
                  "id": 74,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Same.  Vegetarian for 24 years but never tried vegan because cheese.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Same. Cheese is my vegan Waterloo.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "Found the Wisconsinite!",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I could go vegetarian. But you’ll take my eggs and cheese over my dead body.",
                  "id": 78,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "I love your POV :)",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Same here but then vegetarian. When my omni BF and I are at home together we eat vegetarian (or vegan). When we're not, he eats whatever. Every meal veg/vegan more is better!",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "This exactly. My partner and I are omni but had a vegetarian flatmate and we liked to do shared food and cooking. It was never any problem for us to happily eat and cook vegetarian 95% of the time, and equally she was totally happy for us to cook up our own meat separately every now and then, or order meaty dishes if we were getting takeout.\n\nWe were respectful of her preferences, would never expect her to handle or come in contact with meat and were super careful of cross contamination, etc, and she was respectful of ours if we wanted to make our own meat dishes.\n\nIt's almost like it's possible to respect and observe someone else's preferences while also sticking to your own 🤷‍♀️",
              "id": 81,
              "comments": [
                {
                  "score": 2,
                  "content": "Agree, it's really simple to be respectful of people's, especially your partner's, beliefs. I hosted a work BBQ and most are halal. I bought halal burgers for all, heated up my BBQ for an hour to burn off anything. I checked with everyone else and they were okay to eat those. I appreciate that's very different then being vegan or vegetarian, but it's the same concept, you can always be respectful and compromise.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "and that is what a HEALTHY relationship looks like :-)",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I'm vegetarian borderline vegan and my husband is an omnivore. If he cooks he makes me stuff I can eat, if I cook I make stuff he can eat and even meat of he wants it. It's really not that difficult to compromise if you love one another. Neither of us has EVER had an issue with what the other one eats. Mutual respect and compromise is where it's at, same if you like different types of movies or comedies ffs. OP's chick is a drama filled pain in the ass and only willing to have things HER way even though she is outnumbered. I would definitely not want to live with someone like that and don't think he should either because she is going to look for things to get upset about. Screw that.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 223,
          "content": "And keep in contact with your child's pediatrician. You have to be careful with a vegan diet with kids.",
          "id": 85,
          "comments": [
            {
              "score": 47,
              "content": "[This recent case](https://www.abc.net.au/news/2019-08-22/sydney-parents-escape-jail-over-malnourished-child/11260192) in Australia highlights how dangerous it can be.",
              "id": 86,
              "comments": [
                {
                  "score": 84,
                  "content": "That was a clear case of neglect - the \"vegan\" thing was tossed on top to make it sound extra salacious. Meat-eaters abuse/neglect their children too.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I get what you're saying, but it was the parents' restrictive dietary ideology that hurt that child. This is intentional dietary restriction upon a person who had no other choice. Doesn't matter what the diet (vegan or anything else) is, but it's still fucked up.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 62,
                  "content": "Is it not abundantly clear by now that for every case of 'vegan malnourished baby', there are probably dozens/hundreds more of 'omnivorous malnourished baby'?  Bad parenting is bad parenting, period.  Most babies on a healthy diet are automatically vegan their first year anyways, as breast milk is vegan.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 19,
                      "content": "im sorry if i'm stupid but isn't breast milk an animal product, seeing as humans are animals? Like obviously they don't have to cause animal suffering to get it but it's biologically still an animal product right?",
                      "id": 90,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "You have to be careful with a vegan diet with adults, kids who are known to be super picky eaters in general, like many times the carefulness required.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 162,
          "content": "Came here to say this. I eat a keto diet for medical reasons, my wife eats a pretty standard omni diet. I do most of the cooking and grocery shopping for our household. I generally cook keto meals (like pot roast with veggies, burger patties and salad, etc) and I buy easy, quick starches she can make for herself as needed, or she gets her own starches if we shop together. The meals I cook are arguably 'complete'. But I don't pitch a hissy about buying her a loaf of bread or a couple of potatoes or whatever when I run to the store. I even made her homemade cupcakes and cornbread from scratch for her birthday, because it's what she wanted and it made her happy. \n\nAdults compromise. There are days that it sucks to have delicious crusty french bread in the house, but I'm a reasonable adult/not an asshole and I would never insist on imposing my diet on another person. (That said, she's also not an asshole and won't eat that stuff in front of me if I ask her not to.) If she wants spaghetti and marinara, or a meal entirely of tater tots or whatever else, she makes it for herself. And I don't act like a dick about it. She also doesn't act like a dick if she wants waffle fries instead of oven roasted brussel sprouts and cauliflower. Because again, adults. \n\nI also hope that OP's kid's pediatrician is in the loop and on board with the kiddo eating vegan. It is entirely possible for kids to get a complete, nutritious diet while vegan, but it is HARD and kids are picky, making it even harder.",
          "id": 92,
          "comments": [
            {
              "score": 7,
              "content": "But this is different because veganism is usually from a moral standpoint. So why would you be mad at her for buying starches, if it's only for your health and not because of ethics?",
              "id": 93,
              "comments": [
                {
                  "score": 12,
                  "content": "\"Only\" my health-- me surviving-- vs some moral soapboxing...? \n\nPlease tell me this is poorly written sarcasm.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 2,
                      "content": "[removed]",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "This. I was a vegetarian for about 14 years, and that only ended a few years ago. I've been with my partner for almost a decade. I never would have even thought about asking him to go vegetarian. It really wasn't my business, and as we tend to cook seperate meals anyway it didn't affect me when he made meat. (Except when he made fish...so smelly, lol.) He did get a taste for dishes that skewed more toward being vegetarian just by being around me, but I never asked him to make more vegetarian meals. \n\nOP, I'm sorry you're going through this. Militant vegans can be a lot to deal with, especially when they first get into it. I have many vegan friends who don't even really talk about it (and I only discovered their veganism when over at their homes for meals - which were delicious!), so don't let your girlfriend give them all a bad name, but she is being utterly ridiculous.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "This is exactly how healthy relationships do it. My friend is vegetarian (ex-vegan) and her husband is omnivorous. They cook vegetarian together, he occasionally cooks meat, when they go out she orders vegetarian and he orders whatever he wants.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2219,
      "content": "NTA because you told her the truth. She's telling you to either live her new lifestyle or you can't be a family. Garbage like this is why vegans get so much shit.",
      "id": 98,
      "comments": [
        {
          "score": 824,
          "content": "I don’t get why OP just can’t force her to eat meat or they can’t live together. Same thing. Problem solved.",
          "id": 99,
          "comments": [
            {
              "score": 307,
              "content": "Your polished sarcasm is lost on these louts, but I see you.",
              "id": 100,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 46,
              "content": "That’s the part that gets me. I don’t think anyone has an issue with the gf being vegan, but why does she need to force everyone around her, including OPs other child, to go vegan too?   \n\nI don’t eat shrimp. I never had an interest and the one time I accidentally ate a piece, I got a small allergic reaction so I just stay away from it altogether.   \n\nMy spouse loves shrimp. He is free to cook it anytime if he wants, my son loves it too. I’ve told them both if they want to make something with shrimp, I’ll just plan to make something for me, no problem.   \n\nI don’t get this attitude of forcing others into your lifestyle. If OP was forcing vegan gf to eat meat, no one would think that is okay, either.",
              "id": 101,
              "comments": [
                {
                  "score": 22,
                  "content": "> why does she need to force everyone around her, including OPs other child, to go vegan too?\n\nIt's because veganism is rooted in morality. She wants her family to be vegan for the same reason people want their families to be part of their religion; in her eyes OP and his child are immoral for *not* being vegan.\n\n(For the record, I think this is absolutely ridiculous, just trying to explain the thought process. I know a *bunch* of vegans and they've explained this to me over time.)",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Not that the gf is in the right here, but the comparison to shrimp is not the best. In your case, it's a food allergy. In their case, it's an issue of morality. The gf thinks that consuming animal product is morally wrong. Wanting your spouse (and your family household) to behave in a way that is at least vaguely in alignment with your own morality is understandable. That's not the issue. The issue is that she started trying to enforce this after they had a child. Asking your partner to change their behavior to fit your morals is a thing that needs to be done before your lives are permanently entangled through children or marriage. And if that's not possible because your morals changed afterwards, you got to give a bit more leeway than at the beginning of a relationship.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 117,
          "content": "It's really is the pretentious moral superiority in their attitude that causes the vast majority of the problems.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Of course there are some righteous vegans out there, but also there are non-vegans who assume that every vegan is righteous and assume the worst.  The problem here isn't that GF is vegan, it's her power-hungry attitude.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 954,
      "content": "NTA\n\nBeing vegan is a personal choice. You don't have to be vegan just because of one person.\n\nMaybe you can negotiate with her, you continue omnivorous, but you will not have animal products at home.",
      "id": 106,
      "comments": [
        {
          "score": 708,
          "content": "That's still a ridiculous compromise imo.",
          "id": 107,
          "comments": [
            {
              "score": 251,
              "content": "Yeah, I’m not anti Vegan or Vegetarian or anything, but OP has already offered greater compromises than I would be willing to.",
              "id": 108,
              "comments": [
                {
                  "score": 159,
                  "content": "Same. I would not tolerate someone telling me what I can and can’t eat *in my own goddamn house*.\n\nObviously not the same thing but, I absolutely hate bananas. I find even the smell of them repulsive, and seeing someone eat one makes me want to gag. When my fiancé (who loves bananas) and I moved in together, there was no way in hell I was even going to suggest him not being allowed to have bananas in our house. Cause it’s *our* house.",
                  "id": 109,
                  "comments": [
                    {
                      "score": 27,
                      "content": "But I bet he’s considerate of your feelings anyway and keeps bananas to a minimum around you. That’s what you do when you care about someone. OP is very willing to be considerate of her choice, and she’s being totally unreasonable. Sounds to me like she’s using the child as a pawn to see how much she can control him.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Exactly. I wouldn’t be okay with that either. I hate shrimp, possibly allergic. But spouse and son love shrimp. I have no problem if they want to cook shrimp, as long as it doesn’t trigger an allergy attack (it’s a mild allergy), or some safety issue, people should feel free to cook whatever they wish in their own house.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 370,
          "content": "[deleted]",
          "id": 112,
          "comments": [
            {
              "score": 153,
              "content": "Agreed. I know OP doesn’t want to probably have two kids with two different women, but if you go back on OPs post history, and read some texts between the two, she seems exhausting and doesn’t respect OP in the slightest. She basically harassed him about it for potentially hours. This looks like it was a year ago so if this is a regular thing for OP then I’d be emotionally dead from how drained I’d be.",
              "id": 113,
              "comments": [
                {
                  "score": 79,
                  "content": "Holy shit. I could only read half of that before just giving up. \n\nThis relationship seriously needs to end.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "Yeah.  I read the whole conversation, too.  OP, I'd be at my wit's end, as well.  She is unable to put anyone's emotional needs and autonomy above her own narrow world-view.  It's not even the vegan thing that gets to me, it's the lack of respect.   There's no way I would put up with a partner dictating my *and my child's* diet as a condition of the relationship or living arrangements.\n\nOP, it sounds like you really want to make this work, but when a partner prioritizes something above all else, it will never end well.  If she could be reasoned with or compromise even a bit, I'd recommend continuing to try.  Your other post was 10 months ago!  This seems like an exhausting issue that never ends, and never will.  You need to think hard about whether you can handle this dynamic for the rest of your life.  If not, you should cut your losses since the situation is NOT going to get better.  \n\nIt's not like you got into this relationship with a vegan woman, accepting that this would be the status quo.  She changed a MAJOR thing.  If she wasn't relentlessly harassing you, it would be workable, but as it is, it has become a deal-breaker, and it's not your fault.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 7,
                      "content": "That 'conversation' was infuriating to read. She wasn't having a discussion with him... she was talking past him, saying whatever she wanted to say without really acknowledging or understanding what he was saying at all. \n\nVeganism didn't make her this selfish and toxic,  it just gave her a grandstanding, holier-than-thou outlet for it.\n\nI know it's so simple for me to just say to leave, but his life is likely going to be hellish for the next two decades if he sticks this out.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 29,
          "content": "[removed]",
          "id": 117,
          "comments": [
            {
              "score": 19,
              "content": "That also means though, that the sort of religious people and vegans you're talking about are incapable of understanding their moral code and beliefs are subjective not objective, and they refuse to respect anyone else's beliefs or moral code.",
              "id": 118,
              "comments": [
                {
                  "score": 8,
                  "content": "Religous people are rarely entirely ration about their beliefs.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Isn't that like the whole point of religion though? Taking it on faith that it's 100% right and everyone else is wrong?",
                  "id": 120,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I agree most vegans I have met done so by moral choice.",
              "id": 121,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "For perspective, why do you think the compromise should so heavily favor her? \n\nTo reverse the situation, if neither were vegan, then one day he demanded she and their children began eating a pure meat diet, would the fair compromise be to remove all non-meat products from the fridge?",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "No if youre FORCED to not have something at home that you prefer because of your SO thats a controlling behavior. Never compromise like that.",
          "id": 123,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 701,
      "content": "NTA. Your response was obviously out of frustration, but she has zero right to force you to convert to a new dietary/belief system to live together. That’s, like, dictatorship.",
      "id": 124,
      "comments": [
        {
          "score": 93,
          "content": "And if she gets him to bend on this, what else is she going to make him do?",
          "id": 125,
          "comments": [
            {
              "score": 9,
              "content": "More likely what won't she make him do. Sounds like she wants a slave rather than a partner",
              "id": 126,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 643,
      "content": "NTA. I’m vegan and she’s over reacting. I could understand her asking you to compromise by eating slightly less meat or not cooking it when she’s home but trying to make you go vegan is pretty rude. \n\nAnd could be dangerous because your supposed to transition to being vegan over a couple months so expecting you do it right now is kinda a bad idea. (Obviously it’s fine for some people to go vegan over night but lots of people get sick)",
      "id": 127,
      "comments": [
        {
          "score": 76,
          "content": "The “lots of people get sick” that you know of are the people like rawvana who go on a 30 day water cleanse and wonder why they feel sick all the time and eat meat again. It’s bullshit. Eat a balanced diet with grains, vegetables, fruits, etc. And you’ll be fine.",
          "id": 128,
          "comments": [
            {
              "score": 238,
              "content": "My point was lots of people don’t know how to eat a balanced diet without animal products so if you take your time and do more research you can avoid possibly getting sick.",
              "id": 129,
              "comments": [
                {
                  "score": 142,
                  "content": "Most people don’t know how to eat a balanced diet WITH animal products",
                  "id": 130,
                  "comments": [
                    {
                      "score": 88,
                      "content": "Yes that’s also true lol. I never denied that. It definitely goes both ways but you shouldn’t drastically change your diet overnight especially if you haven’t done enough research. \n\nI’m not sure why people are arguing with that",
                      "id": 131,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 40,
                      "content": "So changing to a significantly different diet is even more complicated, since you would lack knowledge and experience at first. \nWhich is why it should be done well. Pretty much true for any change in life, nothing beats good old trial and error.\n\nSome people are idiots, when those people change their diet you can hear about it in the news.\n\n\n\"Normal dude changes lifestyle and manages quite well while suffering minor mishaps\" is not newsworthy.\n\nNot really disagreeing with you of course.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "That's entirely the point, though. If your body is used to lots of animal fats, sugars, and simple starches, removing them from your diet cold turkey will make you ill for about a week until your body can adjust again. The worse your diet is, the harder it is for your body to adjust to a better one.",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Most people don’t know how to eat a balanced diet. Shortened even more lol",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Lol. Balanced.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "api -- mass edited with https://redact.dev/",
          "id": 136,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 407,
      "content": "Holy shit undoubtedly NTA, even if your response was immature to say the least\n\nThe worst thing is she's going to try to force not only you, but your child who has NO relation to her to be vegan? That is an utterly dick move and I don't think I'd be dating her anymore",
      "id": 137,
      "comments": [
        {
          "score": 10,
          "content": "I think his response was emotional, not immature. Mature people have emotions too and I dare to say, the same as kids' emotions. If this was a response from a woman would that be immature as well, or are only women allowed to have emotions?",
          "id": 138,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 240,
      "content": "Nta. She needs to set aside her high and mightyness for the kid she help create. Her responsibility comes that kid above all else",
      "id": 139,
      "comments": [
        {
          "score": 37,
          "content": "Sounds like she just dosent want to move in together and is making excuses",
          "id": 140,
          "comments": [
            {
              "score": 5,
              "content": "That's very possible. Then she should just be upfront about it and if she wants to split up, then she has to be able to work with him in raising the kid and be partners in that if not a couple.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Yeah, this. It's not like she is (from what we can see) trying to keep the kid away from him. She doesn't want to live together though. Plenty of kids do just fine being raised by split up parents who co-parent well.\n\nThat being said, her behavior now doesn't bode very well for her ability to co-parent civilly.  But, who knows? Maybe this stubbornness is just her way halting relationship progress (or ending it all together) and won't be the norm in the future.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 204,
      "content": "NTA.  Dump her and find someone less mental.",
      "id": 143,
      "comments": [
        {
          "score": 16,
          "content": "Seriously this woman is mentally ill and her diet is likely just going to further exacerbate her condition.",
          "id": 144,
          "comments": [
            {
              "score": 4,
              "content": "The fact that she’s willing to compromise a family with CHILDREN involved raises huge questions of mental illness to me.  That’s just insane.",
              "id": 145,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 197,
      "content": "NTA. Your GF is trying to control you. It sounds like you made many concessions for her already which was nice of you. She can't force you not to eat meat. She needs to learn how to compromise.",
      "id": 146,
      "comments": [
        {
          "score": 107,
          "content": "My major problem is that she's forcing the kids (one that's not even hers) to go vegan. Not even vegetarian, but vegan. If this was something my kid even wanted to participate in, by all means let them but if their step mom forced them to do it I'd be so pissed. \n\nNTA",
          "id": 147,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "She has every right to choose who she wants to be a partner with and live with. Of course so does he. Maybe moving in together/being together if their values don’t match up isn’t meant to be.",
          "id": 148,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}