{
  "post content": "I woke up late for my 8:30 class and there was no way I’d make it in time. My professor has to teach the same class back-to-back, therefore I got myself up to ask him if I could just sit in his other class to avoid getting marked absent. By the time I got to school, there had been a fire drill going on and I ran into a friend from the earlier class. She told me she was on her way to speak to our professor because she got to class late, the fire drill ended the class early, and she wanted to make sure she was marked down on the attendance sheet. Immediately I saw the opportunity in front of me. \n\n*My professor is not the best teacher in the world. No disrespect for teachers, but he does not do a good job at educating his students. He has us do mini projects for homework so we can spend the entire class sharing our work, rather than him teaching. We never learn actual content. This is a common teaching method at my school in France. Yes, their academic culture is different from the U.S., but I don’t learn anything substantial here and honestly it stresses me out! \n\nOkay- back to the story. I walked with my friend to the classroom, and I stood beside her as she spoke to our professor. I was prepared to ask if I could sit in his next class but when my friend left, I was compelled to say the same thing she did, “Hi, I was late to class and want to make sure you marked me present. The fire drill interrupted class so I wanted to come back and double check.” It was too easy. He said “Are you sure you were in class?”, and I said “Yes the metro shut down making me a little late”. (This actually happened, seems to happen a lot in France). He interrupted and said, “Oh that’s right okay what’s your name?”. I told him my name and he said “voila you were here!”. After I left, I felt so guilty. Although I would have learned absolutely nothing if I stayed, maybe I’d feel more fulfilled just by being there? Idk, I feel like an asshole lying to my professor. I feel like an ass hole going all the way to school and then just turning around as soon as I saw a way out. BUT, my best friend from home is visiting and we had plans to go to Disneyland today and we wouldn’t have been able to go if I went to this class. AM I THE ASS HOLE BECAUSE I FEEL LIKE A PIECE OF SHHHHITEEEE. 😨",
  "id": 1,
  "comments": [
    {
      "score": 5,
      "content": "NAH, school has sadly gotten pretty useless nowadays. At my school in germany you could easily take 2 weeks off without anyone noticing and without having missed anything lecture wise. Nobody will care anyways. But dont do this at work later or at university.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "I mean ... there's literally no one who was in any way hurt by your lie. Also seems like your professor might have figured out your lie and just didn't care, either? So ... NAH?",
      "id": 3,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "What I always got told is that if you miss a class, it’s on you. Missing out on what the lesson contained is punishment enough.\n\nEDIT - NAH",
      "id": 4,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI woke up late for my 8:30 class and there was no way I’d make it in time. My professor has to teach the same class back-to-back, therefore I got myself up to ask him if I could just sit in his other class to avoid getting marked absent. By the time I got to school, there had been a fire drill going on and I ran into a friend from the earlier class. She told me she was on her way to speak to our professor because she got to class late, the fire drill ended the class early, and she wanted to make sure she was marked down on the attendance sheet. Immediately I saw the opportunity in front of me. \n\n*My professor is not the best teacher in the world. No disrespect for teachers, but he does not do a good job at educating his students. He has us do mini projects for homework so we can spend the entire class sharing our work, rather than him teaching. We never learn actual content. This is a common teaching method at my school in France. Yes, their academic culture is different from the U.S., but I don’t learn anything substantial here and honestly it stresses me out! \n\nOkay- back to the story. I walked with my friend to the classroom, and I stood beside her as she spoke to our professor. I was prepared to ask if I could sit in his next class but when my friend left, I was compelled to say the same thing she did, “Hi, I was late to class and want to make sure you marked me present. The fire drill interrupted class so I wanted to come back and double check.” It was too easy. He said “Are you sure you were in class?”, and I said “Yes the metro shut down making me a little late”. (This actually happened, seems to happen a lot in France). He interrupted and said, “Oh that’s right okay what’s your name?”. I told him my name and he said “voila you were here!”. After I left, I felt so guilty. Although I would have learned absolutely nothing if I stayed, maybe I’d feel more fulfilled just by being there? Idk, I feel like an asshole lying to my professor. I feel like an ass hole going all the way to school and then just turning around as soon as I saw a way out. BUT, my best friend from home is visiting and we had plans to go to Disneyland today and we wouldn’t have been able to go if I went to this class. AM I THE ASS HOLE BECAUSE I FEEL LIKE A PIECE OF SHHHHITEEEE. 😨\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH - many schools and classes have gotten rid of \"attendance checks\" because they're not really all that useful. If you're able to keep up with the class, why does it matter if you show up for something you're not really benefitting from? You're not trying to overthrow the attendance checking system, but it's fine to get away with missing an occasional class without punishment.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 0,
      "content": "Of course YTA - YOU LIED.  Every bit of all that other information was justification.",
      "id": 8,
      "comments": [
        {
          "score": 0,
          "content": "Oh yes, there's never been a totally harmless situation where you've lied.\n\nDo not beat yourself up about this. Useless class and quick thinking. Your education wasn't actually harmed, nor was his job. Well done. NTA",
          "id": 9,
          "comments": [
            {
              "score": 1,
              "content": "Of course I've lied!  It's just an asshole move - it always is when we lie for our benefit.  I'm 100% certain the OP will get over it.",
              "id": 10,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 0,
      "content": "NAH I barely went to university and passed. Some people learn in different ways, and there is always the internet/academic papers/journals and articles to help you out at home. Sometimes being an independent learner is just as successful as traditional and conventional education.",
      "id": 11,
      "comments": [],
      "relation": "No"
    }
  ]
}