{
  "post content": "My dad [54] had a major heart attack last year in November. It was major enough that a hole ended up forming in his heart, and the doctors at the time gave him a slim chance of surviving. Well, my dad did, thankfully, but still has one blockage that needs to be looked at. He is home now recovering physically from the ordeal. \n\nAs expected, the doctors put him on a strict diet. He has to avoid foods that evolve too much sodium, fat, sugar, etc. Basically, all the bad stuff. The doctors gave him a limit as to how much he could have a day, as well as gave him only one cheat day a week. This has been affecting my dad as he loves food. For reference, he used to be a smoker before his heart attack. But after his surgery and everything, he no longer desires a cigarette. But he says he doesn't miss it, but he says one thing that he does miss is food.\n\nHere is the issue. He mentioned to me that he wanted to go to Waffle House so he could have something other than cereal. I was hesitant, even though he said that he would order eggs, grits, and toast. I thought that if he ordered, then he might surprise me and get hash browns or something. So I told my stepmother that he wanted to go as she had a more say in the matter. She said that he could, but he would have to tell the waiter to avoid putting butter on the toast and grits (she believes they automatically put butter on things while cooking). This discouraged my dad, and now he no longer wants to go to Waffle House. \n\nI knew this would happen, which was why I told my stepmother. My dad tells me that I shouldn't have told my stepmother anything. Said that I should have kept it a secret and that maybe he could live a normal life. He mentions how he feels like my stepmother and I are controlling him too much and not allowing him to choose for his own. He says that we are in the wrong for that. \n\nMy dad loves food. Begs for Whoppers and BigMacs, but...the doctors put him on a strict diet for now. I just don't want to lose my dad. I already lost my stepfather and grandfather last year, and I don't want to lose another. I know he will eat whatever he wants once he is clear to drive. We won't be able to stop him then... but for now, I want to keep tabs on it. Especially since he still has a blockage. But what he says makes sense. Technically, we can't stop him from doing what he wants. If he wants to eat unhealthy foods and potentially risk his life once more, then he can. After all, that's his choice. But I want to keep him around.",
  "id": 1,
  "comments": [
    {
      "score": 136,
      "content": "NAH for caring. But, you can't save him from himself and you can't treat him like a child.",
      "id": 2,
      "comments": [
        {
          "score": 29,
          "content": "Agree, NAH. You care, your stepmother cares, this is good.\n\nBut, your father is an adult and can make his own choices, including bad ones.\n\n**Source:** Watching my father slowly die of COPD because he decided to take up smoking again, years after he quit.",
          "id": 3,
          "comments": [
            {
              "score": 3,
              "content": "I'm so sorry.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 53,
      "content": "NAH\nyou're in a really tough situation, especially as your dad has voiced that he feels like his agency is being restricted. Nothing here will feel good no matter what. It just sucks.\n\nYou'll need to keep negotiating with your dad , or give him the reins altogether. We don't naturally have the tools to deal with these situations and a professional counselor may be a good idea here to help you and your dad to avoid ruining your relationship over your desire to keep him alive.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 23,
      "content": "NTA. It's not a Waffle House. It's a Waffle Home. Everything they cook is made with holy water and kissed by angels. Just walking in the door would improve anyone's mental and spiritual health.",
      "id": 6,
      "comments": [
        {
          "score": 14,
          "content": "That's one thing I was considering after what I had done. Simply getting out instead of staying indoors all the time could help in some way. Especially since he mentions that he wants to live normally.",
          "id": 7,
          "comments": [
            {
              "score": 6,
              "content": "Can you take him somewhere a little healthier than a waffle house? I don't know what's available in your area but if the goal is to get him out of the house, this would be away to do it.",
              "id": 8,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 20,
      "content": "YTA - not for worrying about your dad.  He is lucky to have a child who cares so much for him.   It sounds like he needs to make major changes to his lifestyle.  And doctors are really good at insisting these type of changes must all occur immediately.  With some people the doctor’s dire warnings are enough to make them change their life completely.  For others, they may never change.\n\nYTA because you are falling into the typical trap adult children often fall into when their parents have health problems.  You start treating them like a child.  I know from personal experience this never works.  He is an adult.  You can encourage him to eat better but you cannot police your dad’s eating habits.  He is an adult.  He knows the risk he runs.  He may think that since he stopped smoking, he may have already sacrificed enough.  He may make gradual changes to his diet.  He may not do enough in time and he may suffer another heart attack.  But you cannot lecture him, you cannot police him, you cannot forbid him, you cannot gang up on him, and you cannot tattle on him.  If you do, he will get angry and he will be justified in doing so.  Just love him.  Be there for him. That’s all you can do.\n\nYour dad evidently quit smoking.  That is a huge adjustment and he should be proud of that.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "NAH, leaning gently towards Y T A.\n\nI definitely get where you're coming from and I don't blame you for feeling your feelings. I don't even blame you for trying to stop him.\n\nYour Pops is a whole ass adult, and whether he wants to follow his doctor's advice is his choice to make, not yours, unfortunately.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "[deleted]",
      "id": 11,
      "comments": [
        {
          "score": 2,
          "content": "I know I can't. He will eat whatever he wants once he is clear to drive. I know for a fact he will. I guess I just want to keep extreme tabs for now until that blockage is fixed.",
          "id": 12,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "NTA\n\n> Said that I should have kept it a secret and that maybe he could live a normal life. He mentions how he feels like my stepmother and I are controlling him too much and not allowing him to choose for his own. \n\nYour father can live a normal life for a very short time, or he can have a longer life and potentially get some of his favorite foods back once he's further in his recovery.",
      "id": 13,
      "comments": [
        {
          "score": 1,
          "content": "Why shouldn't the father be the one to choose?",
          "id": 14,
          "comments": [
            {
              "score": 1,
              "content": ">Why shouldn't the father be the one to choose?\n\nIt's right there in the question.   Because he's a father.   He has a wife, he has children.   These people care about him and want him to be around.\n\nIf he really wants to have a short \"normal\" life, he'll be able to start doing that as soon as he recovers enough to drive himself around, in the mean time he gets to put up with that his family feeds him.",
              "id": 15,
              "comments": [
                {
                  "score": 2,
                  "content": "Yes, he has people who care about him. He's still an adult who can make his own decisions.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 1,
                      "content": ">Yes, he has people who care about him. He's still an adult who can make his own decisions.\n\nYep, and as I said, once he's able to be up and about making his own food choices will be part of it.   In the mean time he's dependent on family who's going to follow the doctor's dietary restrictions because they don't want to assist his death.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": " While your father's choices are his business and not yours, I can understand that your actions come out of love so I'm going with NAH. \n\nHowever, if you really want to help your dad while at the same time being more respectful of his autonomy, then do these things: help in keep track of his medications.  I am assuming that your father is on the standard medications given after a big heart attack. These medications play a big part in improved survival so he needs to take them as prescribed. Consider helping him fill his pill boxes and set alarms on his phone to remind him to take the meds. It is also important that he follow up with his cardiologist so ask if you can help him make those appointments (eg drive him, accompany him etc). Cardiac rehab also improves survival so join him for walks/exercise as recommended by his rehab person. When it comes to food, eat healthier yourself and share that food with your dad. Additionally, a big part of post heart attack recovery is dealing with the psychological effects. Many people get depressed or anxious so be a good listener and if need be direct him to see a doctor/counsellor. Bottom line: help facilitate things that have been proven to improve survival. Make it the easy default if you can. After that it is up to your dad to choose what he'd prefer.\n\nIf you help out in these ways you'll know you've done your best to help even if he chooses more problematic actions.",
      "id": 18,
      "comments": [
        {
          "score": 6,
          "content": "I actually live in TN and came down to GA to help my dad with everything. My stepmother helps with his medication and reminders, while I help take him to appointments and cook. They are not recommending cardiac rehab until he is well into physical therapy. \n\nYou're right, though. We are helping as best as we can.",
          "id": 19,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "YTA. Nobody elected you to be the food police. And one cheat meal won’t kill him.",
      "id": 20,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "YTA I hate saying that you are because I know I would be as well in this situation but your Dad is right and that it is his life. You did the right thing by voicing concern but telling your stepmom because you knew it would stop him is the AH part. Loss of a loved one is a horrible thing and we are often greedy that we want to keep someone around even if it means a life they don’t want to live. All you can really do is tell them how much they mean to you, what losing them would be to you and hope that they make the right decisions and choose to be in your life longer.",
      "id": 21,
      "comments": [],
      "relation": "Support"
    }
  ]
}