{
  "post content": "After living abroad for a few years, I (F30) have recently moved back to Canada and into my parents house. Living at home sucks so I've been planning to move out and started looking for places closer to my work. I was initially looking for a 1BR but then asked my sisters if anyone was interested in moving out with me. My sister \"Trina\" (33F) was down, so I started looking at 2BR places within our budget.\n\nAfter finding some options, I arranged a few viewings. I create a spreadsheet that contains the pros and cons of each apartment and information for any upcoming viewing appointments. I share it with my sister so that she's aware of all of the information. She confirms that she'll be going to the viewings with me and since they land on a Sunday, she agrees to transit to church and I'll meet her there so that we avoid taking two cars.\n\nThe day of the viewings, she takes the communal family car to church. At around 11AM, my other sisters message the family group chat asking Trina to bring the car home because my parents and younger sister needs it. Trina says \"she'll be home by 1PM.\" I'm confused by that since we have our first apartment viewing at that time. I remind her that we have a viewing and ask her if she plans to be there. She does not confirm. At around 12:30PM, I start heading to the first viewing. When 1PM hits, I msg the group chat asking if she's coming and my other sister tells me that Trina is currently at home.\n\nI'm furious and ask Trina if she's still coming. She asks me what time are the other appointments and I tell her to check the spreadsheet since all of the information was already there. She starts making her way to the 2nd viewing via transit and at this point, I'm so annoyed at the fact that this all could have been avoided so I call her out on her \"absolutely idiotic behaviour.\"\n\nTrina gets offended by this and responds with, \"okay nvm you can go to the rest of these yourself. I don’t wanna live with you. I don’t wanna put up with your abuse. unless you apologize for the name calling.\"\n\nI think her decision to last minute cancel and pull out of being my roommate over a stupid little fight was an overreaction. I'm pissed at the fact that I changed my initial plan to move out by myself and did an unnecessary amount of work by conducting all of the research for a 2BR and setting up viewing appointments. Even though calling her an idiot may have been mean, I think it was justified. Rn, I just wanted to write this post to vent and will probably find a place on my own but I wanted to see how Reddit would respond. AITA?\n\n**EDIT:** Not sure if this is clear in the original post since someone asked but the reason Trina missed the appointment is because she took the family car when she was supposed to transit. We agreed the night before that she should transit to church instead of taking the car in case our parents needed it. The morning of the appointments, she took the car thinking no one would need it. When our parents requested it, instead of just driving home to return it. She did groceries and then made her way home—wasting more time and ultimately missing the appointment. This is frustrating since we had already made a plan to avoid this from happening in the first place.\n\n**EDIT 2:** Thanks everyone for the feedback. I have a lot of sisters and we call each other idiots all the time which is probably why I don't really see the severity of the comment. But I understand that that term is definitely rude and can be seen as abusive. Reading the overwhelming amount of ESH verdicts, I totally understand that my language was uncalled for so will have to work on healthier ways to deal with my frustration in the future.",
  "id": 1,
  "comments": [
    {
      "score": 77,
      "content": "You two shouldn’t live together.  It’s very obvious after reading this post.",
      "id": 2,
      "comments": [
        {
          "score": -31,
          "content": "lmao true but we currently live at home together so it's already a reality.",
          "id": 3,
          "comments": [
            {
              "score": 23,
              "content": "You’ve got buffers at home though",
              "id": 4,
              "comments": [
                {
                  "score": -6,
                  "content": "You right",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 41,
      "content": "ESH. \n\nYou reacted rudely to your sister missing one appointment. She replied in kind. Why did you have to blow up the group chat about your issue with just her? Y’all’s communication could use some work.",
      "id": 6,
      "comments": [
        {
          "score": 8,
          "content": "Yeah, I agree it was rude. It wasn't rly in response to the missed one appointment. It's more about the series of actions that led to the missed appointment. I didn't mention every little detail for the sake of length but I'll mention it here for context.\n\nWe agreed she transit in case our parents need the car. She takes the car.  \nI ask her for confirmation. No acknowledgement. I call her. No one picks up. When my family requests the car back in the group caht, she says she needs to go grocery shopping despite the fact that she knows we have an appointment (ultimately wasting more time). When I follow up with her again at 1PM, she responds with, \"do you want me to come with you?\" (obviously?!) When I say yes, she asks what time is the next appointment? I tell her 2pm and to check the spreadsheet for info to all the other appointments. \n\nWe made the plan the previous night for her to transit to avoid the mishap of our parents needing the car and that was derailed. She confirmed with me that she was attending and still did errands despite knowing she already committed to the appointment and she continued to ask me questions when I had already provided her with spreadsheets containing everything she needed to know. As siblings, its not uncommon for us to call each other idiots so her reaction to pull out as roommates was surprising.",
          "id": 7,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 26,
      "content": "You think she overreacted?  Hello, Pot? I have Kettle on line 2.",
      "id": 8,
      "comments": [
        {
          "score": -2,
          "content": "lmao true, i need to work on my anger issues.",
          "id": 9,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 18,
      "content": "ESH?\n\nWell, you're definitely in a tough spot. It's super frustrating to have everything planned out for moving with your sister, only for her to bail last minute. Sure, calling her an \"idiot\" was harsh, but your anger makes sense. You did a lot of work based on her agreeing to move in with you. It's a messy situation, but it might be better to find a place solo and avoid further drama. \n\nYou could've handled your frustration better, but her backing out last minute wasn't cool either.",
      "id": 10,
      "comments": [
        {
          "score": 2,
          "content": "Fairest assessment imo.",
          "id": 11,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16,
      "content": "No judgment  take this as a blessing in disguise get a place just for yourself",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 12,
      "content": "Actually, she pulled out in response to you calling her an idiot.",
      "id": 13,
      "comments": [
        {
          "score": -2,
          "content": "Yeah, that's my bad. I realized I made that mistake after I posted and was unable to edit the title. Would've probably changed it to something like \"AITA for calling my sister an idiot after she no-showed our appointment?\"",
          "id": 14,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "ESH. You’re better off on your own",
      "id": 15,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "ESH.  Your sister dealt you disrespect by flaking out on the viewings and not participating in finding the apartments.  You, on the other hand, WERE abusive in your response to her.   But two wrongs do not make a right.  They just make two AHs.",
      "id": 16,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "I could see you two coming to blows when if you live together.\n\nLiving with a roommate is a good idea, but I suggest it be with someone else other than family.\n\nYou both kind of suck.  Your sister for being so thoughtless and inconsiderate.  You for the insulting language.  (I do think your organisational skills are awesome though.)\n\nVerdict:  ESH.",
      "id": 17,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > AITA for calling my sister an idiot after she last minute pulled out of being my roommate?\n\n1) Calling my sister an idiot\n2) Because calling someone an idiot is mean\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 18,
      "comments": [],
      "relation": "No"
    }
  ]
}