{
  "post content": "My fiance, Kevin(M28) and I(F30) had initially planned to get married a few years ago but due to the fact that the world was falling apart we postponed it until things calmed down and our family felt safer at a big event. We've now set a date for this coming August and as we get closer more and more thoughts keep coming to me about how it should go. My biggest issue is that Kevin's best man is no longer his best man and is now his best woman. Kevin and Amy(MTF26) have been friends for a little over a decade and when they first met up until two years ago when our wedding was supposed to happen Amy identified as a man. Kevin and Amy have always had a very close almost sibling like relationship, Kevin had been kicked out by his mom at 17 and met Amy at work shortly after. She's been very close with him and he's told me multiple times that she is the closest thing he has to any family.\n\nInitially Amy had planned to not come out to Kevin until after the wedding but after finding out that the wedding was going to be delayed she came out to him. Without consulting me Kevin told her that he was fine with all of that and that if she was at a stage were she'd like to wear a dress when our wedding happened that he would find her a dress that matched the colors he had for his groomsmen. Amy has been medically transitioning for about a year or less now and Kevin told me that we need to find her a dress. I don't have a problem with Amy and I understand how close she is to Kevin but our wedding is largely for my very traditional family. Kevin has often said that this wedding isn't that important to him and that the only reason he's doing it is because it's important to me and my family. I know that my family would have a lot of issue with Amy which Im sure would bring a lot of unwanted or outright rude attention towards her. For this reason I've asked my fiance to choose someone else to be his best man and request that Amy attend as just a guest. This has lead to a large fight between the two of us with Kevin threatening to cancel the wedding if Amy can't be part of the wedding party because he wants someone from his family in it. Im trying to get him to understand the issues this will cause but I'm not sure he gets it. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 45046,
      "content": "YTA.\n\nThis is incredibly transphobic! Amy is his best friend and when your fiancé chooses her as his best man, you have to respect that, and so does your family.\n\nYour family is the problem, not Amy. And you should hold your fiancé‘s back and support his decision if you want your relationship to last.",
      "id": 2,
      "comments": [
        {
          "score": 12368,
          "content": "This - a thousand times over. Your families views are the problem. And that you're more worried about them than your future husband's decision. \n\nThis is a MARRIAGE, not a one-day wedding.",
          "id": 3,
          "comments": [
            {
              "score": 6097,
              "content": "Oh you know she shares their views.  She’s just using them as an excuse so she can pretend she’s not transphobic as hell",
              "id": 4,
              "comments": [
                {
                  "score": 3408,
                  "content": "Right? And after the wedding, she will start telling him how it’s “inappropriate“ to have a female best friend.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3361,
                      "content": "Transphobes get the best of both worlds. Trans people are both men and women depending on how they want to punish them. \n\n\"You can't use the woman's bathroom because you're a man. You also can't be my husband's best friend because you're a woman.\"",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 208,
                      "content": "[removed]",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 632,
                  "content": "This! \"Without consulting me Kevin told Amy he was ok with all that.\" All.. what? Amy wearing a dress? Amy putting her soul on the line and trusting her best friend with who she is? What does Kevin need to consult her over!",
                  "id": 8,
                  "comments": [
                    {
                      "score": 176,
                      "content": "Did she consult him about her bridesmaids or moh?",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "That’s the part that really pissed me off. Isn’t this his wedding too?",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "You’re forgetting the one rule for bridezillas - the wedding is ALL about her! \n\nShe gets whatever insane and unreasonable thing she wants for attention the whole day, no exceptions! \n\nIt seems more likely she’s transphobic (as well as a bridezilla)… but she’s pretending to be annoyed about not being ‘consulted’ (because couples should make choices together) to hide the transphobia! \n\nPlenty of men can be suckered into marrying a bridezilla… but someone who hates your best friend because she’s a bigoted jerk is not so easy. 😏",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 425,
                  "content": "How is Amy’s business known to OP’s family? It’s her transphobia, ignorance and jealousy shining bright. YTA OP, a massive one.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 181,
                      "content": "Yeah, this was my first thought...\n\nif Amy's medically transitioning, how is OP's extended family going to know anything other than \"This is Amy, my husband's best friend/sister!\" Unless OP goes and tells them that Amy was assigned male at birth?\n\nOP needs to stop telling her family other people's personal medical history.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Good point it's obvious your transphobia isn't just your family's transphobia OP so YTA. Oh, and BTW I think you just ended the wedding before it even started, congratulations on avoiding paying for a wedding and a messy divorce.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": ">Without consulting me Kevin told her that he was fine with all of that\n\n\"all of that\" literally just meaning *Amy being a woman*. OP expected her fiance to *consult her* on whether or not he should *continue to let a trans family member be in his life*.\n\n>I don't have a problem with Amy\n\nPeople who don't have problems with trans folk don't need their spouse to *seek your approval for their friendship*, OP.\n\n>and I understand how close she is to Kevin but our wedding is largely for my very traditional family.\n\nThis is such thinly veiled transphobia, I'm not even sure it's vieled.",
                  "id": 15,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Yeah, they can still bully her as a guest. Her and her family is the problem. YTA",
                  "id": 16,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "I was impressed that she didn't deadname Amy to be honest, felt like that was coming any second with how the rest of the post went. But yeah OP, the problem here isn't Amy it's your family. You're asking Kevin to let you have your transphobic family there while not letting his non bigoted family attend. \n\nIf you're so concerned it will be an issue, here's a wild thought: disinvite the members of your family you are most concerned about being transphobic and let Kevin have his lovely family by his side on the day. \n\nNo? So why is it he's the only one who has to give up on family attending while you get to skip off into the night surrounded by bigoted family members?",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 661,
              "content": "[removed]",
              "id": 18,
              "comments": [
                {
                  "score": 231,
                  "content": "If this was a movie after he breaks off the engagement with OP he’d wind up with Amy.\n\nBut being real life, OP still underestimates how important chosen family is and he may value keeping his best friend who has always been there for him over staying with someone who is willing to hurt Amy deeply just to keep up appearances.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 65,
                      "content": "Hallmark’s newest film starring Ryan Gosling, Rachel McAdams and Elliot Page.",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 46,
                      "content": ">If this was a movie after he breaks off the engagement with OP he’d wind up with Amy.\n\nAnd there is the fear...OP is jealous.",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 26,
                      "content": "This. One of my best friends is a cis male and I’m a cis female and we’ve been friends for 11y now. He’s been there for me in moments when I didn’t have a single family member who would say kind things about me.\n\nI would have 100% left my husband if he had pulled this kind of bullshit and was unwilling/unable to have a rational, logical discussion about him being apart of the wedding. Sorry, you’re marrying into my chosen family just as much (if not more) as my literally one. Guys and girls can be friends and boundaries are important while having any kind of friendship while in a relationship.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "My son's best friend is NB, they've been friends since they were in elementary school.  If a future girlfriend acted like OP has, she would quickly be an ex.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 90,
                  "content": "Right? OP is giving very clear information about what she expects Kevin to submit to, and the correct thing for him to do with this information is to leave her and find a less cowardly partner.\n\n> Im trying to get him to understand the issues this will cause but I'm not sure he gets it.\n\nLike this is just a jaw-dropping admission of having done zero introspection about anything, doubly embarrassing from someone calling themselves a “scholar.” Has OP thought about the “issues” of expecting her spouse *and* her children to arrange their lives around her family’s bigotry? Is she so superficial and shortsighted that she thinks a “traditional” wedding is more important than her kids’ safety? Apparently! Gtfo Kevin.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Kevin needs to run.  OP just sounds like a real AH.  A sign of things to come, should they tie the knot.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "He gets the issues. I have no doubt he understands them, and so does Amy. But he also understands that if there's going to be a wedding, only one person deserves that best man slot, and that one does not deny that because of someone else's bigotry.\n\nYTA, OP",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I wouldn't  be able to respect  my parter after such cowardliness, TBH.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "u/boysetu is a comment stealing karma farming bot",
                  "id": 28,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 408,
              "content": "Yeah your husband doesnt seem to want a wedding but is doing it for you the least you can do is let him do that. Meanie.",
              "id": 29,
              "comments": [
                {
                  "score": 1005,
                  "content": "\"So my husband has no family and his bestie is like the only one he has left but like she was born a man but is now a woman and that's terrifying so my husband can't have his only family at the wedding because she is trans and I'm scared of my fam 👌🏻👌🏻✌🏻\"",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "I don’t think it’s a wedding he has a problem with.\n\nJust this huge, fancy, fusspot affair with ‘traditions’ that are actually LGBTQIA+ phobic!\n\nBut he SHOULD have a problem with this transphobic bride! Hopefully he’ll catch on to her before it’s too late, and find a non bigoted woman who will welcome Amy as the best woman for her husband. 😏",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I wish I could upvote this more than once!",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 391,
              "content": "YTA and again, YTA for making this about your \"traditional\" family. \n\nKevin deserves to have the best man he wants, even if she is a woman.   This is important to him.  This is his day also, and Amy is the only family he has.\n\nI've seen weddings with a woman as the best man several times without anyone clutching their pearls or dying from the vapors.  \n\nThis doesn't have anything to do with gender it has to do with her being transgender. It sounds like Amy is a wonderful person who has been there for Kevin when he needed her.  There isn't any valid reason to push her out of the wedding.",
              "id": 33,
              "comments": [
                {
                  "score": 6,
                  "content": "Vapors, lmao. I haven't heard that in a while.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 132,
              "content": "They always forget about the MARRIAGE part lol",
              "id": 35,
              "comments": [
                {
                  "score": 12,
                  "content": "Well if OP's fiancé is an lgbtq+ ally and she isn't, this marriage is doomed to fail anyhow... if they have kids who are queer, what is she going to do? Hide them from family? Not let them be themselves and send them to conversion therapy because her family?",
                  "id": 36,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "It’s also a wedding for both people getting married, not just what OP wants. She got to pick her bridesmaids, he gets to pick who stands with him.\n\nIf I were OP’s fiancé I would be tremendously hurt if I got told my best friend couldn’t be my best woman to make some transphobic in-laws happy.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "The fact that she can't defy her family's expectations in order to defend her partner may be an indication that she isn't ready to commit to this marriage.",
              "id": 38,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "We obviously see how this marriage is gonna be a one-way street all about her she’s so worried about looking good in front of her family that she’s willing to sacrifice her fiancé’s happiness",
              "id": 39,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "YES - OP is so focused on the wedding. The wedding is one day. It’s a party. Literally no one cares about it as much as the bride and groom and no one else will remember it as much as they will. They should be preparing for the *marriage*.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "right? and it’s not as if being only a guest is going to draw any less attention or unwanted comments or whatever OP is allegedly worried about her AH family doing.\n\nAmy is so important to Kevin that he asked her to stand up for him in y'all's wedding. He is doing something that will make you happy (throwing away thousands of dollars on a party that only you and your mothers really care about) and he has one request. It's not unreasonable. \n\nIt's not your husband's fault that Amy transitioned after your husband asked her to be in the wedding. And it sounds like Amy was even willing to hold off on coming out so as not to overshadow. I get that she's going to take some attention away from you, but that's your family's fault--not Amy or your husband's\n\nThis could be an opportunity for you to stand up for your husband to your family--to show your loyalty. \"My husband is my best friend and one of the most important people in my life: Amy is one of the most important people in Kevin's life and that makes her very important to me. If you don't like that you can leave.\"\n\nAside from the fact that you might be pleasantly surprised by some of your family, what you're telling Amy is that she doesn't matter to you. She doesn't matter enough to be allowed to stand for her best friend; that her most authentic self is not appropriate for a major role in her best friend of ten years' most important day to date.\"You're allowed to come to *my* wedding but if you could please support us from the shadows. I'm doing this to help *you*\"\n\nSo you can support your husband and someone who probably thought you were a friend, or you can tell Amy and Kevin that you care more about the feelings of your distant cousins and mom's coworkers than you do of them\n\nYTA and would put money on a reddit update that this ended the engagement. I don't know how you come back from this: that which is seen can't be unseen.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2177,
          "content": "\"I'm not transphobic! But my family is, so please do this shitty thing to your best friend on behalf of my family. But not me! I'm not transphobic!\"",
          "id": 42,
          "comments": [
            {
              "score": 501,
              "content": "Look she is the AH and her family sucks even more, but avoiding drama with her family doesn't automatically make her transphobic, it just makes her a coward.",
              "id": 43,
              "comments": [
                {
                  "score": 788,
                  "content": "It makes her complicit in their transphobia, which is just as bad.",
                  "id": 44,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 165,
                  "content": "I'm just speculating, but it could be that she is really the one with the problem and using her family as cover.\n\nWe really don't know how her family feels or would react, all we have is OP's description of them and I think it's plausible that she lying about them.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 375,
                      "content": "My first red flag is when she said her family is \"traditional\" we all know that's code for homophobic, transphobic, racist, basically all the bad things\n\nUsually when people don't agree with their families on things they just call it like it is, the fact she used the word \"traditional\" worries me.",
                      "id": 46,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 133,
                      "content": "Not saying this isn't a possibility, but it seems from the post tone, op is about as accepting as someone raised in a bigoted family but \"woke\" social culture. She knows it's wrong because it's not PC to be transphobic, but she doesn't believe it's wrong enough to take a stand against her family.\n\nEdit: just reread your comment. Def don't think she's lying about the family. I think they're all bigots, op seems to know being a bigot isn't acceptable and acts accordingly in public. She's fine with bigotry in her family in private. Just wanted to clear that up.",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 122,
                      "content": "This line makes me feel like she leans a bit her family's way too:\n\n\\> My biggest issue is that Kevin's best man is no longer his best man and is now his best woman.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "My brother did that to me over religion (Catholic vs my wife is Presbyterian), pretending it was my parents who had a problem ... then he did it again about us living together after she finished grad school for the year before we got married.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "No no, didn’t you read? She’s “fine with” Amy.",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 114,
                  "content": "Sure cowardice is a part of it. But, I’m sure (I hope) that if her “traditional” family wanted all black guests to sit at the back of church she’d tell them that racist and not accept it. She’s just ok with the transgender persecution and I don’t think she should get a pass just because pushing back on it would upset her family. Her family deserves to be upset if that’s what would do it.\n\nI guess maybe there is a world where there is not an issue with her being trans the issue is with her being a woman. But, then you’re left being misogynistic so *shrug*.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Well apparently she would go along with that racism because her family is so \"traditional\" and she doesn't want to upset them.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 111,
                  "content": "TBH, she only says that it's her family, could easily be just her.",
                  "id": 53,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 80,
                  "content": "No offense but people who use their family's bigotry to excuse taking bigoted stances are bigots too. They're just better at hiding it.",
                  "id": 54,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 67,
                  "content": "Sorry, but playing her family's transphobia makes her transphobic. I'm tired of people using \"well I just don't want drama with the bigots\" as a shield for their shit. If you're okay with bigotry and prioritize the feelings of bigots, congratulations you're one too. And it's her fiance's  fucking best man and an old friend, but hey her family being allowed to be bigots is a bigger priority.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I didn't want drama with the \"traditional\" members of my family (a little bit of all the bigotry mixed in), so I made a big post saying I will not tolerate this behavior and any event I host will exclude bigots, don't care. Educate yourself or I'll see you if we happen to be at grandma's at the same time. I won't start anything at grandma's, but I'll finish it. Then for about 6 months after that, any time a relative would say something racist, tansphobic, homophobic, etc, my husband or I (never both of us got the same instance) would talk to them about why they were wrong. Ended up removing a bunch of them from SM because bigots gonna bigot. Now they're shocked Pikachu face when they have no idea what's going on in my life. \n\nI don't want the drama, so I sided with POC and LGBTQ+ people in my life and I will every time every time.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 66,
                  "content": "Complicity in transphobia, or the repression/ eradication of a person's identity is the same as transphobia itself. Being a coward isn't a defense.",
                  "id": 57,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 27,
                  "content": "False either/or dichotomy: she's both, the transphobia is a consequence of the cowardice.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I'm going to go with it actually makes her both.",
                  "id": 59,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "The only thing necessary for the triumph of evil is for good people to do nothing",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 259,
              "content": "I like \"I'm not transphobic, but we need to cater to the demands of the people who are because they are perfectly entitled to their perfectly valid views!\"",
              "id": 61,
              "comments": [
                {
                  "score": 150,
                  "content": "This, this, a thousand times, this.\n\nSo freaking tired of people saying \"I'm not <insert whatever kind of bigot here> but we have to be tolerant of others and their views.\"\n\nNope. I don't have to be tolerant of anyone who believes that someone else's life is not as important or valid as their life is because they have \"traditional views.\"\n\nOP, you're a huge AH here. If you really aren't a bigot, don't choose the side of the bigots.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 79,
                      "content": "Unwavering tolerance of the intolerable leads to a culture of intolerance, not one of tolerance and acceptance. Sometimes, we have to shut that s-it down hard, and stop with this BoTh SiDeS crap.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "My best friend and I have known each other about as long as Kevin and Amy have. I'm trans and started transition in 2020. My best friend literally broke off friendships of hers because they wanted to be like that. She's told me that I come before people like that. I would give the dress off my back if my best friend needed it and I know she would do the same. If OP can't understand that this is the kind of friendship Kevin and Amy have and defend their friendship, then She's pretty much doomed everything at this point.\n\nWhat about if the tables were turned and Kevin wanted OP to pick a new MoH for some silly reason?",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 135,
              "content": "\"Do the shitty thing to the 'only person he really considers to be family', for the sake of my family of bigots\"",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 35,
              "content": "Perfect.  \nYTA OP.",
              "id": 66,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": "Exactly. OP is enabling her bigoted family, even if she doesn't share those beliefs herself (I'm not convinced), her actions and convictions are speaking pretty clearly.",
              "id": 67,
              "comments": [
                {
                  "score": 4,
                  "content": "She absolutely does share those beliefs or she wouldn't be posting this. She would've have just already committed to removing any offending family members if they so much as look at the WoH sideways.",
                  "id": 68,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "I will never understand this. Like if you condone racist behaviour from racist family then you too are racist. Same thing with sexism, transphobia etc. The only appropriate response here is to fully support Amy and be willing to take any family to task that has an issue with it. Like seriously, why would you want transphobic Uncle Bill at your wedding if you are not transphobic yourself??",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "And don’t forget the whole ‘the wedding isn’t even as important to him than it is to me and my very traditional family’ bit. \n\nOP, it’s HIS WEDDING, TOO! Unless you’re fine with replacing him with a mannequin, you need to remember it should mean just as much to him as it does to you.",
              "id": 70,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Yes!  It's like the old cliche - \"I'm not racist / homophobic / transphobic - I have black / gay / trans friends!\"  Bullshit.",
              "id": 71,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 314,
          "content": "There are plenty of women who become the best man. How is this different? OP needs to get her priorities together.",
          "id": 72,
          "comments": [
            {
              "score": 132,
              "content": "Was the MTF part going to be announced at the wedding? If Amy is transitioning, will the family even know?",
              "id": 73,
              "comments": [
                {
                  "score": 33,
                  "content": "good point! \n\nunless OP has already told her family?",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I asked the same question above. Pretty sure the person with the issue is OP since unless OP announces Amy's personal information, it's highly unlikely that her family would even know",
                  "id": 75,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "If she didn't start transitioning until her mid 20's it will likely be be pretty obvious. Passing is hard for late transitioners",
                  "id": 76,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 81,
              "content": "Very true ! I’ve attended a wedding where they had a best woman! She was the groom’s lifelong best mate and she was queer. She wore a suit and no one batted an eye! it was a wedding filled with much love and laugher AND!! This was in Asia, where cultures are more conservative than in North America or Europe.",
              "id": 77,
              "comments": [
                {
                  "score": 4,
                  "content": "Depends on the Asian country, but it could have been because the guests didn’t know she was queer. Some people can’t tell.",
                  "id": 78,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "My brother was my Bridesman. He wore a tie that matched the other bridesmaids and stood on my side during the ceremony. Nobody even questioned it!",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "right? i am a woman. my best friend is a man. i was his best man and his wife was nothing but supportive of this.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 300,
          "content": "I hope this is the wake-up call that Kevin needs to call off this engagement. I don't think this is the kind of family he wants to marry into. How very telling that OP's *only* concerned with appeasing her bigoted family, and demands Kevin exclude the single most important person in his life.\n\nYTA, obviously.",
          "id": 81,
          "comments": [
            {
              "score": 5,
              "content": "> demands Kevin exclude the single most important person in his life.\n\nThis came off as so egregiously rude to me as well, he CARES about Amy and wants her to be part of the ceremony. OP is only focusing on the hate of her family members, rather than the love for a friend that her Fiance has?",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 261,
          "content": "You know the difference between a transphobe and someone who caters to transphobes? Nothing. They’re all transphobes. And by they, I mean you, OP. However much you think you’re not, you’re transphobic. \n\nThis wedding should not take place. You’re not trying to marry your fiancé, you’re trying to put on a show for your family - a show for close-minded bigots. Your fiancé thought he was marrying a partner, but you’ve disabused him of that notion. He’s marrying a coward, who only “supports” people when it won’t cost her anything. YTA.",
          "id": 83,
          "comments": [
            {
              "score": 48,
              "content": "Op needs to ask themselves a very serious question.\"am I a decent human being or am I not\". And her fiance probably needs to ask that question about her too.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 240,
          "content": "Your guy let you run loose with the wedding. Make all the decisions because he knows it's super important to you and to your family. His one request is that his only family member, his best friend to be his best woman!!! It's completely understandable that he is livid and threatening to cancel the wedding. \n\nIf you care for Amy and respect your husband to be you will not only accept Amy as his best woman with open arms, make her feel completely accepted but also put a STRICT BOUNDARY or wedding etiquette if you will that ANYONE who is caught making any rude/transphobic remarks towards Amy or at the wedding will be asked and forced to leave. \n\nGive your so called traditional family a heads up and remind them seriously multiple times that this a zero tolerance issue and this boundary is not to be crossed and if they spoil your wedding day with their transphobic behavior there will hell to pay. You can tell them: I am telling you in advance this so you are not surprised when security escorts you out of the venue.\n\nThis is the only way to proceed you cannot sweep Amy under the rug, she is not a dirty secret. She is a spectacular human being who stood by your husband's side when all of his family deserted him!!! She is family!!!\n\nYTA, but you still can salvage this!!!",
          "id": 85,
          "comments": [
            {
              "score": 15,
              "content": "I love this. \n\nI recently realized that I am bi. It has opened my eyes. My mom has always had gay friends and we grew up in the gayborhood of Houston. I was surprised when my mom seemed disappointed when I tried to come out to her. She explained that her side of the family will have issues if I marry a woman... etc. \n\nThis is not an easy situation for me. I try to empathize with her, and it pains me to know that some family wouldn't come to my wedding, and some would come and judge and whisper. \n\nI entertained sticking with men because maybe it would be easier.. But quickly and aggressively decided no. I don't want to be around people who don't accept and love members of the LGBTQ population. That is not where I belong. So it's okay if people show their colors, because I want to see them. \n\nYour husband could nicely tell his friend to sit in the crowd.. to protect her from judgment and hate coming from your family members. But what kind of message is that? What will that do? Enforce the idea that she is no longer family, that she needs to be hidden? \n\nI am not going to label OP as a bigot and transphobic. I almost hid myself for the same reasons OP wants to hide her husband's friend. OP, if you die on this hill. Then you are deciding not to be an ally of trans people. That is a choice that you can make. There are people who will support your decision and people who will be hurt by it. \n\nI encourage you to ask yourself who you want to be and who you support. And if you support his sister and the person she has been to him, then her fight is your fight. Fighting for rights and inclusivity isn't \"fun\". It can be hard and painful. But it is the right thing to do. If you choose to be an ally, then, like the person above me said, you cannot allow comments to slide and you do not question her right to stand by your fiancé while you devote your lives to each other.",
              "id": 86,
              "comments": [
                {
                  "score": 5,
                  "content": "I am sorry you are going through this. I can only imagine how sad it must make you feel that your mom reacted this way. Your feelings are valid and you are who you are who you are attracted to shouldn't be a point of discussion and it doesn't add or reduce your value as a human being. What matters is how you treat others, your kindness and your heart\n.\nIt's not my place but I would suggest that you hold off the judgment on mom for a while because it could be an adjustment phase, especially because you were brought up in a very open minded household.\n\nYou see, when you have a child you kind of picture of what their whole life will be like, you have dreams for them and those dreams become your dreams. So when your child doesn't follow those dreams or change those plans sometimes it takes a little bit of time to come to terms with it. Just because we have those dreams for our children it doesn't mean they'll come true because it's not up to us to decide, it's our child's decision and we have to respect that.\n\nYou are your own person and are allowed and should follow your own path to be your authentic self. Still, it's normal and acceptable for mom to be sad, or even grieving the loss of what she thought would happen. Her feelings are as valid as yours, and she might need a little time to accept the new reality. Based on what you said I think she will come to terms rather quickly because she has so many friends in the LGBTQIA community. They'll be a great support for her and you.\n\nAlso, she might just be sad that part of the family won't accept your authentic self and you might be hurt and suffer because of their rejection, microaggressions and etc. We, mothers, worry about our children's happiness and hate to see them suffering and going through a rough time. When someone hurt our kids, mama bear wants to come out and start fixing things so she is probably thinking about the family members who might have an issue and figuring out a game plan. Her sadness, could have been \"how do I protect them if the family doesn't accept who they are?\". Remember she said some family members said they might not come if you marry a woman, she NEVER SAID SHE WOULDN'T BE THERE, because I am pretty sure she'll be there front row and center.\n\nTalk to your mom about her feelings and try to empathize with her, and in turn ask her to empathize with you. Tell her how her reaction made you feel. She can't read your mind and probably will need you to spell it out to her!\n\nBest of luck! Keep being your authentic self!",
                  "id": 87,
                  "comments": [
                    {
                      "score": 4,
                      "content": "This made me cry, quietly as I am at work lol. I really appreciate you taking the time to write this to me. I needed to hear this because it’s really hard that I always looked up to her for being so open minded and fighting her own parents about racism and homophobia. It took me off guard and confused me when I felt like I wasn’t accepted immediately. But your message has softened me a lot. Thank you. Truly and deeply.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Im so sorry for this. \n\nMy eldest son is gay and recently my gay uncle in law was praising me for being accepting of my son. Honestly blew my mind a little that if could be a thought I wouldn’t. My kids sexuality is their business not mine. I get for uncle in law it was different times and his family weren’t so welcoming. I just hoped times had changed.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Best advice yet.",
              "id": 90,
              "comments": [
                {
                  "score": 6,
                  "content": "Thank you. I don't know why is so hard to understand that Amy is his family and by disrespecting her they are disrespecting her husband to be and if they are disrespecting him then they are disrespecting her too. \n\nRespect goes both ways. This boundary needs to be clear because I can only imagine Amy doing her best woman's speech and people snickering and talking under their breath about her. Something that is none of their business! Disgusting that she would accept this treatment of anyone...\n\nIf I were the groom I would reconsider this wedding too, maybe the bride is just pretending to be understanding and at the 1st chance she gets kick Amy to the curb...",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 229,
          "content": "My best friend was gender non-conforming and sadly has since passed away, but if my fiance said I needed to choose someone else as best man because they weren't a man... I'd burn the whole thing to the ground. Easily. Reflexively.",
          "id": 92,
          "comments": [
            {
              "score": 40,
              "content": "I am so sorry for your loss.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Once upon a time, a man who tried to marry me told me that there would be no lesbians at HIS wedding. I told him he had six months to come to terms with my best friend being my MOH and HER wife of 10 years being there too. \"She's been the person I want as my MOH for 20 years. I've known you for 1 year and we started dating 4 months ago.\"   \nIt took both him and I too long to finally realize we were never going to work because he wanted a good obedient woman and I wanted a non-homophobic husband. We were never going to be what the other wanted.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I'm so sorry for your loss.",
              "id": 95,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 175,
          "content": "> *I don't have a problem with Amy and I understand how close she is to Kevin but our wedding is largely for my very traditional family*  \n>  \n>Don't you see, she doesn't have a problem with Amy, it's just her family that won't understand.  /s\n\nIf OP is old enough to be married, she is old enough to tell her parents that Amy will be a part of the wedding party and if they have problems with that, they don't have to come to your wedding.",
          "id": 96,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 111,
          "content": "Also, Amy is the only and closest thing he has to any family. Since that doesn't mean anything to OP, then maybe she should uninvite her transphobic family instead. OP uses the argument that her fiance said that the wedding isn't that important to him. Maybe she could consider uninviting him as well since the wedding is just for her and her family.",
          "id": 97,
          "comments": [
            {
              "score": 8,
              "content": "I laughed so hard at the last sentence!",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "If I were Kevin I’d seriously be questioning going through with the wedding at all based on how OP is treating Amy.",
          "id": 99,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15503,
      "content": "YTA\n\nThink carefully about what beliefs you're trying to protect here.",
      "id": 100,
      "comments": [
        {
          "score": 1100,
          "content": "Underrated comment.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 881,
          "content": "\\*project\n\nbecause you know it ain't just her family that thinks this way.",
          "id": 102,
          "comments": [
            {
              "score": 631,
              "content": "OP is hiding behind her family.  She probably thinks the same way but doesn't want to say it aloud",
              "id": 103,
              "comments": [
                {
                  "score": 296,
                  "content": "*Ding ding ding*^\n\nIf she actually objected to those beliefs, it would’ve led to a conversation between the three of them about what her family thinks, and how she doesn’t agree. It would’ve been a preparatory discussion rather than a “You need a new best man” ultimatum.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 20,
                      "content": "If OP actually had an objection to those beliefs AND cared about Kevin, this post wouldn't even exist. OP would have outright told her family where to put those beliefs from the start.\n\nKinda makes me wonder if her family is helping pay for the wedding. Seems like there is a little more motive behind this. A piece of the puzzle that we're missing.",
                      "id": 105,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "As someone who was in this spot, can confirm this is exactly what should happen. My partner and I spoke to our queer friends and reassured them that no matter what their safety was our priority & guests/family would be asked to leave if they made even a single hurtful comment. At no point did it ever cross our minds to uninvite/demote them (even when some family members who \"aren't homo/transphobic\" suggested we do exactly that)",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 264,
          "content": "Think carefully about who is important in this wedding. Kevin or your family. Because if one is pissed off and doesn’t show, which will be worse?",
          "id": 107,
          "comments": [
            {
              "score": 23,
              "content": "THAT RIGHT THERE",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 224,
          "content": "If OP is really concerned about Amy's feelings, then they should talk to OP's family. Tell them if they have mean shit to say, they shouldn't show up because that won't be tolerated at the wedding.",
          "id": 109,
          "comments": [
            {
              "score": 55,
              "content": "You hit the nail on the head. Tell them straight up beforehand. And if they start complaining at the wedding, kick them out.",
              "id": 110,
              "comments": [
                {
                  "score": 27,
                  "content": "I hate the 'It will upset conservative family!!' argument. Oh no! Your familt has to be in the same space as an LGBT person for a day!! If they can't suck it up, and keep their mouth shut then they shouldn't be at the wedding. Making remarks or any kind of scene shows that they care more about trying to control strangers (who are doing LITERALLY NOTHING TO THEM) than they do about you and your wedding.  And fuck that. \n\n I just... have a lot of feelings on these 'dilemmas,' as someone who is in a same-sex marriage. I didn't get a choice a to whether I would have bigoted relatives at my wedding. To me, being able to and CHOOSING to involve bigots is a weird flex that just reflects poorly on the person choosing.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "& let them know there is a bouncer ready to remove them from the venue if they’re going to act this way.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Agreed. This is exactly what I’d do.\n\nAmy is Kevin’s family, if you can’t accept her, you don’t need to attend.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Or have a sit down talk about respecting her guests at her wedding? What kind of messed up family is this that she can't trust them to act civil for one day?",
              "id": 114,
              "comments": [
                {
                  "score": 3,
                  "content": "They're certainly family I wouldn't invite!",
                  "id": 115,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 184,
          "content": "And think about what you're saying to Kevin about your future life. Are you going to exclude his best friend/sibling from family events if your family will be there? If you have kids are you going to brush transphobic remarks they make around your kids under the rug, or otherwise allow your kids to be influenced by bigots? Kevin isn't just rethinking the wedding here, he's rethinking the marriage because of what your request tells him about your values. And he's right to do so.\n\nYou should also rethink the marriage because you two may not be compatible if his core values include everyone being deserving of love and respect, and your include placating bigots for the sake of \"peace.\"",
          "id": 116,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 36,
          "content": "This needs an award.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "To piggyback on this… if your family doesn’t already know Amy, what’s the big deal?  She’s just a girl best friend. \n\nGranted, even that - the “girl best friend” - might get a bit of stink-eye in conservative circles… but seriously, who’s going to magically figure out that she was once a “he” at this point?  If Amy’s been medically transitioning for a year, I’m sure she “passes”, right? I’ve seen a few trans timeline things; it doesn’t generally take that long.  So… they don’t have to know, and nigh-surely won’t know without intervention.  And “girl best friend“ would nigh-surely be orders of magnitude less of a “problem.”\n\nUnless, of course the problem is that _you_ know the MTF detail, and that _you_ will make it a problem, be it by letting your family in on it or not.  If the latter, sounds like your complaint is you actively and intentionally making it a problem already.",
          "id": 118,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Beautifully said!",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "> for my very \"traditional\" family",
          "id": 120,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Yes, and to be honest, if I was her fiancé, I would be reconsidering our possible marriage. This is his only family and look at how she’s already trying to treat her.",
          "id": 121,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10944,
      "content": "YTA- Transphobia is a disease, get well soon.",
      "id": 122,
      "comments": [
        {
          "score": 953,
          "content": "I like this! Can I use this for any future transphobic comments I might come across online in the future?",
          "id": 123,
          "comments": [
            {
              "score": 302,
              "content": "ABSOLUTELY! Feel free",
              "id": 124,
              "comments": [
                {
                  "score": 53,
                  "content": "Thank you so much!",
                  "id": 125,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I. Love. Your. Name.\n\nThat is all.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "Nah you’re not allowed. Only she is allowed to ever say that",
              "id": 127,
              "comments": [
                {
                  "score": 15,
                  "content": "Haha too late! I have written consent now 😂",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 139,
          "content": "I imagined you saying this like Kevin's brother in Home Alone\n\n (\"Kevin you're such a disease!\") \n\nAnd now I can't unsee it.\n\nSo from now on when I meet transphobic individuals I'll just imagine Kevin's bro scolding them for being assholes. Thank you",
          "id": 129,
          "comments": [
            {
              "score": 11,
              "content": ":)",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 136,
          "content": "No.  It isn’t a disease, that removes responsibility and agency from the bigots.  Transphobia is a CHOICE, and it needs to be called out as such.  They CHOOSE to be hateful and bigoted",
          "id": 131,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 25,
          "content": "Exactly. \nI have a sister in law who is transitioning (M2F) and her parents are Christian bigots. \n\nThey haven't been overtly abusive in the way that you hear horror stories about sometimes, but still nasty and unaccepting. \n\nGiven how vocal I generally am about my former faith and the immoral bullshit that usually goes along with it, my parents in law and I pretty much have a non existent relationship since my SIL came out. \n\nI pretty much already had one foot out of the church when she came out, but her proximity to me suddenly made it all very real. I had never really had any associations with a trans person before, a byproduct of (I'll admit it) my old bigotry. \n\nBut my SIL coming out made it so much more clear to me that I couldn't just ride the middle, one foot in the church and one foot out, I had to pick a side.\nBecause keeping one foot in meant I was continuing to tacitly accept a role in systemic bigotry, which made me a poor ally.\n\nI'm not saying all churches are bad or that people can't go to church or be Christian without being bigots too.\n\nBut where I was at the time and for my part, I was quietly condoning something I knew deep down was wrong. \n\nSo anyway I left.\n\nAnd recently I was asked if my in laws could come visit our home. \n\nI said sure, as long if she happens to come up in conversation, you call my SIL by her preferred pronouns and name. Otherwise you're not welcome. \n\nThey didn't come visit. \n\nPeople choose what they love most, what they want to invest in.\n\nSome choose closed-mindedness and doctrine and their preconceived notions of correctness.\n\nI chose people, I don't regret that choice; fuck the systemic bigotry and perpetual self-victimhood of the evangelical church.",
          "id": 132,
          "comments": [
            {
              "score": 7,
              "content": "You seem great, at least based on this comment. It’s always nice to hear about people overcoming past bigotry and standing up for their family who happen to be trans. I don’t claim to be the voice of the transgender community, but believe me when I say that we greatly appreciate people like you. Keep it up, comrade!",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Hey I have a real disease, diseases aren't a choice, bigotry is. Don't lump those people in with me.",
          "id": 134,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7519,
      "content": "YTA \n\nYou’re choosing to cater to your family’s bigotry instead of supporting your fiancé to have someone he considers family as a part of his wedding.",
      "id": 135,
      "comments": [
        {
          "score": 793,
          "content": "OP is just ……. Disrespectful of her fiance",
          "id": 136,
          "comments": [
            {
              "score": 160,
              "content": "Oh it isn’t JUST that, but totally",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "She’s no Elegant Scholar that’s for sure",
              "id": 138,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 337,
          "content": "Honestly I think the family is just the excuse. Will not be surprised if op is the transphobic one.",
          "id": 139,
          "comments": [
            {
              "score": 319,
              "content": "Yeah, I saw “ I don't have a problem with Amy” and my first thought was, oh honey, you *so* do.  Best woman is hardly unusual in this day and age.",
              "id": 140,
              "comments": [
                {
                  "score": 18,
                  "content": "My thoughts too. \nI can’t figure out if it is all transphobic or jealousy and insecurity plays a huge part. To me saying Amy can’t be best man but can still come to wedding as a guest kind of smashes her argument. If her family have a problem with transgender people they would have a problem with her whether she was a guest or best man. \nIt sounds more like the bride thinks that now Amy is a woman that maybe Amy and the groom will have some sort of affair and the bride is trying to distance her fiancé from Amy to prevent that. \nDemoting Amy from best man to guest sounds like a power play to put Amy in her place.\nIt’s little things in the brides statement about not being consulted if it was ok to be ok with Amy coming out. That has ZERO to do with her. Her fiancé and Amy are besties that’s their relationship. That whole sentence just screamed insecure as now groom has another woman in his life. \n\nBride needs to realise Amy and Fiancé are not going to run off with each other. \nYes they love each other but bestie love is different. They will always be special to each other no matter what.\n\nIt’s 2023! Brides/ grooms can have whom ever they want stood with them at the alter. \nBrides family should come join the rest of us in 2023 and learn to mind their business and just be grateful to have been invited to share the special day.\n\n(But still I think bride is SUPER jealous of Amy) \n\nBride YTA massive, massive AH.",
                  "id": 141,
                  "comments": [
                    {
                      "score": 12,
                      "content": "“  (But still I think bride is SUPER jealous of Amy)”\n\nTo wander off down an entirely not-serious side alley, my ex just came out as a transwoman and is rocking miniskirts and spike heels on legs up to my armpits and I am SUPER JEALOUS and can relate. #shortfatanddumpy #transwomenrock",
                      "id": 142,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Honestly, I think it's about pictures... If she sticks her in a table in the back as a guest, she's not going to be in a lot of the pictures. I know it's purely speculation, but that's what I'd put my money on.",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "That wording always bugs me. When I talk about important people I don’t say “oh yeah, I don’t have a problem with them “ I say things like “I love that person! They always make me laugh “ or something \n\nIn fact usually when my boss asks what I think of a new employee I don’t really like, then I say “i don’t have a problem with them”",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 51,
              "content": "It’s probably all of them, OP and fam, but OP doesn’t want to admit she’s just as bad. If she wasn’t then she’d be standing up to her family instead of being completely spineless.",
              "id": 145,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 198,
          "content": "_\"**Our** wedding is largely **for my very traditional family**.\"_ ..... OP has her priorities out of wack. She cares more about pleasing bigots that her actual relationship/marriage. \n\nI'm also side-eyeing OP. If you are truly against hateful, bigoted, phobic, racist people, then you stand against them; you don't cater to their hatred. If OP is so concerned that some of her family members have zero self control and will act like savages on her wedding day, then why not uninvite those people?",
          "id": 146,
          "comments": [
            {
              "score": 8,
              "content": "If my family told me they wouldn't come to my wedding because a trans person would be there those people wouldn't be my family anymore",
              "id": 147,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "> instead of supporting your fiancé to have someone he considers family\n\nNot just someone he considers family.  The only person (besides OP) that he considers family.  OP is literally banning his only family member from being part of the wedding.",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "right? if his family can’t even exist comfortably without upsetting your family, you should reconsider 1.) blending them and 2.) what “family” means both now and post-marriage.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "right. she's essentially saying \"uninvite your only family because my *blood* family, which is more important, will be uncomfortable\" \nYTA",
          "id": 150,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "“Hey guys, AITA?  My fiancé wants to bring their black friend to my wedding knowing full well that my neo-nazi, KKK loving family will have issue with it. Is it too much to ask for a little respect for my family’s bigotry and hatred as this wedding is mostly for them?”",
          "id": 151,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6453,
      "content": "YTA and personally I think Kevin should cancel the wedding.  You've revealed your colors.\n\nIf you're willing to 86 his best friend from the wedding to placate your conservative family... You should probably just find a conservative husband rather than one who cares about his friends.\n\nYour husband sounds like a great guy, and you don't deserve him.",
      "id": 152,
      "comments": [
        {
          "score": 2538,
          "content": "Right? \"He just decided to accept Amy and love her unconditionally, without even talking to me about it!\"",
          "id": 153,
          "comments": [
            {
              "score": 978,
              "content": "\"honey my best friend just came out as trans, what are our thoughts about this? 🤔\"",
              "id": 154,
              "comments": [
                {
                  "score": 757,
                  "content": "\"Oh your family is against it? Well I'll just go tell my best friend to go fuck herself then to make your fam happy k.\"",
                  "id": 155,
                  "comments": [
                    {
                      "score": 187,
                      "content": "\"OMG what are you using She/her pronouns for (dead name)?! We didn't discuss this!\" /S",
                      "id": 156,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 258,
              "content": "This right here! That spoke volumes to me at how she expects this marriage to go and that is he must consult her before he can accept somebody’s way of life or if he is allowed to scratch his ass. He needs to run and run fast.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 149,
              "content": "Good catch on “he just decided…” Hopefully “he just decides” that the wedding and relationship is cancelled.\n\nYTA OP, and also transphobic like your family.",
              "id": 158,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "The \"he didn't even consult me\" part is what really got me. I really hope this guy runs for the hills or this lady gets a grip on her priorities.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Oh, I missed that part. Yikes",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "How dare he! Honestly I hope this makes Kevin rethink everything. Usually I say no matter what side with your partner over your friend but in this case I hope he chooses his friend over his partner and OP becomes the ex.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 142,
          "content": "OP needs to get really comfortable with not giving a shit if her family’s bigotry makes them uncomfortable. What’s she gonna do in 15 years when one of her tweens tells her they’re gay or trans? “That’s great honey, and I still love you, but you can’t tell anyone because my family would be uncomfortable with it.” Then she’ll be too dense to understand how her kid ended up dead when she locked them in a closet with a razor blade.",
          "id": 162,
          "comments": [
            {
              "score": 27,
              "content": "As a parent who has lived this, I will also say that transphobic family members who have known someone before transitioning (I'm assuming that is the case as Amy was always in the wedding party), can change when they realize that trans people are, gasp, people they already know and like.",
              "id": 163,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "OP needs to see this comment.\n\nI'm a mum of a trans teen.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Reminds me of one of my best friends when I was in high school. He had dated girls superficially but he when you got down to it .. he was gay. He finally got the courage to tell his mother and stepdad. His stepdad didn’t care. My friends family were old school Turkish. I just remember his mom telling him “no you’re not” when he told he was gay. Then it was “don’t you say a word to your grandparents” and basically expecting him to shove it down and pretend he wasn’t. We lost touch unfortunately and he ended up marrying a woman and I always wonder if he is truly happy.. or if he felt forced into that life bc he couldn’t get past that rejection from his family. Which would be sad for both him and his wife if it’s the second.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "What’s 86?",
          "id": 166,
          "comments": [
            {
              "score": 17,
              "content": "\"Eighty-six or 86 is American English slang used to indicate that an item is no longer available, traditionally from a food or drinks establishment; or referring to a person or people who are not welcome in the premises. Its etymology is unknown but seems to have been coined in the 1920s or 1930s.\n\nThe term is now more generally used to mean getting rid of someone or something. In the 1970s, its meaning expanded to refer to murder.\"\n\nhttps://en.m.wikipedia.org/wiki/86_(term)",
              "id": 167,
              "comments": [
                {
                  "score": 3,
                  "content": "Today I learnt! Thank you!",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "I respectfully disagree here. She can get past this and be a better person, if she is truly reading the comments and taking them in. People change all the time. I am not negating the transphobia here either, so please don't get me wrong.",
          "id": 169,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "When people show you who they are, believe them\n\nOP YTA",
          "id": 170,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Agreed. I hope he's on Reddit and sees this.",
          "id": 171,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3220,
      "content": "[deleted]",
      "id": 172,
      "comments": [
        {
          "score": 422,
          "content": "The first thing OP will do entering this marriage is to dismiss her husband and ruin her relationship with his best friend. I can already see her next post being \"My husband's best friend hates me! I told him to choose between me and her and he chose her!\".",
          "id": 173,
          "comments": [
            {
              "score": 104,
              "content": "I don't get why her family is so against a woman best man. They have no right or business knowing that she haven't always been a woman.",
              "id": 174,
              "comments": [
                {
                  "score": 70,
                  "content": "Not every trans person can or wants to “pass” like that but I agree, if she chooses to present in that way there’s no reason to “out” her unnecessarily to those not already in the know.",
                  "id": 175,
                  "comments": [
                    {
                      "score": 5,
                      "content": "But even if she’s NOT passing (since she’s medically transitioning she probably is passing), no one deserves an explanation. \n\n“Uncle Bob, this is Amy, she’s Kevin’s best person.” \n\nThe only question that’s acceptable to answer is, “How long/does Amy know Kevin?” \n\n“They met at work over a decade ago! They’re really close. More family than friends.” \n\nLike seriously, that’s ALL the explanation anyone deserves. End of story. People don’t DESERVE to be told anything",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "It might be a case where they knew her before she started to transition. Also in her best man speech she might bring up memories from when they met or when they were younger that might make people realize (not a bad thing just stating). Or ask someone \"I thought the best man was a guy named Kevin?\" to someone and the person just tells them.\n\nWe don't know the level amy is on being open as well. Some trans people don't care who knows/tells anyone who asks and some do.",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Yeah unless it's obvious she's trans by just looking at her, there's no reason they even need to know.\n\nAnd since she's been on HRT for at least 2-3 years she most likely doesn't look masculine still so.",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "They could just change the title to \"Best Lady\" if it's going to bother them. Easy fix",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "She made it clear she views this her family’s wedding, and a shared wedding between the the two of them. Whole ordeal is red flags.",
          "id": 180,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Generally when people insist they “don’t have a problem” with someone or something they do.",
          "id": 181,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2228,
      "content": "“But Im not sure he gets it” no he gets it. Your family is transphobic and you’re willing to bend to their will for it.\n\nHe on the other hand chooses to stand up for his friend and hold firm against hate and bigotry. \nId recommend following his lead",
      "id": 182,
      "comments": [
        {
          "score": 327,
          "content": "Um, OP is transphobic, as well. Not just her family. The bigotry is strong in this one. Probably a good thing their wedding was postponed until now so that her fiancé could see her true colors. \n\nWhat would come next? Potential future children being shielded from a person he considers family? Making him choose between her and you? OP, you either need to address your inherent bigotry, and work in it, or you need to walk away before you further damage this innocent person your partner holds as his family.",
          "id": 183,
          "comments": [
            {
              "score": 15,
              "content": "I think she doesn't give a shit about her family OR Amy. She just wants her picture perfect wedding and is trying to avoid any conflict that can mess up her little fantasy.",
              "id": 184,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "Functionally there is no difference between a transphobe and someone who caters to them.",
          "id": 185,
          "comments": [
            {
              "score": 3,
              "content": "Such a good comment. Please accept my cheap ass award: 🏆",
              "id": 186,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Right?! Like he and Amy have been living in a magical land where trans folks aren’t on the receiving end of violence on an individual and systemic level nonstop? I’m sure they both are aware of the realities of what the response of some wedding guests will be because this is Amy’s everyday reality.",
          "id": 187,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1169,
      "content": "Yta\n\nShe is his family. You're getting married.  She should be your family too.\n\n\nHonestly, I truly hope your fiancee gets out while he can.\n\n\nYour part of the problem just FYI.",
      "id": 188,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1059,
      "content": "Here's what you're telling your soon to be husband.\n\n\"The comfort of my family is more important than your part of the wedding\".\n\nIf your family is uncomfortable with a trans woman being the best woman, that's their issue, not yours or your fiance's.\n\nYTA",
      "id": 189,
      "comments": [
        {
          "score": 79,
          "content": "But think of her poor aunt and uncle that watch news max and OAN all day. She’ll potentially share a bathroom with a transgender woman. And Is he just supposed to sit and let his wife experience such a traumatic event? They’ll never be able to live a normal life again.",
          "id": 190,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Not to mention it seems like the fiancé doesn't even really want to get married, he's just doing it for her. If he goes through with it, he'll not only be catering to her with marriage, but also with her hateful attitude, and then what?",
          "id": 191,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yes, exactly. Also I suspect that when Kevin said “I don’t care about the wedding”, what that actually meant is “you can customise it mostly to your tastes and not worry about me”. But this isn’t an issue of what colour scheme to go for or what font is on the invites or if Great Aunt Ethel should be invited, it’s “I want my sister to be in the wedding party”. Which is a big thing that’s clearly something he cares about, understandably so. \n\nOP clearly cares about how her family is involved and their comfort and their bigoted “needs”. But she can’t understand why it’s important that her fiancé - who was kicked out of his house as a teenager and probably has experienced a lot of family-related loss, hurt, abuse, and betrayal - gets to have his found family be a big part of the day?",
          "id": 192,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I think this comment covers most of my gripes with what OP said. Amy is the closest thing he has to a family and you choose to ignore the one person your soon to be husband chose to be there.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 870,
      "content": "INFO: If the issue is \"tradition\", why not have Amy as a bridesmaid? You knew this might be an issue for almost 3 years - surely you and the man you're planning to marry discussed this.",
      "id": 194,
      "comments": [
        {
          "score": 553,
          "content": "The issue isn’t actually “tradition” it’s bigotry attempting to cloak itself as tradition. Her family doesn’t have any need to worry about who the groom chooses for his side of the wedding party. Her family could start a new tradition by just keeping their mouths shut for a few hours and then they can all go home and talk amongst themselves about how they are so offended or whatever.",
          "id": 195,
          "comments": [
            {
              "score": 63,
              "content": "This exactly! I'm so sick of people using \"traditional\" as code for bigoted!",
              "id": 196,
              "comments": [
                {
                  "score": 20,
                  "content": "Their other favorite is “old fashioned” and every time someone tries that nonsense I tell them “old fashioned is churning your butter, what describing is bigotry/misogyny/whatever.”",
                  "id": 197,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Yes! That one too. I like your response. I'll have to remember that one.",
                      "id": 198,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 340,
          "content": "Why can’t she be his best woman? It’s still the fiancés best friend.",
          "id": 199,
          "comments": [
            {
              "score": 281,
              "content": "At my wedding, we had a best woman. She wore the same style dress as my bridesmaids, but in black. OP is transphobic as fuck.",
              "id": 200,
              "comments": [
                {
                  "score": 297,
                  "content": "I’m a CIS man and I’ve been a braids maid twice. Tuxedos come in a lot of colors.",
                  "id": 201,
                  "comments": [
                    {
                      "score": 51,
                      "content": "Absolutely beautiful comment.",
                      "id": 202,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "Honestly, most of the time I would choose to wear a tuxedo instead of a dress. Better pockets. ;-)",
                      "id": 203,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Being a male brides maid not once but twice is probably worth sharing the story. Extremely uncommon",
                      "id": 204,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Lots of options for people who are reasonable. Was best man where a woman was on the grooms side. A respectable discussion was had about how to handle. Consensus was let the groomswoman take the lead but final call was bride and groom. Turns out she was super excited to be given the choice and opted for the tux. Verified with the tux rental company they could manage any fit issues. The bride and groom easily approved and we were good to go.",
                      "id": 205,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "You. I like you.",
                      "id": 206,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "One of my friends had her male best friend as her man of honor. It was very sweet. I loved it.",
                      "id": 207,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 78,
                  "content": "My maid of honor was male. So I guess he was a man of honor? He wore what the groomsmen wore. \n\nI doubt this has anything to do with the groom’s party not being one gender though. Sounds more like trying to protect transphobic family’s opinions while hiding her own transphobia.",
                  "id": 208,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Would a male maid of honor be a \"butler of honor\"? Sounds like an opportunity to have some fun. Dress in the full stereotypical butler outfit with long coattails and white gloves (assuming the bride wants that).",
                      "id": 209,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "My SIL had a Man of Honor for her wedding. And guess what her incredibly conservative family did about it. Absolutely nothing. I’m positive the grandparents had issues, but they only voiced them to bride’s parents, who wisely chose to not pass it on to her.",
                      "id": 210,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 67,
                  "content": "I was a bridesmaid in a wedding with a grooms woman. Walked down the aisle with her, and she wore a tux. (I can 100% understand why Amy wouldn’t wear a tux, for the record. This wedding was a little more laid back, we wore Converse sneakers with our dresses, she just wanted to wear a tux because she was standing with the men.) Tradition be damned. Nothing ever changes if we allow “tradition” to keep perpetuating bigotry.",
                  "id": 211,
                  "comments": [
                    {
                      "score": 35,
                      "content": ">Nothing ever changes if we allow “tradition” to keep perpetuating bigotry.\n\nA-fucking-men!",
                      "id": 212,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I was a groomsmaid or whatever its called and was told I'm welcome to match the guys tuxedo colors in a suit or wear the bridesmaids dress. Lovely to have the option first of all. I did really want to do the suit, would have felt so bad ass(!!!) but I would need to purchase it to tailor it, and it was a financial decision to opt for the dress. Still actually lovely and flattering dress, so it's not like I was saddled with some bad choice. Still want a suit though too, but I'm not getting any smaller so it was the better financial decision in the long run too.",
                      "id": 213,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "My friend's wedding was meant to have a best woman, but she got covid trapped in Australia\n\nSo his dad was best man.\n\nOne of the groomsmen was a woman though. She wore the same kilt suit as the lads.",
                  "id": 214,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I bet the kilt looked sharp as fuck!",
                      "id": 215,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Seriously. One of my \"groomsmen\" was a woman and my best man was trans. My partner has a traditional family as well, but there is a difference between traditional and sexist/transphobic. It's their wedding and he should be allowed to pick who he wants in his wedding party, clearly this has nothing to do with family traditions and more to do with bigotry.",
                  "id": 216,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "You're right just that comment is trying to show how it's really not about \"tradition.\" If it had been even if OP isn't in the right it would have easily been a suggestion she could offer. Many sisters are in the bridal party even if they aren't close to the bride per se. So it's not an insane suggestion although if he said no he is fully in his right cause at the end of the day mixed gender parties on both sides is totally normal",
              "id": 217,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 185,
          "content": "The groom wants his best friend and family to stand by him on his wedding day. It doesn't matter to him the friend is a woman in a dress. He wants his best friend standing by his side, getting ready with him, being his support system. The groom deserves that.",
          "id": 218,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 71,
          "content": "No, her fiancé deserves to have his best friend standing at his side, not his transphobic fiance’s",
          "id": 219,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "> why not have Amy as a bridesmaid?\n\nNo, absolutely no.  Amy has been chosen by Kevin to be there to support Kevin, not the OP.  Kevin is an adult, Kevin can choose who they want to stand next to them when they get married.  Screw the idea of shuffling Amy off to the side, Kevin wants them by their side as the \"best man\", the friend that stands right beside them, that is who Kevin gets.",
          "id": 220,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Fuck that. She’s his best friend. She should stand next to him",
          "id": 221,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "It’s not, “traditional” is just a dog whistle for bigotry used by shitty people who know they’re wrong but don’t want to change.\n\nIt’s coded language, a loophole, a facade used by hateful people to be hateful while avoiding the embarrassment of their ignorance. It’s designed to distract. To give an out, “I’m not a bigot, I just have these traditions you see” — never mind that the tradition is one exclusion and oppression.\n\nAs if the longevity of hate is an excuse to perpetuate it.\n\nOp’s family are, apparently, happy to vocalize their hate in these couched terms because it allows Op and others like her to allow them to maintain a veneer of moral authority, however thin and transparent. They’re not bigots, it’s just *traditional*.\n\nOp is 100% the asshole for enabling this bigotry and even more so for favoring it over her future husband’s family and in direct opposition to his support for her. I hope he gets out now because this doesn’t seem likely to improve.",
          "id": 222,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "Because they don’t really have a problem with a woman being best “man,” they’re just offended that a trans person might enter their field of vision.",
          "id": 223,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "It's because the tradition isn't having a best man vs. having a best woman, the tradition is transphobic bigotry.",
          "id": 224,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "This^^ Several of my male friends were groomsmen on my husbands side for our wedding. If it was really about tradition they would make Amy a bridesmaid but it's not. OP doesn't respect Amy as a woman or as a man because they don't fit into OPs convenient gender box. Therefore OP would rather exclude Amy from the event altogether despite her being the only family the fiance has.",
          "id": 225,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}