{
  "post content": "My husband (39) and I have been married for 5 years. We have two children of our own, both girls, aged 5 and 2. I also have a son (10) from a previous marriage, but I was widowed.\n\nMy husband's ex is barely involved in stepson's life at all. They got divorced when stepson was 2, and his ex wanted \"a fresh start\" so my husband did the decent selfless thing and had complete custody of their son, even though he'd wanted shared custody.\n\nI got a bonus at work and I really want to go on vacation with just MY family JUST once. We've been on family vacations all together lots of times. But just once I want to spend MY money going on vacation where I'm not looking after someone else's kid. I want stepson to stay with his mom while we go on vacation. My husband sees my point of view and is okay with it. I don't think I'm being at all unreasonable.\n\nMy mom found out what I was planning and says I'm being a complete AH. These are the reasons she says I could be the AH:\n\n1. My mom says that if stepson's mom isn't properly involved in his life, I should be even more involved in his life to compensate (I think this is a completely unfair expectation).\n2. She also says that I'm being a hypocrite taking my son, but I think that's totally different because my son DOESN'T HAVE ANOTHER PARENT. I'm all he's got.\n\nIf stepson's mom won't take him just for once then obviously he'll come on vacation with us. But I don't think I'm the AH to ask if I can have a vacation with my own family just one time. It's not like I hate stepson or something, he's a nice kid, he's just not mine. Am I the AH?\n\nUPDATE:\n\nWe definitely won't be going on vacation without stepson.\r  \n\r\n\nAfter a couple hours of replies, I decided to show this to my husband. We sat down and had a really long talk about it. He told me he's never been comfortable with my attitude to stepson, but didn't know how to say to me before.\r  \n\r  \nI don't want to be a bad person, I just never thought of stepchildren being \"yours\". \rI don't think it would be easy for anyone to accept this level of criticism, but all your replies have shown me I have a LOT of work to do. As many of you suggested (and so did my husband) I intend to see a therapist to help me with that.\r As I said, I don't hate stepson in any way, I have never been deliberately cruel to him, I've just always thought of him as my husband's child. But I realize my mindset needs to change.\n\n\rSo I'm going to start working on that. I want my family to be the best it can be, and I need to accept that it includes my stepson. I understand that now, and I'm going to start seeing a therapist to become a better person (we've also talked about maybe having family therapy too). I've also made up with my mom, and she is 100% behind the changes I want to make in my life.\r  \n\r  \nIt wasn't easy to hear everything you said, but I understand that I needed to hear it.",
  "id": 1,
  "comments": [
    {
      "score": 71536,
      "content": ">just MY family JUST once\n\nYour husband's son is your family, and you better not ever let that kid hear you say otherwise. Jesus christ. \n\n>I'm not looking after someone else's kid.\n\nHomie that ship fucking sailed when you married a man with a child. \n\n>I don't think I'm the AH to ask if I can have a vacation with my own family just one time.\n\nWanting a vacation with your family is fine. Deciding that your stepson doesn't count as family is fucked up beyond belief and definitely makes you an AH. YTA",
      "id": 2,
      "comments": [
        {
          "score": 23405,
          "content": "All of this and a bag of chips!  SAY IT LOUDER FOR THE PEOPLE IN THE BACK!!!",
          "id": 3,
          "comments": [
            {
              "score": 21296,
              "content": "I couldn’t have said it any better myself!\n\nThe AUDACITY of this woman is honestly astonishing! I’ve been with my boyfriend for about 2 and a half years and I literally could never even DREAM of trying to tell him that I didn’t want one of his 3 children to come with us on vacation. His oldest (16m) isn’t even biologically HIS and he still takes him whenever he picks up his biological children from their mothers house. We would never, EVER exclude him from any family fun trip we were taking. \n\nOP: You’re definitely a HUGE asshole in this situation and it’s weird that your own mother was the one to tell you this and NOT your husband. \n\nWhen you married your husband, his son became your step-son, just like your son became his step-son.  How would you feel if he wanted to exclude your son? You said yourself that your step-sons mother isn’t a very attentive mother and maybe that’s not the same thing as having a deceased parent but fuck lady! Have some goddamn empathy!\n\nEdited for typos.",
              "id": 4,
              "comments": [
                {
                  "score": 15321,
                  "content": "MY money. MY family. \n\nI am heartbroken for this child. He was already abandoned by his biological mother. Now, the mother figure in his life doesn't want him either. Doesn't consider him family. How awful for this poor boy. \n\nI hope his dad realizes what he married and gets out of it so his son can be in a safe place where he is only surrounded by people that love him and want him.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 7227,
                      "content": "Dad is obviously just as much as an AH. He only begrudgingly accepted full custody and is totally on board with her plans. What kind of parent marries someone that treats their child like garbage, and is ok with it? A garbage one.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "This guy's ability to pick partners is busted.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3525,
                  "content": "Yes, but if you'll notice, she said she was widowed! Apparently this makes a giant difference ON whether or not you can love the other person's child.. you see her child is perfect and precious because there's no one else involved in his life, he doesn't have another parent, so the stepfather has to be the parent. BUT HIS CHILD has a living mom you see, and God for fucking bid you take care of that kid! This woman is just.. I have no words.. she's a monster such a fucking asshole and no I don't normally curse in responses but OH MY GOD.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 1335,
                      "content": "Oh yes! I forgot she was widowed, my bad! I take back everything I said. I forgot that having a dead parent is NOT the same thing as having an absent parent! Even though the OP, herself, stated her husband has FULL fucking custody of this innocent little 9 year old boy. \n/s\n\nI’m literally still FUMING about this post! I absolutely cannot get over how selfish this woman this. If I told my boyfriend that I wanted to take a vacation but only with him and MY child and his children could pretty much go fuck themselves because they’re not apart of MY family and it was MY money I was spending, he would ABSOLUTELY (and rightfully so!) tell me to fuck off and break up with me. I honestly can’t begin to imagine what gave her the gall to even think this way, let alone GO ON THE INTERNET AND ASK STRANGERS what their take was! How is her husband on her side?! They’re both assholes! I wish I knew this family so I could adopt that little baby boy and take him away from his terrible fucking “family”.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 209,
                      "content": "Her husband is no better.  How is he ok with her feeling like HIS son isn't  her REAL family.   That kid deserves so much better than what he has!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 116,
                      "content": "When she said that part, the sheer disgust factor went up for me. If she wants to get technical her son isn’t her husbands son, so he shouldn’t go either according to her logic. But this post made me feel grateful I could never think like that.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "My dad wasn't really present in my life and less in my younger brother's life when we were younger, in part because he was active duty military and still moved around after my parents separated. I absolutely do not begrudge my step-siblings for considering him their dad also. Heck, my dad and their mom were only married for 11 years, and 30 years on he's still their dad.\n\nThey're all my family.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1657,
                  "content": "[deleted]",
                  "id": 13,
                  "comments": [
                    {
                      "score": 203,
                      "content": "And I’m sure OP expects her husband to treat her son (his step son) like family.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 30,
                      "content": "Even worse is the father of the child is ok with it. They are both terrible people.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 23,
                      "content": "I have kids. My husband has one and 2 step kids(half siblings to his kid) . They’re all adults now, but all of them have always been welcome at our home, no matter what. Heck, when we got together, his stepson lived with him, due to whatever issues at his mothers home. I never looked at them as anything but my family. \nOver the years, all of them have spent time with us, whether living here for however long, or coming for a visit with their new families, and they know they’re always welcome. \nOne of the kids was so sad when she last visited, realizing that of all her siblings(meaning all steps/half, step-step(?), etc) she would forever be the shortest. She didn’t consider whether blood or not, just her blood relatives. \nBecause this is what you teach kids by example. There’s no separation once you’re married. They all belong, and they all consider each other as siblings, and aunt/uncle to their kids.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "And dad sees her point.. he’s as bad as her.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1192,
                  "content": "And this kid is only *nine* years old. Imagine treating a little child this way.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 156,
                      "content": "He has a step brother who is 10. She doesn’t say anything about them not getting along, so they probably DO get along. It’s an easy age and there’s 2 of them!  That’s an easy kid situation right there, plus they can help with the younger ones. So what is she complaining about?  \n\nOP, you’re the AH.  Listen to your mother.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 28,
                      "content": "They have children together with the older being 5. So she has been in the child’s life since he was at least 4 maybe 3? Cruel. YTA",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "She probably makes him sleep in a closet under the stairs.",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1239,
              "content": ">My husband sees my point of view and is okay with it.\n\nJesus Christ. I hope someone helps this poor boy.",
              "id": 22,
              "comments": [
                {
                  "score": 222,
                  "content": "His father is also a massive AH for \"understanding her point of view\" and being ok with it. What kind of parent would be ok with that, sounds like her mother is the only decent adult in this boys life maybe he should ho live with her, I think he'd be better off. And OP in case you don't get it you are a huge gaping shit filled AH of a person who clearly doesn't deserve the title of step mum, you are the evil step mother stories like cindarella are written for",
                  "id": 23,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 24,
                  "content": "Right?! The only person who seems to care about this poor kid is his step-grandmother!\n\nOP, listen to your mother and have some compassion. If something happened to you, would you want someone to treat your daughters this way if your husband remarried?! You’re not just an asshole, you’re cold and lack compassion for this poor boy.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 441,
              "content": "I’d say make it a family size bag of chips but I’m pretty sure OP wouldn’t really know what that means.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 355,
              "content": "As a son whose resented by his step father and his own mother you are a massive AH",
              "id": 26,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 181,
              "content": "I bet OP is counting the days until step son's 18th birthday",
              "id": 27,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "Yells to make sure everyone can hear OP YTA!!!!!",
              "id": 28,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5048,
          "content": "She also has a son from previous marriage. I wonder how fine she'd be if her hubby didn't take her son on trips and use the same excuse she did",
          "id": 29,
          "comments": [
            {
              "score": 2245,
              "content": "OP thinks it’s “totally” different because her former partner is deceased and her son doesn’t have another parent.  WTF",
              "id": 30,
              "comments": [
                {
                  "score": 1233,
                  "content": "That's so weird. The stepson's other parent doesn't want him. But she is okay saddling him with her as she is alive. It's as if being alive is the only criterion to parent. OP makes me irrationally angry. OP is truly an AH.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 577,
                      "content": "He probably already has some abandonment issues and she wants to make it worse.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 454,
                      "content": "OP is just as trash as bio mom it seems. She wants her husband to have a “fresh start” just like her step sons bio mom got and that fresh start is just “HER family” that’s why it’s okay for her son to not get dropped off with granny and gets to attend the family vacation. \n\nShame on you OP if you didn’t want to take care of someone else’s kid shouldn’t have gone for a man with a child. That child was also FOUR when you met him you’re probably the only maternal figure he has and you’re rejecting tf out of him that poor kid. \n\nProbably one of the biggest AH I’ve had the displeasure of reading about.",
                      "id": 33,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 201,
                      "content": "Seriously, I feel so bad for this poor kid. To be unwanted by your own mother and your stepmother. OP, YTA",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 408,
                  "content": "The stepson also barely has another parent from what it sounds like!\n\nOP's mom must be wondering where tf she went wrong raising her, for her to turn out as a Disney stepmother.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 151,
                      "content": "I was humming “Cruella DeVille” in my head while reading this.  OP knew when she got married to her husband that he was a full time parent with the mom fully not in the picture.  I feel so bad for her step son.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 202,
                  "content": "That part really rubbed me the wrong way, like the stepson's mom LEFT. Stepson ALSO doesn't have anyone other than his dad. Obviously doesn't have his step mom. What an AH.",
                  "id": 37,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 197,
                  "content": "She should just admit she doesn’t like the step son instead of pretending it’s about this terrible logic.  The kid lives with them full time.  How can you reason to exclude him?",
                  "id": 38,
                  "comments": [
                    {
                      "score": 205,
                      "content": "And all of the overdramatic all-caps emphasis: MY money, MY family… OP is a major selfish, completely lacking in empathy, human bag of shit. I’m betting stepson already gets some Cinderella treatment at home, because it’s very hard to conceal one’s true emotions. I want so badly to adopt stepson. He deserves so much more than his current situation.",
                      "id": 39,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "Exactly. It'd be one thing if she wanted to have a girls weekend and just be her and the daughters. It's be fine if she wanted a couples trip with no kids. But to exclude *just* the stepson is ridiculous",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "Having a deceased parent who you know loved you almost seems like a silver lining to having two “moms” who want nothing to do with you. Poor kid.",
                  "id": 41,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 25,
              "content": "Exactly. Her reasoning is that her son doesn't have another parent, but neither does her stepson. His mom doesn't want him and if that isn't a hard enough thing to deal with as a kid, his stepmom wants to dump him with his mom while they are on vacation with the REAL family he apparently isn't a part of. I feel so sorry for the kid and OP you are. One. Gigantic. AH. YTA",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Yeah, seriously why can’t the older son’s paternal grandparents/relatives watch him so y’all can pretend you’re a happy little intact family of four?",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": ">”But I was widowed.”\n\nFrankly, it’s neither kid’s doing that they are missing a parent, their family isn’t intact, or how that came about. The kids don’t choose!\n\nNow she should picture her husband asking to go with just “their” or “his” kids. It’s grossly unfair, and OP knows it.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1400,
          "content": ">Your husband's son is your family, and you better not ever let that kid hear you say otherwise. Jesus christ.\n\nI'd bet money he already has. I'm sure she's made her opinion very clear.\n\nThat poor kid is 9 yo. OP talking about how her husband did the selfless thing. That was his kid. That's not selfless, that's called taking care of his responsibilities.\n\nIt's sad that OP's mom understands the situation better than she does.\n\nOP, you're 100%, absolutely, totally TA.",
          "id": 45,
          "comments": [
            {
              "score": 540,
              "content": "I don’t understand how this witch can even think that this is ok.  The kid is your husbands kid.  The kid lives with them.  She married the guy knowing he had a kid living with him.  What a monster.\n\nYou AND your hubby ate both assholes\n\nEdit:  ARE both AH, but since ate assholes are  giving so much pleasure ima let it stand.  😂",
              "id": 46,
              "comments": [
                {
                  "score": 223,
                  "content": "\"ate both assholes\" I'm dying",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 143,
                  "content": "Yes, let's please not forget that the \"selfless\" husband is condoning this abhorrent behavior.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Right?! She's alienating the kid. Unless she left something heinous out about this boy, I'm kind of appalled at her thinking this even needs to be asked.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 619,
          "content": "I really wish the god blessed spouses could see this bullshit. \n\nThe best of this woman ran down her mother's leg the night she was conceived. .....\n\n\nWHY THE FUCK DID YOU MARRY AND PROCREATE WITH SOMEONE THAT HAD A CHILD YOU DIDNT WANT TO DEAL WITH.  \n\n\nYOUR A SHITTY MOM. \n\n\nI really fucking hope your husband sees this. \n\nASSSSSHOLLEEEEEEEEEEE",
          "id": 50,
          "comments": [
            {
              "score": 146,
              "content": "It sounds like that poor kids dad agrees with her! Both of this boys parents and his stepmom all suck so much.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 561,
          "content": "And I would like to add that the husband is an AH too for agreeing with her!!!!!!! Wtaf!!!!! This poor boy. It's like nobody wants him 😞",
          "id": 52,
          "comments": [
            {
              "score": 85,
              "content": "Major Ick! Yes OP's husband is absolutely an AH too. OP's mom on the other hand.. what a great grandmother!",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 343,
          "content": "And not only did she know he had a child, she knew he had full custody of said child. \n\nI bet if her husband wanted to pay for a vacation for just HIS family and said her son could stay at his grandparents, her damn head would explode.\n\n“My son only has one parent”\nIn all practicality, so does his son. But at least her son has a decent step parent who’s willing to step up. His son obviously doesn’t.",
          "id": 54,
          "comments": [
            {
              "score": 206,
              "content": "\"He did the decent selfless thing\" and took full custody of his own kid. YTA AND SO IS YOUR HUSBAND",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "& why marry a man with a son if this was how she was gonna behave 🙄",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "All of this\nJesus christ\nAs a stepdaughter to a stepdad (who luckily is amazing) I just hurt reading this.\n\nEdit \n\nThe dad is also an asshole for being okay with this.\n\nSo YTA and dad is the asshole\n\nAnd oh wauw what a selfless thing to do to have custody \n\nThis post is barf and i feel sorry for the kid",
          "id": 57,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15276,
      "content": "YTA\n\nLike, you're one of the biggest AHs I've ever seen on this sub, and that's really saying something. You shouldn't be allowed to be a parent. My heart is absolutely shattered for that poor little boy. I don't know what's broken in your brain or soul, but there's something deeply, pathologically wrong with you.\n\n>I got a bonus at work and I really want to go on vacation with just MY family JUST once. \n\nThat little boy IS your family, and it's staggeringly awful that you keep repeating over and over that he isn't. You and his father are the only meaningful, involved parental figures that he has. HE IS YOUR FAMILY. And I have no words to describe how appalling it is that you would keep insisting that he isn't.\n\n>I want to spend MY money going on vacation where I'm not looking after someone else's kid. \n\nYou mean YOUR HUSBAND'S kid? The child who doesn't have another mother figure in his life in any meaningful way other than you? Is this honestly how you see this child, who has been living with you full-time, 24/7/365 for the last half-decade?\n\n>My husband sees my point of view and is okay with it. \n\nThen your husband is also an AH.\n\n>I don't think I'm being at all unreasonable.\n\nYou're wrong. You're objectively wrong. From every possible angle, through every possible lens except a flat-out sociopathic, sadistic one, you're wrong. You're literally trying to argue that a little boy who has no other family than you should be excluded from your family vacation because you didn't \"choose\" or give birth to him, and you don't want him. It's not reasonable, it's fucking monstrous.\n\n>My mom says that if stepson's mom isn't properly involved in his life, I should be even more involved in his life to compensate (I think this is a completely unfair expectation).\n\nOf course you think it's unfair. His mother literally abandoned him, and you don't want him either. Your mother is a kind, empathetic person who very reasonably thinks that when you marry someone with a child, and that child has no involved mother figure in their life (and you literally have children of your own and ostensibly are capable of maternal feelings and behaviour) that the logical thing would be to \"bring him into the fold\" so to speak and treat him as your own. You see a child whose own mother didn't want him, you get into a relationship with his father - not only his parent but his only family - and see an excuse to separate him further from that one stable figure.\n\nYeah, she's definitely the one who's got the skewed POV.\n\n>She also says that I'm being a hypocrite taking my son, but I think that's totally different because my son DOESN'T HAVE ANOTHER PARENT. I'm all he's got.\n\nAs your mother rightly pointed out, your stepson doesn't have anyone except you and your husband either. His mother abandoned him. For all intents and purposes she is not his parent and hasn't been in years. She gave up all custodial rights. That doesn't change because you don't want him either, any more than your son's father is going to rise from the grave if your husband decides that he doesn't want to be the boy's dad. \n\nYou're the only real mother this boy has, and what a sad state of affairs that is, because you've made it very clear that you don't even see him as family. YTA. A big stinking AH.",
      "id": 58,
      "comments": [
        {
          "score": 3344,
          "content": "You went too easy on OP. Seriously, she insults assholes. No, she insults all of humanity...  the husband is also an AH. Wow. That poor child, mom abandoned him, now his father, and he has HER. Talk about getting the shitty end of the stick.",
          "id": 59,
          "comments": [
            {
              "score": 617,
              "content": "Completely agree. With so many absolute AH's on this sub they tend to wash over me these days but this has made me genuinely angry. To the point I can't really expressive myself properly without descending into swearing and name calling.\n\nThankfully it seems alot of people on hear are alot more articulate!",
              "id": 60,
              "comments": [
                {
                  "score": 20,
                  "content": "Right. What kind of lowlife treats their 9-year old step child like this? My stepsons' father is still in their life and I still treat them equally to all my biological children because they are all my children. I've learned a long time ago that blood doesn't fully mean much when your own blood family can destroy your whole life. Family doesn't mean blood because those ones you love and care deep about will always have a special family bond when you love them unconditionally. \n\nOP might not even be human though...probably some kind of lizard person.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I feel the same! My hubby and I have a blended family & I can’t even with this post",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "I don't know if reading these replies will change OP , but for that kids sake, I hope to God she rethinks her choices. What made you so bitter OP? Seems like you had an empathetic mom. You need help.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I do think a lot of people who post these do something that’s selfish or unkind but some genuinely just need some perspective. This one though….this is a true YTA",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 143,
              "content": "Honestly there is no other name for OP than a AH talk about AH  parent. That poor kid he's nine and to be made like he is not family because she did not give birth to him. OP you are a disgrace to all parenting. Your husband is an AH too infact.\nYTA\nYTA\nYTA\nYTA\nYTA\nYTA\nYTA\nHeard it enough, that poor kid",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "She is AWFUL!!!!! Op makes me so angry I feel like crying.",
              "id": 66,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1043,
          "content": "Not to mention 5 years is MORE THAN HALF THIS KIDS LIFE",
          "id": 67,
          "comments": [
            {
              "score": 616,
              "content": "Like picture a 5 year old and imagine being a dick to him.  That poor kid knows she doesn’t like him.",
              "id": 68,
              "comments": [
                {
                  "score": 240,
                  "content": "heartbreaking honestly. i really do not understand this mindset. the idea that bio kids are somehow more \"real\" family than non bio kids is such a fucked up mindset.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Every child that has entered my orbit has been treated with love and respect. Step kids, friends, neighbors. It’s so gross to agree to raise a child and not even attempt to love them where they should feel the safest and most loved.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Not to mention the kid existed BEFORE the marriage, so OP realized that he was part of the deal. Also, the whole part about OPs husband \"doing the right thing\" as far as PARENTING THE FUCKING KID he created...even though he \"wanted shared custody\". \n\nJesus fucing Christ. I mean, they're perfect for each h other considering how low life they seem...its a shame children are around them.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Not to mention, if her oldest daughter is 5, add at least a year to that, plus whatever time they dated or whatever they did before that. This demon has been in this poor baby’s life for all of what he can actually remember. I wonder just how differently she has actually treated him his whole life. Something tells me this isn’t an isolated incident. What a monster. YTA.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 453,
          "content": "OP definitely sounds like the type to be upset “woe is me” and blame the kid as a teen/adult when they want absolutely nothing to do with her after years of OP treating them as a burden. \n\n“I’ve done nothing but love you and treat you as MY OWN and THIS is how you repay me for all MY unconditional love and kindness?! Boo hoo” OP and her husband are the absolute AH in this.",
          "id": 73,
          "comments": [
            {
              "score": 31,
              "content": "Yep, and then he’ll go pull up the photos from this vacation that she will have inevitably posted on Instagram tagged with “#familyvacation #lovemyfamily” and tell her she’s a hypocrite and he doesn’t need her in his life.",
              "id": 74,
              "comments": [
                {
                  "score": 15,
                  "content": "I hadn’t even it thought of that… yup - put knife in stepsons back and twist it some more! She’s a total AH!",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Honestly, my biggest hope is that all 4 of these kids walk out of her life and never look back at the first opportunity. It would absolutely serve her right.\n\nOP, you aren't an asshole. You are a straight up fucking BITCH.",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 284,
          "content": "seriously this shit is so cold & emotionally vile it’s a solid contender for the “am i the devil” sub. how could someone be *so* callous towards a CHILD?",
          "id": 77,
          "comments": [
            {
              "score": 27,
              "content": "A child that she has effectively been raising for *years*, it’s not even like she just met him or something",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 165,
          "content": "Love that OP also treats her husband like a selfless martyr for taking custody of his own son. Gold star for fulfilling your obligation to the child you created.",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "And I would argue that the stepson has it far worse than the son OP had from her first marriage.  At least he can feel like his father loved him and wanted him--and his stepfather can be a bonus father who also loves him.  OPs stepson has been rejected entirely by his egg donors and now by his father's wife--the only \"mother\" he has ever really known.   YTA",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Precisely. Not saying she has to be the angel of all stepmothers, but at least acknowledge her role as his mother figure and not just basically abandon him all over again. Sheesh.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "A million times, this. Exactly. It took me several minutes to pick my jaw up off the floor after reading this. Like… what the actual fuck is wrong with this woman? I have a step daughter who is 15 and I’ve been in her life since she was 5. And we share 50/50 custody, always have, and her mother is a good mother. And I can’t fathom not considering her family. Like I think I’d go to hell if I ever said anything like that, especially if she heard me.\n\nOn top of that, if I ever said she wasn’t my family, my husband would divorce me immediately. What the fuck is wrong with DAD in this picture that he UNDERSTANDS her point of view? \n\nJust…. What?\n\n\nETA: YTA obviously",
          "id": 82,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "The only part of this I disagree with is when you said OP didn’t choose this child. She did. She chose to make her stepson part of her family when she married her husband. \n\nSource: I am a stepmom.",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "This is a masterclass on how to eviscerate an AH without using a single swear word. \n\nOP is indeed a monstrous AH of epic proportions.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7909,
      "content": "From a child whose step mother treated her own children better: you are an unbelievable asshole, and you should be ashamed of yourself.  How fucking dare you.\n\nI feel bad for him because if this would even cross your mind, you probably treat him worse at home too.\n\n>just MY family JUST once\n\nYou married his father.  You are his family.  And in his family, you are the evil stepmother.",
      "id": 85,
      "comments": [
        {
          "score": 769,
          "content": "this! and no doubt it is not JUST once - more like always",
          "id": 86,
          "comments": [
            {
              "score": 35,
              "content": "[removed]",
              "id": 87,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "And probably doing so covertly, raising this young man into the false security of a space of being inexplicitly yet unimplicitly second class, leaving him to learn for himself later in life where the holes in his character development and social awareness stem from, which is a fucking hard task - learning something you do not know without external guidance.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 515,
          "content": ">You married his father. You are his family. And in his family, you are the evil stepmother.\n\nExactly, what did she think would happen when she married him? \n\"Oh he has this little kid, I'm sure he'll just throw him in the trash when we get married\".\n\nOP is incredible entitled and selfish to say the least.",
          "id": 89,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 60,
          "content": "Yup.  Been there.   \nMy Dad's 2nd wife didn't want me to move in when my mom basically kidnapped me and moved us 3 states away and my dad only found out when he came to pick me up for his weekend with me.  Needless to say, my dad received custody of me and I moved in.  I always KNEW she didn't really like me.  I was 8.  I tried to draw her pictures and make gifts for her but she was always cold to me.  They had a baby (I'll name him Jack) a few months before I moved in (she told my dad she couldn't get pregnant-btw), which is why they got married in the first place.    \n\n\nMy dad was the only income earner.  One time, I asked if I could have some M&Ms and she said \"No, those are \"Jacks\" (he was about 1 at this time) even though she didn't get me anything. My dad blew up at her, and a few months later he left her and they divorced.   \n\n\nSo yeah, OP definitely the asshole and the poor kid probably knows she doesn't like him.",
          "id": 90,
          "comments": [
            {
              "score": 28,
              "content": "You lucked out. My dad turned a blind eye to my stepmoms treatment of me. She didnt show her true colors til they came back from their honeymoon. I was 5 and my mom had died when i was 4. How could someone be so cold to a young girl in that situation is beyond me.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "I still remember my step-grandmother kicking me out of a family photo because I wasn’t “real” family. My step-mom doesn’t have any bio children but she never treated me as anything but her daughter. Yet I wasn’t “real” enough for step-g mother \n\nBtw she died alone in a shitty nursing home and we didn’t even have a funeral for her because she was always an asshole like this. She alienated everyone in her life. \n\nThis could be your future. Don’t be like this",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Dear Prudence had great advice (paraphrasing): ask yourself, does this sound like something a Disney villain/wicked stepmother would do? If so, you’re in the wrong.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "My dad remarried when we (his first 3 daughters) were 10. From that moment, we were always \"Dad's kids\" and not \"Our kids.\"\n\nSurprise surprise, they have two kids together, and while I love my half-sisters, they were spoiled rotten, taken on multiple trips around the world, and had a much different life than the first 3, the kids he didn't even want to pay child support for.\n\nWhen I see stepparents make comments like this, I just think you don't deserve to have a family.",
          "id": 94,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "What’s worrying is the dad is ok with your POV!! That poor poor boy, he’s got a shit mum and a shit step mum. He must feel so lonely inside knowing that he isn’t seen as equal to the other children in his dads and step-mums eyes. You’re actually the epitome of the evil step-mum trope we see in films and TV. \n\nYou’re an asshole of the highest degree and it shows when you can’t even use the word ‘my’ before the word stepson. Ugh YT(biggest)A I’ve ever seen on this sub.",
          "id": 95,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "YES. My stepmom (who married my dad when I was 4) once said it’s impossible for her to love us as much as she loves her bio kids. That shit permanently fractured the relationship and I still remember it now when she wants my kid to call her grandma",
          "id": 96,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "That’s putting it kindly - there are better word  examples that more accurately describe her!",
          "id": 97,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4712,
      "content": "YTA\n\nAbsolutely, 100%.\n\nYou married his father, which means your stepson IS part of YOUR family. \n\n>my son DOESN'T HAVE ANOTHER PARENT.\n\nHa ha ha... Technically, your stepson doesn't have another parent, he has an ~~invubagkr~~ incubator/egg donor who doesn't want him. You are going to tell him you don't want him either and that is a shit thing to do.",
      "id": 98,
      "comments": [
        {
          "score": 766,
          "content": "Her son has another parent but he's dead.  Her son is not her second husband's though.\n\nI'm guessing if her husband said just once he'd like to vacation just once with HIS family excluding her son (because hey, biology is more important), she'd be okay with that.\n\nWhen you marry a man with a child, that child becomes part of the family. Wonder how she would feel if her husband decided that her son wasn't a part of the family.",
          "id": 99,
          "comments": [
            {
              "score": 99,
              "content": "Ding fucking ding ding",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "She probably thinks her child (with the deceased parent) has it SO MUCH HARDER than stepson because \"at least stepson's real mom is alive\".\n\nObviously you can't compare having a parent who doesn't want you to having a parent who died, both are hard in their own ways, it sucks having a parent not want you but at least they are alive vs. knowing your parent loved you but sadly they have passed away. \n\nPoor kid.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 201,
          "content": "For OP, being alive is the only criterion to be a parent. Custody and choices do not matter. \n\nOP is being so irrational and illogical and lacks basic humanity that I truly wish that the step son does not have to live with her. An delusioned asshole of epic proportions. YTA.\n\n\nAlso, a special mention to OP's \"understanding\" husband. He is TA too.",
          "id": 102,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 138,
          "content": "It seems like her stepson has ***no parents***, or certainly none that give a damn about him. \n\nHis step-mum is a wicked stepmother, his bio-mum abandoned him and his dad is cool with his wife treating his son as an \"other\".",
          "id": 103,
          "comments": [
            {
              "score": 16,
              "content": "His father thinks that it is so selfless of him to raise his own child. 😒",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "I wonder how she would have reacted if her husband said the same thing about her son from another marriage. That's OPs husbands stepson. Imagine if he said that he isn't family and that they should go on vacation without him. I guarantee you OP would lose her shit.\n\nTalk about the evil step mom trope. OP managed to get full points on that one.",
          "id": 105,
          "comments": [
            {
              "score": 12,
              "content": "If I said this to my wife regarding my step son I wouldn't be able to go on the vacation because I'd need that money for my divorce lawyer.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Totally agree with you, and I know your comment is obviously serious in tone, but WOW I love how badly you typed incubator lol, so rough even autocorrect couldn't save you!",
          "id": 107,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3525,
      "content": "YTA and so is your husband, your husband isn’t just an AH but also a horrible father for exposing his son to someone like you.\n\nYour 10 year old shouldn’t be allowed to go on this vacation either because he isn’t your husbands son. so if stepson misses out, then so should your son. It’s only fair if we go off your stupid messed up logic.\n\nI feel sorry for this poor kid, I bet he is left out of a lot of things. Toys? Treats? Food? God knows what else.\n\nYou honestly disgust me….",
      "id": 108,
      "comments": [
        {
          "score": 591,
          "content": "💯 , he is worse than she is. He understands and no problem with it, like how the hell can he be ok leaving his son out.",
          "id": 109,
          "comments": [
            {
              "score": 415,
              "content": "Obviously dad is incapable of picking a good partner--he went from bad to worse.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "When OP is this much of an asshole, I stop believing what they say. Would not be shocked to learn that she is lying about how he feels about it or is straight up denying that he doesn’t like it.",
              "id": 111,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "THIS! her husband has to step up and take care of her child from her past, but she doesn’t need to take care of his?? unreal!!",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3105,
      "content": "Let me see if I can get this through your thick head - *stepson ALSO doesn’t have another parent!!*. His mom *left* and *never came back* because she wanted “freedom” and a fresh start from her child that she *birthed and was supposed to love and care for no matter what*. He doesn’t know her. She is effectively a stranger. You are incredibly callous and selfish for even trying to do this. \n\nAnd “I didn’t sign up for caring for a child that isn’t mine”. Yes. Yes you did, the moment you married this man. Just like he signed up for being a father to your child who lost a parent. I’ll bet your kid’s dad would’ve moved heaven and earth to stay here with your son. Stepson’s mom CHOSE to leave him and no longer wanted him. Step up and be a decent human being for the sake of this child, if you didn’t want to be his mother you shouldn’t have married his dad. \n\nYTA times a thousand, and that poor kid. He’s got no one to fight for him in this world.",
      "id": 113,
      "comments": [
        {
          "score": 947,
          "content": "The signing up comment also irked me. She married his dad and agreed to have a blended family. She has 4 kids. Screw the step titles. She has 4 kids to teach, care for, and love. \n\nShe is exactly like Cinderella’s stepmom in every way. She has one of the ugliest hearts out there. \n\nYTA",
          "id": 114,
          "comments": [
            {
              "score": 95,
              "content": "Exactly. She could have not married him. Why she feel the need to take it out on an innocent kid",
              "id": 115,
              "comments": [
                {
                  "score": 96,
                  "content": "Mommy wants nothing to do with him. Step ah wants nothing to do with him. And daddy has no spine and let’s his kid get hurt by all these women. \n\nIt’s so heartbreaking.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "This reminds me of my stepmom *so* much.\n\nI was just diagnosed with cptsd. Because of child abuse and neglect. God I hope this poor boy turns out OK with no one there to prove that they love him and that he is safe and wanted. My heart aches.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I didn’t even marry my kids bio dad. He had two kids from his previous relationship ( they were married) and nothing like this ever crossed my mind. My kids siblings were always and will always be welcomed even after I separated from their dad. He passed away and OUR CHILDREN have always kept in touch, travelled to see each other, call text! Yes my kids siblings from another mom ARE MY FAMILY TOO. \n\nOP YTA",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "OP mom said I best with the if anything the stepson needs OP even more. I guess the apple fell far from the tree and not in a good way",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": ">YTA times a thousand, and that poor kid. He’s got no one to fight for him in this world.\n\nWell, except for OPs mother, who seems to be the only decent person in this mess.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2813,
      "content": "YTA, could you please cross post this to /r/iamatotalpeiceofshit so they can see it too.",
      "id": 121,
      "comments": [
        {
          "score": 984,
          "content": "And r/amithedevil",
          "id": 122,
          "comments": [
            {
              "score": 277,
              "content": "There should be an r/amiadisneyvillain",
              "id": 123,
              "comments": [
                {
                  "score": 190,
                  "content": "And an r/wickedstepmothers",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "You have just given me a new place to spend all my free time!",
              "id": 125,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 301,
          "content": "I'm sure this will soon feature on r/AmITheDevil if not already there",
          "id": 126,
          "comments": [
            {
              "score": 31,
              "content": "It is, lol",
              "id": 127,
              "comments": [
                {
                  "score": 13,
                  "content": "fully deserved",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 109,
          "content": "Hell yes.",
          "id": 129,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2531,
      "content": "YTA do you really think anyone thinks this *my family* business is acceptable? He became your family when you married his father. And drawing a distinction between the status of your child over his child is quite obscene IMO.",
      "id": 130,
      "comments": [
        {
          "score": 429,
          "content": "She had to make that clear, right? That the 9yo was lesser than her son.",
          "id": 131,
          "comments": [
            {
              "score": 181,
              "content": "Yeah, OP's child is not a child of divorce so of course he's better. /s  In case it wasn't clear.",
              "id": 132,
              "comments": [
                {
                  "score": 34,
                  "content": "She is quite a vile creature.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I hope her 10 year old and the 9 year old become bffs and both go NC due to her behavior as soon as they pragmatically can.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 177,
          "content": "The husband agrees. Poor kid.",
          "id": 135,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "My stepfather pulled the \"my kids / your kids\" bullshit. Still hasn't realized that the common denominator between all 4 of the kids he raised in *his* house hating him, both his own and his stepchildren, is him. OP is going nowhere good, and setting these poor children up for a lifetime of therapy around their family dynamics and the ways they've been neglected.",
          "id": 136,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "If she really wants to get technical, since the husband isn't her blood either, then maybe he and the stepson she doesn't want should stay home together. Haha I really cannot believe the audacity of this woman.",
          "id": 137,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2077,
      "content": "INFO: If my math is right, you and your husband got married when stepson was 4?\n\nWhat kind of relationship does stepson have with you versus with his bio mom?",
      "id": 138,
      "comments": [
        {
          "score": 1071,
          "content": "Which means this poor kid knows he’s not been welcomed or loved for 5 years now",
          "id": 139,
          "comments": [
            {
              "score": 369,
              "content": "This, I can't help thinking how many times has her attitude reared its ugly head before. Extra gifts at Christmas for her family? Special birthday parties for her family? My heart aches for that little boy.",
              "id": 140,
              "comments": [
                {
                  "score": 27,
                  "content": "I’m picturing that, too. Heartbreaking.",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 221,
              "content": "And his father just goes along with it.",
              "id": 142,
              "comments": [
                {
                  "score": 113,
                  "content": "I almost hate the dad more than the evil stepmother",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 53,
                  "content": "That kid is being betrayed at every turn.",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Or maybe doesn’t even know. Should he read this, lord have mercy because I would be livid if I read this and that were my boy.",
                  "id": 145,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "Even when he’s grown this kids gonna have a really hard time navigating romantic relationships",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "I just hope OPs Mum makes him feel loved and part of her family.",
              "id": 147,
              "comments": [
                {
                  "score": 38,
                  "content": "I hope step-granny takes him to friggin Disney world.",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "This is seriously so soul crushing. What's more considering how his dad sees this, its likely his own blood is also being negligent with him.\n\nJust imagine how much damage that kid is going to go through. Being completely abandoned by all the adults around him. Like I can already see the small kid calling his step-mom \"mom\" and she correcting him. Im no psicologist but this shit, in such a crucial part of growing it is gonna destroy that child.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "His whole life really. His bio mom skipped when he was 2?",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Longer than that, they've been married 5 years. Together for at least 6? Stepson has known OP since he was a toddler. She's probably all he has ever known.\n\nEdit: I had a small stroke typing apparently. Fixed.",
              "id": 151,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 306,
          "content": "And what kind of relationship OP has with this poor child? She obviously treats him like an inconvenience on a regular basis, my heart breaks for him.",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 157,
          "content": "What do you want to bet that stepson is differently abled.    I’ve been looking for a comment that asks but haven’t found one.  \n\nYTA, op.  For all of the eloquently worded responses that have already been given.",
          "id": 153,
          "comments": [
            {
              "score": 98,
              "content": "Either that or a different race than OP. She is so vehement about stepson not being part of her family that I have to believe there is more “othering” happening.",
              "id": 154,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "Very good point. OP leaving a lot out and not giving any color",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 103,
          "content": "Given that OP doesn't even allude to the presence of stepson in paragraph #1 when she introduces the members of the family, I'd guess she and bio-mom have identical relationships with him.",
          "id": 156,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 102,
          "content": "YTA-your stepson is a part of your family whether you like it or not. He has been with you for 5 years. What else have you done and said to him that lets him know you don’t consider him a part of the family or loved?  You never should have married your husband if you didn’t want his child to be a part of the family. Lady-you win the prize for the worst stepmother ever.  Have you no shame?",
          "id": 157,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 96,
          "content": "Can you imagine raising a child from 4 (practically a baby!!) to 9 and NOT thinking of him as family?",
          "id": 158,
          "comments": [
            {
              "score": 18,
              "content": "Not at ALL.\n\nI can't even put myself in any possible perception of reality that makes sense from OP's point of view.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1829,
      "content": "Wow, YTA. Also, just evil! So you and husband each married both bringing to the marriage a child from a previous marriage/relationship. \n\nLet’s twist your story. Your husband gets a HUGE bonus. One that can take his family on a dream vacation. He tells you that he wants ONLY his wife and HIS children. That you need to find a place where your son from your first marriage to stay while you are gone. I don’t care if you are widowed, he is not his son by your standards. \n\nLet’s take the knife and twist it, your son hears how he cannot go because he is not “family”. How do you think a child would receive this message? He is pretty much abandoned by his mother, and his evil stepmother is also telling him that you are rejecting him as well. \n\nBecause of your actions, let’s go to the future. Your stepson is getting married. He tells his dad that he can come but you, the evil stepmother, are not invited and not allowed to attend. You are also banned from his children’s lives. Why, you will ask. Remember this day. It all started and began with YOU. \n\nI’m betting he has his own stories he can share about you and your hatred for him. And shame on your husband for allowing this let alone staying with a woman who will never accept his child.\n\nAnd how do I know this? I’m an adult now but grew up with stepmom like you. Step fathers as well. I don’t call them my parents, just AHs\n\nEdit: Thank you for the awards for my comments. The greater reward is for the OP to grow up and become a human that has a heart.",
      "id": 160,
      "comments": [
        {
          "score": 333,
          "content": "I suffered a step mom like this. I was the \"other\" kid and basically felt like I didn't really belong anywhere. \"They don't want me here, they don't want me there... I guess I'm the problem.\" I hope that kids in therapy. God knows I needed it early.",
          "id": 161,
          "comments": [
            {
              "score": 16,
              "content": "Shite, mate. I hope you're doing better nowadays and that good things are coming your way! No one - especially not kids - deserves to feel this way. All the best to you!",
              "id": 162,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Im am extremely sorry for what you had to go through. That is sadly what I fear the most about that kid. He probably will constantly be held back by those scars, thinking he is an issue and that he is never part of a group.",
              "id": 163,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Honestly, I don’t think the son would invite his dad or his evil stepmother to his future wedding. If his dad supports a woman who hates him, why would he even want to talk to his dad? \n\nThe older he gets, the more he’ll realize he doesn’t need to feel obligated to involve the dad or maybe even siblings. He might want a clean break, but for entirely valid reasons. \n\nI hope he is incredibly loved and successful in life. I hope OP needs something from him in the future and he denies her as she’s denied him any love since he was at least five years old.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "I refer to her as, “my dads wife” someone tried to “correct” me one time and said, “Don’t you mean your step mom?” My response was, “she’d have to act like a mom 15 years ago for me to call her that.”",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}