{
  "post content": "For context, a relative of what used to be a close friend of mine whom we'll call Gary for this story contracted cancer. I (Mid-20s male) was sympathetic and even contributed $100 to a donation pool for their treatment. But Gary came to me one day and took his hat off to reveal a freshly shaven head. He told me that everyone in his family were doing it in support of his relative, and so were a lot of our mutual friends. Then he asked that I get on the bandwagon.\n\nI told him I didn't want to shave my head because I like my hair. My hair is black, regularly combed and well styled. He said I could just get a wig or something and had actually brought his shaver kit. He was unboxing it when I told him this was not happening. I don't even really know his relative that he's doing this for. So I'm not doing it, end of discussion. He called me an &$$hole and left angry. We didn't speak for a week. Then last Saturday I got invited to a party at another close friend's house. There I found out that Gary had tried the same thing on several other friends, and only a couple of them actually did shave their heads.\n\nGary wasn't at the party, so I had a blast hanging out, playing video games and listening to rock music. But I had way too much to drink and couldn't drive home. So they said I could just sleep upstairs. I passed out on a bed and it was a blissful sleep till I was shaken awake by another friend who told me Gary had showed up late and they caught him shaving my head while I was passed out. I saw what I looked like in a mirror and wanted to scream like I was in a horror movie. Gary even shaved off one of my eyebrows.\n\nGary was still there and acting proud of himself saying \"Now you're gonna have to shave off the rest, just like me! LOL!\" I was furious and called the cops. When they got their Gary fully admitted to what he had done to me and even said he was justified. The police didn't seem to think so as this is classified as a form of assault. They asked me if I wanted to press charges and the first words out of my mouth were \"HELL YES!\" Gary cussed me out while they took him away in cuffs. I tried getting my hair restyled into something presentable. But there was no saving it and now I'm bald too.\n\nNow a bunch of Gary's family are telling me to drop the charges because Gary was off his meds and didn't mean to do it. I was like \"WTF?!\" because I never knew he was on meds. But I still refused to drop the charges. It'll take months to grow my hair back the way it was. But all of the calls and messages from Gary's relatives are starting to get to me. Just about everyone else in our friend group has cut Gary out though and say that I'm doing the right thing by not dropping the charges. So now I'm divided.\n\nAITA for pressing charges on a former friend for shaving my head in my sleep?\n\nEDIT: I want to make something clear here. So many people have said things like \"Dude it's just hair!\". But would they all be saying that if I wasn't a man? What if I was some girl that had hair that took years to grow? Would they be saying the same thing? Sure hair grows back. But it takes time. If it was something that grew back fast, people would be less inclined to care. But it's not fast. It takes months. And for some who had long hair, years. That's a lot of time wasted growing.\n\nAnd I don't plan on pushing for Gary to go to prison. But I don't plan to drop the charges either. His family already bailed him out. And while I didn't know he was on meds, I knew he had quite the temper, and even an entitled attitude at times. One example being a lunch where he wanted us all to combine the check and split it evenly. He got the most expensive thing on the menu. I got a cheeseburger. When we all said \"No\" Gary went off on us for not being good friends. He's always been an ass when he doesn't get his way. And I've only known him for like three years. This incident was the last straw for not just me, but a lot of other mutual friends.\n\nAs for the charges. I don't want to send Gary to prison. But I would like him to get some therapy and community service. With the way Gary has acted around me in the past, and what he did to me, I actually wonder how long before he got more violent. I've seen and heard of him getting in fights for less. \n\nEDIT 2: I've gotten many comments from people saying \"YTA! He has cancer!\". If you actually read what I posted, Gary is not the one with cancer. A relative of his I don't know does. And no, I don't know what kind of cancer. Gary didn't elaborate. He wanted me to shave my head for this person. And when I refused, he left in a tantrum. Then shaved my head while I was passed out drunk at a party. ",
  "id": 1,
  "comments": [
    {
      "score": 23523,
      "content": "NTA \n\nContact the DA that is handling the case and let him know that his family is pressuring you to drop the charges. \n\nThey may be violating the law too. \n\nIf Gary hasn't learned to take his meds, A little time in jail will teach him that lesson.\n\nEdit: I didn't mean to suggest ja will help him. I believe facing negative consequences for his a toons vs. getting out of them will help him.",
      "id": 2,
      "comments": [
        {
          "score": 8922,
          "content": "That's a very good idea. I'll take care of that as soon as I can",
          "id": 3,
          "comments": [
            {
              "score": 5527,
              "content": "Make copies of all the texts, save the voicemails.  Don't block them, let them spew, as all this info should go to the police.\n\nAnd yeah, NTA.  Gary is an adult.  He knows what'll happen if he goes off his meds.  He did it anyway.  Sounds like his family might be doing a wee bit of enabling there.\n\nNo means no.  If he hasn't figured it out by now, the authorities need to teach him.",
              "id": 4,
              "comments": [
                {
                  "score": 2225,
                  "content": "The hell is Gary's problem? What a moron, him and his family included. \n\n>And yeah, NTA. Gary is an adult. He knows what'll happen if he goes off his meds. He did it anyway. Sounds like his family might be doing a wee bit of enabling there.\n\nWhy do I feel like Gary is going to use this to try and lessen his punishments?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 963,
                      "content": "Because that’s exactly what whiny petulant children do",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Considering OP said they were close friends and he hadn't even known Gary was *on* meds, I'm thinking the fact that he was actually taking anything that could justify this behavior by going off them is dubious, at best. In fact, I think they're just saying that to OP because they think it will play to his sympathy and get him to drop the charges. It will be interesting to see if Gary goes to trial and has to admit what medications he's taking (or not) or if he decides to plea to something lesser in order to avoid that.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1029,
                  "content": "[deleted]",
                  "id": 8,
                  "comments": [
                    {
                      "score": 518,
                      "content": "I personally find a phone alarm more than adequate. Then I get meds AND avoid consequences.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I hear you! If I don’t take mine (sometimes I’ll fall asleep before I take them), my consequences are physical. I feel dizzy, sometimes like I’m too close to the ground, and for some reason it acts like a I’ve just downed straight fiber and can’t stop pooping. \n\nIt is my responsibility, and mine alone, to take my meds. Just like it’s Gary’s responsibility to take his. I completely understand not wanting to take them when they’re working, because you feel moderately normal and functional, but that’s the point.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Shit, the way I feel when I’ve forgotten to take my meds is a good way to remember to take my meds.  Psych med withdrawal is brutal \n\n(In other news, though, I’d somehow almost forgotten tonight and thank you for reminding me and saving me from a very rough morning, I appreciate you and your comment that reminded me that I was about to face consequences in the morning.  Off to remedy this now)",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Exactly.  Gary was ON his meds when he decided to go OFF his meds.  He makes poor choices whether on or off meds apparently.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 997,
              "content": "OP, you are worried that the HARM TO YOU isn't proportional to the consequences to him. But you shouldn't be thinking that way. What he did was assault. He handled an intoxicated, unconscious person's body and damaged their body without their consent and against their explicit wishes. The fact that the physical damage isn't permanent is immaterial. He VIOLATED the sanctity of your body while you were passed out. He CANNOT be allowed to get away with this or what other kinds of bodily boundaries will he cross, thinking it's not really that bad? Press charges!",
              "id": 13,
              "comments": [
                {
                  "score": 319,
                  "content": "Exactly what I was thinking. Doesn’t matter that it’s hair and that it will grow back. It was assault plain and simple. And he def did it for the sole purpose of embarassing OP. Why else would he only shave half his head + an eyebrow? Hope OP doesn’t have a client-facing job. I can’t imagine having to go into work on Monday to explain to my boss what happened.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 75,
                      "content": "It doesn't even matter that he was drunk & passed out either (morally. Legally it does make a bit of a difference, but my point is the same.). Violating someone else is wrong no matter what the circumstances are.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Shaving half the head could be explained with OP sleeping on the other half. Eyebrow on the other hand can only be explained with maliciousness.\n\nI'm glad OP mentioned that growing back long hair can take years. It actually took me 4 years to get back to original length after a not so perfect haircut by professional hairdresser. From bald to long probably would have been 8 or more years, some people's hair doesn't grow fast.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 270,
                  "content": "This OP! He even shaved an eyebrow off which I'm pretty sure isn't part of the whole 'shave head in solidarity' thing. He and his family need to learn about consequences. Do report them for the constant calls to drop the charges. They can have the solidarity they so crave in having court dates together.\n\nI'm curious if the relative who has cancer is aware of this or not. If not, how horrifying. To find out about the cancer and then instead of actually supporting them like real people, Gary assaults one of his friends and then the rest go on to harass the friend because they want some social media head pats.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 108,
                  "content": "And, if his family wants to actually use mental wellbeing to plead for leniency, then ask them to talk to their lawyer, not use it to pressure OP to give up. Through the proper channels in handling the case officially. Damage already done to OP's hair.\n\nBesides, what was the family doing if they knew he was off his meds? Maybe not the first time already?\n\n>But all of the calls and messages from Gary's relatives are starting to get to me\n\nThey probably using the 'just shrug it off, it's all cos of the meds eh?' approach and have no idea how harrassed OP was and the shocking experience waking up with hair loss",
                  "id": 18,
                  "comments": [
                    {
                      "score": 88,
                      "content": "This feels less about the relative's actual cancer diagnosis and more like an unstable, unmedicated, attention seeking mania episode.   But, because he is the protagonist in the family drama....  OP is catching shit from the emotionally taxed family.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "\"Off your meds\" is the most exploited excuse in the world. Sometimes people are just assholes without mental illness.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I wonder if the family members are off their meds, too.  I mean, they're obviously unable to stop themselves from harassing OP, so it must be meds, right?",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "This puts what I was thinking into words so eloquently! This isn't \"just hair\", this is someone taking advantage of someone being unconscious to do something the person expressly refused. And usually I'm sceptical of any guy who says \"Would.you say X if I was a girl?\" But in this case it it VERY RELEVANT because I don't think people would be so quick to dismiss how close this is to a standard sexual assault story if the victim was female. OP is right to feel violated!",
                  "id": 22,
                  "comments": [
                    {
                      "score": 4,
                      "content": "As a woman, I also agree the comparison is appropriate. OP was violated while he slept, plain and simple. NTA, and don't drop the charges, OP! Let the family talk to their lawyer and the court about their side. People need to be held accountable for these things.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "That's exactly what I was thinking.  And if he gets away with it, next time he might do something that does leave permanent damage.\n\nHis family are terrible for pressuring you.  Why should you be made to feel bad when he did the wrong thing?\n\nNot to mention, a lot of cancer sufferers don't like other people shaving their heads in solidarity.  I've heard them say that it's offensive for other people to choose to do something that they had no choice over.  And shaving your head doesn't actually do anything to help them, unless you are doing it as a fundraiser.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Agree.  He needs to learn to stay on his meds and boundaries.  This could have been so much worse.  As if it isn't bad enough to be assaulted as you sleep.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I thought this immediately. It’s a stretch to some but if he did this to you knocked out, what would he do to a stranger?",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Exactly what I was thinking. NTA. It's not 'just hair', it's HIS body and his autonomy. On top of that, I would be worried whether Gary's behaviour stops at shaving people's hair off in their sleep or if at some point he might decide to mess with their bodies in some other way if it is not made clear that this behaviour is unacceptable.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 363,
              "content": "NTA. Save ALL records of texts, voicemails, phone calls, social media posts and messages- EVERYTHING. Screenshot, share, however you gotta do it, get it all to the DA as proof of them all trying to harass you as well as potentially threaten (if they do). He knew what he was doing, and he also knew what he was doing when he fessed up to the cops. Actions have consequences, with and without meds.",
              "id": 28,
              "comments": [
                {
                  "score": 259,
                  "content": "[removed]",
                  "id": 29,
                  "comments": [
                    {
                      "score": 237,
                      "content": "It's all about the person making themselves the main character in their own offshoot story. It can too often be attention seekers who act like they're making a great sacrifice. When it's done in a genuine show of support for a loved one who is suffering, it can be a great way of showing solidarity, but for too many it's just compassion cosplay.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 163,
                      "content": "Exactly. If people REALLY wanted to do something to support cancer patients then they should get their Covid vaccine. Many cancer patients are going through treatments alone or having their surgeries put on hold because of the pandemic and hospitals will not be able to lift restrictions until more of the population is vaccinated.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 104,
                      "content": "I have seen many other posts on reddit from people with cancer who do NOT want you to shave your hair for them. They would rather have you show them support in tangible ways like, driving them to therapy, cooking them a meal, running simple errands for them when they are wiped out from chemo, etc.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 45,
                      "content": "Agreed.  I was going through cancer treatment this time last year, and lost all my hair.  There was absolutely NO way I'd want my friends and relatives to shave all theirs off too.  What does it achieve? I already knew I had their support.\n\nAnd let me tell you, growing it back is a B*TCH, I wouldn't wish that on anyone",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 44,
                      "content": "I know some do it to donate their hair to locks of love, to make wigs for cancer patients losing their hair from treatment. My husband actually cut off all of his hair when his best friend ever passed away from leukemia. He donated them in honor of his friend. But those that do it to \"show support\", I totally agree with you! Like, you shaving your head isn't going to make theirs grow back nor rid them of the cancer. You just want attention on yourself.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "This. If they cut it off to donate for wigs for people in chemo, then it's a nice gesture, but otherwise it's just performative \"support.\"",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Comment copied from /u/geckotatgirl\n\n> I am SO OVER people shaving their heads for their friends and relatives who have cancer when the patient isn't even involved in it and often doesn't want them to.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "My sister shaved her head to donate her hair to make wigs for cancer patients who want one, which I thought was ace.\n\nWhat I thought was funny is that I had shaved my head years earlier for fun and suited it, so she knew she would too as we look quite similar 😂 I doubt she would have been brave enough for it otherwise.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Yeah…my young husband had cancer and we never would have even thought to ask this.…honestly knew people at the same time doing it and sorry, but they We’re very much attention seekers...I think its Definitely different if it’s a woman because culturally hair is expected, but for my Husband losing his hair wasn’t;t even on the flicking radar with everything else we were dealing with...",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 187,
              "content": "That was the first thing that popped up in my head. The DA needs to know. This is witness intimidation and is actually more serious then the charges he's likely facing.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 142,
              "content": "It's called \"witness intimidation\" and it's definitely illegal.",
              "id": 40,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 52,
              "content": "NTA \n\nlooking forward to an update OP!\n\nyes,do inform them about the family \n\ni've read many stories of people dropping charges due to outside pressure",
              "id": 41,
              "comments": [
                {
                  "score": 167,
                  "content": "Whether I update or not, you can rest assured that after getting so many NTA here, I won't be dropping charges.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 17,
                      "content": "good for you",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "I can’t even imagine how someone could argue that you’re TA in this.",
                      "id": 44,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Can’t believe you had people saying it’s only hair or will grow back, whether it will or won’t it’s irrelevant it’s part of your body and whether you’re a man or a woman no person should touch or modify your body without consent and it was frustrating to see you had to actually point that out you’re definitely NTA mate",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Good. As a man with long hair this story made me seeth.  You did everything right and the cops took it seriously. Don't back down, don't give in. NTA. Please consider an update.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Well here's one more NTA.",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": ">I won't be dropping charges.\n\nGood. It is assault and he needs to be punished. Hopefully he will get anger management courses and community service.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "This is assault and theft and a major personal violation.  I think it's a good thing for Gary, that you press charges, because Gary doesn't get it, and he needs to understand where the lines are drawn between his freedoms and your rights.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Don’t let this go. He’ll do a lot worse. Thank goodness the hair will grow back but it sucks and you were assaulted at the very least. Keep us updated. nTA.",
              "id": 50,
              "comments": [
                {
                  "score": 8,
                  "content": "> Don’t let this go. He’ll do a lot worse.\n\nYep. Makes you wonder in what other situations Gary doesn't care about consent",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "NTA. Don’t drop the charges. Consider filing a civil suit. This was not ok.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Can they be charged with harassment?",
              "id": 53,
              "comments": [
                {
                  "score": 9,
                  "content": "I'm going to find out",
                  "id": 54,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 593,
          "content": "I also want to point out that this isn’t like, a short lapse of judgement? It didn’t spur out of an emotional reaction. He tried to shave OPs head, was told firm no, waited until he was drunk at a party days later, pulled out a shaver, plugged it in, and shaved. Like there were so many steps to this point. He could’ve stopped but chose not to. \n\nDon’t drop the charges. Who feels like they can do this to someone else? What an absolute violation.\n\nEdited misspelling",
          "id": 55,
          "comments": [
            {
              "score": 226,
              "content": "And a shaver is not something you just happen to have on you at a party.",
              "id": 56,
              "comments": [
                {
                  "score": 13,
                  "content": "Depends on what type of party it is",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "He had clippers with him; that’s called premeditation.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Don't forget, he never came over until OP was passed out, and he stopped what he was doing, packed his clippers into the car, drove over, asked where he was sleeping and went up to his closed room to shave his head. Lots of time in there to reconsider what he was doing!",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "A party he showed up late enough to that OP didn't know he was even there until the deed was done, quite possibly to lull OP into enough security to get drunk in the first place.  This took planning.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yeah this isn't an \"on meds\" issue, this is an entitled prick whose never had consequences issue.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 571,
          "content": "“If Gary hasn't learned to take his meds, A little time in jail will teach him that lesson.”\n\nBipolar mf here. Can absolutely confirm. Won’t go into detail because I don’t really remember everything, but I was off my meds, did something absolutely ridiculous, ended up in jail for a few days, haven’t missed a dose since.\n\nEdit: also NTA, teach the dumb mf to stay on his meds.",
          "id": 62,
          "comments": [
            {
              "score": 198,
              "content": "Bipolar person here. Seconding this. We require consequences. Fo sho mo fo.",
              "id": 63,
              "comments": [
                {
                  "score": 92,
                  "content": "It’s a pill harder than Lithium to swallow, but we really do. I imagine us as the embodiment of chaos or a werewolf even (kind of cringe but it’s a perfect analogy). If we don’t take our meds, as well as proper care of ourselves through proper eating, sleeping, and exercise, then we unleash that chaos onto the world and burn everything in our wake. It’s a shitty hand we were dealt but it’s our responsibility and ours alone to keep that chaos as contained as possible through those proper measures. The only way I was able to come to this conclusion was after I let loose the chaos I bare, and my God did Hellfire blaze. I’m still sifting through the ashes and trying to pick up all the pieces of what happened exactly, but all I know is that I never, ever, ever will let it happen again.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 55,
                      "content": "I was on the receiving end of a bipolar chaos episode with a recent Ex of mine. Still haven't caught up with repairing the extensive home damage. \n\nI appreciate you sharing your experience because it helps me process what he was going thru to some extent.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I don't remember much of my 20's, but my friends and family sure as hell do. Sometimes when I get annoyed that everyone acts all cautious around me even though I've been stable for years now, my buddy will say something like \"hey, remember that time you stole my car and had sex with a stranger in it? Because I do. We love you, and shut up.\"",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Also bipolar and for the most part keep control of it without meds. I can't be on meds because it would make me unable to do my job. Last summer I got really manic, I blew an very large sum of money and was throwing away a year of progress on something else. I had a sheriff show up at my house and arrest me on warrants from a year and a half old charge, my family bailed me out of jail. I was broken, I won't lie I thought about killing myself. I'm still scared that it will ruin my life but now I have been reminded what is at stake. Everything, that's what I could lose. My job, my girlfriend. On Monday I will likely sign a plea agreement and then I will finally be able to stop being scared after nearly two years. Honestly I'm tearing up typing this. Between therapy and a strong support group that won't enable me when I'm in such states I am in a much better place than I was before. \n\nBack to the point, blowing all my money didn't teach me anything. $25k down the drain and that didn't do it. It took a cop showing up on my door and putting me in cuffs. I could see in his eyes he felt bad as I cried in the back seat of that car. My nephew that I live with, my nieces that were over visiting, they saw me taken away in cuffs. When I came home my nephew gave me such a big hug with tears in his eyes. That's what taught me what I needed. Being told that he cried when I left, telling my girlfriend and having her stand by my side and tell me that we would get through this. It broke me. The thing that saved me was what the jailer said to me as he took my finger prints, \"Don't look at this as you going backwards, look at this as a sign to keep moving forwards.\" That guy that I had never met before did a lot to help me, he was kind when he didn't need to be. He made jokes with me and even complimented my dragon ball hat and told me how great it is that you can just wear stuff like that these days without being judged for it.\n\nGoing to jail taught me a lesson. Every day is a challenge and I must meet that challenge. I have to keep putting one foot forward and I have to ask for help when I need it.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Another bipolar person checking in! Yeah. No. If I go off my meds, I end up manic and spiraling and miserable. I can miss a day, on accident, without too much trouble. I just remember to take it the next day with alarms. \n\nNot an excuse for Gary, here. Consequences for a grown ass man who was already told no. \n\nNTA, OP. Report the new threats and attacks and guilt trips to the police to add to the case.",
              "id": 68,
              "comments": [
                {
                  "score": 5,
                  "content": "Super proud of you for staying on it and realizing that about your meds, I know our kind have a reeeeally bad tendency to not want to take them until it’s too late",
                  "id": 69,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Thank you. I have alarms for my meds, for brushing my teeth, for waking up and doing coursework assignments — I figured out what I needed to do and applied it. Therapy and mental health care. I lean into the depression part of the diagnosis and I have medicated anxiety, too. \n\nIt’s hard but finding support and working systems is important. I hope you’re doing okay too.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I think the time in jail helps because people on meds have a tendency to feel better and think they don’t need their meds; or feel better and decide the meds are offering nothing but the side effects.\n\nThen you stop taking the meds. Everything is fine! Until it’s not. Jail time is a nice wake up call that things really aren’t fine, and take you’re fucking meds, that’s why you feel fine.\n\nMy mother always tried to stop taking hers. Always resulted in a complete mental breakdown about to be sectioned in a mental hospital, had I not taken on the responsibility of guaranteeing she was on them (the medicines were prescribed to her, but I collected them and made her take them, and they had routine meetings with both of us to check if she’s taking them).",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 117,
          "content": "This. NTA. Gary assaulted you. There needs to be consequences for him and his family is showing you where he got this level of entitlement.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "OP, log everything you can remember. Look at your phone logs, texts and write down everything.",
          "id": 73,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "> If Gary hasn't learned to take his meds, A little time in jail will teach him that lesson.\n\nI very much doubt jail time leads to an improvement to any mental health condition for anybody, but well... if he can't be out and about without assaulting people then he can't be allowed to be.",
          "id": 74,
          "comments": [
            {
              "score": 27,
              "content": "Not always true. My relative wouldn’t take his meds, got arrested for some type of inappropriate behavior. Other person pressed charges, he went to court. Now he takes his meds 🤷🏼‍♀️",
              "id": 75,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Yuppers.  Save the evidence, cuz that particular crime is called witness tampering or witness intimidation.  Sometimes a DA will cut a deal and lower it to harassment, but guess what?  That’s a crime too!  This BS Gary pulled is literally the adult equivalent of the joke in cartoons where a kid who finds out about tooth fairy money tries to knock his/her friends’ teeth out or convince them to lose teeth in order to get some cash!",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Also NTA. As a bloke who regularly shaves his head, if someone shaved my head and one of my eyebrows, I would have them charged with assault as well.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "There is no \"may\", that is actually illegal what the parents are doing. I think the term is \"witness intimidation\" or tampering.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yeah it kind of falls into \"intimidation\" umbrella",
          "id": 79,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5406,
      "content": "NTA.\n\nTell the family your gonna report them for harassment if they keep this up. And then follow through.",
      "id": 80,
      "comments": [
        {
          "score": 1892,
          "content": "Don't tell them, just report them.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 361,
          "content": "Make sure to save all the communications with them so you can hit them with a cannonball of evidence if they try to delete or lie about them harassing OP",
          "id": 82,
          "comments": [
            {
              "score": 55,
              "content": "I feel horrified for Gary’s relative who actually has the cancer. Idk, maybe that person is just as bad as the rest, but all of this feels so fucking performative and self-satisfactory and in zero ways an homage to what a cancer patient is going through. It sounds like Gary’s whole family has made their relative’s cancer their whole personality and their own personal claim to fame, as it were. \n\nI know people shave their heads in solidarity for loved ones losing their hair from chemo, but I personally wouldn’t ever want that - but not only for them to shave their own heads, but pressure others to, is even more abhorrent to me. And this?! Forceably shaving some person’s head in their sleep?! If the cancer didn’t kill me, the embarrassment of this display falsely in my name would do me in.",
              "id": 83,
              "comments": [
                {
                  "score": 6,
                  "content": ">Idk, maybe that person is just as bad as the rest\n\nNot saying they are, but cancer doesn't magically make anyone a better person.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5087,
      "content": "NTA.  The police called it assault because that's what it is.  Block all his relatives, but save any messages you already have and report them for harassment.  Do not feel bad about pressing charges either - he assaulted you and was proud of it.",
      "id": 85,
      "comments": [
        {
          "score": 585,
          "content": "Agreed.  Please let your lawyers know what this asshat's family is saying to you.  It'll all help you in the long run and DO NOT reply to them.  Let them spam you but don't give in and don't reply to them. \n\nOP, you are not TA.  Pressing charges is the least of what I'd do.  A similar thing happened to my dad when he was young.  My dad had a pretty fucked up childhood but one thing he was always proud of was his appearance and especially his full head of hair.  He got really badly sick and ended up paralyzed for a few months on one side of his body.  During this time he was on heavy meds and while asleep his \"best friend\" snuck in and shaved his head.  My dad didn't know who'd done it for over 30 years!  He went on being friends with this guy through it all and even helped him out when he was in legal trouble.  He lived with our family, despite my mom's protests (she never had a good feeling about him), and it wasn't until just a few years ago that he came clean to my dad about what he'd done.  He also tried to make it sound playful and like it wasn't a big deal.  My dad was heartbroken and ended an almost 50 year friendship.  If he could press charges he would.  I personally would've beaten the shit out of the guy, but we have different ways of approaching things.",
          "id": 86,
          "comments": [
            {
              "score": 135,
              "content": "Here I am thinking who the fuck shaves someone's head on their sleep and now I'm wondering who the fuck shaves someone's hair off as they're sleeping *and* partially paralyzed suddenly?! Jesus.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Aww.... your poor dad. What an asshole that \"friend\" was to not only do that but keep it secret for years, knowing your dad wanted to know. I'm so sorry for him; people can really just suck.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Looks like OP doesn't really need a lawyer, the guy has admitted in front of multiple cops (and other witnesses too) that he assaulted OP, and they seem to be on board with helping OP getting his charges pressed. No need to spend money on a lawyer unless you want to sue in civil court for damages (but only worth it if you think you can get enough to make it worth it).",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 156,
          "content": "And this isn't a thing of \"he didn't mean to do it\".  He _literally had to have prepared his shaver to do this_.\n\nNTA.  This is assault for a _reason_.  You're not a bad person for allowing someone who _went out of their way_ to assault you to get the punishment they deserve.",
          "id": 90,
          "comments": [
            {
              "score": 8,
              "content": "And he gloated about it! Even to the police he gloated and took pride that he did that! Plus he would have had to look for OP or ask where he was and find out he was asleep upstairs. At no point was this \"he didn't mean to do it\" he fully did. Even shaved OPs eyebrow as a punishment for not saying yes",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 83,
          "content": "[removed]",
          "id": 92,
          "comments": [
            {
              "score": 50,
              "content": "Bot \n\nStolen comment",
              "id": 93,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 40,
              "content": "don’t steal comments asshole",
              "id": 94,
              "comments": [
                {
                  "score": 10,
                  "content": "[deleted]",
                  "id": 95,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "If you were Native American it could be considered a feloney hate crime. \n\nFor a Native, hair is sacred. I can't count how many times ive been threatened/bullied or \"jokingly\" been snipped at with scissors when i was a kid because i have long hair, but i shouldnt feel like im allowed to have long hair because my skins white. So whats the big deal? Thankfully im a well adjusted shut in now! (And no longer a kid trapped in school)\n\n100% NTA\n\nThis guy needs to learn that actions have conciquences",
          "id": 96,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Yes, the fact Gary hasn’t apologized indicates his lack of remorse. He crossed a boundary of violating another human being - and if not addressed properly- this has the potential to get worse. If these meds have the ability to make Gary a decent human being and he is back on them now, shouldn’t he be apologizing profusely to you rather than using his family against you?",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Do not block the relatives just ignore, the more they bother you the deeper the hole they dig.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Definitely assault no matter what the reason, or how long the hair. It’s even been prosecuted as a hate crime if the situation is right. In Ohio there was a case where this Amish family, with vendettas against some other Amish, went around forcibly cutting the hair and beards of 7 Amish men. Federal prosecutors were originally trying to get the ring leader life in prison. He ended up getting 15 years, which was later reduced to 10 years and some months when the “hate crime” part of the conviction was thrown out somehow. But the judge that did the resentencing for the conspiracy crimes said he still believed it was a hate crime. Amish aren’t supposed to cut their beards after marriage, so it’s a religious thing. \n\nhttps://www.nbcnews.com/news/us-news/amish-get-lesser-sentences-beard-cutting-attacks-n315966",
          "id": 99,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Agree. It’s not a funny little prank, it’s assault, full stop. WTF are some people thinking? And what circumstances would make something like this ok, ever? \n\nNTA, hope things work out alright.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3044,
      "content": "PRESS THOSE CHARGES! I’m going to say this as an extremely mentally I’ll person with four professionally diagnosed disorders… while your mental illness may be a reason for your actions, it will never be an excuse! Own up to your actions. Whether you were aware of them or not, what you did caused harm to someone, and that’s something you need to take accountability for. If you murder someone but have a mental illness, you’re still put in an asylum and not set free. That’s because, while you need help, you also need to be held accountable. You pressing charges is the right move, don’t listen to their gaslighting. You need to stand up for yourself and make sure this “friend” doesn’t do anything like that to anyone again. Hair is such an important thing! On a side note, everyone else in the comments is right. Make a full record of every single thing his relatives are saying. Tell each and every person that if they continue to message you, that you will report them for harassment. Follow through if they do! I don’t think blocking them is a good idea, if you do that then you won’t be able to have proof if they actually do harass you and so then you won’t be able to nail those rude people lol. Anyways, I wish you luck! :)",
      "id": 101,
      "comments": [
        {
          "score": 448,
          "content": "This. It's very important. I have C-PTSD and some related issues. I am actively working on this, but I can still be triggered by things, and my reactions are not exactly my finest moments. I am blessed to have a circle of friends who are very understanding and patient and tolerant, but even though we all know that how I behave when my lizard brain has seized the wheel and stomped on the gas isn't entirely under my control (I know this could be worded better, but just how eludes me for the minute), I still make a point to apologise if I hurt someone. My history and my mental illness might *explain* why I did something, but it doesn't *excuse* it.\n\nEven simpler: my ADHD thinks names and dates aren't worth remembering, so I keep a dead tree diary because writing stuff down helps, and I'm a wizard at last-minute and belated gift buying and note writing, because while I know my brain seemingly has a vendetta against birthdays and anniversaries, it doesn't mean I just get to shrug at my partners and go, \"Five years, huh? Who'da thunk it?\"",
          "id": 102,
          "comments": [
            {
              "score": 104,
              "content": "Exactly! Same here, I’ve been known to snap and say hurtful things when in episodes. It’s up to me to man up and say hey, I took it out on you and that’s not okay. It’s NOT okay for me to brush it off and say “well I’m mentally I’ll so it’s not my fault” like I see so many people do.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "A good help for that, btw, is to also write a reminder down two or three weeks ahead of time, which gives you time to get something.  I do this all the time.  \n\nI put birthdays in my google calendar, and have them all set to send me reminders two and three weeks before.  And to repeat once a year.  It works!",
              "id": 104,
              "comments": [
                {
                  "score": 9,
                  "content": "Hear hear on writing reminders that something is coming up.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 3,
                      "content": "It really helps--I have time to get a gift, send a card, do whatever needs to be done.  I do it for everything that needs some thought ahead of time!",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I have a paper wall calendar (month by month kind) hanging in the kitchen where I see it several times a day and it helps so much.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "\"Five years, huh? Who'da thunk it? Would be great for wedding vows lol",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Hang in there. I’ve got cptsd too. Took like 8 years of therapy work before I could manage my triggered state. It’s well worth getting to that point, especially if you ever want to become a parent. I’m SO glad I put in the work before I had a toddler pushing every single button lol",
              "id": 109,
              "comments": [
                {
                  "score": 3,
                  "content": "I missed the parenting boat - premature menopause caused by a genetic condition I wasn't sure I wanted to risk passing on anyway - but I am a total professional Auntie in my group of friends/village raising the next generation of weirdos. And my brother is getting married in May, so there may be niblings on the horizon.\n\nI'm glad you found peace and are able to be present for your family. ❤",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 311,
          "content": "OP. I have had cancer twice. Lost my hair both times\n\n100% NTA & I asked that no one shave their head in support. It's awful to lose your hair & I'm sorry he did this to you.\n\nAlso, as some one with cancer ALWAYS ask before you shave your head! I killed me to see bald heads. Just reminded in what should have been fun, forgot your sick moments, that I was sick.",
          "id": 111,
          "comments": [
            {
              "score": 166,
              "content": "I have seen SO many people with cancer say the same thing, that it makes them uncomfortable! The people that shave their heads without permission from the person with cancer usually just do it to show how “cool and understanding” they are. Never rubbed me the right way.",
              "id": 112,
              "comments": [
                {
                  "score": 105,
                  "content": "My mom is a hairstylist. Has been for 40 years.\n\nFirst time: she shaved mine & went right to hers. I didn't even have time to take in what was happening to me.\n\nI know she thought she was helping. But I had to look at her (was to sick to live alone) when I couldn't even look at myself in the mirror for 3 days.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 61,
                      "content": "That’s so heartbreaking, I’m so sorry. People never understand how to help those with chronic pain and chronic illnesses, they constantly interject themselves into it without actually taking your complex thoughts and emotions into consideration. I deal with chronic pain and constant deal with people giving me unwanted suggestions and will say things like “oh it’s not a disability, you’ll be okay!” and well-intentioned but incredibly hurtful things like that. I wish people would just stop to think instead of just doing.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I’m sorry you had to go through that, and I hope you were able to love your reflection again, you deserve it ♥️",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I never understood the shaving head in solidarity thing, except for a few situations. A parent/sibling shaving their head when their young child/sibling has cancer, so they don't feel so different? Okay maybe.\n\nI mean, I wouldn't bind one of my breasts in solidarity with someone who had a mastectomy so it looks like we both only had one. It's just weird.",
              "id": 116,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 158,
          "content": "“Your mental illness is not your fault, but it IS your responsibility.” - Marcus Parks\n\nHail yourself, friend!\n\nEdit: a word",
          "id": 117,
          "comments": [
            {
              "score": 7,
              "content": "Hail Satan!",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Dogmeat is one of the great modern day philosophers",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Hail meeeeeeeee bitches. Love those guys.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Never heard that quote before, but I love it! Truth!",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I literally had chills when he said that. Ugh. Love those guys.\n\nHail yourself!",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": ">while your mental illness may be a reason for your actions, it will never be an excuse! Own\n\nSo true. Thank you for saying that. He is still an adult capable of recognizing the hurt and damage he has caused; he is choosing not to take replacement for his actions and choices, including his choice to stop taking his prescribed medication. He should be held accountable for his actions and choices. The Justice system will ensure he receives justice for his actions, his family will excuse them and he will continue to cause further harm if he is enabled by them.",
          "id": 123,
          "comments": [
            {
              "score": 3,
              "content": "Exactly! It’s also a major problem that those around him are just… letting it happen??? They’re such enablers and it’s preventing him from a) being held accountable and b) growing as a person and learning how to manage his mental illness! Glad you can agree 👍🏻",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Thank you for this - it's not helping a stigma against the mentally ill if we decide certain groups are allowed to go around assaulting people and are excused for mental illness. It is up to the court to listen to that excuse and decide whether he needs medical treatment. Gary has a whole lifetime of \"oh, I stopped taking my meds\" that could lead to more serious things than shaving OP's head and eyebrow. Especially if he thinks that it is \"justified.\"",
          "id": 125,
          "comments": [
            {
              "score": 3,
              "content": "I totally agree! Not holding people with mental illness is infantilizing them!",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Scream it loud!\nBipolar. I'm on medication if I went off of it yikes... But I own up for the hurt and shit I cause.\nMENTAL ILLNESS IS NOT AN EXCUSE TO BE AN ASSHOLE",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "[deleted]",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "THIS! \n\nI have PTSD, anxiety, and depression. I can be an area to my other half sometimes because of all the trauma and abuse in my past. \nI am in the wrong when this happens. He knows why I sometimes snap or get angry at him, he’s super patient, but when I’m in a better space he always holds me accountable, and I love that about him. \n\nJust because I have a reason to be triggered or act a certain way, does not mean it is acceptable, and that’s the same with this guy. \n\nHe needs to be held accountable, and if he isn’t I can picture him doing the exact same thing to someone else!",
          "id": 129,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2023,
      "content": "NTA. I am SO OVER people shaving their heads for their friends and relatives who have cancer when the patient isn't even involved in it and often doesn't want them to. Absolutely, PRESS THOSE CHARGES! This will teach Gary to stay on his meds and unfortunately losing most of his friends will hopefully cement that lesson. I'm sorry that happened to you.",
      "id": 130,
      "comments": [
        {
          "score": 2077,
          "content": "I had an uncle die from cancer at 40, and we were there when his hair was falling out in clumps (and he threw it out the car window and it blew back into his face and he laughed so hard he almost had an asthma attack) and we bought him the shaver so he could shave it off so it wasn’t clumpy. My mum drove him to his doctors appointments. We went to visit him after his surgery and mum fought Centrelink when they didn’t want to give him the disability pension. \n\nWhen my dad had cancer, I made him high fat smoothies to stop him losing weight and I cleaned his vomit out of the sink. \n\nShaving your head doesn’t help someone with cancer. With kids, it might make them feel safe because they can relate to someone, but realistically, people with cancer don’t need you to shave your head, they need you to help with the every day practicalities. Because you might shave your head, but after that one act of solidarity you’re gone. They need rides to chemo, they need help cleaning the house and doing the laundry, they need someone to walk the dog and carry groceries and cook. Things that are actually fucking useful. Grand gestures don’t help. It’s small things that do.\n\nEdit: thank you for the awards, if you want to set up a meal train for someone you know who’s undergoing treatment for cancer/recovering from surgery/has just given birth etc, there’s a website dedicated to it. Also, always wear sunscreen.",
          "id": 131,
          "comments": [
            {
              "score": 286,
              "content": "This comment is perfect and makes it really clear the difference between performance and support. Well put. If I had an award, it'd be yours.\n\nAs for the OP - 100000% NTA. You don't even know the person with cancer, and even if you did, no means no and Gary needs to deal with the consequences of what he did. As another super mentally ill person I promise you, being crazy doesn't excuse what was done to you. Like somebody further up said, it can explain Gary's behaviour but it doesn't excuse it.",
              "id": 132,
              "comments": [
                {
                  "score": 4,
                  "content": "Wait, I read this whole post thinking Gary was the one who had cancer, and he’s not? So Gary was demanding OP shave his head for someone OP doesn’t even know?",
                  "id": 133,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 165,
              "content": "Ok did the “head shaving for solidarity” thing start as being for kids? Because that makes sense to me: normalizing something for children. Otherwise it’s very performative seeming. I knew a woman who literally told my friend “There is a silver lining to your chemo treatment because I was too afraid to shave my head before and now I have an excuse”",
              "id": 134,
              "comments": [
                {
                  "score": 92,
                  "content": "I think so! And if my future child was scared to be the only bald one, I would ask if they wanted mommy to be bald too, or if they would rather pick out a whole mess of fun beanies and dye wigs together. Imagine the cosplay opportunities for a kid - they could be Elsa, Ariel the Mermaid, anyone they wanted!",
                  "id": 135,
                  "comments": [
                    {
                      "score": 11,
                      "content": "You’re a sweet person, the fantasy wig idea is great",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "This is actually the mentality some parents of kids with alopecia or other things that cause baldness have. The fun wig thing. It’s a way to make something scary less scary for the kid and make it fun. \n\nA good way to do it is every time you have a hair salon appointment or are doing something new to your hair take them to get a wig or do something fun to their wig. So they feel included.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "OMG, that woman is insufferable. What a fucked up thing to say.",
                  "id": 138,
                  "comments": [
                    {
                      "score": 15,
                      "content": "That's, like, something you admit to your husband sheepishly in the privacy of your own bedroom, at best",
                      "id": 139,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "I mean I think she thought she was being cute or jokey but it was just really terrible.",
                      "id": 140,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "> I knew a woman who literally told my friend “There is a silver lining to your chemo treatment because I was too afraid to shave my head before and now I have an excuse”\n\nWhy the fuck would someone actually say that to somebody?",
                  "id": 141,
                  "comments": [
                    {
                      "score": 7,
                      "content": "She said it in a jokey tone but it fell very flat",
                      "id": 142,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Idk maby it started as \"We shave our heads and donate the hair\" but now everyone just shaves. Donating it would kinda make sense",
                  "id": 143,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "I used to teach high school and have done it one time for a girl who was petrified to come back. Her friends came up with the idea and asked me. I never would have suggested it. Ever.",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Exactly this! When I was a teen, I used to shave my head to 1/4\" inch and it was bleached white. My mom didn't love it but she and my dad never ever quashed our individuality. \n\nWhen I was 25, I was laughing with my mom at the irony as I shaved *her* head as her hair was coming out in clumps. \n\nWhen I was 26, we had her cremated. \n\nI can promise if even one person back then (this was in 1994-1995, before the supportive head shaving really took hold) had shaved their head in solidarity with her, she would have said thank you and, behind the scenes, would have been mortified and thought it was ridiculous. The exception would have been her very best friend or one of us kids or even my dad but like I said, it wasn't a thing, yet, at least not on our radar in Los Angeles. It's not supportive when it's all about everyone but the patient. \n\nI can't tell you how many people I've heard say to stop wearing pink for breast cancer. Seriously, what \"awareness\" is still needed, except that men also get it as do very young women. By and large, breast cancer patients have said instead of buying pink stuff, donate to a cure or a charity that is working with cancer patients and their families, etc. \n\nI'm right there with you that the little things mean *so much more*! I'd rather have someone drop off two lunches one week and never help again than to have them parade their shaved head to me and do nothing else.",
              "id": 145,
              "comments": [
                {
                  "score": 12,
                  "content": "Breast cancer is the ONLY TYPE of cancer that has so much support. I remember being in middle school with the \"I ♡ BOOBIES\" bracelets. Then you have to chop off your tiddy, and your tiddy is gone, and suddenly the thing that made that cancer important is gone and Angelina Jolie is ugly and manly without her pillowsacks, how dare she take preventive care because it runs in her family and would probably kill her\n\nUGH",
                  "id": 146,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Meanwhile, heart disease kills more women each year than all other cancers combined, including breast! And our symptoms present so differently than men's so awareness is really important. And I remember reading somewhere that kids' cancers are extremely underfunded when it comes to research and cures. There's no \"money\" in it so the big labs and big pharma don't invest in it. Isn't that just disgusting?",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Thank you for doing that for your Dad!\n\nI was diagnosed with a rare and aggressive stomach cancer just over a month ago and I start chemo next week. I'm slightly terrified as to how the drugs will affect me.\n\nAnd if anyone approaches me about shaving their head in solidarity, I'll say \"please don't\". It won't help me, and would actually make me feel worse.",
              "id": 148,
              "comments": [
                {
                  "score": 5,
                  "content": "I’m so sorry to hear that. I don’t really have much advice for you, but I wish you all the best and I hope you manage okay. I won’t lie to you, it’s going to be shit, but my dad came out of it the other side and you’d hardly know he was ever sick. He’s been cancer free since late 2018. The biggest thing is that he doesn’t really like chocolate anymore, which is sad.",
                  "id": 149,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Thank you alliecat. :-)\n\nI was hesitant to ask, but I'm so pleased you volunteered the information that he came through it YAY!!! Not liking chocolate anymore is a teeny tiny price to pay. I currently have a feeding tube and struggle to drink anything. I can't eat anything at all. I can't wait until my stomach is rebuilt and I can have a meal! Won't be for a few months yet, but all going well, it will at least be this year.",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "My dad didn’t lose a lot of hair during his bout of terminal cancer, he did lose his beard however and my grandad shaved his beard in solidarity. But my dad never asked anyone to do that! Like you said, you do other things that actually help the person, like cleaning up after them, making sure they have the right meds and food, hell just sitting with them while they sleep, but shaving your hair doesn’t fix their cancer. They need actual help, not a gesture from someone they don’t even know.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "This. My husband was diagnosed in october pf 2021 with Plasmacytoma a rare form of leukemia and we need HELP! Not shaving ur head help. We need a ramp since he lost the use of his legs. And we need help with him getting place s or even down the stairs. No one will help. He doesnt want someone shaving their heads.",
              "id": 152,
              "comments": [
                {
                  "score": 3,
                  "content": "Exactly. Someone shaving their head isn’t going to install a stairlift.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "You spittin straight facts. Seriously, taking out the trash and microwaving prepped food was in the top three most difficult obstacles after my lung surgery to remove a thymoma tumour. Hot damn I'm so thankful for my loved ones who helped me through the practical things.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "[deleted]",
              "id": 155,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 328,
          "content": "This used to be a heartfelt thing sometimes some people did and it was appreciated that way. Now it feels like a trend and some people out here forcing others to do it. The gesture is just ruined now.",
          "id": 156,
          "comments": [
            {
              "score": 140,
              "content": "That's exactly how I feel. I've seen so many cancer patients in the last few years saying don't shave your head for me, I don't need a reminder of how I look. And others love it! But the bottom line is that it should be done genuinely and with empathy and ideally you know that the patient will appreciate it. This guy doesn't even *know* the patient! Gary was **way** out of line and if being off his meds is the excuse, then this charge on his record should be a stark reminder that he needs to stay on them.",
              "id": 157,
              "comments": [
                {
                  "score": 88,
                  "content": "As someone who lost their hair due to cancer the absolute last thing I wanted was anyone around me shaving their heads. To me this is virtue signalling on an enormous level (look at me I'm friends with the poor cancer person, praise me I'm so supportive and wacky). But its also very insensitive because shaved hair may take ages to grow back to the original length but it does begin to grow immediately- I was as bald as a coot for months before the tiniest bit of regrowth happened.\n\nThe absolute only time I consider it to be helpful is when an organisation that supported the patient needs funds and this is a way to help them.\n\nEdit to add NTA",
                  "id": 158,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Before I started chemo I cut my hair and donated it to Wigs for Kids. Couldn’t stand the thought of my long hair falling out and going in the trash.",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "I know one guy who shaved his head when his son (5yo) was going through Chemo. There was not even a hint that anyone else in the family should do it, much less friends, neighbours, or (like OP's case) complete strangers.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "I am a cancer survivor who was diagnosed and lost my hair at 19 - an age where both I and most of my friends (male and female)  expressed ourselves through our appearance. Including our hair. When I lost my hair I had 3 different friends ask if I wanted them to shave their heads in solidarity. My answer? HELL NO. Being bald at that age sucked. Why would I want my friends to deal with it? And why would I want to be reminded of my illness by looking at their bald ass heads every time I felt well enough to hang out? This has nothing to do with the cancer patient and everything to do with virtue signaling on Gary’s part. STRONG N T A",
          "id": 161,
          "comments": [
            {
              "score": 3,
              "content": "I am SO glad you're a survivor! Thank you for your input here. I had some trepidation when I commented that it might come off sounding disrespectful to cancer patients but the comments have completely eased my mind, especially those from folks like you who have survived it or are currently fighting it. I don't think it should *never* be done but I'd just like to see it done for the right reasons and with the patients' approval.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "[deleted]",
          "id": 163,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Cancer patient here. The absolute last thing I wanted when I was doing chemo was to look at all my friends and family and be reminded about my cancer. Also, they all had eyebrows and eyelashes and while a cancer patient's hair stays gone for months and months, theirs grows back immediately and looks like a fashion statement, not like a sick alien. It doesn't help anyone. You know what did help me? People not assaulting people in my name, jeez",
          "id": 164,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 665,
      "content": "NTA. Being off meds may be a reason, but it's **never** an excuse and that was definitely assault. In fact, if you haven't already told the police, make sure they know that Gary previously asked you to \"get on the bandwagon\", said he'd shave it for you *while unpacking his equipment!*, you refused and he verbally assaulted you. He knew you didn't and wouldn't consent, but did it anyway while you were *unconscious*. Block Gary and his relatives from everything, try not to get upset when you can't avoid a mirror, and hope your hair grows back better than before :)",
      "id": 165,
      "comments": [
        {
          "score": 597,
          "content": "The police know every detail about Gary that I've given here, save for his family harassing me. Which I intend to tell the police about ASAP",
          "id": 166,
          "comments": [
            {
              "score": 129,
              "content": "OP, definitely tell the police about the harassment.  And stick with the charges.  Gary needs to suffer the consequences of his behavior.  NTA.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 80,
              "content": "Do that.  If Gary is truly mentally ill, then it's likely that his family has begged for pity on his behalf before, preventing Gary from getting the treatment he needs.  In this case, it's also their fault that your hair is gone.",
              "id": 168,
              "comments": [
                {
                  "score": 8,
                  "content": "This is a huge thing! A lot of times people will coddle mentally ill folks (of which I am one) and it prevents them from receiving real world consequences which would teach them better behavior",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I would call the non emergency line at your local police station right now and the DA the next time the courthouse is open.",
              "id": 170,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 399,
      "content": "NTA.  That was completely unacceptable.  If he was \"off his meds\" his lawyer can bring that up as a mitigating factor.  He'll probably only get community service.",
      "id": 171,
      "comments": [
        {
          "score": 6,
          "content": "Would they not have to prove that he was off his meds through no fault of his own as opposed to just deciding \"nah, can't be arsed\".",
          "id": 172,
          "comments": [
            {
              "score": 7,
              "content": "To get off completely, yes.  It may get him a lighter sentence.  At any rate, it's not OP's responsibility as the victim to worry about that.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 295,
      "content": "NTA\n\nWhat he did was assault, he’s getting assault charges because of what *he* did.",
      "id": 174,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 295,
      "content": "...but did you shave the other eyebrow to even out the regrowth?",
      "id": 175,
      "comments": [
        {
          "score": 449,
          "content": "Unfortunately yes. I had to",
          "id": 176,
          "comments": [
            {
              "score": 232,
              "content": "Thank you for answering such an essential question! Lol you're NTA btw and could probably sue him for the mental heath toll on top of pressing charges",
              "id": 177,
              "comments": [
                {
                  "score": 16,
                  "content": "That’s brilliant, add the possibility of issues with customer/ co worker opinions depending on the job",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 70,
              "content": "Lol @ your username. That all really sucks. I hope it grows back quick.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "hey u could glue gems to your face in the place of eyebrows, and have sparkle brows (also NTA)",
              "id": 180,
              "comments": [
                {
                  "score": 36,
                  "content": "No, glue those worm on a string dudes to your forehead *fashion*",
                  "id": 181,
                  "comments": [
                    {
                      "score": 8,
                      "content": "No, glue gummy worms, you'll look sweet!",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "They make eyebrow temp tattoos that look pretty good. Just an idea if it bothers you a lot while waiting for them to grow back.",
              "id": 183,
              "comments": [
                {
                  "score": 48,
                  "content": "Or just use an eyebrow pencil. It'll look a bit stupid, but less stupid.\n\nSource: accidently naired away an eyebrow",
                  "id": 184,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Aw punkin.  If you just hate the way it looks, consider going to Ulta or Sephora and have one of the sales people help you with brow replacement options.   They’d be happy to help you.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Man if someone did this to me I'd probably break down and need therapy. Not because of the hair but because of someone violating me like this when I couldn't defend myself. Like what the fuck is wrong with him.",
              "id": 186,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I was wondering that too! Are you using a pencil or something until they grow back? \nI'm really sorry that happened to you.",
              "id": 187,
              "comments": [
                {
                  "score": 7,
                  "content": "I'm just wearing a hat most of the time. And someone suggested I wear my glasses more to better help obscure my lack of eyebrows.",
                  "id": 188,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 233,
      "content": "NTA mental illness is not justification for assaulting someone.",
      "id": 189,
      "comments": [],
      "relation": "Support"
    }
  ]
}