{
  "post content": "My (16F) friend (16F) got really into tiktok when the pandemic started and kind of fell down the rabbit hole of people who have (or are pretending to have) dissociative personality disorder. She made a tiktok where she pretended to have it and it got kind of popular in that community.\n\nAt first it was kind of a joke but then she started getting really into it. Now it's all she talks about. I stopped hanging out with her a couple months ago because I would ask that we talk about something else and she'd have someone else from her \"system\" come out and threaten me. She also started making tiktoks about how her best friend wasn't supporting her, which really pissed me off.\n\nYesterday her mom came to talk to me and ask what was going on since she's acting so weird and we weren't hanging out anymore. We've been friends since we were kids. So I told her that I didn't like hanging out with her anymore because of the fake DID and showed her the tiktok, including the videos where she was talking about me. Her mom thanked me and told me she'd talk to her.\n\nA couple hours later she messaged me saying that I was an asshole and that her mom banned her from tiktok and I was ruining her life. I didn't respond but she sent a bunch of people to send me messages on tiktok and discord to say I was awful, too.\n\nI feel bad that her mom banned her from tiktok but I don't feel like I owe her anything anymore, honestly.",
  "id": 1,
  "comments": [
    {
      "score": 8231,
      "content": "NTA. Your friend is a minor who was showing enough of a worrying change in behavior that her mother reached out to you to learn what was going on. It was good you disclosed she had become part of a community that was causing her to act out.",
      "id": 2,
      "comments": [
        {
          "score": 2203,
          "content": "This.\n\nAlso one of my fears as a parent, TikTok is like bad behavior catnip to kids I swear, I made my kid let me follow their TikTok but what if they have a secret one 😭",
          "id": 3,
          "comments": [
            {
              "score": 798,
              "content": "Yeah, seems like it should be an 18+ app tbh...not that the label does anything anyways.",
              "id": 4,
              "comments": [
                {
                  "score": 835,
                  "content": "Or, and hear me out on this, parents can think back to how much shit we all got into as kids and realize a lightly moderated and largely unsupervised Internet platform probably *isn’t* something they should be letting their kids use freely.\n\nDon’t get me wrong, the owners of these internet platforms should absolutely be doing more to protect their users of all ages shapes and sizes. But there is only so much parenting that an internet platform can do, it’s mostly on the parents themselves to stop letting their kids do whatever the fuck they want. 🤷🏻‍♀️",
                  "id": 5,
                  "comments": [
                    {
                      "score": 355,
                      "content": "Kids have access to the internet on their phones (which most have to be contactable by parents or contact their parents if they need them and in many cases are required for a part of home schooling during covid), computers at school, public access computers, computers in friends homes.\n\nYou can't supervise you kids all the time when the internet is so freely accessible. Instead I aim to educate my child in exactly how toxic it can be. Yeah, I can limit her access or at least curb her access while she's with me, but for those times she's not I aim to make sure she understands why she needs to stay away from rubbish like TikTok.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 98,
                      "content": "Or you can get a phone that works for calls, texts, and email and block the hell out of unfettered internet and app access. I wouldn't allow my kid to have a smartphone until he left for college. Pissed him off then but he understands why now.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "> it’s mostly on the parents themselves to stop letting their kids do whatever the fuck they want\n\nYou mean parents shouldn't use tiktok, Facebook and the like as babysitters? Who would have guessed? /s",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "If I ever have children, I am going to gather EVERY cringey af video, voice recording, just anything and everything available.\n\nI will sit them down and force them to watch it with me until all humor has faded and we're only left with feelings of cringe so bad it's like you're about to collapse in on yourself.\n\n Then, I'll stop it, and say \"Kids thought that shit was cool. ***I*** thought that was cool and from the pain on both our faces it clearly was *not* cool. I'm lucky in that this is something I can destroy and it will be **gone**. There's no undo button for the internet. I don't want you to stop having fun, I just want you to *really, REALLY* think about whether you should upload something or not. Can you live with it forever? Cause you might very well have to. If you're unsure, ask me, another trusted adult and/or your friends.\"\n\nMy mom kept my siblings and I in line while in public by deploying cringe. Anytime we started acting an ass she'd respond with exactly that: her ass. She'd lean her torso onto her carriage and then lift her heels up like she was wearing high heels, which would stick her ass out to cartoonish proportions. She'd make really exaggerated steps, swaying her hips like mad and talk a little louder. We *always* heeded the threat of \"the Big Butt Lady\" after those first few times.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Well it appears this particular parent saw red flags and quite rightly made enquiries of another party. Let's hope she gets treatment and recovers, it sounds like an awful situation.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "God I hate it when people say “Or, and hear me out on this” it sounds so condescending and arrogant.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "You mean <gasp!> actually pay attention and raise their children?!  How dare you?!  Everyone knows that digital media is the new babysitter.  What could possibly go wrong with giving them unsupervised access to the worst influences of the entire world? /s",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "Exactly, we had one incident with kiddo that resulted in a very long suspension from technology and I am fingers crossed it was a lesson learned because damn the internet is forever.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "It teaches kids how to subtract 18 from the current year.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Yea its absolutely crazy.  My 14 year old is obsessed with it.   There is all sorts of crazy shit on there.  Kids today are exposed to so much.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Horror movies has 18+ but you find a kindergarden into the cinema...",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "If you read the terms and conditions of the app in some countries it is 18+ while the rest are 13+ the confusing part about that is it doesn't inform you of which countries those are.",
                  "id": 17,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "It's not just kids. My aunt's neighbor (a woman in her 20s) has made a platform out of harassing my aunt and pretending my aunt is some 'evil neighbor' who won't leave her alone. People suck. Giving them social media platforms allows them to get validated for how badly they suck, so they keep doing it.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "My 15yo came home from school talking about \"devious licks\" and I was like wtf? It's a cesspool.",
              "id": 19,
              "comments": [
                {
                  "score": 42,
                  "content": "I hate it! Our little fuckers have destroyed the bathrooms at school! Apparently next month the challenge is to slap a teacher's ass and film it! I'm going to end up going to jail for slapping a middle schooler! Goodbye, everyone!",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "Look up “angelic yields” (the reverse of the devious licks trend) if you need your faith in teenagers restored— it’s not all bad. I really like TikTok, but if you get on a bad side it’s really easy to stay there and get sucked in deeper.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 26,
                      "content": "This. Like everything, Tiktok has a good side as well. Luckily, I’m on that side and I find that parts of Tiktok aren’t that bad. It just depends on how you use it. I also have a trusting relationship with my parents where I will show them my accounts willingly (like memes) and we make tiktoks together and stuff like that. It really just depends where you end up on tiktok and how you use it. I like watching tiktoks but 100% some of the trends on there are absolutely stupid. Op is NTA because the friend was using Tiktok in a way it shouldn’t be used. Faking a serious mental disorder isn’t okay in any way, shape or form and faking DID seems to be a trend right now. I’d also recommend that friend gets therapy, as I don’t think just getting off Tiktok will solve the issue. It’ll help but friend will find other ways to still fake DID if she wants to",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Still dont know what that is, dont plan on finding it out because it sounds dumb? Just glad I never got into social media much, books are better",
                  "id": 23,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "If you want an insight into your kid's mindset, ask them. \"So Ellie, I saw today that there's a TikTok thing where people pretend to have DID, and I don't understand it, can you explain it to me?\"\n\nThis does two things\n\n1. It shows your kid that you respect their opinion and expertise on a subject. Kids love that shiz.\n2. How she answers will tell you a lot about how she views these kinds of things.",
              "id": 24,
              "comments": [
                {
                  "score": 3,
                  "content": "Ohhh that’s a good idea rather than just straight up asking, I heard about the new DiD trend…just wtf.\n\nAlso I was like…how do you know my dogs name? Lol",
                  "id": 25,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Your dog's on TikTok, and her behavior is atrocious 😆 \n\nJK. I have a cousin named Ellie, and it's the first name I thought of.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Hello parent, Im a teen and lemme just say, the odds support this. Check if they are logged in on the browser or something and if they hide their stories from you. Also, check if they have a separate general and primary tabs in their chat.\n\n\\-A teen who does all that",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I’m honestly hoping against all hope that TikTok has died out by the time my kids are teenagers..",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Bad behavior catnip is a perfect description.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I call it kiddie porn--little kids in skimpy outfits doing suggestive dance moves while giving \"come hither\" looks to the camera.  ps--I don't have an account--one of my elementary students showed it to me.  All I could say was \"does your mom know you have this?\"",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "If you're worried that they do, they do.  But look at their overall behavior, if it's generally okay, you're probably fine.",
              "id": 31,
              "comments": [
                {
                  "score": 5,
                  "content": "I’m worried in a general sense but they’re actually generally a really good kiddo so not really worried if that all makes sense? I have free access to their phone whenever I want so I am regularly checking things like emails,  texts etc. they are young enough i think this is a appropriate for awhile longer but old enough id like them to have a phone.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I think it's a good idea to follow it, if they're young, they probably don't have a secret account. \n\nI'd like to suggest, though, that you get into a routine where they give you their phone at bedtime.  Once they are teenagers, they can get into real trouble with the phone late at night.  Not to mention not getting proper sleep!   It's impossible to start doing this as a new thing once they ARE teenagers, so it's important to start it now. \n\nIn fact, anything you'd like them to be doing as teenagers, start it as a routine before they are teenagers.  It will really help.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Just look at their friends and then see who they're following and you'll be able to track one down pretty easy if they have one",
              "id": 34,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 132,
          "content": "Agreed. \n\nFriend needs help. Friend's mom can, and hopefully will, get her that help.\n\nAlso, the fake DID community can be really dangerous, especially to people with actual DID or other mental health conditions. If friend is deep enough in that community to have flying monkeys to send at OP, she's very much at risk of being abused or manipulated by the bad actors within that community.",
          "id": 35,
          "comments": [
            {
              "score": 75,
              "content": "Sounds like this \"friend\" IS one of the bad actors. Faking disorders is some bullshit.",
              "id": 36,
              "comments": [
                {
                  "score": 41,
                  "content": "Possibly, but what OP describes sounds more like friend got drawn in and caught up in that community. Friend's behavior is still really messed up no matter what, but it's somewhat different in my mind if she was targeted and manipulated by some of the charismatic abusers who exist in that community. I've seen how those types can really mindfuck someone who is vulnerable to manipulation. \n\nAnd, absolutely, faking disorders is terrible. I guess, in my experience, faking DID a pretty normal horrible teenage type behavior. At the very least, i saw enough people who faked it off and on beginning in middle school. That behavior is still wrong and needs to be corrected, but in my experience it's one of the horrible phases some kids go through. (None of this should be construed to be commentary on whether DID is real. People with DID suffered greatly and have a terribly difficult to manage condition.)",
                  "id": 37,
                  "comments": [
                    {
                      "score": 27,
                      "content": "to add onto what you said, people who fake DID don't just give people with actual DID a bad name, it encourages people who do not have DID to fake claim anyone and everyone just because they learnt that people fake it. I have seen so many people just call people fake, even when its obvious that they're not faking, purely because people have made it their job to find people faking DID and other illnesses.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Yeah that's legit, thanks!",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Considering DID is normally seen as a condition brought about through major childhood trauma and abuse, and OP's friend is a minor, it could cause a lot of suspicion on friend's parents.",
              "id": 40,
              "comments": [
                {
                  "score": 6,
                  "content": "I can’t believe I’m even getting into this rabbit hole, but the fake DID community would call you ableist for saying that you need trauma to form a system; they claim theyre endogenic. born as a system",
                  "id": 41,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "NTA - She knew what she was doing was wrong and chose to continue, someone else could have just as easily sent her TikTok to her mom because she doesn't act like that outside of her phone and it's just flat out weird behaviour to see from someone you KNOW doesn't act like that. If she genuinely thinks she had DID she needs to see a doctor and get the proper diagnosis and proceed with her doctor's recommendations from there. You did the right thing, you told her mom the truth. To me, NTA.",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Agree with NTA, but the mum should seriously consider therapy for her kid. It sounds like she was using this DID imitation to make excuses for unregulated emotional outbursts and unacceptable behavior, e.g. threatening someone with \"a different part of herself\" to feel no responsibility for her own actions.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "What a true friend would do to get their friend help! Definitely NTA",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "The community didn't force her to lie about having a condition. The community didn't force her to treat her friend like shit that's all on her",
          "id": 45,
          "comments": [
            {
              "score": 1,
              "content": "I understand the community was unaware they were being decived but the positive attention she was receiving from the community was fueling her behaviour. Thus she needed to be separated from that postive feedback for her behaviour.",
              "id": 46,
              "comments": [
                {
                  "score": 2,
                  "content": "She needed to stop.lying to people who have suffered severe trauma in their childhoods, that she was like them, pretending to have an mental health isue for clicks and likes is pretty disgusting and it's not down to the community she's lying to her",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "NTA, but I'm not sure mom saw anything in her daughter's behaviour related to her fake DID. I think it's just that she saw her and op were not friends anymore and attributed any off behaviour to that, like a kid being a bit down losing a friend or maybe she was on a rant about how op was ignoring her or something.",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Okay but the community did not cause her to act out. No one asked her to fake a mental illness. She used the community to act out.",
          "id": 49,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1223,
      "content": "Based on the info you gave I’m saying NTA. (I’m assuming you and her mom know for certain she doesn’t have DID). Basically, anyone pretending to have a mental illness/disorder and getting clout off of it is harmful af to people in that community. I definitely think her mom taking away her privileges is suitable, but I still think to some extent this girl has some mental illness (maybe not DID but something else) that is causing her to act like this.\n\nETA: I only said the assuming part just because I wanted to be respectful INCASE this person has DID. I’m not saying she does or doesn’t. I’m just making my judgment based off the information given. That being said, OP is still NTA because her friend is pretending to have a mental disorder because it’s “trendy” which is not cool. Please don’t assume I’m taking the friends side.",
      "id": 50,
      "comments": [
        {
          "score": 561,
          "content": "If she *does* have DID then she needs professional help, not tiktok",
          "id": 51,
          "comments": [
            {
              "score": 316,
              "content": "If she was diagnosed with DID her parents would have been informed of the diagnosis by the psychiatrist (probably before they explained it to her). Perhaps her parent should take her for a psych consult - maybe then, she'd understand why you don't pretend to have a psychiatric condition to get attention",
              "id": 52,
              "comments": [
                {
                  "score": 186,
                  "content": "Minors typically aren’t diagnosed with DID. \n\nAnd minors who fake it for attention then use the fact that most psychs won’t diagnose minors with it to validate their self diagnosis. “Doctors won’t confirm it for me yet but I know better than them.”",
                  "id": 53,
                  "comments": [
                    {
                      "score": 118,
                      "content": "As a mental health professional, the fact that this teenager needs to 'fake' a mental illness is a huge clue that something's not right. *That* needs to be addressed.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Even tho inherent to the condition is the fact that you don’t notice",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 36,
                  "content": "It's almost impossible to get diagnosed with DID so the idea of a teenager getting diagnosed with it is almost laughable.  typically you're within the mental health system for 7+ years and go through a bunch of other misdiagnosis. Psychs want to eliminate the possibility of anything else you could have before giving you a DID diagnosis because of the societal ramifications of it.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "plurality isnt the same as DID. the teen sounds like they're a plural system and NOT  did. endogenic and not traumagenic",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "[deleted]",
                  "id": 58,
                  "comments": [
                    {
                      "score": 17,
                      "content": "no, they wouldn't automatically be charged and, even had she been abused to cause it, that doesn't mean that the parents were the abusers",
                      "id": 59,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Not always.",
                      "id": 60,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 171,
          "content": "Not saying she doesn’t have mental illness of some sort but the fake DID trend is MASSIVE on TikTok right now, to the point where they are bullying people who may actually have it because they actually went through trauma, calling them “privileged” for having gone through that trauma because “just because I wasn’t traumatized doesn’t mean I couldn’t randomly develop DID like I totally did do”. The whole trend is pretty fucking disgusting.",
          "id": 61,
          "comments": [
            {
              "score": 59,
              "content": "That is so sick.",
              "id": 62,
              "comments": [
                {
                  "score": 117,
                  "content": "It really is. I had a friend with legit DID who went through untold horrors as a child. As in, extreme sexual abuse by her family. She was in therapy multiple times a week thankfully but the one time I saw her transition it was scary and unsettling. It ruined many aspects of her life and there’s nothing fun or trendy about it. She could not hold a job, friendships were hard for her and her first marriage crumbled because of it. These kids are disgusting for thinking this is something ‘interesting’.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Fuck, that is really fucking sad.\n\nI hope she's doing better now.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "It's so weird how tumblr trends are repeating in tiktok. I remember when everyone in tumblr had alters and systems.",
              "id": 65,
              "comments": [
                {
                  "score": 10,
                  "content": "[deleted]",
                  "id": 66,
                  "comments": [
                    {
                      "score": 0,
                      "content": "Finding notes you don't remember writing is one of the symptoms of DID. You're just coming across as ignorant.",
                      "id": 67,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "history does repeat itself",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "You're mixing everything. these people are endogenic which is different to traumagenic.",
              "id": 69,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 171,
          "content": "Well, considering that OP's friend only has \"DID\" when mom is not around, it's pretty safe to say she doesn't have DID at all. Considering her \"DID\" only comes out either when she is on camera or when she needs to vent at her friend without getting the blame (because it's another personality, I swear, it wasn't really me!!!), I think it's even safer to assume that her self-diagnosis is nothing but a flight of fancy.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 131,
          "content": "DID is very rare, and typically people who have it do not know they have it.",
          "id": 71,
          "comments": [
            {
              "score": 114,
              "content": "DID is also mainly the result of heavy trauma. R/fakedisordercringe has some examples of people faking DID",
              "id": 72,
              "comments": [
                {
                  "score": 15,
                  "content": "I was just thinking of that sub when I read this post! It makes me so mad that people fake disorders like that and sway people like OPs former friend. Unfortunately I have seen similar behavior in teens I know but their parents just shrug it off like its no big deal. So upsetting.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I literally thought I was in that sub when I read this lol",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I’ve seen behavior like that in young kids exposed to tiktok. My mothers friends daughter recently got caught saying things like she needs a blood test for depression. The increase in mental health awareness also has those who are impressionable faking it",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 72,
              "content": "^ most people with DID don’t realise they have it till their 30s or 40s, when their brain starts to process their trauma or they’re in therapy and the therapist notices the distinct differences in personality and amnesia.",
              "id": 76,
              "comments": [
                {
                  "score": 36,
                  "content": "I’ve been in psychiatry for 8 years now, and met a person with actual DID only once. It’s incredibly rare, and as you said — often discovered in later life. And people with DID certainly don’t post about it on TikTok for fame and attention.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I know someone with DID and witnessed alters take over on two separate occasions. The person knew they had it, and while they only spoke very vaguely about their trauma (though more openly about their parents, who caused it), it was enough for me to tell that it was *massive*. We're talking *years* of physical and emotional abuse from people who were supposed to be family. *That's* the level of trauma that leads to DID; it doesn't \"just happen.\"\n\nWatching the alters take over was jarring. The person completely changed - voice, mannerisms, posture, everything. I only knew what I was seeing because my favorite relative was a psychiatrist who told me about some of his cases (without names, of course).",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Yeah, I actually thought I had a brain tumor. Missing time, unable to recognize my face, out of body experience, delusions, I thought I was dying. I went to a neurologist expecting the worse but instead was asked if I was abused severely as a child and I was like: \"oh no... Does abuse cause tumors?\" (I'm an idiot) And she looked scared of me... I remember her face being just scared which scared me and she said she believes I have DID then scheduled an appointment for me with the only specialist we had in the city at the time. I never had any alters, don't know what systems are in regards to DID, I've been properly treated and haven't disassociated in years, and I truly believe that the majority of these DID influencers are fucking fakes. Either they're fakes or they should sue their psychologists for malpractice and feeding into the idea of \"alters.\"",
              "id": 79,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I read some interesting stuff about if it was even real and just a very rare extension of PTSD and not actually it’s own disorder",
              "id": 80,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "It's really not that rare, DSM estimates between 1 and 3% of the population meets the criteria for DID. Psych professionals are shockingly undertrained in dissociation (which is incredibly common in the general population, DID is just one of many dissociative disorders) so most probably would not recognize someone with DID if/when a client has it.\n\nMost people with DID are misdiagnosed for years before finally getting a correct diagnosis. I had been seeing therapists for 9 years before someone finally figured it out. Things have been a lot easier since then.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 46,
          "content": "This, as someone who struggles every day with bipolar disorder and a litany of issues that come with it I find these people to be misguided at best, but probably just outright attention grabbing arseholes.\n\nShe might have Munchausen's, perhaps, but if it's just on tiktok then that's extremely unlikely. For every one person flaunting a mental health issue they don't have there are 10 with it who feel they can't get help because these people are invalidating their experiences.\n\nOP NTA",
          "id": 82,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "agreed. anyone who fakes a mental illness probably does have some mental issues they need to work out",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "As someone with a mental disorder (Bipolar disorder), I find it absolutely disgusting that people are using it as a way to get followers. Mental illness isn't trendy or cool. My brain works differently and I guess sometimes it's nice when I get creative and energetic, but it's also absolutely horrible and not something I want on display for the world to see.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "considering OP was there when the whole thing started \"as a joke\" is fair to assume she is faking.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "The mental illness is called 'clout chasing', most people will be cured after several years of making a fool of themselves in social media.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Sorry for nabbing onto your top comment. But I did want to tell people who are interested multiplicityandme on YouTube is a AMAZING place to learn about this disorder if anyone is interested.",
          "id": 87,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 623,
      "content": "NTA. Her pretending to have it is disgusting. It's a genuine disorder that doesn't need to be mocked by people that \"think it's cool\" or whatever her excuse might be.. You did the right thing.",
      "id": 88,
      "comments": [
        {
          "score": 10,
          "content": "I feel like there's a lot of self-diagnosing online, and these young people brag about having different mental illnesses like it's a hot trend.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -183,
          "content": "But Munchausen's is a legit psychological disorder... I feel like people here are kind of missing that. Like literally bashing this person who clearly has a psychological disorder and calling them \"disgusting\" because... you think they're mocking other people with psychological disorders? Well, you're kind of doing that too by bashing someone with pretty clear and serious symptoms of Munchausen's. Seems pretty misguided.",
          "id": 90,
          "comments": [
            {
              "score": 130,
              "content": "She haven’t been diagnosed with anything. The chances of her having Munchausen is probably much smaller than her being a teenager who wants some attention from others.\n\nIf the mother were concerned by a rapid change in behaviour, it’s much more likely that she is attention seeking when there’s not a history of her causing symptoms for other illnesses.\n\nBefore starting to diagnose people with illnesses one should try to explain their behaviour with human emotions. I’ve faked being ill, faking a cough or a sniffe. I’ve done it to get out of school, because of my laziness. In this case it’s more likely that she does it for the attention and kind words.\n\nIllnesses doesn’t define a person, but their emotions and thoughts do. And while illnesses can make someone do something, it’s much more likely that the emotions does it.",
              "id": 91,
              "comments": [
                {
                  "score": -53,
                  "content": "Yes, I also think she's faking it for attention... like that's literally in the definition of munchausen's. I'm not saying I can diagnose her accurately, but whether or not she has munchausen's, you can't deny she's showing multiple serious symptoms of Munchausen's. And it's pretty cruel and hypocritical the way everyone in this comment section is ignoring that. For people who are claiming to care so much about people with mental illnesses, they're pretty quick to gloss over the fact that this is a child showing some pretty obvious, very worrying signs of potentially having a serious psychological disorder.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 25,
                      "content": "No it’s not.. faking something for attention might be one of the criteria for Munchhausen, but there’s so much more that comes with it. There’s often (childhood) trauma or neglect etc. and some kind of harming of oneself to appear sick.\n\nBeing hyperactive doesn’t mean adhd. Being anxious doesn’t mean general anxiety disorder. Being sad doesn’t mean depression.\n\nJust because one might have one of these traits, several other things needs to be there aswell. Being diagnosed with general anxiety disorder one need to have symptoms of anxiousness, but there needs to be more, often that they happen with some frequency; that your response are out of proportion; and that they inhibits you in your everyday life, such as school, work, relationships.\n\nIt’s one symptom of a rare mental illness, with no other symptoms present. If she had started to steal stuff from a shop, it’s more likely that she’s just wanting some free stuff and that she’s not suffering from kleptomania.\n\nNot everything that’s odd, out of place, or against social norms are mental illnesses. The clue lies in the word illness. You’re not mentally ill unless it’s effecting something or someone. One can be sad, anxious or hyperactive without having major depressive disorder, general anxiety disorder or adhd. But when being sad, anxious or hyperactive is so bad that it impairs you in some way it becomes an illness.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Just because someone does something that “shows symptoms” of a major psychological disorder doesn’t mean they have it. It needs to be diagnosed, studied and connected through other parameters of the illness, ex. Childhood trauma, traumatic events, previous behavior, childhood behavior and patterns etc etc etc. It’s not just “you do X so you can be diagnosed with Y” and I think that’s lost on so many young people who believe this shit. \nIt’s not wrong to assume faking as a possibility, because blindly believing everybody in fear of hurting their feelings is even more dangerous. People need to realize that humans as a species are naturally selfish and attention seeking, we are more likely to cut corners and lie for attention in order to gain something we want. It’s not wrong to assume and KNOW that this type of behavior attracts narcissistic people, and we are not obligated to tolerate them just because they claim to have this “disorder”.",
                      "id": 94,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 0,
                      "content": "No \nNo it is not",
                      "id": 95,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "It's not Munchausen's. It's teenagers getting attention, as they have done for thousands of years.\n\nMunchausen's is much, much more extreme. It doesn't mean making up and playacting fake personalities. \n\nPretending to have DID is grossly disrespectful and also confuses people on what DID even is. It's so inappropriate. I have a friend who genuinely has DID and it comes out of severe trauma. It hurts so badly. It's confusing and scary and disorienting. It's not a game, it's not cool, and it is disgusting that kids think they can exploit it for attention.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Yes, it is a legit condition, and OP speaking up to the friends mom about what's going on will be the first step towards getting that diagnosis, of it's warranted. So even if it's not about mocking a disorder, and instead the friend is genuinely sick, OP is still NTA cuz it takes people speaking up like this too finally get help to the mentally ill in many cases",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Simply faking for attention isn't Munchausen's, that takes a long time to diagnose due to the inherent dishonesty, one can do similar acts and be simply malingering, especially as here where there is obvious gain (tiktok popularity), those cases are malingering, not a mental disorder. Not saying she doesn't have it, but you're making a bold claim of a rare and incredibly difficult to diagnose disorder based on a single secondhand account",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I mean, I agree she needs professional help and should get evaluated for a bunch issues, but you can't armchair diagnose Münchhausen like that on a second-hand story about a 16 year old falling for a trend.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -6,
              "content": "[deleted]",
              "id": 100,
              "comments": [
                {
                  "score": 17,
                  "content": "It's not fucking Munchausen's.",
                  "id": 101,
                  "comments": [
                    {
                      "score": -2,
                      "content": "[deleted]",
                      "id": 102,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": -15,
                  "content": "Yeah I mean I'm definitely not a psychologist and obviously you can't diagnose strangers over the internet, but what that kid is doing fits any definition/explanation of Munchausen's you can find online like *spot on.*\n\nFrom the NHS:\n\n>Munchausen's syndrome is a psychological disorder where someone pretends to be ill or deliberately produces symptoms of illness in themselves. Their main intention is to assume the \"sick role\" so that people care for them and they are the centre of attention.\n\nThat's what the kid is doing almost by definition. It's not at all unreasonable to think there's a very strong possibility this kid has Munchausen's.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Munchausen's is usually about physical illness - not about faking psychiatric illness. It may be a factitious disorder, but it also may not meet that criteria yet.\n\nI mean, we don't diagnose every kid that pretends to be sick to stay home from school with Munchausen's.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 436,
      "content": "NTA - I really don’t understand why someone would want to pretend that they have such an awful illness. It’s just super weird and a bit munchausen-y (I get it’s a trend but WHAT A WEIRD TREND!)\n\nI can also imagine that it is a pain in the ass for people who actually have DID.\n\nBut no, her mum asked you a question. You answered honestly.",
      "id": 105,
      "comments": [
        {
          "score": 99,
          "content": "Yeah I think \"people taking illnesses\" should be right up there with \"people who ate tide pods as in literal soap\"",
          "id": 106,
          "comments": [
            {
              "score": 3,
              "content": "Unfortunately they're unharmed by their action. \n\nOr they was?",
              "id": 107,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": ">why someone would want to pretend that they have such an awful illness\n\nAll the attention and pity, none of the actual downsides.",
          "id": 108,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "Because everyone wants to feel special on social media",
          "id": 109,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "This has been going on for years and is one of the more consistently dangerously pervasive aspects of the internet.\n\nYou take a bunch of hormonal, insecure and maturing teens who are all desperately trying to find their \"place\" in life and trying to stand out from the crowd. Then they find some niche/obscure disorder or syndrome and it reads like they have some of the symptoms (anxiety or whatever).\n\nIt used to be that if they suspected they had something you would speak to a Psychiatrist first and have it confirmed. NOW though they find a community only and when they say \"I think I might have/be X\" the community instantly reinforces it saying \"oh my god, you definitely have X, that's wonderful, don't let anyone put you down for it\" (because naturally these communities ARE welcoming and inclusive, because that's what they're for). \n\nBecause of the super positive attitude of the community and the constant reinforcement that \"their experience is more important than anything else\" these teenagers basically successfully convince themselves they have whatever disorder, and **in doing so** actually start displaying the symptoms and stuff (because of some kind of placebo-like effect). It's a positive feedback loop.\n\nI swear I read a psychiatry paper about this exact phenomenon at some point, but for the life of me I cannot find it now.",
          "id": 110,
          "comments": [
            {
              "score": 2,
              "content": "It’s been happening for awhile. When Sybil was published a ton of housewives started diagnosing themselves with Split personality, as it was known then.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I wish OP had more of an issue with her friend doing this in the first place. This kid needs exposed before she carries this behavior into her adult life.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I think the people who fake it are bored and desperate for attention so they make something up they saw on Tiktok/tumbler/Instagram. It's been romanticized in movies or weird circles they have found themselves in. They also may have some other underlying issue that isn't being addressed exacerbating such odd behavior. There are too many of those people on r/fakedisordercringe",
          "id": 113,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 400,
      "content": "NTA.\n\nDID on tiktok is becoming an incredibly popular thing and it makes me sick. Not only is it an extremely rare disorder, it's one that stems from EXTREME trauma. It seems like a lot of younger people on tiktok think it's a cool thing to use to essentially LARP as their favorite characters. Not saying your friend did this, of course, just that it's very common. Back when I was in middle school, my best friend suddenly 'developed' DID in order to escape consequences (eg: he would kick you in the shin and when you got mad at him, he'd go 'oh that was my other personality, Bloodlust \\[yes really\\], so you can't be mad at me').\n\nYou did the right thing. Were she to actually have it, her mother should definitely know. And I think it's best that she be banned from using tiktok for now, anyway. Not to sound like a boomer at 19, but tiktok is genuinely pretty fucking bad for young and impressionable people.\n\n**edit: just wanted to talk a little more on this since it's getting attention, you don't have to read. having just finished it, its actually very long. sorry for writing a whole essay. im passionate abt this stuff**\n\nI do know people who actually have diagnosed DID. And I know a LOT more people that fake it. Calling out someone who is faking is very tough, because it is often very hard to tell and you would not want to fakeclaim someone who does actually have it. But I moderate a discord server for a game with 11,000 people, most of whom are about 13-16, most of whom are introverted and neurodivergent. A few of them are genuine systems. But we've had a disturbing amount of people faking it.\n\nI suppose I can't blame them all too much. They're kids. With TikTok making DID seem like a fun quirky mental illness, they're being very quick to jump on the trend. Way too many kids view TikTok as the end all know all for a bunch of important information. And it can be a legitimate source of information, but everything needs to be taken with a grain of salt, and it is extremely easy to end up in echo chambers.\n\nDID isn't evil like media makes it seem. And it's not a horrible, life crippling illness to have, if you seek the proper help you need and learn how to live with it. But it is not anything someone should want to have. I can not say that I know anyone with genuine diagnosed DID that is happy about having it. *There may be people like this*, I am just saying I do not know any. It is something that develops from an incredibly traumatic experience in order to help the victim cope, creating multiple personalities so that it feels like the trauma they are going through is not happening to them, but someone else. It's escapism in it's highest form.\n\nTikTok DID people (the non genuine ones, of course) are doing actual, very real damage to the image of people who are diagnosed with it. By twisting the idea of what DID is, and what it's like, it gives a lot of people false premonitions. And this will go on to affect how people treat the ones who genuinely have DID.\n\nPeople with DID are not cursed because of their illness, nor are they blessed. They are just people who function differently than the average person.\n\nThere is a way that these things happen. Not just with DID, but with anyone that isn't 'normal' by society's standards (excluding the obviously fucked up people, like pedos and other disgusting shit). They are outcasted, told to find their own space, because they don't belong. So, they create their own space to connect with each other. They talk about shared experiences and crack jokes to each other. And then the outsiders see this and feel that they are being left out of a fun, close knit community. And they want in. And that's how these situations are created.\n\nTikTok can be a fun way to interact with people like you. You can find communities of people like yourself, and it can make you feel less alone in the world. And you will also see other communities that seem like fun. But not all of them are for you. And everyone has to remember this.  (this is an example and is not directed at OP)\n\nTLDR: Those who fake DID in an attempt at belonging in a community that is not meant for them do very real damage to those who genuinely have DID, and warp the expectations that people have for systems. And I'm sure your friend isn't a bad person, OP. Just young, like you, and too impressionable for her own good. Getting her off TikTok is removing her from an echo chamber. And it is good that you stopped it now instead of letting it continue further.\n\nsorry for going off on a massive tangent. my meds kicked in lmao",
      "id": 114,
      "comments": [
        {
          "score": 113,
          "content": "[deleted]",
          "id": 115,
          "comments": [
            {
              "score": 54,
              "content": "Oh, I agree with you; that's not what I meant when I said that, though! I meant that if she did actually have DID, then it would be best for her mother to be aware of it, not that her mother would be able to tell if she did.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I've seen videos and articles online where some people know of their other personalities with DID. The most prominent one I've seen is a lady by the name of Kim Noble, who is an artist where her various other parts all use art to deal with their collective trauma. Here is a link to a Vice video where she explains what its like:\n[https://youtu.be/u8Oh1L1aN8M](https://youtu.be/u8Oh1L1aN8M)\n(and yes, doing a quick Google search shows she has been formally diagnosed) \nMaybe most people don't know of their other parts existing, but there are cases of people who know.",
              "id": 117,
              "comments": [
                {
                  "score": 9,
                  "content": "Yes. The way I understand it you’re protected from the knowledge until it’s safe to know. So it often comes out when things are getting stable and safe enough for it to do so.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 5,
                      "content": "IIRC, the treatment for DID involves knowing the alters are there and working with them, if that makes sense? Relative was a psychiatrist, and they said that while the treatment used to be integration, now it's working with the alters until they're intrapsychic voices (literally voices in your head, but not hallucinatory) that help you out when you need it.\n\nI think the example they used (super simple because I was young at the time) was that instead of an alter taking over to write a check, the alter talks the primary through the process of writing a check.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Multiplicity and Me is another great YouTube channel.",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 55,
          "content": "I have run into in the past - pre-TikTok - people who have self-diagnosed themselves as having DID who pretty much TRY to get other people to follow their example.\n\nIt really is LARPing/roleplaying extreme trauma and feeding into one another's fantasies in an incredibly unhealthy way. The times I've run into it, it usually included a lot of extreme kinks and a cult-like approach to it all.\n\nIt's this weird form of escapism and yes, escape from if not all consequences (that varied in what I observed) then at least responsibility. 'It's not my fault I ran away from discussing serious subject y, my trauma/personality can't handle it!' Etc.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Lmao you should’ve thrown hands and said “sorry I was hitting Bloodlust not you John”",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I have minor DID. I find the trend rlly offensive bc ppl are starting to think ppl have huge systems. I just have myself and my guardian and he doesn’t come out much anymore bc of me seeking therapy which he is happy for me. He will always be part of me but he’s not a part I need to rely on anymore. (I was actually diagnosed by a therapist in 2014…)\n\nThis girl needs therapy, not TikTok.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": ">It seems like a lot of younger people on tiktok think it's a cool thing to use to essentially LARP as their favorite character\n\nAnd to shirk responsibility for their actions, \"oh it wasn't me who said/did that it was someone else in my system\"",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Thank you! I was looking for this comment!",
          "id": 125,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 182,
      "content": "NTA by a landslide. One of my good friends has been *clinically diagnosed with DID by two separate psychiatrists*. It took almost ten years for the diagnosis to be finalized, which is pretty common for DID diagnoses. Their life is severely impacted by their DID, primarily due to their amnesia. They can't hold down a job, have a hard time taking care of themselves. They've woken up not knowing where the fuck they are or how they go there because they had a switch and didn't realize it. They once woke up to half their living room gone with no idea how it happened. They still don't fully know what happened but one of their psychologists thinks one of their alters may have gotten rid of their possessions and when they switched they had no memory of doing so or who they gave the possessions to. DID is no joke nor is it some cute uWu I'm baby smol bean TikTok trend, it is a debilitating and life threatening mental health disorder.\n\n\nDue to the recent influx in DID fakers, my friend has faced unprecedented harassment from people claiming they are faking. They have been told to kill themselves for \"faking\" despite providing direct evidence of their diagnosis which led to a suicide attempt due to the harassment. Faking DID and mental illnesses in general is beyond harmful to people with those disorders and beyond cringe. You are so NTA. Your friend needs a major wake up call. She should feel lucky she didn't have such severe childhood trauma that in order to survive her brain had to split itself.",
      "id": 126,
      "comments": [
        {
          "score": 64,
          "content": "I am essentially like your friend. And I cant agree more. I was raped, beaten, starved, waterboarded, my bones broken as punishments, and thrown into rooms with corpses of my pets cause I 'misbehaved' before I was finally rescued at age 13. I have DID due to this. I got formally diagnosed after about 6 years and have been to therapy for years. I have horrible scarring and deformed hands and feet from the abuse I received alongside medical issues they caused internally that cause me to have seizures and other physical issues.\n\n>They can't hold down a job, have a hard time taking care of themselves. They've woken up not knowing where the fuck they are or how they go there because they had a switch and didn't realize it. They once woke up to half their living room gone with no idea how it happened.\n\nAll of this is my reality. This all makes my life a freaking nightmare. I've learned alongside my alters to constantly write notes. ANYTHING I need to remember be it for a job or socially I write on my phone and I keep a journal for each of us. I have to constantly have alarms with reminders so I can take meds or go to appointments and even then I never am always perfect. Ill forget something or not know where I am when I need to be at work soon. I'll give myself panic attacks cause I wake up in places I dont know. I have people come up to me knowing me but me having no clue who they are or where I met them. I struggle to keep family and friends close due to my issues and I hate it. I hate myself and my own mind and body I sometimes have no control over yet have to pick up the peices anyways due to a traumatic past I had no control over either. \n\nI just want to be normal and its enraging this girl wants to be like me when I would give my very soul to the devil himself just to be normal like her. I hate people like this. \n\nMy disorder isn't a freaking quirk. Its not fun. Its not something people can just pretend to have to be quirky for freaking veiws. Its miserable and makes my life a nightmare and she is disgusting  for pretending to have the same issue and getting support for it.",
          "id": 127,
          "comments": [
            {
              "score": 24,
              "content": "This completely. There's been times I've ended up downtown at 3am not knowing how I got there. The bus is done running for the night, cash is missing from my wallet, my clothes are ripped and my throat is sore. It's the not knowing what happened part that fucks with you the most.  It's gotten better now as I've reached a point of functional multiplicity and working towards fusion, but I still get terrified every time I go to sleep or start start dissociate that I'll wake up with no idea where I am. \n\nI get so infuriated when I see people faking it, especially  after I've shared some of my life experiences with them and a few months later it's \"omg I think I have it too!!! My parents would yell at me and didn't let me date until I was like 16 how abusive!!!!\" Like no fuck off, I didn't go through hell having my dad rape me before I was in double digits to have you compare your dad not allowing you date being abuse.  And they go \"well it can't be that bad of a disorder, you manage life well. You're married, take care of your dog, and you work!\" As if I didn't spend years having to have a full time caretaker because I was so suicidal and had alters who would fuck off to who knows where and worked my ass off to get everyone in the system on somewhat of the same page of living life.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "This is heartbreaking and exactly the problem with that persons friend faking it for attention and followers. \nI’m so sorry for your friend",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "I have a friend who is a grown-ass adult and fakes having DID, and has for over a decade. I don't know how to gently tell them \"this isn't a different personality or alter, you're just feeling grumpy right now\"\n\nIt's frustrating because every conversation turns back to their supposed diagnosis and it's lost them a lot of friends and job opportunities because it's very obviously fake. Even after a few 'wake up calls' they continue to pretend and it's like... fuck man, it's so exhausting. I can't imagine wanting to intentionally live like that, folks like your friend have it so hard and it's not an enviable thing to put up with.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I know it's hard and I suppose it's not my place to tell them how to deal with this issue. But I hope they realize that trying to appease the people calling them a faker is a fool's endeavor. Best bet is to just block them and leave it at that. \n\nI cannot imagine what your friend has been through/is going through and I won't pretend to.",
          "id": 131,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 169,
      "content": "NTA. Faking a mental illness is disgusting  and helps further stigma against the mentally ill. Your friend needs help and you got it for her. Well done.",
      "id": 132,
      "comments": [
        {
          "score": 2,
          "content": "Yeah faking a mental illness for \"likes\" is so horrible; smacks of that South Park episode where Cartman pretends to have \"ass-burgers\" so he doesn't get in trouble for being an even worse AH than usual...\n\nOP is NTA & hopefully the friend's mom can get her into therapy to help her stop the sociopathic behavior.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 103,
      "content": "[deleted]",
      "id": 134,
      "comments": [
        {
          "score": 25,
          "content": "Exactly, mental disorders are no joke and acting like you have them for sympathy is absolutely not ok",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "It’s so, so bad that myself and the other admins of a group chat (group chat for an author) that I’m a part of made a *formal announcement* about it (the group chat is full of young-ish teens; the admins range from 18-29). \n\nI’m 99% sure that the kids in our group chat brushed it off (as we have had, in the 18 months the GC has been around, 3! people claim to have DID), but the important thing is that we made the announcement. \n\nDID is definitely the main one that I’ve seen, but also Tourette’s is another one. People claim they “have” it, but really just want an excuse to scream profanity for no reason. It drives me nuts! \n\nNTA OP",
          "id": 136,
          "comments": [
            {
              "score": 3,
              "content": "I’m in a chat with around 50 people, and 3 or 4 of them claim to have DID too. They update their name and pronouns meticulously to match their current ‘alter’ so god help you if you don’t check before talking to them. Why the heck is this so prevalent?! There’s no way so many people in every internet community actually has an extremely rare disorder.",
              "id": 137,
              "comments": [
                {
                  "score": 2,
                  "content": "The thing is, is I *know* one of them is lying. Their “alters”? Popular YouTube Minecrafters (Dream, whoever else, idk them as I don’t watch those YouTubers). \n\nThat’s not how alters would work. They don’t just *appear* like that. \n\nAnother way I know they’re lying is that the alters are aware of each other. While it *could* be possible, alters are generally not aware of each other. Amnesia is a huge aspect of diagnosing DID. Unfortunately, I can’t call them out (as I don’t want to embarrass them). I just hope that when they all get older, they’ll look back at this phase and cringe. \n\n\nI think DID is a *fascinating* disorder, and I would love to utilize it in a story, but I would never pretend to have it. Honestly, it sounds exhausting trying to remember everything.\n\nI think that the people who fake it forget the implications of it. DID is caused by *severe* trauma when you are a young child. If I remember correctly, I think it has to be severe trauma before the age of 5 (I could be wrong on that though; don’t quote me on it lol) I don’t know. It just rubs me the wrong way. \n\nEdit: typo",
                  "id": 138,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 86,
      "content": "Each and everyone that fakes a disorder needs to be called out in one way or another. You are NTA for your AH friend that fakes something that other people really suffer from. The only one ruining your friends life is herself by doing this shit.",
      "id": 139,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 53,
      "content": "NTA. She's suffering the consequences of her actions and trying to reflect the responsibility onto you. She \"ruined her own life\" by faking an illness and posting about it publicly online.\n\nScreenshot the cyberbullies' messages and report it to your school.",
      "id": 140,
      "comments": [],
      "relation": "Support"
    }
  ]
}