{
  "post content": "So im not any good at this but I want to know. So back in December I was finacially struggling as my job was giving me little to no hours. At that time I was dating a female and I decided to go and look at potential gifts for her and my friend tagged along. We get sucked into the perfume section of store and start looking at perfume. I told my friend that he didnt have to buy it and I could get her something else that was within my budget, but he insisted on buying it. Even after he bought it I told him if he wanted to return it id be perfectly okay with that. Me and the girl broke up and he has lost his job, since then he has been pestering me about paying him back even though, there have been countless times I have bought things for him and havent asked him for a cent back. I just want to know whether im being an asshole/too nice if i refuse to pay him $200 when he has cost me atleast a solid $10000 by buying him Vinyls, paying for Ubers to get us from A to B, etc etc. I try to be good friend and help when they are in need but idk.",
  "id": 1,
  "comments": [
    {
      "score": 3,
      "content": "ESH\n\nHe seems to have pushed you into accepting it, but you could’ve held your ground since it’s reasonable to ask for you to pay back which would be hard for you. He’s an asshole for not considering you paid alot for him in the past. \n\nAlso, “female”?",
      "id": 2,
      "comments": [
        {
          "score": -2,
          "content": "Not Female",
          "id": 3,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NAH, but quit buying stuff for people and letting people buy you stuff. You won't run into these problems.",
      "id": 4,
      "comments": [
        {
          "score": 1,
          "content": "Yea, youre right ig.",
          "id": 5,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "ESH. If you weren’t willing to pay $200 for a bottle of perfume, you should have refused the offer.",
      "id": 6,
      "comments": [
        {
          "score": 0,
          "content": "I did",
          "id": 7,
          "comments": [
            {
              "score": 3,
              "content": "Did you put your name on the gift or the friends? If you put yours you accepted it and did not refuse it.",
              "id": 8,
              "comments": [
                {
                  "score": 1,
                  "content": "i didnt put any name on it.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Did you tell the ex it was from friend?",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "[deleted]",
      "id": 11,
      "comments": [
        {
          "score": 2,
          "content": "Wait. I’m old, female is now offensive? Why? Is male offensive?",
          "id": 12,
          "comments": [
            {
              "score": 1,
              "content": "One of the reasons I've heard, and not sure if true, is because \"female\" isn't a standalone word, it relies upon \"male\" being a root word, and doesn't let women stand out on their own, or something.  IDK, I'm a woman too, and I don't get it.  It's also why you hear the word \"women\" being used as an adjective more now.  For me, I've always known it as a noun, so hearing \"women scientists,\" and \"women athletes\" etc is jarring.",
              "id": 13,
              "comments": [
                {
                  "score": 1,
                  "content": "That would make woman offensive as well, as it derived from the word man.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I’ve just read a few things about it. I don’t see much difference in female (male) woman (man). The thing that made the most sense was woman, just like man, refers to human being only, whereas female and male can refer to animals. Still don’t personally see the word as offensive. It depends on how it’s actually used. People can still be offensive but use the word woman.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "[deleted]",
              "id": 16,
              "comments": [
                {
                  "score": 1,
                  "content": "I’m female as well. I was just wondering why it was offensive. News to me, lol.",
                  "id": 17,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "female is offensive..???",
          "id": 18,
          "comments": [
            {
              "score": 1,
              "content": "[deleted]",
              "id": 19,
              "comments": [
                {
                  "score": 2,
                  "content": "thats literally the dumbest thing to ever find offensive. theres other words for her i couldve used, female is me being REALLY nice.",
                  "id": 20,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited.***\n\nSo im not any good at this but I want to know. So back in December I was finacially struggling as my job was giving me little to no hours. At that time I was dating a female and I decided to go and look at potential gifts for her and my friend tagged along. We get sucked into the perfume section of store and start looking at perfume. I told my friend that he didnt have to and I could get her something else that was within my budget, but he insisted on buying it. Even after he bought it i told him if he wanted to return it id be perfectly okay with that. Me and the girl broke up and he has lost his job, since then he has been pestering me about paying him back even though, there have been countless times I have bought things for him and havent asked him for a cent back. I just want to know whether im being an asshole/too nice if i refuse to pay him $200 when he has cost me atleast a solid $10000 by buying him Vinyls, paying for Ubers to get us from A to B, etc etc.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 21,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 22,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Info\nAt that time did he lend you the money or give it to you?",
      "id": 23,
      "comments": [
        {
          "score": 1,
          "content": "around December of this year.",
          "id": 24,
          "comments": [
            {
              "score": 1,
              "content": "Oh i read that wrong, he offered to pay for it.",
              "id": 25,
              "comments": [
                {
                  "score": 1,
                  "content": "Then NTA because it was a gift",
                  "id": 26,
                  "comments": [
                    {
                      "score": 1,
                      "content": "It was a gift for the other guys girlfriend....pay him back",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "This is some petty shit first off, but, I have to know How tf does perfume cost $200? I wear Ralph Lauren and the most I pay is in the 90 range.",
      "id": 28,
      "comments": [
        {
          "score": 1,
          "content": "Idefk, it was christmas ig",
          "id": 29,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "If he’s really a friend and he’s truly in a bad spot AND you are able to float him something.... I’d float it. Maybe not 200 but some grocery money ya know. Is his friendship worth 200? Is 200 worth shutting him up? Only you know that. If it hasn’t been brought up till now,I’d say he’s truly hurtin and doesn’t know how to ask for help. But you can’t end up with resentment over it. I’d seriously say nta but maybe ole dude needs help",
      "id": 30,
      "comments": [
        {
          "score": 1,
          "content": "I guess",
          "id": 31,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 0,
      "content": "Ofcourse your NTA , when you gift a present, you can never \"return\" it.",
      "id": 32,
      "comments": [],
      "relation": "Support"
    }
  ]
}