{
  "post content": "\n\nI (m28) have been with my fiancee (f30) for a year an a half. I have a stepson (4) that I adore and treat as my own.\n\n\nMy older brother's wedding is soon. I was intending on going but after I found out that my stepson was not invited, we started having issues. My brother explained that it's the nature of the wedding they chose which is child free but my fiancee was upset that this rule was forced on family as well. She got into arguments with my brother and his fiancee and ended up deciding to not go to the wedding. As a result I called my brother and told I no longer want to come after what happened. He began arguing saying my fiancee is the one being unreasonable and now has \"convinced\" me to miss his wedding. I told him that this is just me supporting my family after the way he and his fiancee treated them. His fiancee said they don't owe us anything and that this is a wedding rule that applied to everyone. I said \"fine then I'm not coming\". My brother is pissed my parents are calling me unreasonable for being willing to miss my only sibling's wedding and basically let a woman I've only known for a year an half drive a wedge between us. They said if I go through with this then I might lose my brother, who's my support and comfort forever, and so much damage and hurt will come out of this.\n\n\nI stopped responding to them but members of extended family are saying that me and my fiancee are creating the problem trying to control my brother's wedding.",
  "id": 1,
  "comments": [
    {
      "score": 28449,
      "content": "Yta. Welp I'm sure your brother was going to find out how little you care about him sooner or later. I hope he remembers and acts accordingly.",
      "id": 2,
      "comments": [
        {
          "score": 17215,
          "content": "YTA. Your stepson wasn’t targeted - it’s a CHILD FREE wedding (which is becoming more & more the norm given how some people allow their children to act).\n\nThere is NO logic to getting irritated that family children are not excluded from the rule. Since the majority of wedding guests ARE family, what is the point of making a wedding child-free, but then excluding almost all guests from the rule? That would make NO sense. NONE.\n\nThis had NOTHING to do with your stepson - but you & your fiancé tried to make it personal. Since I cannot believe you found your fiancé’s gaslighting (trying to pretend children of family should all be entitled to attend regardless of the rules) to be an actual legitimate argument, I can only assume that you chose to back up her ridiculous position to prove your loyalty to her & the boy (rather than actually believing she had any real leg to stand on).\n\nI’m glad your brother is finding out how quick you are willing to shank him to validate your position in your own relationship. YTA. Huge.  \n\nEditted for\nTypos",
          "id": 3,
          "comments": [
            {
              "score": 4259,
              "content": "Its not even his stepson. Its his fiance's child. I like how she says she thought there would be an exception for family - you're not family yet!\n\nEverything about OP and their SO's attitude is wrong.",
              "id": 4,
              "comments": [
                {
                  "score": 1455,
                  "content": "Agreed.  I elevated the child’s status to actual family to illustrate that it would STILL be just as stupid & just as wrong to believe the child should be entitled to an exception to the rules.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 377,
                      "content": "If he brings a child that is not family yet, what’s going to happen if they break up? They tell the kid that all of the people there are family and OP becomes like a father figure would be devastating if they break up. It’s not fair at all to the kid. It sounds like no other kids will be there so the child would be bored to death. Even if he’s the most well behaved child in the world, children are more likely to be disruptive if they are bored.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Right?\n\nOnly time I can see someone assuming the child thing doesn’t apply to a specific child is if the bride, groom or both are the child’s parents.\n\nThis is literally the only exception.\n\nYTA.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 948,
                  "content": "> Its not even his stepson. Its his fiance's child.\n\nThat's not the cross to die on here. His Fiance would be rightly pissed and justified in boycotting the wedding if every other young child in the extended family were invited except her son.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 738,
                      "content": "In isolation you would be right. But it demonstrates an extra layer of entitlement from his fiance. She thinks her child should be the exception to the rule because he's family. Other kids can stay away, but not hers, because she's decided that everyone should see her son the way she does. She thinks her fiancé's family should see her child as a part of their family, even though the child isn't.\n\nShe's one of those parents who thinks that because her life revolves around her kid, then everyone else's should, too.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 360,
                      "content": "> That’s not the right cross to die on here.\n\nThat’s also not the right idiom.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "Dude NO kids were allowed to go, family included.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 603,
                  "content": "Reading the OP’s question I was confused because I just knew this was going to end with his fiancée being excluded because she’s not official family. But it didn’t. It’s a child free wedding. I find that peculiar, but I find the strident fighting to include a small child at a child free event *very peculiar*. \n\nThe truth is that your fiancée tried to dictate the terms of your brother’s wedding and was rebuffed. Then she escalated it to a level that would make it hard for the bride and groom to want her at their nuptials at all, so you decide to jump in as a show of loyalty to a person who wanted to dictate the guest list of their wedding. \n\nCome on bruh. YTA, your parents and extended family are correct. You’d better get a handle on yourself and your fiancée’s expectations and interactions with the outside world because you still have to live in it.\n\nEdited for grammar.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 159,
                      "content": "I don’t see this brother and his fiancee ever making it to, “Wedded Bliss”.\nShe is a drama Queen. Everything has to be about her. \nIt’s not HER wedding, doesn’t matter, she will definitely make sure she makes her position front & center!\n\nBrother…Run! Run fast, run far! Run before you make the biggest mistake of your life, and alienate yourself from your family. \n\nTake the blinders off and look clearly & honestly at ONLY the fiancée and not her adorable 4 year old son that you already love.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 213,
                  "content": "true but also not the real point. even if he was OP's son, nothing would change",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 78,
                  "content": "Wrong & entitled.\nI like to see someone tell her what to do at her wedding",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Honestly, even if it were OP’s child, it’s still valid if the brother still wanted a child free wedding.\n\nThe kid is 4. It’s not a huge deal.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "I disagree with the first part. I'm probably never going to marry my boyfriend (just not something we're into), but he's my son's stepdad in every way but legally. He wouldn't be any more so if we had a piece of paper to say he was.\n\nHowever, OP, YTA. He can invite who he wants, yes. You can choose not to go, yes. But missing your own brother's wedding because they don't want kids there? That's something you'll never be able to take back.",
                  "id": 17,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1297,
              "content": "I honestly read this expecting it to be one of those “my fiancés child was not invited cause he’s not my bio child” but no, it’s a CHILD FREE wedding!!! The entitlement and quite frankly, stupidity, on the OP’s part is actual insanity.  And that the fiancé could gaslight you to believing it was some big personal attack?!\n\nI cannot with these people.  I’ve never facepalmed harder.  YTA obviously.  Wow.",
              "id": 18,
              "comments": [
                {
                  "score": 81,
                  "content": "Same. My husband has raised my boys since they were little and his brother has always had a thing about how lucky I am to have found a man that wants to help raise kids. When he got married they had a ton of kids, and they had flower girls etc. We were gonna go and everything but then we were all talking and he told us they weren’t having ring bearers which I assumed his wife maybe had someone from her family as. Well his response was “we don’t have any little boys in our family to be so we left it.” My kids were 11 and 8 at the time and we had been married for 4 years at that point. I didn’t fight or anything but the boys and I just didn’t go. It was never a question if he should go though I’m not gonna be that chick.\nSo when I was starting this post I was ready to side with the OP but quickly realized wtf. It’s a child free wedding.\n\nEdit to clarify that when I say it wasn’t a question if my husband went meaning I was never going to ask my husband to miss his brothers wedding. So he did still go",
                  "id": 19,
                  "comments": [
                    {
                      "score": 65,
                      "content": "TBH, 11 is a little old for a ring bearer and it’d be messed up to exclude the older one. It might not have been personal.",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 523,
              "content": "I went to a friend's wedding, and the amount of children running around and screaming damn near gave me a migraine. That sealed the deal that I want a childfree wedding. I want kids of my own, and I don't mind playing with my younger cousins, but *by God* I don't want them running, screaming and creating chaos on my wedding day. That's streasful enough as is.\n\nOP, YTA.",
              "id": 21,
              "comments": [
                {
                  "score": 346,
                  "content": "Some people act like weddings are the equivalent to family reunions.  They’re not.  If you want a family reunion, host one.  If not, abide by the event organizers’ (hosts’) rules & go, or exclude yourself from the event.  Don’t try to argue that the rules shouldn’t apply to you for some reason.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Ugh, that is absolutely miserable. That's awful that your friend's wedding couldn't be about their marriage. You probably weren't the only one sick of that shit already.\nAnd you know why a lot of people opt for child free weddings? Because they *know* which family/friends will let their kids run wild.\n\nThe RSVP card for my friend's wedding included the statement: \"The reception is adults only. Childcare will not be provided\".\n\nHer ceremony was beautiful up until the reception. She ended up being guilted by extended family and had to include the children of her cousins. These kids were between 4 and 7 and nearly took out servers with trays of meals. What were the parents doing? Getting trashed.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 23,
                      "content": ">Her ceremony was beautiful up until the reception. She ended up being guilted by extended family and had to include the children of her cousins. These kids were between 4 and 7 and nearly took out servers with trays of meals. What were the parents doing? Getting trashed.\n\nAnd this is what people don't understand about \"child free\" events. They aren't *child friendly*. Those kids were probably bored out of their minds. As a kid who loved reading, I was able to survive plenty of adult-centric events by my parents putting a book in my hand but I remember them getting pushback because \"Elaan21 is being rude and not socializing.\" But those same adults didn't want to talk about things I found interesting or could relate to, so I guess they wanted me to sit there silently and stare at them?",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Yeah, not even weddings but I host live trivia shows and the biggest anxiety inducer for me is kids who's parents just let them run right up onto the stage up to my speaker on its admittedly old and crappy tripod. \n\nSome nights it feels like a mosh pit of mini humans, rushing the wiring and equipment in waves 😭",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "The reason there are so many child free weddings these days, is because of OPs fiancée who believe rules don’t apply to her….And the Gazillion other parents just like her.\n\nYou see them everyday, especially at schools, where they flourish like fungus.\nOr in your local Whole Foods store, Target, Starbucks…Name a place and they will be there. You can hear them, from the loud shrieks from their child having a meltdown, because he cannot have another child’s toy. Even though Mom tries to negotiate a fair price from the stranger for her toddlers “lovey”.\n\nA ME generation raising a generation of entitled children who have never heard the word, NO.\n\nJust venting. Reflecting on the fact that I was never traumatized by seeing red ink on a graded paper. By being told, No. For being swatted on my rear end for doing something I was not supposed to do. NO it was not abuse, it didn’t leave marks, what it did was got our attention. We learned there was a reason why we were told Not to do certain things.\nSnakes were in the tall grass outside of our yard. (country kid)\nDon’t go over to the sand dunes to play without asking Mom or Dad. \nWe didn’t know those tunnels we would dig could collapse on us.\n\nEnd of vent. You are now returned to your regular programming….",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "As my mom, who adores kids, put it when a friend of hers bitched about their kid having a CF wedding: \"Time and place for kids is NOT at a grown-up party like a wedding reception. Great idea, toddlers and 2nd graders around drunk-ass adults. Hire a damn sitter or stfu\"",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "As a wedding present to my SIL, I have been learning balloon twisting. Even little kids seem to have the patience to stand in line for an hour to get a balloon sword or dog. Hopefully I can keep most of the kids entertained during the reception.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I have seen some children act like little animals, and I have seen other kids (little kids), sitting quietly in a nice restaurant while their parents, and the rest of us, enjoyed a quiet dinner. Some people don't raise their kids right and that's the bottom line.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Also parents deserve a night off! idk why people throw a fit, like you are your own person outside of being parents - enjoy the night!",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Same. I love kids, I even have one. The only people that don't mind having running, screaming kids at a nice wedding are the parents that should be watching them.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "And most people book a wedding that has a guest limit and you pay per seat. It’s your decision to make how you want your wedding budget spent too. You have every right to decide that you can only afford 100 seats at $100 per person and that you’d rather have aunt Mildred and the cousins be able to come vs a bunch of kids. You pay the same, you decide. \n\nHave a family reunion if you want all the kids there.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 373,
              "content": "But but... OP is SPECIAL and should be EXCLUDED from having to follow RULES that everyone else does because of DNA. Don't we understand that? \n\nOP, give yourself a gold star sticker for making things all  about you, get a sitter like a normal person and go to your brother's wedding. Sit there, smile, and stfu unless spoken to. Stop letting your fiance's narcissism rub off on you. It's not about your fiance either. No kids means NO kids.",
              "id": 33,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 276,
              "content": "They're probably the type to let their children run loose like little monsters, making child free weddings necessary in the first place",
              "id": 34,
              "comments": [
                {
                  "score": 26,
                  "content": "Who even wants to take a four year old to a wedding? Four year olds get bored at weddings.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 11,
                      "content": "People who don't want to pay for a babysitter for one night lol",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 232,
              "content": "We had a child free wedding because of two kids. One of my friends and one of his cousins. Some people let their kids destroy formal events like it’s cute.",
              "id": 37,
              "comments": [
                {
                  "score": 150,
                  "content": "Yea it only takes 1-2, and you can’t just exclude Aunt Fern’s youngest or Cousin Darrell’s oldest - you have to just go child free & hire security to make sure AH family members don’t try to bring their kids anyway (because usually the Aunt Ferns & Cousin Darrells are the exact ones who think their little hell-spawn should be the exceptions).",
                  "id": 38,
                  "comments": [
                    {
                      "score": 9,
                      "content": "We didn’t have security and actually one of the two badly behaved children was STILL at my wedding!",
                      "id": 39,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Right, for every cute memory of a nephew or cousin looking adorable in their tuxedo or dress and dancing like Michael Jackson, there are (at least) two spawns of satan who get mad when the food isn't a Happy Meal or throw a loud tantrum from the moment they step foot on the ceremony site. I have a feeling that OP's fiancé's children are the ones to throw a tantrum due to their level of entitlement and how special she thinks her children are. OP YTA",
                  "id": 40,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "This reminds me of another aita post earlier this week. In that one the new wife was the OP and she wrote how she felt targeted by her new family because her husband's brother was having a child-free wedding but clearly this was an attack on her. Even though the other siblings of the groom weren't bringing kids either. To top it off she actually brought her kid to the wedding and was shocked they called security to tell her to leave. Mind you before all this she had wrote that the family was very welcoming and loving towards both her and her 4 year old son.\n\nI'm just surprised so many people find a way to make rules about themselves.\n\nYTA",
              "id": 41,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "This. She’s taking a generality and turning it personal. Main character behavior",
              "id": 42,
              "comments": [
                {
                  "score": 15,
                  "content": "Yea it’s probably best SHE doesn’t come - even if OP wises up & decides to go.  She’s the type who would wear white & feign innocence/ignorance when confronted about it.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I get the feeling this absolute Angel of a stepson would be allowed to ruin the wedding or reception.  You see how well mom takes “no” for an answer.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "[removed]",
              "id": 45,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 872,
          "content": "Honestly, it seems quite clear that OP's title is intentionally misleading, because it made it seem like his stepson (he's not even his stepson YET) was being excluded. \n\nIt's a child-free wedding, no children are going? So OP is just being an entitled asshole trying to demand people change their wedding just to cater to him. And his soon-to-be wife sounds insufferable as well. \n\nYTA OP, you're going to destroy your relationship with your brother if you don't drop the tantrum immediately.",
          "id": 46,
          "comments": [
            {
              "score": 79,
              "content": "Can you imagine how bored that poor kid would be as the only kid at a wedding?",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": ">Honestly, it seems quite clear that OP's title is intentionally misleading, because it made it seem like his stepson (he's not even his stepson YET) was being excluded.\n\nThis is the reply I was waiting to read.  The title got me upset cause I, too, thought OP's brother was excluding OP's GF's son but allowing others to bring their children.  Only to find out that **NO CHILDREN** are allowed at his brother's wedding.  Yeah, OP and his GF are AHs entitled people who are making the wedding all about themselves.",
              "id": 48,
              "comments": [
                {
                  "score": 25,
                  "content": "Yes, EXACTLY!\n\nOP is clearly just as manipulative as his fiancee if he feels the need to write such a blatantly misleading title. \n\nHe wrote such a long, detailed post intentionally trying to avoid just flat-out saying that him and his fiancee are throwing a fit because the bride and groom want a child-free wedding.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "OP expects his entitled GIRLFRIEND to be treated as a Queen.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I bet he never even ends up marrying this woman and then throws a fit if she or the kid is in any family function photo",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 200,
          "content": "Not me spending a full minute trying to figure out why the comment references Rhianna and which act they’re referring to. 😭\n\nBut other than that, 100% spot on assessment. Its a child free wedding for gods sake.",
          "id": 52,
          "comments": [
            {
              "score": 62,
              "content": "I have  no idea what word that's supposed to be my autocorrect is off and I was sitting next to my boss on reddit so I wasn't looking at my phone that intently",
              "id": 53,
              "comments": [
                {
                  "score": 21,
                  "content": "You mistyped \"this and\". No harm done: we know what you meant.",
                  "id": 54,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 26,
              "content": "I was wondering about the Rihanna thing too. I thought maybe she misbehaves at weddings lol",
              "id": 55,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "I decided it's because my Queen Rihanna does whatever she wants and people adjust plans to flow with her vision.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 164,
          "content": "Normally, I would say \"if you're going to make a rule that restricts the guestlist, you can't be mad if people decide not to come.\" If it had been too onerous for OP and his fiancee to get childcare to attend and they bowed out, it would be totally reasonable.\n\nInstead OP and his hair trigger fiancee invented a grievance and made a huge friggin production out of how his brother \"deliberately\" targeted \"his family,\" which is just mind boggling. What the hell dude? Have you always been thicker than a block of ice?\n\nYTA totally.",
          "id": 57,
          "comments": [
            {
              "score": 11,
              "content": "It is SO WILD how much this sounds like my wedding. My husband's brother basically went through the same thing as OP, and basically said the same things as OP plus a \"why don't you want MY SON to experience your wedding?? Is he not family???\" which I kind of feel like might be something happening here? ( Also my nephew was 2 at the time. )\n\nSo the whole \"his family\" being targeted makes sense to me? BUT.\n\nMy BIL's wife was VERY abusive and controlling, and I sort of wonder if that's what's happening? Idk. *Most* reasonable people would be like \"okay, we'll get a sitter!\" but BIL's wife was really not well and really abusive and telling her husband these things.\n\nObviously I know nothing about OP's relationship but it seriously sounds exactly like my BIL did.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 25,
          "content": "Lol reading the title I thought they specifically excluded the stepson, but the whole wedding is child free and it applies to everyone. \n\nOp and his fiancé are entitled. Op get a grip and don’t lose your brother over this petty crap.",
          "id": 59,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "Based on the headline I assumed it was gonna be one of those “he’s not your ~real~ son” situations, but no. It’s a fucking CHILD FREE wedding. That’s not exactly unusual. You’re not being targeted, hire a sitter and get over yourself. \n\nYTA and some real r/entitledparents shit",
          "id": 60,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "Well his own wedding is coming up, so I imagine that should go smoothly /s. OP YTA, you could have arranged for a babysitter, enjoyed a wonderful night out at your brothers wedding celebrating their love and getting excited for your own wedding. This shouldn’t even have been an issue; it’s your brother and his fiancée’s wedding, they get to decide how it goes. It’s not uncommon to request a child free/no children under [age] wedding. If you don’t like it, then don’t do it for your wedding.",
          "id": 61,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "Seriously how was he even invited in the first place. Dude sounds like a constantly plays the victim",
          "id": 62,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "Exactly this. My sister’s wedding had a no children rule. My family and brother-in-laws family were both upset about it. They still all came. The ones that were fine with it said they couldn’t find a sitter and told them they wouldn’t be able to make it. No fuss, and my sister and her husband put all whiners in their place. \n\nOP is definitely the asshole. Go ahead and miss your only sibling’s wedding. And live with the consequences. You’re obviously not very close with your family. I am extremely close to my family and wouldn’t have this situation stop me from attending.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Agreed, destroying family relationships because you think you’re entitled to bring a child to someone else’s party is just dumb\n\nYTA",
          "id": 64,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11705,
      "content": "YTA as well as your fiancee who is an entitled manipulative woman.\n\nI suspect that your brother will experience \\*massive\\* schadenfreude at the shenanigans that your future bridezilla will pull if she is this entitled about a child free wedding that - gasp - excludes a child.\n\nNot even a shade of gray - if the \\*child\\* were a teenager then perhaps it might be different. But a four year old is exactly the reason that people have child free weddings because what four year old would be perfectly behaved through a ceremony AND not cause havoc at a reception. Most four year olds do not react well to strange loud situations especially when their schedules are out of whack - between travel time; the ceremony, the noise; the people, the lack of rest and nap time - all of this inevitably results in some form of breakdown.",
      "id": 65,
      "comments": [
        {
          "score": 2716,
          "content": "Not to mention that a 4 year old wouldn’t even remember the wedding. They're insisting on taking their toddler to a wedding forrrrrrrrrrr *checks notes* no reason\n\nEdit: okay okay y'all I get it some of you remember weddings at that age, although it seems like only really if they were particularly memorable like being in it. This 4 year old isn't going to remember/care to remember just sitting in a pew being bored and confused.",
          "id": 66,
          "comments": [
            {
              "score": 654,
              "content": "I actually do remember being the flower girl at my parents' wedding when I was 3 lol.\n\nYour point remains, some random kid stuck in the pews ain't gonna have a good time. Or care. Or want to be there.",
              "id": 67,
              "comments": [
                {
                  "score": 334,
                  "content": "Dang no fair I was a flower girl at 4/5 and I don't remember at all. I always wished I did because it's the only wedding I've been in :( I do remember stepping on a bee at 5 though haha",
                  "id": 68,
                  "comments": [
                    {
                      "score": 146,
                      "content": "That’s a core memory for sure… I remember stepping on a skittle when I was three because I was heartbroken that I dropped it",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 28,
                      "content": "Everyone is different. I have a few very clear snapshots that stick out in my memory from that age. One was getting terrified by Barney at a county faire, because until that moment **I knew** with complete certainty that Barney the dinosaur wasn't actually real.",
                      "id": 70,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "[deleted] -- mass edited with redact.dev",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "My wife and I had a family wedding this last summer. My 3 year old and 1.5 year old were invited but we didnt bring them because they wouldn't remember. Even if they did, they'd remember themselves being angels, as opposed to my wife and I seeing them as the regular monsters they excwpt now we have to chase them while drrssed formally.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 288,
              "content": "I think the only reason people insist on taking their little kids to weddings is to show them off. They want everyone adoring their cute little adorable angel. Trouble is the kid is usually ripping apart flower arrangements and pitching a fit because they cant stick their grubby snot covered fingers in the wedding cake.",
              "id": 73,
              "comments": [
                {
                  "score": 132,
                  "content": "Yep.\n\nADMIRE THE PRODUCT OF MY GENITALS! yes it's scream-crying because it's 10.57pm and they haven't had a nap or anything to do for nine hours and I expect them to let all the adults here - who are family to me but effectively strangers to my four year old who hasn't met any of them within living memory - pinch their iddle facey-wacey-woo-boo 203 times an hour and has been forced to wear clothes they don't like and sit still for hours and hours and just generally doesn't want to be here BUT THIS IS THE PRODUCT OF MY FUCKING LOINS, I THINK IM SPECIAL, AND I EXPECT YOU TO ADMIRE MY CHILD AND BY EXTENSION ME.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 7,
                      "content": "And now I'm giving myself chuckles imagining someone actually shouting \"ADMIRE THE PRODUCT OF MY GENITALS!\" like it's a war cry or something.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "Honestly, I think my parents took me to weddings because it was a free meal. But my parents grew up in the country and there were always lots of kids at weddings. You couldn't ask a family member to babysit for free because the whole family was invited.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "But usually their the only ones that think their kids are cute.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Oh, come on, it’s not NO reason.  The reason is that the fiancée wants to pull a power move on the brother and his family.\n\nIt’s a sh*tty reason, but it IS a reason.\n\nYTA",
              "id": 78,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "A wedding is no place for a 4 year old!! I honestly cannot fathom in my head why people get so bent out of shape about child free weddings. Why on earth is OP so bothered about the child not being there for 1 evening?",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 490,
          "content": "Exactly. I went to a wedding a couple years ago that was supposed to be child free, but they made leeway for one of the guests whose babysitter backed out last-minute, for their five year old. The kid had a full one hour meltdown during dinner because he didn’t like how the potatoes were positioned on his plate, this was not a Buffet style meal, this was a fancy three course pre-plated meal. And the parents made no effort to take him outside of the hall, where he would not be a distraction during all the speeches, and everything that were happening at the tail end of dinner. It was incredibly fucking rude on the parents behalf, considering they were given leeway, and had made many promises about how well behaved the kid would be. [See my comment here for explanation on why the kid was attending, and why none of us made a big deal during the nuclear meltdown](https://www.reddit.com/r/AmItheAsshole/comments/z4j7te/aita_for_not_wanting_to_go_to_my_brothers_wedding/ixuq26v/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3)\n\n\nThis is only one instance of something like this happening and I’m sure there are hundreds of thousands of similar stories of people making an exception to a child for a wedding and then the kid has a full fucking meltdown and ruins part of the night. People are allowed to want child free spaces as adults. Sometimes you just wanna get drunk and celebrate and not have to worry about keeping an eye on all the kids. \n\n\nOP and his fiancée are massively entitled to take this as a personal attackwhen it’s a blanket rule for everybody attending",
          "id": 80,
          "comments": [
            {
              "score": 114,
              "content": "I was trying to play a lawn game with some long time friends at my sisters wedding and a bunch of kids kept grabbing pieces, knocking it over, etc. I had to tell them to get out of the damn way. The kids, and parents, looked at me shocked. the family friends and I eventually had to give up and move on. Still have never gotten to play that game.",
              "id": 81,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 83,
              "content": "Fitty bucks says they never had a sitter to begin with. The poor bride and groom :(",
              "id": 82,
              "comments": [
                {
                  "score": 157,
                  "content": "It’s kind of complicated to explain, but the sitter who backed out was the cousin of one of the parents of the attending kid, and the Sitter’s parents were in a very serious nearly fatal accident, about two days before the wedding.  So when it was announced that the kid would be coming due to these circumstances, none of us kicked up a stink because it was a really shitty situation, and we all felt bad for them, knowing that they had two family members in very serious condition in hospital. Which is also why we gave them leeway when the kid was going nuclear during dinner although I’m pretty sure most people felt the same as I did:  That the parents should’ve made an effort to remove the kid from the hall to not be a distraction. \n\nIt was my fiancé’s younger sister’s wedding we were attending, so the most of us family in attendance did our best to try and keep her stress level under control while things like this were happening during her planned-down-to-the-minute gala style wedding.\n\nEdited: some words because speech to text sucks",
                  "id": 83,
                  "comments": [
                    {
                      "score": 50,
                      "content": "Oh man, I’m really sorry to hear about the sitter’s parents. Hopefully they have recovered.",
                      "id": 84,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "I attempted to have a child free wedding. Went through mild drama drawing the line with family saying no kids... everything was figured out and then the friend that was DJing shows up, without calling to warn us, with his 3 year old because his babysitter bailed (he's a single dad)..I got daggers from some family because they \"had to\" get babysitters but he got to bring his kid and I was like \"yeah cause he's the DJ. \n\nThe kid was well behaved but friends thought they were adorable so lots of the pictures from the disposable camera pile (for guests to take pictures they'd want us to have) was of the kid or the kid got a hold of them and I had so many feet and nose and eyeball pictures. 🤦🏼‍♀️",
              "id": 85,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 77,
          "content": "Children don't belong at weddings. The adults cannot celebrate because they have to keep an eye on their kid 100% of the time, or alternatively, they celebrate and let their kid run wild. [Children die at weddings from not being watched ](https://www.jacksonville.com/story/news/2015/06/14/4-year-old-boy-drowns-pond-during-wedding-reception/15666965007/)",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "4 year olds are like the absolute worst age for a wedding. They're just getting out of the afternoon nap phase, they will crash at 8:00, be bored at the ceremony, they'll be an out of control mess at the the reception, they're more work than anything, they won't eat anything and the plate will be $100 for some chicken nuggets, they'll be hungry and cranky and will have multiple, world-ending meltdowns. I don't even know why the parent's would want them there, I would love an excuse for a babysitter and a night out. My god, my kids are 12 and 7 and we just went to a wedding last month, they just about made it through the night.",
          "id": 87,
          "comments": [
            {
              "score": 18,
              "content": "Only someone who hasn't taken a four year old somewhere could possibly question why people don't want toddlers at weddings.\n\nA child that age can barely make it through a restaurant meal and certainly not a restaurant meal where the adults want to have a civilized time and perhaps linger over coffee and conversation.",
              "id": 88,
              "comments": [
                {
                  "score": 7,
                  "content": "Right? the evening ends the same way regardless. Go with the kid. spend 4 - 6 hours placating him with snacks. One or both parents will spend the entire reception with the kid on their lap or in the seat next to them. Neither of them will interact with anyone else and no one will remember they were there. ORRRRRR. The don't go, and no one remembers they were there.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Exactly! Fiancee WILL be a bridezilla and probably say she wants a child free wedding but then her own son is there and everyone is pissed because their kids couldn't go but bride says but he's miiiiinnnne. Then will expect everyone at the reception to watch her son because she will be too busy dancing and cutting cake and eating to pay attention to her own child.\n\nOP is TA and hope he isn't too disappointed when his own family doesn't show up to his wedding because his fiancee is butt hurt.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "My son is 4 and very well behaved. I get compliments on his behavior all the time. \n\n\nHe would never be able to sit still and quiet through a wedding ceremony. Receptions usually last into the evening. My son would be tired and cranky by 8, if not earlier due to all the excitement and people. \n\n\nA wedding really isn't a place for a small child. Maybe a more informal wedding, but definitely not something fancy. My husband and I had a simple outdoor wedding next to a lake. The reception was just cake and punch. My bonus daughter was 4 at the time and she was our flower girl. One of my nieces was a tiny baby. Neither were quiet and subdued the whole time - not that I expected or wanted them to be. That was the kind of wedding we chose. Other couples may want something different. And that's OK.",
          "id": 91,
          "comments": [
            {
              "score": 14,
              "content": "Yeah - it isn't a question of a child being \"well behaved\". It is just beyond their developmental abilities at that age to be able to handle a ceremony and reception without having a breakdown.\n\nNow the kind of wedding you are describing is fine for a young child because they can run around and that is just part of the ambience versus a more formal type of wedding where the guests are expected to sit at their tables and mingle quietly.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "My nephew is 9 and couldn’t even behave for my wedding. He was kicking his feet against his chair in the front row of our backyard ceremony and throwing cups at our feet (my husband and I didn’t even notice, but the rest of the guests were upset). We did get some funny photos of him pouting.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "My 4yo is generally so well behaved in public when were out and about, or having something to eat at a pub or something. But a wedding is completely different, she wouldn't be able to sit still through the whole thing, and then the do afterwards she'd get too excited and overtired, its never a good combo! My friend got married recently who I've known my whole life, I couldn't get childcare so I didn't go, she offered for the kids to come but it was a small venue, they'd have been the only kids there and I didn't want to ruin anything for her. YTA OP!!",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I'm thinking future bridezilla is gonna find a reason not to invite his family. Its leaning towards fiancee isolating him imo.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I went to a wedding last weekend and the kids were menaces. All between 0 and 4. So much screaming and running around during the ceremony. At least they all went to bed after dinner.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7937,
      "content": "YTA.\n\nIt’s their wedding, they make the rules. They are perfectly entitled for THEIR day to be child free.",
      "id": 97,
      "comments": [
        {
          "score": 1996,
          "content": "Especially because it's not even targeted. Title makes it seem like an issue, but then it's just \"no children at all.\" Sounds fair to me",
          "id": 98,
          "comments": [
            {
              "score": 721,
              "content": "& why would you want a FOUR year old to be the only child in a room of adults, anyway? That kid is going to be miserable and needy. He’d have a much better time at home with a babysitter and all his toys/worldly comforts, too.",
              "id": 99,
              "comments": [
                {
                  "score": 139,
                  "content": "Seriously. Kids aren't going to enjoy a wedding that isn't in some way catering to the presence of kids. It's just not a kid friendly event. Hell, it's not even an adult friendly event in many cases it's just a boring social obligation you put up with because you love someone.",
                  "id": 100,
                  "comments": [
                    {
                      "score": 78,
                      "content": "My husband and I have some friends who met LARPing (live action roleplay - basically like Dungeons and Dragons except you act it out with foam weapons as beat your friends up in the woods) and they had a viking and Celtic themed costume wedding. It was awesome. Whole roast pig and everything.\n\nEvery other wedding I've been to has been at best kinda dull.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "There's pictures of my younger sibling at my uncles wedding in the late 80s/early 90s stacking beer cans to keep him busy. He was very bored. I don't remember that wedding much but apparently they had me do something similar because I too was bored. I've been to a decent amount of weddings, any wedding I have been to with kids, the kids were nightmares by the end of the night. Or the parents left early because their kids couldn't keep it together. My own BILs who were small children at the time (2nd marriage), were absolutely nightmares at their older siblings wedding years ago. They held up the entrance announcements coming in to the venue because they wouldn't sit down and behave.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": ">why would you want a FOUR year old to be the only child in a room of adults, anyway?\n\nBecause think how many free babysitters will be there while OP & his fiancée pretend they are childfree!",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I went to a wedding when i was 8 and it was indeed miserable. I would rather stay home where i could do anything, not in a wedding that is clearly an adult targeted event and i had to stay sit all the time. The best part was when it finally ended.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Considering how entitled and childish the fiance seems I doubt her kid would be much better behaved...",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Exactly. OP isn't mad that it's targeted because it's not. It's a blanket rule - child free wedding. OP is mad because his fiancee is mad Brother won't bend the rules and make an exception for them. That's RIDICULOUS",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 414,
          "content": "I’d make the same decision should I marry again. \n\nYTA and the entitlement you and your fiancee have is ridiculous. Many weddings are child free and for good reason. Both of you need to get a grip here. He’s your only sibling and you’re being manipulated by your fiancée to miss his wedding. Get a freaking babysitter and be a decent human and brother. If your fiancée is going to make such a stink about it and refuse to go, you need to go without her. The world isn’t her way or the highway.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I think OP doesn't like being wrong and he is NEVER going to admit that he's an AH. It's been said time and again here that 'child free' means just that. There's no such thing as exceptions just because you're family. You and your fiance are completely out of touch with wedding etiquette. You don't get to make the rules. IT'S NOT YOUR DAY! I hope your sense of entitlement is enough to comfort you after you have messed up your relationship with your family.",
          "id": 108,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "parents are calling me unreasonable for being willing to\n• miss my only sibling's wedding and basically let a woman I've only known for a year an half drive a wedge between us. They said if I go through with this then I miaht lose my brother who's my sunnort and comfort. \n\nOp should heed his mother’s counsel.  When his contentious fiancée gets done with him, the brother will not be there for him.",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "A child free wedding is honestly quite common I don’t understand why anyone would be an exception",
          "id": 110,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5781,
      "content": "YTA 🤣 feel free to stay home. It will probably be better without you. But this situation is completely your fiance's doing and is meant to drive a wedge between you and your family. Your almost-stepson is not being excluded because he's not technically family (which would be a completely valid reason to skip the wedding.) It's because he's still a child and there will not be ANY children at the wedding.",
      "id": 111,
      "comments": [
        {
          "score": 1317,
          "content": "Agreed. The title makes it sound as if the STEPson was specifically excluded. That’s not the case. It’s a child free wedding. For everyone. My best friend’s wife pulled this exact stunt a few years back when they first got together. Just a heads up he is now in a miserable marriage without the support of all his friends / family because she systematically cut them out over the years. And it started with our other best friend’s child free wedding.",
          "id": 112,
          "comments": [
            {
              "score": 298,
              "content": "Your best friend is in an abusive marriage. We need to call it like it is, men also get abused. Controlling, manipulating abusive people should be called out as the abuser they are, male or female.",
              "id": 113,
              "comments": [
                {
                  "score": 47,
                  "content": "Eh, it rarely works. A good friend of mine tried one of those interventions and it mostly backfired. No-one wants to hear it even once it's time for the \"We told you so\".",
                  "id": 114,
                  "comments": [
                    {
                      "score": 56,
                      "content": "I understand that completely. I was there, once upon a time. They won't see it until they're willing to see it. But I think it's important that we call attention to the fact that abusive relationships are abusive relationships, no matter the genders of the people involved. Too many people are dismissive when it's a man being abused.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Interventions are usually bad idea for any situation and they often make the person feel attacked and bombarded in a way. \n\nA much better way is to approach 1 on 1, say your piece (about them, not “this it how X has effected me) and give them resources and say you are here to discuss.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "It always shows someone’s real colors when they think they can be an exception when it’s a child free event (cuz “we’re family”) but then shocked pikachu face they they aren’t given an exception. OP YTA. Seems you and your fiancé have some actual growing up to do…especially your fiancé",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 282,
          "content": "Right!?! \n\nHonestly, I think OP’s girlfriend also shouldn’t make the cut. She is clearly not a grown up.",
          "id": 118,
          "comments": [
            {
              "score": 22,
              "content": "I think OPs girlfriend counts as a child😂",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "This is what OP needs to realize... His fiance is 100% intentionally creating division and conflict.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Agree with this. OP’s fiancé leaped at the chance to make something that has nothing to do with her, all about her. This is beyond toxic and likely reflects her usual approach to life. Some people just aren’t happy unless they are the main character of every single thing that happens ever. These people are exhausting. I am sad for OP’s family and future battles over holidays, vacations, etc. \n\nOh and OP YTA for encouraging and enabling this behavior at the expense of your brother and his bride.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Yup. Cannot believe OP is so blind and dense he can't see what his gf is doing\n\nEdit: typo",
          "id": 122,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3239,
      "content": "YTA\n\nI am sorry but childfree means childfree and: a 4 year old will be bored to hell and beyond during a wedding, especially if they're the only one",
      "id": 123,
      "comments": [
        {
          "score": 441,
          "content": "Yup, completely agree. I thought this was going to be the more typical issue on this sub being because the stepson wasn't *blood related*, but it was because the stepson is a *child*. \n\nEven if you wouldn't have a child free wedding yourself, the entitlement you must have to believe you get to bring your child to someone else's child free wedding is absurd. OP's fiancee is a huge AH here and OP is an AH for supporting that absurdity.",
          "id": 124,
          "comments": [
            {
              "score": 27,
              "content": "THIS RIGHT HERE. I thought children of other close family members had been invited. But no - not the case. So why the hell would they make an exception for you kid (stepson or not). This is such a bizarre hill to die on. OP, you're going regret alienating family members for no good reason, due to your fiancé seems to be a really difficult person. YTA",
              "id": 125,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 70,
          "content": "No kidding. All children are excluded.  They are creating the drama, not the wedding couple.  Wonder which friends or family of his she will target next?",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Not to mention that bored kids usually find the most annoying ways of entertaining themselves.",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "But WHAT ABOUT FAMILY CHILDREN?!?!?!\n\nNo.\n\nProceeds to scream as if their step son is being targeted. \n\nYTA.",
          "id": 128,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Right?! Babysitters. Heard of them?",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Or if they aren't bored it's because they're running around being a kid, which is why people have child free weddings",
          "id": 130,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2719,
      "content": "Your brother is allowed to have a child free wedding and you’re allowed not to go if you aren’t able to bring who you’d like. HOWEVER Your fiancée is TA for demanding special treatment from people she has barely known a year. You will be TA if you allow her entitled behavior to drive a wedge between you and your family.",
      "id": 131,
      "comments": [
        {
          "score": 426,
          "content": "Exactly this OP, she's being completely unreasonable and if you allow yourself to support her in this, she will end up isolating you from everyone else that you love. Are you really going to let someone who you've known for a year and a half destroy the relationships you've spent your entire life building?\n\nWhat is your 4 year old going to do the entire wedding??? Why is *this* the hill you're going to die on? Obviously you see it's going to destroy your family and even if you start to fix it right this second you'd better be prepared to put in the leg work and apologize. Your family doesn't deserve you and your fiance treating them this way and they do not owe it to you to take it.\n\nYTA",
          "id": 132,
          "comments": [
            {
              "score": 87,
              "content": "Yeah, just get a babysitter already.  Sheesh.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I agree, OP has a sticky uphill battle now, before his fiancé has even officially entered to family.\n\nAll the sides OP presented from his family sound really reasonable, even though OP tried to make it sound like they weren't. This IS already driving a wedge and she DID convince you to make an issue of something that's not your call to make.\n\nYour fiancé is not respecting the wishes of the bride and groom. It doesn't matter if she's family, family to-be or not. It's not your wedding and it's not her wedding!! \n\nShe's trying to make this about family when really it's about her lack of respect and entitlement. Can't believe she convinced you to act like her, too.\n\nYTA and so is your fiancé.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Seriously, what if this was a work function they were going to attend? Would she insist on bringing her child to that too? Like, what’s the line for this woman where she wouldn’t take her child being excluded as a personal affront?",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Completely right about this. Child free weddings are fine, but it's also reasonable for people with children to decide not to go if they can't bring their kids. The AH part is demanding that someone else change their plans to specially accommodate you. YTA OP",
          "id": 136,
          "comments": [
            {
              "score": 6,
              "content": "Agreed. If OP and fiancée didn't have a trusted sitter (or couldn't afford one), politely bowing out wouldn't have been an AH move. While I can understand that OP would want to attend with his fiancée, he'd have to weigh what attending or not would have on is various relationships.\n\nThe real asshole move was arguing against the child free policy, and then threatening not to go when you didn't get your way.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Exactly this.  And adding, if the fiance got her way and brought the only child to the wedding, people expecting zero children are going to be ANNOYED.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1709,
      "content": "YTA. Child free wedding means No children.  \n\nYour kid is Not an exception. \n\nAnd expecting them to be is incredibly entitled.",
      "id": 139,
      "comments": [
        {
          "score": 311,
          "content": "And it’s not even his kid, or his step kid.\n\nHe has dated this woman for a year and a half. So even if she was a mom who would let somebody meet her kid on the first date he has only known this kid a year and a half.",
          "id": 140,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1355,
      "content": "YTA , just one question did ur fiancee asked not to attend the wedding or this is on your own u have decided.. either ur still the AT...\nIts ur brothers wedding he and his too be wife get to decide wat kind of the wedding they want.. let be childfree..its not like they specifically dont want ur step kid .... Its a rule applied in. General for all",
      "id": 141,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 957,
      "content": "YTA It's a childfree wedding. Your fiance's son is not an exception just because you and your fiance throw a tantrum.",
      "id": 142,
      "comments": [
        {
          "score": 226,
          "content": "Op and fiancé are already the exception as far as children being invited with the tantrum they’re throwing.",
          "id": 143,
          "comments": [
            {
              "score": 69,
              "content": "Yeah, they've already kind of spoiled the wedding and created unnecessary drama for the rest of the family with this ridiculous sense of entitlement. Even if he chooses to go in the end, they can't take back the distress they've caused.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Best answer ever",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 788,
      "content": "YTA. Help me understand what role you think a tiny four-year-old plays in a wedding. Check all that apply.\n \n     __ Is very quiet during meaningful ceremonies that\n          involve content he can’t possibly understand. \n     __ Loves to sit still at long dinner receptions where\n          expensive adult food is served.\n     __ Frequently engages in adult conversation.\n     __ Allows the invited parent to celebrate the couple\n          late into the evening because he doesn’t require\n          constant supervision. \n\nHmm, that’s right. This is an event for loved ones to celebrate someone’s marriage; not a family party.",
      "id": 146,
      "comments": [
        {
          "score": 163,
          "content": "Damn!! PERFECT comment! I have a 4 year old and if never dream of bringing her to a wedding neither she, nor myself would enjoy it and likely would end up disrupting the ceremony. You can only keep a 4 year old still and quiet for so long. OP, you and your fiancée are childish and being very unreasonable.",
          "id": 147,
          "comments": [
            {
              "score": 6,
              "content": "I have 2, I wouldn't want to bring to to a wedding they are invited to, 4 is not a great age for quiet and patient children when at  something they deem boring.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Not to mention, parents who demand preferential treatment usually have the worst kids. I guarantee you that four-year-old is noisy and obnoxious.",
          "id": 149,
          "comments": [
            {
              "score": 6,
              "content": "Oh I’m sure he/she is! My kid is cool as fuck and not a little shit in the least. Hell, she’s never even had a meltdown before and I’d still never bring her to a child-free wedding!",
              "id": 150,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}