{
  "post content": "I(M32) have a daughter Harper(F14) from a previous relationship. I have full custody and her mom is not involved in her life. \n\n5 years ago I married my wife Nina(F31) we tried to have a child but couldn't. We went to the doctor and turned out I can't have anymore kids due to some complications. We decided to use an sperm donor and the result was a son, Mark, who was born a few months ago. \n\nThe problems started when Nina got pregnant. Harper wasn't happy about it. When Mark was born things got worse. Before this Harper and I used to spend 2 days a week together, just the 2 of us without my wife but after Mark was born I couldn't do that anymore. I can't just leave my wife alone for 2 days a week with a newborn and Harper has been very angry about it. \n\nThe main problem started 3 days ago. Nina and I decided to make a nursery for Mark instead of having him in our bedroom for multiple reasons. \n\nOur home has 4 bedrooms, 2 master bedrooms at one side and 2 bedrooms at the other side. One of the master rooms is ours, the other one is Harpers. It was very hard for Nina and I to go to the other side of the home multiple times at night when Mark wakes up so I asked Harper pack her stuff and go to one of the bedrooms so that we could give her room to Mark. At first everything seemed alright. She said ok and went to her room and started packing but less than an hour later my brother showed up at our home, asking for Harper. She had called him and asked him to take her. She came out of her room with her stuff, told me \"you can give it to your son now\" and left with my brother. I told her she could only go for one night but it has been 3 days and she is not back and wont even talk to me. \n\nIm receiving calls from my family all calling me an AH and other names. \n\nI dont trust their judgement, they very clearly favor Harper. She was the first grandchild in our family and everyone's favorite also they are trying to accept Mark as my son but I could see that they haven't been able yet so I decided to post here and get some unbiased opinions. AITA?\n\nEdit: Here is the update that I promised \n\nI realized I've messed up so I went to my brothers home and tried to get Harper back but he didn't even let me see her, saying she doesn't want to see me. \n\nHe said he would only let her go back if: \n\n1. She wanted to go with me \n\n2. We move to another home close to their home because they wanted to have Harper close to them to keep an eye on her and make sure we are treating her right, we used to live very close to them but when I got married my wife and family didn't get along so we moved somewhere farther away which made Harper very sad. \n\n3. Harper will get to choose which bedroom she wants in our new home \n\n4. I should spend 1 on 1 time with Harper at least one day a week \n\nWhich I accepted. \n\nThis caused a lot of problems since my wife doesn't like some of those conditions. she thinks they are not reasonable. She got angry, took Mark and went to her parents home and is staying there so now I'm also receiving texts from my inlaws calling me an AH. \n\nRight now Im looking for a new home that is closer to my brother's home \n\nI called Harper and my brother convinced her to talk to me for once. she was crying the whole time while telling me that she felt like I didn't want her anymore. Hearing her cry like that really broke my heart. I honestly never meant to hurt her. \n\nAfter so many apologies and gifts she finally agreed to see me. I will go to my brother's home everyday to spend time with Her. She has also finally agreed to come home with me when I find a new home.",
  "id": 1,
  "comments": [
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I tried to take my daughters bedroom away and give it to my son and everyone thinks that makes me an AH\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post. [To learn more about the test click here](https://www.reddit.com/r/AmItheAsshole/comments/tio99u/so_we_decided_to_fuck_with_the_sub_again)*",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "YTA. Just to start with the WTF is going on here… Your family is adjusting to having the new baby? What family needs to adjust to having a new baby that isn’t theirs? Unless they absolutely hate your wife or you guys are being completely obnoxious about having a son there shouldn’t be any reason why your family isn’t loving and inclusive to a new baby. Regardless of whether Harper is your first it shouldn’t make a bit of difference to their acceptance of Mark. Unless you are treating Harper like absolute trash because of the new baby which from this post it sounds like you are. In which case, it would damper anybody who loves Harper‘s enthusiasm about the new baby because you’re being enthusiastic enough for the entire clan. Wake up. You are losing your daughter and alienating your family. If that doesn’t matter enough to you to change your behavior then you don’t deserve her or them.",
      "id": 3,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "Yea you are an asshole Jesus your aweful",
      "id": 4,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "YTA- idk how you can imagine you're not in this situation. Put yourself in your 14 y/o's shoes for a minute then ask yourself how you would have reacted at that age to having your awesome bedroom with its own bathroom taken away from you to be used for a baby.",
      "id": 5,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "YTA “so hard to walk to the other side of the house” suck it up buttercup you just told Harper that the new baby (who isn’t bio yours ) means more to you than she does \n\nYTA YTA YTA YTHFA",
      "id": 6,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "Also, are you serious that you're wife can't handle a baby alone for two effing days? Unless she has post-partum depression, that sounds like a bunch of horse shit.\n\nI'm gonna tell you: you've lost your daughter. The thing is, you're gonna need her. Nina we'll have moved in with the money, and spoiled Mark will not really give a shit about tot when you're old and grey.\n\nI really detest people who make an obvious difference in their children. It's really disgusting. Harper's mother has basically abandoned her. Her father not only marries someone else and has a kids, but she loses one-on-one time with her only parent. Not only that, but now your prioritize the baby over her. As I said previously, I really hope Harper goes no contact with you. You don't deserve her.",
      "id": 7,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "Yta",
      "id": 8,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "W Harper",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "You definitely the a hole",
      "id": 10,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "YTA and this is why I stick to this:\n\n1. You pretty much admitted that you pushed to have this child with your new wife, knowing that it upsets Harper. Did either of you sit down and talk to her about this decision? No? That's a strike against your daughters voice in the family. It means she probably already feels like she has no voice or is being pushed away/replaced.\n\n2. You cut the time you spend with her to almost no time. That's selfish and unfair of you to believe that one child needs more attention than another. Regardless of what age she is, Harper is now having to swim through her teenage years probably feeling alone and isolated as it is given how ruthless school can be. And now you want her to sacrifice the time you used to make for her, for this child that you and your wife have pushed for? I can completely understand making a compromise and communicating to her that the time needs to be shared. But it sounds like you never intended to make her feelings a priority in any of your decisions.\n\n3. You just forced a female teenager to pack her things and move out of what was supposed to be her safe space. This one hurts me because I've had my parents do the exact same thing. It's an invasion of your daughter's privacy. Truth be told after my parents did this to me, they still ended up keeping the baby in their room for over a year before the bedroom I moved from was used. It's really shitty of you to make your daughter uproot and move her room over having to walk to the other side of the house. It sounds like you didn't negotiate anything with her, you didn't make any compromises and you didn't attempt to reason with her or have any kind of discussion regarding it. That shows me that you have no respect for your daughters privacy, and you have no respect for her personal space.\n\n4. You are upset that she went to family about it.\nWhy are you upset? You should be honestly proud of your daughter for being able to understand that she has the ability to reach out to other family members when she is destressed and upset about things that are happening in the house. That's what good family relationships are supposed to be. It sounds to me like you're upset at her for reaching out to your brother because you know she's going to tell him everything about what's going on in the house. It sounds like you might be a little embarrassed about what she might say. In a way you just took away her voice of opinion, her personal space and have hurt your relationship with her over trying to make room for Mark. Mark is still a baby, and the rest of the family I'm sure will be babying him soon enough. Right now your daughter is seeing how far you would go for another kid, but not for her, and of course she's gonna be mad.\n\nGive her time to vent to your brother,\nAsk that he mediate between both of you even so you can actually talk and get to hear how she feels about this situation. Try to work out a compromise if you absolutely need the baby in the second master bedroom. Perhaps offering to let her have the room back once the baby is older, or offer to pay for paint/window clings and  decorations for the other room you're trying to shove her into might make it more tempting for her to consider. Try to be empathetic and put yourself in her shoes. \n\nAlso, it sounds like you could use some family therapy or counseling regarding communication. Y'all clearly need to communicate with Harper better and start treating her with the respect you want her to give to other adults (including you). \n\n\nI hope things work out, and you can prevent and avoid the emotional trauma and detachment my own parents put me through as a kid.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    }
  ]
}