{
  "post content": "I work as a lifeguard at a waterpark and part of my job includes managing the top of the waterslides. I’m to make sure no one does anything dangerous like going face first, cramming too many people on one innertube, etc. I’m also instructed to ask anyone who looks like they could be over the weight limit–250 pounds–to weigh themselves on our scale, and deny them entry if they refuse. I’m not super comfortable with this, but it’s much better than risking people’s safety.\n\nHere lies the problem: I lift weights, and for this reason I am very dense–I weigh 185 pounds but somehow wear a size 6. Most of my friends also lift and have similar body compositions to me. For this reason I have trouble estimating how much someone actually weighs.\n\nThis problem presented itself last weekend when an overweight teenage girl wanted to ride the slide. She most likely wasn’t over 250 pounds, but I couldn’t be certain. I’ve gotten better at estimating weights but my supervisor says if there’s any chance they’re over 250 to weigh them, so I approached her gently and asked her to please get on the scale. \n\nShe met me with a snarky teenager attitude and said “what if I refuse?” She was with a group of teenagers, some of whom were giggling.\n\n“Then you won’t be allowed on the slide,” I said matter-of-factly.\n\nShe rolled her eyes and got on the scale, and her weight wasn’t even close to 250 so I felt kind of bad. She then said “See?” and went along with her friends.\n\nAlthough she gave me attitude I could tell she was embarrassed. Her face was red as she went back to her friends, who were all thin. I asked my supervisor how he would have handled the situation and he said I did the right thing, that it’s better to hurt someone’s feelings than break someone’s bones.\n\nHowever, yesterday I was called into the office of the owner of the waterpark. She told me she received an angry email from a parent about how I embarrassed their child in front of her friends. I explained to her that I was just following protocol and she asked me how much the girl actually weighed. I gave her the answer and she laughed at me and told me I could never get a job as a weight guesser at a carnival and that I need to do my job better. My supervisor is backing me up and saying I was doing what he has required me to do. I’m thankful for his support but honestly this whole situation is making me feel like an a\\*\\*hole. I know teenage girls are a particularly vulnerable population, as I was a teenage girl not too long ago, and I could have possibly handled that situation with more care. But at the same time safety is my first priority. Does that make me the a\\*\\*hole?",
  "id": 1,
  "comments": [
    {
      "score": 11530,
      "content": "NAH I guess since it’s your job, but this is a horrible fucking policy, good lord. Asking people to weigh themselves in front of everyone if they appear fat? Do you have any idea what that could do to someone’s psyche? Y’all need to change that policy ASAP. \n\nI’m sure there’s a way you could bypass legal issues by putting up signs about weight risk around the slide. If someone is too heavy and gets hurt, it’s their own fault. Public humiliation is not the answer here",
      "id": 2,
      "comments": [
        {
          "score": 24774,
          "content": "I have to disagree — last year a 14 y/o died at a Florida amusement park because he was ~100lbs over the weight limit and had still been allowed to ride. He slipped out, fell 100+ feet, and died of horrific blunt force trauma. Family sued the amusement park and various others because the ride operator let him on in the first place. I’m quite certain that if that family could go back in time, they would’ve preferred to see their kid get weighed and rejected than to have to bury him. \n\nDon’t get me wrong, being embarrassed for your weight sucks but if I were in OP’s shoes, I’d rather embarrass someone 100x than be indirectly responsible for their death or permanent disability.",
          "id": 3,
          "comments": [
            {
              "score": 7793,
              "content": "Exactly this. My husband is an employee for a zip line company. Guess what? Guests get weighed! If they look like they might be 250 then they get weighed.. if they are 250 they get turned away because of safety. He’s pretty sad how many people lie about their weight to do a dangerous activity.",
              "id": 4,
              "comments": [
                {
                  "score": 6358,
                  "content": "I went to a zip line park where everyone got weighed - or at least both me and my partner did. He's a little on the overweight side, so that was fair enough but I'm petite and short and no where near the weight limit. Still made us both do it, and honestly I think that's the best way to handle it, make the whole group do it so no one can say they were singled out.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2271,
                      "content": "If there is a weight limit that attendees could likely hit, then weighing everyone and having wrist bands or something to indicate which rises are safe is better, IMO, than singling out the ones that \"look fat\".\nThe amusement park near me does this for height.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 673,
                      "content": "I agree with weighing everyone. When I was a barista for a large corporate chain, we sometimes gave free samples (if someone wanted to try the drip we had brewed or something) and I was told to not give free samples to homeless people. I told my supervisor that I wasn’t comfortable judging whether someone was homeless or not based on their appearance so I would either gives samples to everyone or no one. I gave samples to no one when she was around. I have samples to everyone when she wasn’t around lol.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 542,
                      "content": "At our water park, everyone gets weighed, no matter what.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 147,
                      "content": "That’s the only sensitive way to handle it - weigh everyone, nobody singled out. \n\nI still occasionally get carded when I buy alcohol, and nobody has suspected me of being under 21 for a long long long time. I’m like “you need to see my AARP card?” But the kid at the register doesn’t have to make a judgement call and doesn’t have to worry about offending anyone.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 112,
                      "content": "This is what I came to say. Just weigh everyone with a digital scale that only the operator can see. No one is singled out and people are safe. The rule is there for a reason.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 105,
                      "content": "This is the best way. Just have everyone weigh before or while they're in line.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "The scale at our water park doesn’t show a weight, it just glows red or green. It doesn’t seem that crazy to have a scale like that, so if you have to be weighed, it just shows that you are under 250, not your exact weight.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "When I went ziplining they weighed everyone, I’m petite and light. They were giving the people manning the other end of the zipline a heads up that they had a light person coming their way.  This is because they had to get me as I was suspended over a canyon because I didn’t generate enough momentum to make it all the way to the end.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "This is much better!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 317,
                  "content": "Do they get weighed at the top of the zipline before they are strapped in, or before they even make their way up there?\n\nThis waterpark should be weighing people at the entrance(to the ride) if it's a necessity for the ride.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 194,
                      "content": "They get weighed when they arrive out front. It’s the easiest way. Waiting until your up top would be a dick move. There’s also a second weight station just in case they think any guest lied about weighing in. Usually in that case they weigh all the guests together as a group, and turn away the one that lied about weighing in out front. They also have different protocols for zip lining sitting down and laying down. If they are close to the 250 limit, they have to go sitting due to safety concerns. And yup lots of people get offended by that. But safety trumps all.",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 32,
                      "content": "For **a** ride. A water park typically has multiple rides, with different restrictions. What if a fat person doesn't even want to ride it? Should they have to be weighed for no reason at all?",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "That’s what I think as well, why is there not a discreet scale somewhere early in the line where they can pull people out if there’s an issue?  If weight is a safety factor, then everyone going on the ride should be weighed.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 113,
                  "content": "Yeah I've done zip line stuff before, and obstacle courses secured to trees, rather than on the ground (can't remember the company name), sure I was embarrassed to weigh myself in front of everyone, but they weighed EVERYONE which gets rid of the embarrassment. I was so glad of their safety conciousness, as its better to turn someone away than get sued because someone died. Instead of pulling larger people aside in the OP though, they should make everyone weigh themselves, then they know for sure the weight is okay.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 96,
                  "content": "I'm embarrassed that I'm over 250 lbs. \n\nI also like being alive.  So thank you to the people who check for my safety.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 5,
                      "content": "As a self described fat person,  I agree.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 88,
                  "content": "Still blows my mind that people don’t understand weight limits. Like hello, you can LITERALLY DIE by not following this. Nobody is trying to be mean.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 32,
                      "content": "I'm reaching the point where I 'm surprised if people DO understand something.  The Trump years were hard.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 73,
                  "content": "I’ve been zip lining a few times and it’s standard protocol in my area that EVERYONE gets weighed. I’m 5’2 and was 115 pounds when they asked me to step on the scale. Safety is important when doing activities like this- for yourself AND those around you. NTA, OP. You were doing your job.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 8,
                      "content": "See, I think this is why it is a shitty policy to guess weight like this. Weigh everyone then nobody has to get embarrassed that they look fat",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I insisted to be weighted because I feared not being heavy enough and staying stuck.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 57,
                  "content": "I went to a zipline place that weighted guests, but didn't show a number.  It just displayed green or red if you were over the weight.  Seemed like a good way to do it.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": "Did bungee and canyon swing on a school trip years ago, we got our weight written on our arms with black marker and was placed in order from lightest to heavies \n\nUsing the wrong ropes can kill a person",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "Second date, guy is a pilot and taking me up in his (rented) small plane. He has to ask me my weight. So... I tell him, and add 5 lbs just in case, for safety. \n\nHe was so apologetic, but he wasn't asking to be nosey or insulting.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "The only addition I'd make to \"weigh everyone\" is to also have that somehow be in a way that only the person being weighed and the attendant can see the number. That may already be the case though.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 780,
              "content": "Maybe it would be a better policy to weigh everyone? Not single people out? \n\nOP themself says that people can look far different than what they weigh",
              "id": 31,
              "comments": [
                {
                  "score": 350,
                  "content": "Exactly \n\nI did a zip line ride years ago, where everyone got weighed, so they knew how much braking they needed to apply to you. You stood on a scale in all the harnesses etc, and only the operator could see the weight, who stuck a code to your harness so the next operator could put the right parachutes/whatever to your rig \n\nMuch better than asking random people - from a group! - to weigh themselves in public",
                  "id": 32,
                  "comments": [
                    {
                      "score": 194,
                      "content": "Went ziplining with the fam last year.  Absolutely fantastic day.    We were all weighed from my 200 lb husband down to my 60 lb 10 year old.   No singling out, no embarrassment.    \n\n\nOP is not an asshole but BOY does that park have an awful policy.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "This! When we went the guy told me I’d need to get on the scale. I asked that he be the only one who saw and that he keep my true fat-bottomness level to himself 😂",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Yeah, and that should be easy at a water park. They get weighed when they buy their ticket and wristband can indicate if they're over the limit for certain rides.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 100,
                  "content": "The problem is that if everyone had to be weighed, it would hold up the line. IMO, weighing at the beginning upon entry to the park and getting a safe/unsafe printed on a bracelet or something would be the way to go, but it's still public weighing and everyone will still know what the bracelet means so eh?",
                  "id": 36,
                  "comments": [
                    {
                      "score": 152,
                      "content": "My ex-employer owns a small amusement park & one of the rides is a zip line w a weight requirement. Everyone in your group for the ride is weighed by standing on a flat ground scale pad (like they use at veterinarians) & no one sees the number but the operator. You walk on to it as you're waiting for the last riders to finish. It's very fast & doesn't hold anything up or single guests out. That company was *cheap AF*, but still had a better solution than this water park.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "I don’t think that would work because different rides have different weight limits",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "Waterslides have a break between when the last person as gone and tell next person gets in. They can weight the next people then.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "No, it wouldn't. The line is held up because you have to wait for the previous person to exit the slide before you can go. So you only have to weigh people at the rate that people actually slide down the slide, which is easy enough.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 33,
                  "content": "Yep, bungy jumped in NZ, everyone got weighed b/c they had to adjust how many cords to use, how much length you could have. It was in kilos, so us 'muricans weren't embarrassed anyway (yes, I CAN convert in my head, but weight always looks better in  kilos 😀",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "This is the answer.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yeah I was thinking they could do something like a digital scale with no number readout on it connected to a raspberry pi which then just puts either yes or no on a monitor depending on the weight. Might cost a bit to set up but you could weigh everyone fairly quickly and without revealing their actual weight to anyone.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I think something similar to how servers/bartenders ID people makes sense, so weighing everyone that looks to be above some weight that’s under 250 lbs, like weighing anyone that looks to be above 150 lb.",
                  "id": 44,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Agreed, better not only for the customers esteem, but a better guarantee they don't let someone over the limit get hurt because they felt guilty/bad singling them out. \nAt work hearing protection is only legally required at certain decibels (and some other criteria) - so legally some areas require it and some don't. Rather than rely on people to comply with the rule in each area, policy is hearing protection everywhere. The simpler a rule is, the more likely it will be followed. Start adding caveats and exceptions and judgement calls, and it gets harder. An hourly seasonal teenage worker is more worried about an adult screaming at them for being wrong or offending them than making sure they're safe.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 283,
              "content": "Yeah this is entirely on the company - there's a better way to handle this i.e. the weigh-in area should be screened for privacy, the rider should have just been asked to step aside before they rode, the employee should have a script that's already been vetted for sensitivity issues, plus there should be a pretty hefty safety margin involved. No one's life or safety should depend on a minimum wage employee guessing people's weight and weighing them in public.",
              "id": 46,
              "comments": [
                {
                  "score": 69,
                  "content": "Agreed. There's way more tactful ways to do this. The OP was only doing what company asked them to do.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Yeah, even checking for every passenger would be a bit better. Might take up more time but it ensures everyone is under the limit and doesn’t require the operator to single anyone out",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "At the water park near where I live it's not optional.  As one person gets onto the slide, the next person (or group for a multi-person ride) in line stands in the standby area.  Which is, of course, the scales.  The operator doesn't see the specific number, but there's an indicator if they're over or under the weight limits.\n\nThat's a much better way of handling it.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 121,
              "content": "Where I live, the drinking age is 19, but liquor store policy, which is prominently displayed is to card anyone who looks under 25.   They are NOT taking any chances.  OP’s job to verify weight is even more critical.   It would be safer for the ride to have a scale at the entrance and have every one who looks 200 and over step on.",
              "id": 50,
              "comments": [
                {
                  "score": 63,
                  "content": "In the USA the drinking age is 21 and every single major store has a anyone who looks under 40 gets IDd.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Target IDs everyone. No exceptions. Doesn't matter if the look 90, they have to have their ID scanned.",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 119,
              "content": "^This. Would you rather have an embarrassed kid or a dead one?",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 96,
              "content": "To add on to this, a water park near my hometown has a 10 year old die on a water slide because he didn't weigh enough, and the inner tube lifted up and the guard fence decapitated him.\n\n100% these park employees need to weigh people. It's not on them what your weight is, but it is on them to ensure rider safety. Which includes weight on some rides, height on most others.",
              "id": 54,
              "comments": [
                {
                  "score": 13,
                  "content": "That is terrifying to think about for everyone who witnessed it",
                  "id": 55,
                  "comments": [
                    {
                      "score": 9,
                      "content": "It... was not a pleasant sight. The slide was stained for a bit after too when they shut the slide down but kept the park open.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Are you referring to Verrückt? That was a poorly designed ride, not a weight issue.",
                  "id": 57,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "[deleted]",
              "id": 58,
              "comments": [
                {
                  "score": 197,
                  "content": "**That water slide was not a weight issue.** The combined weight of all the occupants was within the standards given for the ride. It was a case of gross negligence. [The guys who designed it didn't even have a mechanical engineering degree.](https://www.theatlantic.com/video/index/595981/water-slide/) And with Kansas's lax laws meant that they didn't even need those credentials to deem the ride 'safe'.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 54,
                      "content": "Thank you! The slide should have never been built to begin with!",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 81,
                  "content": "That also a design issue. The owner of the park was a fucking hack and shouldn't have designed and made his own rides. It's possible for an accident to have multiple causes.",
                  "id": 61,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "Tyre Sampson. Poor kid. There was a story going around that he went with friends to the I-Drive (International Drive in Orlando, Fl) area where there were a couple rides and apparently he was feeling down because the Drop Tower was the only ride that didn’t turn him away because of his weight. I wish peer pressure wasn’t a thing in this world.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "Are you meaning the Icon park accident? Because there was a lot more to it then just the kids weight.",
              "id": 63,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "Pretty sure I remember a horrible case where people's weight was all mixed up for a ride in a boat slide thing and a boy ended up decapitated because the weight ratio was off. \n\nI know it's not the best way to go about things but man, I'd so much rather a family member be temporarily embarrassed than end up dead.",
              "id": 64,
              "comments": [
                {
                  "score": 39,
                  "content": "The Verrukt, and that death had pretty much nothing to do with the weight ratio and everything to do with the people planning and building it having no degrees or certifications in engineering, as well as that ride having a proven history of causing injuries and people flying up into the guard nets. It was a death trap.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 15,
                      "content": "The weight ratio (child-adult-adult) may have played a part in why that particular raft went airborne, but plenty had skyed in testing and there had been other impacts before. The poor kid was particularly unlucky in that all the Swiss cheese holes aligned for him. It was going to kill someone sooner or later though, for the reasons you said.\n\nMad that the two people behind the thing basically got away with it (something to do with improper evidence).",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 410,
          "content": "Doesn't matter if you put up a sign (I'm sure there is one), if someone gets on that's over the limit, it's never the rider's fault, it always comes down on the operator There are more discreet ways of doing it, though",
          "id": 67,
          "comments": [
            {
              "score": 49,
              "content": "Yeah, this is totally fair. I get that it’s a public safety issue first and foremost, there just has to be a solution between saying nothing and public humiliation, you know?",
              "id": 68,
              "comments": [
                {
                  "score": 174,
                  "content": "Most places I've been have scales that everyone has to get on and only show red or green, no numbers (and it's not a big light). There's also usually scales not at the top of the slides that are not \"operated\" by attendants so people can check themselves and there are signs before you get in line with the weight limits (besides on websites before you even get to the park).   The attendants are usually quite good about being discreet about it.  The only time I've ever noticed someone being turned away is because the rider throws a big fit and in those cases, I don't feel sorry for them.  It's not like the weight limit is a secret and I highly doubt they didn't know they were at least close.  It can't feel good, I'm sure, but your life is more important than your ego, you know?  Why bring more attention to yourself?  The rider in this story could have just stepped on quickly, OO would have said it sorry and it would have been over, but the rider drew more attention to herself being difficult about it.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Does it have a big horn and whistle that honk when someone gets a red light",
                      "id": 70,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "That's such a smart solution.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Universal also has some at their water park where you never even know they're weighing you if you didn't know already. The scale is a platform embedded in the walkway. If they think youd be close, they ask you to stand there for a moment as if you're just waiting in line, the operator can see the yes or no but no one else can, and they tell you to go or not. Their raft rides use the light system like you describe too, but they weigh the whole group at once. Both are much better options than singling out and public weight discussions.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Honestly, the best option is \"everyone has to get weighed, no exceptions.\" it's at least less embarrassing if you aren't being singled out about it.\n\nAt least, everyone gets weighed is the policy at the park closest to me. They also have scales at the bottom so if you aren't sure you can check.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 330,
          "content": "Agree with the system being bad, but I think they should just do what every other water park does and just weigh EVERY person and instead of it actually showing their weight, they usually just have a red or green light",
          "id": 74,
          "comments": [
            {
              "score": 61,
              "content": "I think this is the best way. People are always going to get their feelings hurt but this gets to the point without hurting people unnecessarily.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yes. In this case she would've gotten a green light and everything would've been fine. If someone ever gets a red light it's embarassing but I guess it happens way less and the person doesn't die.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I was thinking of setting up some sort of screen so only the staff member could see the weight but that's probably easier",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 231,
          "content": "Public humiliation is definitely better than fucking death are you kidding me?",
          "id": 78,
          "comments": [
            {
              "score": 161,
              "content": "Nothing says safety like expecting a probably minimum wage employee to guess people's weights.\n\nJust weigh everyone. Make the results discrete. Problem solved.",
              "id": 79,
              "comments": [
                {
                  "score": 8,
                  "content": "Yeah that would be a lot better than that person's suggestion of \"just put u a sign\"",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 128,
          "content": "What would your policy be? Enlighten us.\n\nBecause it's well established that \"use at your own risk despite warnings\" is a poor legal strategy. Plus that doesn't cover the risk of the fallout if someone were to get hurt (negative PR, lawsuits even if win etc)",
          "id": 81,
          "comments": [
            {
              "score": 121,
              "content": "Weigh everyone.",
              "id": 82,
              "comments": [
                {
                  "score": 37,
                  "content": "There’s a slide at our local water park that has a maximum AND minimum weight. They weigh every single person and there are signs at the start of the line saying this will happen.",
                  "id": 83,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Everyone gets weighed lol. Yes I'm aware there's a snowballs chance in hell you're over the limit. But policy says we need to check everyone for safety reasons.",
              "id": 84,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 104,
          "content": "> Y’all need to change that policy ASAP.\n\nTo . . . what? Honest question. \n\nWeigh everyone at the top of the slide instead of singling some people out? Or were you thinking weigh everyone on entry to the park and you get a stamp or something that can't be faked if you are light enough for the rides in category A, B, or C? Or what?\n\nI get this sounds super embarrassing. My question is, what is your idea of how to handle the weight limit of the rides. Or is your solution \"just trust everyone is under the weight limit and if they are not and they are hurt, killed, or hurt or kill someone else that's too bad\"? Beacuse even you think the overweight people \"have it coming\" for lying about or being in denial about their weight and it's on them if they get hurt or die, they could cause strain or damage to the ride that hurts or kills someone else. So it's  not even their risk to take, it's a danger to all park goers if the ride is strained or damaged and perhaps no longer safe.",
          "id": 85,
          "comments": [
            {
              "score": 153,
              "content": "Weighing everyone makes much more sense. Not only do you avoid embarrassing individual people, you avoid human error.",
              "id": 86,
              "comments": [
                {
                  "score": 3,
                  "content": "I weigh over 250, people often I assume im 180lbs or so. I dont get it.",
                  "id": 87,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": ">Weigh everyone at the top of the slide instead of singling some people out?\n\nYes, that.\n\nIdk why you wrote all that other stuff when this is a perfectly reasonable solution.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 95,
          "content": "Why can't they install the scale on a point between the slide point and where the people get seperated. So the stop on it as a part of the process and not in front of everybody. The weight display can even be somewhere else. It would be such a small investment but wouldn't piss of the people. They could even make advertisment with \"now better security *rolleyes*\"",
          "id": 89,
          "comments": [
            {
              "score": 43,
              "content": "Some of the newer bigger rides at my city's water park are like this. Everyone steps on the scale and it shows a green or red light.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I was thinking something like this, or even returning just a binary yes/no indicator to the lifeguard/ride operator.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "They might hurt someone else though?",
          "id": 92,
          "comments": [
            {
              "score": 69,
              "content": "Even if they don't physically hurt anyone else: dozens or hundreds of staff and patrons will be traumatized by seeing someone die traumatically.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": ">bypass legal issues \n\nI'd rather bypass inuring a bunch  heavy kids that couldn't be bothered to read or follow the rules",
          "id": 94,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 33,
          "content": "And if someone is too heavy and hurts someone else?",
          "id": 95,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7911,
      "content": "NAH - but next time pull three people from the group and weigh them all \"sorry I have to weigh 10% of the people going by to check we aren't exceeding weight limits.\"\n\nThat way you don't target or embarass one person.",
      "id": 96,
      "comments": [
        {
          "score": 3549,
          "content": "It’s a better approach but not perfect. People aren’t stupid after all.\n\nThere was an American Muslim comedian who had a bit about how he’d be “randomly” pulled out of line by the TSA for extra checks, and they’d pick an old lady and five-year-old to maintain the illusion of “randomness”",
          "id": 97,
          "comments": [
            {
              "score": 1859,
              "content": "my  brown spouse has been 'randomly selected' for additional screening every time he flies since 9/11...except when he flies with me, his white wife.    \n\n\nRandom, my generous white arsecheek!",
              "id": 98,
              "comments": [
                {
                  "score": 234,
                  "content": "Same for mine, not in the US though in the UK. Even when I'm with her it happens here, when I've been with white partners or friends don't think it's ever happened. \n\nHow random!!",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 106,
                  "content": "Same for me for Western EU countries... I wish I was joking. I guess that's what I get from being from one of 'those' countries. How can it be so random that out of perhaps \\~30 trips, there's probably only once that I haven't been pulled 'randomly' into one of those 180 scanner/or and padding? It got better once I changed my passport from my birth country to Canadian passport. Worst experience for me was surprisingly Norway, wonder if they think all Thai women going to Norway is just a mail bride/prostitude or something.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "I flew 104 times in Australia over an 18 month period.\n\nI'm a white man with a beard.\n\nI was randomly screened 102 times, the one flight and return I wasn't I was clean shaven. It made 0 difference who I was flying with.\n\nNowdays I make eye contact with the screening people, wait until they've let and embarrassing amount of people through waiting for me as I slowly pack my belongings back into my carry on, then walk through as they grab someone else. I'm always sure to give them a wink.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "My dad gets stopped at the border when he’s biking with his motorcycle gang-looking buddies. He’s the only dark skinned one. You can’t tell his race (Chinese and French), but the white dudes working the border are clearly racially profiling the short dark skinned guy, and not the huge Hell’s Angels-type guys he’s with. When we go to the airport, my mom (British descent) get “randomly” selected for bomb residue testing. Thought it was weird she kept getting selected, but they must suspect my dad of being a bomber, but they don’t want to make it too obvious by swabbing the POC.",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Yup. I had a friend growing up that had a Middle Eastern last name, and her whole family was white-passing (dad was half Mauritian). They always went to the airport at least an hour earlier than recommended due to 'random selections' that happened every damn time. She was very excited to get married and become a Smith just to avoid this.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I’m got pulled once and I’m a white soccer mom looking lady. They wanded me and asked about gunpowder residue. Without thinking I just said it had been years since I handled a large amount of ammo. I am for more military and was almost always the officer on the range when we had to qualify. I was tripping over myself explaining my response.",
                  "id": 104,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "My tattooed husband almost always gets extra screenings. He can easily have a scary face when he's annoyed and the beard doesn't help. Then they all do the half-assed \"thank you for your service\" when they see some navy themed tattoos",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I’m an Arab Muslim woman with white skin and I don’t wear the hijab for medical issues. I’m never looked at until I’m with a family member wearing a hijab. I always notice people looking at my mom.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I am as white as I can be but I wear a very specific style of clothes that seems to meet the stereotype of drug users. My bag is singled out every time at the airport for additional drug testing, beside one time because I was flying for work wearing buisness clothes.   \nIt really can get annoying.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Yup. Did you also learn to not go before them in passport checks, but with them? It’s so disgusting to witness your partner be treated like a lesser person because of their ethnicity.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 124,
              "content": "The TSA pretend not to target muslims?\n\nI remember people telling me about the \"muslim room\" the black hole where people with arabic names were summoned to, might be out in a few mintues, might be a few days.",
              "id": 109,
              "comments": [
                {
                  "score": 10,
                  "content": "Yes, because legally it's discrimination. The fig leaf matters, otherwise you get spun around by critics like the so called \"Trump Muslim ban\" which flagged travellers from Iran, Libya, Somalia, Sudan, Syria, and Yemen for heighted scrutiny. I mean heightened scrutiny for travelers from countries we bomb seems like common sense to me, but that's politics.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 7,
                      "content": "The fig leaf doesn't matter. There were complaints about targeting muslims and even court cases. \n\nEVen if the complainant wins the government doesn't actually have to do anything about it in practise.",
                      "id": 111,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 107,
              "content": "My mom (who is white) looks vaguely non-white (ethnically Sephardic Jewish) and is often mistaken for anything from Italian to Armenian. She gets \"randomly selected\" by the TSA frequently, even now that she's been cleared for selective programs like TSA PreCheck. When I went through security with her as a child there were even times when I would be \"randomly selected\" as well. \n\nMy dad, meanwhile, is a blue-eyed cishet white man. He does not and has never had TSA Pre. The only time he was ever held up by TSA was back in the early 2000s (post-9/11) when he had one of the first tablets in his baggage and had to show the officers how it worked to prove that it wasn't a bomb. I've never been \"randomly selected\" when traveling with him, either.",
              "id": 112,
              "comments": [
                {
                  "score": 5,
                  "content": "I'm white, blonde hair blue eyes and I'm randomly selected allllll the time, I just plan for it now, ive even been randomly selected for the back room pat down and also had to prove my iPad wasn't a bomb",
                  "id": 113,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "My lily white dad got pulled out along with 6 Muslim men in the TSA line and he went “guess I’m the random part of randomly selected” and they all died laughing",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Yeah I was travelling with a bunch of Australians and 2 had middle eastern heritage. Guess who always got pulled out for random screening. But they also took one of the blonde girls, to make it look ‘random’",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I’m black and had to take my ponytail down so they could search it but did not ask the white people with me to take off their beanies. It was a work trip and i was the only one singled out. It was Denver in January, so most people had hats on.",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "They aren’t stupid, but it gives plausible deniability.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Sometimes having even that sliver of plausible deniability is enough to make someone feel better",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "People will cotton on to what's happening, but at least the targeted person being weighed can feel a little better, having some excuse to hide under, rather than being right out told that they might be too fat.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "While I think that comedian is definitely right, I  get pulled out for random checks when flying (used to do a lot of flying back in the days). By myself or with my partner, it just always seem to happen. Dog sniffers, explosion wipes everything. I am an overweight white female with glasses and always have a smile. Don't know why, but I seem to trigger something in people that makes then pull me aside almost every single time.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 339,
          "content": "Or just weigh everyone they could install it under the path and just have an indicator of red or green, so the weight isn’t actually displayed to anyone and everyone has to go across it.",
          "id": 121,
          "comments": [
            {
              "score": 150,
              "content": "I worked at a water park with one of these rides and that's exactly what it was. The riders stood on it while we loaded the ones before them, and if it turned red, they couldn't ride together. (2 person slide with a single rider option above a certain weight, if you stood on it alone and it didnt turn green you couldn't be a single rider)",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 180,
          "content": "That’s a really kind and considerate approach!",
          "id": 123,
          "comments": [
            {
              "score": 52,
              "content": "Aside from all those times I'm TAon reddit I'm a pretty considerate person :)\n\nHave a good night!",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Honestly it's a shitty policy that places the burden on the employees and then penalizes them for actually following it. \n\nShould have a (couple) digital scales at the start of the ride and ask everyone to walk onto them, no different than a height check on most coasters, before letting anyone into line. \n\nNTA, the theme park is for having shitty wishy washy employee guidelines and supes for having the garagntuan brass balls to actually confront employees over shit policy.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "That's a good one. Weight the whole group, but make sure to keep the result hidden from anyone else.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4303,
      "content": "NAH. \n\nBut you should suggest to the waterpark that EVERYONE gets weighed before they enter the slide. Every single person no matter what they look like. Having you guess who does and does not weigh 250 pounds puts you and others in an uncomfortable and embarrassing situation. \n\nWhen I weighed over 200 pounds I didn't look it because of the shape of my body and height. Visual guesses on weight are inaccurate and again, can create embarrassing situations.",
      "id": 127,
      "comments": [
        {
          "score": 943,
          "content": "or just have it set up in a way where only the lifeguard/employee can see the numbers.  or do it at the park entrance and give everyone that gets the OK a wrist band/stamp",
          "id": 128,
          "comments": [
            {
              "score": 555,
              "content": "These are all great suggestions but I really doubt that OP has any power over these kind of suggestions. I work customer service and honestly the company sees us as grunts. We don’t have any control over these things hell even our managers don’t, it’s all up to the company/head office. It’s pretty much the same in any customer service job. \n\nOP I would recommend saying these ideas to the customers who get (rightfully) upset and tell them who they should email. Generally companies listen more to customers than staff",
              "id": 129,
              "comments": [
                {
                  "score": 215,
                  "content": "Its funny seeing people think a young ride operator can make any decisions on procedures on probably a location belonging in a massive international conglomerate.  Good idea to get customers to suggest it but wouldn't bet on anything happening any time soon, unless they can do it for free, they won't change anything so long as its lawful",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yeah these are all great comments in hindsight. None of them addressing the actual thing that happened",
                  "id": 131,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "or not even have numbers, get a scale that goes green if ur under, red if ur over.\nhave it be something BEFORE u ever go up stairs",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "No one should see the number. It should be a yes or a no.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 372,
          "content": "Yes, and instead of showing the weight just have a red light/green light system.",
          "id": 134,
          "comments": [
            {
              "score": 185,
              "content": "This is the way. \n\nI was in the bahamas at a water park and they had everyone just step on a platform that lit up red or green. Problem solved",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 136,
          "content": "Id say NTA because the theme park and management are the assholes for putting their guests and employees in this situation. \n\nWeigh everyone is the right way to go. \n\nI'm a 5'8\" Indian dude who by white people standards might as well be an elf for how I'm built (lean but muscular). But I lift, and weigh considerably more than my profile suggests (I've had more than a few \"no way, can I try and pick you up\" with good friends and then they suddenly are on the verge of blowing out their backs) so I am totally sympathetic to the idea that using visual cues to identify weight is a bad call.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "I am literally almost 300 lbs and people are surprised when I tell them so. They think I’m 200 at most. A lot of my weight is carried in my legs, thighs, and butt I think but still. I would 1000% rather be embarrassed for a few seconds than to injure myself or others. But I agree that everyone should be weighed regardless of what weight they appear.",
          "id": 137,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Better idea:  PUT A SCALE ON THE APPROACH TO THE RIDE and have people come on 1 at a time.  These slides always have some kind of staircase or path that you have to climb to get to the top.  Restrict the staircase to single file and put a scale on one of the stairs.  If you don't have a reading for someone weigh them before you let them in.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "This is it. People often don't \"look\" their weight, because muscle mass vs fat % vs many many other factors. It's not only uncomfortable to have an employee guessing who to weigh, it's also dangerous. \n\nWeighing everyone removes human error from the safety equation, and also prevents embarrassing and harmful situations like this one.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "That’s actually how they do it at the Rapids in South Florida, they just weigh everyone. Doesn’t matter if you look like you’re 50 pounds or 250, but that’s not how it used to be. They used to single people out that looked overweight, so I’m assuming too many people got angry and they changed the policy.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "the green light instead of numbers is genius.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "100% agree with suggesting this change. I've worked at our local zoo where we have a zip line and ropes course, and our policy is that everyone gets weighted (we have a minimum and max weight for both) so there is no bias or need for embarrassment. We haven't had guests complaign yet about our policy.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2456,
      "content": "Y’all just need to weigh everyone or no one. The eyeball system is dangerous for all involved. But NTA, you were just trying to do your job and keep the guests safe.",
      "id": 143,
      "comments": [
        {
          "score": 312,
          "content": "They do this at the water park near me. They even weigh super thin children that are barely talk enough to ride.",
          "id": 144,
          "comments": [
            {
              "score": 127,
              "content": "It’s the only failsafe way to run the slide.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "> They even weigh super thin children that are barely talk enough to ride.\n\nYou wouldn’t believe how many of the little shits have gold-plated uranium skeletons.",
              "id": 146,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Weighing noone is an appalling idea.",
          "id": 147,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Yeah no seriously. I weigh over 250 pounds but don’t look over 200, because I’m muscular. I would be at risk on this water slide but not be weighed because I don’t visually look it. That’s a huge hazard. Weight distribution is different on each person. Hell, I weigh as much as my mother but I’m multiple sizes smaller than her.",
          "id": 148,
          "comments": [
            {
              "score": 5,
              "content": "Exactly. Estimating weight is so inaccurate, just a terrible safety check.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1290,
      "content": "NAH You were just doing your job, but holy cow, what an awful policy! It should either be weigh everyone or no one. Making you go up to random people and asking them to get weighed is a good way to get you yelled out by other people for doing your job. And that poor girl who is now probably going to be spending a lot of time wondering why you thought she looked 250 lbs, even if she's nowhere near it.\n\nAnd how many people over the limit have you sent down because they don't look over the weight, but it's because they are very muscular or just carry the weight in a way that makes them look lighter than they are.\n\nYou aren't the asshole, but this policy is",
      "id": 150,
      "comments": [
        {
          "score": 509,
          "content": ">And that poor girl who is now probably going to be spending a lot of time wondering why you thought she looked 250 lbs, even if she's nowhere near it.\n\nRight? A teenager feeling publicly humiliated because of their weight is bad. I'm guessing by the teenager saying \"see\" that the 250 lbs was either said to be the limit or written somewhere. NAH of course, it just sucked that it happened to the kid.",
          "id": 151,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 348,
          "content": "Also waiting until they get to the top is a horrible system. Imagine having to wait in line only to get turned away at the top and have to walk all the way back down. It's humiliating and a waste of time.",
          "id": 152,
          "comments": [
            {
              "score": 150,
              "content": "I remember going to Six Flags with some friends, and when you got towards the top, the line broke up into where on the ride you wanted to sit. When it was finally my group's turn, we found out I was too big for the seat, but the attendant told me if I was willing to go through the whole line again, I could use one of the larger seats instead\n\nI just remember feeling so embarrassed by that, and the fact I found I'd have to wait in the line again (especially since that actually was our second time in line--the ride had temporarily shut down earlier that day) was just an extra slap in the face",
              "id": 153,
              "comments": [
                {
                  "score": 9,
                  "content": "They should have a test seat near the queue for the ride. If the ride has different sized seats it will be one of the bigger ones. If it's a tight fit but you want to go for it, you might need to flag down an operator and ask them to guide you to the row with the larger seat.",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "You shouldn't have had to go to the back of the line. What do they think the point of lines are, you already waited for your turn.",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "Ahh god… that’s a great point. I was underweight as a teen, but had huge body image issues, and my best friend was quite short and overweight, and just remembering how we often awkwardly navigated through daily life… I cannot imagine how that walk back down the stairs, through the upcoming line, possibly even trying to make your way by people with an inner tube, would feel. There are people that would probably be really cruel little assholes that you’d have to walk by, too. Makes my stomach knot up just thinking about it.",
              "id": 156,
              "comments": [
                {
                  "score": 7,
                  "content": "If that had happened to me as a teenage girl, I wouldn't have had to worry about walking back down the stairs- I'd have flung myself off the tower or just dropped dead from the sheer humiliation (body image issues + social anxiety + a rare disease that caused me to be overweight = one hell of a bad time). Just imagining it makes me want to cry.",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "That might be somewhat unavoidable (especially if weight limits are different per waterslide/ride). You're already paying an operator to stand at the top and supervise guests, it would increase operating costs significant if you needed a second employee at the bottom weighing people. I'm trying to think of a safe way to leave the scale unmanned but you know people would cheat.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Second this. My bf is overweight but he isZ tall and ex athlete so with the right clothes he doesn't really look overweight. Every amusement park we have ever been to had the same policy of weighting only those that look like they need it. At this point he either offers himself to be weighted or sits aside. But he is not a teenager and he has accepted his current weight situation, not everyone feels the same. \nWeighting everyone works better well, for everyone. \nI'll go with NAH.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 706,
      "content": "NTA. People have died on water slides, it’s better to double check. You weren’t doing it to be mean, you were just making sure. I’m sure it was embarrassing for her, but it would be even worse if you didn’t check and she was injured.",
      "id": 160,
      "comments": [
        {
          "score": 299,
          "content": "But is the girl an AH?\n\nIf I were in her shoes I'd be embarrassed.\nSure the attitude wasn't polite, but what teenager wouldn't mouth off in that situation.\n\nIf anyone's an AH, it's the parents.",
          "id": 161,
          "comments": [
            {
              "score": 277,
              "content": "She probably went home and cried due to embarrassment (lord knows I would have had a brave face until I got home and would have balled my eyes out to my mom). Parents probably just saw it as a dog shit policy (like seriously, just weigh everyone?) and got mama bear about it.",
              "id": 162,
              "comments": [
                {
                  "score": 55,
                  "content": "*bawled \n\nOtherwise you’re dribbling your eyes like a basketball",
                  "id": 163,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Or you took a melon baller to them.",
                      "id": 164,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 112,
              "content": "[deleted]",
              "id": 165,
              "comments": [
                {
                  "score": 37,
                  "content": "The owner is definitely the only AH in this situation.\n\nAnd a huge AH at that.\n\nHe has a crappy policy that puts his employees in this bad situation, and humiliates customers.\n\nThen he berates his employee for following the policy.\n\nThe owner is an absolute piece of work.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Just FYI Op is a woman.",
                  "id": 167,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "The waterpark is the asshole, for not having a better policy, like weighing everyone and not putting the burden on their employees to guess when someone is close to the limit when guessing weight by visualization is not at all accurate.\n\nEta: They are also the asshole for making their employees pull people aside to weigh them based solely on their own judgement, then pull them in for a reprimand when someone inevitably gets offended that the employee is doing exactly what they were told to do.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "The person that made the policy is the asshole",
          "id": 169,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 626,
      "content": "NTA but the scale should only have two readings: can ride and can't ride.\n\nThe numbers should be invisible and everyone should step on the scale.",
      "id": 170,
      "comments": [
        {
          "score": 123,
          "content": "That would honestly be the fairest possible system.",
          "id": 171,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "We had this at a water park I worked at. The rule was the weight of the overall guests couldn’t be over 500lbs. The indicator would turn red or green depending on if the group was okay to ride",
          "id": 172,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "But the issue is wether you get asked to be weighted or not. Here the actual weight wasn't the issue, what embarrassed her was that OP estimated she might be around 250 pounds.\nNAH, is not a good way of dealing with the matter, but it's policy and you were not mean.",
          "id": 173,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Yeah I went to a water park once a couple years ago, and that’s how they did it. And it was one of those multi person inner tube rides so 2 or 4 people would step on the scale. Nobody was singled out. I figured every water park did this so you aren’t embarrassing anyone.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "1000%\n\nJust get someone handy to take a consumer grade scale apart and paint the dial red/green.\n\nObviously they should check that its still calibrated correctly after modifying it.\n\nAlso if they can find one that reads out quickly and doesn't bounce around much you could probably weigh everyone while waiting for the first group to get far enough down to go.\n\nIdk how brave you are or if you think the park manager is open to suggestions like this but I'd email the idea to them.",
          "id": 175,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 521,
      "content": "Info: how much did she weigh. That has a HUGE bearing. We’re you 20 lbs off, 80 lbs off…?",
      "id": 176,
      "comments": [
        {
          "score": 355,
          "content": "So far no reply to this key question. I'm guessing at least 50 lbs off.",
          "id": 177,
          "comments": [
            {
              "score": 180,
              "content": "If it’s 50+ off. It feels malicious imo.",
              "id": 178,
              "comments": [
                {
                  "score": 353,
                  "content": "OP admitted that it wasn't even close to 250 and that their boss laughed at them when hearing how far off the number was, so I'm guessing that it was at least 50 lbs off.",
                  "id": 179,
                  "comments": [
                    {
                      "score": 61,
                      "content": "If guessing people's weight is part of their job and OP sucks hard at it, they might want to consider a different job.",
                      "id": 180,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "human density changes drastically\nim 6'1 thin and weigh 210\n\nmy coworker whos 5'7 and has the aame waiste size is also 210",
                      "id": 181,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 253,
                  "content": "lol you know the girl was like 135-150 for sure",
                  "id": 182,
                  "comments": [
                    {
                      "score": 28,
                      "content": "There's no way someone mistakes 135 for 250 unless they're completely incapable of estimating. I could see 200 for 250. Some people's body shapes really hide or overexaggerate \"excess weight\" and as you get higher, the margin of error does seem to increase.",
                      "id": 183,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 146,
                  "content": "I weigh more then 100kg (220 pounds) but I don’t look like it because of my height and body shape.\n\nSome friends who weigh less, look bigger then I do.",
                  "id": 184,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I was going to reply exactly this! I'm 5'10 and look nothing like 220. Maybe 185 on a good day, I'm not even kidding. My sister used to play a lot of sports and looked *amazing* , but her BMI was over 30 because of her muscle mass. Absolutely everyone should be weighed for this ride, imo.",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Precisely. She could look bigger because she's on the short side too",
                      "id": 186,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 44,
                  "content": "Based on what? OP emphasized many times how bad they are at guessing.",
                  "id": 187,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "I know I couldn’t tell the difference between 200 and 250 lbs, especially if the person in question would be considered obese at either weight.",
                  "id": 188,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 58,
          "content": "As I’m not from US I had to look up how much 250 pounds is in kg. I was kind of thinking like 80-90 kg, that’s a weight that is somewhat hard to visualize (I’m 183 cm and what one would probably consider “slim” and I weigh 76-78kg, which surprises people a lot, so I can see how misleading it can be). But god damn, 110 is really not the weight one can be mislead about. And he said that he sometimes does weigh people, so it’s not like he has no way to grasp it, more or less. \n\nWhat I’m trying to say is that it feels malicious. Not a full blown YTA, but it feels like a mean thing to do",
          "id": 189,
          "comments": [
            {
              "score": 60,
              "content": "I fail to see how somebody could even be a mild TA here just for having issues guessing people's weight. It's a learned skill, and he's bound to make mistakes until he gets a feel for it.",
              "id": 190,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 42,
              "content": "She. Op is a woman. And, while it may not seem like it when you look at the sheer numbers, different people carry weight differently. OP said the girl “most likely wasn’t over the limit” but she couldn’t be sure. And in a situation like that, where a wrong guess can lead to serious injury and even death for multiple people, it’s best to check. Better to be wrong and suffer some hurt feelings, then to be right and put her and other people in danger.",
              "id": 191,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "I was 250ish at my heaviest and it’s morbidly obese. It’s not a weight you can not obviously identify as being an issue. It’s not just a little chunky on a female.",
              "id": 192,
              "comments": [
                {
                  "score": 210,
                  "content": "Yes and no. Women who are tall and curvy can \"carry\" a lot more weight than people realize.",
                  "id": 193,
                  "comments": [
                    {
                      "score": 92,
                      "content": "This. I’m tall and carry weight well and people routinely misjudge my weight to be under what I am. My ex was 260 and no one thought he was. People thought he weighed 210 max but he was just so much dense muscle mass that ppl were Literally 50 pounds off",
                      "id": 194,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "My sister and I look very similar except our weights.  I’m visibly heavier than she is both around my waist and my curves, but nobody so far has guessed the difference between us is as high as 50lbs.  They usually put it it closer to 20-30lbs, especially if we’re not standing right next to each other.",
                      "id": 195,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 97,
                  "content": "It's not that easy, I'm 250lbs just now and I'm certainly not morbidly obese. Weight isn't just a body fat issue, taller people weigh more than short people. Muscular people can weigh more than 'overweight' people. My point being that this policy is god awful, there's no chance you can accurately judge bodyweight just by looking at someone. The waterpark put the staff in a no win situation, whole thing needs revised. \n\nIn my opinion OP isn't the AH even if they were wrong.",
                  "id": 196,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 63,
                  "content": "I'm a 6' woman and around 225lb, am I fat, yes. Would I get harpooned? No. Pics on my profile, most people think I just look curvy. When my weight is lower I just get less curvy lol",
                  "id": 197,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "It really depends on height.  If she was under 5'5\" or so she could look very obese and be nowhere near 250lbs.  Likewise, a man who was 6'3\" might not look like they're carrying a ton of extra poundage and hit that number fairly easily.  That's not even getting into muscle vs. fat density if the person hits the weight room with regularity.",
                  "id": 198,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "The post itself points out that's not true. Two people who are about the same size can be drastically different weights, especially when it's two people who look chubby because you don't see the muscle mass or lack of under the padding. On tall people it's even harder to judge because they have more space to carry the weight (both muscle and fat).",
                  "id": 199,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "It depends on build. Taller women, especially with wider hips and smaller waists, would be harder to ballpark.",
                  "id": 200,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Op is a she, weighs 185 and wears a size 6. When I was 195, I wore a 12-14 and I'm 5'8. To put it into reference, I currently weigh 120 lbs and I'm a size 4. I'm not saying it wasn't mean, but I'm saying that op's weight/size ratio is so confusing that I'd probably struggle guessing too if they're being honest. I'd typically guess someone else's weight by comparing it to my body if asked so if op asked me and they looked like a size 6, I'd guess around 140 lbs. It sounds like an accidental fuck up to me but a fuck up nonetheless.\n\nNTA because you're just concerned for her safety but maybe keep in mind her weight and size before weighing someone so hastily next time.",
              "id": 201,
              "comments": [
                {
                  "score": 3,
                  "content": "At 185 I was a 10/12 and I’m only 5’3, just to add another layer of confusion to estimating women’s sizes.\n\nThe park’s policy is stupid.",
                  "id": 202,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 37,
          "content": "I'm curious if she ends up being like, 135 lol and that is considered overweight and needing to be weighed.",
          "id": 203,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "I also feel that the question regarding the teenagers height should also be answered, height also affects weight distribution, possibly throwing OPs perspective off.",
          "id": 204,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "I’m going to guess she was 160-170 and in the “overweight” category. OP should learn the difference between someone who looks a little chubby and is overweight versus someone who is morbidly obese.",
          "id": 205,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 250,
      "content": "Info- how far off were you? I get that the water park has policies but also if you were ridiculously off then you made a bad call and probably negatively affected a young person's self image. I don't think you had ill intent but if you were far enough off I would say you were an ass for wildly incorrect.",
      "id": 206,
      "comments": [
        {
          "score": 307,
          "content": "A policy that requires a near minimum wage person, who is a teenager to early 20s, to be a good judge of some one’s weight on eyeball alone is a bad idea. \n\nEven if they were very off, they are certainly neither trained, experienced, or paid enough to be an expert at this.",
          "id": 207,
          "comments": [
            {
              "score": 44,
              "content": "I'm not saying its a good plan. But if this girl was like in the 100s I don't blame her parents for being upset. There is a basic standard of awareness that I think it is ok to expect. I'm not saying OP should burn in hell but if they were very off I do think they could have been a bit of an ass",
              "id": 208,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "A near minimum wage young person *who is actively being told off for being cautious*. Doesn't take a genius to realize the odds of someone over the weight limit getting a pass at some point is a near certainty. If it's that big a deal. Reminds me of a job where we were all supposed to tell the guests to not take photos with flash at a particular spot when the physical setup virtually guaranteed that they would. Thanks for setting us up for success there!\n\nIf it's actually worth worrying about, it's worth weighing *everybody.*",
              "id": 209,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "She didn’t guess her weight tho. She thought the girl was most likely under the limit, but she couldn’t be certain. And if there’s one thing she was definitely told in training, it’s “better safe than sorry.” Because her judgment could be wrong and a bad judgment would cost her the girl and the water park.",
          "id": 210,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 209,
      "content": "Why didn't you post what her actual weight was? I'm curious as to how far off you were.  Since your boss commented on how far off you were,  this could be indicative of whether you have the skill to even do that job. \nIt also shows that relying on people who have bad judgment might not be the best policy. There needs to be a test for employees.  Or everyone gets weighed.  \n\nNo judgment until I get more info.",
      "id": 211,
      "comments": [
        {
          "score": 94,
          "content": "Agreed, OP is in a no win situation here. If she genuinely struggles to gauge weight she shouldn't be doing that part of the job. She will either continue to hurt kids feelings or risk causing serious bodily harm because she has been ridiculed by management for being wrong.  \n\nAlthough I disagree in that, even if she was drastically off I still don't think OP is the AH. Assuming it was a genuine error, she was following protocol as instructed, the boss and the water park management are the assholes.",
          "id": 212,
          "comments": [
            {
              "score": 82,
              "content": "im sorry but screw kids feelings, when i was young i was a pudgy kid in my teens i started lifting weights and so i looked a little less pudgy but i didnt look like i lifted either, i weighed around 115kg(253lb) and my sister weighed about 60kg(132lb) any way i went to the water park with my sister we went on a slide where the only way to go was with a double ring(2 People) this slide was basically giant vert ramp(u shape) where you went down one side slided up the other then slide down and off  into the pool at the bottom i watched and most people only made it about half way up the other side of the slide, i didnt see the warning sign about the max combined weight being 150kg, because i didnt look overly fat i didnt get weighed. any ways when we went down the slide we made it up to the other side of the slide and hit the lip that was on the other side of the slide. i thought oh shit we are going over it was the most terrifying thing i have ever experienced, for the rest of the time at the water park i asked the person who was supervising the slides if there was a max weight limit because i was so scared that it was going to happen again. i would prefer the feeling of being singled out for a weight check than experiencing fear of going off the other side of the slide",
              "id": 213,
              "comments": [
                {
                  "score": 23,
                  "content": "I get your point, I am also a heavy lad. I still think there should be some care given to kids feelings, I never struggled with bullying personally. Nothing people would say would get to me but I have seen first hand what a body image complex can do, a friend of mine went from perfectly healthy weight to hospitalised because she was relentlessly bullied. \n\nI think the best solution here is to ditch the finger in the air approach to safety limits and start weighing everyone before they queue.",
                  "id": 214,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}