{
  "post content": "My (39f) daughter very recently had her 17th birthday. My husband (42m) and I told her to pick out a restaurant that she'd like us to take her to for her birthday.\n\nShe chose a seafood restaurant that we'd never been to. In looking over the menu I saw that the vast majority of the dishes contained shellfish. There were a few fish entrees, as well as some surf and turf. But there were only a couple of non-seafood dishes.\n\nOur son (15m) is deathly allergic to shellfish. He also can't stand fish. There were only a couple of dishes there that he could actually eat. I didn't want to take him there because I knew that he wouldn't really enjoy his meal and I was worried about cross contamination.\n\nI told my daughter that this restaurant wouldn't work and that she would have to pick out a different one. My son said that he would be fine just staying home; that we could use the money that we would have spent on his meal to just order him a pizza instead. My husband also insisted that since it was our daughter's birthday that she should be able to choose the restaurant, and that our son would be fine home alone with pizza and videogames.\n\nBut here's the thing; we can only afford to go out as a family every so often. When we splurge on a restaurant meal, I want BOTH of our children there. I insisted and my daughter chose a different place and we had a nice meal AS A FAMILY. But she is still a little salty that she didn't get to have her first choice of restaurants.\n\nMost people I've asked say I'm wrong. But, again, we can only afford to go out every so often. Is it so wrong that I wanted to do it as a family? My daughter still had a nice birthday meal.\n\n&#x200B;",
  "id": 1,
  "comments": [
    {
      "score": 40792,
      "content": "YTA for a lot of reasons. First, if you were going to put parameters on her choice, you should have told her that beforehand. Second, you seem more hung up on the fact that your son wouldn’t like the food than his allergy. Your son’s preferences are irrelevant. This is your daughter’s day. He seems to understand that, but you don’t. Third, if you were really concerned about cross-contamination, you could have called ahead to discuss your concerns and see what precautions the restaurant would be willing to take. If that isn’t satisfying (which would be perfectly understandable), your son offered to stay home. \n\nI get that you want to have a family meal, but all you have done is tell your daughter that she is not worth individual celebration. This could have been a great opportunity for you and your husband to have individual time with your 17-year-old— a rare opportunity. Instead, you squandered that, created unnecessary conflict, and possibly formed resentment between your daughter and her brother.",
      "id": 2,
      "comments": [
        {
          "score": 19571,
          "content": "The son clearly would've preferred a night alone with pizza and video games, so I highly doubt his sister is going to resent him. She will resent OP for sure, and the son may resent OP too, but if anything, OP has shown both of her kids she doesn't care about their wants/choices.",
          "id": 3,
          "comments": [
            {
              "score": 8608,
              "content": "I remember being a teen and being happy to have time to myself so I could play xbox by myself with no one around.\n\nETA: appears a lot of people are assuming I was a teen boy. I wasn’t I’m a woman and was a teen girl, my parents didn’t let me play GTA when they were around.",
              "id": 4,
              "comments": [
                {
                  "score": 3573,
                  "content": "I just wanna shit with the bathroom door open, like i did when the kids went to school and there was nobody but me and the pets home.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 693,
                      "content": "I totally get this.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "The cat still accompanies me. Even if I close the door, cat paws under the door, scratching, meowing.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "My kid is still little so he just toddles in and out. I miss being able to close the door.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I've found that this is the fastest way to ensure someone unexpectedly comes home early. The amount of times I've hurriedly crab walked to close the door because I heard someone come home is kind of ridiculous.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1474,
                  "content": "Yep OP is TAH. My brother had to go to occupational therapy a lot as a kid and I fucking relished the time after school where I could make snacks and watch tv I wasn’t supposed to watch. It was quiet me time. When I got stuck going with him and my mom for his appointments and had to basically just sit and read my book or do homework I hated it. My mom would take us to McDonald’s because my brother loved it, but I also hated that and now I have a bad association with McDonald’s as an adult beyond hash browns and nuggets. \n\nKids are fine being left to their own devices if they’re old enough and it sounds like OPs son would have been just fine chilling at home. \n\nAlso Jesus Christ just call the restaurant and tell them one of your kids has a seafood allergy. It’s not ideal but I would bet a lot of restaurants can accommodate for this as a lot of people have this allergy. They might be annoyed but whatever?",
                  "id": 10,
                  "comments": [
                    {
                      "score": 465,
                      "content": "Accommodating an allergy is NOT the same as totally preventing exposure. My friend with a shellfish allergy tries to make a reservation at our restaurant since only a portion of our menu is seafood. As a friend..I suggested a different restaurant.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 249,
                      "content": "I’ve worked at a seafood restaurant. We had people that could only eat the chicken come in and it has been fine. But damn, if I was deathly allergic idk if I would trust the kitchen myself. ",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "For real. How many times as a teenager did we get the house all to ourselves? Rare indeed.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "As someone with a bad shellfish allergy, there’s not that much the restaurant can do if virtually everything on the menu has shellfish. I wouldn’t trust it. It’s just the nature of the allergy. I don’t want to end up like the Disneyworld lady. \n\nHaving said that, this lady is YTA for all the reasons described above.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Agree with most of this. But since it sounds like it’s primarily a seafood restaurant, accommodating is likely much harder than another type of restaurant. Calling ahead to see what type of protocols they have to reduce risk of cross contamination (in this setting highly improbable to fully prevent) to make a decision would be reasonable. Based on their answer and son’s offer, he could have just skipped out this once and then do cake together at home.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "A literal seafood resturant cannot be expected to accomodate a shellfish allergy. The risk to is just to high they would be 100% right to say its no, they cant.   \nOp is still YTA though because the brother could have just stayed at home and he was happy to do so. this isnt about OP it is about their daughter.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 894,
                  "content": "I am currently the mom of a five year old and having the house to myself to play video games for an evening sounds like heaven.  Having my own pizza sounds too good to be real.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 674,
                      "content": "Last summer I was pregnant, suffering from insomnia and acid reflux, and couldn't bear to sit in a car for hours so my husband took the kids (18 & 10) on vacation while I stayed home. \n\nThe amount of time I spent playing games on my computer over that week was more than I've spent in the last 10 years.i also got to eat whatever I wanted. It was amazing.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 351,
                      "content": "My 5-year old daughter's getting shipped to her grandparents for spring break tomorrow, so that's pretty much my plan this weekend. Dreamlight Valley because I'm a child cosplaying an adult.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 215,
                      "content": "A whole cheese pizza, just for me",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "My boys are 17 & about to be 15, I still remember my husband taking our eldest to a Halloween party when I was pregnant with our youngest. Putting away the clothes I'd washed earlier & toys took five minutes if that. Then the freedom & bliss of doing something uninterrupted when I wasn't too tired to enjoy it. My husband is & always has been great with the boys. But when hecwas in the Army he was away alot. Thankfully training exercises & courses not active duty. He did plenty of that before we got married though.. But that break really recharged my battery & was much needed. Just as the one on one daddy & son time was for my hubby.  And children need that one on one time with a parent or when they have siblings parents AND that alone time as teens.\n\n\nOP ignored everyone else & went with what she wanted. Instead of the bliss of being home alone eating pizza & playing video games for her son. The parents & daughter time, which given OP wanting meals out to always include ALL the family, probably hasn't happened in 15 years. Then the daughter picked where she wanted to eat & was denied, which must hurt. Especially when it's only OP preventing it...",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "The thing I missed the most after having a kid was time alone in my house.  Definitely a rare thing.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "My kids (10 and 5) recently had midwinter break and my parents took them to a Caribbean resort with them. My husband decided that since they were gone, he was going to take an impromptu trip to Japan. I opted to stay home with the cats. It was INCREDIBLE. Everyone I talked to about my break plans was at first like, didn't you want to go with them? And I was like NO I'm going to READ and WATCH MOVIES that no one but me wants to watch and cuddle with my cats and drink tea, and NO ONE CAN ASK ME TO GET UP TO GET THEM MILK OR HELP THEM WITH THEIR HOMEWORK. And the response was always OMG I want that, too. It was absolutely the vacation I needed.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 167,
                  "content": "Play games with obnoxious music turned up loud! Ah, what freedom",
                  "id": 24,
                  "comments": [
                    {
                      "score": 110,
                      "content": "I remember the first time I was left home alone for an entire weekend. No work. No school. Just me, the door wide open when I used the bathroom, the Wii, the ps3, snacks and pizza money.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 64,
                  "content": "I’m an *adult* and I love the time I get to myself to do whatever the F I want (I work and have a toddler. Proper alone time is challenging to fit in sometimes).",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Being alone at home as a teen was so fun! Just being able to chill and do some stupid shit!",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "How much do you want to bet the son and daughter had already discussed it and this choice was so that he COULD have an evening of uninterrupted gaming while sis got a dinner with the parents. OP is TA.",
                  "id": 28,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Heck, I’m a 60 year old woman and I would like the house to myself to play video games, but my husband is always around. For the love of God, man, go play a round of golf and go for dinner with your friends. Sigh.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 916,
              "content": "Pizza, videogames and no parents/siblings around is heaven for a 15 year old. \n\nOP is being selfish because it's all about having a meal as a family because that's what OP wants, not her daughter's birthday",
              "id": 30,
              "comments": [
                {
                  "score": 213,
                  "content": "OP was selfish over shellfish.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Shellfishness",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "Take my upvote, with just a slight roll of my eyes.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 132,
                  "content": "OP ruined the night for both her daughter and her son 😒",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "Almost certainly, the daughter did not feel special or valued or celebrated and that's why she is still salty. This was supposed to be about her birthday and mom insisted it be about the family. If you want to sabotage the family aspect make a kid give up what is supposed to be special about their birthday and sacrifice that thing to the family.",
                  "id": 35,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 391,
              "content": "My mom has always clearly favored my sister. I resented my sister for years because of it. Now that I'm older, I realized my sister wasn't the one at fault & I put the blame where it belongs. As a teen, my brain & emotions didn't work together though, so all the animosity was focused on my sister because she was the one receiving the special treatment.",
              "id": 36,
              "comments": [
                {
                  "score": 184,
                  "content": "My Mom favored my sister as well, but my sister enjoyed it and they used to gang up on me constantly when I was a teen. They're both dead now and I barely grieved. I was emotionally dead to the feeling of loss of them. That shit fucks you up for your entire life, and it's not even a conscious thing. You shut down to protect yourself.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 16,
                      "content": "That sucks so much, I’m sorry they ganged up on you. I hope someday you find a way to open back up to your own life and that it isn’t as painful anymore. There’s so much nuance to being a sibling, but I don’t blame you for barely grieving. Grieve your own lost time.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Same with me except it was my father instead of my mother. His death was a huge relief for me. After 32 years I didn’t have to deal with him ever again",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 232,
              "content": "One time might not cause resentment but I’m willing to bet this mother chooses the son in the most cases for all the same reasons she did above. And that will absolutely build resentment",
              "id": 40,
              "comments": [
                {
                  "score": 29,
                  "content": "It actually kinda sounds like the son is getting pretty sick of it. All *he* wanted was pizza and video games, and mom wouldn't even allow that. I imagine he feels suffocated. I'd like to believe the two kids are okay with each other and see that it's their mother causing the problems.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 222,
              "content": "The resentment comes from having to choose a restaurant that she didn’t want to go to on her birthday just to accommodate her brother, even though her brother doesn’t want it.",
              "id": 42,
              "comments": [
                {
                  "score": 9,
                  "content": "Exactly this. OP is only concerned with her own selfish interests, not the interests of her kids. The son and father are probably placating to stay out of her crosshairs. It’s sad.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "You’re probably right. I hope you are.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Son wants to be alone with Pizza and videogames. Daughter wants to go for seafood place. Husband is ok with this. OP- \"Nooooo, this is not ok, Lets spend time together as a forced family so that nobody gets what they really want.\"🤦🤦🤦",
              "id": 45,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "I remember when being a teen, I didn't like doing stuff that my 4 year younger sister liked doing. I would always prefer to stay at home doing my stuff than going with her (& my parents) and my mother used to make a big scandal about it. I still stayed home.\n\nAnd when I was going out with friends and the like, she used to try to push my sister onto us, often succeeding and messing up our plans.\n\nEven if I didn't get along with my sister very well, if there is something that really, really, really really pushed us apart as teenagers, it was that, having my sister pushed into my activities when I didn't want to.\n\nSo yes, this attitude by OP will never get a \"closer family\" but drive them apart if she pushes for it. YTA",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "The \"AS A FAMILY\" in all caps is what's sending me. Nothing like strong-armed, mandatory family time to endear your children to you!",
              "id": 47,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Reminds me of all the people who come here wondering if they're wrong for bringing their kid to a wedding- they almost never mention how the kid in question feels about going. The one post I remember that did was like the son here, the kid understood the situation and was fine staying home.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1229,
          "content": "All of this. And also this part irked me, as it always does in these situations: \n\n> There were only a couple of dishes there that he could actually eat.\n\nI can always tell someone doesn't want to do something based on how they frame it. There only needs to be one dish that works for your son, unless he'll be eating 5 entrees for some reason. This excuse reeks of \"I don't want to eat there so I'm using my son as an excuse.\"",
          "id": 49,
          "comments": [
            {
              "score": 648,
              "content": "This.\n\nI have a child with an extremely serious food allergy. As long as there is something on the menu she can eat, even if it is not preferred, then that is the restaurant we go to. Your family's economic condition is not your daughter's problem. That is your problem. \n\nOP, you are a MASSIVE YTA. Do you honestly not think your daughter will resent you for this? She clearly likes seafood. She chose this restaurant because SHE wants to try it on HER birthday. Its not the family's birthday. Its her birthday and there WAS something her brother could safely eat on the menu. So, you have the birthday girl, the one person who the day is supposed to be about, once again changing plans to make life more comfortable - not safe, but more comfortable - for the person in the family who life pretty much revolves around. The reason she will resent you is because this is clearly a pattern of behavior on your part -- she is expected to set aside her own wishes for the convenience of others.\n\nAs a teen there are precious few times in life they get agency to make a choice like what restaurant you go to. It sounds like that is the family tradition - the birthday kid chooses the restaurant - and once again you robbed her of HER choice to make HER decision based upon HER preference to make someone else happy at HER expense. Is this really the lesson you want to teach her? Because once again, you taught your 17 year old daughter that her wishes do not matter and someone else's wishes are more important. Not someone else's needs because his needs would have been met at the restaurant but you taught her that on what should have been her day that her wishes don't matter nearly as much as someone else's. That is a dangerous lesson to  be teaching your daughter. \n\nYou owe her an apology and this weekend YOUR HUSBAND should take your daughter out to that restaurant. Clearly it wasn't important enough for you to do as a family so send the person who actually supports your daughter out to the restaurant with her. You and your son can stay home and eat pizza.",
              "id": 50,
              "comments": [
                {
                  "score": 115,
                  "content": "Cannot agree more! I was the daughter in this story growing up and always had to give up my wishes and presences to accommodate my younger sister who was the GC. I literally lived this exact scenario multiple times. \n\nAs a result, I have horrible self esteem and boundary issues I’m struggling to work on as a adult because I was always told I wasn’t important and my choices don’t matter and I just need to bend over and accommodate people if I want to be viewed as a good person.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 13,
                      "content": "As someone who is also in a similar situation, do you have any advice that might work? I'm desperately trying to improve my self-esteem and learn to raise my voice for myself. But it's a learned habit, and it's super hard to unlearn.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "I also can't help but wonder if the roles were reversed and it was the son who picked a restaurant that the daughter didn't want to go to for his birthday if the mom would have gladly let the daughter stay home or told her to suck it up for her baby boy's special day",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": ">So, you have the birthday girl, the one person who the day is supposed to be about, once again changing plans to make life more comfortable - not safe, but more comfortable - for the person in the family who life pretty much revolves around.\n\nThis is it in a nutshell.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "That's what I said too, hopefully dad takes her to celebrate (it sounded like he wanted seafood too) and mom can munch on pizza at home with the son. She can ruin his solo day that he seemed like he wanted. That would save them the money she cares about because it'd be cheaper than the two meals at a seafood restaurant.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 282,
              "content": "[deleted]",
              "id": 56,
              "comments": [
                {
                  "score": 9,
                  "content": "Why is vegan censored??",
                  "id": 57,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I was lost too. So I Googled. Apparently it's the term used for vegetarian or vegan, it's the quicker way to write veg(etari)an? Seriously someone please correct me if I'm wrong. I Googled \"Reddit censoring word vegan\" (probably easier to Google something like that rather than me trying to explain) and got a fair few answers, apparently people have been using this term for years. I've never seen this before either. TIL.",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 199,
              "content": "Agreed! That’s what struck me too. There only needs to be one dish he can eat!",
              "id": 59,
              "comments": [
                {
                  "score": 402,
                  "content": "As someone with a shellfish allergy, he really shouldn't be eating at a restaurant like that at all. It is simply not safe. Cross contamination can only be controlled so much. \n\nHowever, the OP seems just as concerned with dish preference as allergy, which has me rather confused frankly. \n\nThe solution to have the brother stay home was a great one. You never get enough 1:1 time with your kids when they are teens and she should have jumped at this. She is absolutely the AH.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 39,
                      "content": "Yeah same thought about the allergy. If it's really a serious allergy and not just a intolerance type thing, then he probably just shouldn't be in that type of restaurant at all. Brother suggesting he stay home was the way to go and OP should have jumped on it. You're the AH OP.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": ">Our son (15m) is deathly allergic to shellfish. He also can't stand fish.\n\nOP claims son is deathly allergic but can't stand fish but that is the only time the allergy is mentioned the rest of the post about her daughters birthday is about the son and what he wanted, even her husband is only mentioned once because he disagrees with OP.\n\nOP is the selfish one here, and I reckon OP doesn't like her daughter more than a case of favouring her son because if the son was the GC he would have gotten whatever he wanted aka to stay home and have pizza ordered.",
                      "id": 62,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "And, since she's 17, in another year, she'll likely be gone to college.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Yeah some people's allergies can be activated even by the smell so it's really not a good idea to even be around it",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 84,
                  "content": "And if you were able to view the menu, you can show it to him. He might be excited about one of the dishes that he can eat. Although he'd still probably be more excited about eating pizza at home while playing video games.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Eehh I dont know if I would trust a shellfish restaurant if I had a deadly allergy- my dad has the same allergy as ops son and he he refuses to eat at any sushi or seafood place for this reason. Even if there are “safe” options, the risk of cross contamination is high enough its not worth the risk",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Exactly!! I hate it when people say stuff like that. “There’s only three things on the menu I can or want to eat” cool, order one of them. How many entrees does one need?!",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 915,
          "content": "I don't think this will cause the daughter to resent her brother. He was on her side and stood up for her. Certainly she saw that the only person who had a problem here was OP herself.",
          "id": 68,
          "comments": [
            {
              "score": 277,
              "content": "I hope you’re right! The teen sibling relationship can be a mysterious and fickle beast, though. Even if her brother doesn’t ask for it, the birthday girl might unwittingly form resentment over perceptions that he is the favorite.",
              "id": 69,
              "comments": [
                {
                  "score": 61,
                  "content": "Or at least perceptions that he's the priority. I grew up pretty sure I was the favorite because I wasn't as much \"trouble\", but while my parents did better than it seems OP does, I definitely remember times I resented my sister. Even when I understood that her needs just conflicted and it wasn't her fault and my parents would also have preferred things to be different, it was still frustrating.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "This is a good point. Bro seems pretty easy-going, so hopefully their relationship can be maintained. It is pretty clear, based on the division of information in the post that OP favours the brother, but both kids seem reasonable. Here's hoping their mom doesn't screw it up.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I can understand the daughter making the connection that \"brother is the reason we can't go to the seafood restaurant i want to go to\". Wonder if they typically avoid seafood restaurants because of him and slthe dayghter wanted to use this special occasion to choose it.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I don't think she will resent her brother. He clearly stated he preferred to stay home, it is the Mother who pushed.  She will resent her Mother as she is teaching her that what she wants doesn't matter. Basically it came down to what the Mother wanted.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 787,
          "content": "YTA.  No one else’s wants were considered except yours.  I’m baffled as to how you don’t clearly see that YTA.  ",
          "id": 74,
          "comments": [
            {
              "score": 253,
              "content": "Yes. This. Exactly. Literally no one except OP *wanted* a FamILy dInNer but that’s what 3/4 of them were forced to take. \n\nOP, your kids are growing up, at some point you’re going to have to shift your expectations of what together time looks like. YTA",
              "id": 75,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 31,
              "content": "> I want BOTH of our children there.\n\nYep.  It all comes down to what OP wants.  \"Hey, lets do what you want for your birthday, but let's make sure we all do what I want for your birthday!\"",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 714,
          "content": "20 years from now OP will wonder, and mourn, for the fact her daughter is so distant, and that the FAMILY (as she puts it) is not closer. She won't have a clue why that happened and she'll feel very aggrieved.",
          "id": 77,
          "comments": [
            {
              "score": 27,
              "content": "And the daughter will be over with us in r/EstrangedAdultKids.",
              "id": 78,
              "comments": [
                {
                  "score": 8,
                  "content": "The daughter will also have a home with us at r/Raisedbynarcissists",
                  "id": 79,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "at least she will have the SM posts and pictures from this long ago time to keep her company.",
              "id": 80,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 410,
          "content": "I appreciate you pointing out the “individual time”. I have a lot of siblings and have great memories with all of the family celebrating things together. However, one of my most cherished memories is the solo out to dinner I had with my parents to celebrate a milestone in my life. Coincidentally I was 17 too.",
          "id": 81,
          "comments": [
            {
              "score": 17,
              "content": "I'm the oldest of five, so spent most of my childhood as the second mom. During my childhood there was never any just one on one time for me, plenty for the younger sibs, my mom was a single mother and it was always my nature to rather stay home and enjoy the peace if I could. But one of my most cherished memories was for my sixth grade graduation my mom picked me up early from school and took me out to a restaurant of my choice. That had never happened before and never again until I was in my late thirties and she decided to take me out for my birthday. The daughter would have enjoyed that one on one time, the OP already stated it doesn't happen. This OP is either an only child or the youngest",
              "id": 82,
              "comments": [
                {
                  "score": 9,
                  "content": "Oh gods, I'm voting youngest. I'm an only, and the thought that kids with siblings apparently don't get special celebrations or meaningful one-on-one time with both or one parent fills me with shock and despair. \n\nMy mom's in the middle of a big family and she talks about special times and shared hobbies with each of her parents, and so do all her sisters. I figured that's just what good parents did when they have multiple children. Like, they make the effort for each of the kids as much as they could. They don't just lump them all into \"the children,\" a blob with shared motivations, needs, and collective meaningful connection.",
                  "id": 83,
                  "comments": [
                    {
                      "score": 8,
                      "content": "My younger sister that is closest in age to me and I are now in our forties and are still referenced as the girls lol. We are only 15mo apart and my mom split from my dad when I was 2. I think it was a combo of not wanting my younger sis to be jealous and knowing I was ok with it plus my mom and I just not having a lot in common that kept us from one on one. Like my sis would get one on ones by going shopping, I'd ask her to just drop me at the library and would walk home. It never felt like a big deal until twenty plus years later and you look back.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 390,
          "content": "Yup. ALL THREE other family members are happy with this arrangement, and objective third parties don't see an issue. OP is making this about herself by insisting that the whole family goes together. \n\nOP, my mom would do stuff like this. She wanted perfect Hallmark moments, or photos for her to post on social media. Wanna know how much I talk to her now? I think you could probably guess. Your kids are PEOPLE-- see them as people, rather than as parts of a family unit.",
          "id": 85,
          "comments": [
            {
              "score": 16,
              "content": "My son is like autistic and usually when we go out for family dinners he stays home and we bring him McDonald's or a pizza back. Everyone is happy with the arrangement.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 369,
          "content": "Honestly the sons preferences aren't irrelevant. He wants his sister to get what she wants. The only one with a problem is OP.",
          "id": 87,
          "comments": [
            {
              "score": 27,
              "content": "Her whole story boils down to two words.\n\n> I want\n\nThe rest of it is justification, examples of others trying to be understanding and thoughtful.  But in the end, *OP WANTS, so OP should get*, regardless of what everyone else apparently wants and is content with.",
              "id": 88,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 333,
          "content": "Plus, the son will probably have a great time at home playing his game and eating his pizza. That would be a dream come true for some kids.",
          "id": 89,
          "comments": [
            {
              "score": 194,
              "content": "That would have felt like a birthday gift to me as a kid. I get to skip sitting still in some boring adult restaurant and instead eat pizza alone and play video games? \n\nYes, please.",
              "id": 90,
              "comments": [
                {
                  "score": 20,
                  "content": "As a teenager, I once was left home alone on my birthday because there was something more pressing. All I did was make chicken and rice and watch Sailor Moon, but it was so lovely and peaceful since I come from a high-stress family. It was one of my all time favorite birthdays, and it’s formed the basis of my birthday ritual ever since (I take a break from people pleasing and do whatever the frickfrack I want without having to accommodate other people; they can come along if they want, but if I’ve decided I’m getting my nails done, I’m getting my nails done).",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I'm 47f and I love being home alone with a pizza and binging ghost shows. ",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 286,
          "content": "You’re right, except for making accommodations for the son to be at the restaurant. Deathly allergy isn’t really a “see what they can do” type thing. It would be so much worse to make the son go to that restaurant. \n\nSounds like the daughter may have wanted some time alone with her parents and son would have been happy at home. This shouldn’t have even been an issue.",
          "id": 93,
          "comments": [
            {
              "score": 187,
              "content": "Also, that the daughter wanted a chance to get to eat at a type of restaurant they usually never get to go to. I’m not saying she picked it to spite her brother or anything. But it definitely would have been a place she doesn’t normally get to go. \n\nOP is definitely YTA. What seals the deal is that she is putting what SHE wants (“for the whole family to eat out together”) over what her daughter wants, even though this is supposed to be FOR her daughter",
              "id": 94,
              "comments": [
                {
                  "score": 7,
                  "content": "This. Special occasion, so she picks something that is special for her. I have a fish allergy, and I would skip this restaurant but wouldn't deny the birthday girl.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 7,
                      "content": "It's also pretty key that the brother is perfectly fine with it. Like, you can \\*imagine\\* this scenario in which the birthday person did it to spite the allergy-having sibling, or did it so that they specifically couldn't come with. (And it's \\*okay\\* for a sibling to be tired of \"we never get to do X\" because of their sibling's allergy.)  But it doesn't sound like that was the case here. OP should have listened to her son, and her husband, and her daughter.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16904,
      "content": "Well, I mean I get it but YTA\n\nYour daughter didn’t get what she wanted for her birthday. Your husband had no problem with it. Your son had no problem with it. \n\nEssentially, you decided what you wanted was more important than anyone else, and would you look at that, you got what you wanted - because your word in law, fuck the birthday girls choice, right? \n\nYou were upset about the location choice on behalf of your son, who wasn’t upset about it at all. \n\nYou made your daughters birthday about your wants. Why even pretend she had a choice in where to go? You dangled the illusion of choice in front of her, then overruled her in favour of what you wanted anyways.",
      "id": 97,
      "comments": [
        {
          "score": 5455,
          "content": "[deleted]",
          "id": 98,
          "comments": [
            {
              "score": 1521,
              "content": "Agreed. The selfishness is very strong with this one.",
              "id": 99,
              "comments": [
                {
                  "score": 2487,
                  "content": "The shellfishness?",
                  "id": 100,
                  "comments": [
                    {
                      "score": 415,
                      "content": "god damn it you beat me to it",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 115,
                      "content": "Is this the thyme and plaice for jokes 😁",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Why'd she even ask her where she wanted to go?  Just for the halibut?",
                      "id": 103,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "If I were the daughter, I would be crabby about the mom’s engineered drama.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "The son would seafood but couldn't eat it 😁",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "OP has a crabby mentality.",
                      "id": 106,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "That comment needs more upvotes. ",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Damnit you take my poor man’s gold 🏅🏅🏅",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Exactly. It doesn't sound at all like the daughter was excluding the son with her choice of restaurant. It sounds like she chose it because she understood he didn't want to come anyway, wherever they went. There is nothing negative there, for their ages it sounds perfectly normal and reasonable.",
              "id": 109,
              "comments": [
                {
                  "score": 9,
                  "content": "Seriously. I don't get all these people who think the son was like...sad about it? Bro wanted to eat pizza and play video games, not hang out with his family.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "And the daughter probably feels like she can never eat seafood bc of her brothers allergy, so she wanted to be able to eat it on a day that’s meant to celebrate her or be her choice. But it was still taken away.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "A pizza home alone with video games is heaven for teenage boys.",
              "id": 112,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1852,
          "content": ">  she wanted for her birthday\n\nOr ever.\n\nGiven the son's allergy, they probably don't even allow shellfish in the house. And since he also hates fish, they probably never eat fish at home. Coupled with the fact they don't go to restaurants that often, then when is the daughter supposed to ever have seafood?\n\nShe might really like seafood but literally never get to eat it. So for her birthday, she wants to have seafood. \n\nAnd the ease of the brother agreeing to stay home tells me that the daughter may have even ran her choice by him, and he confirmed that an evening of video games and pizza sounded just fine to him.\n\nYTA for sure.",
          "id": 113,
          "comments": [
            {
              "score": 492,
              "content": "Exactly, I got the gist that she ran the idea past her brother first since they all had a plan.",
              "id": 114,
              "comments": [
                {
                  "score": 285,
                  "content": "An dim getting the gist OP maybe doesn’t like seafood or the restaurant and was using her son as an excuse not to go.  It’s the only thing that makes sense as to why she still insisted even when the son said he didn’t even want to go.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 279,
                      "content": "Maybe. But I also know from my own mother that some moms are super obsessed about dOiNg ThInGs aS a fAMiLy and bEiNg tOgEtHeR at the expense of other things.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "This is definitely about OPs diet preferences, not her sons.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Maybe. But I also know from my own mother that some moms are super obsessed about dOiNg ThInGs aS a fAMiLy and bEiNg tOgEtHeR at the expense of other things.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "It is possible mom really favored the son.  I grew up with a mom like that.  One small example.  I was grown and my parents invited my husband and I to lunch on my birthday, we agreed on a place.  Mom called that morning and asked if we can go to the club what my brother is a member instead.  My husband is blue collar and would not be dressed appropriately since it was a workday.  He would be completely uncomfortable.  My mom tried to insist it would be fine.  When pressed her to know what was really happening, she had a last minute call from my brother asking her to take his child to a birthday party at the club, while he went elsewhere with another child.  In spite of our plans, she accepted. My husband took me to lunch that day.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 171,
              "content": "Right? Seafood has been my absolute favorite since I was a small child. If I almost never got to have it, picked it for my birthday, then got strong-armed out of it for such a bullshit reason, I'd be salty, too!",
              "id": 120,
              "comments": [
                {
                  "score": 48,
                  "content": "Same. I'm seafood obsessed. Always have been. I ate a whole-ass lobster when I was 3. Not even exaggerating.  \n\nI still almost always have a shit-ton of seafood on my birthday.  I'd be fucking livid in that poor girl's place.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 26,
                      "content": "It isn’t even that hard. I have a shellfish allergy, kid adores shellfish. We always discussed if he wanted to have a family dinner with all of us on his birthday or if he wanted to go out just with his dad or something to get shellfish. If he picked a family meal we tried to arrange for one of his gifts to be dad or grandparents taking him out for shellfish instead. Once or twice he really wanted the shellfish so that’s what they did for his birthday dinner. Then they came home and all got cleaned up well and then we had cake at home.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Hilarious 😆!!! I’m the same. My mom was craving seafood while pregnant with me.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I bet the daughter doesn’t get to order shellfish or fish ever on any family outing. YTA OP",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 532,
          "content": "Yes! YTA, OP. This meal is about your daughter and you’re trying to make it about the whole family. Next time you have the money, take the whole family out. This meal is about your daughter. You should want to do what she’s asking. Let her have her seafood meal.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 359,
          "content": "[deleted]",
          "id": 126,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 333,
          "content": "Yep. I wonder if son was so willing to stay home with pizza and video games might be because of the control he lives under otherwise. OP sounds very controlling. (“Here’s what *I* want for *your* birthday”). Sheesh.\n\nYTA, OP.",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 165,
          "content": "Reminds me of the time my mom wanted to go to have a big family dinner at a Thai restaurant for Mother’s Day, but my Dad refused to eat there and insisted on a steakhouse and everyone just acquiesced. Because of some head of the family, respect your elders horseshit.",
          "id": 128,
          "comments": [
            {
              "score": 67,
              "content": "Poor mom",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 124,
          "content": "Your word is law, fuck the birthday girl's choice. \n\nI think I love you.",
          "id": 130,
          "comments": [
            {
              "score": 29,
              "content": "Right?? What's the point of having children if they get to make any choice, including where to eat for their own birthday dinner, that you as a parent can't override?\n\n\nI bet OP criticizes her daughter's clothing choices too.",
              "id": 131,
              "comments": [
                {
                  "score": 13,
                  "content": "Once when I was a jr in high school (1995) we went to the mall. I bought a cute little black dress suitable for school. I wanted a pair of platform Mary Jane's because they were super fashionable. My mother didn't really like them and wouldn't let me buy them even though it was my money. We went to the food court and I faked having diarrhea. She thought I went to the bathroom but I ran back to Dillards and bought the shoes. When I came back she was LIVID and completely showed her ass. She marched me back to the department store and made me return them and pick out a pair of fucking old lady flats. She also wouldn't let me wear a certain long skirt because it made my ass \"look like a tank.\"",
                  "id": 132,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I hate that so many women have stories like this (although this is an unpleasant one - like a tank, who says that to anyone, let alone their daughter?). And if you were a junior and it was your own money, she should have let you buy the freaking shoes. Ridiculous.",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "Yes! You articulated it perfectly. Like don’t give her a choice if it’s not actually hers to make. Or let her choose and wait until OPs own birthday or a holiday to get the family dinner. It did not have to be this way.",
          "id": 134,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "Very well said.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": "YTA.  No one else’s wants were considered except yours.  I’m baffled as to how you don’t clearly see that YTA.  ",
          "id": 136,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6775,
      "content": "YTA.\n\nYour son was fine with staying home. Your husband was fine with your son staying home. It's your daughter's birthday. But you chose to center a day that is supposed to be about your daughter on your son's needs.\n\nDoes your daughter *ever* get to enjoy the seafood she likes? Or does she have to wait to get away from you and your controlling tendencies and move away from you in order to do that? \n\nSounds like the latter. I wonder how often she'll actually call home when she leaves, given your relentless need to prioritize her brother (when literally nobody is asking you to).",
      "id": 137,
      "comments": [
        {
          "score": 2874,
          "content": "She didn’t even centre it around her son’s needs, she centred it around herself. Son was happy to just stay home, but OP wanted what OP wanted, sod everyone else. YTA OP.",
          "id": 138,
          "comments": [
            {
              "score": 627,
              "content": "Yea I was expect the son to be young and/or really wanting to celebrate with his sister. Totally bonkers that OP has decided for everyone that an outing together is better than what everyone else wants even though at this point forcing the daughter to pick a new restaurant is going to make everyone resentful and bitter and they won't have as nice of a time.",
              "id": 139,
              "comments": [
                {
                  "score": 184,
                  "content": "Same! While I'm all for the birthday person picking their meal, I find it inconsiderate to pick somewhere to eat when the purpose is for the family to celebrate. So I thought, too, that the brother must be disappointed on being left out. But the brother is absolutely not bothered, made a great suggestion where he'd be happy while sister still gets to do what she wants. OP needs to step off and take her daughter for seafood.",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 121,
                  "content": "The daughter's better than I was at 17 though. By 17, and I had a mom very much like op, I would have just said sod the birthday and chosen nothing.",
                  "id": 141,
                  "comments": [
                    {
                      "score": 130,
                      "content": "[deleted]",
                      "id": 142,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "Oh yeah, me as well.  And my relationship with mom wouldn’t be the same since it’s clear mom doesn’t prioritize me.  Really, she needs to do some serious self reflection and make this up to her daughter cause I bet the daughter never gets what she wants, OP favors her son",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Some people are all about the optics of look! our happy family is happily enjoying things together!! and they are all actually miserable.  \n\nI really believe that if you find yourself applying checklists to life events -- as in, the following things must happen or it doesn't count -- you are doing it wrong.  (This is a mentality you see a lot with weddings, and babies, and parenting in general.)",
                  "id": 144,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I am insta friends with a few folks who I’m like “who are you trying to convince that you’re such a perfect happy family/couple, us or yourselves?”",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 264,
              "content": "Agreed. OP wasn’t really concerned with her son’s allergies. She wanted to have a nice family dinner out and used the daughter’s birthday as an opportunity for this, not as a treat to the daughter. \n\nOP owes her daughter a birthday dinner.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "No she used her sons needs as an excusee to get what she wanted \n\nShe wanted a family dinner all together , and used the allergies as a convenient excuse to get it",
              "id": 147,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 513,
          "content": "And OP will cry \"but it was for the FAMILY\" while losing a member of her family.",
          "id": 148,
          "comments": [
            {
              "score": 120,
              "content": "I can also see how she might turn it around to make it the daughter’s fault that there is tension between them. Classic.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "🎯",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "She’s going to lose 2. Guarantee the son also doesn’t like being micromanaged.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 367,
          "content": "She picked a seafood restaurant because that is the special meal she always wants and never gets. Any other day, she couldn't expect it because it wouldn't make sense for the family to get something expensive her brother can't have. But on her birthday, the one day that was supposed to be about her, she hoped she could have this one special treat she has been dreaming about. But no, how dare she think her birthday is about her. Her birthday is clearly about mom having an excuse for a family dinner.",
          "id": 152,
          "comments": [
            {
              "score": 13,
              "content": "That’s the deeper understanding here, the daughter specificity chooses seafood because as we can see, I beat OP always tries to avoid seafood because one of the family member is allergic to shellfish",
              "id": 153,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 258,
          "content": "I really LOVE seafood, and growing up I can't have it because my sisters don't like it. Never, at my birthday either. I know it's a small thing, but I'm still salty about it.",
          "id": 154,
          "comments": [
            {
              "score": 21,
              "content": "I feel you on this so much. My birthday dinners were never about what I actually wanted. My mother hates onions, my brother often ate hamburgers or chicken fingers (still in his adult life) and my father is old school Italian and not adventurous. All my birthday dinners involved me immediately wondering where I could go that wouldn’t cause an issue. This ended up being nowhere I wanted to really go but just dealt with it even up until now.",
              "id": 155,
              "comments": [
                {
                  "score": 5,
                  "content": "I can relate soooo much. Consider that I often had chocolate cakes for my birthday. And I don't eat chocolate.",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "*Salty*, eh?",
              "id": 157,
              "comments": [
                {
                  "score": 9,
                  "content": "Is it not the right word? I'm sorry, English isn't my first language. I'm saying that I'm still annoyed and a bit angry about it.",
                  "id": 158,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Seafood as like sea water is salty. It's a joke, dont worry.",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 209,
          "content": "From everyone I know who lived with someone with a serious food allergy: whenever you have to avoid a food like this, it generally becomes a HUGE treat whenever you can have it. And I’m guessing OP makes sure that’s pretty much never on her watch. I feel like the teen is fully on track to start applying to jobs/colleges in costal cities just to slurp down oysters whenever she wants lmao\n\nOP, your family traditions can look like whatever you want, especially now that you’re not dealing with what sound like fairly reasonable, mature teens. Maybe birthday dinners shouldn’t be the whole family. Maybe one of you goes out with one kid on their birthday, then the other parent goes out with the other on theirs. Maybe you do cake and ice cream together. Whatever. It’s your life! Spend time together on a random day when the choice of restaurant can be fair to everyone.",
          "id": 160,
          "comments": [
            {
              "score": 84,
              "content": "That's the other thing you're a whole family every single day. You can have a family dinner every single day. The opportunity is there to create those memories every day, so why is she choosing her daughter's birthday?",
              "id": 161,
              "comments": [
                {
                  "score": 9,
                  "content": "Especially if the daughter is going to college in a few months.",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "we’d always have shellfish when my sister had a sleepover",
              "id": 163,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 137,
          "content": "No, she's not prioritising the boy. She's prioritising her own wants, using the boy as an excuse.",
          "id": 164,
          "comments": [
            {
              "score": 10,
              "content": "Good point.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Probably not at all if this is ongoing…",
          "id": 166,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "It wasn’t so much that she prioritized the brother, IMHO; it her insistence on having a family outing — regardless of the desires of others. Brother probably wasn’t that keen on going on a family outing and was looking forward to pizza. ",
          "id": 167,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "No she used her son's allergy as the excuse to get what she wanted. It's very manipulative what she actually did here. It's not that the sun has the allergy that's the actual problem here it's that Mom wants a family dinner. And in order to do that there can't be fish. I'm fairly certain that even if there was a totally different restaurant but the sun still didn't want to go she would still find some other way to guilt them into all going together. Because at the root of the problem what this woman actually wants is her whole family to go whether or not that's what her daughter wants for her birthday. YTA",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I think the silver lining here is that the brother himself seems reasonable about this. Hopefully the sibling relationship can be salvaged.",
          "id": 169,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5372,
      "content": "YTA.  Your son offered an easy solution, but you rejected that.  I get that you can only afford to go out as a family a limited number of times, but geez - *it's* ***her*** *birthday dinner*! You told her to pick out the restaurant she wanted.  Might as well just asked your son where *he* wanted to go for *her* birthday.   \n\n\"Most people I've asked say I'm wrong\" - that's because you ARE WRONG.",
      "id": 170,
      "comments": [
        {
          "score": 786,
          "content": "Exactly it wasnt as if the daughter was insisting on going to the seafood place for a family dinner knowing her brother’s allergy. You asked her to choose a restraunt for her birthday dinner. If your son and husband are okay with the solution your son provided then whats the problem?",
          "id": 171,
          "comments": [
            {
              "score": 265,
              "content": "Info: I would like to know if OP likes seafood.",
              "id": 172,
              "comments": [
                {
                  "score": 223,
                  "content": "Oh, I think she very well may. OP likely has a martyr complex (that she is inflicting on other people). I could see her turning down a meal that she actually enjoys \"for my little boy's sake\". She enjoys drama more than she would enjoy the food.",
                  "id": 173,
                  "comments": [
                    {
                      "score": 48,
                      "content": "Reminds me of the mom from the Natalia grace documentary. She wanted to be a martyr so badly she adopted a special needs child and then whined about it when it meant actually having to be a good parent. Ugh.",
                      "id": 174,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 211,
              "content": "I wonder whether daughter and son talked to each other beforehand. Sounds like a fair sibling's deal: you get an evening for yourself, I get seafood.",
              "id": 175,
              "comments": [
                {
                  "score": 114,
                  "content": "Well sound like a fair deal for a couple teenagers. Afterall what 15 yo boy doesnt dream about spending a night alone with pizza and video games.",
                  "id": 176,
                  "comments": [
                    {
                      "score": 107,
                      "content": "I'm an almost 30 woman and that is still my dream",
                      "id": 177,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "This is my thought! The poor boy was probably really looking forward to his night in and then his mother ruined it because she insisted on dragging him along",
                      "id": 178,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "honestly, I can almost guarantee they talked about it beforehand. I’m a vegetarian and my brother loves meat, so we’ve done this with each other growing up since he’d always want to go to outback or something. \n\nit was probably as simple as “do you care if we go to [seafood restaurant] for my birthday?” “no, I’ll be fine/I’ll just stay home”",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Sounds like it. He was probably looking forward to an evening with the house to himself as much as she was looking forward to the seafood dinner. It could have been a win-win situation but noooooooooooo",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 303,
          "content": "Maybe you can buy your son her birthday gift as well",
          "id": 181,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 144,
          "content": "Plus I’m sure they can afford to pack a picnic and go eat it at a park or by a lake if they want family time eating together outside the home.  They don’t have to go to a restaurant.  This is a present for the daughter she should get to go where she wants.",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "Literally everyone is disagreeing with OP. That feels good, but OP has nads of steel to even be asking here after the resounding response they've already gotten lol",
          "id": 183,
          "comments": [
            {
              "score": 19,
              "content": "Idk, it’s either nads of steel or total selfish delusion.",
              "id": 184,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "I don’t think where the son wanted to go mattered. The son wanted to stay home, eat pizza in the livingroom, play games, fart if he wanted to, and not have Mom micromanaging every minute of it. Instead he had to behave properly in a restaurant of Moms choosing having his food allergies loudly announced to the waiter while his sister sat there resenting everyone at the table.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "She came here looking for us to validate her little does she know she came to the WRONG place for that 😂",
          "id": 186,
          "comments": [
            {
              "score": 6,
              "content": "ya think?  🤔🤣",
              "id": 187,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I guess she wants to listen she is right, not one of those who can accept their mistakes",
          "id": 188,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "It is truly amazing that even tho OP was met in their personal life with a pile of blowback,. she STILL thought to post here as if it would turn out better. Definitely wasn't about FAMILY. This is all about her and what SHE wanted.",
          "id": 189,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "#BUT BUT FaMiLy! s/",
          "id": 190,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3631,
      "content": ">I want BOTH of our children there.\n\nWhat a selfish take. YOU want that. But your daughter wants shellfish, and you son doesn't want to come.\n\nDo whatever you want for your own birthday, and stop making your daughter's birthday about you and what you want.\n\nYTA",
      "id": 191,
      "comments": [
        {
          "score": 1249,
          "content": "Don't you mean... a shellfish take?",
          "id": 192,
          "comments": [
            {
              "score": 259,
              "content": "please don't 😂",
              "id": 193,
              "comments": [
                {
                  "score": 185,
                  "content": "I'm sorry 🤣.",
                  "id": 194,
                  "comments": [
                    {
                      "score": 231,
                      "content": "Don't take me for a fool : you are not sorry, and we both know it.",
                      "id": 195,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Oh for God's hake. Don't you sea what you've started?\n\nThere's a bass-line for these puns now. Asshoal.",
              "id": 196,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 272,
          "content": "The OP reminds me of my own mother so much. In my 40s now and I'm still not seen as an individual nor am I respected. Everything is always what my mother wants. She behaves how she wants. She gets what she wants, to hell with others. I can't stand my mother.",
          "id": 197,
          "comments": [
            {
              "score": 74,
              "content": "but it'S FOr the FAmilY",
              "id": 198,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Heh, do we share a mom? Because my mother literally told me she doesn't celebrate my birthday, she celebrates the day SHE birthed me. All our birthdays were always her special days, she chose the food, selected the guests, etc...",
              "id": 199,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Look up 'Narcissist Mother' on the internet.  There is so much info about that, and how it ties in to emotional child abuse.   I wish you good healing!",
              "id": 200,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Legit",
              "id": 201,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1747,
      "content": "Do you make your sonss birthday all about your daughter? Do you tell him to restrain himself aand deprive himself of what he wants to make sure your  daughter gets what she wants? \n\n\nYTA your daughter probably has never had a day that's just for her since ce you had yours on, right? \n\n\nYou sound like the kind off parent who gets cut off when the kid is 18, and you have nO iDEa  why your child was soooo uPsEt.  \n\n\nIf you can't go out, them don't do it on the kids birthday then tell her no. She probably can't eat seafood ever because of her brother. Don't throw away  one child because the other is more needy, or more special. You're being a bad parent to your daughter. You're also being a bad parent to your son, because you're trying to corrupt his sense of what is entitled behaviors and what isn't. \n\n\nDo better. You have two kids. BOTH  ARE SPECIAL.",
      "id": 202,
      "comments": [
        {
          "score": 568,
          "content": "I agree with the YTA but it’s not what the son wants. He was cool staying home so his sister could enjoy her bday meal. It’s the mom who wanted dinner with “BOTH” her kids. This has nothing to do with the son and everything to do with the mom getting what she wants.",
          "id": 203,
          "comments": [
            {
              "score": 266,
              "content": "Right like I don't think this is a golden child scenario as some people are trying to imply. Son was happy to eat pizza and play video games alone all night (like most teen boys would tbh) so they both got kinda fucked there.",
              "id": 204,
              "comments": [
                {
                  "score": 27,
                  "content": "The *golden child* isn't about the *favored child's* behavior at all. All he has to do is exist. He isn't at fault here, but if the mother favors her son over her daughter, it's still called *golden child syndrome.*\n\nObviously, the mother is at fault here, but that's just what the term means. The child doesn't **have** to do anything to be favored. In this case, he's actually showing awareness of the situation and trying to remove himself to accommodate his sister. Despite that, his mother insisted on accommodating her sons needs at the expense of her daughter.\n\nMost of the time, the *golden child* understands what's going on and is uncomfortable with it and tries to even the playing field (like OPs son is doing). They share their toys, they take the blame, they protect their siblings or sacrifice for them in some way. They usually don't *like* being the golden child and are aware of it.",
                  "id": 205,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yeah, I'd assume son wasn't necessarily interested at all tbh. And I don't mean that in a bad way about him either! Playing video games and eating pizza is just typically preferable over dining out with parents AND it'd mean his sister got what she wanted. Don't see how he doesn't win there.",
              "id": 206,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "I was actually wondering if the preferential treatment was the norm because without knowing more info about how often they get seafood/how much the daughter likes it, I was almost thinking she chose the restaurant she did because she knew it would *have* to be about just her if her brother couldn’t go.",
          "id": 207,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Oh no, I think she makes every occasion about HERSELF. She's the most selfish asshole in the situation.",
          "id": 208,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "She makes her kids’ birthdays all about what she wants.",
          "id": 209,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1486,
      "content": "YTA. You were literally the only person bothered by the situation, and you decided that your wants were more important than those of the birthday girl. Didn't even think about ordering food for her from that place and food for your son from another and have a varied dinner at home because ? You only get to go out every so often? Well, she only gets one birthday a year, so there is that.\n\nLet's see how many more she wants to celebrate with you if you keep this up.",
      "id": 210,
      "comments": [
        {
          "score": 346,
          "content": "This might be her last, her daughter is already 17 and next year, daughter might already go NC. \n\nYta OP.",
          "id": 211,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1357,
      "content": "Info \n\nWhen it’s your sons birthday- are you going to veto his option if it’s not somewhere your daughter would 100% enjoy?",
      "id": 212,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 917,
      "content": "YTA.   Why give her a choice then veto it?\n As an epipen carrier I understand allergies. I don't stop family or friends from eating where I can't. If I can't go it's a spoil me night with my food. \n   \nHowever it was her birthday. Hers not yours or her brothers. Her and brother seemed fine. I'm sure he said happy birthday.\n\n  Next time don't bother asking  just arrange what you want.  Then wonder in the future why she may not want to do what you want and doesn't have  huge amounts of contact.",
      "id": 213,
      "comments": [
        {
          "score": 152,
          "content": "> Why give her a choice then veto it?\n\nFor fucking real!  Asking a child what they want for their birthday and then immediately shutting it down sounds like a Superintendent Chalmers bit",
          "id": 214,
          "comments": [
            {
              "score": 10,
              "content": "OP has understandable yet outdated concept of “family”, family must eat together, family must meet on special occasions, family must do this and that … that’s just OP’s own fantasy\n\nReal family is about listening to each other and action according. Giving the daughter a choice and revoking it is just show the lack of integrity as a parent",
              "id": 215,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I appreciate you pointing this out. This is what my mom used to do to me - ask me for what I wanted and make a big show about not doing it. \n\n\nIt got so bad I remember crying trying to work myself up to ask my grandpa if i could have ice cream from the freezer. I've only gotten over this recently in my 30s. \n\n\nIt's incredibly damaging if this is a frequent thing that happens. ",
          "id": 216,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 757,
      "content": "YTA. Your son was fine staying home (and as a teenager I would have loved the chance to stay home alone and relax with a pizza) and your husband was right that this was your daughter's birthday and not Mom's Family Night Out.",
      "id": 217,
      "comments": [],
      "relation": "Attack"
    }
  ]
}