{
  "post content": "\n\n\nMy late wife and I invested in a small winter cabin years ago. I'm the owner now after her passing. My son (22) is getting married to his STBW in a month. They have no money for a destination honeymoon, they were barely able to plan the wedding. He asked if they could spend their honeymoon in my winter cabin and I agreed but under the condition that they pay me. He acted all shocked and tried to argue that it's his mom's cabin too but I pointed out how I'm the owner now and that I pay to keep it maintained. He got upset and accused me of being materialistic and selfish after I'd already been unhelpful with the wedding. I told him I did the same thing with his aunt and it wasn't personal. He left with his fiancee and told the family about it.\n\n\nNow I'm being berating left and right and am being told to let him use the cabin and shamed me for asking for money.\n\n\nINFO: I already told him a millionth times that getting married so soon was not a good idea but he refused to take my advice and had no regard for my opinion on the situation.",
  "id": 1,
  "comments": [
    {
      "score": 38001,
      "content": "YTA\n\n\"I told him I did the same tjing with his aunt and it wasn't personal.\"\n\nAnd that's why - your son's wedding should be personal to you.\n\nEDIT: per your INFO edit, YTA for not supporting your son's wedding also. Just say goodbye to him, he's going to quit talking to you very soon.",
      "id": 2,
      "comments": [
        {
          "score": 8598,
          "content": "If you read the edit, it basically has become a personal attack against his son. Which is incredibly sad. \n\nOp I'm 23, 22 is not to soon to be married. I've been with my husband 4 years. He's my world, my sunlight, my everything. He's seen stuff to horrible to describe with my family. He knew there was bags and bags of skeletons everywhere. Everytime I fall he picks me back up and never judges me.\n\nI hope you are ready to lose your son, over something so petty and small.\n\nEdit: I'd like to add, my mom pulled the same don't get married shit. We went from calling everyday to low contact. This isn't a hill to die on.",
          "id": 3,
          "comments": [
            {
              "score": 2992,
              "content": "I’m only 26 and only 1 couple I know that got married young is still together lol.",
              "id": 4,
              "comments": [
                {
                  "score": 4219,
                  "content": "I know lots of marriages that started young and stayed together. I also know lots of marriages that started later and didn’t. \nThis 22-year-old might be making a mistake and might not. We definitely don’t know that from this post.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2605,
                      "content": "Got married at 23. 30 years later we are still happy. It does work sometimes.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 447,
                      "content": "Got married at barely 20, still married 47 years later. Parents married at 16 and 18, for 67 years when dad died. Same for sister, married at 21, still married for 48 years. It is too early to tell if this marriage will be successful or not, age isn’t the only factor. And YTA for not gifting them the cabin for their honeymoon.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "I'd argue that it's also fine for OP to have expressed concern. Your brain isn't fully developed at that age, after all. If the son asked my opinion, I'd say there's nothing lost for giving it more time. \n\nHOWEVER. Wait, that isn't a big enough \"however.\"\n\n##HOWEVER\n\nIf it's a mistake, it's theirs to make. OP acting like he's entitled to a say in this decision is ridiculous, and being punitive is not actually going to convince his son that OP's views are worth listening to.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Got married in my 30s. Late forties now, and the relationship is over.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "My son married his high school sweetheart. They are still together 15 years in.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 734,
                  "content": "Yeah, they should have waited like I did. I got married at 34, then divorced at 36.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Yeah me too. Married at 35 (first and only time), separated at 40, divorced at 45.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "Hahaha... I've waited until 28. Happily divorced at age 30 ^^\nMeanwhile my parents got married at 20/22 and just celebrated 40 years. My grandparents were married for over 50 years, almost 60 and my granddads last words to grandma were: I love you. For him it was the first marriage, for grandma the second and even brought a daughter into it.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "But did you get a honeymoon cabin?",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "I got married at 33, seperated 8 months later before I even turned 34 and have just filed for divorce a week ago at the age of 36 (long story as to why it's taken so long to file but we have been separated the whole time).",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Ah, the two year plan! That’s exactly what I did. One year to official declare the marriage dead, and then a second year before we finally got around to finalizing it (but separated). I wondered if I should give the wedding presents back.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 30,
                  "content": "[deleted]",
                  "id": 17,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I’m so sorry for your loss. Glad you had each other.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "That's the trick, isn't it? You don't get to pick the time or the person, but when that matching puzzle piece fits, it fits. I think we both wish you had longer with your soulmate, but when it's your soulmate, it is never long enough.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "I got married on my 21st birthday, we celebrate our 24th anniversary next year.",
                  "id": 20,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "Does that matter though? We could sit here forever with anecdotal evidence in favor of one way or another.  The fact is OP’s son is a grown ass man and denying the cottage won’t prevent his marriage, only damage his relationship with OP.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I was married at age 22, still very happily married 24 years later. Would I be concerned should my kids want to marry that young? For sure. But I wouldn’t be a dick about…. Like OP is being",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Cool. Half of them do though. I got married at 20 and am still happily married at 37. People get married at 40 and get divorced in a few years too. Being an AH to your kid for making their own adult choices is a good way to get cut off forever.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I was a month and 2 weeks shy of 20 when my husband and I got married,we are still very happy and have a very healthy relationship 16 years laters. \n\nOn the other hand,my mom is on marriage number 4(which fingers crossed,will be her last,she seems happy now and they have been married a few years now.) My Dad is on wife number 3(have no clue if they're happy as the only contact we have is for my grandma.) Both of my parents are in there 60's(and were previously married to each other and other partners for 6-9 years each marriage)",
                  "id": 24,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Except once you voice your opinion if someone still wants to do it what good comes from punishing a person (your child) like this? \n\nPeople have to be allowed to make their own mistakes and others have no right to control that and his dad is essentially punishing him for not listening to his advice or opinion.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "This does not **at all** inspire the confidence you think it does lol",
              "id": 26,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "My husband and I were married at ages 24/25, but we've lived together since ages 22/23 and were dating since we were 19/20. We've now been together 28 years, married for 23. I have a cousin my same age that had similar circumstances, although married a couple years earlier than we did. They're still together and very happy. Actually, come to think of it, a lot of my cousins married in that age range and are still married.\n\nI'm not a proponent of rushing into a marriage when you haven't been together very long, at any age. But, OP is clearly punishing his son for getting married against his advice by not allowing him use of the family winter cabin for a honeymoon. Family relationships aren't supposed to be transactional.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I got married at 23 and we will celebrate our 30th anniversary in May. We also didn't have a lot of money as well as health issues to deal with. We both had amazing families that gave us a ton of support (not money) that helped us so much even though I know my parents had some reservations. They never said anything. They were just there if I needed them.\n\nMaybe OP could try to be supportive instead of a judgemental AH.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "regardless if OP thinks his son is too young (or to immature), his son is getting married & should be supportive esp since his son’s mother is gone.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1545,
          "content": "Yeah, I don't think OP understands the bridge he's burning here. I had to go back and re-read it, because he was talking about him like he was a stepson, not his own flesh and blood. He might not agree with the wedding, but this will be the most important day in his son's young life. He lost his mother at a young age, so she won't be there for his wedding, and now OP is acting like this. Asking to use the family cabin for his honeymoon is a totally normal request, and his response was horrible. Perhaps asking them to cover the cost of having it cleaned when they're done would have been more humane and reasonable. \n\nIt's good to know that OP has a price for his relationship with his son, future daughter-in-law, and any potential grandkids: a week or two's rent of a family cabin that he already owns and aren't likely to be using at that time. Someday, when you're sitting alone in your house, listening to \"Cat's in the Cradle\" on repeat, remember this moment.\n\nEdit: repeat, not remix...",
          "id": 30,
          "comments": [
            {
              "score": 642,
              "content": "Agreed! It read very much like “my late wife’s son” vibe. Why are you suck a miser?? Did you have a request for a rental for your “small winter cabin”? I literally can’t believe I just read your post. I hope your son posts on here so we can all tell him that the internet strangers have his back since his own father doesn’t. INFO if you wife were still alive, what would she say about this manuver?",
              "id": 31,
              "comments": [
                {
                  "score": 167,
                  "content": "In my dad's case it's because of What She Did To Him. Never mind the three kids that don't have a mom (including one that isn't his) when she died, he refused to say a nice word about her and threw all her stuff away...\n\nBecause of all the debt she put him in, everything was \"his\". The house got sold and he spent the money on a rental property. I wasn't allowed to drive either car SHE bought to work, to support HIM, because they were \"his\" cars now. I volunteered to pay for the insurance and he wouldn't let me.\n\nYTA, OP. I'm so glad other people are agreeing because this was such a painful enough to have to go through while people were expecting me to support my dad through it when all he was thinking was how happy he was finally \"free\".",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Yeah I literally expected \"I cover the cost by renting it out on Airbnb and they're asking for dates in the peak season\"",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 234,
              "content": "Yes, I read it like stepson, too and thought it seemed cold and lacked emotional connection to his wife’s son",
              "id": 34,
              "comments": [
                {
                  "score": 54,
                  "content": "I got stepson vibe too and had to reread. Wow this guy is a cold fish.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 117,
              "content": "ad hoc wine seemly cagey selective shy one rude agonizing joke ` this message was mass deleted/edited with redact.dev `",
              "id": 36,
              "comments": [
                {
                  "score": 17,
                  "content": "I’m thinking “one day you’re going to be too old to take care of yourself and son’s gonna put you in a government institution where you can be forgotten until you die”.",
                  "id": 37,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "I did the same! I could’ve sworn he was talking about his stepson not his own flesh and blood. I’d tell him to shove it up his arse and leave him to his riches",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "> talking about him like he was a stepson\n\nMore like a step second cousin lol!",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 701,
          "content": "Exactly YTA.\n\nHeck my sister just gifted my son and his wife a week at her beach penthouse condo for free or their honeymoon and you can't let your own son and FDIL  use a cabin you own.",
          "id": 40,
          "comments": [
            {
              "score": 185,
              "content": "Friends of ours gave us their condo in Myrtle Beach for free for our honeymoon and a parent can't even do that is sad.",
              "id": 41,
              "comments": [
                {
                  "score": 7,
                  "content": "Reminds me of my parents. I needed a large vehicle to move when I was done at out-of-state college. Would my parents let me borrow their van? Nope! Had to borrow a SUV from a friend's parents.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "My husband’s good friend’s parents own a holiday house (see how much more removed that is from actual parent) and they let my family stay there for free every year. And we usually do a girls trip once a year there too. Don’t even have to pay for a cleaner. We just usually try all chip in to cover utilities and do a good clean when we leave. \n\nThis guy is gonna be miserable and alone very soon.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "Almost have to wonder if the wife meant to leave her half to the son but OP talked her out of it \"because he's too young\" or if there was even a will and they just defaulted to husband... I would consider telling the son to check with an attorney specializing in inheritance laws for his state to see if he has a case for ownership of the wife's share...",
              "id": 44,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "The saddest part is this is probably exactly why the mother invested in the property, to see HER family make wonderful memories, not just CHARGE other people to make theirs. This guy sucks so much.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 675,
          "content": "Look at the Info section (quoted below for your conveniance).\n\n> INFO: I already told him a millionth times that getting married so soon was not a good idea but he refused to take my advice and had no regard for my opinion on the situation.\n\nI suspect that it is, in fact, *very* personal. OP is upset that son isn't doing what OP wanted.",
          "id": 46,
          "comments": [
            {
              "score": 94,
              "content": "OP needs to get over his ego.  IF the wedding turns out to be a mistake, it's the son's mistake to make and learn from.... not OP's to judge and make even harder.  This guy sounds like a real \"my way or the highway\" type of control monger.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "The 1950's called and would like this post back OP. Waiting for you to tell us you remember when a loaf of bread was a nickel, you walked back and forth to school barefoot, uphill and in a snowstorm both ways and by God you remember when young ones worked for what they wanted! YTA. Enjoy the grandkids you won't get to see.",
              "id": 48,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 636,
          "content": "He sounds like a dad who's going to find a new wife and rewrite his will to leave everything to her and any future kids. He should just plan on never seeing any grandkids (although it sounds like he wouldn't want to anyways).\n\nI hope he comes to regret everything when he's older.",
          "id": 49,
          "comments": [
            {
              "score": 7,
              "content": "He is old. This is who he is the sooner they accept it and cut his old ass out the better.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 318,
          "content": "[removed]",
          "id": 51,
          "comments": [
            {
              "score": 233,
              "content": "OP said in a comment that he already got a wedding gift for them... God forbid he lets them stay at the cabin as an honour to his son's late mother's memory... \n\nI don't think a week long stay would increase the utility bills so much that OP can't let it go. YTA And if he is asking money above utilities, then double, no triple YTA for trying to profit off of his own son. OP claims it's not personal, but I would bet OP is doing this as a punishment because son doesn't do what he wants, doesn't wait with his wedding until daddy dearest approves...",
              "id": 52,
              "comments": [
                {
                  "score": 71,
                  "content": "It’s absolutely personal and a punishment to “prove” he was too young to do it on his own",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 212,
          "content": "[removed]",
          "id": 54,
          "comments": [
            {
              "score": 12,
              "content": "Just reading it I’m sure OP was going to stiff him of a wedding present considering he said himself that he was not helpful with any part of the wedding.",
              "id": 55,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Bad bot! Comment stolen from u/NorthernLitUp",
              "id": 56,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 134,
          "content": "Exactly, it would be different if OP was running it as an AirB&B or something and would be losing money by letting his son use the cabin. As it is, it would cost him nothing to do this kindness for his son so it's absolutely coming off (correctly based on the edit) as a snub against the marriage. \n\nI got married when I was 22 and my marriage has outlasted both of my mom's marriages at this point. Age can be a factor, but it's not the only factor in determining if a relationship will last.",
          "id": 57,
          "comments": [
            {
              "score": 17,
              "content": "Even if you are AirBnBing it, unless you'd have to cancel an existing reservation, I feel like you could block off a week for your kid if you liked them at all.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I own an AirBnb and would definitely not charge my kid to use it. If it's already making money from strangers I definitely don't need money from my kid on their honeymoon.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Even then that’s more important than your sons wedding? Making money? I’m sure his wife god rest her soul is rolling in the grave",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I got married at 21. We've had some bad times and marvelously good times. But it meant so much, to have both sets of parents supporting us. We stayed at my parents beach cottage, on our honeymoon, 1980. They approved that we weren't going into debt , just wanted  a simple honeymoon.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "“It wasn’t personal “ it should be personal given the relationship these people are supposed to have",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Yeah sounds like he’s withholding the cabin to punish his son for getting married",
          "id": 63,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 33220,
      "content": "STBW?!?  Soon To Be Wife,   Instead of fiancé.  Acronyms are getting out of hand.\n\nYTA for making me look up the meaning of STBW",
      "id": 64,
      "comments": [
        {
          "score": 7454,
          "content": "Yeah, I’m getting sick of this acronym shit.",
          "id": 65,
          "comments": [
            {
              "score": 4191,
              "content": "The worst is when they says my brother we’ll call him B, and my dad who will call M. \nLike just make up a name",
              "id": 66,
              "comments": [
                {
                  "score": 2832,
                  "content": "This is actually a huge pet peeve of mine.  It’s so much easier to read if they have names instead of letters",
                  "id": 67,
                  "comments": [
                    {
                      "score": 2406,
                      "content": "I prefer them to just say \"brother\" or \"dad\" or whatever. When I start reading about Jenny, Julie, Jess, and June, I get so frustrated because I have to keep scrolling back up to figure out which one is sister, SIL, MIL, and mom because I can't remember at all.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 183,
                      "content": "I just downvote those type of posts immediately",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Me too.  2nd is when they specify \"fake names\".  Yeah, we know.  People have been using fake names in these situations since before you were born, OP, you don't need to spell it out.  Although, it would be funny if someone put \"actual names\" in a post",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1338,
                  "content": "\"So B, XBFF, F24, and M, XBF, M26, and his STBW, L, F23... \"\n\nMe: YTA and I'm not reading all this.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 295,
                      "content": "💀 it really do be like that. YTA",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Babe, wake up. Elon's next kid's name just dropped.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "All I can think of which Superbowl is this.",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Sheesh! When a post also looks like a math equation its gone too far! lol",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "\"Maybe if I convolute this enough it'll make me look better...\" - OP",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 214,
                  "content": "Also when they say, “we’ll call them Y, H, O, and D, but only D is relevant to the story.”  Just call him David. I don’t need to know about the ages and sexes of anyone else. I don’t need to know it’s a fake name, I assume this already. Just tell your story quickly, and add in enough Freudian slips and adjectives to allow me to decide your inner intent and judge you. THATS IT",
                  "id": 77,
                  "comments": [
                    {
                      "score": 19,
                      "content": "The good people of r/BestofRedditorUpdates tend to edit the posts with initials into fake names and I _love them for it_\n\nAbsolutely cannot fucking follow a story that's like, \"And then D told S that I was uninvited from the wedding but JRRT and INXS were like, oh my god you should totally go anyway\"",
                      "id": 78,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "I always find it hysterical when they clarify that they’re fake names. Who the fuck cares? No one will ever know",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 955,
              "content": "I absolutely loathe when people put a “D” in front of their relatives (DH, DD, DS).  Like, in real life do they call them “dear husband, dear daughter, dear son”?  The first hundred times I came across this incredible stupid trend I thought all these people were disabled, damned, dumb, disowned, divorced, departed, deaf, dead, dehydrated, devil, disruptive…. “Dear” was the last thing I could imagine.",
              "id": 80,
              "comments": [
                {
                  "score": 366,
                  "content": "That and the term “hubby” makes my eyes want to melt. And they always use that term every other sentence too, really add onto irritation. I assume those people are the ones constantly talking in a baby voice too tbh. Not founded on anything, just a gut feeling lol",
                  "id": 81,
                  "comments": [
                    {
                      "score": 123,
                      "content": "Kiddo does that for me...",
                      "id": 82,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "Hubby and DH literally make me want to gag and immediately downvote. They also tend to be the people who don't have a dear husband at all but rather a completely selfish asshole who lives with them.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "The first time my mother referred to my husband as my “hubby” I considered divorce.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Or “hubs”. Ugh.",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Holy shit, I thought it was just me.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Lol, I always wondered where all these dears are, I never meet them IRL",
                  "id": 87,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "Exactly, and then goes on to talk shit about the husband. Why call him dear then? And what about calling their baby LO (little one) instead of my child. This makes their posts hard to read if I need to google every acronym they use.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I am now going to call someone DI for Dear Idiot",
                  "id": 89,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Yes! I hate this trend!",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Yes! Why?! Where does this come from, and can we set that place on fire?\n\nI always read it as sarcasm. Like, this chick hates her husband and finds her kids exhausting, so the \"dear\" is in there in a \"bless your heart\" kind of way.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Thank God, I thought I was the only one. It’s so annoying when people do that.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "I absolutely loathe when people put a “D” in front of their relatives (DH, DD, DS).  Like, in real life do they call them “dear husband, dear daughter, dear son”?  The first hundred times I came across this incredible stupid trend I thought all these people were disabled, damned, dumb, disowned, divorced, departed, deaf, dead, dehydrated, devil, disruptive…. “Dear” was the last thing I could imagine.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Same my life is acronyms, my job has soooo many, like does Reddit mind just spelling things out so that I can have a break. Damn",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "You should go to r/newparents. Stupid amount of acronyms",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": ">YIGSOTAS\n\nFtfy! /s\n\nBut for real. This guy can't even refer to his son's fiancee as a fiancee. YTA, OP.",
              "id": 96,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1848,
          "content": "I assumed it was sexually transmitted baby woman but yours makes a bit more sense.",
          "id": 97,
          "comments": [
            {
              "score": 192,
              "content": "I’m cracking up at how you came up with that!! 😂😂",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "It could be both.",
              "id": 99,
              "comments": [
                {
                  "score": 7,
                  "content": "Why not both? \n\nYTA",
                  "id": 100,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Lmao thanks for the laugh. NGL, I would probably be weary of a sexually transmitted baby woman too.",
              "id": 101,
              "comments": [
                {
                  "score": 13,
                  "content": "That’s the sort of thing a skankasaursrex would say",
                  "id": 102,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "You just made me snort laugh seltzer water up my nose, so thanks for that!🤣",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I looked it up and it told me it stood for Soccer The Brazilian Way.  I was very confused.",
              "id": 104,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Just like in \"it follows\"",
              "id": 105,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 646,
          "content": "Thank you for this. Why can't posters just write out the 5 fucking words instead of abbreviating shit that doesn't need it.\n\nEdit: or in this case, just use the word fiance as you have pointed out",
          "id": 106,
          "comments": [
            {
              "score": 91,
              "content": "Cuz most like this post are trolls who to lazy",
              "id": 107,
              "comments": [
                {
                  "score": 15,
                  "content": "You’re right but fiancé can be swiped easily. It just sounds like op is trying to insult the lady but is just an ass.",
                  "id": 108,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "When ever I see STBX I think Starbucks.",
              "id": 109,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 367,
          "content": "Usually it's only used in terms of ex's. STBX would be someone you are in the process of separating or divorcing from. In this scenario, asshole dad doesn't want to give his son's partner the respect of calling her his fiance.",
          "id": 110,
          "comments": [
            {
              "score": 166,
              "content": "This is exactly what I was thinking.  This doesn't have anything to do with the cabin, Dad doesn't like the fiancee so he's being as difficult as possible.",
              "id": 111,
              "comments": [
                {
                  "score": 23,
                  "content": "Bless you for spelling fiancée with two Es.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "See I read STBX and think starbucks",
              "id": 113,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 352,
          "content": "That sentence just irked me.         \n                        \n> My son (22) is getting married ~~to his STBW~~ in a month.     \n           \nThat acronym adds nothing and just confuses readers. I had to look it up too.",
          "id": 114,
          "comments": [
            {
              "score": 81,
              "content": "I also looked it up. Apparently it’s ‘segmental total body water’. Fortunately the comment section clarified things for me, because I was getting a bit confused…",
              "id": 115,
              "comments": [
                {
                  "score": 9,
                  "content": "Right when I looked it up I got the same result but after scrolling down a bit I also found ‘soon to be with’ so…. Thank you comment section",
                  "id": 116,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "It pissed me off, too. It actually eventually clicked that it was “soon to be wife” without me having to look it up, but at first with the way he was complaining about them “getting married too fast” I thought it was “short term something something” like he was saying they’d only been dating a short while. \n\nSo fucking unnecessary. Just say fiancée or omit it completely, as you said.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Right? Like obviously he's getting married to his \"soon to be spouse\". That's literally what marriage means.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 345,
          "content": "Good to know I wasn't the only one. I was like, you could've said fiance, partner, significant other, girlfriend or ANYTHING ELSE.\n\nYTA. Learn to love your son and stop turning things into acronyms just because you can.",
          "id": 119,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 172,
          "content": "I appreciate you for looking this up so I didnt have too",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Fiancée for a woman",
          "id": 121,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "I somehow knew exactly what it meant\n\n....not sure what that says about me lmao",
          "id": 122,
          "comments": [
            {
              "score": 5,
              "content": "I knew too. Personally, it's because of the context, doesn't leave much room for any other answer. Also because it follows the pattern of acronyms seen and used on relationship related posts and subreddits I guess.",
              "id": 123,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Right, I read the title like\n\n\"Step... No that can't be it\n\nSibling... No that doesn't work\n\nWhat is BW? Baby wife? No that's dumb\"\n\nThen came to the comments to figure out what it was",
          "id": 124,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13162,
      "content": "YTA\n\nIt's your son! For his honeymoon! You're going to **CHARGE** YOUR ***SON***?\n\nHonestly, when you never hear from him, rarely see him, and have no relationship with any future potential grandchildren, I want you to remember this moment - the moment when you typed all that out, and found nothing wrong with charging your son to use your family cabin.\n\nI wish you good luck, my friend, especially when you are much older and maybe need some help from your family. Life is long, and the arc of the moral universe - as they say - bends toward justice.\n\n(if you genuinely want to resolve this - apologize to your son, tell him you'd be happy to have him use the cabin, and that you know it would have made his mother happy to know he would be beginning his married life there).\n\n***ETA:*** Is your first name...Ebenezer?",
      "id": 125,
      "comments": [
        {
          "score": 1921,
          "content": "When he’s old and has no one to care for him, hope he’s ok with a nursing home instead of being cared for by son and DIL. \n\nOP is YTA. Yikes.",
          "id": 126,
          "comments": [
            {
              "score": 966,
              "content": "They should charge him for the care.",
              "id": 127,
              "comments": [
                {
                  "score": 1026,
                  "content": "\"Hey I need assisted living and want to move in with you and your family.\"\n\n\"Sure, Dad. Market rate for assisted living is $6k a month. I have expenses too.\"\n\nCue Cats in the Cradle...",
                  "id": 128,
                  "comments": [
                    {
                      "score": 452,
                      "content": "\"I'm charging you, but it's not personal...\"",
                      "id": 129,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "If I could give you an award, I would. You made me LOL, and I woke up my cat. 🥇",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Honestly… might not be enough to deal with his crap",
                      "id": 131,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 191,
              "content": "And when he’s old and in the nursing home, he’ll sign all of his worldly goods to go to a charity upon his death because “none of his family was there” for him in his old age. \n\nThis is good example of why parents need to protect their children, not just their spouse in the event of their death.",
              "id": 132,
              "comments": [
                {
                  "score": 25,
                  "content": "That's not how living in a nursing home works.. he will be forced to pay out of pocket including selling said worldly goods, until his net worth is less than 2000 dollars.  \n\nThen the state will care for him, taking any and all value beyond 71 dollars a month *fun* money (I believe that amount just got increased a bit, but it's still not much).  \n\nIn a final act of revenge toward the world, his son (and all of us) will pay for his care the rest of his days (may they be as short as they are alone).",
                  "id": 133,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Doesn’t work like that everywhere. We don’t know if they live in the states. 😅",
                      "id": 134,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I hope he remembers that it's nothing personal.",
              "id": 135,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": ">hope he’s ok with a nursing home\n\nIf he's that lucky.  It's not that easy to get into a nursing home, especially if you're already losing your marbles and you don't have anyone willing to help you.  Homeless on the streets is a distinct possibility.  Ever see a really old homeless person who's clearly lost their faculties and wondered how he got there?  OP's behavior seems like a recipe for that.",
              "id": 136,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "He’ll just go live in his cabin and make his in-home nurse pay to live there.",
              "id": 137,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "Of course he's going to the nursing home! I mean he's got to make enough money off of rental charges from the cabin to make that work. Right?",
              "id": 138,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "He's going to ask his son if he can stay with him when he is old and the son will say \"Sure, for $3000/month, you can stay with me. Its nothing personal!\"",
              "id": 139,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Medicare nursing home.",
              "id": 140,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 400,
          "content": "Yeah. YTA, OP.\n\nSeriously: why in the world would you not offer your son and future daughter-in-law a week in the cabin as your wedding gift? Unless you are unable to afford food AND your son is out here frolicking in a pile of coins like Scrooge McDuck, this is some Grinch-level stinginess and greed.\n\n(Apologies to all for mixing my metaphors.)",
          "id": 141,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 255,
          "content": "OP woke up and chose nursing home. YTA.",
          "id": 142,
          "comments": [
            {
              "score": 12,
              "content": "Most old folks end up in assisted living/nursing homes. Even the ones with loving, involved families. Their adult kids often do not have the time/resources/skills to provide what they need, and many choose to live in those communities even when family can, for the social aspect. \n\nBut there's *worlds* of difference between a mainly private pay facility and a mainly medicare one, so...",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 20,
          "content": "‘The arc of the moral universe bends towards justice’ 🔥\n\nI plan on using this when people wrong me rather than the shorter (and less effective imo) ‘karma will get ya ass’",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "20 years from now this man is going to understand the relational side of \"you reap what you sow\"",
          "id": 145,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Bro needs three ghosts to visit him for sure",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "It's going to be really funny if OP's son and wife have kids in a few years and OP is suddenly grovelling to get back into their good graces. \"Sure I treated you like shit, but gRaNdBaBiEs!!!\"",
          "id": 147,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I’m reading the post thinking that the “son” is actually “step-son” because of the line: \n\n“he acted all shocked and tried to argue that it’s *his mom’s*cabin too”\n\nSo OP probably doesn’t even think of the man getting married as his son.",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "If anything… it could be OP’s “wedding gift” at almost a no cost, especially since he doesn’t want to spend a dime on helping with the wedding. And make it from him and the late mother, what a gesture that would be, to include her for son. \n\nThe anger and hostility OP is showing because an adult child won’t bend to his authority is a bit too much. Almost seems like there is something else going on. \n\nINFO: because it was brought up so much, OP, is this your biological son or stepson? And only child? \nBecause it’s reading like it’s a peripheral relationship that you don’t care about losing.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "\"They can't afford to get married so I'm going to charge them to stay in a cabin that I own.\"",
          "id": 150,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6969,
      "content": "YTA.\n\nI'd love to know why won't you gift a stay at the cabin for your son who just got married. Do you not like him? your greed is more important than your child? did he poop in your cornflakes?",
      "id": 151,
      "comments": [
        {
          "score": 3352,
          "content": "YTA OP. And OP gave the game away with the postscript *I already told him a millionth times that getting married so soon was not a good idea but he refused to take my advice and had no regard for my opinion on the situation.*\n\nShould also revise \"It wasn't personal.\" It is entirely personal and based on disapproval of the marriage.",
          "id": 152,
          "comments": [
            {
              "score": 821,
              "content": "Yep, this brought everything into perspective. He doesn’t approve of the marriage, so knowing they’re struggling financially, he’s trying to prevent/cause financial hardship for their honeymoon. Definitely TA",
              "id": 153,
              "comments": [
                {
                  "score": 66,
                  "content": "If he thinks no honeymoon is going to prevent us he marriage he’s an idiot. We didn’t have a honeymoon until our five year anniversary but, we have a strong marriage. This guy is just alone and bitter.",
                  "id": 154,
                  "comments": [
                    {
                      "score": 21,
                      "content": "I was going to say the same thing. The only thing he is doing is ruining his relationship with his son.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Financial difficulties are a predictor of divorce too but OP doesn’t give a fuck about risk factors other then age apparently.",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Yep, that sounds pretty bloody personal",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Also how is that a reason, talk about strings being attached lol",
              "id": 158,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I got married at 20 to the man I’d been with for three years. Idk why older folks are acting like we are “marrying young” my great grandparents got married when they were 15 and 17??",
              "id": 159,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 509,
          "content": "The \"It's my mom's cabin too\" suggests to me that he's not full father. Like, stepdad that hasn't taken full fatherhood status in his own mind. He says \"son\" but he really means, \"my late wife's son\" (MLWS). All the emotions make more sense to me that way.\n\nYTA\n\nEdit: thanks u/CNoelA83 for the gratuitous acronym",
          "id": 160,
          "comments": [
            {
              "score": 153,
              "content": "I wondered about that, too. Seemed like an important detail that wasn't explained. Why does the son mention his late mother?",
              "id": 161,
              "comments": [
                {
                  "score": 249,
                  "content": "Probably cause mom would have let them use the cabin.",
                  "id": 162,
                  "comments": [
                    {
                      "score": 20,
                      "content": "There's no indication in the post about *when* Mom died, or even if she and OP were still together.  I'm wondering if she died more recently and had already said she was okay with the idea of using the cabin, and/or if she and OP were separated / divorced and she had planned to change her will and leave her half of the cabin to son but never got around to it...",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "I assumed because the only thing more AH than billing your son for the honeymoon in a cabin you weren’t renting out anyway is saying ‘well son, if your mom was still alive I might have gifted the stay because she insisted. But now as well as me disapproving of your fiancee and choices, you get to pay the ultimate Air BnB add on fee. Dead mom tax. Because I hate you, I hate your fiancee and remember your mother is dead and missing the wedding and the milestones of your life I don’t give a shit about. Oh and cleaning fee is not included for crying on the bed linen.’\n\n\nLike you can see his son basically asking ‘but dad, what would mom think?’ to try to appeal to OP over a marriage and honeymoon but OP is as cold as an unheated cabin in December emotionally.\n\nThe ‘I’m the sole owner now’ was icy AF. Yeah dude you own the whole cabin because you were widowed and your son lost his mom. Talking like it updated your portfolio suggests OP does not do warm fuzzies unless sales tax is added. He reminds me a bit of my dad who was still complaining last time I spoke to him that he had had to buy bottled water at a tourist price on vacation because I as a chronically ill child collapsed and the water was twice the price as the supermarket. He had been griping about this ‘rip off’ I inflicted for 30 years when I noped out of contact. That was shortly after he married his third wife for tax purposes and her mileage allowance and literally mentioned both in the vows but not in an in joke fashion.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "It was hers, not dad’s, so why does he get to be a dick about using it? That’s why kid/groom brought up his mom. His mom would have let him use it without hesitation, and at no charge, is his unstated point, I think. YTA",
                  "id": 165,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "You mean \"MLWS\"",
              "id": 166,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 337,
          "content": "Yeah that would be cheaper than getting him a wedding present because he could say it is the wedding present or whatever. Either way he has to pay to maintain it. I feel like this guy is intentionally leaving a lot of explanation out too.",
          "id": 167,
          "comments": [
            {
              "score": 6,
              "content": "Well, not defending OP but if his cabin is generally booked / rented during this timeframe, he’d *technically* be “losing money / income”.  But no rental is guaranteed, and it’s not money he’s *paying* out of pocket.  OP is definitely YTA.",
              "id": 168,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 124,
          "content": "OP, YTA. Hoping on this comment since you mention the word gift. Is OP even planning on giving a wedding gift to his son that he clearly isn’t supportive of? Does he plan to go to the wedding, eat their food, and not give them a dime? Could he not let them stay at the cabin as a wedding gift? Also OP mentions he pays to have the cabin maintained, he’d likely be paying that regardless if someone was staying there or not. How does someone staying there a few days impact him at all? Son will go no contact after the wedding I’m betting.",
          "id": 169,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "It’s hard to imagine the father who cashed a check from their child’s honeymoon and feels good about that profit.  But they are real.",
          "id": 170,
          "comments": [
            {
              "score": 15,
              "content": "OPs not expecting any profit, he asked for money because he knows his son doesn't have it.",
              "id": 171,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "I agree - I mean it's OP's to do what he wants with, but damn a stay there wouldn't cost him a thing (except maybe a small amount for a cleaner afterward) and would have been a lovely wedding gift for his son. \n\nHell my BOSS let me and my family use his beach condo once for free, just asked us to leave the payment for the housekeeper on the counter when we left. \n\nOP is just a grinch and using this opportunity to punish his kid for not doing what dad wants him to do.",
          "id": 172,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "He doesn't approve of his son's marriage",
          "id": 173,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "A place to stay on our honeymoon was one of the best gifts we got. My husband’s boss gave us his beachside condo for a week (that he usually rents out) free of charge for our wedding gift. We just paid for travel and food- it was amazing.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Honestly the way he's talking about his late wife it sounds like he didn't care for her that much either. Sounds like a really controlling person who is bitter he's lost control over both his wife and now his son.",
          "id": 175,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "This is 100% dad not agreeing with the upcoming wedding and using this as a cudgel to make his feelings known.\n\nWith friends like these...",
          "id": 176,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3640,
      "content": "YTA.  When you get old and need help to get around don't be surprised if your son charges you for every single thing then says it's not personal.",
      "id": 177,
      "comments": [
        {
          "score": 1258,
          "content": "\"Oooh, Dad, I'd love to help with that project, but the going contractor rate is $50 an hour, and I'm going to need you to cover mileage too. Nothing personal!\"",
          "id": 178,
          "comments": [
            {
              "score": 449,
              "content": "OOOHHH dad, I'd love you to live in our in-law apartment, but the home we were going to put you in costs $3500 a month, so we'll be expecting that. Also, you must keep the heat below 60 and the AC above 85",
              "id": 179,
              "comments": [
                {
                  "score": 363,
                  "content": "Oooh dad, I'd love to take you to the hospital, but an ambulance ride is like $5000. Can you write me a check before we go? Nothing personal, just wanna keep everything all business!",
                  "id": 180,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Wait....ambulances aren't free where you live?",
                      "id": 181,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "“I’d love to drive you home from your hip replacement, but that’ll be $70 per Mille/KM",
              "id": 182,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 112,
          "content": "Lol at the thought his son isn’t just gonna put him in the worst possible assisted living home he can find",
          "id": 183,
          "comments": [
            {
              "score": 26,
              "content": "Why should he bother even finding a home? He can live in his cabin lol",
              "id": 184,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Or just stay away. He can sort his own assistance out.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "\"Need me to help you after surgery? 100 dollars an hour\"",
          "id": 186,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3540,
      "content": "INFO: do you even like your son?",
      "id": 187,
      "comments": [
        {
          "score": 1111,
          "content": "See I'm wondering of he isn't actually a step son, especially with the way he's worded things.",
          "id": 188,
          "comments": [
            {
              "score": 695,
              "content": "Right? The way the son pointed out that it was his mom’s cabin too felt like, “oh, so OP is like his step dad or something.”",
              "id": 189,
              "comments": [
                {
                  "score": 327,
                  "content": "Yeah, I had to re-read it to make sure. But the way he goes out of his way to call his son's fiance his \"Soon To Be Wife\", I feel like he would have absolutely mentioned that it was stepson.",
                  "id": 190,
                  "comments": [
                    {
                      "score": 212,
                      "content": "True. The disdain dripping throughout the entire post was intense.",
                      "id": 191,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "This is almost certainly punitive for the quick/early marriage.",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Want to bet that he dislikes the son’s fiancée for <insert reason here> & is the reason he is so vehemently against the son getting married. Missing missing reasons may apply here\n\nOP: either way YTA",
                      "id": 193,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Yeah thats my guess. It's a step son and he's used the law to steal sons whole inheritance and mom had no idea the guy was a ghoul the entire time. Given the aunt comment it sounds like the cabin used to belong to sons family.",
              "id": 194,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I thought the same, especially after son said it was his mother’s cabin too",
              "id": 195,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 77,
          "content": "Was going to ask the same thing.",
          "id": 196,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 49,
          "content": "He said \"it's not personal\" about a topic related to his son's marriage.  That's the problem, his son is getting married, *it's supposed to be personal.* He's treating him like a customer, not a son.",
          "id": 197,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Is he violent? \n\nDoes he bring shame to the family? \n\nIs he a ginger? \n\nWhat's wrong with this young man that his dad doesn't love him?",
          "id": 198,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2598,
      "content": "YTA. Seriously? Make it a wedding gift if it makes you feel better (unless of course, you were planning on stiffing him on a wedding gift too).",
      "id": 199,
      "comments": [
        {
          "score": 1012,
          "content": "\"unless of course, you were planning on stiffing him on a wedding gift too)\"\n\nThat made me laugh! My mother and father were mad when I got married (at 29 years old!). Well, when I was growing up, my mother was always HUGE into getting couples really nice wedding gifts, wrapping them extravagantly, and writing something meaningful in a card. Like, this woman wouldn't DREAM of going to a wedding empty handed. \n\nBut when I got married? Nothing. Not even a card. I still remember it as feeling like such a deliberate slap in the face, and it really hurt. Btw, we've been married over 22 years now.  And my parents weren't in our lives for about 20 of those years. \n\nIt's incredibly sad when parents refuse to support their adult children's marriages, or even accept their new son/daughter-in-law. OP, take note, because in the future this could be you (having no contact with your son and daughter in law) if you aren't careful.",
          "id": 200,
          "comments": [
            {
              "score": 141,
              "content": "Your comment is good and deserves upvotes for contributing meaningfully to the discussion but honestly I might have upvoted it anyway just because I love your username.",
              "id": 201,
              "comments": [
                {
                  "score": 25,
                  "content": "Aww shucks, thank you!",
                  "id": 202,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Agree you have the best name I’ve seen in a minute. Toe beans are da cutest, especially the fluffiest ones. 🥰 🐈‍⬛",
                      "id": 203,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "Your comment deserves more attention. Did your mother want you to get married at 35, or did she just not like your husband? My mother insisted on paying for my wedding, so she could hold it over my head forever and prove to everyone how wonderful she was for “allowing her daughter to marry a Jew” I wanted to elope. I have been NC with her for 2 years, wish it was 20.",
              "id": 204,
              "comments": [
                {
                  "score": 26,
                  "content": "Honestly, it was mostly about control. I could have married a prince or a billionaire, and they still wouldn't have liked him. They hated all of my previous boyfriends, UNTIL I broke up with them, and then they wanted to be best friends. (Not kidding. My exes would visit my family when I wasn't around. It got weird.)\n\nAnyway, my husband also is NOT the kind of person who puts up with people's BS, and I think they knew that, and were terrified that they would lose control of me. Which they did. The sad thing is they never really saw me as an adult, only as \"their child\" who wasn't doing what they wanted me to do. I finally gave up trying, and although it was sad to not have them in my life, I am so much happier and more at peace now!\n\nI'm sorry that you had a similar experience. Don't worry about the past years that you spent trying to please your mom, just keep looking forward to a better future. Best of luck to you, and much happiness!  :)",
                  "id": 205,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "My husband and I got married last week and my dad did this exact thing to me. Swings his Dick around everywhere so everyone knows he has money but couldn’t get his daughter a card for her wedding. \n\nAlso - we decided on a really quick last minute wedding and jut had a really nice dinner with our parents, grandparents and 5 closest friends and he told me he would have rather spent $100k to have a big extravagant day instead of the small $3000 day we had. Like ok give me a fucking check for $97k then? But it’s all about being for show.",
              "id": 206,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Yeah. My folks didnt approve of my wife either. Unfortunately for them, they now have very limited access to me or their grandchild. You made that bed, now sleep in it.",
              "id": 207,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 116,
          "content": "After this, if I was the kid, he could even offer me the deed to the damn place! I wouldn' want it and would never set a foot in it again!",
          "id": 208,
          "comments": [
            {
              "score": 14,
              "content": "Lol  I would.   And charge dad if he wanted to stay over",
              "id": 209,
              "comments": [
                {
                  "score": 6,
                  "content": "“It’s not personal, it’s business.”",
                  "id": 210,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "He'll probably charge his son for getting him a wedding gift too. YTA OP",
          "id": 211,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "Apparently he did get them a gift.  I wonder what is was",
          "id": 212,
          "comments": [
            {
              "score": 29,
              "content": "Probably a lump of coal",
              "id": 213,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "The bill for his travel expenses probably",
              "id": 214,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1954,
      "content": "If I was your late Wife, seeing you treat our baby that way, I'd be rolling over in my grave and spend every minute haunting your ass. YTA.",
      "id": 215,
      "comments": [
        {
          "score": 372,
          "content": "I’m always a fan of hoping AH people getting haunted",
          "id": 216,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "Agreed. I would absolutely haunt him and make every stay in that cabin miserable for him.",
          "id": 217,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "I would 100% find a way to rise from the grave and drag him down to hell with me.",
          "id": 218,
          "comments": [
            {
              "score": 15,
              "content": "If his stove starts turning on, on its own, he certainly won't have to wonder why lol.",
              "id": 219,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "If I did this to either of our kids, you can bet my wife would do that.",
          "id": 220,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1673,
      "content": "YTA \n\nYou pay to keep it maintained whether it’s in use or not, you could’ve done a nice thing for your son that cost you nothing and still tried to stiff him.",
      "id": 221,
      "comments": [
        {
          "score": 260,
          "content": "Seriously, if the guy is insistent on getting SOME return on this arrangement he could have easily been like “sure thing” and then asked the son to help him do some maintenance work later down the road. That’s a much more common “trade” in these types of situations.",
          "id": 222,
          "comments": [
            {
              "score": 16,
              "content": "That would have been the emotionally healthy thing to do anyway. Doing the springtime maintenance together would have been great bonding time. And most 20 year olds need to learn some home repair skills.",
              "id": 223,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1388,
      "content": "YTA. You said yourself they’re struggling for money, why do you think he asked you? He’s right, by the way, it was his mother’s cabin too.",
      "id": 224,
      "comments": [
        {
          "score": 640,
          "content": "Oh no. That’s irrelevant now that she’s dead. Didn’t you read his stance. Hey son, your mother is dead, everything that was hers is all mine now. OP is an asshole.",
          "id": 225,
          "comments": [
            {
              "score": 141,
              "content": "Thats exactly why, even though i love my Other half to peices, should something happen to me, my life insurance and assets (minus liabilities and a stipened for my husband ofc) are all to be placed into trusts managed by unbiased (lawyers) executors, until my kids turn 18. \n\nSo that no matter what, evil step mom? No problem. Husband has a fall out with kids? No problem. Husband passes and leaves everything to charity cause screw the kids? No problem. I want to make sure should something happen that they're covered 100% for their future if i cannot do so myself, no matter what because they didnt ask to be here.",
              "id": 226,
              "comments": [
                {
                  "score": 11,
                  "content": "What’s an OH?",
                  "id": 227,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "That is really smart. I adore my husband but yeah these things can happen.",
                  "id": 228,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Yup. I was a single mom for years to my daughter, and even tho I love my bf, the house I bought with my loan remains in my name, and if I die, my mortgage insurance pays it off and it’s hers. And the bulk (80%) of my life insurance and 401(k) goes to her, as well (he gets the 20%). And the person who is the executor until she turns 18 is not him. It’s not that I don’t trust him, but why even allow that to be a possibility? The person who is is someone I trust implicitly because they already have their own stuff (that I’m 99% sure they also plan on leaving to my daughter when they die). And it’s not like my daughter would kick the bf out. He’s like her favorite person. But I would fend off death in order to keep my child from doing without. I can’t imagine just willingly neglecting them like that. Disgusting.",
                  "id": 229,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "The comment about it being his mother's cabin, too made me wonder if OP is a stepfather.",
          "id": 230,
          "comments": [
            {
              "score": 28,
              "content": "Nah, this seem like the kid of guy who would say STEP Son.  As a step son who knows this OP type very well, these people make it clear who is who.",
              "id": 231,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}