{
  "post content": "Hello reddit, I'm writing this because a situation just happened with my little brother that I think is absolutely ridiculous. Back in July, my family and I were vacationing in France, I asked for an XBoX controller for my games. My little brothers both had controllers, I initially asked for an Elite controller which is 160-ish USD, but my parents declined, so I went for a run of the mill white controller. I got it, and this was unacceptable for my brothers, they had black ones and apparently their black controllers now sucked. They tried to take if from me and swap it for their own controller, they claimed that there was a difference other than the color which justified them taking it. At least that didn't work.\n\nIn December, my little brothers and I asked for rechargeable batteries for our controllers, my dad agreed to buy us the chargers, I also asked him if I could buy a condenser microphone, an AT2020, I would be paying for it from the money I earned obviously.\n\nMy parents and my siblings come back from their vacation in Dubai, and there are only two batteries in their luggage, my dad tells me that he forgot I wanted them, though my little brothers told me that they had convinced him that I don't need it. I don't know who to believe but that's irrelevant, I find the microphone, but it's not an AT2020, I won't complaint since it's still a condenser and better than my blue snowball ice, I take it into my room, but then my sister gets angry that her microphone is missing, I thought my dad must've gotten her a mic too, my dad the finds me using the mic, grounds me and gives it to her, turns out he bought the mic for her in the first place. At this point I'm clearly pissed off, so I retreat to my room and go to sleep.\n\nLater that week I ask my dad for the battery, my little brothers had gotten a knock-off battery, I asked my dad for an original Microsoft one, which was somehow cheaper than the knock-off, he agreed. My little brother whined about it but I didn't think much of it. Come delivery day, there are two batteries in the box, I excitedly thank my dad and unbox them in my room. I thought he had also gotten me a spare charger. Nope. My little brother comes into my room screaming and starts kicking my stuff, turns out he also got an original charger too, even though he already had one. I thought this was unfair because he had two batteries while I had one.\n\nWhen I asked my dad how come he gets whatever he wants and I have  to consistently ask him about it he tells me when I was his age I had everything I wanted, which consisted of a PSP and a Pentium powered PC that couldn't do jack shit. I was grateful that I did have them as a child though so I decided to drop it. For reference my brother's PC is has an i7 and a respectable graphics card. My current PC is way better than his, but that's irrelevant to the argument.\n\nA few weeks later my brother buys his second and third copy of Minecraft, the third copy is an XBox one edition which he can't even fucking play, my dad gets it for him anyways because it's cheap. He then goes on a buying spree where he buys Just Cause 3 and FIFA 19, which I asked for as well. My dad did give me the origin login details for FIFA 19 which was nice of him, and I did already have Just Cause 3 on my steam account, I still don't understand why my dad didn't just force me to share my account with him instead of buying the game twice.\n\nLast night shit really begins to hit the fan, as my brother buys his third copy of the same star wars game, and my dad agrees to get him GTA V (he hasn't bought it yet), which he rejected when I asked him a few months prior. This pisses me off.\n\nThis morning all hell breaks loose when my other little brother and I learn that my first little brother is not only buying the 200USD controller that I asked for in July, but he's also buying a PS4. Even though he has a computer than can run all the games he plays and he doesn't own any PS4 games. I get angry, and my dad tells me that there are certain things which are appropriate for my 8yo brother that aren't appropriate for me (15yo). Like 3 copies of minecraft, 3 copies of starwars, a PS4, fucking GTAV, and a 200USD Xbox elite controller.\n\nHe also told me that I have many things to be grateful for that he doesn't have, like a very powerful PC, and an XPS laptop, a massive collection of Rubik's cubes, which I had to restart a year ago when he destroyed all 37 cubes I owned and had been collecting for 7 years and were worth over 500USD. (I never got compensated and my little brother never got punished).\n\nThat's not my point, I recognize that I am privileged and that I do have many things to be grateful for, my point is that it's unfair that my brother gets to spend my father's money in whatever ways he wants, to buy whatever he wants whenever he wants, even though he doesn't use most of the shit he gets, and on top of that, if we both ask for something he gets it and I don't.\n\nThanks for reading through this if you did, please give me your feedback, what do you think, am I the asshole?\n\n&#x200B;\n\nEdit: I saw some people telling me to spend my own money, everything I'm getting I am paying for with my own money which I earn, but all the money I earn goes through my dad first.",
  "id": 1,
  "comments": [
    {
      "score": 75,
      "content": "ESH you all sound like entitled spoiled little shits if u ask me",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 43,
      "content": "ESH. It's clear that your parents don't set any real boundaries when it comes to providing you all with privileges like gaming stuff, it sounds like they can't remember who has had what and where and simply respond to the child who is making the most noise about it. I wouldn't say you're an asshole exactly, I think the fact that you are questioning if you're being unreasonable shows you have the ability to reflect on the fact that you're getting upset about material things. It sounds cliche but it isn't important -  just rise above it and be happy for what you have, and you'll be a better person for it in the end. If you keep being resentful for what others have you'll never be satisfied with what you have. ",
      "id": 3,
      "comments": [
        {
          "score": 6,
          "content": "Thanks.",
          "id": 4,
          "comments": [
            {
              "score": 6,
              "content": "I know a lot of people are bashing you for being entitled, but good on you for taking it and thinking about it. You can't help being brought up in a privileged environment, but you can choose how you react to it.  ",
              "id": 5,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 30,
      "content": "ESH.....I stopped reading after the “Dubai Vacation” part, what a joke.",
      "id": 6,
      "comments": [
        {
          "score": 3,
          "content": "Most of the time my dad lives in Dubai, we live in Jordan, they were visiting him with my mom, then they were all coming back.",
          "id": 7,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 23,
      "content": "ESH. \n\nNot one thing mentioned was a \"need\". You all have \"wants\" you throw constant fits over.  That's not ok for any of you, regardless of the possible age brackets here.\n\nYour parent's suck for ever letting it get this bad.  ",
      "id": 8,
      "comments": [
        {
          "score": -7,
          "content": "I don't need any of these things, I recognize that. I want them.",
          "id": 9,
          "comments": [
            {
              "score": 11,
              "content": "Right.  People don't throw fits over wants. They don't point fingers at what others have.  Its not the right way.  You all sound so young.  Dont let this be the way you choose to live your life.....",
              "id": 10,
              "comments": [
                {
                  "score": -2,
                  "content": "I haven't thrown a fit. But I get it",
                  "id": 11,
                  "comments": [
                    {
                      "score": 8,
                      "content": "When you mention \"all hell breaking loose\" over a gaming controller......that's a fit. ",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13,
      "content": "ESH\n\nHas the concept of sharing been completely lost on your household? Like why can’t you and your sister share the microphone? Why can’t you and your brother share the PS4? Try to not focus on ticky tack bullshit like who gets what and what belongs to who and act like an adult. Act like a child, get treated like a child. If you calm down and act reasonable your dad is more likely to listen to your requests. ",
      "id": 13,
      "comments": [
        {
          "score": 3,
          "content": "You make a good point about sharing but dude you seriously shouldn’t make assumptions and point such blame on OP like that. Not cool. ",
          "id": 14,
          "comments": [
            {
              "score": 0,
              "content": "You’re right, I was harsh. I don’t think I was wrong, but I was harsh. I edited my assumptions out. ",
              "id": 15,
              "comments": [
                {
                  "score": 2,
                  "content": "You *are* wrong to make assumptions about people like that. You do not know OP, nor do I. Thank you for correcting it, though. ",
                  "id": 16,
                  "comments": [
                    {
                      "score": 1,
                      "content": "That’s not what I meant. I admit I’m wrong for making assumptions. I’m just saying I don’t think the assumptions that I wrongfully made were wrong. But just because I think my assumptions are probably correct doesn’t mean I should be broadcasting them. ",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "The PS4 isn't the issue, it's the consistent spending, also sharing means I have to pay for a portion of it and I don't have that money atm.",
          "id": 18,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "ESH\n\nEspecially your parents. They spoiled you and your siblings.",
      "id": 19,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "ESH in my opinion.",
      "id": 20,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "NTA but as you're only 15, I'd take this as a learning experience for life in general. Things aren't fair and as you grow you'll realise that people will receive things or praise that you should also get, but don't.\n\nI'm a younger brother and looking back, I probably got spoilt more than my older brother because I'm the youngest. My older brother thinks it's unfair but he hasn't held it against me. My parents are adamant that we both received equal presents etc but I'm not sure this is true.\n\nTldr/ life isn't fair, don't hold a grudge",
      "id": 21,
      "comments": [
        {
          "score": 2,
          "content": "Thanks a lot for the advice.",
          "id": 22,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "i think its a nta but your dad and siblings kind of are",
      "id": 23,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA, but certainly priviliged (which isn't necessarily a bad thing) . Your little brother is being an asshole, but that's because he is a kid. No doubt your parents should punish him for the rubiks cubes thing and should be taught to respect you like you respect him .",
      "id": 24,
      "comments": [],
      "relation": "Support"
    }
  ]
}