{
  "post content": "Okay just writing the title like that made me feel super guilty, but please hear me out before judging too harshly.\n\nI (38 F) have 4 kids ages 11 months, 3, 5, and 10. I love them all more than anything, but I’ll be the first to admit that our house is constant chaos and it can get very exhausting. My sister (33F) is child free, but loves my kids and was happy to watch the older 2 or sometimes 3 to help me keep my sanity. This has been extremely helpful and I tell her all the time how grateful we are for her help.\n\nThe thing is that the kids used to go over to her house, but right now they couldn’t because my sister was fostering an elderly chihuahua. My sister claims she couldn’t have them over for the time being because they would stress out the dog. Her dog was extremely frail and timid so I think this was a fair assessment. This was the 4th dog she has fostered, all of which couldn’t be around my kids. This most recent dog took 8 months to find a home for, but most of her other dogs took even longer. When she told me she found an adopter I knew I could finally breathe a sigh of relief and joked about how I was so glad she could babysit again.\n\nMy sister proceeded to tell me that there was a second dog that desperately needed a new foster, so she planned to take in that one as soon as her current dog was gone. So, she couldn’t do anymore babysitting than she already is (sometimes she comes over to my house in the morning to help out). I could literally feel my stress levels spike. I haven’t ever done this before, but I opened up to her about how much I have been struggling since she got the dog. How little sleep I get each night, how my husband hasn’t been helping as much as he should, and some other deeply personal issues that I’ve been struggling with. Then I asked her, point blank, to not get another dog.\n\nShe comforted me, but ultimately didn’t agree on anything and said she needed some time to think. I know I am asking a lot of her since rescuing dogs is her passion and that is why I feel so guilty. But I don’t have anyone else to help me. I can’t afford a babysitter long term, and my friends all have their own kids to look after. Above all, my kids will always come before a dog and that’s the reason I was willing to request it. I’ve told a few different people about the situation and gotten a wide range of heavily biased opinions. So that’s why I decided to come on here and as you guys. Was this unreasonable? I would never demand her to do this if she didn’t want to, but is it really so wrong to just be honest my situation and earnestly ask?\n\nEdit: I am grateful for the honesty from people respectfully telling me that what I did was wrong. However I have also read a lot of horrible assumptions from people as well and I’d like to clear them up. I am not some careless mother who just keeps “popping out children” that I can’t take care of. My husband is not a deadbeat dad. After our youngest was born he got severe depression. He isn’t out having fun while I’m working 24/7, he is miserable. I went to my sister instead of him for help because I don’t want to lose him. I love my kids and I have always made every one of my decisions with what I believe are their best interests in mind. And no I don’t think my sister is obligated to do anything for me, I was asking for help not demanding it.\n\nEdit 2: Insulting my husband doesn’t help anyone. Yes he is in therapy and is on antidepressants. Anyone who has actually dealt with depression would know that that isn’t an instant cure all. Still my husband does the very best he can. I asked my sister because I needed more help than he can provide right now.",
  "id": 1,
  "comments": [
    {
      "score": 39728,
      "content": "YTA.\n\nAbsolutely no one loves to admit this to themselves, but your own life choices led you to this point. Your exhaustion, your sleepless nights, that fact you're broke, your inability to find a consistent babysitter... these are all problems you've invented for yourself by having children outside your means.\n\n*Your sister's time isn't any less valuable just because she's child-free.* Child-free people don't exist on this earth to watch your children. It's wonderful that she's offered to watch them as much as she has, and it's great that you remember to thank her often, but you have to understand that when she *does* watch your children, it's not because her time is worth less than yours and it's just naturally expected that she help you. **Her time is not something you're entitled to, and her help is not something that's owed to you just because you're a parent and she's not.**\n\nTry to take the incoming flood of criticism as a wake-up call. If your husband isn't pulling his weight, it's time to consider counseling. Cast your net out over the area and see if you can pin down an affordable babysitting network. Field your options and stop leaning on your sister to solve your problems.\n\n\\---\n\nedit -- I sleepily clicked on reddit this morning and was flabbergasted to see that this comment blew up in this way. I can't thank you all enough for the rewards, for sharing your experiences and stories with me, for the civil debates happening down below, and for your kind words. I don't know what to say. Thank you.\n\nFor the record, I promise I don't lack sympathy for OP's situation -- just patience. The fact that husbands like this exist drive me absolutely up the wall. -- edit -- OP says husband has clinical depression and is doing the best he can, so I'll back off this point. If OP lives in a state where a support network isn't readily available (birth control, work comp, parental leave, affordable daycare services) and she didn't have much of a personal say in how much children she had because the husband pressed the issue, I sympathize with her cornered feelings and again urge her to reach out for options. But any implication whatsoever that the sister *should* be available because she's child-free is an absolute no-go and OP needs to get that out of her head immediately.\n\n\\--\n\nedit #2 - I waffled on whether or not to add this, but after reading some more responses, I think I do want to very gently cap this off to help clear up one more thing.\n\nThe problem here wasn't the act of asking itself. It's examining why, in any society, this is something that's generally acceptable to ask from a child-free person at all. This wasn't a matter of asking for an increase in daycare services -- it's asking someone to completely restructure their way of life to accommodate your own, because deep down, there's still an implicit assumption that your agenda as a child-bearing person is more valid than the agenda of a child-free person.\n\nThe reason this hits so close to home for so many people is that even in 2022, the societal recognition of value for child-bearing people over child-free people continues to demean and damage those who choose to go without. It's a *constant battle* to find self-worth when it's implied, even quietly -- even accidentally -- that your needs and passions are lesser. That as a non-parent you're somehow inadequate or have something to prove. This is especially true as a woman. The older you get, the harsher the judgment you receive.\n\nAgain, these were awesome discussions. I was privileged to read through them today. Thanks again.",
      "id": 2,
      "comments": [
        {
          "score": 22304,
          "content": ">But I don’t have anyone else to help me.\n\nThis here got me.\n\nHow about instead of her child-free sister she asks her deadbeat husband? The deadbeat **father of her children** who isn't helping her enough?\n\nI mean, he is the one who keeps getting her pregnant, not her sister.\n\nYTA OP, stop making more children instead of policing your sisters life.",
          "id": 3,
          "comments": [
            {
              "score": 8578,
              "content": "OP even admits her husband isn’t pulling his weight as the other parent. well, that means it’s time to have him take responsibility for creating those kids with you. your sister had no part in that whatsoever and is not obligated to provide help when the parents aren’t doing their job.",
              "id": 4,
              "comments": [
                {
                  "score": 4826,
                  "content": "Dude at what point did she realize that this lifestyle was stressful and a burden to her? It def happened before kid 4 and I’d bet it was probably after kid 1 or 2. But nope let’s pop out a few more! Congrats OP you’ve now got 4 lives in your hands that you aren’t equipped to take care of and instead of realizing that early on and limiting your burden both to yourself and society, now we’ve got 4 more kids that won’t get the attention they need because “being a mom is such a hard job that I decided to do it 4 times.” YTA YTA YTA SO MANY TIMES! I’d be shocked if all 4 kids grow up mentally and emotionally stable.\n\nEdit: and I’m sure the kids aunt will get blamed for some of it",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1976,
                      "content": "Based on the timeline, OP's sister started fostering dogs *before* baby number 4.\n\nI can't help but imagine that might have been a breaking point for the sister. If I was helping my overburdened, overwhelmed sister with babysitting - and meanwhile her husband is over there doing nothing - and, you know, the toddler is almost preschool age, what a relief! And then she turns around and gets pregnant by her useless husband *again*? I'd be done. Even a saint would be *done.*\n\nIt's not like the sister can wait until OP doesn't need her anymore because... where's the end? (OP, is this latest kid going to be your last one or ...?)\n\nLook, I don't like to judge people for having too many kids, but if you can't take care of them on your own, then yeah... you have too many. #it takes a village, but if the village you're using is just one person then it's not sustainable.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 212,
                      "content": "All I can think of is how the eldest child is going to become a parent and have to grow up so fast. That happened to me, since my parents popped out six kids they couldn't afford. Dad won't help, sister is trying to live her own life and the burden is fully going to fall on that oldest kid",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 36,
                      "content": "Agree so much. Four more thoroughly f*cked up, unhappy humans on this planet who will suffer through decades of emotional neglect by this irresponsible woman.\n\nWhy??? just why??? do you people keep popping out kids???\n\nKids who deserve better than an overwhelmed mother who is not equipped to raise them\nwith the patience and attention they deserve???\n\nEdit: a typo",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 34,
                      "content": "IMO, it wouldn't surprise me if it started with kid 1 or 2, and it wouldn't surprise me if kid 1 and 2 have to help watch kid 3 and 4",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 26,
                      "content": "I so wish you could have told this to my mother who this describes perfectly, including the 4 kids part and martyr complex",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "I wonder if the aunt fosters the dogs because it gives a good reason for not being able to watch the kids",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "Being a mom is the most stressful thing I have ever done. However I will NEVER expect anyone to watch my child, even my daycare lady and I have been flexible on days that she's not feeling well or had something come up she had forgotten about. No harm no foul it's life. And I pay her. It has me questioning if I do want a second (I do but I'd be perfectly happy with just my son too honestly). I understand where OP is coming from but exactly this - this isn't a new development, I'm sure you've felt burdened a LONG while. Make your husband help. They are his kids too. It shouldn't be all on OP to do this alone (moms do need a community of help/support) but OP you are not entitled to anyone's time more than they can give especially when it comes to something your sister is passionate about. Those dogs wouldn't find homes otherwise.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "She's in denial probably; it can be tough when things don't go the way you expected, but she's going to have to find different resources.\n\n(I do have four kids very close in age myself; I deeply feel for OP but it's not the aunt's responsibility)",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "Yeahhhh.  I once was talking to a girl and things never went anywhere.  She found someone else and got knocked up and became a single mom.  She reached out to me one day and berated me for not dating her and causing her to have a kid.  The lengths that some people go with their logic just baffles me.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 195,
                  "content": "[deleted]",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 49,
                  "content": "Instead of blaming sister for not helping enough why not go to the other adult living in the same house who actually helped create the problem?!",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "I honestly just don't understand why this is such a common story with most parents I know. The dad doesn't do shit, yet the couple continues to procreate??? I don't understand why people who have found it to be stressful, breaking the bank, etc continue to have children and expect other people in their lives to completely change their lives to help them. When you could just use a condom and stop",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "This! She feels entitled to request that her sister put her life on hold vs asking her husband to do his job. There is nothing more infuriating than the person who is not willing to confront their decision making and then put the responsibility on someone else.\n\nOP - let’s reverse your story. Your sister comes to you with 4 dogs she decided to foster and here they are all fighting and ripping the furniture. She requests (actually respectfully demands) you to put 2 of the dogs up because dogs are more important than furniture and you know that’s what you should do…\n\nYTA",
                  "id": 18,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 21,
                  "content": "Wow, if instead of speaking to your living able bodied husband about being stressed out and needing more support, you jump to asking your sister to give up her passion to be always available as her on call childcare , then somethings gone horribly wrong.\n\nOP needs to confront what’s gone wrong in her marriage and apologise to her sister. I really hope sis doesn’t give up her passion to step in so the dead beat doesn’t have to look after his kids, and (as cold as it is) to pay the price for OP deciding to have 4 kids with a man who doesn’t pull his weight",
                  "id": 19,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "The part about finally opening up to her sister about her husband not pulling his weight was honestly hilarious to me. Like yeah…she already knows lmao",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2789,
              "content": "This. She even specifies that rescuing dogs is her sister **PASSION** but, still asked her to stop doing the things she enjoys so her sister can watch her kids instead of *their own father*. \n\nThe harsh truth is, you kids may come before a dog to you, but **no else is responsible for your kids but you**. \n\nI was sympathetic until I read that.\n\nYTA",
              "id": 21,
              "comments": [
                {
                  "score": 838,
                  "content": "A passion for dogs seems to run in the family- except OP married one instead of just fostering.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 300,
                      "content": "Don't insult the chihuahuas.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 30,
                      "content": "the burn unit has to be overflowing, (I am in need of ointment), I can still feel the heat from that burn, damn.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 393,
                  "content": "this ^\n\nher kids come before her sister’s passion for dogs…i mean *obviously* 🙄 it’s like saying “yes i would sacrifice my sister’s dogs” how generous",
                  "id": 25,
                  "comments": [
                    {
                      "score": 45,
                      "content": "kinda like Lord-Farquaad-Syndrome:\n\n\"Some of you may die.... but that's a risk I'm will to make\"",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 272,
                  "content": "Right? Like “my kids come before a dog always”… to *you.*",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "Man I’m a mother, and I remember after having the first one how hard it was, I told myself I’d never have another child until I’m 💯 sure I wasn’t going to struggle !! It took me 12 years before I got to that point!! Two children later and I depend on no one but my husband, their father!! I can’t stand when parents come up with these excuses, not even the single parents because why keep having more of the situation wasn’t ideal!!!",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": ">no else is responsible for your kids but you\n\nAnd their father. \n\nTheir father is also responsible for the kids he had hand in creating and if OP needs help she should make their other parent step up instead of asking her sister to give up her passion.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "But Op's kids are *her* passion, so they should be her sister's passion too, right???? *EYE ROLL*",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "Yes that line was bothersome. The kids are more important - TO OP. The sister may - and has the right to - feel differently.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "This is what got me. OP acknowledges that this is her sister's passion but she doesn't care enough to respect that.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2127,
              "content": "Right?! I assumed OP was a single mom until I got to that point!",
              "id": 33,
              "comments": [
                {
                  "score": 2366,
                  "content": "I'm 100% sure the sister is dead tired of being taken advantage of and being forced to babysit, and fostering dogs is they way she chose to say no.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 1647,
                      "content": "Or maybe fostering dogs is what makes her happy and fulfils her life? Probably, and op is all “give up what you love and babysit my kids.”",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 311,
                      "content": "[removed]",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 45,
                      "content": "OP's whole \"my children will always come before dogs.\" They will and should come before dogs for OP but she doesn't get to decide what her sister's priorities are. Maybe the dogs really are more important to her. My pets are more important to me than my SIL's children. I had no choice to create those kids nor any part in how they are raised. So if they are monsters I didn't create that. I wouldn't let those kids be homeless or starve but I did choose my pets, I raised them, I make space for them in my life and the same ask by my SIL would be a hard no in my life. I'm concerned if OP has a ten year old that can't be chill around an elderly dog as it along with the constant chaos comments seems to indicate potential behavioral issues along with having too many children.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "This - a relative of mine would constantly rely on my for dog sitting, often with little notice and much entitlement. Her dog was fine - a sweet, cute terrier mix, but I'd have to change my plans around to be sure the dog was fed and walked and not left alone for too long. It was kind of a pain, especially when I wasn't give a lot of notice. She just started \"assuming\" I'd watch the dog whenever she needed me to like it was some kind of privilege.\n\nEventually, I adopted a dog of my own after not having one for many years. He ended up being dog-reactive and, being much larger than my relative's dog, I couldn't even chance having them together. So, I could no longer watch her dog. And boy was she angry - angry she was losing her free, on demand dog sitting. \n\nWell, guess what happened? SHE MADE ALTERNATIVE ARRANGEMENTS - yes, it was inconvenient for her and yes, it cost her money. But, how sad, too bad. Ultimately, it was HER DOG and HER RESPONSIBILITY, not mine. I was actually kind of glad things worked out the way they did because I wasn't the dog-sitter on call anymore.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "The sister still comes over and helps OP at her house, so it’s not even like the sister doesn’t help her, it’s that the sister isn’t able to have the kids pawned off on her anymore.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Some people genuinely think that when someone spends their time and effort doing them a huge favour for nothing in return that a simple 'thank you' and a pat on the back should be more than enough for them to want to do it indefinitely. It's so refreshing to see so many people (many of whom are likely parents themselves) coming to the defence of childfree people, it doesn't happen very often.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": ">Above all, my kids will always come before a dog and that’s the reason I was willing to request it.\n\nThis bothered me.  Your kids will come before a dog..to YOU.  But it is not required that your sister put your kids before fostering dogs.  I understand that you are tired and exhausted, and you can certainly ASK for help, but you cannot demand it. These are your kids, and your husband's kids, not hers.  You might consider demanding more help from your husband instead. He is the other parent here.",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Actually becoming a single mom was less work than being wife to a deadbeat",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 924,
              "content": "Urgh OP is acting so entitled! And I'm saying this as a mother of 4 under 5 (including 6 month old twins and a child on the spectrum) I get its hard at times, you never stop, my husband works 7 days a week and a family who doesnt help out. most of the time so its just me and the brood so believe me i get it OP...but you sure as hell never expect anyone else to look after your own life choices. You should be thankful her sister helps as much as she does. \n\nHonestly I would rethink how you organise your day, make sure you have that 10 minute decompression when they're finally in bed. And remember when they're all at school you can start working again and gain some of your identity back, it does have an end. I won't call you an asshole because you're feeling overwhelmed but you need to figure out how to get by without a support network. Please stop pestering your sister though.",
              "id": 43,
              "comments": [
                {
                  "score": 233,
                  "content": "I didn't think she was an asshole because she's exhausted and overwhelmed, I think she's an asshole because she genuinely expects her sister to not only give up doing something she is very passionate about but also to use that time helping her out with no mention of any kind of compensation. Just out of the goodness of her heart!",
                  "id": 44,
                  "comments": [
                    {
                      "score": 41,
                      "content": "She’s an asshole for having 4 kids in her situation.  \n\nPeriod. It’s far more basic than people are making it. She literally knew she couldn’t handle this and was like, “YEA LETS GO!”",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "God bless you, it sounds like your hands are full too. \n\nI feel the same way. About to have 3 kids ages 3 and under and it is wildly exhausting, but I chose this. Me (and my husband). No one else. At the end of the day even when I'm wiped out beyond belief they are MY little treasures. Sometimes when I'm overwhelmed I reframe my thoughts about much I look forward to talking about the day with my 3 year old daughter when I put her to bed. She tells me funny stories from preschool, we talk about the best part of her day, the things she is looking forward to for tomorrow. And I go to sleep thankful that I have happy healthy children, as exhausting as they are.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 62,
                      "content": "It does get better! My kids are 9, 11, 12, and 13. They all just left for school and my house is quiet. I work on a casual basis (thankfully our finances allow this) and look after all of the appointments. Otherwise I get to do my own thing, talk to friends, read, etc. It does get easier.\n\nHaving said that, my husband is wonderful and made sure that I had a decent amount of down time when the kids were younger. It got really, really hard during Covid, but *most people* don't plan for a pandemic.\n\nTo OP, YTA. Exchange babysitting with other moms, take the kids to the park and sit on a bench, tell your husband it's his turn to act like a parent... Find a way to get your needs met without asking your sister to give up her passion.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "I really hope OP sees this comment. It sounds like she is flailing and has been leaning too hard on her sister for too long instead of addressing the real problem and creating a structure that is sustainable for her and her family. It's also important to reach out to your mom-friends as that could be an untapped support system of people who do understand what she is going through. When my friends and I became moms, we all made sure to check in on each other (even though everyone is busy) we still take turns watching each other's kids when someone needs a break or is having an emergency, we do things like coming over for a few hours when there's a new baby so mom can shower, etc, or I will often take my friends' older kids on a playdate while they tend to the younger ones. This sounds like it's about OP not knowing how to ask for what she needs because there is only one person she feels comfortable asking and she has now exhausted that resource. Gentle YTA because I'm sure it's hard to think clearly at the moment, but you may have other people in your network that could help spread out the responsibilities more and it sounds like its time for you and hubs to go to counseling.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 654,
              "content": "Your comment, and the one above took everything out of my head. The only other thing I would say is this: OP had another baby after her sister started fostering. That’s nobody’s fault but her own. Stop having kids if you’re crumbling, and your husband is basically a pet rock. Harsh reality, but reality nonetheless.",
              "id": 49,
              "comments": [
                {
                  "score": 157,
                  "content": "Lol, at pet rock.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Love your name.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "The fact that choosing whether to have a child was based on her perception of how much of her sisters time she could monopolize is so gross. I'm child free and my sister has the greatest kid in the world, but is hyperfocused on not imposing, to the point of me requesting more time with her!",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "And if birth control isn't an option.\n\n\nCondoms. But I'm guessing the husband hems and haws about condoms.",
                  "id": 53,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 522,
              "content": "Yeah this made me mad. She says that her kids “will always come before a dog” to justify making her sister take care of the kids (heavily guessing she does this for free), but it sounds like her kids don’t come before… whatever their own father is doing instead of helping. \n\nOP, YTA for being so entitled. Tell your husband to help instead of making ridiculous demands on your sister’s lifestyle. It sounds like she’s helping you a lot and you should be grateful.",
              "id": 54,
              "comments": [
                {
                  "score": 41,
                  "content": "That was the worst part for me. *My* kids will always come before a dog. That’s fine if it’s her dog, but it’s not. It’s her sister’s dog. She doesn’t get to choose how her sister prioritizes her life.  \n\nI’m a mom, and I can’t imagine being this entitled.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": ">She says that her kids “will always come before a dog” to justify making her sister take care of the kids \n\nThis is the line that got me. OP, your kids may be more important to *you* than her dog, but *her* dog(s) can 100% come before *your* kids in her life. Kids aren't everyone's universal priority.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 515,
              "content": "I had to reread this to see any mention of the father and then she mentions that she can't afford them. Were they all accident babies now? No one is entitled to demand services from relatives.",
              "id": 57,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 240,
              "content": "This. She even specifies that rescuing dogs is her sister *PASSION* but, still asked her to stop doing the things she enjoys so her sister can watch her kids instead of *their own father*. \n\nThe harsh truth is, you kids may come before a dog to you, but *no else is responsible for your kids but you*. \n\nI was sympathetic until I read that.\n\nYTA",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 122,
              "content": "I got a few lines in and kept thinking *\"boo, fucking hoo! You chose to have kids, your problem, bloody deal with it\"* and that sentiment didn't change the further down the post I got. How does she think  *single* parents manage? FML",
              "id": 59,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 40,
              "content": "Right? That part really got me pissed. \nI get op is frustrated,  but she misdirected  that frustration to another woman and not the husband. Op should  put her big girl pants and demand  her husband  to do his duty as a father. The sister shouldn't  even have to go to op's house in the mornings.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1981,
          "content": "And stop having more kids!!!",
          "id": 61,
          "comments": [
            {
              "score": 2274,
              "content": "The youngest kid is 11 months. And \"This most recent dog took 8 months to find a home for, but most of her other dogs took even longer.\" So her sister hasn't been able to babysit as much for a LONG time now, but OP decided to add another kid to her exhaustion and struggle regardless and then get huffy with her sister for still not making herself available. \n\nI don't like to judge people struggling with big families too hard because you never know what circumstances led to that situation, but this one earns a bit of side eye from me.",
              "id": 62,
              "comments": [
                {
                  "score": 1551,
                  "content": "There's a difference between 'falling on hard times' and 'continuing to dig yourself into a deeper hole'. I try not to judge too harshly either, but folks need to not have kids (or more kids) if they're already struggling.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 399,
                  "content": "OP decided to add another kid to her exhaustion and struggle with a man who doesn't help and gets huffy with her child free sister for engaging in her own passion. \n\nFtfy. \n\nOP, YTA in so many ways. The sheer entitlement!",
                  "id": 64,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Here's an idea - if your husband doesn't help out with the first kid, don't continue to have kids with him.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Right! All the \"because I have kids, the world has to circle around me\" bs.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "THANK YOU!! I was doing some math in my head and was like... Ummm wait.... You had yet another kid when you were already supposedly overwhelmed and she was no longer babysitting?!?! Wtf?!??",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "What's the bet that the deadbeat husband doesn't like condoms and she doesn't want to argue that.\n\nThese situations just make me sad.\n\nShe even said in her post she has noone else to help her WHEN SHE LIVES WITH THAT SOMEONE ELSE.\n\nSome people need to respect themselves just a little bit more.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 38,
              "content": "Why do so many people have kind outside of their means thinking they will \"make it work\" which means expecting others - usually family - to help raise their kids. \n\nLike people can barely afford to be single and this includes having time off to take care of one's self.",
              "id": 69,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "I wonder if this is why the sister is maybe taking one dog after the other without a break. Because then she doesn’t have to feel guilty about saying No. I get the impression OP would make her feel awful for saying no without an excuse. YTA get your husband off his lazy arse and get your house in order. It’s not someone else’s responsibility to give you a break!",
              "id": 70,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1167,
          "content": "I bet the sister has taken care of the kids alone more times than the husband ever had.  \n\nYTA, OP.  It's you and your husband's job to take care of your kids, not your sister's.  Leave her alone and let her foster the dogs in peace.",
          "id": 71,
          "comments": [
            {
              "score": 325,
              "content": "I bet the sister has helped with the kids more times than OP has ever even offered to help with the dog(s).",
              "id": 72,
              "comments": [
                {
                  "score": 30,
                  "content": "I bet I’ve offered OP help with her kids as many times as OP has offered help for her sister’s foster dogs… and I haven’t…",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 883,
          "content": "Her time, and her happiness. I'm assuming that her sister really enjoys fostering animals. Or she just loves the break it gives her from the kids. \n\nOP can't expect her sister to give up what brings her joy because it inconveniences her.",
          "id": 74,
          "comments": [
            {
              "score": 968,
              "content": "My first thought was ' she's not unavailable to babysit because she fosters dogs, she's fostering dogs to ensure she remains unavailable to babysit'.",
              "id": 75,
              "comments": [
                {
                  "score": 417,
                  "content": "Ok so which dogs are bad around kids?  Yes ill take one of those... you know better make it two.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "And I’m guessing she may be ok with watching older kids, but not toddlers or babies. Which would explain having a dog for 8 months when there is an 11 month old.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 367,
              "content": "> I'm assuming that her sister really enjoys fostering animals. \n\nOP *literally* called it her sister’s passion, and I can’t imagine that’s a word or concession she made lightly, given that OP clearly thinks her children should be a priority to everyone. That OP can acknowledge that & brush off that she’s asking her sister to sacrifice her *passion* to benefit OP & OP alone is…",
              "id": 78,
              "comments": [
                {
                  "score": 26,
                  "content": "You're right. OP's annoyance is definitely being directed at the wrong person.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 776,
          "content": "this. I swear I don't get people who have so many children and then drown. 4 is a big number. you have birth control. what in the world did she think raising 4 kids was going to be like? do people not think about long term consequences? life is hard, but it's not that hard.",
          "id": 80,
          "comments": [
            {
              "score": 272,
              "content": "Ditto. And I know birth control isn't always the most accessible in some places, but there ARE a plethora of places where people can access it at more affordable rates. And like you said, do people seriously not understand just how difficult and stressful child-rearing us? It's not like it's a new concept! The long-term consequences, so true! Baby = stressful and expensive child-rearing for at least 18 years. More babies? *More* than 18 years of stress and expenses. Why is this so hard to understand? 🤦‍♀️",
              "id": 81,
              "comments": [
                {
                  "score": 49,
                  "content": "I don't know how people can go through the newborn phase, dirty diapers all the time, worrying about formula prep or breastfeeding and say they want more kids. I've had two and I'm getting my tubes tied.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 41,
                      "content": "I don't have kids, and I don't know how women do it. I couldn't. I barely maintained my sanity raising a puppy, and she (all things considered) learned quickly and was relatively 'easy' to raise + train.",
                      "id": 83,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Also some people are just really dumb when is comes to birth control 4 unplanned pregnancies by my older sister and two lead to abortions bc pregnancy was literally killing her and they were broke beyond means.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I have one and he’s awesome but I realize that I couldn’t possibly be a good parent to any more than two. I’m most likely one and done. I enjoy spending time with my kid. I have parents and in-laws that pick him up from school. My in-laws like to go to their mountain cabin a couple times a month and I can’t imagine being like “stop going to your mountain cabin so you can watch my kid” like whaat",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 762,
          "content": "Just jumping on the top comment to point out that OP is not just an AH but an oblivious one.\n\n\n\n4 dogs in a row that couldn't be around children? Take the hint.",
          "id": 86,
          "comments": [
            {
              "score": 50,
              "content": "I don't know where op is from but in the UK it's very common for foster and rescue dogs to not be allowed in households with children or even where children visit often.",
              "id": 87,
              "comments": [
                {
                  "score": 88,
                  "content": "It’s very common everywhere, they’re pointing out that sister is probably using the “they can’t be around children” excuse deliberately to get out of babysitting.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 72,
                      "content": "Especially because she says 1 was for 8 months and the others for even longer.\n\nSo this is like 3+ years of the sister getting dogs that can't be around children?\n\nThat's a pretty clear signal.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 679,
          "content": "Right? Plus, what would she do if she didn't have a sister or any other family member that could help with her kids?\n\nWhat I fear is that OP will try to use her eldest kids to take care of her younger siblings.",
          "id": 90,
          "comments": [
            {
              "score": 252,
              "content": "I'm sure that's exactly what is going to happen, if it isn't already.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Stealing her own children's future and education away from them.",
              "id": 92,
              "comments": [
                {
                  "score": 19,
                  "content": "Exactly! I hope OP reads all of this and finally starts to think about the consequences of her actions. \nOP, your sister does not live to take care of **your** kids and don't use your elder children to babysit the younger ones. \nThat's parentification and it's bad!",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "It's already happening, I'd wager. The oldest is 10.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Guaranteed it's already happening with a 10yo and three toddlers.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 545,
          "content": "Honestly it's mad OP thinks it's more appropriate to tell her sister what to do with her life so she can help with OP's kids, rather than OP tell her husband to pull his weight with the children he's equally responsible in creating.",
          "id": 96,
          "comments": [
            {
              "score": 48,
              "content": "It's cowardly. The problem isn't her sister's dogs, it's her husband. But it's easier to ask about them than confront him.",
              "id": 97,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 356,
          "content": "“You need to change your preferred lifestyle because of a life choice I made”\n\nTalk about consequences of her own actions. You’re 100% correct here",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "I have always wanted children, since I was a teen. It was the one thing I always knew I wanted out of life which I never changed my mind about. Unfortunately, as the years went by, it just wasn’t coming together, things kept happening that didn’t allow me to be reasonably confident that I would be able to offer a child what a child needs. I was not going to give birth to a child who was not going to be safe enough and have enough of their mother’s care and attention. This was me being responsible: I was not going to have kids I would have to rely on other people to help raise. I had too much on my plate, but that was not other people’s fault or problem.\n\nMeanwhile, I enjoyed my relationship with my nieces, and of course given that I had no children, I had time and resources to contribute to help my sister out, taking the kids for a few days so she can focus on her own needs and get things done more efficiently, and doing activities with her kids that she couldn’t do, taking them to the theatre and teaching them to cook so they can learn something new they can be proud of. I was always perfectly aware of how this was valuable to my sister, but never saw it as something that entitled me to anything in exchange, because having those moments with her kids was enough of a reward for me, since I didn’t have any of my own. I bought the kids expensive, thoughtful gifts, the kind you want to keep for life as an heirloom.\n\nAs I started to approach the age where one is too old to be a mother, I heard, through other family members, that my sister said “good thing she’s not gonna have kids, so she keeps spending her money on mine.” That’s when I stopped buying gifts and replaced them with inexpensive tickets to go see theatre plays. The kids wouldn’t care about the cost of the tickets, and they would still enjoy the events. That’s also when my sister stopped inviting me to birthday parties and Christmas gatherings, lying to me saying there is no party this year, only to find out through family members that there was a party, who accidentally revealed it because it slipped their mind that they were expected to lie. I have as a result no relationship with my nieces anymore.\n\nI hate people who birth kids for other people to raise, with a passion.",
          "id": 99,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 15105,
      "content": "YTA. It's your HUSBAND, the children's FATHER, you should be requesting more from. Not a sister who has already done way way way more than required! \n\nGo sit your husband down and let HIM know you're struggling. Don't try to manipulate your sister when you haven't even tried to fix what's in your own backyard ..",
      "id": 100,
      "comments": [
        {
          "score": 2507,
          "content": "Very much this. All your struggles are something you should talk about with your husband.\n\nI guess he expects you to work 24/7 (because child care is work), but he has free time after work? You two need to talk and find a solution that doesn't require your sister to plan her life around your family needs. Your husband, on the other hand, should plan his life to help with the needs of his family.\n\nAs many others, I thought you're a single mom at first.\n\nAnd you're not 'just asking', will you be upset if she says no? Will there be guilt? Sure there will, because it's a loaded question to ask.\n\nEdit: Thank you for the award, that's so nice.   \nAnd corrected embarrasing \\*your typo.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1044,
          "content": "Fully agree. _\"Above all, my kids will always come before a dog.\"_ No. This line should have been followes by a 'FOR ME AND MY HUSBAND.' \n\nTo be blunt OP, this is a Husband issue - NOT a sister issue. Your kids are not her responsibility. She shouldn't have to give up something that she enjoys because your husband isn't carrying his weight. This is not on her. Children are 100% the responsibility of the parents, and it sounds like you have become too reliant on your sister to help - especially since she already comes over in the mornings to assist you.\n\nDid you ever think that maybe your sister also got tired/exhausted of being seen as constant free childcare **(especially when it went from 2, to 3 and then 4 children to babysit - four kids is A LOT of work for someone who didnt sign up for that life)** and the dogs are a way to help her create boundaries?",
          "id": 102,
          "comments": [
            {
              "score": 277,
              "content": "5 bucks sis is getting one dog after the next so she has a \"valid\" excuse not to be roped into babysitting. \"I don't want to babysit\" only gets one nagged at.",
              "id": 103,
              "comments": [
                {
                  "score": 105,
                  "content": "Double that and I bet we know why the sister is childfree.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 42,
                      "content": "Yep. When a person gets continually guilted or shanghaied into raising kids who have extant actual parents, they don't tend to be all that into the idea of doing it all over again by their own choice.",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 80,
                  "content": "Exactly. Based on OP's post, it sounds like the sister started babysitting less freequently after baby number 3 was born.... So, after baby number 4 arrived, sis sounds like she internally said - \"nope!\" \n\nEven though OP says that it was a request, it sounds more like she all but expects her sister to babysit since she is child free aka thinks she has all this free time that she should just freely hand over. TBH, helping in the morning and still coming over from time to time to watch the kids is already a lot! I don't really know what more OP expects in terms of support. \n\nAnd, OP doesn't seem to be taking the hint or accepting her sister's polite declines.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 40,
                      "content": "And the ages of the kids, supervising three babies/toddlers in one go is a LOT. Personally, I wonder how much \"helping mummy with the babies\" gets loaded onto the 10 yr old. You just know that poor kid will be roped into regularly babysitting the minute she hits age 13.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 911,
          "content": "[deleted]",
          "id": 108,
          "comments": [
            {
              "score": 205,
              "content": "Sister already *is* still helping out, she's coming over in the mornings. She just won't take a bunch of the kids home with her anymore. \n\nMost of the time I'm at least semi-okay with people asking for a favor as long as they're not rude or demanding about it and accept the answer, but this time I agree with you. It's mean and manipulative of the OP to ask this, and doubly so of the sister who is already helping you out!",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 186,
          "content": "I agree so much with this comment. YOU chose to have kids your sister did not. How dare you think your entitled to throw your burdens on your sister what is wrong with you. Jeez God forbid your sister enjoys being a caring person who whole heatedly enjoys fostering animals. You are just taking advantage of her. Damn OP you literally have a partner who should be helping you. Leave your sister alone. YTA!\n\nAnd for the people in the back YOU ARE THE A HOLE HERE!",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 162,
          "content": "And stop making more fricken people. Jeez.",
          "id": 111,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "And if she has friends with children why don't they alternate babysitting for each other?\n\nYTA",
          "id": 112,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9314,
      "content": "[deleted]",
      "id": 113,
      "comments": [
        {
          "score": 3563,
          "content": "[deleted]",
          "id": 114,
          "comments": [
            {
              "score": 1020,
              "content": "Yeah I was wondering about this too. I have two young children and after my youngest was born I was 100% certain that I was done. Two is all I can personally handle. \n\nI also happen to have a sister who is child free and lives nearby. She loves my kids and I do go over to her place fairly often to hang out with the kids and my oldest has had a few sleepovers there, but I would never expect her to be available. She has a very demanding job and a very active social life, so I always ask whether she has time and tell her it's perfectly fine to say no.",
              "id": 115,
              "comments": [
                {
                  "score": 329,
                  "content": "Yep. I have two kids and some parts of me would love love love to have more. Like 2-4 more kids. But I know I can't. Like logistically, financially, emotionally, mentally, I could not do it. Like OP, I could probably muddle through, but I would be a wreck. My spouse would be a wreck. It wouldn't be fair on my existing or potential kids. I'm enough of a wreck with just my twins. Gaaad I would love to create and meet and raise more little humans. But I would also go absolutely insane, broke, & further insane. I've seen it happen to people. You've got to know your limits.\n\nKids can be like an addiction. Beautiful little crack babies (where they are addictive, not addicted...) But you have to know when to stop. 2-4 drinks on a night out is great. 6-12 and you're in trouble. Know your limits and play it safe. Kids can't be put back.",
                  "id": 116,
                  "comments": [
                    {
                      "score": 168,
                      "content": ">But I know I can't. Like logistically, financially, emotionally, mentally, I could not do it. Like OP, I could probably muddle through, but I would be a wreck.\n\nThe reasons you've laid out are the same reasons I decided to have ZERO kids. There was a time when I thought I would have kids. Even had a name picked out if I ever had a girl. But at some point in my 20s, I realized that to be a good mother, a woman needs to REALLY REALLY REALLY want to have kids...like an irresistible calling. I never felt that. So I concluded that motherhood was not for me. I'm in my 50s now and still feel that was the right decision for me. No regrets.\n\nGood for you for recognizing your limits and not giving in to the addiction!",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "Right, I have a single baby and I am absolutely not able to take care of more. It's not that hard to not have the kind of sex that can leave to a new one until preventative measures are in place. Though ops kids seem far enough apart in age that they were planned? I don't get being so overwhelmed with your kids that you need your sister to take them and then popping out another one.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Yeah, I had two and and I was DONE. They start to outnumber the adults and you're screwed. They start wanting to take votes on shit. I don't need a soccer team. I don't have a farm.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 333,
              "content": "Yeah, if her husband isn’t helping out with four I’d be shocked if he was a model father and partner for the first one, or two, or three. I can kind of understand someone having one kid with a partner who ends up not pulling their weight. Optimism or accidental pregnancy might lead to two. But four is a big yikes from me.",
              "id": 120,
              "comments": [
                {
                  "score": 42,
                  "content": "[deleted]",
                  "id": 121,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Oh definitely, I’m wondering what OP’s logic was.",
                      "id": 122,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 85,
          "content": "🏆please take this poor mans award",
          "id": 123,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 25,
          "content": "This whole post enrages me. The OP and her lazy husband chose to have four kids that they clearly can't take care of and now expect her sister to drop everything to help out. How incredibly selfish. I bet the sister is sick of being a babysitter and is enjoying her elderly dogs.",
          "id": 124,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "I like that you emphasized the passion part. Op only sees it as a dog getting in the way of her kids. What op says is \n\n> my kids will always come before a dog\n\nBut what she really means is “my kids will come before my sister’s passion so she needs to stop pursuing a full time passion that makes her happy to be a full time free babysitter to my kids. Also I’m going to go have another one despite feeling overwhelmed and the children’s father not pulling his weight.”",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "OP meant her sister babysits for free. She'll have to pay anyone else.",
          "id": 126,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6024,
      "content": "[removed]",
      "id": 127,
      "comments": [
        {
          "score": 845,
          "content": ">Have you thought of why she’s fostering these old dogs? Is she trying to tell you that she is tired of being a free babysitter?\n\nYep! Seems a bit suspicious that none of the dogs can be around kids (unless these kids are particularly difficult).",
          "id": 128,
          "comments": [
            {
              "score": 373,
              "content": "[deleted]",
              "id": 129,
              "comments": [
                {
                  "score": 19,
                  "content": "That sounds wonderful! I’m good with the ones that have had some bad times , and are scared. It’s challenging, hard work and definitely not something you can also have small kids around. I fostered before I had kids, and am back to it now that my youngest is old enough to be good around dogs.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 93,
              "content": "Idk I can imagine that though, if the dogs that are being fostered have been through a lot or are either quite young or old or small or very big it wouldn't be safe to have four kids (that aren't that used to dogs probably) swerming around them.",
              "id": 131,
              "comments": [
                {
                  "score": 16,
                  "content": "swerming",
                  "id": 132,
                  "comments": [
                    {
                      "score": 16,
                      "content": "swarming? idk not my native language lol",
                      "id": 133,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Not really. Dogs from charities often have issues. Sister is doing an amazing thing and OP is an ass.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I'm not familiar with fostering but isn't it the same as having stranger dogs in your house? You haven't spent any significant time with these dogs in your home when they first come to stay, and you don't know how they react to children. It would be risky to allow children around the dogs since sister don't know if these dogs would be tolerant towards children or not. \n\nIt's safer to just not have the children around while she's fostering.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "It is very, very normal for elderly chihuahuas to be dangerous around kids who aren’t trained to be around dogs with fear/anxiety/aggression. \n\nI would never do it in the sister’s shoes. She’d traumatize the dog further and the kids would almost definitely get bitten hard if the chi still has teeth.\n\nETA: I’m a vet nurse. Chihuahuas are the only breed of dog that makes me nervous. Nasty little fellas when they want to be. I’d take a nervous rottie or German shepherd hands down over a chi.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 506,
          "content": "Great response! I just want to add, working 50 hrs a week should not mean that her husband gets out of childcare. \n\nI'm a SAHM of 3, my DH works 50 hours/6 days a week pretty much every week. In the evening, he handles the kids and keeps them out of the kitchen while I make dinner. He helps with homework for the older 2 and bathes the toddler, and then he does the bedtime routine while I clean the dinner mess. If there are other things that need done around the house, I ask and he does them. Because I did not decide on my own to have 3 kids-- we both did. I work 50 hours at home while he does it at work. Why should all the \"overtime\" be on my plate? \n\nOP needs to stop letting her husband be an absent father just because he leaves the house for work.",
          "id": 137,
          "comments": [
            {
              "score": 52,
              "content": ">working 50 hrs a week should not mean that her husband gets out of childcare.\n\n50 hours a week is pretty average for most salaried positions these days. And if he's paid hourly, then he's benefitting financially. Many, many dads and moms work 50 hours AND still parent their children.",
              "id": 138,
              "comments": [
                {
                  "score": 34,
                  "content": "My husband works 45-50 hours a week at a physically demanding job.\n\nHe also is the one to get our kids out the door for school so I can get to work. He also sometimes gets up early (he works nights and sleeps while they're at school) to take care of them if I'm staying late. He does his fair share on weekends and helps around the house every day. He still has hobbies and stuff, but it's an equal division of home labor even if he spends more hours on the clock and brings in more money than I do. He recognizes parenting is a 24/7 job and doesn't expect it to be *my* 24/7 job alone.",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 208,
          "content": "This OP‼️‼️ wish I had an award now",
          "id": 140,
          "comments": [
            {
              "score": 28,
              "content": "I gotcha.",
              "id": 141,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 41,
          "content": "Love this reply. Calmly tells what is wrong here and how to deal. That helps people better realise their mistakes instead of them feeling hostile.\n\nWish I had an award for your answer!",
          "id": 142,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4163,
      "content": "YTA...I don't understand why you think your sister is responsible for taking care of your life choices,, but apparently your husband isn't?\n\nWho do you think you are? The entitlement is astonishing. \n\nYour kids come first for YOU. Don't expect other people to put your kids first. I'd never want to baby sit for you again. Very selfish.\n\nYeah, it sucks for you. But that's on you.",
      "id": 143,
      "comments": [
        {
          "score": 905,
          "content": "\"Your kids come first for YOU\"... couldn't say this better myself! OP I really hope you see this. \n\nMy dogs come first for me, even before myself. But i will never expect anyone else to give them top priority. Fostering dog is a great cause, to give the dogs a safe home especially if the dog has had a bad life. I can't believe you'll ask this of your sister. YTA.",
          "id": 144,
          "comments": [
            {
              "score": 161,
              "content": "You got that right! My animals (1 dog and 2 birds) are much more important to me than anyone else's kids. I'm CF and my animals are my family. \n\nOP: YTA. Get your husband to look after your children and please don't have any more. It doesn't sound like you have the money or energy to properly care for the kids you already have. Stop relying on your sister like she's some built-in sitter. She loves what she's doing and I only wish more people took the time to do what she's doing. \n\nAs it is, I'm thinking of rescuing a billy goat in the near future. Animals need love and comfort too and they aren't just throwaway things. Someone who puts their heart and soul into caring for unwanted and homeless animals is a saint IMO.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Same, my cats come before anyones kids.",
              "id": 146,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 132,
          "content": "Was going to say the same. “My kids will always come before a dog” …. yes, to YOU, the parent. Your sister did not have 4 children. Her babysitting for you is a favor.",
          "id": 147,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 85,
          "content": "I hated when OP said that her kids come before a dog. Like yes maybe for you but no one else is expected to stop giving dogs a loving home because you want your kids to go over to their house more often.. preposterous!",
          "id": 148,
          "comments": [
            {
              "score": 19,
              "content": "Yes. Cannot stand that attitude of entitled parents that their kids are more important than anything you might care about.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "First of all OP, don't act like your \"joke\" wasn't an attempt to guilt/pressure/bully your sister into quitting her passion to help manage your responsibilities for you. That's so manipulative and corny and honestly pathetic. It's like hearing someone is getting married and instead of asking about being invited just going \"so when are we going bridesmaid dress shopping teehee.\" Lame. So lame. You knew what you were doing. It wasn't a \"joke.\" Knock it off.\n\nAnd I'll just leave you with this. I'll say it loud for everyone. YOUR KIDS ARE NOBODY'S RESPONSIBILITY BUT YOUR OWN. If your husband is being a pathetic parent, take it up with him. And not your sister. She doesn't owe you anything. But your husband? Um hello??????? YTA",
          "id": 150,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": "My thoughts exactly. The sister is still helping babysitting, just at OP's house instead of her own. She's STILL helping! Tbh the day my sibling expected me to give up my pets for their children would be the day I stop babysitting at all, for good.",
          "id": 151,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Just to add. Presumably the husband was involved in those life choices. Or he at least actively participated in the creation process. And that's who should be helping out.",
          "id": 152,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "What really got me is that ops sister is still going over to her house most mornings to help. That is WAY more help than most people get with their kids and she still wants more??? Op yta. A big entitled one.",
          "id": 153,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3891,
      "content": "[removed]",
      "id": 154,
      "comments": [
        {
          "score": 869,
          "content": "Can I just say that I love your response? I have never heard of a parent not side with another parent regarding kids. Your reply is great. Thank you for not only seeing things from a childfree persons perspective but also acknowledging how important senior pets and fostering is.",
          "id": 155,
          "comments": [
            {
              "score": 624,
              "content": "I had an old dog. We got her when she was 7, and she passed in January after 10 years of love. My parents did everything they could until it wasn’t fair to her. \n\nDogs deserve love and comfort in their last moments. After my kids are grown enough, I fully intend to foster senior dogs specifically. For that reason alone.\n\nI have kids. My kids can be absolute little assholes. Sometimes I ask my SIL to watch them because they love her and she spoils them. If she can’t watch them? It’s no big deal and I’m not going to throw a fit.",
              "id": 156,
              "comments": [
                {
                  "score": 92,
                  "content": "I’m sorry for your loss. Senior dogs (and cats) get passed up all the time and they deserve to live out their best life. My sister (who is childfree) fosters dogs of all ages and it’s so wonderful to see those dogs get a chance at a forever home.\n\nI’m childfree, and have 2 cats from no-kill shelters. And once I can build a fence around my house, I hope to foster dogs (and cats).\n\nThank you again for your refreshing reply to OP!",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "We just lost our almost 25 year old cat last year. It was the end of an era and I still miss his bossy little face. I’m so sorry.",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 159,
          "content": "Exactly, get on her worthless husband's ass on get off her sister's ass who has zero responsibility in this.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "I think sister takes the dogs specifically because they block the kids. Childfree people enjoy not being around kids. She has her own quiet peaceful life to live. OP needs birth control.",
          "id": 160,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2803,
      "content": "Stop having kids with men that will not pull their weight.",
      "id": 161,
      "comments": [
        {
          "score": 1281,
          "content": "Jesus fucking Christ I want to tattoo this on my forehead. Every other problem on AITA/relationship advice/ even the JustNo subs is that women keep having multiple kids with stupid, lazy, deadbeat fathers who still think their only responsibility is to pump and pay. It’s embarrassing, honestly. Like I know you genuinely can’t know (for sure) if you picked a good dad before having kids, but if he didn’t change a single diaper for the first *why in the everloving fuck* would you make three more??",
          "id": 162,
          "comments": [
            {
              "score": 717,
              "content": "Same on r/parenting. \"My husband has never changed a diaper and actually forgot our youngest kid's name, I'm pregnant with #4, what do\"",
              "id": 163,
              "comments": [
                {
                  "score": 208,
                  "content": "I will never join that sub; I can’t take the secondhand embarrassment.",
                  "id": 164,
                  "comments": [
                    {
                      "score": 46,
                      "content": "Ooooih now I want to join for the schadenfreude",
                      "id": 165,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 24,
                      "content": "There are several of those every single day",
                      "id": 166,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 28,
                  "content": "\"go back in time and divorce your husband after baby #1\"",
                  "id": 167,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 70,
              "content": "Right? Jim Bob couldn't possibly take care of his own kids or feed himself because that's not man work. If he picks up his smelly socks he is probably a homosexual. Heaven forbid he wash something he got dirty or sweep his own mess. His 🍆 will shrivel up and fall off because he is fragile like a bomb.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "I would add that unless people have truly exceptional resources available, having more than two kids is probably a bad idea.",
              "id": 169,
              "comments": [
                {
                  "score": 23,
                  "content": "Three kids is hell (oldest of three), four is excessive. One to two is seriously the sweet spot. Any more than four and you are 100% parentifying or neglecting your oldest kids.",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Of course you can't be 100% sure what kind of parent your partner is going to be, but there are pretty damn good indications. \n\nDoes he do his fair share of chores now? If you're not feeling well or extra busy, does he step up his contributions? Is he considerate of the time you want to take for relaxation/hobbies, or does he view your time as less important than his? Have you already discussed what division of labor/time/chores will look like after a baby? Do you both have the ability to calmly address conflicts even if you're tired?\n\nI've watched soooo many women whose answers to those questions were \"nope\" have babies with those partners anyway. And then they're justifiably pissed at the laziness, but c'mon, dude didn't pick up his own dirty socks *before* having a baby, what the fuck did you expect?",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "While you can't know for sure, there are definitely indicators to look for in a significant other to show if they'll be a good partner in parenting:\n\n1. Do they take care of themselves - make their own doctors appointments, remember important dates, etc. Especially important for things outside of work - someone can be a responsible adult at work but be completely irresponsible outside of work.\n2. If you have pets - do they step up equally to help - or are you the one responsible for the majority of pet care, vet appointments, etc.\n3. Do they take care of you. When you're sick, do they prioritize helping you. Do they help others (elderly parents, friends) openly and willingly?\n4. Are they financial responsible? I know some people will push back on this one - but it's indicative if someone isn't able to manage their finances, or at least interested in co-managing finances with you in a productive and positive way.\n5. For all the above - do they ever make you feel guilty / act resentful for doing the above.\n6. For all the above - will they do it without you having to remind them / ask?",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 58,
          "content": "This is the main reason I stopped at one. I learned my lesson.  He wanted a child sooo badly, but guess who is doing 95% of the work? No MORE.",
          "id": 173,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "I was sick and quarantine for two weeks and when I emerged everything was fine. My kids hadn’t missed a beat, a spirit day, a practice, a meal. The laundry was done. My friends were all, “oh no you’re sick, is everything going to be ok with the kids? Is your mom coming?”\n\nEverything will be fine because I married someone who is capable of being not only a functioning adult, but a father.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Ugh this 110%. Out of the parent couples I know of, I can name 2 dads who pull their weight, but all of them also rely on inlaws to extra work. So maybe also stop having kids you cant look after with just the two of you!",
          "id": 175,
          "comments": [
            {
              "score": 23,
              "content": "I can name a handful of dads that do their share but only 2 of them are straight. When did we decide that being manly means not being competent",
              "id": 176,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "“Stop having kids” was enough.",
          "id": 177,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2125,
      "content": "YTA. You choose to have kids. She did not. You expect her to drop her life and things important to her to pick up your problems.",
      "id": 178,
      "comments": [
        {
          "score": 1128,
          "content": "I know, right? Child-free people choose to not have children *for a reason*. The reason usually being we do not actually *want* the responsibilities of having children!\n\nI adore my nieces and nephew, and I might volunteer to babysit for them once in a while, but on a regular basis? Get outta here! And tell me to stop doing what I love doing in order to offer you free labour? Get *the fuck* outta here.\n\nYTA. Kids have a father. Time for him to pull his damn weight as a damn parent. Also invest in some contraception, jeez!",
          "id": 179,
          "comments": [
            {
              "score": 206,
              "content": "Same. I am sorry but there is no way in hell I will babysit regularly for anyone anymore. I CHOSE not to have kids. Looking after kids is difficult!! I am not \"lucky\" to have free time, I chose to not have to spent any time with children. Why do some relatives / parents act as if I owe them my \"free\" time??? \n\nOP, I do feel for you, I really do, but YTA. Your kids are first to you. My animals are first to ME - yes, I prioritize them over anyone's kids, sorry not sorry.",
              "id": 180,
              "comments": [
                {
                  "score": 31,
                  "content": ">I am not \"lucky\" to have free time, I chose to not have to spent any time with children. \n\nTHIS! It's not luck, it's a plan. If you wouldn't tell an infertile couple who wants kids \"omg, you're so lucky you don't have kids,\" don't say the same thing to childfree people, either.",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Right? We didn't want the kid-life, I'm not taking on someone else's kid-life.",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Invest? You can get it for free at planned parenthood. I get 18 months of free birth control at a time. It’s amazing",
              "id": 183,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "Exactly. Maybe stop having more kids and give your husband a swift kick up the butt. He's supposed to be a father, not just a sperm donor. YTA.",
          "id": 184,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "Seriously. The fuck? OP shouldn't have had 4 children if she can't handle looking after 4 children. YTA",
          "id": 185,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2074,
      "content": "Nope, nope, nope, a million times nope.\n\nI'm so deeply disturbed by the casual nature with which you write about your sister's perceived servitude to you. How easy it is for you to assume she owes you labor and aid. \n\nSometimes on these things I have to say, \"No, YTA and you know it.\" But I honestly can't this time. YTA, and you don't know, and that's almost the worst kind of AH.\n\nPlease, do some **serious self-reflection.** You owe it to yourself, your family, and mostly, your sister, who I hope finds a way to free herself from your entitlement.",
      "id": 186,
      "comments": [
        {
          "score": 710,
          "content": "[deleted]",
          "id": 187,
          "comments": [
            {
              "score": 125,
              "content": "I think the kids should come first to her husband too, but the main problem is that they don't come first to him",
              "id": 188,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Her kids don’t even come first for her? Like clearly her and her husband are too busy trying to make more kids to put the others in Priority.",
              "id": 189,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "Yes, my kid comes first to me and only to me and my husband.  My sister's dog, for instance, comes first to her.  And that is how it should be.",
              "id": 190,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "Right? OPs kids can come first to her, but that doesn't mean they come first to everyone. Such entitlement.",
              "id": 191,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "I hope for the 10-year old's sake OP does do some self-reflection. Otherwise I have a feeling the kid's going to be an indentured nanny within 2 years and OP will see nothing wrong with it.",
          "id": 192,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "same here, how can she not realize she's being a dick?",
          "id": 193,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1550,
      "content": "YTA. Big time.\n\nYou chose to have 4 kids. And if after the first one or two kids, you didn't realise that kids means little sleep and little time for yourself, it's your problem. Yours and your husband. But not your sister.\n\nYou can't afford a sitter ? Too damn bad for you. You should have though of that before popping more kids out. \n\nWhat you're asking of your sister is selfish, rude and innapropriate.\n\nGet your tubes tied, get on the pill, use a condom, have your husband get a vasectomy. \n\nGet a job and deal with your own damn kids.\n\nThe entitlement of your request is just... WOW !!!\n\nAgain, YTA.",
      "id": 194,
      "comments": [
        {
          "score": 358,
          "content": "100% that.   \nDon't make kids if you can't take care of them.   \n\n\nHow selfish and rude for your sister, who is doing a good thing that she loves.",
          "id": 195,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}