{
  "post content": "My (16, M) family has a pet parrot. They are all pretty much obsessed with him and my younger and older sisters both keep buying him toys, new food, making him new fruit and vegetable mixes to try out etc. My parents also pay a lot of attention to him and even set up the extra room we have for his cage so he can sleep better at night. He has been with us for a few months now and my family's obsession still hasn't died down.\n\nI've been mostly indifferent since I'm not the biggest fan of animals and my parents keep him away from my room. Luckily for me it seems like he doesn't like me anyways so it's even easier to avoid him flying to my shoulder or anything like that. \n\nThe problem though is that today my sister Emma (10,F) was talking quietly to that bird. She was holding him and saying things like \"You know I love you right?\" and kissing him on the head while the parrot would just mimic the sound. It went on for a while and she repeated that enough that it seemed like she was looking for a response so I told her \"You know he doesn't understand you right\". \n\nAfter I said that she just looked at me and made a sour face and ignored me. I didn't want her to actually believe this bird can understand what she is saying since she watches a lot of Disney movies so I feel like they could have given her the wrong idea. I gently explained to her that it's just a bird and that he doesn't understand things like we do. She told me to stop bothering her and ended up leaving the room and told my mom about it.\n\nMy mom told me she believed it was harmless for my sister to talk to her pet and that the bird \"reciprocated her feelings\". So I told her that this will harm my sister's way of thinking and get her bullied at school. She told me to drop it and not get involved anymore. AITA? I think my sister is old enough to understand what I'm saying and my mom is just too nice.",
  "id": 1,
  "comments": [
    {
      "score": 45897,
      "content": "I asked my dog.\n\nShe says YTA.",
      "id": 2,
      "comments": [
        {
          "score": 14677,
          "content": "My kitten agrees. The older cats declined to comment at this time.",
          "id": 3,
          "comments": [
            {
              "score": 6084,
              "content": "My cats both agree that OP YTA..... Although they'd quite like to meet your sister?!",
              "id": 4,
              "comments": [
                {
                  "score": 3342,
                  "content": "To be fair, the older cats were sleeping and couldn't be bothered. They now also agree that OP YTA.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1615,
                      "content": "Wouldn’t the older cats agree that everyone is TA tho? They are cats, after all. 😆",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 197,
                      "content": "My gecko told me that it was a YTA",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 168,
                      "content": "Both my cats and both my dogs think YTA. Sorry OP.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 21,
                      "content": "My cat just hissed and walked away. Enough said.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 19,
                      "content": "My 4 dogs and 2 cats have to agree here. YTA OP. all borks are in",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "My two cats are extremely interested in the bird and can't be bothered with deciding asshole status.  \n\nSo I'll say YTA.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I asked my deaf old lady cat and I got an angry sounding meow.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "My older cats were also sleeping when I tried to get their opinion. All I got was the tail flick. That is the cat version of the middle finger.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 639,
                  "content": "My cockatiel doesn’t like OP either, but then again he hates most people so who knows",
                  "id": 14,
                  "comments": [
                    {
                      "score": 707,
                      "content": "my caique is quite offended by OP and wishes to do things that would get my comment banned. there’s a reason why one does not piss off a flying raptor with a beak that can break thru the toughest of nuts and talons that can leave marks on skin.\n\nYTA OP. it’s harmless and she was bonding with the bird. just bc you don’t like animals does not mean that you need to spread that energy around like bird poop.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 178,
                      "content": "This goes for the 2 quakers and 2 cockatiels my tenant has. But they would like to extend a YTA specifically to OP. Same with the 2 mice and 2 kittens. It's a multi species YTA",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Mine loves me, puts up with a few people (especially if they have a cracker) and most others can stay away. I always talk sweetly to my bird, kissing her and telling her I love her. I even talk to the research mice I'm taking care of, though it can switch fast as in \"It's okay, honey, I'm just going to trim your nails- stop trying to bite me you little punk!\"",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I like to think my cockatiel is a good judge of character.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "My two amazons also think OP is TA, but like your cockatiel, I’m not sure if they can be trusted. \n\nMy umbrella cockatoo, however, told me at approximately 115 decibels that OP is TA and she loves everybody so she can be trusted in this.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 428,
                  "content": "I moved my cat's arms from around my neck and his face out of mine to ask. He said YTA and so am I for stopping with the hugs and kisses. Then he went back to headbutting my until I cuddled him and kissed his forehead again.",
                  "id": 20,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 207,
                  "content": "My cat also agrees that OP YTA, but seems more interested in meeting the parrot 🤨",
                  "id": 21,
                  "comments": [
                    {
                      "score": 12,
                      "content": "My money is on parrot, they are smart and fearless",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "My 3 cats agree that Op is YTA\n\nAlso down for meeting the parrot",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 167,
                  "content": "Note: Do not introduce the cats to the bird. It will end badly.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 104,
                      "content": "For the cats",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "My old parrot loved to tease the cat",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 86,
                  "content": "\"What's this power you have of making birds go near you? Can you teach us? No reason, just out of curiosity.\"",
                  "id": 27,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "Pretty sure they’d like to meet the bird too…but that may not end well.\n\nMy cats also agree YTA it was a unanimous vote.",
                  "id": 28,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "I asked my dog. He whined when I told him.",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "My cat agrees with the kitten but has expressed more interest in meeting the bird than the sister at this time.",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "My cat also agrees, YTA",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 490,
              "content": "My neighbor’s cat came over for a chat, and she agrees that lil sister shouldn’t be taking to the birds… not because they don’t understand, but because she (the cat) feels that it’s rude to talk to your food. Playing with it is fine, but full on conversations are just crazy talk. 🤣",
              "id": 32,
              "comments": [
                {
                  "score": 155,
                  "content": "The cat does have a point. Talking with your food increases the chance that the food will convince you to not eat it.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 16,
                      "content": "My first thought when I read this was the shrimp from Shark Tale",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Unless it's the cow from Restaurant at the End of the Universe.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 205,
              "content": "I asked my old cat and he said YTA before I even finished reading the title, but that's always his answer regardless of the question.",
              "id": 36,
              "comments": [
                {
                  "score": 67,
                  "content": "cats are the ultimate judges of AHs",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 75,
              "content": "Prolly because cats are notoriously also assholes.  Kitty isn't old enough to be corrupt.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "I wouldn't ask the older ones as they tend to lean towards murder more often when their intelligence is in question. In which case, they make you drop your guard by acting dumb but then get you when you least expect it.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "My cats always decline to comment until 2am",
              "id": 40,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Asked my Betta fish. She agrees YTA and was upset by your frame of mind",
              "id": 41,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Yeah, my two bunnies just lol'd when I asked them!",
              "id": 42,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "My cockatiel landed at the same conclusion.",
              "id": 43,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "I don't have a pet but I asked a random seagull I saw scavenging for food. Between shouts of \"Mine! Mine! Mine!\" She did agree that OP needs to drop the subject.",
              "id": 44,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 928,
          "content": "Best answer. All five of my dogs agree, but Henry also wants to know if he can eat OP’s bird, so he has been served a temporary ban.",
          "id": 45,
          "comments": [
            {
              "score": 475,
              "content": "I reported Henry for promoting the eating of someone in the original post.\n\nThey said that further action does not need to be taken because he's a *good boy*, oh yes he is! Yes he is!",
              "id": 46,
              "comments": [
                {
                  "score": 74,
                  "content": "I'm sorry, who's a good boy?",
                  "id": 47,
                  "comments": [
                    {
                      "score": 90,
                      "content": "Henry is! Yes he is!",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": ">I reported Henry for promoting the eating of someone in the original post.\n\nSeriously though...isn't it like a rule in this sub to not eat the OP even if they are the AH? We have to have standards around here!",
                  "id": 49,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I feel that's probably covered under:\n\n#1. Be civil",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 135,
              "content": "My dog Henry also says OP YTA and he doesn't normally use that type of language.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 887,
          "content": "My parrot could string together words better than a toddler.\n\nHe used to call our dogs into the room then dump food off the kitchen table for them.",
          "id": 52,
          "comments": [
            {
              "score": 364,
              "content": "Team work makes the dream work 😁",
              "id": 53,
              "comments": [
                {
                  "score": 375,
                  "content": "Oh God. Yeah. They'd also BOTH bark when someone came to the front door.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 81,
                      "content": "well now i wish i had been able to stop by your house.",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 69,
                      "content": "Damn. All my parrot did was say \"heeeere kitty kitty kitty\" and then when the cat got closer he'd bark at him. He was such a jerk.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "I bet the look on people's faces the first time they visited you and realized your parrot was barking was really entertaining.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 159,
              "content": "I had to start feeding my dog wet food because My cat would would drop mouthfuls of his wet food into the dog's bowl. Now they both just eat out of the same bowl.",
              "id": 58,
              "comments": [
                {
                  "score": 26,
                  "content": "Giving gifts/sharing food with the dog? Super cute",
                  "id": 59,
                  "comments": [
                    {
                      "score": 42,
                      "content": "It was SO adorable! Dramatically increased my pet food budget and I just don't care. Watching them take turns so politely at the bowl just makes my heart expolde.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "When my daughter was born, my dogs pretty much ignored her. \n\nThen she figured out how to feed them Cheerios from her high chair, and they were suddenly her BFFs.",
              "id": 61,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "When I was really young, my parents pet-sat one of their friend’s parrots. His favorite thing to do was go, “Heeeere kitty, kitty, kitty,” until our cat ran into the kitchen. Then he’d start barking, which of course scared the fluff outta her. And he would straight up laugh his tail feathers off, “Ahahahaha!” Like a maniacal little supervillain. \n\nNever underestimate a parrot’s intelligence.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Mine would yell “don’t swear” if he heard my parents raise their voices. Of course, he also ordered my stepdad to “fuck off” sometimes, and took so much delight in calling the cats and laughing when they came!",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Mine see my nephew who is a baby and start squealing in the scream tone he uses. They don't use it when he isn't around. They get it. This kid is a jerk to his kid sister because she's trying to be a good owner",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 679,
          "content": "Even my pet rock says YTA.\n\nETA: Thanks for the awards, but I'm just riding the coattails of the comment above!",
          "id": 65,
          "comments": [
            {
              "score": 76,
              "content": "Of all the animals- this is a favorite.",
              "id": 66,
              "comments": [
                {
                  "score": 7,
                  "content": "It’s OP’s favourite too",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 546,
          "content": "My cat says N T A, but he's an asshole, and I don't trust anything he says.",
          "id": 68,
          "comments": [
            {
              "score": 178,
              "content": "He just doesn’t like parrots.",
              "id": 69,
              "comments": [
                {
                  "score": 9,
                  "content": "Too feathery.",
                  "id": 70,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "This made me laugh",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 483,
          "content": "My parrot showed me this post and said : OP YTA",
          "id": 72,
          "comments": [
            {
              "score": 555,
              "content": "My dearly beloved (deceased) African Grey would probably eff and blind at OP. YTA. Also fun fact: most parrots (even some budgies) *can* make and understand conversation! \n\nOP you underestimate a birds intelligence 🤣🤣",
              "id": 73,
              "comments": [
                {
                  "score": 205,
                  "content": "Perhaps OP has the real 'birdbrain'? 🤔",
                  "id": 74,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Howling 🤣🤣🤣😭😭",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 166,
                  "content": "My grandmother had an African grey (Polly) and she was such a talker! I miss her. YTA, OP. I’m glad your sister has such a wonderful connection to your family Parrot!",
                  "id": 76,
                  "comments": [
                    {
                      "score": 80,
                      "content": "Mine was called Cesar!! I've had a brazillian and an african grey and my african grey will always be remembered as my soul animal. I miss him too but I just imagine him flying above the clouds 😭😭 \n\nYTA OP ❤️",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "My bird takes apart phrases we taught her and makes her own sentences.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "They understand a lot more than people give them credit for. I am now wary of birds, used to be outright terrified. My aunt had parrots. The cockatiel was so kind. He totally got that I was afraid and would like, approach gently, with gifts and small reassuring sounds. The Quaker or whatever it was called, was a dick. He used my terror to his advantage and would corner me in rooms by swooping aggressively.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Years ago, I was friends with a couple who had a parrot. The parrot didn’t talk much but he was a total love bug. One day I was at their house and the husband got his nose out of joint about something and rudely berated his wife before storming out of the house, slamming the back door. My friend and I just sat there in shock for a few seconds. Then suddenly the parrot called out, “ASSHOLE!” The two of us totally cracked up. And the bird was right. Dude was an asshole.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I used to have a grey and a budgie. The grey would mimic the phone ringing, the budgie would answer it, and they'd proceed to have a whole conversation.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I read that in a parrot squeak 🥹",
              "id": 82,
              "comments": [
                {
                  "score": 5,
                  "content": "Me too!",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 412,
          "content": "My cat is asleep and on do not disturb, but my chickens think he's a motherclucker. \n\nI have daily conversations with my cat and my chick's. Though my chickens reply more than my cat does. \n\n\nOP YTA\n\n\nEdit for wording",
          "id": 84,
          "comments": [
            {
              "score": 158,
              "content": "My chickens (AKA “The Spice Girls”) definitely think OP is TA.",
              "id": 85,
              "comments": [
                {
                  "score": 13,
                  "content": "My chickens “The Shitlets” think OP is TA too. But I can ask them again in about 10 minutes. Their memory keeps life interesting. We can have the same conversation all day.",
                  "id": 86,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "\nShe is having a conversation with an animal though. I converse with my dog and chickens all the time.",
              "id": 87,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "I refer to my tortoise as my therapist because I talk to him so much. He comes to the sound of my voice and makes direct eye contact. He loves to listen to me. He also loves to snuggle.\n\nIf he weren't in brumation right now (the reptile equivalent of hibernation) I'm sure he would agree that op is the asshole. But since he's sleeping, I asked the cats and dog. It was unanimous.\n\nOp, YTA.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "That was a fowl pun!\n\nBut I'm cawing with laughter...",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "My accidental rooster, Nugget, would catch a ban because he wants to fight OP. To be fair he wants to fight everyone but his ladies and my teenager. \n\nI have many conversations with Nugget about how he should just effing be nice because I brought them watermelon.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 269,
          "content": "I talked to the crows outside. They're pretty smart and have helped me through some tough times. They also think YTA.",
          "id": 91,
          "comments": [
            {
              "score": 72,
              "content": "Oooh I love me some corvids. Ridiculously smart birds!!",
              "id": 92,
              "comments": [
                {
                  "score": 103,
                  "content": "Love corvids, they can be absolutely arseholes though. I’ve had to negotiate with them over when I’m allowed to take my cat in the garden. We reached a peace treaty whereby the cat can have 1 hour of peace for every bowl of crickets and meal worms I put out. \nAlso both cat and jackdaw collective agree that op is YTA and the jackdaws muttered warnings over underestimating the birds…",
                  "id": 93,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Hitchcock was the only one who understood.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I always make peace/good with crows around where I work or live. I don't outright feed them daily, not trying to get other people attacked, but when I see them doing some extra searching I throw put bread and have noticed they rarely fly away when they see me now. They also have specific calls around me as well,  I always see them look up to the watching bird, then back to what they were doing.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Crows are amazing birds! Mine have learned my schedule and know when I’ll be outside with their food ☺️ They sometimes sit beside me when I sing.",
              "id": 96,
              "comments": [
                {
                  "score": 6,
                  "content": "Are you a Disney Princess by any chance?",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "So, the murder agrees then?",
              "id": 98,
              "comments": [
                {
                  "score": 8,
                  "content": "Oh yes, they do. They don’t like hoomans who underestimate the birdies!",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 227,
          "content": "My iguana just weighed in as well. \n\nYTA",
          "id": 100,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 210,
          "content": "My dog and my canary also agree. Yta",
          "id": 101,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 15713,
      "content": "YTA- animals can pick up on peoples emotions.. pretty sure that bird thinks your AH too.\n\nBirds can and do express love through their actions, many parrots mate for life and grieve for their lost partners. It will not harm your sister at all, but you sure are.",
      "id": 102,
      "comments": [
        {
          "score": 4678,
          "content": "Nevermind that birds that have language capacity have been scientifically shown to have brain functionality similar to that of a human toddler, meaning that they actually do pick up on certain behaviors and can respond to them with intent if they so desire. YTA.",
          "id": 103,
          "comments": [
            {
              "score": 2058,
              "content": "Right? Animals learn the meaning of words which is why everyone gets the stink eye when they say \"walk\" in my house. If anyone is the idiot in this scenario it's OP for underestimating the intelligence of animals. Also, I'm always skeptical of people who don't like animals. Something is seriously wrong with them.",
              "id": 104,
              "comments": [
                {
                  "score": 910,
                  "content": "And even if they don’t understand the words, they absolutely understand tone of voice.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 534,
                      "content": "I sometimes mess with my dog by calling him an idiot or a dumb bum in a really cutesy, loving voice. He's thinks it's great haha",
                      "id": 106,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 318,
                  "content": "My parents’ dog “learnt” how to spell “walk” after my parents started saying things like “we’ll have to take the dog for a double-u ay ell kay soon” 😂",
                  "id": 107,
                  "comments": [
                    {
                      "score": 177,
                      "content": "Our dogs have learned those words as well, including their spelling. We tried signing, but they caught on to that as well. So we ended up exhanging them for bigger words. For example, walk became rutabega.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "My gran's dog learned that he always got his evening walk after EastEnders finished, so he would respond to hearing the theme at the end of the episode by grabbing his leash and bringing it to her like \"okay, soap's over, walk now\".",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I had a dog that learned how to spell \"bath\"",
                      "id": 110,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "People are like \"Dogs don't understand words, they just recognize the sound,\" like honey how do you think a word works?\n\nWe also can't say \"dinner,\" \"car ride,\" or \"mom and dad's\" without getting eyeballed eagerly.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 487,
              "content": "So not only is OP the AH but he is also wrong in assuming the parrot doesn't understand. OP chose to be a lonely AH who wants to be miserable and make others share in it by assuming incorrect information. Seems OP needs some attention if you ask me.",
              "id": 112,
              "comments": [
                {
                  "score": 227,
                  "content": "parrot is smarter then OP.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Better emotional intelligence, anyways",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 180,
                  "content": "Parrots in fact have been observed to be in severe psychological distress without interaction and stimulation.",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "He seems a bit jealous of the bird if you ask me- saying his family is obsessed with it",
                  "id": 116,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "YTA. \n\nParrots can identify color and item. Like “yellow truck.” A pick a yellow truck when presented with yellow objects and trucks and one yellow truck. \n\nAnd not only are parrots amazingly intelligent, but cats and dogs have been showing an astounding ability to communicate with people using voice buttons. For example, there is a cat who understands the difference between inside/outside. Now/later. Mom/dad/friend. And even seemed to diss Hamilton (hitting “ouch” button whenever the soundtrack was turned on…repeated observations). There’s a dog with an even greater vocabulary. Search socials for Billie the Cat and Bunny the Dog (What About Bunny). And cats and dogs definitely respond to their humans emotions. \n\nSo whether the pet was a bird, cat, or dog…OP was the asshole.",
                  "id": 117,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "So OP is both ignorant and an AH.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 174,
              "content": "I think I saw an article yesterday that said Cockatoos are only the second animal after humans and chimps to use specific tools for specific purposes too.\n\nETA article about toolsets and cockatoos.\n\nhttps://www.earth.com/news/cockatoos-can-recognize-the-need-for-a-tool-set/",
              "id": 119,
              "comments": [
                {
                  "score": 338,
                  "content": "They do use specialised tools, but they are not the only ones. Crows are freakishly intelligent and have been seen using twigs for digging up insects inside little holes in tree barks. And they can identify which twig has the best shape depending on their needs, it's pretty amazing. \n\n\nOh yeah also OP, YTA massively. The parrot doesn't seem to like you, BECAUSE he can understand you don't like him.",
                  "id": 120,
                  "comments": [
                    {
                      "score": 95,
                      "content": "Also, recent report, [pigs have been observed using tools](https://www.science.org/content/article/pigs-caught-video-using-tools-first-time).",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "It's not just tool use exactly, it's that cockatoos can carry a tool kit so that they have access to different tools for different tasks. Cockatoos were observed to carry two tools, even while flying. While tool use has been observed in several animals now, previously only chimpanzees had been observed carrying/keeping a toolkit.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "It has also been discovered that crows understand commerce and the concept of zero. They are ridiculously smart.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "I remember reading somewhere that some of most breeds of dogs are also thought to have brain function similar to a 3 year old human, OP is definitely TA",
              "id": 124,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "I didn't want to overwhelm the poor little thing with too much knowledge /s.. Yes animals feel, think and respond.",
              "id": 125,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "This comment should be higher up. \n\nParrots also can learn human language and use it productively, doing new info structures and describing internal states and emotions. \n\nSo yeah there is actually a very damn good chance the bird does understand her or will soon learn to do it.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 513,
          "content": "Does the OP think his sister is a complete idiot? The majority of 10 year olds are well aware animals don't know human languages. She's just expressing affection to a beloved pet.\n\nHis worry sounds like a cover up for being annoyed with his family's (who sound lovely by the way) love for their new feathered friend.",
          "id": 127,
          "comments": [
            {
              "score": 242,
              "content": "Parrots are also ridiculously smart and long lived. A small animal rehab near me has a 50 year old parrot whose human died in 2012 (he's been at the rehab ever since). He is known for asking repeatedly \"When is Hank coming home?\" He also knows the names of several of the other animals and will call them to fuck with them. He'll even do pspsps noises at the other animals.",
              "id": 128,
              "comments": [
                {
                  "score": 117,
                  "content": "Our macaw imitates our dogs barking to get them a scolding. She picked up my laugh when I was still just visiting her at her aviary (she was still being hand fed). She knows my kids’ names and knows from their footsteps which one is coming downstairs. These birds are seriously intelligent and are happiest when they get lots of interaction",
                  "id": 129,
                  "comments": [
                    {
                      "score": 10,
                      "content": "They’re definitely like having a toddler in the house. They’re into everything, you can’t tell them no, they demand attention, and they’re too adorable to scold.",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 346,
          "content": "Also animals know who assholes are and avoid them. This kid sounds like he insufferable. It’s sad when people are already like this at 16.",
          "id": 131,
          "comments": [
            {
              "score": 84,
              "content": "True.  Here's to hoping he grows out of it.",
              "id": 132,
              "comments": [
                {
                  "score": 198,
                  "content": "Odds are he will.  If not he'll end up bitching on reddit in 10 years about how all women are assholes and just don't have the intellectual capacity to keep up with him.\n\nIf you can't look back at your teenage years and find something to cringe at, you probably haven't grown up and that's a far worse fate.",
                  "id": 133,
                  "comments": [
                    {
                      "score": 23,
                      "content": "I'm glad the worst I have to look back on is some over-dramatic journaling and song lyrics for acoustic guitar. \n\nMy journaling is still kind of over-dramatic tbh but I tell myself that's what my journal is for and don't let anyone see it unless I gave it a few days to think over first.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "In fairness to OP, a lot of teenagers are know-it-all assholes at 16 and many of them grow out of it once they reach their early 20s. Being a know-it-all asshole is an important part of growing up and becoming your own person and figuring out who you are.\n\nLet’s hope OP is one of those people.",
              "id": 135,
              "comments": [
                {
                  "score": 17,
                  "content": "I dunno he seems like a bully though and kids aren’t really just bully’s. They’re usually just shits to their parents. Also a human not understanding animals feel is a little concerning.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 144,
          "content": "For real. About 2 weekends ago I had my nephew visiting and we got to talking about some things they’re having trouble with and he started crying. My wonderful dog went from resting in my lap to my nephew and leaned on them until he made room for the dog to be on his lap. \n\nOP, it’s fine if you’re not an animal person, however, it’s not kind to be rude to your sister & her love of the parrot. For this, I agree OP, YTA.",
          "id": 137,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 111,
          "content": "My dad had a bird while I was growing up (bought for my sister but def ended up my dad's pet), and when I moved out for college the bird would occasionally sadly mumble my name and mimic my chronic hiccups. He missed me. He didn't do that when I lived there. It was adorable.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Well you do know that OP seems jealous of the bird.",
          "id": 139,
          "comments": [
            {
              "score": 9,
              "content": "totally noticed that. How dare they love something more then him /s",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": ">I've been mostly indifferent since I'm not the biggest fan of animals \n\nAlso, by OP's tone in the whole post: he is not indifferent, he sounds very annoyed at them having a bird.",
          "id": 141,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "I am CONFIDENT that my cat understands basic English, at least enough to understand things as simple as \"show me the problem\" when she's upset/wants something, since I'll say that and she'll walk me to whatever is upsetting her.",
          "id": 142,
          "comments": [
            {
              "score": 10,
              "content": "yes! my cat Loki will take me to where his brother cat Thor is hiding if I ask him \"find thor on the floor\"..",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "This is so true. I get so annoyed when people tell me birds can't show emotion. I have three birds inside and over 40 chickens and ducks outside. When a flock mate passed away recently the ducks literally sat by him all day. They acted in a way I had never witnessed in all the years being here. They knew their friend was gone, so we gave them some time to grieve their companion. I know chickens can be described as quite savage, but when our rooster passed away the entire flock of hens acted so depressed. They didn't eat, they quit laying eggs - their cycles were all over the place. They free range during the day and majority of them wouldn't even come outside. I thought they were sick, the vet came out and told us they were depressed basically. I have one chicken that waits for the bus everyday for my daughter, she sits by the mailbox same time everyday and listens for the bus. My cockatiels especially are very bonded, if one leaves the cage they both are very, very upset and not afraid to show it. We try not to seperate them but we had to recently and they were extremely upset until they were introduced again. Ok I'm going to quit ranting about birds, but they definitely are amazing animals!",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I took my parrot outside and put him in a tree while I was doing yardwork.  I then moved to the tree with small pruning shears and each time I clipped off a branch, my bird said \"oops.\"\n\nNext I grabbed some bigger shears and clipped off larger branches and the bird said \"ouch.\" It was hilarious and not something he had been taught to do.",
          "id": 145,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10888,
      "content": "YTA\nYou jealous of a parrot, dude?\nAnd yes, that bird absolutely understands your sister. No, not the words \"I love you\" in the sense that it has an understanding of \"I\" or \"you\", but in the sense that it hears those sounds and feels the affection. Seems like the bird understands love better than you.",
      "id": 146,
      "comments": [
        {
          "score": 2525,
          "content": "Cats and dogs often learn to associate key words with contexts, and parrots are a great deal smarter. \n\nWouldn't surprise me whatsoever if the parrot knew that when the sister says \"I love you\" she's expressing affection.\n\nWhether he is expressing affection when he says it back is another story, but it could be argued that just the fact a parrot is actively mimicking you is them trying to bond.",
          "id": 147,
          "comments": [
            {
              "score": 2246,
              "content": "I have a parrot, it’s repeating those phrases in context that teaches them what they mean. Similar to babies. So while the bird may not know exactly what I love you means right now, with time in context the bird will eventually learn it’s a sign of affection. \n\nThat’s how my parrot learned the words shit and goddamnit and she uses them in context whenever she accidentally drops a treat she wanted",
              "id": 148,
              "comments": [
                {
                  "score": 2011,
                  "content": "When I was born my great grandpa had a parrot. I guess my granny yelled so many times don't swear in front of the fucking baby the parrot picked it up lol. Until the day it passed on when I was 11 if anyone swore when I was in the room the bird would yell out don't swear in front of the fucking baby.",
                  "id": 149,
                  "comments": [
                    {
                      "score": 461,
                      "content": "That's a delightful story",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 247,
                      "content": "That’s hilarious! My parrot originally belonged to my great grandma as well",
                      "id": 151,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 131,
                      "content": "These parrot stories are hilarious and amazing",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "My cousin taught his mother's parrot to scream \"HELP!!! HELP!!!\" in a very human voice whenever anyone rang the doorbell.  \n\nIt was pretty funny.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 300,
                  "content": "exactly. my cat comes running when she hears \"hey, Bexar, will you come here please?\" not because she understands english grammar, but because those sounds in that order mean i want to pet her or give her a treat or there's a bug she needs to dispatch. which she is 100% down for all the time.",
                  "id": 154,
                  "comments": [
                    {
                      "score": 53,
                      "content": "I love the name Bexar for a cat. I named my first animal crossing island Bexar.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "My childhood cat used to respond to my name. I think she was like \"oh, that's where mom is.\"",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "One of my cats never responds to his name,  but if he's in the other room and I say it he'll come trotting in.  I think he only ignores me when he can see me",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 142,
                  "content": "Lol, my cats understand \"no\" and if they could physically say it, I fully believe I would be hearing it back when it's time to go to the vet.",
                  "id": 158,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Cats are a fun case too because they speak to humans completely differently than they speak to other (adult) cats!",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I used to have a cat that would say “no” and try to get away from me when I had to clip her nails.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I've watched videos of huskies complaining and tell me you can't understand them and vice versa!",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "They understand but do they obey?\n\nOr do they look at you and say 'Whatcha gonna do, Hoo -man? How's about I knock this glass off the table?'",
                      "id": 162,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "Mine understand no as well! They also understand that \"DON'T\" is an escalation of no, and that if they persist after I say don't then I'm going for the squirt bottle next. I don't even have to squirt them, I just have to pick it up and point it at them.",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Yep! My cockatoo has a pretty large vocabulary, it gets much larger when she's mad! She is insanely smart! The only time she swears is when she is really mad. She's a rescue, so we didn't know the full extent of her vocabulary (and I don't think we do even now) but my husband told her no one day, and she told him to \"go f*ck himself\". She won't talk to strangers. Though I'm pretty sure she would go home with any little kids that would take her, and about half the dogs in the neighborhood too.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "A friend of mine rescued a cockatoo that had learned some rather unsavory language in a prior home. One day, a man who had been very unpleasant to my friend in a meeting came by to apologize for his unwarranted behavior. After a minute or two of the guy apologizing, the bird screamed at him \"fuck off!\" The guy looked shocked, and my friend apologized (and explained where the bird had learned to say such things, because my friend did not use such language), and the guy quickly left. Then my friend gave his bird some mandarin sections as a treat and told him he was a very good boy.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I worked at a pet store through college, and we had a parrot that knew a LOT of phrases.  He would always say \"Hello?\" whenever the phone rang, and no other time.  One time I was there alone in the morning before opening, cleaning and whatnot.  Suddenly he piped up in the silence - \"Hello?\"  A short moment later the phone rang.  I was so creeped out, lol!  I assume the phone must have made some sort of inaudible-to-humans noise before ringing, that he was picking up on.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": ">Cats and dogs often learn to associate key words with contexts, and parrots are a great deal smarter.\n\nIf you've ever had a dog and said the word \"Walk\" or fucked up with either and said \"Vet\" you will 100% know that they can understand the meaning of some words.\n\nTook me an hour to find my damn furball last time I said Vet. Bugger noticed the cat carrier in the hallway, heard the word and decided to embrace his inner ninja.",
              "id": 167,
              "comments": [
                {
                  "score": 6,
                  "content": "Yeah, mines know their name, and a couple of words, including \"no\".\n\nThat one is particularly hilarious because you can see them react and start calculating whether they can finish doing the thing before I can lunge for them.",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 295,
          "content": "my cat understands “do you want to eat?” She might not literally understand what “eat” means, but when she hears that word, she goes to her bowl and meows for it, every single time. And if i say eat, but not at her, her ears twitch and she perks up.",
          "id": 169,
          "comments": [
            {
              "score": 112,
              "content": "My cats all know the word \"treat\" and will run from wherever they are in the house to the kitchen.",
              "id": 170,
              "comments": [
                {
                  "score": 12,
                  "content": "our cat knows 'treat' and starts meowing pitifully as soon as anyone uses the word. so, because sometimes we'll check with each other before giving her a treats whether anyone else has already given her some, we began spelling it out. \"Hey, guys, did any of you give her a t-r-e-a-t yet?\" And now she's figured out the spelling and starts yowling if we do that too.",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Amen to that!  If I ever need to know where my cats are, all I have to do is holler 'treats!' And they come running.  Yta, but only cause you're 16 and we all were at that age.  You'll grow out of it and start speaking to birds eventually too.  Maybe you'll even tell your kids the story of when you were a big ol jerk to your little sister and they will roll their eyes at you and think how stupid you are.  Because of course, they will be know-it-all teenagers and you'll sigh and think...yep, I deserve this.",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 151,
          "content": "I can imagine OP saying ‘i love you’ and the parrot being silent. \n\nBirds and pets in general know like you said and it seems like OP is already getting ignored.",
          "id": 173,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": "Just went to check in with my dog to make sure he knows I love him. He seemed pretty pleased. Then I asked him if he wanted to clean his teeth, and he got very excited because he absolutely loves his Greenies. So yeah OP. That bird knows. And that bird knows YTA too.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "A lot of people seem to think that animals don't have complex emotions. They absolutely do. The range of a small kid, but still can be quite intelligent. My dog, my girlfriends dog, and every other dog I've handled before have had a lot of different quirks and emotions surrounding those quirks. Its how they have personalities!",
          "id": 175,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6502,
      "content": "YTA. A ten year old is having fun and you want to stop the fun because you're worried she'll suddenly think she's in a Disney movie? So what, she's 10. Stay in your lane",
      "id": 176,
      "comments": [
        {
          "score": 2821,
          "content": "eh, for all we know she is a Disney Princess\n\n* has an animal sidekick\n* animal sidekick is a parrot, so quite possibly can talk to her\n* has an evil relative, OP the villain.\n* OPs first post, so introduced in the first 'movie', not a sequel\n* Main character of the post\n* parentage unknown. Her parents may be royalty or she may have to marry into it or perform heroic acts.\n\nHer story isn't over yet.",
          "id": 177,
          "comments": [
            {
              "score": 188,
              "content": "I wish I could upvote this more. Fuck yes x100 to this comment.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "There's a special parrot room. Parents must be rich!",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 592,
          "content": "exactly this ^ op, YTA. \n\nwho cares if the parrot can understand her or not? it makes her happy, let it be. i’m 25 and i talk to my pets all day everyday.",
          "id": 180,
          "comments": [
            {
              "score": 35,
              "content": "I'm of retirement age and talk to my cats, dog, and all the birds & squirrels I feed. Oh, and let's not forget my plants!\n\n&#x200B;\n\nSo long as they don't actually speak back to me I should be fine.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 258,
          "content": "At 10, she's well aware of the limitations of communicating with an animal of another species.",
          "id": 182,
          "comments": [
            {
              "score": 12,
              "content": "She’s also aware of the limitations of communicating with her brother which is why she didn’t bother.  \n\nYTA OP",
              "id": 183,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "OP probably even played superhero or pretended to be a dinosaur when he was a kid too, but talking to a bird who can understand and communicate is somehow outside the realm of possibility. \n\nAbsolutely YTA even if she DID think she's a Disney princess, who cares? Kids should be allowed the whimsy and fantasy of being a kid.",
          "id": 184,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "As someone who works at Disney World, I tell kids all the time that Cinderella’s animal friends come out to help us clean after the guests go home.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "OP is suddenly the authority on child development without ever having picked up a book on it.",
          "id": 186,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "She and the bird are talking shit about OP for sure. 🦜",
          "id": 187,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Also she's 10, they doesn't mean she's an idiot. I think most 10 year olds know reality vs cartoon cleaning and singing animals.",
          "id": 188,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3387,
      "content": "YTA. What was the point of you saying that other than to just be an asshole? There was no reason. Bully behavior.",
      "id": 189,
      "comments": [
        {
          "score": 539,
          "content": "Right. \"she said I'll be bullied in school\" - at this time you are the one bullying her.",
          "id": 190,
          "comments": [
            {
              "score": 30,
              "content": "Some people have funny ideas of what motivates a bully.",
              "id": 191,
              "comments": [
                {
                  "score": 23,
                  "content": "Right? The kids at school will probably be jealous of his sister’s cool bird!",
                  "id": 192,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "I can assure you, my child speaks to stuffies and our menagerie of small pets. They are almost 9.5. Make believe is normal tween behavior and talking to your pets is just normal people behavior. It’s baffling OP thinks sister is going to get teased for <checks notes> the same things her classmates do every day.",
              "id": 193,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "YTA; \"Does it need saying?\"\n\n\"Does it need saying now?\"\n\n\"Does it need saying now, by me?\"",
          "id": 194,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2207,
      "content": "YTA\n\nI talk to my pets all the time because even though they don’t understand what I’m saying, it has been proven that talking to pets helps them bond with you. There’s no harm in it. Listen to your sister and stop bothering her",
      "id": 195,
      "comments": [
        {
          "score": 610,
          "content": "Animals may not understand the words you are saying, but they understand the cadence and tone with which you are saying them. They understand when you are speaking to them words of love and safety and comfort, or food! Cats have even learned to communicate back with us by meowing to us to sound like babies crying. OP is 16 and thinks he knows everything. He has a lot to learn about the world and communication among species, starting with his own. YTA.",
          "id": 196,
          "comments": [
            {
              "score": 152,
              "content": "[This cat](https://www.youtube.com/@BilliSpeaks) is slightly off-topic, but watching her communicate is pretty adorable",
              "id": 197,
              "comments": [
                {
                  "score": 83,
                  "content": "Was hoping that would be a link to Billi. Animals are way more intelligent than many give them credit for.",
                  "id": 198,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I can guess Billi’s reaction to OP for sure",
                      "id": 199,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "I rather thought it would be the video of the cat that uses sign language instead of meowing when begging food from the owner.",
                      "id": 200,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Billi is the cutest.",
                  "id": 201,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Billi is fantastic! The recent video of her asking for her dad and arguing with mom about it was so funny.",
                  "id": 202,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yep. I tell my sister's cat I love her all the time and I know for absolute certainty that she a) understands me and b) does not reciprocate those feelings.",
              "id": 203,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "There's a \"making of\" vignette in one of the LOTR dvds about the many horses they had in the movies and they said that whenever they had a horse in a scene, they had to use code words for \"Action!\", because the horses had learnt that \"Action!\" meant \"go\" and so when they heard it they would take off running.",
              "id": 204,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1529,
      "content": "YTA. You sound weirdly jealous of the new family pet OP. Maybe talk to someone about your feelings and quit lashing out at your sister over nothing. Who cares if the bird actually understands or not? Your sister loves the bird, and unless you think your sister is a total moron she knows it's not a magical talking cartoon animal.",
      "id": 205,
      "comments": [
        {
          "score": 506,
          "content": "Like what does the OP want the family to do?  Adopt a bird and neglect it?",
          "id": 206,
          "comments": [
            {
              "score": 511,
              "content": "Seems so. Entire *MONTHS*, and the family is still enjoying the pet they decided to commit decades\\* to. How can they not be locking it in the closet yet?\n\n(\\*Hopefully...)",
              "id": 207,
              "comments": [
                {
                  "score": 185,
                  "content": "Yeah this part makes no sense to me. I've had my cats for years but heck, after the first six months it's just common sense to start moving them into closets. My cats are only allowed out on their birthdays and on Christmas now. That's what ALL good pet owners do. \n\n/s, in case it wasn't obvious. Serious, I'm still as excited about my cats and talk to them as much as I did when they moved in - 8 and 7 YEARS ago... I talk to my doggo of almost 4 years too...",
                  "id": 208,
                  "comments": [
                    {
                      "score": 17,
                      "content": "My dog is 11 almost 12 and we still have chats. She sits with her head on my lap and I tell her how cute she is. She doesn't understand what I'm saying but she knows that I'm being sweet and it's affectionate and that's enough for me",
                      "id": 209,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I’ve had 3 of my cats for 18 years…longer than OP has been alive.  They’ve been around longer than my husband has been in the picture.  I can’t even wrap my head around how life will be when they’re gone…hell my husband can’t imagine what it’ll be like when they’re not here.  He sings songs to them every single solitary day.",
                      "id": 210,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 132,
          "content": ">Your sister loves the bird, and unless you think your sister is a total moron she knows it's not a magical talking cartoon animal.\n\nThat's the part that got me: OP is accusing the sister of not understanding how birds work when he clearly does not know how people work. In what universe does talking to your pet equate to thinking they literally understand every word?",
          "id": 211,
          "comments": [
            {
              "score": 15,
              "content": "The funny thing is that it's OP who doesn't understand how birds work! Parrots are some of the smartest birds and you are *supposed* to talk to them, it's good enrichment. They're social and they need to use their brains to have happy, healthy  lives. Not talking to your parrot is like not walking your dog!",
              "id": 212,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I don't have pets but I dog sit in a country where my native language isn't widely spoken. I always have long conversations with the dogs in my native language knowing full well they don't understand a word I say.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "> she knows it's not a magical talking cartoon animal.\n\nRight!! Like obviously the OP is the AH, but also his sister sounds way smarter than he does here. What part of his sister’s reaction could have been reasonably interpreted as seriously believing that the bird understands English? She gave him a sour face, and told him to quit bothering her. Not the actions of a girl whose fantasy worldview has been challenged, but the actions of a sister who is annoyed that her brother’s a dumbass and a bully. \n\nIf anyone is a gullible moron, it’s not the sister.",
          "id": 214,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1446,
      "content": "I feel like YTA a little bit. It doesn't sound like your sister was being delusional or thinking she's in a movie. It's normal and healthy to express love and affection to pets. I tell my cat I love her all the time. \n\nMost animals can't understand what we're saying, but they can understand how we say it in our tone. Parrots are unique in that they can learn up to 100 words/phrases, what they mean, and say back to communicate. Your parrot might start saying I love you to your sister when it feels safe or wants to see her happy.",
      "id": 215,
      "comments": [
        {
          "score": 308,
          "content": "Exactly!! From the title I thought this was going to be about how his sister was having delusions that she can communicate with birds through some mystical power only she has, you know something batshit like that. \n\nBut no, it was about OP being an asshole to his sister because for some reason he can’t stand to see her enjoying spending time with her pet. From his sisters responses she knows damn well the bird doesn’t understand English, she just wanted him to screw off because he was being a kill joy. \n\nOP, YTA and despite what you think you don’t know everything. And from your responses you clearly know nothing about bird emotional intelligence.",
          "id": 216,
          "comments": [
            {
              "score": 46,
              "content": "Yeah like literally going from \"a bird\" to \"pet parrot\" changes the story even before we get into the details.",
              "id": 217,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Plot twist, OP's sister is a gender-bent Falcon.",
              "id": 218,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "I was expecting it to be a 4 year old and it was either going on to be ignored by the 4 year old, or ruin their fun.",
              "id": 219,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "But even if she was pretending to be in a Disney movie…she’s a 10 year old child!! That would be perfectly normal and healthy.\n\nI know few adult women that didn’t pretend they were living in a Disney movie. I used to go outside and SING and talk to wild birds outside!!? I used to take chopsticks out the kitchen drawer and go do “spells”, and complain about my “muggle family”. At no point was it because I genuinely believed I could actually do any of these things, although to anybody watching it probably looked ridiculous. \n\nWas OP born a miserable 16 year old buzzkill or did something happen to make him like this??",
          "id": 220,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "A lotta bit. A person that doesn't talks to their pets is a strange person. Does he expect his sister to never say anything to the parrot, who has an ability to speak? Dude is a buffoon",
          "id": 221,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 886,
      "content": "YTA. What did it cost to stay quiet and not be a dick? Also birds are smart- especially parrots. They can definitely form relationships/bonds with their owners. \n\n&#x200B;\n\nIt's giving \"edgy teen\" and that's okay because that's where you are in life right now- but take it from me constantly playing the cynic is not going to make you many friends, or even allow you to see the beauty and whimsy in life.",
      "id": 222,
      "comments": [
        {
          "score": 162,
          "content": "Beautifully said\n \nOP do you really want to be this person? \nRipping joy from others?",
          "id": 223,
          "comments": [
            {
              "score": 24,
              "content": "Yes, he wants to be that person as long as it makes him feel smart/superior. I was once a know it all because I wanted people to think that I was smart, but really people just saw me as a smartass/jerk. After growing up, I act normal and people always tell me I’m smart despite me not trying to act smart whatsoever. If you’re truly intelligent people will be able to tell without you acting like a know it all.",
              "id": 224,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Oh that last sentence is chefs kiss. Magic & whimsy are so damned important. My son is just about to turn 15 & whilst he has lots of sullen sulky teen moments he still has those flashes of magical joy I tried to instil into him as a little kid. It’s so important to keep magic in your life.",
          "id": 225,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 575,
      "content": "YTA.\n\nOk, zoology major here.  It is entirely possible that the bird understands her, at least somewhat.  Birds in general, parrots moreso, are exceedingly smarter than most people expect.  \n\nThe key is to think of talking to most animals as talking to a foreign person.  Even if you don't understand the words, you pick up tone, subtext, etc.  And, given enough time, you will learn some of that language.  Just like I know which of my dog's barks means food versus which means play, and how I know if my cat just saw something interesting in the other room.  \n\nAlso, animals, birds included, do form emotional relationships with others, those of their own species and those of other species.  So, yeah, if your sister is nice to the bird, takes care of it, and shows it affection, it likely does reciprocate her feelings.\n\nAnd beyond that, there's no harm to letting her believe so.\n\nSo you're doubly TA.  Once for trying to crush her dreams, and again for being so wrong while doing so\n\nEdit: thanks for the awards!.",
      "id": 226,
      "comments": [
        {
          "score": 87,
          "content": "This! Glad someone with a scientific background weighed in. \n\nOP admits to not being an animal person, so it’s understandable that he might not know about all the amazing research into animal intelligence and emotions that’s been done…but that just means he shot off his mouth about something he didn’t know anything about just to make his sister feel bad.",
          "id": 227,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Dude sounds like one of those guys that would make his girlfriend get rid of her cat because it's \"just an animal\" and doesn't believe they have feelings.",
          "id": 228,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "My dog will come yell and fuss at me when he wants a walk. If I tell him to give me a sec or lemme finish something he'll sit and wait then jump me as soon as I'm done so I don't forget his needs.",
          "id": 229,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}