{
  "post content": "My mother-in-law watches my three kids.  They are age 5, 3 and 7 months.  My mother-in-law usually watches them and drops them off from school. The kids are battling a stomach virus so everyone was home on Monday. \n\nThe little one had a poop explosion so my mother-in-law washed her butt in our bathroom sink.  However, she did not clean up after and there was poop all around the sink, on the toothpaste, on the toothbrushes and the little cups that the kids use when brushing their teeth.  I have pictures if you guys really want to see.\n\nThis has happened before but it's the first time we said anything. When my wife called her mom to be more careful because it's absolutely disgusting and gross.  My wife is Hispanic so her tone can definitely be aggressive, especially to a gringo like myself, but her mom seemed to understand the frustration. However, once her sisters (both in their 30s and single for good reason) caught wind that my wife 'belittled' their mother all hell broke loose.  The sisters began defending the mother, calling out how dirty/messy our house is, calling my wife fat and basically just saying how lucky we are to have the MIL in our life and it's no big deal. In fact, were the a-holes for being upset about this. \n\nI guess the sisters got to my mother-in-law because then MIL came back and started parroting the same talking points about how messy our house is, how ungrateful my wife is and how my MIL cleans our house and cooks for the kids all of the time. My 5 year old son was also at her house this weekend and had an accident where he hershey squirted on the bed cuz he's sick That was also thrown in our face multiple times. They also referred to watching our kids as FAVORS which is weird because they always ask to take them. \n\nMy mother-in-law says she won't come ever again to watch the kids. She no showed today so I had to call out today to watch the baby which is fine.  However, I don't like how the MIL is affecting my job and career with her pettiness as I had some important stuff scheduled today. Keep in mind, we pay her $300 (cash) a week to watch the kids.  Now I'm going to pay about $150 more per month for someone to watch the kids which is no big deal really.\n\nHowever, my son's birthday is tomorrow. They had a big ol party planned at my mother-in-laws for Saturday. However, I have told everyone that we will not be attending the party and we have barred her family from seeing, giving gifts or even speaking to the kids for the time being. \n\nAITA for cancelling my son's party and not allowing my wife's family to celebrate his birthday on Saturday?",
  "id": 1,
  "comments": [
    {
      "score": 7080,
      "content": "Your MIL didn't bother to clean up unhygenic material from your house and is blaming you for having an unclean house?  No, that's on her.  Your kids could have gotten sick from her behavior.  Oh, wait, they are.  Hmm.\n\nYour kids are sick, and the mess they make is somehow your fault when MIL is the one doing the caregiving?  No.  It's not. \n\nThis isn't the first time such things have happened?  \n\nGet better caregivers.  MIL isn't competent.  If she can't prioritize safety issues like cleaning up after such things happen, she's not being safe for your children.  Makes me wonder how often they have gotten sick because of her unsafe lack of cleanliness.\n\nWhen your wife complained about MIL's incompetence in childcare, MIL went out and got herself some enablers to support her incompetence?  And they attacked your wife and you, insulted you both, etc.?   \n\nNTA.  This is about not spending time with the people that blame and insult you for the things that someone else did.  They behaved badly, and are blaming you.  That's not people who are healthy to have around your children.  I wouldn't want to have them around to do more of the same thing on your child's birthday, either.  \n\nProtecting your child and having a birthday that doesn't include people that blame you for the behavior of your MIL, that's just being a good parent.  Having such people around for a birthday would spoil the birthday.  And it would teach your children to blame others for their own behaviors.",
      "id": 2,
      "comments": [
        {
          "score": 3434,
          "content": "Keep in mind that OP and his wife actually PAY MIL  to babysit. It’s no longer a favor, it’s a service. And 1200 bucks a month is a sweet deal for watching kids. I know people who wouldn’t spend a dime on that. \n\nWith that price, I genuinely feel OP is totally entitled to ask MIL to be clean. I understand it’s cheap for a babysitter, but that’s no just loose change either!",
          "id": 3,
          "comments": [
            {
              "score": 912,
              "content": "“Sweet deal” for the parents - a nanny for one child will run close to $20 an hour, at least $25 an hour in larger cities. Add in two extra kids, including an infant, and that price goes way up. And many will cancel if your kids are sick, especially with a stomach virus.",
              "id": 4,
              "comments": [
                {
                  "score": 848,
                  "content": "I totally agree on that. But for MIL who by the sound of it doesn’t have a job, that’s a lot of change to spend on whatever you need. OP also confirmed that a regular nanny would cost 150 more per weeks. Means that in their area, it’s somewhat close to a decent wage.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 310,
                      "content": "I’m curious who would accept less than $1500 a month to take care of three kids. Certainly no legitimate caregiver with training. This sounds like a “you get what you pay for” situation.\n\nETA: for all the people claiming that $300 a week (“cash!!!”) is so amazing that anyone would jump on that, please look up what nannies charge in your region. My point isn’t about the grandmother, it’s that an unrelated person who is an actual childcare professional would charge much more because it is an actual profession. In any case, the OP has clarified that he did not hire someone at that rate, the children will be going to school and daycares.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 69,
                      "content": "OP said an extra $150 a month. So he's paying her $1200 for something a professional babysitter would do for $1350 a month in their area, if I'm understanding it right so.. he's practically paying her what a babysitter would cost but the babysitter wouldn't be likely to leave human feces splattered everywhere and blame the parents who hired them for it",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I don’t know a single nanny who would watch three (sick) kids for that money. We paid nearly $5500 a month for our own 3 kids in daycare, and a nanny would be much more expensive.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 0,
                      "content": "Regular nanny will cost way more than 150 more a week they have 3 kids and expect them to clean. Lol",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 79,
                  "content": "Ha yeah our nanny is $22 per hour, extra for gas, time and a half for travel, and we pay for all meals and what not. And NO CLEANING. Yea she cleans after a baby mess, but she’s not expected to clean after anything else and no nanny I have heard of will either. Dying at this, I pay over $1200 a week. MIL is not a great caregiver, but she is not being paid caregiver fees either.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 14,
                      "content": ">MIL is not a great caregiver, but she is not being paid caregiver fees either.\n\nTrue, but there's a difference between \"family caregiver who isn't great at it\" and \"leaves poop on peoples toothbrushes and drinking cups\"\n\nI would be expecting someone who thought it was appropriate to make and leave that kind of mess at my house to at least buy me new toothbrushes, not pay them $300/week.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "Holy crap are you ripped off! Lol. Put the kid in daycare for Pete's sake and spend 300 a week. Why on earth would you pay that much for a nanny? Also, in my area people wanted a full time sitter at their homes (I was on care.com) and you would be lucky to find something at 200 a week",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "It's a sweet deal if it's a grandparent who wants to spend that time with their grandkid.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 30,
                      "content": "And that cash money is tax free income, unless I misunderstand the OP.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "But that’s literally the whole point “EXACTLY”she’s the grandparent who “WANTS” to spend time with her grandkids because she loves them and wants to see them so why the heck is she getting paid at all?",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "I don’t think any reasonable person family or not wants to spend time with a kid that has diarrhea",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "Yes, but nannies are qualified for what they do, and competent. MIL is *very much* neither.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 1,
                      "content": "But even if she was why is she getting paid to watch her “OWN” grandkids anyway",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This is why I would never hire a family member or be hired by one; messy family dynamics plus money is never a good situation. Keep it as a favor or keep it professional, but don’t mix them up.\n\nOP pays for MIL to watch the kids but not anywhere near full market rate, yet doesn’t think he’s getting a “favor.” You can’t pay for the kind of care and attention a grandmother will give her grandchildren, but OP doesn’t appreciate this; MIL is just a source of childcare for him. Granted, poop everywhere is really gross and shouldn’t happen whether or not she’s paid, but I have a feeling both OP and wife would be nicer about it if she was free childcare. MIL feels that she’s doing OP and wife a favor by taking care of her grandchildren and not charging full market rate, but she’s still taking money so she can’t be on the high horse that she’s on about providing them favors. OP should just pay for his own childcare, because neither side appreciates what the other is doing for them.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 10,
                      "content": "[deleted]",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "Sounds like she kept the 5 year old outside working hours which IS a favor when he shit her bed.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "> at least $25 an hour in larger cities\n\n*cries in Bay Area*\n\nIt’s $35 p/h at least for qualified & experienced care here. Shockingly our childcare costs are going to go *down* when he goes to preschool 😓",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Yeah, $300 a week for the kids (toddler and 2 infants) is a great deal. If they end up paying less than $600 a week I would be surprised",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "He couldn't just let it go, realise the MIL obviously made a mistake or was overwhelmed, throw out the offending items that cost a few dollars, bleach the sink & move on with life. Now he'll pay more, have to take extra days off sick because no sane person looks after 3 children with exploding bums & is distancing his children from people who love them.",
                  "id": 24,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": -1,
                  "content": "No kidding. We paid nearly $5,500 a month when our 3 kids were in daycare. 1200 for three kids (including a baby) is NOTHING.\n\nYTA. Your three kids all were sick and had diarrhea and MIL was with them all day long. She left the house messy but maybe she was overwhelmed. You pay her but not enough for THREE SICK KIDS plus house cleaning. Just clean the sink and mention (politely) to her that she should wash the baby in the bath next time there’s a poop-splosion. \n\nI get it. I’m a mom of three. When 3 kids have diarrhea, there’s nothing in the bathroom that’s clean. Maybe you should watch your own sick kids and give her a break.",
                  "id": 25,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 85,
              "content": "What? $1200 per month is not nearly what you would pay a stranger or for daycare, especially for 3 kids, one being an infant. I wonder who OP got for $150 more a month. I do think they need to hire someone who is not MIL.",
              "id": 26,
              "comments": [
                {
                  "score": 265,
                  "content": "To clarify; The oldest is at school all day. MIL just handles drop off. The bus would come pick him up as I leave for work but she INSISTS on dropping him off. He was home Monday/yesterday cuz he had the shits. \n\nThe middle child attends half day preK on Tuesday, Wednesday and Thursday. But she's with MIL all day on Monday and Friday.\n\nThe 7 month old is the main one she watches Monday through Friday. \n\n\nThe new plan is bus picks up the oldest so he's at school all day.  Middle child now attends full day PreK 5 days a week instead of half day/3 day a week.\n7 month old goes to a home daycare with a local pastor.\n\nThe new deal is going to cost me maybe ~$150 more per month with no bullshit. (Pun intended)",
                  "id": 27,
                  "comments": [
                    {
                      "score": 122,
                      "content": "Now it makes sense. The price didn't sit right for 3 kids.\n\nI think you are doing great by standing your ground. Also don't rob your kid his birthday party, try to see if you can arrange it in your home itself maybe in a weekend",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 73,
                      "content": "Pretty soon MIL will complain that you're denying her seeing her grandbabies, then she'll complain that you're denying her money to live so now she's broke  because of you.  Stick to your guns.  In laws sound toxic",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "Careful sending him to a pastor’s home all day.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Oh I would *absolutely* spend an additional $150 a month where the trade off was that I didn’t have poop on my toothbrush (or deal with my MIL). \n\nBut really, the fact that this has happened MULTIPLE TIMES, like poop everywhere in your bathroom *and* magically on your toothbrush is disgusting. Yeah accidents happen that have to be cleaned up but there is such an oversight on your MILs part to not even properly and completely clean up the blasted areas. Imagining she’s this unsanitary when it comes to *literal poop* makes my mind race. Like how often do your kids get sick?! I’d constantly be worried about things from my kids being dirty and not cleaned properly to even questioning her food safety and what she was feeding my kids!",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "To be honest, full day pre-K will better prep the 4 year old for K. I know a lot of folks in 1/2 day programs who got a really rude awakening in K with just how much more ahead full day pre-K kids are.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "What’s the plan when they kids get sick? They won’t be able to go to daycare or prek.",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "I mean, it’s still a good deal. We were paying 5500 a month for full time care for my 3 kids over the summer. Now that the oldest is in school, we pay 3500.00. Pre-K programs in our state cost extra, so if my kids did that, it would cost even more. \n\nWhat we pay for daycare is very reasonable in our state. 1200/month for three kids is barely anything. If she’s doing driving and pick up, that’s something a nanny would charge extra for, plus mileage. Childcare SHOULDN’T cost so much but it does. It’s brutally expensive. I’d say either pay somebody what they are worth for 3 kids, OR deal with MIL and be polite. I also struggle with my in-laws, so I get how hard it is.\n\nEdit: Any nanny in our area expects paid sick leave, a few paid personal days and about 2 weeks paid vacation. You cannot expect a good nanny to work for less than minimum wage, either. Childcare is so expensive. Your mother-in-law is giving you a good deal.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "A good home daycare is a great thing. It’s less expensive than a daycare center, and the kids get a nice, relaxed experience. Or mine did, anyway.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Except when your kids are sick one of you will have to stay home and take care of them.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "OP if your MIL was caring for your toddler for 37.5 hours a week… that means you were paying MIL $8 an hour. Even with cash, that is still grossly undervaluing your MIL’s services. To say that she was not doing you a favour… is not factual.",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 21,
                  "content": "Probably an acquaintance or a family friend/ SAHM  with older kids, or even a young nanny who wants to build up her resumé/notoriety in the area to try and make more in the future. I have no idea of how much a Nanny cost in the US, and I can’t know for sure where OP is from. So we’ll have to take his word for that.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 12,
                      "content": "reputation is a better choice than notoriety in your context.",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "What’s most common in the US is paying a nanny service who then pay the nanny a wage and benefits. This allows the nanny in question to have sick days and vacations as well, and for the parents to have longer days covered by two nannies if they need. However, under the table deals like this aren’t uncommon, either. People who can’t afford nannies usually use state-subsidized daycare (only a couple hours a day, not usually a full work day) or home daycares which are much cheaper than centers. Or have one parent take the night shift so they can watch their kids during the day. This is much more doable in a multi-generational household where the grandparents or aunts and uncles can just watch the kids at night and the parents get to spend waking hours with the kids and build that bond with them.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "5 year old is probably in kindergarten. 3 year old if potty trained could be going to preschool(this costs much much less than daycare). So it might not be 3 kids full time. More of a baby all day and 2 others for a couple of hours. I don't understand it only being an extra $150 a month. Maybe they mean an extra $150 a week unless they live in a super low cost of living area?",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "To put the amount in perspective: idk how many hours MIL is watching the kids, but 40 hours at $8/hr, which is above minimum wage, is just around the same amount per week (gross, not net), but they're paying her in cash, so she actually takes home *more* than someone making $8/hr because she's probably not paying taxes. So, she's getting as fair pay for her work as many nannies do. Hourly pay for nannies is between $7.25/hr and $20/hr based on a quick search I just did, so, while it's on the low end, it's within the standard range. This is no \"favor\" she's doing. It's a job she's getting paid typical wage for and, in that role, she should absolutely be expected to maintain some basic health and safety standards for those kids. \n\nAlso, OP very clearly has a norovirus rotating through their children, likely because MIL isn't cleaning up properly after accidents. When a norovirus is going through a household, bathroom areas need to be cleaned with bleach frequently and regularly, even when there aren't accidents. Repeated bouts of diarrhea like that can cause GI problems down the road, so this situation needs to be nipped in the bud, fast. Honestly, I wouldn't let MIL watch the kids anymore.",
              "id": 42,
              "comments": [
                {
                  "score": 18,
                  "content": "When the kids are sick with a highly contagious disease, THEIR PARENTS need to be watching them. I don't know about nannies, but daycares darn sure won't let you drop off a sick child while you waltz off to work.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Valid point, though my point still stands that it's likely MIL'S lack of cleanliness is the reason they have this in the first place.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Not every parent can afford to take off work for that. Shift work is a thing.",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Most states have a higher minimum wage than the federal minimum wage. Also, if low wages are taxed, they are refunded at the end of the year. So they wouldn't be making more.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Idk where OP lives, but my search was for wages in my state, which uses federal minimum. And, while most states have higher minimums, \"most\" is only 29; 21 states still have minimum wages at or below the federal guidelines. Not that I think that's right (I don't), but it's the standard in nearly half the country. Also, OP mentioned in another comment that MIL used to work for a temp agency, most of which pay minimum wage, so she herself was likely making more money watching the kids than in her previous job.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I just looked up the minimum wage for the US & its only $7.25/hr. How can anyone live on that? In Canada the minimum wage is $15/hr & that's still not a great wage.",
                  "id": 48,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Um, NO. I pay 1000 bucks every two weeks for two kids at daycare. And I am getting a sweet deal because I'm not at one of the lore expensive places in my area.",
              "id": 49,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "1200 for three kids is nothing. My kiddo is already 12 - so way past daycare age - but even for only *him* we already paid 2k per month (slightly less once he was potty trained). Granted, we live in a very expensive area, but I think OP is delusional if he thinks that he can get anything close to the current deal that he gets.",
              "id": 50,
              "comments": [
                {
                  "score": 8,
                  "content": "OP pays more, MIL loses $1200 per month. Lose lose situation but definitely for the better.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Who pays their MIL to watch their kids anyway though my grandparents would take us not because they had to or were paid to they’re my grandparents they’re my family who love me and my brother and my cousins they would watch us for free their houses are like our second and third houses they’re not some random stranger from like care.com or something they’re our parents parents lol she shouldn’t be getting a penny or demanding a penny either especially now with her behavior. Also can you clarify the situation is your MIL “THAT” kind of person or did her horrible daughters get in her head and mess with her which made her say these things?",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "No no no no no - $300 Is not a lot for looking after children and I’m sure MIL did the job for love, not money and after spending a day looking after 3 under 5’s with diarrhoea you think she should then go and clean the bathroom!!! NO! she’s probably knackered and the least those parents can do is say a huge thank you for looking after three poorly children and then go clean the bathroom themselves!!",
              "id": 53,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -2,
              "content": "$300 (cash) a week for three kids is not a sweet deal, that's exploitation. Doing it for so little money is a favor.\n\nBut NTA for canceling the birthday party. She No showed bc she didn't like that her daughter spoke to her about cleaning more carefully? Insulted y'all and stopped speaking to y'all but expects for y'all to just bring the kids over for a party??? Delusional.\n\n\nBut overall verdict has to be ESH. You for taking advantage of your MIL and your in-laws for being unhygienic, immature effs.",
              "id": 54,
              "comments": [
                {
                  "score": 6,
                  "content": "I was on care.com for a long time. Never found anyone willing to pay 300 a week for full time work. Why I went out and got a real job",
                  "id": 55,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 136,
          "content": "Totally agree! You did miss one point. Why is the mother in law washing a 💩 child in the sink where people brush their teeth and get drinks of water from???? It's much easier to wash a kid off in the bathtub. Even an infant. More room between the faucet and bottom of the tub, less risk of people putting ecoli in their mouths much easier to clean after the child is bathed. This sounds like this is a semi regular occurrence in this house. The kids probably have a nasty case of cross-contamination going on if they are sick and the parents aren't. I hope they take the kids to the doctor if this continues before it becomes a chronic infection.",
          "id": 56,
          "comments": [
            {
              "score": 80,
              "content": "It is not abnormal to wash a baby in a sink. However, I literally do not understand how any of the poop ended up OUTSIDE of the sink and all over the counter. Like how? Also, if you wash a baby in a sink it is not hard to disinfect after, it's a sink. But nothing should have ended up on the counter...",
              "id": 57,
              "comments": [
                {
                  "score": 23,
                  "content": "> miss one point. Why is the mother in law washing a 💩 child in the sink where people brush their teeth and get drinks of water from???? It's much easier to wash a kid off in the bathtub. Even an infant. More room between the faucet and bottom of the tub, less risk of people putting ecoli in their mouths much easier to clean after the child is bathed. This sounds like this is a semi regular occurrence in this house. The k\n\nProbably a blow-out while in the sink. It happens, especially if kid is sick.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "It would splash everywhere, there's a big difference between washing your hands in the sink and trying to wash a squirming baby.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "No wonder why the kids are sick...",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "It’s possible that MiL has back/joint/pain/vertigo issues and wouldn't be able to bend down AND get back up with the wee one. I’m not going to lie I have a hard time getting into a bath and I ain’t that old!",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Exactly, this is why we got washed in the *kitchen* sink. Easy to disinfect it afterwards and nobody's toothbrush gets shite on it. \n\n\n(I think it's gross to leave toothbrushes out in the bathroom anyway)",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "Yah having a stomach virus multiple times at such young ages is not normal. And if she's cooking for them.... Sounds like a bout of food poisoning constantly going around (which can be passed person to person).",
          "id": 63,
          "comments": [
            {
              "score": 3,
              "content": "I vote for giardia which is a bacterial parasite caused by ingesting fecal matter. It's why you don't want to drink out of forest streams. Or anywhere MIL's been washing baby butts.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "Oh good point! OP they probably have diarrhea BECAUSE of how unhygienic your MIL is",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "That’s a fucking biohazard. It’s disgusting, and I really can’t understand the SILs here.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "[removed]",
          "id": 67,
          "comments": [
            {
              "score": 5,
              "content": "u/Emotional-Bath5029 is a bot.\n\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/10q1j3m/comment/j6nbs68/?utm_source=share&utm_medium=web2x&context=3",
              "id": 68,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "Perfectly said.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I'm sorry but finding poop on my toothbrush just once would be enough for me. How many times did it happen before you found out? That's not incompetence, it's malicious and disgusting. For it to happen a second time would cause me to FIRE her. A shower or bath is the only place to clean up the kids. You NEVER use a sink like that, especially when sick. Everything either needs cleaning with bleach, put in the dishwasher, or thrown out because you don't know what's been contaminated. \n\nI'm a Microbiologist. I have a messy house but I don't do gross and disgusting things. I keep sinks, etc. clean when I use them. They are using messiness to attack you but think this is OK? Oh, well. Her little tantrum just lost her $1,200 per month. I wouldn't be able to trust her again. What if she chose the kitchen sink next time? NTA",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Absolutely.  NTA.  Make sure your son has a lovely birthday surrounded by people who love and respect both him AND his parents.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Absolutely agree NTA",
          "id": 72,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1968,
      "content": "NTA ... mostly.... be VERY careful about using your kids as pawns in a power struggle with relatives though.  I agree you should cancel the party at MIL, but have one at your place and extend the invite (hint, they won't come but you look like the bigger person).  Don't bar them from sending gifts, it's not your kids fault you MIL is LITERALLY TOXIC.  \n\n\nI would consider the extra $150 a month a small price to pay to not have to mix family and money.  It sounds like your MIL and family could pull the child care rug out from under you at any time and hold it over your head as bargaining leverage to get what they want.  It may cost a bit more, but the stability and peace of mind you'd get with outside child support is worth it.  If you miss just one or two days of work a month because MIL refuses to babysit, you've lost more than $150.  \n\n\nI would go even further to say I would NEVER trust your MIL to watch the kids unsupervised ever again.  The lack of judgement she showed by thinking a shit-sink isn't a big ol health hazard is staggering...  who knows what other lapses in judgement might be waiting around the corner.",
      "id": 73,
      "comments": [
        {
          "score": 537,
          "content": "Also... I have three kids too... I would be shocked if your house WASN'T a cluttered mess all the time.  That's just par for the course... but there's a difference between messy and dirty.  A poopbrush is DIRTY.",
          "id": 74,
          "comments": [
            {
              "score": 137,
              "content": "Not sure how their house is dirty or messy considering MIL claims to clean it all the time... hmmmm...",
              "id": 75,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 463,
          "content": "Trust me, I don't like MIL watching my kids as we've had issues with her in the past. But she says no one will watch/care for her grand daughters like she does so then it becomes a fight as she insists that she must watch the kids.",
          "id": 76,
          "comments": [
            {
              "score": 466,
              "content": "\"Yes, you're right... no one else on earth would allow a poopbrush.  If you think I'm over reacting I'll apologize after you use this poopbrush in front of me\"  \n\n\nI get it MIL's are HARD.... mine is lovely, BUT we still have to deal with and diffuse a LOT of outdated thinking.  And if she MUST watch the kids, she shouldn't be asking for money for it.  Either way, I think you should just let things cool off and tell her you're getting child care for the stability.,.. you don't ever want to resent her if she can't watch the kids for some reason and you miss work.",
              "id": 77,
              "comments": [
                {
                  "score": 77,
                  "content": "That's a solid reasonable response right there, OP.   \nThe whole ability to say, \"we're doing this to remove a point of contention. We can address this another time after things have calmed down.\"   \nGetting some distance is a good idea.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 122,
              "content": "She's right. I bet nobody else would leave crap on tooth brushes because it's unsanitary and cleaning up after the kids is part of the \"job\"(not favour) that you pay her for. \n\nNo worry. She's fired.  Cut flying monkeys to complain \"how can you DO this to her?!\" It's ALL about MIL and I bet they have all treated your wife like poop for years. \n\nNTA",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "Yes I'm sure that's true. Most professional child sitters would know not to contaminate your toothbrushes with fecal matter.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "Ew the lady who leaves shit everywhere? My nanny would have bleached that sink down wtf. Do not let her watch your kids again, she’s not fit. My MIL is sweet as can be but when she sloppily wiped my kids ass in front of me and mentioned that she had poop under her fingernails and then didn’t wash her hands? Yeah, she’s never watched my kid and has also never touched a diaper again. Nasty.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "I’ve been a nanny for 20 years. I love my nanny kiddos like they’re my own, I take excellent care of them AND I clean up biohazards when they occur. Trust me, a professional, experienced nanny is going to be so much better.",
              "id": 82,
              "comments": [
                {
                  "score": 12,
                  "content": "Does a typical nanny get $300 per week and that includes cleaning and making some meals? \n\nAgree that OP should hire a professional but they were getting an amazing deal for 3 kids.",
                  "id": 83,
                  "comments": [
                    {
                      "score": 86,
                      "content": "My son is at school all day. That's on me because I said she watches my son but she really just watches him for 5 minutes before dropping him off at school for the day. The bus would pick him up but MIL and my wife insist that she drops him off. \n\nThe 3 year old goes to half day preK Tues-Thur. \n\nSo it's really more like 1.5 kids per week. I hope that helps clarify things.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "I agree it is an amazing deal. In the childcare industry, we have a saying- free childcare is never really free. This is a variation on that theme. They’re paying her (not a lot), but she isn’t acting like an employee in any way. OP can’t trust MIL, and MIL doesn’t think she needs to listen to OP and her own daughter if she doesn’t want to.",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "IS it an amazing deal, though? Factoring in poopy toothbrushes and verbal harassment?",
                      "id": 86,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Interesting that she says \"no one will care for her granddaughterslike she does.\" Aren't the problems right now stemming from her interactions with your son? Does she dislike your son?",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Do you think her lack of hygiene standards might be why your kids all keep getting diarrhea? If she's as lax preparing their food as she is cleaning up that sink it wouldn't be a surprise.",
              "id": 88,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "She’s right, no one will ever care for the kids the way she does. Thank God.\n\nI can’t think of another person who would leave poop on toothbrushes after washing a baby’s butt in the bathroom sink.\n\nYour MIL is gross.  And anyone with such little regard for sanitary standards should not be watching kids.\n\nNTA.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "She's delusional. Those people love kids so much they're willing to care for other people's kids.\n\nNope. Find childcare and stop using her \"services\"\n\nIf money is tight see if there is any resources in your area that help pay for child care.\n\nSome people have childcare out of their home you could even try one of those. At home childcare might be more inexpensive option than a traditional daycare.\n\nCut MIL out of the picture. It's better for everyone's well-being. Did your wife like her mother growing up?",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "> Trust me, I don't like MIL watching my kids as we've had issues with her in the past. \n\nSo why are you complaining that she's not doing it anymore and messing up your schedule? \n\nYou're NTA here but this ...\n\n> However, I don't like how the MIL is affecting my job and career with her pettiness as I had some important stuff scheduled today.\n\nThis is a good thing. Find new childcare. The next one surely won't put shit on your toothbrushes, so it's a win for you.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Actually they pay 150 more a month but if it's a daycare-type place it'll include food so they will end up paying less in the long run.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Agreed!!!! ☝️\n\nI bet she was actually embarrassed over the poopy sink but too proud to admit she blew it? I could see she may of had her hands full and spaced out getting back to it… just a theory. \nNTA- \nHow old is MIL? 3 littles is probably too much for her to handle. \nGood luck…. This family stuff is rough and makes things so much worse when it’s family. Sigh.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 805,
      "content": "NTA. I'd happily pay a little extra for childcare to not have to deal with that nonsense. ~~Also who washes a 5 year old in the sink? A 5 year old isn't a baby, that's a whole kindergartner.~~ You pay her to watch your kids and she leaves literal human shit all over the place? There's no excuse for that. Sounds like she went crying to her daughters to get them to gang up on you. It sucks your kid's birthday is caught up in this mess, but honestly I don't think being around them is smart right now. What's worse, not attending the party or going to the party and having a fight break out?\n\n\"Hey MIL, could you please not leave shit all over the place? Thanks.\"\n\n\"W-well, your house is dirty! You're fat and ungrateful!\"\n\nAstounding that anyone thinks you're the AH here.",
      "id": 94,
      "comments": [
        {
          "score": 503,
          "content": "To clarify: The 7 month old was the one getting their ass washed in the sink.",
          "id": 95,
          "comments": [
            {
              "score": 269,
              "content": "Oh I missed that, my bad. That certainly makes more sense, but there's still no reason there should be shit all over the place and no reason that shit should be *left there*.",
              "id": 96,
              "comments": [
                {
                  "score": 48,
                  "content": "Nah it happens... once those little ones start it literally sprays... it's not like adult poop... that stuffs vile... was once travelling to a shoot with a friend and his family... and their new borns diaper exploded on the plane... it was literally everywhere...",
                  "id": 97,
                  "comments": [
                    {
                      "score": 78,
                      "content": "OP says his MIL was cleaning up a blowout in the sink, not that the kid was actively pooping. But even if they were, MIL should have cleaned it up.",
                      "id": 98,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Apparently I traumatized my mother when I was a baby.  I was sick, and while she was changing me, I managed to paint the wall 6 feet away from me.",
                      "id": 99,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "Still. When my kid was that age, if there was any poop involved at all, we were washing them in the bathtub, not the sink, where so many more things could get contaminated. Also, if you're washing an infant gently, there shouldn't be that much splash-back. It sounds like your MIL held that baby's butt right up to the faucet and used it like a bidet.",
              "id": 100,
              "comments": [
                {
                  "score": 3,
                  "content": "That made me somehow laugh.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I was watching my nephew when he was very little and obviously not feeling the best. The absolute blow out that kid had was something of legend. Everything went into the shower. Kid, clothes, diaper, everything. It just made it easier to contain the mess.",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "It's so funny to me because it sounds like the tub was.. right.. there...",
              "id": 103,
              "comments": [
                {
                  "score": 5,
                  "content": "Physically it's quite hard on your back to lean over the bath, hold baby and wash their arse. I have back problems and there's no way I'd be able to do it, and growing up there were a lot of babies around, and nobody ever washed them leaning over the bath. It's dangerous, you can't hold them properly and don't forget they're squirming and the soap makes them slippery. I would be amazed if their grandmother could do it. \nBabies were always washed in the kitchen sink in my neighbourhood.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 580,
      "content": "Ah to actually be a Hispanic who knows exactly what this situation looks like NTA",
      "id": 105,
      "comments": [
        {
          "score": 399,
          "content": "Lmao when they started shitting on OP for being dirty I got flashbacks of my mom yelling at me that my unfolded HOODIE on my made bed was why my room was dirty 😭\n\nI had a hair out of place? I was dirty. I didn’t brush my teeth immediately when I woke up? I’m dirty. I don’t eat a vegetable from my plate? Ima get fat 🙄",
          "id": 106,
          "comments": [
            {
              "score": 133,
              "content": "I did too! The yelling, the ganging up on OP, the crux of it all. Probably not a surprise that I estranged my mother years ago.",
              "id": 107,
              "comments": [
                {
                  "score": 25,
                  "content": "Good for you. It's not an easy decision or action. \nHow much more  peaceful is your life now though??",
                  "id": 108,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Sooooo much peace although I still have PTS honestly. You?",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "This!  And some Hispanic grandmothers are not the sweet, warm cuddly ones.  I hated visiting mine or having her come visit to watch us.  \n\nI have crazy curly hair and I believe that woman enjoyed taking a fine-tooth comb to it.  After having welts on my head my dad asked her to stop.  I always got snide comments like \"cochina\" or \"descarada\".  After she cut my hair to basically a buzz cut right before school, he had enough and had my mom address her mom.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "Can relate, classic latin parents having impossible standards for their kids but can't take any criticism themselves. I'm lucky mine have grown a bit more self aware but talking to them is still like talking to a brick wall",
          "id": 111,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 352,
      "content": "God bless Reddit",
      "id": 112,
      "comments": [
        {
          "score": 413,
          "content": "> I have pictures if you guys really want to see.\n\n\nThis absolutely got me.  Never change, Reddit.",
          "id": 113,
          "comments": [
            {
              "score": 99,
              "content": "May as well download them and add them to my toothbrush poop album",
              "id": 114,
              "comments": [
                {
                  "score": 31,
                  "content": "Might as well just make a poop album so you can have the poop brush and poop knife in there together. Bless Reddit",
                  "id": 115,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Just starting the website.... Can't decide if I am going with \n\n&#x200B;\n\n[www.pooponstuff.com](https://www.pooponstuff.com) or www.poopbrush.com",
                      "id": 116,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 75,
              "content": "Lol. OP should show the pictures of the shit sink to the SILs and see if they still defend MIL. Like 'no you don't understand there was shit everywhere'. I'm giving them the benefit of the doubt and assuming maybe they didn't know the mess was literal shit everywhere. If they do know and still defend their mother then yikes.",
              "id": 117,
              "comments": [
                {
                  "score": 100,
                  "content": "Buddy, my wife is way ahead of you. That's why the pictures are on file.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 39,
                      "content": "Omg, let us know the reactions will ya?",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "This thread delivers",
          "id": 120,
          "comments": [
            {
              "score": 6,
              "content": "Yeah it's the shit.\n\n^(I'll see myself out.)",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I was gonna comment, stories like this are the real reason I’m here",
          "id": 122,
          "comments": [
            {
              "score": 4,
              "content": "Come for the stories, stay for the comments",
              "id": 123,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 298,
      "content": "NTA.   And geez - no wonder the kids had a stomach virus.   Fecal E.coli can make you deathly ill.    I think you'll be happier and healthier with the new babysitter.",
      "id": 124,
      "comments": [
        {
          "score": 156,
          "content": "This. Your MIL was quite possibly the reason everyone had diarrhea.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 119,
          "content": "Yep, this entire situation makes me wonder what she isn't cleaning up too. Poop everywhere is a pretty obvious thing that needs to be cleaned. It's visible and unquestionably disgusting. But where else is MIL's uncleanliness and lack of will to clean bleeding over into? Food prep for the kid's snacks? Cleanup and washing of hands after the 7 month old gets their diaper changed? Kids are petri dishes at the best of times, but MIL seems to want to be building her own culture.",
          "id": 126,
          "comments": [
            {
              "score": 50,
              "content": "Yeah, this exactly.   If she'd leave a visible explosion of poop all over cups and toothbrushes - what else is she leaving that is just as gross but less visible?",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "NTA. \n\nE.coli isn't the only thing you can get from feces. C. diff is a thing and I can guarantee you that your kids will be vulnerable to it if they need antibiotics and she continues to take care of them. \n\nIs it common outside of hospital or long term care settings? No. But that doesn't mean it's *never* acquired outside of the hospital. A *lot* of people have C. diff in their digestive tract naturally. It generally only becomes a problem when antibiotics kick your digestive flora out of whack. (There are other ways to get it, but that's the major cause of it.) If your MIL is not taking care of your kids' asses properly, do you really trust her to be washing her hands after she shits? \n\nI had C. diff when I was in a nursing home for rehab when I had my back fused and it is *absolutely horrible*. You think a baby blowout is bad? Imagine a massive baby blowout like 6+ times a day, but with the smell of Satan's asscrack in the middle of July. It is *not fun* and leaves you at *serious* risk of dehydration, at the very least. I cannot imagine what that would feel like for a poor child. \n\nAlso, C. diff is *highly* contagious. Everyone who came in to see me while I had it was completely covered up with protective pants, gowns, gloves, and masks -- imagine what people wear when they treat COVID patients -- and all that went into the trash when they left. So if she passes it on, it's entirely possible that your whole family could end up with it.\n\nStand your ground and *do not* let this woman take care of your children. Put them in childcare, where there are actually sanitary standards that won't put your children at risk.",
          "id": 128,
          "comments": [
            {
              "score": 3,
              "content": "I actually had c. Diff Christmas 2021 and it was *awful*. In reality I should have gone to hospital but it was Christmas Day and my family was mad as hell at me for not being there (bc of the c.diff) and I was home alone (another reason I should have gone to hospital) and the thought of going to emergency room for diarrhoea was…depressing, to say the least. It took me ages to get better, and I developed ibs afterwards. I was so dehydrated and weak. It was fucked.",
              "id": 129,
              "comments": [
                {
                  "score": 2,
                  "content": "It really is! And if you get it once, you're at higher risk of getting it again, which is always something nice to know. /s",
                  "id": 130,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 186,
      "content": "You should cancel the party because your family is sick. Jesus wept we will never get out of pandemic conditions when people refuse to follow basic health guidelines.",
      "id": 131,
      "comments": [
        {
          "score": 19,
          "content": "omfg one time when i was younger we went to my little cousin's birthday when her brother was sick (he had thrown up that morning but their parents didn't do anything and said they thought it was just bc he was hungry???) he ended up throwing up again mid party and then almost everyone that was there ended up with the worst stomach bug ever it was horrible",
          "id": 132,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 166,
      "content": "NTA ... the sisters in laws made it a big deal. Per your post, you have had issues in the past with her watching your children.  I agree with canceling the party at her house, BUT, I would host the party at your own home. BtW, put your kids in daycare, they're much more sanitary. Good luck.",
      "id": 133,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 151,
      "content": ">so my mother-in-law washed her butt in our bathroom sink\n\nWho, what?",
      "id": 134,
      "comments": [
        {
          "score": 138,
          "content": "I thought OP meant the MIL washed her own butt at first and was like \"damn, grandma's flexible\"",
          "id": 135,
          "comments": [
            {
              "score": 17,
              "content": "😂🤣😂🤣",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 39,
          "content": "The baby is 7 months old lol",
          "id": 137,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 22,
          "content": "I was confused w that as well, when my nephew had poop blow outs I used baby wipes and let his mom know because she’d just bathe him idk how this MIL did it without doing a whole bath",
          "id": 138,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 141,
      "content": "NTA. \n\nAll you defending the MIL, I hope you never care for a sick child. And if you get sick yourselves and can’t wash yourself, good luck. \n\nThe children aren’t being punished. If anything I am glad op isn’t exposing the kids to a woman who can’t do bare minimum when it comes to watching kids: providing a safe and clean environment. ‘Kids are gross and dirty!’ Yeah but they can’t clean themselves up so it’s up to the adult to provide care. \n\nOP stated they will let their son decide what to do for their birthday and honestly that sounds like a pretty darn good option. \n\nOP good on you for not letting your MIL in, if she treats your wife, her literal daughter, like crap, I can’t imagine how she might treat your kids as they’re older and make her mad.",
      "id": 139,
      "comments": [
        {
          "score": 14,
          "content": "This! Best one I've seen. I agree all the ESH and YTA are not valid because of what OP has said in the comments.\n\nI think removing the problem is a wise choice as a parent. The problem is the wife's side of the family. It's just an unfortunate circumstance.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}