{
  "post content": "Update: we talked it out and we were both speaking off of impulse. We're all good and I appreciate all the advice and kind words. \n\n***READ THE POST BEFORE YELLING AT ME IT ISN'T ABOUT THE BIRTH IT'S ABOUT THE LACK OF COMMUNICATION I'M EXCITED ABOUT MY NEPHEW SO PLEASE READ BEFORE JUDGING***\n\nTomorrow I graduate from high school. I dropped out due to severe mental health issues a few years ago. This is a big thing for me. \nMy brother is my best friend and I really wanted him to be there. \nI called him today to ask where to drop off his ticket and he informs me that he's at the hospital so of course I ask him why and he says his son may be here within the next couple days. I'm happy my nephew is on his way and I'll get to meet him but, I was extremely upset.\nHe didn't warn me until literally two hours ago.. I was so excited to show him how hard I worked. t\nHe didn't even have the courtesy to warn me at least 24 hours in advance. I told him how upset I was that he didn't use his words and say \"hey, I don't think I'll be able to make it.\" Was I supposed to stand up and look out at the audience and be shocked to see he wasn't there?\nHe didn't understand where my hurt came from. I'm so excited to have another nephew! It isn't about where he is.. To me it was the lack of communication. This blindsided the fuck out of me.\n\nI'm not sure if I'm being an ass hole... What do you guys think?...",
  "id": 1,
  "comments": [
    {
      "score": 9,
      "content": "NAH - his partner  is in labor - It probably slipped his mind. He may not even be able to use his phone in the room or certain areas of the hospital. Of course you can be sad he won’t be making it as well ",
      "id": 2,
      "comments": [
        {
          "score": 2,
          "content": "Yeah maybe you're right it's easy to forget things in the heat of the moment!",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "NAH. Of course you want him to be there but his son being in the hospital is probably pretty serious. In times like this certain things take priority and he may have just been so stressed/busy that he didn’t think to call you to let you know. ",
      "id": 4,
      "comments": [
        {
          "score": 1,
          "content": "The birth of his son is so so important to all of this! We're all so excited and ready for him! (His son isn't in the hospital I meant as in this child is coming into the world)",
          "id": 5,
          "comments": [
            {
              "score": 1,
              "content": "Oops my bad! Didn’t read that bit right. Congrats to him! ",
              "id": 6,
              "comments": [
                {
                  "score": 1,
                  "content": "I'll let him know you congratulated him! :,)",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NAH. It sucks, but honestly his child is way more important in his life than your graduation",
      "id": 8,
      "comments": [
        {
          "score": 3,
          "content": "I agree",
          "id": 9,
          "comments": [
            {
              "score": 2,
              "content": "Try not to take it personally, he loves you.",
              "id": 10,
              "comments": [
                {
                  "score": 3,
                  "content": "It's easy to forget those things when heads bump. Sometimes we need to be reminded by others that things aren't as shitty as they seem. :,) \nThank you for this.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 0,
                      "content": "You're good, enjoy your accomplishments 💗",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "YTA. His fucking CHILD is being born. That trumps everything else. Sucks he didnt communicate but hes having a BABY. Kinda hard to give warning with these things sometimes too, labor cannot always be controlled or predicted. Some are in labor for days, others for only mere hours before giving birth. ",
      "id": 13,
      "comments": [
        {
          "score": 0,
          "content": "I mean once again you're completely entitled to this opinion although I do not agree. 🤷🏾‍♀️",
          "id": 14,
          "comments": [
            {
              "score": 1,
              "content": "I'm curious, why? I get being upset he couldn't be there and that he didn't say anything, but what if you were in his position? Do you really think you would have remembered or do you think youd be more focused on the baby?",
              "id": 15,
              "comments": [
                {
                  "score": 1,
                  "content": "I'd remember because we both worked towards this together and both knew our graduations were important.\nI definitely would have remembered. If it were some dumb shit like \"YOU FORGOT WE WERE MEETING FOR DINNER\" so SO unimportant \nBut this was important to me. After conversing we both agree that both of us needed to be more vocal and considerate.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Well that's good you agree. I still think you've got too high of expectations for someone who was in the middle of having a kid but whatever 🤷‍♀️",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***This is a copy of the above post. It is a record of the post as originally written, in case the post is deleted or edited.***\n\nTomorrow I graduate from high school. I dropped out due to severe mental health issues a few years ago. This is a big thing for me. \nMy brother is my best friend and I really wanted him to be there. \nI called him today to ask where to drop off his ticket and he informs me that he's at the hospital so of course I ask him why and he says his son may be here within the next couple days. I'm happy my nephew is on his way and I'll get to meet him but, I was extremely upset.\nHe didn't warn me until literally two hours ago.. Not even 24 hours in advance. I told him how upset I was that he didn't use his words and say \"hey, I don't think I'll be able to make it.\" Was I supposed to stand up and look out at the audience and be shocked to see he wasn't there?\n\nI'm not sure if I'm being an ass hole... What do you guys think?...\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 18,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "#[State of the Subreddit](https://www.reddit.com/r/AmItheAsshole/comments/ahr1xg/state_of_the_subreddit/)\n\nIf you want your comment to count toward judgment, put one of the following abbreviations at the beginning of your comment. Include ONLY ONE of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 19,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 0,
      "content": "NAH - I think you have the right to be upset, the lack of communication would be upsetting to anyone when they're looking forward to something and find out last minute that it isnt happening. \nI think your brother should have mentioned something to you, but I do also understand if it slipped his mind due to the craziness of his new baby coming. I think you have the right to be upset, but try not to be too hard on him. His intentions weren't bad ",
      "id": 20,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": -1,
      "content": "I just didn't want to be an ass hole and feel better knowing we were both valid and neither of us were ass holes and just siblings that piss each other off thanks for making me see this in a brighter way",
      "id": 21,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": -2,
      "content": "YTA. It's not like he gets to pick the exact date and time his son is born. You keep whining about the \"lack of communication,\" but the birth of one's child is a *big* deal. If his partner suddenly had to go into the hospital for something related to the pregnancy/labor, that's where his mind is at. He is very distracted by things that are, frankly, more important. So it's reasonable that he might forget about something like a graduation going on or to call you about it. ",
      "id": 22,
      "comments": [
        {
          "score": 0,
          "content": "Eh, I wanted him to be there, you'd want your brother to be at your graduation as well.\nYou're entitled to this opinion as I asked for it.",
          "id": 23,
          "comments": [
            {
              "score": 1,
              "content": "Things come up. Life happens. People can't always make it just because you \"really wanted them to.\" It's rude and petty hold that against them when it's nothing personal. If your brother loves and supports you, and has supported you all along, that's what really matters.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 0,
          "content": "Yeah but seriously, have you ever had a kid? As a father and eldest brother, I bet you anything he had plenty of time to shoot him a text saying \"hey dude my lady is ha ing the baby!\".  I know I had the time inbetween when I wasnt able to be in the room or went to the bathroom. Texts will shoot at soon you hit enough signal whether written in no signal or not, and we had a premy birth so nobody saw it coming days and days in advance either. Dont be a dick to this guy just because you saw the the keyword \"birth\". Smh. Acting like hes ignoring the fact of the birth is just stupid and shallow. If it was his sister, totally different story. But his brother isnt pushing a baby out of his dickhole. Jesus christ. By all means it could have slipped his mind and that's understandable and all but buddy here isnt an asshole for feeling the way he does about not being told a thing.",
          "id": 25,
          "comments": [
            {
              "score": 0,
              "content": "[deleted]",
              "id": 26,
              "comments": [
                {
                  "score": 1,
                  "content": "No people usually DO get announcements as its happening, such as when they reach the hospital.  Like I need some background on you to understand how tf you think a little brothers graduation is next to meaningless. My little brothers I practically assisted raising, one shot himself before he could graduate, and the younger one moved out of state and graduated, much to far for me to make it. The birth of my son was extremely important, more important than graduations. Certainly. I couldn't attend, no. But if I knew graduation was coming, the very second I caught a moment of respite I would let them know \"hey dude your nephew is gonna be born soon, if you can make it that would be amazing but il you're graduating soon, you did good kid\". Like do you know anything about how babies come into this world? Most of the time, the baby is not coming out of the lady as soon as she hits the hospital doors. Becoming a father is a big thing, but so is a siblings graduation. They obviously have a close enough relationship for his brother to be upset that his brother didnt let him know. \n\n\nUnless they were premature like my kid, his brother had a rough idea of when to expect the baby. Hes not ignoring the birth, you just want that to be the case. He made very clear distinctions that he was excited over his nephew being born, and that it would have been kinda nice to get a heads up like, \"my lady is getting really close, they say she could have the baby any day now, we might be in the hospital sometime this week.\". \n\n\nWhich as a father, lemme tell you, that's not asking much. In fact, that's just common courtesy. I knew when my friends and their gfs/wives were expecting and especially when they were in the hospital, because it's big news. That's the kind of stuff the entire family gets told about beforehand unless there are deeper family issues making big bro not want his mom, dad, or siblings involved. But I doubt thats the case. \n\nAnd announcements usually come *after* the birth? Are you high? Have you EVER had a kid? Have you never even seen a movie where a birth takes place? Majority of the time, the couples parents are almost always there, and as much as they can be. My parents took off work and were there from before birth, all the way until we got out of there, and younger siblings alot of the time accompany their parents to visit and be there for their older siblings and their new nieces and nephews. At least as much as can be without disturbing their responsibilities to school or what have you. \n\nAnd hes obviously conflicted, not passive aggressive. Maybe that's a bit too complex for you to understand, but people can be disappointed in, and be happy for someone at the same time. He clearly just wanted to be involved in his brothers life, which there is nothing wrong with, and clearly wanted his brother likewise involved with his own life, he never once implied he was upset because his brother is having a kid instead of being at graduation like your trying to paint it out.\n\n\nIts clear as day and there is absolutely no debate to this whatsoever, he was upset that he was totally in the dark about his brothers ongoings and had to find out by trying to get up with him about his own big day which obviously was majorly shitty in two ways. \n\nHe didnt tell him the baby could be there any day now and to not be surprised if he could not make it(that's called caring about other people outside of yourself, the birth of a loved family member's child is important to everyone, not just the parents). AND he treated his little brother like a common friend. Not like family. Not like a little brother who loves him. \"Oh I'm in the hospital\" followed by \"any day now the baby could be born\".\n\nYou seriously cant tell me you're that ignorant to this situation. \"Any day now the baby will be born\". Meaning hes sitting in a fucking hospital room or even waiting room depending on the policies, while they talk with doctors and share the news with all the family of both parents. Unless his little brother just had the most unlucky timing int he world in talking to big bro and caught him in the first hour or two that they were there, he had plenty of time to say something. \n\n\nEven if it wasnt to OP and he instead told someone more important for the situation such as their mom or dad, they in turn would have told OP that his niece/nephew was gonna be born soon. Which solves the communication dilemma. \n\nOP has no right to be furious or hold it against him, which he certainly doesnt seem to be. But he has every right to be like, \"hey man wtf that's not cool, you cant tell me anything? I had big stuff going on that you knew about, how come I couldn't get a word about big stuff going on with you? I thought we were closer than that.\". \n\nMy little brothers knew when my son was being born. I had enough going on that I don't remember if they were in the waiting room when my son was born, but before shit started going down, yeah, they were there. They knew about it and were there before he came into this world, and they were there after he was born. My little brothers were in very similar situation as OP,  just a year or two younger. My sons birthday is may 30th. Meaning, close to when school lets out, aka they had important school shit going on.\n\n\nIf you think his brother is not at fault for putting his brother in a position like this, there's something wrong with you. Sure, his graduation isnt as big a deal as a birth, and he WAS upset his brother couldn't be there, but its plain as day that what was more important to OP was being left out and forgotten. His brother simply didnt make any effort to make sure his little brother was up to speed, and going to make it for his childs birth. And unless the circumstances were anomalous, he had all the opportunity anyone could need to make sure his lil brother knew the big day was coming. \n\nI think this is more about you being right about being a condescending prick than it is about whether or not OP is actually in the wrong for the way he feels. He even stated in BOLD letters in the beginning that it was about communication. \n\n\nIts utterly apparent that his mention of his graduation in the context of this post was to give insight to the situation and to give us a bit of depth on both his issues that are well known by the family and especially big bro, and to provide contrast, \"fuck this really important to me and I went up and down to involve my beloved brother, yet with his big day, which is a much greater deal, he didnt even bother to text me. I had to text him, and  even then had to further inquire to get a respectable answer.\" ",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}