{
  "post content": "I got pregnant in college when I was 19. Her father was in the same position. Prior to doing the deed, I told him if anything were to happen I would not be getting an abortion. He said he understood. \n\nWhen I got pregnant, he refused any contact with my baby or responsibility. He took things further by telling my friends and his family that I planned the pregnancy to trap him, so they wouldn’t judge his actions. This was untrue. He paid mandatory child support but it wasn’t much. \n\nIt was hard but I love my daughter and wouldn’t change a thing. She’s wonderful and smart and she’s my whole world. \n\nHe reached out to me on Facebook saying he wants to be in his daughters life. He’s married now. I did some stalking online, his wife has frequently posted about her infertility struggle. \n\nI was against it because he’s had no part of her life. It was me who had to drop out of college, work 2 jobs, endure the sleepless nights as a baby and raise her. It was me that kept her belly full and kept her warm. He didn’t give a shit. It was me that endured my friends turning against me and his family’s harassment. And the judgment of society for being a young mom. And now that he wouldn’t be sacrificing his young years, now he’s finished partying, now he’s got his degree and job, and his wife can’t give him kids to complete his picket fence life, he wants the kid I raised for him? Knowing he doesn’t really have to do any work other than pick her up now and then. \n\nI told him my thoughts, and he got mad saying that I chose to have the baby not him, which tipped things over for me. I asked him to prove he thought about her, eg a college fund he’s paid into for a while with her in mind or car money. He did not, which again proved to me he only gave a shit when he couldn’t make more kids. \n\nI spoke to my daughter but I told her the type of person her father is. I told her he has nothing for her, and I was honest about the fact his wife is infertile so he is reaching out. I told her everything and reiterated basically everything I said in the post. \n\nI told her to think about it, I said I’d support her knowing him, but I affirmed he is not a nice person and his intentions are not where we would want. She chose to not know him. \n\nAfter I informed him he got mad. He said I ruined his chance to know her, that I’m denying her a father, I told him he was the one that did that. \n\nMy mother told me I shouldn’t have poisoned his image to her, that she probably feels rejected all over again and she’s probably hurting. I now feel like I have done wrong by her. AITA?\n\nEdit: she is 16 now\n\nEdit 2: if it wasn’t for the infertile wife, and lack of college fund or car money (showing evidence he had at least thought about her) then I probably wouldn’t have said anything to her about what he is like. But to me those were red flags\n\nEDIT 3: FAQ\n\nhe never told me he didn’t want kids, he didn’t tell me he wouldn’t stick around for the kid when I told him I wouldn’t abort before anything. \n\nDespite this I’m NOT MAD HE LEFT. I am mad he returned  for the WRONG REASONS which could be harmful to my daughter. \n\nI am not answering questions on how I got pregnant as this is not relevant. The amount of people I’ve had comment “well were you on birth control?” and the lack of “well did he wrap it up?”  If you’re trying to find out if I poked holes or lied about taking the pill, I did not. If you’re about to accuse of having unprotected sex, again, I did not. \n\nDo not ask why I didn’t abort my daughter or refer to her as a consequence. This is rude and you know it. My choice to have my daughter was my choice alone and not his fault, therefor not relevant",
  "id": 1,
  "comments": [
    {
      "score": 23313,
      "content": "NTA you are protecting your daughter from a potentially traumatizing and harmful situation. It is one thing for him to give up parental rights and for it to remain that way, but what he is doing is treating her like she is some sort of trend of the month. What is going to happen when he realizes she is a complex, multilayered human with a lot of thoughts and feelings and likely a lot of negative feelings towards him?\n\nI wouldn't trust him with properly taking care of an animal, let alone a child.",
      "id": 2,
      "comments": [
        {
          "score": 9124,
          "content": "Couldn't have put it better myself.\n\n\nAnd to OP, if she sees this:\n\nAs a guy who was raised by a single mother and with a deadbeat \"father\" (that we usually refer to as \"The Sperm Donor\") who was never around: keep up the good work. It's hard enough being a parent, let alone in that kind of situation. \n\nI would say one thing though... try not to let your feelings about him cloud your judgement too much. I never knew my SD, I only ever had what my mum told me, and she never hid the fact that she didn't want me to have anything to do with him. I didn't get the chance to form my own opinion of the man, and for all I know he was mildly decent. And there is a (small) part of me that wishes I could have met him before he died, if only to see for myself who he was. And that part of me will never forgive my mum for denying me that.\n\nYour daughter may never get to that point. But for her sake, and the sake of your relationship with her, don't stand in the way if she changes her mind and wants to get to know him. Yes, he may break her heart, but at least she can find out for herself.",
          "id": 3,
          "comments": [
            {
              "score": 3049,
              "content": "I mean, can you callously abandon your child and claim to be even mildly decent?",
              "id": 4,
              "comments": [
                {
                  "score": 671,
                  "content": "People can change. But even if they don't, OP was denied the opportunity to find out for themselves.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1680,
                      "content": "People can change yes, but I think the reason that OP did not believe her ex could change was due to the lack of evidence that he actually cared about his daughter now.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 659,
                      "content": "At 16 the daughter is old enough to make her own informed decisions about what adults she wants in her life. As long as OP is honest about supporting either decision, then the daughter hasn't been denied anything, she's just been given relevant information to make her own decision.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 323,
                      "content": "But is it worth causing the daughter all the pain that could come from this? She’s 16 now, and he hasn’t shown he cared for the whole 16 years of her life. The only reason he seems to care suddenly is that his wife can’t give him children.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 141,
                      "content": "I'd say that him not caring about his child until him and his wife started to struggle to have their own kinda says everything that needs to be said though.\n\nYou don't have to meet with someone to come to a conclusion about the kind og person they are, and if you want them in your life.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 89,
                      "content": "Doesn't sound like he's changed.  He falsely accaused her of \"trapping\" him,  and that's not forgivable.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 61,
                      "content": "There is no change. This man deliberately lied to say she trapped him knowing what they agreed to. His intent to abandon her from the beginning. Not to mention, his family harassed her while she had to endure many struggles with no to little support. He claims to care but made no efforts in the past before now to say he wants to see her only because his wife can’t make babies.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yes, people *can* change but usually don't...",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Then he can prove he has changed over time. Like, say, writing her letters. Starting a fund for her college expenses. Apologizing, publicly,  for trying to turn everyone against her mother.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "His change was his current wife not being able to give him kids. he didn’t have a sudden change in heart. he didn’t apologize for abandoning op and her child. he didn’t even have any proof he thought of her or this child until this moment he reached out to her",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Has OP's ex made any amends? Has he reached out to the friends and family members he slandered OP to and set the record straight? Has he done anything to make amends to his daughter for being completely absent for 16 years? (No, \"I'm ready now that you've done the bulk of the work and she's going to be a legal adult soon\" isn't showing him making amends.)",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 120,
                  "content": "It would ve one thing if he had just gave up rights and paid child support I get not wanting to be a parent. When he lied about it like he did and clearly didnt give a shit about his kid for 16 years until he needed a spot filler the decency ship has sailed",
                  "id": 16,
                  "comments": [
                    {
                      "score": 53,
                      "content": "They talked about it,  agreed,  and then he slandered her first years.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Not sure I can really answer that without sounding like I'm making excuses for the people out there that do abandon kids.\n\nAnd making excuses for people like that is not something I could allow myself to do",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "I wish we still had free awards to give out, because this right here is tremendous. Even if you're poor, not a pot to piss in or a window to throw it out of, there are parents who still at MINIMUM make sure their kids know who their families are, know they have someone they can trust & rely on, and know that they are *safe*, and *loved*. Walking away from that may not be damnable, but it sure ain't decency, especially if you want to stroll back in to a ready made family after refusing be any part of building that family for a decade & a half.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Yeah actually.  My sperm donor left my mother and I when I was four. He never said why, he just went off and started a whole new family.  Then he showed up about 40 years later.  He gave what seemed to be a heart felt apology.  I told him he would never be referred to as dad, father, or pops. Anything indicating being my father, he hadn't earned the right. I told him anytime I referred to my dad ,I was referring to the man my mom had met and who had raised me as his own. He even adopted me in my teenage years giving me his name. Sperm donor said he understood.  He ended up moving into my city. Overtime we actually developed a friendship as grown men, not as father and son, but as two grown men. He is a pretty nice guy, he was just never good father material.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "People don’t change. Their priorities change. She was never a priority to him when it was inconvenient and undesirable to be a father. When his wife can’t have kids, and now he thinks he wants to be a father, he thinks he can pull his 16 year old daughter that he doesn’t know from Adam out of his back pocket like an ace in the hole? No fucking way.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "My own bio dad dumped my mom when she was pregnant with me and never looked back. He has four kids he acknowledged and raised and enjoys a very respectable image in his community. You would think he was Mr. Rogers by his online profile. His whole extended family forgave him immediately when they found out about me and I remain a secret to the public to this day, years later. \n\nPeople are different things to different people and some people are champs at compartmentalizing. And also saving their indecent behavior for people who matter less socially.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I’m sorry that happened to you and your Mom. Assuming this was in America, he wouldn’t happen to be a proud Republican and “good Christian” would he?",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 471,
              "content": "Decent men don't abandon their children.",
              "id": 24,
              "comments": [
                {
                  "score": 142,
                  "content": "totally this. I lived with my ex for 7 years, helped him fight for and win custody of his 2 daughters. We went on and had a son together, when my son was 5 he had an affair with a co-worker and left us taking his girls with him.  In the last 25 years he's barely seen his son. As the years went on he only paid child support for about 12 months then it stopped. He also moved further and further away from us and we had no contact from him not even a birthday card. He now lives about 5 minutes away from us and although we have contact with his sisters my son still doesn't have or even want contact with his dad. \n\nI watched him fight hard for his daughters so I can't understand how he could walk out and eventually totally ignore his son.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 117,
                      "content": "Did you do all the work for the custody battle of the two girls? I'm guessing you did.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 226,
              "content": "I know a fuck ton of people in your position who wished their mothers told them the truth about their fathers so they didn't have to experience for themselves. They wished their mothers were more honest with them. I land in this category too. Grass is always greener on the other side, huh?",
              "id": 27,
              "comments": [
                {
                  "score": 154,
                  "content": "Thank you, mom was damed if she did, damed if she didn’t. The only one who prevented daughter of forming her own opinion of her bio dad was HIM. He wasn’t ever around for her to form an opinion about. So he gets to deal with the fact that her MOM’s is the only perspective she’s had up until now and he’s not looking good to me either.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 34,
                      "content": ">The only one who prevented daughter of forming her own opinion of her bio dad was HIM.\n\nThis! Its non moms fault the truth is what it is. It's Dads fault he wasn't around.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "Right but the poor moms were just trying not to say anything bad about the fathers because then they say your putting them against me and alienating them.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 54,
                      "content": "I agree but it'll happen anyway! \n\nThat was something I always absolutely loathed about my father and his family. The nerve of him and his family to say that there was any form of parental alienation when all she ever did was talk about the man she fell in love with before his demons caught up to him. And that's how she explained him to us when we wondered why he was so angry. She would tell us, \"he loves you, I promise. It's not okay for him to do that, and you can never show love that way because it's unacceptable. But also, he is a human. With past trauma and demons, and none of that is YOUR fault.\"\n\nShe did so well trying to balance us having him and his family, while trying to make sure he didn't do us any harm. She was as open and honest and really didn't lie about who he was. She just kept some things secret for longer (like how he was also a cheater).\n\nThere is no winning in some situations.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "It's hard to know the right choice as a parent. I kinda of did/am doing a mix of this with my kids (10, 12 & almost 14).  I don't keep them from their dad but I am honest with them about his traits and how that may negatively impact them. He never showed much interest after I was done with the relationship about 5 months after my youngest was born.  I can count on one hand the number of visits (a few hours max) thay have had with him since. Last year he texted me out of the blue asking if he could come \"see them.\" I resisted the urge to ask what his plan was for long term and just said yes. He showed up late with nothing in particular planned. Only my middle child wanted to stay with him overnight at his hotel (we live in different states). He took them to Dave and Busters and we planned a lunch for the next day except he left without telling them the next day as we waited for him to go to lunch( kids wanted an outing with both parents which is understandable and that we both agreed on). Maybe 6 hrs of them wondering (me knowing he is an inconsiderate asshole) where he was or if something happened to him. I had called him twice with no answer. I took them to lunch anyway and my younger two broke down crying at the table (I asked if they wanted to leave and they said no).  We went home and he finally called my middle son, not me, and said he had to leave because he found out I had filed for child support (after YEARS of him not contributing ANYTHING).  Queue me going off on him and my kids going of on him. I wish they had not had to feel what they felt that day.  But I also didn't want to keep him anyway just on the slim chance he actually matured some. It fucking sucks. But they now know that he can't be depended on and I didn't have to say anything bad about him for them to see that.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Unfortunately, my mom did something similar. She would allow him to come into our lives when he was around in hopes he had changed, but he never did. I think she knew he wouldn't, but she kept hoping one day. She just wanted the man she fell in love with back. She wanted her children to have a father.\n\nBut his reappearing and disappearing act did such a number on me and my brother. We have both abandonment and trust issues. I'm sorry you're going through something so difficult and I hope your kids get therapy through life. I only wish I had started sooner. At 13 he said she only sends us to him when she doesn't want us around. After she heard that she said we never have to go back if we don't want to. She stopped advocating for a relationship at that point.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 117,
              "content": "[deleted]",
              "id": 34,
              "comments": [
                {
                  "score": 35,
                  "content": "The tipoff was that he has no interest in hockey, right?",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "As someone who was in the same boat, I agree. I however, DID get the chance to contact my father. And it taught me that 1, he wasn’t any better than what my mom said, 2, he had at least 5 other kids he didn’t do much for, and 3, anything he could offer was too little too late. My mom had raised me, I’d already cried all my tears for not having a dad, and was an adult just trying to live my life at that point. But I’m grateful I got to learn all that for myself and make the choice not to contact him any more.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "lol i call mine the Sperm Donor too! i was lucky enough my mom found a man who actually took me on and raised me (even adopted me!) but she was always clear about who SD was and left the choice up to me. she never really talked bad about him so much as was open about why he was never around. she did also wait until i was older and able to understand like OP seems she has, so i’m completely on board with it, especially if the SD is willing to bypass mom and reach out directly to daughter himself. i gave my SD chances and found out for myself if i’d continue to try and have a relationship (spoiler alert he ruined it for himself) going with NTA just to give her daughter a heads up again especially if there’s a chance he’ll try to contact her directly",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "TBH \"I've changed\" is weak bullshit. He can prove it. He lied about her and trashed her to their friends, leaving her shunned and isolated. He can go to each and every person he spread that story to and own up that he lied, and that she never babytrapped him.\n\nAnd I'm not here for the \"I wasn't ready\" because I'm sure OP wasn't ready either, and she is the one who had to deal with the physical ramifications of a pregnancy. He didn't want to be a parent, he paid child support and noped out. Fine. He doesn't get to decide that now he's changed and so everyone must drop everything and give him a tongue bath for doing less than the bare minimum.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 817,
          "content": "NTA\n\nThe other problem is that infertile doesn't mean sterile. How quickly would OP's daughter get dropped if they managed to have a miracle baby?",
          "id": 39,
          "comments": [
            {
              "score": 342,
              "content": "Ah come on now she could babysit!",
              "id": 40,
              "comments": [
                {
                  "score": 87,
                  "content": "We might eventually see posts titled like \"AITA for refusing to call sperm donor's wife mom?\" and \"AITA for refusing to babysit for sperm donor and his wife?\"",
                  "id": 41,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "😆😆😆",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 76,
              "content": "exactly. my guess would be very quickly",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 442,
          "content": "I agree that she's not an asshole here. And I also agree that it's telling that he suddenly wants to know her because he now wants a child and it's not happening with his wife.\n\nI'd be more sympathetic to him if it weren't for the accusations of baby trapping. If he really didn't want a kid at the time, but paid child support, etc, and then _later_ changed his mind, it would be one thing.\n\nBut the context here is critical. He _did_ change his mind at some point in the last few years, but the result of that change of heart _wasn't_ to reach out to the child _he already had_, it was to try to have a new child, and he only decided to seek out his existing child when that wasn't working.\n\nHe doesn't want to know his daughter _because_ she is his daughter; he's doing so because he wants a child and can't have one with his wife, and so wants contact so that he can slot her in to satisfy that desire.\n\nThe philosopher Kant said that human beings should be treated as an end in themselves and not as a means to something else. This guy is violating that principle.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 352,
          "content": "All this. NTA. Also, infertile does not mean sterile. His wife likely has a LOW chance of getting pregnant, but there is still a possibility. And you can bet the bank that if they DID conceive a child of their own, your daughter will be tossed away again. Save her from that unnecessary heartache.",
          "id": 45,
          "comments": [
            {
              "score": 63,
              "content": "I was thinking this too. If they can do IVF there is still a chance she will get pregnant and I could definitely see them tossing the daughter aside as soon as they were able to have their own baby.",
              "id": 46,
              "comments": [
                {
                  "score": 9,
                  "content": "Right also are we sure the wife is infertile or is it him?",
                  "id": 47,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Considering he already has a child, it’s probably her.",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Or, she'd become their babysitter.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Happy cake day.",
              "id": 50,
              "comments": [
                {
                  "score": 3,
                  "content": "Thank you!",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 253,
          "content": "[removed]",
          "id": 52,
          "comments": [
            {
              "score": 68,
              "content": "Like, I agree with you, but it’s really obnoxious to make your text huge and bold. If everyone started doing that this site would be unreadable.",
              "id": 53,
              "comments": [
                {
                  "score": 10,
                  "content": "They be wanting them upvotes really, really badly",
                  "id": 54,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "I don't disagree agree. And perhaps they don't know and it's good information. I just wanted to jump on and say there's this old lady on Facebook. Someone told her that once trying to be helpful. She said she did that because she couldn't see the lower case numbers. It suddenly became tolerable FB wide. Just a little ditty. 😅",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Stolen comment",
              "id": 56,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 250,
          "content": "In a very similar situation, I let my kid's father get to know him. He met him the first time at 8yo and he'd never paid a dime before this and barely anything since. He was in his life for about 2 years and we started doing weekend visits. After about 6 months he demanded my son give up everything on his weekends. No more football, no friend or family birthday parties, nothing. I let my son choose and he chose not to give up his football etc.  His father hasn't seen him one single time since. Not once!!! NTA ...good on you mum! \n\nPS: the team won the grand final, they got to do a legends lap at a professional finals football game...it was epic. And my son is awesome so entirely his dad's loss.",
          "id": 57,
          "comments": [
            {
              "score": 37,
              "content": "Why did he want him to give up everything on weekends? Just so he wouldn't have to take him, or what?",
              "id": 58,
              "comments": [
                {
                  "score": 66,
                  "content": "He said having football every Sunday morning (through winter) was a problem if they were planning stuff, ditto any parties etc.\n\nI offered to pick him up for football and drop him wherever they were after and the same for anything that came up. To be fair my son had only been unavailable one night for a family birthday, my father's 80th birthday celebration. I would have been OK with him not coming to his 79th but it was special, and his last birthday before he passed away. But he said no. If my son wasn't coming from Friday night (his daughter had netball every Fri night all year and she wasn't made to drop it on his weekends btw) to drop off Sunday he wasn't welcome.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 53,
                      "content": "Difficulty planning things because kids have activities is called \"parenting\".",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "That sucks. I remember it being really hard on my friends when they got older and wanted to do friend stuff on the weekend, not hang out with their dads. Kids should be able to have activities, parties, and friend time. It’s not their fault their parents aren’t together. I feel bad that your son’s dad put him in that situation.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Is it that dad who said his sons sports demanded too much of his time?",
              "id": 62,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 169,
          "content": "I'm in this same situation. My mom and dad divorced early (I was like 4 at the time). When I was 17 (just turned 18 quite recently) he started messaging my family. He even called up my grandma and I hung up that phone quickly and blocked him. My grandma didn't know how to block him. My mom also had to tell her for him to not contact me or her. He was supposed to see me when I was visiting my sister a couple of years ago and for one of my birthdays and NEVER showed up. \n\nHe thinks my mom is keeping me away from him and says hypocritical things about her and my older sister. I want nothing to do with him. I am old enough to make that decision. He is a waste of space. A sperm donor at this point. He even said how he has \"packages\" (like presents) for me and my older sister. Yet he probably doesn't know much about me unless he asked my family about it. \n\nEven then, it's a waste of my time and a waste of many other children's time with people like this. Don't have kids if you can't step up and be in their lives (in certain situations, this doesn't apply).",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 157,
          "content": "100% agree with this. Slightly different situation with my dad. He got my mother pregnant in 1965 when she was in tenth grade. We live in Alabama so they pretty much had to get married, but he basically left her at home for days at a time with no food or money and was still seeing other girls the whole time. After they divorced in the 70s (three children later) he still wasn't much interested in the three of us). \n\n&#x200B;\n\nOnce we got older, my brother reached out to him  while going to college, asking for a little financial help with textbooks, and received screaming obscenities in return. Well, brother is an aerospace engineer now and making six figures. Now my father wants to be all buddy buddy with him. My brother ain't buying it. My father has never met my brother's children and never will.\n\nMy sister decided to give my father another chance after my mother died. Her children were very close to my mother and they were devastated by her unexpected death (she was only 53). He was very gung ho about spending time with them, but that lasted about 3 months before he got bored and stopped calling them or coming by. They were 5 and 10 years old, so that was fun for her trying to explain why their grandfather didn't come to see them.\n\n&#x200B;\n\nShe did the right thing. NTA.",
          "id": 64,
          "comments": [
            {
              "score": 19,
              "content": "Similar to my best friend from high school. Four kids, all late teens/young adults. Dad randomly left basically overnight after selling the house they lived in without anyone knowing (!). Fucked off to another country with some girl who was 40 years his junior. Also found out he’d been married twice before and has a few other kids no one (including his current wife of 20 years) knew about.\n\nYears of legal drama ensued. During that time, my friend went to uni and because her parents were not divorced yet and he had had a reasonable income, she wasn’t eligible for scholarships. She basically survived on scraps, taking every damn job she could find. A couple years in, she wrote her dad a letter to ask for a little bit of support, 100$ a month would make a huge difference etc. He responded with a 4-page letter as to why he won’t give her anything. Motherfucker. Note that in my country you are obliged by law to support your children up to a certain age, so she could’ve even sued him, but opted not to.\n\nFast forward 15 years later: all children are exceptionally smart and pretty much all of them managed to graduate with a gazillion degrees, PhDs and whatnot, and went on to get decent jobs. None are rich and they’re all very humble anyway, but certainly make a good living. Dad is pretty old now and suddenly wants to be in touch with his kids, plus asks for money, and is surprised if neither has any interest to even see him, much less give him money. \n\nI guess that’s called karma.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": "Personally, I got the feeling that he wants to take the daughter away and jam her into his family. I'd be more worried that he'd try to replace OP as parent with him and his wife, that he'd try to poison the kid away from their mum",
          "id": 66,
          "comments": [
            {
              "score": 6,
              "content": "I had to deal with a few rando short-termed GFs of my xH who would think he was such a wonderful dad and gushed about \"his\" so well-behaved young boy, F.  \nThey envisioned F as the son they had never had, pictured themselves as his new mother and then would try to \"befriend\" F behind his dad's back... only to suddenly realize the young boy had a very present and very fierce mom who liked boundaries and disliked wannabes. \n\nEventually his dad remarried; me and his new wife had a few candid heart-to-heart conversations where boundaries were established, and we proceeded from there. Years went by, we're not friends but we get along without animosity.\n\nThat being said, F is aware there are boundaries in place where his dad is concerned. Sometimes he needs a little reminder that they still exist.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Right",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Which is why, if daughter does meet him, it needs to be in a public place, with supervision, preferably from the court.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 80,
          "content": "I want to jump on this top comment to provide the opposing view: \n\n\nI was the daughter of a guy who wanted no part. My mom kept everything a secret, and even though he wouldn’t pay child support she still let me see him on the weekends (when he had time and wasn’t busy going out with friends). I grew up idolizing him, because as a kid, all I knew was I’d get to eat donuts for breakfast lunch and supper. But as an adult, now that my mom has told me how he acted when I was younger, I wished I’d never visited him. \n\n\nHe has all the time in the world for me now that I’m an adult, but growing up he never went to recitals, never paid for dance class or sports. He gave zero financial (or emotional) support. I think I had more heartbreak over this realization, than I would if my mom had let him leave and allowed me to make the decision if I wanted that relationship. \n\n\nIt may have hurt your daughter to know that her dad didn’t actually want her, but so long as she’s reminded that you love her, you raised her, you’ll always be there for her, I think it was the best division you made. He does not deserve that relationship with your daughter. NTA",
          "id": 70,
          "comments": [
            {
              "score": 4,
              "content": "Agreed...it would have been so much easier to not have had a dad at all, than to have had one so blatantly disinterested in me and resentful of any time or money he had to spend on me instead of my stepmother.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5705,
      "content": "Part of me wants to say E-S-H, because you did poison her views of him, but who could blame you for that? He didn't give a darn for 16 years, and what he did when you were pregnant is indefensible. You didn't deny her a father, he did. He is nothing but a sperm donor and a stranger to her. Maybe someday she will want to know him as an adult, but I can't imagine he will ever be her dad.\n\nYou're NTA.",
      "id": 72,
      "comments": [
        {
          "score": 4109,
          "content": "It's not poison if it's true",
          "id": 73,
          "comments": [
            {
              "score": 1873,
              "content": "Exactly. It’s the truth. His truth  is ugly, he just doesn’t want to be judged for it. That’s not how life works fucko.\n\nAlso I personally wouldn’t trust him to not lie. Again. His whole thing is to make himself look good, a sure he was only 19/20 when it happened but he still only cared about  himself then and for 16 more years. \n\nNTA",
              "id": 74,
              "comments": [
                {
                  "score": 794,
                  "content": ">but he still only cared about himself then and for 16 more years.\n\nExactly this. I think OP was really smart to ask about whether he'd set up a college or car fund for his daughter to show that he'd been thinking about her. He hadn't, so he showed himself up.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 418,
                      "content": "That and if he was serious, he'd start NOW. He'd also contact every single person he lied about OP to and set the record straight.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 466,
              "content": "Yeah I’m tired of this weird trend of lying to kids about the other parent. If it’s a small thing, or something in the past that doesn’t affect the kid and you’re weaponising that, sure that’s bad.\n\nBut now we’re supposed to sugarcoat that this man abandoned her for 16 years?? The mum is supposed to make this deadbeat look good for what reason exactly? What benefit could the daughter get from going into a relationship with this selfish, cruel man without knowing the truth? Doesn’t this show her that this kind of behaviour is acceptable? \n\nIf you don’t want your children to think badly of you, how about you try being a good person? \n\nNTA",
              "id": 77,
              "comments": [
                {
                  "score": 265,
                  "content": "I hate how everyone always says \"kids will know eventually that the awful parent is an asshole & love the parent that never mentions that\". It doesn't always work that way. If you let your kid live in a fountain of lies, there is a very good chance they will grow up and believe the lies.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 88,
                      "content": "I would be so mad and hurt at the parent who hid that! I would feel manipulated into trusting someone who didn’t deserve it. I would feel like my needs weren’t what mattered, that the needs of this deadbeat were more important.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "As a kid who had both parents complaining to me about the other, I don’t think people say that because they think you should lie to your kid per say. More so they are a child and they don’t need to know certain things nor should it be their responsibility to hold an adult’s frustrations with another adult.\n\nIf the adults are able to present facts without their emotions interfering and to frame in in a way that focuses on the emotions and welfare of the child who will also be feeling a lot of things about having a crappy parent, then sure. Or if the child is old enough to hold some of their parents more personal thoughts on the subject like OPs 16 year old, absolutely. But to dump your own feelings about another adult on a kid is not appropriate and is what many people do. \n\nBut “Your dad did some really crappy things to me when I was pregnant with you that make me really skeptical of him. I’m also very concerned that his wife seems to be having infertility issues according to her posts and now he’s reaching out. That does feel right to me and the timing feels off to me. What do you think about this? Would you like to know more about anything before making a choice?” Is a very different conversation with a 16 year old than “You dad is a shitty person and I don’t think he cared about you at all. He’s just here now because he can’t have other kids. Do you want to me him?” Both are true but one is more about the kid and the other about the parent. I don’t know what tone OP had but I’m hoping for the first as she seems pretty aware.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Or they resent you for lying to them when they grow up & find out the truth & 3nd up hating both parents in the end",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 102,
                  "content": "I've seen this multiple times, irl, with \"I don't want to deny my child a relationship with their grandparents\" and I'm like \"yeah, but those same people abused you for your entire life. Why are you subjecting your child to that?\"\n\nKids really truly don't need to know people simply because they are related by blood. Kids are much better off being surrounded by people who love them and who can model positive behaviors. There's plenty of time for them to meet AHs later in life.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I do believe that the truth should be told to children but in digestible forms for their ages. \n\nWhen the daughter is 4 and asking why daddy isn't around you don't tell the story above. You reaffirm that not everyone has a dad and that's okay and normal. He's alive he's just somewhere else. It doesn't mean there's anything wrong with her. It's not her fault he's not around. She's loveable. Etc etc\n\nBut 16? That's old enough for the facts as they are.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "It’s also dangerous to hide the truth from kids. My mother never told me what the full situation of the custody agreement was and never corrected any impressions my dad gave to because she didn’t want to hurt me by revealing he was not just a bad parent like I could already see, but an absolutely crap one.\n\nIn turn dad manipulated me a lot growing up by threatening to cut off his financial support that I thought my mom relied on. Turns out there was no formal child support agreement and his financial “help” was just $200-$400 every 4 or 5 months when I would visit him (he always made a bug show of entrusting me with the check since I was in pre school). He kept me from getting a job and doing a lot of other things that would have helped me improve my start to life by threatening to remove nonexistent aid, which in turn kept me dependent on his fickle handouts further into adulthood than I would have liked. \n\nIt also generally caused my a lot of distress jumping through hoops to keep him in a good mood because I was afraid of my mother hurting financially if I didn’t. Only for it to turn out that they were both lying about his contributions, and that my mom did it to “protect me” when knowing the truth would have made my life so much better. \n\nNow I am just mad at both of them over how much I let my life get fucked up over what turned out to be $50 a month and two misguided idiots’ idea of what it meant to be a “good parent.”",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "Well it’s not always as simple as that, but in OP’s case, yes it is that simple. He didn’t want her, contributed the minimum necessary to stay out of jail only after compelled to by a court of law and attempting to intimidate the the mother into not seeking support for the child, and only now seeks her out when he can’t make other children.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "Yeah, it's not 'poison' it's context.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "I mean poison is poison. There is definitely a lot of bias here, but its well earned. No use saying its not what it is though and OP has no reason to feel bad that they aren't a saint. \n\nThough im still angry that he said \"she\" ruined his changes. He clearly hasnt grown enough to take responsibility for his bad behavior. Hes still just blaming OP for the pregnancy. Nothing has changed there it seems. So fuck him. He gets to sleep in the bed HE made.",
              "id": 87,
              "comments": [
                {
                  "score": 6,
                  "content": "You say OP is no saint, but what the hell did they do wrong? They literally just told the truth 🤷🏻‍♀",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "The father's behavior is poison. The mother simply told the truth about the poison.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Agree with the sentiment.\n\nPoison is poison. The only difference is if people are willing to be honest about the poison, or if they are going to lie about it for some arbitrary notion like \"but hE's FaMIlY\"",
              "id": 90,
              "comments": [
                {
                  "score": 13,
                  "content": "\"But he's family\" is itself an insidious, quiet poison used to justify behavior we would otherwise find unacceptable.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 383,
          "content": "I wonder what his response would have been if her condition to meet the daughter was that he would have to admit to everyone publicly that he lied about her planning the pregnancy and trying to trap him, and that he made it up to avoid taking responsibility. (And maybe compensate her for lost income due to having to take 100% parenting responsibility and dropping out instead of any kind of coparenting.) Anyway, NTA… probably better to just say no, just curious what the response would have been.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 109,
          "content": "How did she poison the view when that’s exactly how he is lmao?",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 107,
          "content": "As someone who has a non-present father lost to narcissism, religious extremism, and drug addiction, the mother being honest to her 16yo daughter and giving her a choice whether or not she wants to get to know him is not \"ESH.\"\n\nThat's a good mom being transparent, open, and providing age-appropriate information and supporting her daughter to make her own choices about the guy. OP is NTA.\n\nI'm not going to be surprised if the daughter changes her mind over time, gets curious, and wants to meet him one day, but it sounds like OP will be supportive of that and also be there for when he inevitably shows the daughter his true colors and the daughter needs support.\n\nThis is honestly one of the healthiest ways a single parent can support their child in regards to the other deadbeat/fairweather parent who suddenly wants to play house with their prop child they chose to abandon.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": "Let me highjack your comment to say people need to stop lying to children about their parents \"to protect them\".\n\nMy father also didn't want anything to do with me and paid the minimum of child support. (Actually his father did because not even that he was capable of doing)\n\nMy mom lever lied to me about him. When I asked when little she would tell me age appropriate truths.\n\nI grew up knowing my father didn't want anything to do with me. And that made me never miss or want a relationship with him. I never needed therapy and never felt abandoned. Never felt I was missing something.\n\nI dated 2 people in similar situations as me and your daughter OP, and I know a few more. My exes had mom who hided from them the truth about the fathers, both spent their entire childhood missing their dad, and both developed real \"daddy issues\". One of my exes went looking for her father and when he rejected her, it broke her even more, all because her mom wasn't honest about the type of men he was when she was growing up. (She did tell her when she started looking for him, but then it was too late)\n\nThe other was able to regain some sort of contact, but she's not a person next to him. He doesn't care much about her, the relationship is one sided, and she just accepts any scrap of attention from him. It's extremely unhealthy.\n\nPeople I know who's mom were honest, don't have any issues. Some got in contact with their father in adulthood to different degrees of success, but none of them suffer, like the ones where the mom wasn't honest.\n\nTrying to hide what happened in the past, and what type of person the father is, is only gonna create more hurt.\n\nDON'T LIE TO CHILDREN",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": ">because you did poison her views of him\n\nnaw, that's like saying \"the media has a liberal bias\" when they report that GOP are anti-X, Y, Z. \n\nAll OP did was tell her kid the truth and save her kid from having to learn something the hard way.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "How anyone could even contemplate ESH is beyond me.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "He poisoned her views of him himself by being an absent father. Her mother telling her the truth isn’t poisoning. She’s 16 and should have all the info to make an informed decision.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "how did she poison this? she just told the truth",
          "id": 99,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Honestly, this was a good warning for her. Her father couldn’t be bothered to call anytime prior.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3945,
      "content": "NTA, but lawyer up and make sure your custody and support agreements are ironclad.",
      "id": 101,
      "comments": [
        {
          "score": 2555,
          "content": "A judge isn't going to make her begin visitation at 16 and if OOPs local court system is as back up as mine, the daughter will be 18 by the time they make it in front of a judge. Most judges will ask the same questions as OOP. Why now?",
          "id": 102,
          "comments": [
            {
              "score": 1113,
              "content": "Not to mention most courts heavily take into the child's opinion at that age.",
              "id": 103,
              "comments": [
                {
                  "score": 146,
                  "content": "They will but they will also take into account if there is any sign of purposeful parental alienation",
                  "id": 104,
                  "comments": [
                    {
                      "score": 589,
                      "content": "Can you imagine the atmosphere of a forced visit with a 16 y.o. and parent? He'd soon change his mind.",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 175,
                      "content": "He alienated himself by refusing to see the kid for 16 years.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 44,
                      "content": "It's not purposeful, I'm gunna assume he's not even on the birth certificate. The court won't do anything or make OP and her daughter do anything for a man who didn't even sign his name when she was born. He has no rights without paternity atp",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "At 16 and the parent is just now seeking visitation, I don't think that claim would hold up even if the judge wasn't thrilled with OOP sharing her assumptions. The dad hasn't tried to make contact with the daughter or be involved in her life beyond child support payments before now and most judges are going to take previous behavior and status quo for the child into account. At this point they're just not going to compel an almost adult to begin visitation with a parent who was estranged by choice.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Tbh OP would just need to read major portions of this in her statement to the judge and it'd be clear who, if anyone, was purposely alienating whom here.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Are you suggesting that OP purposely alienated her daughter from the father? As someone who has been in her shoes, I doubt that’s the case. I got pregnant in college and lived less than an hour away from my daughter’s father — we were in a relationship for 3 years, he didn’t bother showing up for the birth, and I think he maybe saw her three times in the first year she was alive. We moved away to live closer to my family support system. She is 14 now and hasn’t seen her dad in 8 years — even when he did see her, I was the one footing the bill for travel costs. He’s never called, texted, or even asked about her a single time. Unfortunately that’s the way it is for most unmarried parents of unplanned children - many fathers are happy to alienate themselves without any help doing it. I work in the child welfare sector and watch it happen every day.\n\nI think a lot of adults are quick to blame the custodial parent for “parental alienation” and throw that term around a lot, when it’s just as likely that their other parent simply didn’t try that hard to have a relationship with them.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "> purposeful parental alienation\n\nIE: dad not being in the child's life, and paying the bare minimum into child support with no \"college fund\" on the side.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Parental alienation could be a factor, but at her age, a court is going to give her the benefit of the doubt of being able to think for herself, and I don’t see it as alienation as much as giving the facts. If the mother lied, that’s different, but if it’s simply facts that made the daughter not want to see the father, that’s his fault. You can’t argue “she told my daughter the truth, which makes me look bad, and now she doesn’t want to see me,” and expect a court to favor you.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "This is really up to the judge. I have a relative who, when she was in HS, she joined every single club and over-scheduled herself all the time because a judge had made it perfectly clear that any attempts by her mom to interfere with her dad's (who was an absolute abusive asshole) visitation would be viewed as contempt of court. Her mom had done absolutely nothing to interfere whatsoever. The judge did not ask what any of the kids, who were all in their teens at the time, wanted at all during that hearing. The custody agreement's bit about visitation had bit about this visitation not interfering with any educational activities. So she pretty much always had an education excuse to avoid seeing her dad. Once she turned 18 she dropped all of the clubs and extracurriculars except band, that was the only one she actually cared about.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 108,
              "content": "Yeah at 16 all they have to do is bring the kid to court and have her tell the judge this guy didn’t want anything to do with me for 16 years, I’m not interested. I can’t see a judge deciding this is in the kid’s best interest at this point. In 2 years or less she’ll be 18 and able to decide for herself anyway.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Can you imagine the nonsense the dad would try to spew when the judge asks what about the last 16y? Lol.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I was in almost an identical situation, except he cheated and bailed when I was 6 months pregnant.  Came back when she was 11 and legally got partial custody of her (after 3 supervised visits, a few unsupervised, and a couple of counseling sessions)   After 11 years of NOTHING.  It has taken everything in me not to tell my daughter what really happened, she's 13 now and I think about it all the time!  I covered for him to try to protect her wellbeing and it still bothers me.   \n\nDefinitely NTA.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 144,
          "content": "The daughter is 16. Most states will leave it up to the kid if she wants to see a parent at that age. But, the support agreement part I agree with.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "It’s too late. She’s 16. It’s done. My daughter had a voice at 13.",
          "id": 118,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "She’s 16, not 6. No lawyer necessary as no court is going to require a 16 year old to go to one parent or the other.",
          "id": 119,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2944,
      "content": "[deleted]",
      "id": 120,
      "comments": [
        {
          "score": 1495,
          "content": "She's 16 so he's not been there for alot her important mile stones but now wants to reap the rewards cause his wife can't pop any out for him. I wouldn't allow him near my kid cause after 16 years his intentions are honestly about his daughter, there about his wife's happiness but I maybe wrong 🤷‍♀️",
          "id": 121,
          "comments": [
            {
              "score": 453,
              "content": "I think OP did the right thing by presenting it to the teen. If OP didn’t tell her daughter and dad found her a couple of years later as an adult he could frame it as mom kept them apart.",
              "id": 122,
              "comments": [
                {
                  "score": 143,
                  "content": "I agree. She’s 16, old enough to handle the truth. If OP had kept anything from her to protect the dad’s reputation, it seems very likely that he would have spun it as, “your mom kept you from me, but now I have you back, and my barren wife and I love you so much! You should totally come live with us away from your mean mom.”",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 274,
          "content": "And just wow, 16 years is a long time to wait. Might as well wait until she is in her 20's and reach out with an apology for not being there vs showing up and saying I got nothing for you and nothing to offer, but hey, meet my wife.",
          "id": 124,
          "comments": [
            {
              "score": 68,
              "content": "Could be worse, could be hey meet your grandparents who said I could only inherit if I had offspring.  And soon you’ll be old enough to give them great grand children.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "And how much you want to bet if OP ever let him have visits they would be pushing the daughter to give the stepmom some kind of motherly role in her life",
              "id": 126,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Boom",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 105,
          "content": "But he is a bad man. He harassed and enabled it, put everyone against her, didn't care about the kid for literally all her life until now. And not because he wants to correct his mistake, but because he's a selfish man. It is true OP's daughter should have an opinion in this, but it's also true she has all the context and information. And because she's still a minor, if she meets the biological dad it should be with OP present.",
          "id": 128,
          "comments": [
            {
              "score": 114,
              "content": ">He took things further by telling my friends and his family that I planned the pregnancy to trap him\n\nThis says everything we need to know about him. Forced not to wear a condom despite his desperate pleas, so OP can fulfil her diabolical plan of being a single mother at 19.\n\nEven if he didn't want to have a relationship with her, he still could have had one with his child.\n\nI wonder if they are trying to adopt, and having a no-contact daughter is an obstacle.",
              "id": 129,
              "comments": [
                {
                  "score": 35,
                  "content": "Hmmm interesting thought about possible adoption monkey wrench.\nA NC daughter would red flag him.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "I really hope they don't adopt. Someone like this shouldn't be a father, and even less considering how kids and teens in orphanage are (I'm not blaming them, that's the least I'd do). They need all the care, love and support, and that \"man\" doesn't have that.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "I disagree with the last part. Parents should not set their children up to meet bad people. He doesn't love her at all. She would only be disappointed.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Agreed, but if she were 12 it'd be up to OP to decide for her, not set her kid up for disappointment. \n\nAny kid presented with good news only would get their hopes so high their dad finally wants to meet them, only to eventually find out they're a consolation prize because he can't have the kid he actually wants? Fuck that.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2438,
      "content": "NTA He chose not to be a part of her life, paid a minimal amount of child support, painted you as the pariah, and because he and his wife are struggling to conceive, now he's interested in her after 16 years? How convenient he has a back up child! Now she means something to him.\n\nYou told her he was interested in pursuing a relationship with her and you'd support whatever decision she made. He hasn't been around for her entire life... he rejected her.   She's well aware of it. You were frank with her but I feel she needs to know what she's getting into because suddenly she's become a convenience. Had his wife been able to conceive, I wonder if he would still be interested in pursuing a relationship with her? I feel you did the right thing.",
      "id": 134,
      "comments": [
        {
          "score": 520,
          "content": "I wonder if he even told his wife he had a daughter until they had issues conceiving. That could also be a good indicator of what his mindset has been over the course of the last 16 years. And if his wife knew she existed, how did the wife feel about her stepdaughter prior to their fertility struggle?? Did she encourage him to try to build a relationship, or did she also think OP was terrible and tried to baby-trap her poor husband in his younger years?",
          "id": 135,
          "comments": [
            {
              "score": 179,
              "content": "It’s probably how things like this work out all the time. With dad telling the mom I don’t want anything to do with you guys and then crying to everyone that she took the kids and left and won’t let him see his kids.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 123,
              "content": "If his wife knows, then she only knows the narrative he created to make himself look good and not the truth.",
              "id": 137,
              "comments": [
                {
                  "score": 19,
                  "content": "And if she knew ... they made it to trying-for-a-baby before she pushed for him to care/she wants a baby/child",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "Maybe he’s trying to prove to the world that he’s a man and not shooting blanks. The infertility is all his wife’s fault.",
              "id": 139,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "That's exqctly where my mind went. My guess is, the wife may not know about her and if she does will certainly resent the daughter. Not a good idea for her to be exposed to that.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "> How convenient he has a back up child! Now she means something to him.\n\nHonestly! \n\nI wonder how he justified to his wife, who clearly wants kids, that he has a child that he’s uninvolved with and is not saving anything toward out of hope. I wonder how she was okay with that. \n\nOf course the obvious answer is he lied and said the mom kept him from his beloved daughter. But even then, you’d think a truly devoted father would be like “her mom is keeping me from her but I still send this or that on her birthday even if she isn’t getting them.” Or “I’m putting money aside for xyz for the day she’s an adult and wants to meet me so she knows i never stopped thinking about her.” Like, how is the wife okay with not seeing any of that effort and still wanting a child with him? \n\nOR like some men, did he lie about not having kids and then now that she’s having infertility issues he’s like “well whaddya know!” \n\nNot that we’ll get any of these answers and my speculation serves no true purpose. But I can’t help but wonder how this all went down from her perspective.",
          "id": 141,
          "comments": [
            {
              "score": 13,
              "content": ">OR like some men, did he lie about not having kids and then now that she’s having infertility issues he’s like “well whaddya know!” \n\nProbably not this one, since I doubt he managed to get all of his family and friends to never mention OP, who he convinced them to harass for trying to \"trap him\".",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1398,
      "content": "Based on the age of your daughter, I have to say that you’re NTA. Your daughter is old enough to take what you have to say and form her own opinions. If you had insisted that she not know him, I would’ve said Y T A. But you just gave your opinion, said what happened from your perspective, and let her make the final decision. Sure your description wasn’t flattering, but to be fair how could you expect it to be anything but?",
      "id": 143,
      "comments": [
        {
          "score": 278,
          "content": "And LAWYER THE HELL UP NOW. If that man is as you've described, don't assume he's just going to accept your opinion on the matter. \n\nThe good news is, your kid is 16 and most judges wouldn't force a relationship that was nonexistent for the past 16 years.\n\nNTA",
          "id": 144,
          "comments": [
            {
              "score": 165,
              "content": "They likely wouldn't even get a court date before daughter was a legal adult, in fairness.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 80,
              "content": "The kid would be 18 before any custody suit even made it to court.",
              "id": 146,
              "comments": [
                {
                  "score": 4,
                  "content": "Very true",
                  "id": 147,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": ">Sure your description wasn’t flattering\n\nWhy would she sugarcoat it when nothing about what he did, was it fact, \"flattering\".",
          "id": 148,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 786,
      "content": "NTA, he doesn’t get to waltz in now because he feels like being a Dad. \n\nInfertility is horrible and I feel for anyone going through it BUT that doesn’t give him the right to go oh well I’ll go back to that other kid I had. \n\nI understand why you told your daughter and I think the fact that you’re saying to her that you will support her if she wants a relationship with him reaffirms that you’re not at fault here. \n\nI hope that if she chooses to, he does step up to the plate and make up for lost time.",
      "id": 149,
      "comments": [
        {
          "score": 169,
          "content": "IF his spouse had anything to do with him seeking this child out for her own selfish needs then she is not someone who should ever have children.",
          "id": 150,
          "comments": [
            {
              "score": 49,
              "content": "I totally agree but giving his wife the benefit of the doubt here. If she did have anything to do with it then yeah it has some red flags.",
              "id": 151,
              "comments": [
                {
                  "score": 66,
                  "content": "Unless he lied to his now wife about being childless, the wife is a red flag as well. I don't think I could ever be with someone who abandoned their child the way he did.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 50,
                      "content": "Or he might have lied about why he doesn't have a relationship with his child. This whole argument with OP might be performative to show his new wife that he did care and OP is blocking him from having a relationship with his daughter.",
                      "id": 153,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "If wife knows it’s because he told her his false narrative and not the truth that he abandoned her. I highly doubt wife knows the real story.  And if she only found out because he decided he wants a fill-in kid, then he also definitely lied about why he’s never seen her and is only paying the bare min child support as well as his lie about what happened 16 years ago.  Wife obviously has only ever heard the version he told everyone 16 years ago as well as a new lie as to why he has never seen her in 16 years and/or why she didn’t know he had a kid until it became obvious they were infertile.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I honestly wouldn’t be surprised if he did to be fair.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Yeah, i wouldn’t put any blame on the new spouse just yet. The father is the one deserving of the hate, but we know nothing about the new wife outside of her infertility.\n\nFor all we know, he decided to tell the new wife he had a previous child from another relationship only recently and now he’s reaching out because she’s onboard, he may have hidden this from her until this point. \n\nWe really don’t have enough info to assume her motives and that’s not fair. We do for daddy dearest tho",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Most women having infertility issues aren't aiming to take on a 16 year old suddenly, so hopefully there is someone with good intentions on their side.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 733,
      "content": "Honestly, I was your daughter once. My mum wouldn't say anything about my dad that leaned into either positivity or negativity. When my dad did contact me, my mum let me discover who he was for myself. It was a horrendously tough lesson when he turned out to be utter trash. I wish she had been more truthful with me, though I know she just wanted me to get to know my Dad in an unbiased fashion. I'mm glad you were honest with your daughter, she'll appreciate it in the long run. NTA.",
      "id": 158,
      "comments": [
        {
          "score": 198,
          "content": "This. I was given the opportunity to know my biological dad and he was a terrible person. NTA.",
          "id": 159,
          "comments": [
            {
              "score": 71,
              "content": "Same here. My dad has bounced in & out of my life since I turned 14 (41 now). \n\nNTA",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Same here. I respect that my mom didn't wanna get in the way to much but I kinda wish she had.\n\nIf I were in her shoes, knowing what I know now, I would scream the house down before I ever let a man like my dad be a \"father\" to any child.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "That man is not your dad, he was a sperm donor. You don't become a dad when you get someone pregnant. You become after you are there for them.",
          "id": 162,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 428,
      "content": "NTA. This was a hard one though. If he really wanted to know her, he had 16 years to give more than the mandatory child support fees. Just be careful that you aren’t giving anything but the facts to her because if he’s still paying child support he could take you to court and fight you for custody or tell the court that you’re coaching her not to talk to him.\n\nFrom a mental health perspective, you may want to connect her with her father virtually with you present and offer your daughter an out if she needs. At 16, she should understand that you were the one who took care of her and it’ll be better for her to come to the conclusion herself.",
      "id": 163,
      "comments": [
        {
          "score": 166,
          "content": "Fighting for custody is hopefully a non issue here. I can’t think of a single state that would force a 16 year old to stay with a man she’s never met in her life, especially since in most states 16 year olds have a choice about which parent they stay with. In my state, starting at 12 years old children are allowed to express a preference in custody hearings, and the older they are the more weight their opinion is given. This is all assuming that he would be able to get to court in a timely manner — usually it’s a few months wait, but a lot of courts right now are so backed up that it’s closer to half a year or more, at which point OP’s daughter could be 17. No judge is going to make her live (even partially) with a stranger that she has never met for the last year/year and a half of her childhood, especially as she’s expressing a desire to have no contact with them whatsoever.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 254,
      "content": "NTA - If I was her I would want to know about this. It's not an ideal situation but neither is him abandoning her. It was his abandonment that is to blame for this whole situation. She would have felt even more abandoned by him somehow and at some point and he would have hurt her more if he pretended to care about her just because his wife is infertile. Honestly, it's unfortunate that his wife doesn't seem to know what kind of person he is. \n\nHe is a selfish person and doesn't care about that and she would eventually pick up on that as he would inevitably show his selfishness by it coming out another way and he could harm her further.\n\nHe selfishly only wants to be the 'fun dad' when it's convenient for him and doesn't care about taking responsibility of a child. He knew what he was getting into as you said before the deed that you would not get an abortion and if he didn't want that, he shouldn't have done the deed with you and should have found someone else who also agreed they didn't want children.",
      "id": 165,
      "comments": [
        {
          "score": 3,
          "content": "I personally don't think he's trying to be \"fun dad.\" I think deep down he wanted kids but didn't want them while he was still in party mode. He seems to be the type to want to have sex without protection and then get shocked when his actions have consequences because i am imagining that no way was OP telling him if she gets pregnant, shes not getting an abortion without there being some underlining reason as to why she even had to say that in the first place. So when OP got pregnant, he panicked because he wasn't expecting his actions had consequences and he scapegoat his way out of it by saying OP trapped him. Just so he could get of scott free and continue his party life before he settled. \n\n16 years has passed and not once was he interested in his daughter that is when his wife is coincidently having trouble conceiving. Now he wants to know his daughter? He thought his wife was going to give him kids and he could forget about his daughter. His life plan was to continue to party, then settle down and marry, then have kids with his wife and OP's daughter was not a part of this vision. His wife having trouble conceiving disrupted his vision and now he's scrambling to get his supposed \"one chance\" at being a father and he feels OP is purposefully blocking him by her telling her daughter the truth that his love is conditional. Meaning daughter has to think about what if his wife do conceive successfully? How is he going to move forward in a relationship with her after the fact? That he already abandoned her once means he could do it again. And daughter recognized that and noted out of wanting to know him\n\nIn addition, I can't imagine a woman who is having infertility troubles is going to be open towards a teen daughter around her. She will know he had sex with another woman before her and even had a child with her but they're married and she's having trouble giving him a child. I'm sure he's fed her lies about his relationship with OP and the daughter and having the daughter around while she's going through emotional distress is probably going to make her resentful. She'll be resentful of the daughter being a real human being and proof that her husband is fertile enough to have kids while she's struggling and she'll be resentful of the thought that her whole worth seemed to be narrowed down to her ability to conceive because why is her husband bringing his teenage daughter around all of a sudden when he had no interest in her before?",
          "id": 166,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}