{
  "post content": "  So at the current moment, I mainly stay at my fathers house. But I am at my mom’s right now due to my father working Tuesdays and Thursdays all day and night, and it’s break for school.\n\n I get incredibly bored at my mom’s. She does hiking and country stuff like camping, and going to swimming holes. That is not my thing, at all I hate doing it because i get bored of it so easily. That’s off topic however.\n\n I recently got a new computer for Christmas, and have been attached to it because I love to play games, That’s just what I do. \n\nEnough Background Info, on to the story.\n\n\n So i’m at my moms, and lo and behold i’m sitting in my phone being bored, because she doesn’t like to do anything i like, she’s sitting watching TV with my sister. I’ve already asked her what are we going to do and if we have plans for the week, as I’m staying there for the middle of the week due to my father working. My dad calls me to check up on me and I say my mind, I’m extremely bored and I wanna go home, to do what I enjoy. He says he can pick me up on. Wedsnday, I say great. So here’s where I might be AITA, idk at this point. I ask my Mom, I’m really bored and I don’t wanna hurt your feelings, but I would rather go to my dads, then stay here. She says no, and that I don’t spend enough time here when I’m here on the weekends (every other) and says I can’t spend any time with her. I get irritated and say well Im not going to spend time with you if your going to select things that are boring. She says: Well you don’t like to do anything except play on you’re fucking computer. \n\nThat isn’t true, I suggest movies or bowling and stuff and she says no.\n\nSo Reddit, AITA\n\n(sorry for bad formatting, i’m on phone)",
  "id": 1,
  "comments": [
    {
      "score": 10,
      "content": "NAH. As a person with divorced parents, I understand where you are coming from. Spending time with your Mom is important. Sounds like you need to work on ways together so that you are engaged.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "NAH you're just not meshing with your mom and don't have a lot in common. I think some family therapy for better ways to communicate might help.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NTA with just a smidge of ESH. Your mum seems very unwilling to compromise, as it sounds like you accompany her on activities she likes often but she doesn’t really try to do the things you like to do with you. I know it’s hard but maybe just seem a little more interested when you do her activities with her, so maybe she’ll have a “She/he’s making an big effort, I have to make one too...” moment, I’m not 100% on that though.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "Not enough info. Are you a minor? Is there a custody agreement in place? Is she a good parent?\n\nIt’s not wrong to be more comfortable around one parent than the other. You can do your honest best to have a relationship with both and naturally be closer to one than the other. I’d recommend you don’t tell your mom she’s boring you though.  It’s not her job to entertain you. Instead of “you’re boring,” maybe try, “hey, I’d like to spend time with you doing something we both enjoy. Could you help me come up with some ideas?”",
      "id": 5,
      "comments": [
        {
          "score": 3,
          "content": "i’ve already tried that, i don’t flat out call her boring either, i’ve tried listing out movies, bowling and countless other things. i’m a minor, and i don’t know if\nmy dad has legal custody over me but i stay with him 90% of the time.",
          "id": 6,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n  So at the current moment, I mainly stay at my fathers house. But I am at my mom’s right now due to my father working Tuesdays and Thursdays all day and night, and it’s break for school.\n\n I get incredibly bored at my mom’s. She does hiking and country stuff like camping, and going to swimming holes. That is not my thing, at all I hate doing it because i get bored of it so easily. That’s off topic however.\n\n I recently got a new computer for Christmas, and have been attached to it because I love to play games, That’s just what I do. \n\nEnough Background Info, on to the story.\n\n\n So i’m at my moms, and lo and behold i’m sitting in my phone being bored, because she doesn’t like to do anything i like, she’s sitting watching TV with my sister. I’ve already asked her what are we going to do and if we have plans for the week, as I’m staying there for the middle of the week due to my father working. My dad calls me to check up on me and I say my mind, I’m extremely bored and I wanna go home, to do what I enjoy. He says he can pick me up on. Wedsnday, I say great. So here’s where I might be AITA, idk at this point. I ask my Mom, I’m really bored and I don’t wanna hurt your feelings, but I would rather go to my dads, then stay here. She says no, and that I don’t spend enough time here when I’m here on the weekends (every other) and says I can’t spend any time with her. I get irritated and say well Im not going to spend time with you if your going to select things that are boring. She says: Well you don’t like to do anything except play on you’re fucking computer. \n\nThat isn’t true, I suggest movies or bowling and stuff and she says no.\n\nSo Reddit, AITA\n\n(sorry for bad formatting, i’m on phone)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 8,
      "comments": [],
      "relation": "No"
    }
  ]
}