{
  "post content": "\n\n\nSo my M27 car broke down, I asked my wife F26 to give me a ride to work in her car that I helped save up for and she agreed. \n\nShe's the type of driver that makes a mess in the car. Emoty perfume bottles, makeup stuff, empty cartoons and plastic bags and old airfreshners are all in the back. When I got to her car and opened the passenger door. I found her bag lying there. I asked her to remove it so I could sit but refused and said that the bag \"has\" essential \"stuff\" inside that she needs immediate access too like her lipstick or gum pack. I was stunned when she pointed to the back and told me to sit in there. I said no, because the back was a mess and also, out of respect I should be sitting in the passenger seat where passengers should sit. She insisted but I refused and asked her repeatedly to remove her bag. She didn't so I went ahead and get in and sat on it. She freaked out on me yelling about it then an argument ensued. She removed it, put it in the back then started yelling about how I was disrespecting her in her own car and that she was doing me a FAVOR by giving me a ride to work, and shold've just sucked it up and shown some respect. I ended up taking the bus and she was mad because she claimed I damaged her makeup pallette that was inside the bag. She called me immature and said that I don't get to control and disrespect her and the things she owns.\n\n\nWe haven't talked since I got home. AITA for sitting on her bag?",
  "id": 1,
  "comments": [
    {
      "score": 5624,
      "content": "I truly think you guys have bigger issues within the relationship, if it all kicks off over a bag and a car ride.",
      "id": 2,
      "comments": [
        {
          "score": 1620,
          "content": "The Iranian yogurt is not the issue here.",
          "id": 3,
          "comments": [
            {
              "score": 565,
              "content": "Marinara flags abound",
              "id": 4,
              "comments": [
                {
                  "score": 81,
                  "content": "What is the link for the marinara flags reference, I've seen it a lot but I've never read the post.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 92,
                      "content": "[removed]",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "He even sat on a marinara flag!!",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Not just essence of marinara either.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 125,
              "content": "If you put her Iranian Yogurt and marinara flags in her art room then she may have a leg to stand on. I jest..",
              "id": 9,
              "comments": [
                {
                  "score": 26,
                  "content": "Ah, the art room...! I need to know if they finally came to terms with their sexuality , they very obviously fond of each other.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 36,
                      "content": "Yeah they updated the post. It was magical for him..  I'm thinking not so much for the soon to be ex.\n\nEdit typos",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "I love and am also kinda of sad, that I understand all of those references.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Same 😂",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "he ought to buy her an oscillating fan as an apology.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "The fact that many people can read this post and know exactly what you mean 😭😭😂😂",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Scratch that - I saw someone else had posted the link below and I followed it. I’m all caught up now and can see that it’s a classic for a reason.",
                  "id": 16,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "The yogurt! I haven’t thought of that one in a while.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "What's the reference for the Iranian yogurt, I haven't seen the post. Can someone please link it 🙏",
              "id": 18,
              "comments": [
                {
                  "score": 32,
                  "content": "[Iranian Yogurt ](https://www.reddit.com/r/AmItheAsshole/comments/bjd41e/aita_for_throwing_away_my_boyfriends_potentially/)\n\n\nI've read both stories and I've seen marinara flag all over but I never made that connection 😂",
                  "id": 19,
                  "comments": [
                    {
                      "score": 21,
                      "content": "I really want an update to the Iranian yogurt couple. Did they work it out? Did he ever get a diagnosis? Did he ever fess up where to buy black Market yogurt?",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "This post is absolute gold 🤣 I'm not sure how I missed it. Thank you so much",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Yesssss I’ve been waiting to see this comment!!!! 😂😂😂",
              "id": 22,
              "comments": [
                {
                  "score": 13,
                  "content": "The fact that I knew what these food references refer to… 😶",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "What’s the link for the Iranian yogurt?",
              "id": 24,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "Ok so I know art room, marinara flags, ferret vs actual ferret, so what's this Iranian yogurt now?",
              "id": 25,
              "comments": [
                {
                  "score": 16,
                  "content": "Wait. Ferret vs actual ferret?  How have I missed this??? Any link or summary you could provide appreciated!",
                  "id": 26,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Here ya go, [ferret vs actual ferret](https://www.reddit.com/r/AmItheAsshole/comments/y3tvjl/aita_for_making_coworkers_pay_me_for_my_time/isaapwf/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3)",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "Yes! Need a link to the ferret vs ferret please???",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "The ferret one cracked me up!",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "Here’s the link, it’s amazing. https://www.reddit.com/r/AmItheAsshole/comments/bjd41e/aita_for_throwing_away_my_boyfriends_potentially/",
                  "id": 30,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Thank you! Oh wow shit's craaaayyyy....lmao",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "[deleted]",
              "id": 32,
              "comments": [
                {
                  "score": 28,
                  "content": "It been deleted, but the gist was basically that the OOP went on a double date with a friend and her new boyfriend, and they went to an Italian restaurant. The new BF was trying to show off his knowledge of Italian, and said something about how the names of colours in Italian are easy to remember because it's the same as the names of pasta sauces, so marinara= red, alfredo= white, pesto= green, etc.  The OOP let the guy go on for a while, then he tried to correct him, and the bf basically threw a screaming tantrum in  the middle of the restaurant, before storming out.\n\nThe comments were full of people talking about all the \"marinara flags\" the friend's  bf had.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 3,
                      "content": "No doubt I'll be downvoted to Reddit hell here, but I surely can't be the only one who wants an end to the marinara flag references?  They stopped being funny after about a minute.",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "Posted earlier:\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/uyaxzs/aita_for_correcting_someone_at_dinner/ia2vyqo/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "I always though red flags were for abuse and that’s not showing up here, just disrespect on both sides. In a functional relationship OP would have sat down and moved the bag to his lap. ESH and it’s hard to see them salvaging this.",
              "id": 36,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "I must have missed this one, anyone got a link?",
              "id": 37,
              "comments": [
                {
                  "score": 0,
                  "content": "It’s amazing. https://www.reddit.com/r/AmItheAsshole/comments/bjd41e/aita_for_throwing_away_my_boyfriends_potentially/",
                  "id": 38,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "Excuse my ignorance but what's the Iranian yoghurt joke?",
              "id": 39,
              "comments": [
                {
                  "score": 4,
                  "content": "It’s probably the best post I’ve ever read. https://www.reddit.com/r/AmItheAsshole/comments/bjd41e/aita_for_throwing_away_my_boyfriends_potentially/",
                  "id": 40,
                  "comments": [
                    {
                      "score": 1,
                      "content": "HAHAHA wow that's hilarious 😂 Thank you for educating me.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 85,
          "content": "I'm glad this is currently the top comment. I mean, huge grain of salt here, but assuming all posts like this are true, it amazes me how often the issue isn't 'I did A, now Spouse/Partner is angry and not talking to me, AITA?' When really it's 'you are in a relationship where there is a serious lack of good communication skills, you both are clearly unhappy and not working as a team, and the problem isn't the bag, it's your relationship.'",
          "id": 42,
          "comments": [
            {
              "score": 7,
              "content": "Yea, these people do not like each other. At all.   Just let the whole relationship go.",
              "id": 43,
              "comments": [
                {
                  "score": 3,
                  "content": "Off topic, but I have to say that I love your user name!",
                  "id": 44,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 81,
          "content": "Why couldn’t you hold the bag in your lap?",
          "id": 45,
          "comments": [
            {
              "score": 73,
              "content": "Why does she need *immediate* access to lipstick and gum while she's driving?",
              "id": 46,
              "comments": [
                {
                  "score": 17,
                  "content": "It’s probably an undiagnosed anxiety thing. I have to keep my purse near me to reach lipstick or whatever while driving BUT I would never make anyone sit in the backseat just so I can get my precious next to me. No, I’d put it on his lap or move to the front passenger side floor",
                  "id": 47,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Same. I've even go so far as to put it between me and the driver's side door. My bag isn't huge, but I need my chapstick and lotion near me.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Sounds like he was irritated she told him to get the back.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "Why didn't they just put the bag on their lap.",
          "id": 50,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "+1",
          "id": 51,
          "comments": [
            {
              "score": -3,
              "content": "+2",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Exactly. Why are these people even married.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I had to reread their ages. I thought they were teenagers",
          "id": 54,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "Absolutely this! Both of you need to grow the hell up!",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -2,
          "content": "This is so true",
          "id": 56,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1731,
      "content": "ESH  She should have moved her bag to make room for you and you could have moved it rather than sitting on it and breaking the things inside.",
      "id": 57,
      "comments": [
        {
          "score": 723,
          "content": "Or just put the handbag on his lap 😂 Guessing there’s a lot more going on",
          "id": 58,
          "comments": [
            {
              "score": 443,
              "content": "The whole time reading I was thinking \"how big is that bag that you can't just put it on your lap\"\n\nHow did this even turn into an argument? When I get into the car and there is a bag I just move it. Why would I just sit on it?",
              "id": 59,
              "comments": [
                {
                  "score": 146,
                  "content": "Or down by his feet. I like having my bag in the front with my, so it just goes by the passenger’s feet. I don’t make them sit in the back?!",
                  "id": 60,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 39,
                  "content": "It's not the size it's the weight, the bag is filled with tungsten cubes",
                  "id": 61,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "My question was why does she need access to that stuff while she's driving",
                  "id": 62,
                  "comments": [
                    {
                      "score": 19,
                      "content": "She doesn't. They are both petty assholes. They probably had some other issue or their relationship has always been messed up and they both start unnecessary nonsense. It's just mindblowing to me how you can start arguments over a bag on a carseat.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "It’s good to have your bag readily available in case you get pulled over and asked for your license. And sometimes you may want your bag close so you can grab any access cards or key fobs needed to get into parking facilities. That’s why I keep mine close in any case.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -3,
                      "content": "I think to put on makeup on the way to work. That's what I do, I have my bag open with my makeup ready and at every traffic light or traffic jam I get ready.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 103,
              "content": "I'm thinking that's the missing missing reason here. He didn't want to hold the bag in his lap. He turned it into a power play and wanted her to move it for him. She wanted it nearby while driving so said if he wouldn't hold the bag he could sit in the back \n\nI dated a guy who refused to ever hold my bag because men don't carry purses. I get strong vibes of similar issues here.\n\nI get that it's a reach and that I have no evidence. That's why I'm not including it as a top comment.",
              "id": 66,
              "comments": [
                {
                  "score": 14,
                  "content": "I don’t think so. I think it started because she told him to sit in the back. Had she said, “just hold it please,” I get the impression he would have. If it was a power play, it was a bad one.",
                  "id": 67,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "Your bag is your responsibility.   \nMy bag is on my passenger seat when I’m driving, if I have a passenger, my bag goes to the floorboard.  I move it myself because manners.\nI’ve pretty much never asked anyone to hold my bag.  My SO, a wonderful, sweet man, would pass my bag to me if needed, but I would never ask him to hold it for me.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 12,
                      "content": "my husband and I move or hold onto each other's stuff in the car all the time.  Depends what it is.  This is such an odd thing to fight about.  From her ordering him into the back and him standing outside waiting for an 'all clear'.  This reads more like pre-teen siblings than a married couple.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I would never put my bag on the floor. Especially not the floor of a car. I have no problem putting it in the back, but I'm not the type of person to go into my bag while I'm driving.",
                      "id": 70,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "right??? Is it stuck there with industrial velcro? Why was he standing outside waiting for HER to move it?  Would it explode in his hands? Is he forbidden to touch her stuff?  They're married, this isn't a co-worker or neighbor; who doesn't move the crap off their spouses seat when they get in?",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 113,
          "content": "Exactly! Everyone Sucks Here because they both acted like spoiled children!",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Yeah agreed with this. Everyone sucks. But I do think she sucks a lot. And he only sucks a little bit. I'm kind of glad that he took the bus.",
          "id": 73,
          "comments": [
            {
              "score": 3,
              "content": "I don't understand why they are married, I treat strangers better than they treat each other.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "SERIOUSLY, Op. just pick up the bag, sit down, then put the bag on your lap. LIKE ANY NORMAL EARTHLING",
          "id": 75,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1001,
      "content": "ESH. What a bizarre relationship.",
      "id": 76,
      "comments": [
        {
          "score": 225,
          "content": "Maybe my life isn't so bad....",
          "id": 77,
          "comments": [
            {
              "score": 7,
              "content": "Thank you,  I needed that laugh today.  awesome answer.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": -66,
          "content": "Straight people are bit weird",
          "id": 79,
          "comments": [
            {
              "score": 59,
              "content": "Don't go there. Even straight people think that's weird.",
              "id": 80,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "Cringe",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 820,
      "content": "ESH.  \n\nYou:\n\n>that I helped save up for   \n>  \n>went ahead and...and sat on it\n\nYour wife:\n\n>she pointed to the back and told me to sit in there\n\nYou guys have much bigger problems than just this.",
      "id": 82,
      "comments": [
        {
          "score": 106,
          "content": "At least they aren’t fighting about him building an art studio!",
          "id": 83,
          "comments": [
            {
              "score": 108,
              "content": "Boo! Get new material!",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "HA!",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 0,
          "content": "Sorry but what does it means ESH? :D",
          "id": 86,
          "comments": [
            {
              "score": 7,
              "content": "key is in sidebar, ESH = Everyone Sucks here;",
              "id": 87,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "It means Everyone Sucks Here",
              "id": 88,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Everyone Sucks Here",
              "id": 89,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 453,
      "content": "Okay but why does she NEED immediate access to makeup while she’s driving? Is this what people are doing when they almost back into me in the parking lot?",
      "id": 90,
      "comments": [
        {
          "score": 107,
          "content": "No, the parking lot would be better, this is what a number of people are doing when they fail to notice the traffic light loop all the way through.",
          "id": 91,
          "comments": [
            {
              "score": 17,
              "content": "Am a commuter cyclist - I *wish* people were putting on makeup and texting at stoplights. That would be a massive improvement.",
              "id": 92,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 84,
          "content": "She didn't need immediate access -- she was pissed off about giving her husband a ride, so she invented some petty bullshit reason to force him into the backseat as a ridiculous power play.",
          "id": 93,
          "comments": [
            {
              "score": 4,
              "content": "Exactly!",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -2,
              "content": "Your story is a lot more farfetched than the one OP told.",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": "Maybe not the makeup, but I prefer to keep my bag in the front because there's my licence and car papers and money and so on. Even something as simple as tissues.\n\nAlso much less likely to forget the purse in the car, although I'm way to paranoid for that anyways. \n\nSo I do get that. \n\nBut I also don't force my BF to sit in the back. Likewise he doesn't have an issue placing it on his lap. That's an absolutely bizarre fight.",
          "id": 96,
          "comments": [
            {
              "score": 1,
              "content": "I'm the same way.  I want my purse close.  I'm not rummaging around for makeup but I might grab a tube of Chapstick at a stop light or need tissues.\n\nI also like having my license near by.  I guess that's habit from hitting some road block check points or growing up going on a military post and needing an id for that. Or having my wallet right there for when I do the drive thru.\n\nPlus, I like it in the front so that I can grab it quickly when I get out of the car.  BUT...I will absolutely put my car I the floor board behind me or the seat behind me if I have passengers.  A passenger's comfort is more important than having my purse right there.  It's good manners.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I watched someone rear end another car in traffic because she was literally **curling her damn hair**! People are ridiculous.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -3,
          "content": "Do you carry a separate bag for not so immediately essential stuff? Most people have one bag they carry their stuff in, that includes the phone, wallet or gum they might need anytime, but also... an backup pair of tights they might use once in a year.",
          "id": 99,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 319,
      "content": "I’d say ESH. Why didn’t you put her bag in the back seats anyway then sit in the passenger seat at the front. She probably still would have yelled but at least her stuff wouldn’t be broken. \n\nEqually, sounds like she’s being petty af.",
      "id": 100,
      "comments": [
        {
          "score": 18,
          "content": "Yeah, this is just childish all around. My husband keeps a messy car and usually we take my car (we have the same car, they’re 11 years apart in model years - he WFH or takes a train, he doesn’t drive much more than a 5 miles round trip when he does go out). When I get in his car I am usually greeted by empty water bottles and a pair of sneakers. I’ve never asked him to move them for me. I move them myself and often move these things back for him. \n\nWould I prefer he keep his car clean? Sure!  Do we fight about it and have a standoff about him moving things so I can sit? No, because we are adults.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "She sounds like she’s a terrible driver too. If she *needs* her makeup nearby while driving. Ooof. \n\n\n\nOP, what city you in so I can never visit. Don’t wanna cross paths with your entitled wife.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 250,
      "content": "ESH \n\nNo one came out of that looking good and neither of you acted like rational adults.",
      "id": 103,
      "comments": [
        {
          "score": 2,
          "content": "This exactly! ESH for sure!",
          "id": 104,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 138,
      "content": "ESH\n\nYou could have just moved it or held it on your lap instead of insisting she be the one to move it. \n\nShe could have moved it instead of trying to make you sit in the back because her bag is more important. \n\nAlso, you have bigger issues to deal with in your relationship if this is how you treat each other.",
      "id": 105,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 136,
      "content": "ESH do y'all even like each other? This literally sounded like two teenage siblings ugh",
      "id": 106,
      "comments": [
        {
          "score": 22,
          "content": "Even as teenagers, my brother and I woudn't fight over something so trivial. Music selection - yes, but bag on seat - hell na. If there is essentials in the bag (truly) just ask the other person to hold it. In my country, you need to pay cash when you exit any parking space, since they don't give women pockets, all my money is in my purse, you know what my bf does until we exit - he holds the bag then shoves it in the back when essentials aren't needed anymore.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I was thinking much younger siblings tbh.",
          "id": 108,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 65,
      "content": "YTA, immature and ridiculous. Here's an idea, sit down and put the bag in your lap. Talk about making a mountain out of a mole hill.",
      "id": 109,
      "comments": [
        {
          "score": 73,
          "content": "Yes? I didn't get why this wasn't his first thought? He wanted to be an asshole. However,  wife was an asshole, too, which is why they should hold equal asshole accountability in my book. ESH.",
          "id": 110,
          "comments": [
            {
              "score": 29,
              "content": "To be fair, she didn't tell him she could move the bag. She told him to sit in the back. Maybe some people have more tolerance, but I'm willing to bet that would piss off most people. And pissed off people don't always think rationally.",
              "id": 111,
              "comments": [
                {
                  "score": -2,
                  "content": "I think most people are capable of humbly accepting a favor.",
                  "id": 112,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I'd like to think most people would treat their SO with more consideration than they would a bag.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 46,
          "content": "Its fckng rude to tell a person especially your husband to sit in the back seat because you have \"essential\" on the front seat. You dont need lipstick to drive.",
          "id": 114,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "I sort agree with you. Just put the bag in your lap. The thing that bothers me though is why she needs access to stuff in her bag while driving. She should never put her hand in her bag while driving. In fact I always put my bag either on the floor or in the back so there is no temptation. I know of people that have died from doing something as simple as checking their radio and getting distracted. There should be no distractions",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "She could have picked it up and asked him to hold it, so not sure why he is the AH of the two.",
          "id": 116,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}