{
  "post content": "Last month my old neighbors moved out and some new ones moved in. A couple in their late twenties with four small children. The wife is a SAHM and the husband is a trucker. I went to introduce myself and bring them a pie right after they moved in. I didn’t really like their vibe but I’m a friendly person so I tried inviting the wife to things. \n\nOur neighborhood is small, a collection of ten houses. Everyone knows everyone and is generally pretty friendly. No one else has young kids though. It’s mostly couples with no kids, or older couples who’s kids moved out. I hang out with two of my female neighbors who are a similar age to my own (mid twenties). We go on walks, have lunch at each others houses, etc. I only work three days a week so I have a lot of free time. \n\nI invited the new neighbor, Molly, to two different things. Lunch at my house and also a walk/hike me and the others were going on. Both time she just assumed she could bring her kids and showed up to my house with them. I turned her away from lunch at my house because I don’t want four rowdy kids under the age of six in my not childproof house. She was upset because she has no one who can ever watch them, and she can’t come without them. She did bring them on a walk with us but we couldn’t go in the forest because of her stroller so it kind of ruined things for us. There’s no trees or shade in the neighborhood and the summer heat makes it awful, the forest is much better.\n\nSince then I’ve been avoiding Molly like the plague, I just don’t want to be her friend. She’s invited me over, asked to come over and bring her kids, she even asked me to watch her kids the other day so she can have a break. I barely know the woman and I feel like her behavior is pretty inappropriate and she’s maybe just not picking up on social cues. \n\nToday me and my other neighbors went for a walk in the forest, and she saw us go. She texted me to ask why she wasn’t invited, and I said it’s because we don’t want our plans to be altered by her children, and she’s expressed that she can’t do anything without her children. She went on a rant about how it takes a village and we don’t understand what it’s like, and she called us all assholes. \n\nI agree with her that I don’t understand what it’s like, because I would personally never choose to have four kids with an absent husband. I just feel like she’s being unreasonable to expect us to have a bad time just so she can have a good time. Her kids were super annoying and hard to deal with. My husband thinks she’s an asshole but my mom thinks I should be more sympathetic. \n\nAITA for excluding my neighbor from activities?\n\nEdit: ok since you guys wanted me to add it, I’ll add it. I asked molly if she had any food allergies and if she was okay with salmon and quinoa for lunch. She had the opportunity to mention she wanted to bring her kids and chose not to take it. I did not make enough food to feed her four kids, because I had no clue she planned on bringing them. I only made food for 4, not 8. Also, when we went on a walk the original plan was to walk in the forest. But at last minute she unilaterally decided we as a group should change our plans and walk the neighborhood instead because her stroller can’t go in the forest. \n\nShe also said “you’re all a bunch of bitches for not making things easier on a mom” so yeah, bridge burned. Sucks to suck Molly.\n\nEdit 2: it’s like some or y’all have never heard of a babysitter before. Or declining plans you’re invited to.",
  "id": 1,
  "comments": [
    {
      "score": 14134,
      "content": "BLUF: Both you are assholes \n\nYou: Now, you clearly saw that the woman had 4 young kids and the husband is a truck driver. When you invite her to go places where tf else would the kids be? Come on now. \n\nMolly: she wasn’t an asshole until the whole watch my kids thing and it takes a village. That’s foolish when you don’t even know the people watching your kids. \n\nBack to you. That snippy shit about having kids with an absent father is stupid and unnecessary. Y’all (you and the mean girls club) have every right to not kick it with the lady, but being mad that her kids come along is hella stupid.\n\nEDIT - ESH, Everyone Sucks Here.",
      "id": 2,
      "comments": [
        {
          "score": 3620,
          "content": "I believe the judgement you're looking for is ESH: Everyone Sucks Here. The algorithm isn't going to understand your made-up BLUF or whatever it is if you end up as the top judgement, so you may want to edit that.",
          "id": 3,
          "comments": [
            {
              "score": 1693,
              "content": "It is not made up. It is a more professional TLDR. It stands for bottom line up front. Military use it for simplying long directive emails to just get the main points across. FYSA.",
              "id": 4,
              "comments": [
                {
                  "score": 2675,
                  "content": "All acronyms are made up.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1443,
                      "content": "Also all of the words",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 44,
                      "content": "AAAMU if you will",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "We're not playing bleeding pictionary. It's a made up game!",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 421,
                  "content": "I have never heard of BLUF.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 186,
                      "content": "it means \"bottom line up front\", according to google when you search BLUF acronym meaning.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "We use it in particularly detailed work emails and documents. It's very handy.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I’ve never heard it in the military before either but we have so many acronyms that I can’t really trust my memory on that.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 287,
                  "content": "It's military. Doesn't necessarily means it's professional speak.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 131,
                      "content": "Are you saying that speaking to new team members like recruits in bootcamp might not be professional? How dare you? \n\n</s>",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 229,
                  "content": "I didn't mean it as an insult, I mean made-up in the context of this specific sub . . . if you look at the FAQ, there are only a limited number of very specific acronyms that can be used to render judgement in the sub that the algorithm will actually read and understand. My apologies for any misunderstanding (I have a communications disorder and struggle a bit sometimes with being clear but not overly blunt). I was legitimately trying to be helpful, not an AH, I promise.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 33,
                      "content": "I understood your meaning and took no offense. I'm military, and I knew exactly what the other person was saying. Sometimes, military forgets our acronyms don't translate into the rest of the world. Knowledge all around!",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 155,
                  "content": "This isn’t the military. Use the correct acronym if you want to be understood",
                  "id": 17,
                  "comments": [
                    {
                      "score": 4,
                      "content": "To be fair though a lot of military acronyms do get into civvy life, like ASAP, STAT and SNAFU.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 110,
                  "content": "What the hell is FYSA?",
                  "id": 19,
                  "comments": [
                    {
                      "score": 88,
                      "content": "For your situational awareness.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Florida Youth Soccer Association",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Is that similar to TL;DR?",
                  "id": 22,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "How is that more professional? Is it because of widespread business usage? Is it because its pronunciation rolls so cleanly off the tongue? The way it looks? Or just that “military use it”?",
                  "id": 23,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": ">FYSA.\n\nWhat does the Florida Youth Soccer Association have to do with this?",
                  "id": 24,
                  "comments": [
                    {
                      "score": 3,
                      "content": "That one got a chuckle out of me!",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "I don't know what FYSA means, and I'm not going to look it up. In my head it means For Your Stupid Ass and it's going to stay that way.",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Lol, it’s not made up because you don’t understand it.",
              "id": 27,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1598,
          "content": ">When you invite her to go places where tf else would the kids be? Come on now\n\nAt a daycare? With the grandparents? Maybe a babysitter? \n\nYou act like single mothers can never go out on their own without their kids.",
          "id": 28,
          "comments": [
            {
              "score": 857,
              "content": "Many SAHM stay home because they can’t afford daycare. And in lots of areas, there’s over a year wait to get into daycare or even preschool. The new neighbor just moved in so maybe they don’t have any friends or family to watch their children around. \n\nI wonder how much notice the OP is giving that these events are happening. Also their communication seems to suck if they don’t explicitly say “children aren’t invited” and then act surprised when someone brings their kids with them. They both could have handled it better.",
              "id": 29,
              "comments": [
                {
                  "score": 890,
                  "content": "No, the default unless OP says bring your kids are that children aren't invited. OP in no way should have to specify that.\n\nIf the neighbor has no one to watch her kids, and they aren't in daycare, then she should decline the invitation instead of just assuming it's okay to bring them with her.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 1153,
                      "content": "From the variation in the replies to this, it would seem like perhaps there is not a universal default, and when interacting with a new person it's probably a good idea to clarify so you don't wind up having to post on Reddit asking if you suck.",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 464,
                      "content": "I agree. I have three kids and have been a SAHM for years, when I am invited somewhere I always assume my kids aren’t invited and make arrangements accordingly. I actually went to a birthday party recently without my kids only to have the host be surprised because he had assumed I’d bring them (and I ended up going and getting them).",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 115,
                      "content": "Eh I've made new friends that don't have kids. I do. They know that I've they invite me kids come especially if it's a walk or lunch time. If they don't want kids then they say that. But luckily they are wonderful and love my kiddos and kids are always implied with them. Granted I've known them longer then a few weeks and have talked to them without kids. Both women could have communicated better what was expected.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "This is the way.  I have one friend who has 3 kids and now a grandkid.  If she needs to bring one of the offspring, she asks up front if it's ok w/me.  I always say yes, bc her kids have been raised right and know how to behave appropriately in public.  If I have something to talk about that's inappropriate for kid ears, I make a different date w/her.\n\nPeople w/ kids just assuming their children are welcome wherever THEY are, are entitled jerks.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Or just… say, “hey is it cool if my kids come with I can pack them a lunch/they can play in the yard/whatever,”  there’s room between never going to anything and bringing four extra people uninvited :/ honestly I’m not sure why OP found it to be overstepping when Molly invited her to lunch at her home- that seems like the logical step of want to have lunch with someone -> no childcare -> invite them over tbh, but maybe OP just decided that the bridges were already burned before that’s mentioned in the post?",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I’m not sure this is the default tbf",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "It's the reverse for my area, if you invite a mom with kids, it's expected that the kids will come along too. The mothers will chat and have tea while the kids wreak havoc in the garden.",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 423,
                  "content": "I mean the invitation thing to me is pretty close. They both assumed something about what the other person thought that just wasn't true. To me that's just miscommunication.\n\nEverything else though the SAHM is the AH. She's trying to railroad their plans and get neighbors to sign on to help her. Would it be nice for OP to give a hand? Of course! That doesn't make her an asshole for not wanting to help especially if she isn't interested in kids.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 289,
                      "content": "I actually find ESH to be appropriate. I take the lunch thing as a full misunderstanding, but after that the walk with kids along was on OP, as she knew by this point. Also, she could easily communicate “we would love to do things with you without the kids when you have time and want to be with just adults!” from that point on. \n\nNeighbor is also TA for assuming others she doesn’t know are obligated to help raise your kids. I would also never assume my kid is invited unless I ask or it is expressed. The “village” does not mean every person you come in contact with. I could see calling a new neighbor if there is an emergency and you don’t have other options, but not when “I need a break” unless that person has offered on their own. \n\nIt’s a combo of means girls and an entitled lady. Clash of the titans.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I don’t think OP miscommunicated. She invited the neighbor. Not the kids. She didn’t say something like can you and the kids come to lunch? \nThe neighbor made a bad assumption.",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 305,
                  "content": "As a former SAHM this take is really naive. Yes, when you first move to a new neighbourhood/town it can take some time to establish a support system and that learning curve sucks but also why didn’t she (and her husband) consider this when they were deciding where to live? She doesn’t work, he works a (fairly) mobile position where they actually have a decent amount of freedom when deciding where to plant their roots. Lots of families don’t have that kind of freedom. I didn’t when we moved. I lived in a community fairly similar to this one with either very young CF people and retirees but eventually managed to make friends in some other close neighbourhoods by attending child friendly local events and joining some FB groups. \n\nAdditionally, while you’re establishing that new local support system (or I guess as this mom called it “village”) maybe…idk…be transparent and nice to people instead of throwing an entitled sounding strop and demanding that every activity be accommodated to you? It’s not the end of the world if you have to miss out on a few things. Regardless of how big your support system is, it’s still gonna happen. Immediately imposing and acting like an established community needs to revolve around you is really…well honestly it’s almost rude. \n\n“Gee thanks I’d really love to come but I don’t have anyone to watch the kids that day/that sounds too difficult to do with children/I know your house probably isn’t childproof and I don’t want an accident to occur. Maybe we could make different plans for another day though? I could host coffee at my place? And you guys have fun doing this activity!“\n\nSee? Not hard.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 105,
                      "content": "As a SAHM, you put your effort into making a \"village\" of other people with kids. Then the kids *are* invited.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "This comment needs to be higher.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 145,
                  "content": "Day care 5 days a week all month long in my area costs more than my mortgage",
                  "id": 44,
                  "comments": [
                    {
                      "score": 42,
                      "content": "Me too and it's only for 1 kid. I can't imagine paying daycare for 4!!  I'm mostly SAHM now because of the cost.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Yep! It is shocking, and then people wonder why so many people aren’t having kids! Who can afford them? I have one, I’m lucky that I can stay home with her and her grandparents are nearby to watch her too. If I needed to pay for childcare I wouldn’t have had a child!",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "In a group where no one has kids, why would anyone assume that her kids are invited? That is not the status quo so NTA. Also, I think it’s always a bit rude to assume an invitation. If someone invites me to an event, it’s not like I automatically assume my husband is being invited and take him along. \n\nThe whole “village” thing is really none of your problem lol. She chose to have the kids; you had no role in that. She has the right to feel overwhelmed and want help, but is definitely not entitled to it. I have kids and certainly don’t feel like people owe it to me to take care of them (other than my husband lol).",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I have three kids and not in a million years would i assume I could bring them if I was invited to lunch with a neighbor. I would have said “I really want to come and get to know you all better but I have no one to watch the kids” if the host doesn’t say “oh bring them” that’s that. I even asked about my 15 year old son for a one year olds bday when he wasn’t on the e-vite, and it was actually my in-laws so his baby cousin.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "\"No children\" isn't part of the standard invitation bc no one else in the group has small children.\n\nIf Molly got the same amount of notice as everyone else, it's her problem to figure out how to  make it work. If she got shorter notice it cd be that adding her to the invite group hadn't become habit yet.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Maybe they should have thought about that before having 4 kids....\n\nLike I'm not saying not to have kids but when it gets to a point where you have to be around them 24/7 and have no time for adult outings/alone time then that's not a sustainable or healthy environment.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Best thing if you're not sure if the kids are invited is to just ask, not assume. Or if you don't feel comfortable asking, say \"not sure if I can make it, need to see if I can sort something out for the kids and then I'll get back to you\". They'll say \"ok let me know\", meaning kids weren't invited, or \"don't be silly bring them along\" which means they are.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Ewww. It's not up to OP to say that kids aren't invited. It's upto the neighbour to ask if she can bring her kids. Imagine just showing up with a bunch of children and expecting everyone to be okay with it. Good Lord. \nParents with levels of entitlement as high as yours are awful.",
                  "id": 52,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 334,
              "content": "Most SAHM literally don’t have other childcare. I was a SAHM for years- my kids had to go EVERYWHERE with me. I had no childcare because we had no family in town and anyone who might babysit worked during the day. That’s the reality for most families.",
              "id": 53,
              "comments": [
                {
                  "score": 262,
                  "content": "Then she should have declined the invite.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 320,
                      "content": "Molly should have just ASKED if she could bring her kids. And then declined if the answer is no. \n\nThere's just a difference in starting assumptions here based on a sort of cultural difference. To parents of young children, especially SAHPs, the default assumption is \"anywhere I go, my kids will go.\" Among other young parents, that'll be a shared assumption--to me, my friend with a newborn is obviously going to bring her newborn if I ask her to come over. To other folks, the default is \"if I invite you, only you are invited.\" \n\nNeither set of assumptions is right or wrong per se, but both parties (and especially Molly) should have clarified their assumptions before proceeding to hang out. OP can probably also stand to learn that other SAHPs will likely also assume invitations to family-friendly activities include their children unless told otherwise.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 139,
                  "content": "But you chose that.  These are people who are childfree.  They don't want to hang out with kids.  That's their choice.  We all get to choose what we do.  Freedom!",
                  "id": 56,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "I'm in the same situation. I would never assume my child is invited especially if the other people don't have children. I would just say that I'd like to come but I don't have anyone to watch my daughter. That leaves it open for them to say \"That's too bad.\" Or to invite my daughter. There's things I have to miss out on sometimes. I knew that before I became a parent and accepted it. I chose to be a SAHM.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 127,
              "content": "Why would a SAHM put her child in a daycare?",
              "id": 58,
              "comments": [
                {
                  "score": 231,
                  "content": "2 reasons, 1 so that the parent can actually have a break, which is good for their physical and mental health, and also so that the child or children can develop social skills which will actually help them alot once elementary comes into play.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 207,
                      "content": "Most families probably could not afford daycare costs for 4 kids, even part-time.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 201,
                      "content": "Lol for 4 kids that’s around $3000-4000 a month. Redditors that say this shit seriously crack me up. JuSt gEt DaYcArE. Jesus fucking Christ, maybe look up the average costs of shit before commenting.",
                      "id": 61,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 49,
                      "content": "It’s 4 kids, they develop social skills don’t worry.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Part of the benefit of being a SAHM is you can schedule playdates, no kid needs daycare to develop social skills, and most SAHMs of 4 kids cant afford that anyways!",
                      "id": 63,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "4 kids under 6 in daycare costs about $7000/month, where I am ($1800-2400 per month for infants; $1200-1700 per month for 3 and up). That's not gonna be a realistic option for most.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I was a SAHM. My boys were not behind socially at all. That just isn’t true. Even if a child is behind when they start school, they are caught up by second grade ( unless the child has other things going on like autism). Where I live, there are Mothers Day Out programs but you can’t just drop your kid off once or twice a month. It’s three days a week. I have never seen a daycare that you can drop your kids off when you need a break. You pay for the entire week whether your kid goes or not. It’s not as easy as you try to make it seem.",
                      "id": 65,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 99,
              "content": "You really must think that every parent happens to live in a town that their parents (the grandparents) live in, which is often not the case or that they would even be which is also not always the case. And do you have any idea how daycares work or how expensive they are???",
              "id": 66,
              "comments": [
                {
                  "score": 167,
                  "content": "I don't think that. \n\nBut what I do think is if this person is unable to find care for her kids, then she should have have declined OPs invitation, not bring her kids along anyway.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 43,
                      "content": "She should have just asked if she could bring her kids. I don't think she was wrong for thinking the invite might have been meant to include her kids, but she should have checked, not assumed.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "It's a cultural clash. They both assumed wrong and it blew up in their faces. The area I live in, it is expected that the mothers bring their kids along because there isn't anyone else in the house to take care of the kids unless you want to court a child neglect charge.\n\nSo basically it was someone with a different cultural assumption being tossed into an area and the differences blindsided her. I bet that she did not even THINK to ask because it is a cultural blindspot for many of us. To be really fair and honest, I would have been caught off guard by that as well.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "I think the point isn't that she *should* do any of those things, but that OP isn't crazy for assuming one of these things may be the case. The person they're replying to is phrasing it as if there's no other possibility for where the kids are than at home, so OP should have assumed she was inviting all of them by inviting one person. This person is saying that there are multiple possibilities, so OP isn't way out-of-pocket assuming that she prevailed herself of one of these possibilities.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Right, and this is a great reason to turn down an invitation or ask whether you can bring your kids. You can’t just go into a group of people with no kids and expect them to automatically accommodate your kids. It would be nice if they did, but this is an established friend group. You don’t have a right to attend all events with your children.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "[deleted]",
              "id": 72,
              "comments": [
                {
                  "score": 5,
                  "content": "Times four. That would cost a small fortune.",
                  "id": 73,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Tbh I would be peeved if someone invited me to something and assumed I would bring my kid. So many people assume that the second you push out a kid you're mom. Nothing else.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Right?! Op reached out to include the lady but if you know none else there has children it’s pretty presumptuous to just bring your kids. She could have asked if the kids were okay or mentioned she didn’t have a sitter. \n\nI’m going with NTA.  You reached out and invited her. Maybe the first time was an honest mistake- everyone gets a mulligan but after that it should be clear to her that an invite for her does not automatically include the kids.\n\nHer insisting you guys change your walk was an ah move as if you’re invited for something you don’t get to alter the plans you can either go or you can’t.\n\nHer ‘it takes a village’ crap and asking someone she doesn’t even really know or has had much interaction with to babysit was the final straw for me.\n\nIt takes a village is what people who don’t want to actually deal with their own kids say. It doesn’t take a village- it takes a competent parent and a lot of logistical planning and yes personal sacrifices.\n\nYour children are your responsibility.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Yes. And any person that is coming as a group of 5 needs to check that a group of 5 is invited.",
              "id": 76,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "The neighbourhood is only 10 houses, I wonder if there are many childcare facilities that are affordable and can take 4 kids at short notice",
              "id": 77,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Babysitter? That what my single mom did when I wasn’t welcome.",
              "id": 78,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 679,
          "content": "[deleted]",
          "id": 79,
          "comments": [
            {
              "score": 466,
              "content": "It also means give and take. It means putting in the effort to build your network. Not moving into a community you know nothing about and immediately start demanding that everyone change the way they do things to accommodate your needs.",
              "id": 80,
              "comments": [
                {
                  "score": 135,
                  "content": "Yup. Molly is the type who would have never lifted a finger for other people's sake before she had her children.\n\nOh but when she needs the help everyone else must give it huh? Lol.",
                  "id": 81,
                  "comments": [
                    {
                      "score": 18,
                      "content": "That is a big assumption.",
                      "id": 82,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Never take molly anywhere",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "What made you come to that conclusion? Is there any info in the OP about what Molly was like before having kids that I missed? Or are you just guessing and coming to conclusions that you would like to be true?",
                      "id": 84,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 181,
              "content": "Its not their neighbors fault they chose to have a litter of kids.",
              "id": 85,
              "comments": [
                {
                  "score": 9,
                  "content": "Amen to that. That's a choice, to have 4 (!) children. I kinda can get it, one can not know what it means to have a child (although that is a readily available information, what kind of sacrifices and how it changes the life), but four? C'mon.",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "Also everyone in the village helps each other. Most of the time when I hear parents complaining about the village not helping them, they are not and have no plans to be of any help to anyone else.",
              "id": 87,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "Well, theoretically, in a Village your  neighbors would be your friends and family.",
              "id": 88,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Also it means you give as much as you take, which Molly is not dojng",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yes! I remember, back in the 90's when \"It takes a village\" really started gaining traction in the media. Something family and friends have been doing *VOLUNTARILY*  forever became a catchphrase for guilting people, by association, or f'ing geography, into watching or supporting people who elect to have more kids than they can handle!",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "No, the point of the whole story is specifically about the days when we knew all of our neighbors and about front porches where the neighbors sat and watched all of the neighborhood kids playing and all felt free to help or to discipline each other’s kids. The village consists of all of these people plus family and friends.",
              "id": 91,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Especially not people who very clearly do not want to be a part of that.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 133,
          "content": "Lol not heard of bluf before\n\nJust so you know as top comment ESH (everyone sucks here) is the acronym the sub uses. \n\nAgree with everything you said!",
          "id": 93,
          "comments": [
            {
              "score": 85,
              "content": "I think of ESH as Equal Shared Holery, lol",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "My bad and thank you for letting me know the sub’s practices. I didn’t know that. \n\nAn BLUF stands for Bottom Line Up Front.",
              "id": 95,
              "comments": [
                {
                  "score": 39,
                  "content": "Haven't heard of that expression before. Thanks for letting me know. Didn't want to be pedantic, but i don't think the comment gets counted without the judgement  in case you wanted one of the flairs",
                  "id": 96,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 102,
          "content": "If you want to join an adult event, you find a sitter.\n\nI’m not accommodating 4 kids.",
          "id": 97,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 87,
          "content": "> You: Now, you clearly saw that the woman had 4 young kids and the husband is a truck driver. When you invite her to go places where tf else would the kids be? Come on now.\n\nMaybe the dad is home? Is she supposed to have the neighbor’s husband’s work schedule memorized?",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "OP is NTA she got snippy after her neighbor just assumed she would be good with 4 kids running around all the time. Where would the kids be? Gee idk maybe a babysitter for a few hours? It's not difficult.",
          "id": 99,
          "comments": [
            {
              "score": 11,
              "content": "It’s not difficult to get a sitter on a random day for 4 kids?",
              "id": 100,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "This is BS. None of the other women have kids around so the assumption would be that kids are not invited. It’s polite to invite her and it’s on Molly to ask if kids are welcome and decline if she can’t get someone to watch them. She knew the plan was to walk in the woods and then demanded the plan be changed for her. So now the group has to forgo their adult get togethers to accommodate a bunch of kids they don’t want to be around or be called AH every time they don’t invite her?",
          "id": 101,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "nononono\n\nMolly sucks much bigger\n\nAnd she started it",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I thing the mom is TA. OP is in her early 20s and doesn’t seem to have much experience with kids. I understand why she didn’t expect the mom to bring her kids to that initial lunch. I also understand why the mom expected that her kids were invited to that initial lunch. After that, though? Mom should have asked about bringing kids to stuff after that. Mom is not entitled to help from her neighbors. Having kids means you won’t always get do what you want. If she’s burned out or needs more connection, she should take her kids to the library or check online for parent groups (some are grouped by age, which is amazing).",
          "id": 103,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5567,
      "content": "NTA you don’t have to be friends with someone you don’t want to. You don’t even need to have a reason. You’re not an AH for not wanting to be around screaming kids all the time, and from experience if you invite a mom with multiple kids chances are they’re gonna expect some help, why should you be forced to? She is acting like she’s entitled to ur time and company but she isn’t, being a neighbor doesn’t equal having to be friends.  Idk why people are being ridiculous, they’re trying to get you to be friends with a person that you do not enjoy being around, you and ur friends in the neighborhood had a schedule and just because she moved in that doesn’t mean your life’s now have to shift to accommodate her. If you don’t want to be friends with someone, then ppl telling you to are TA for trying to force a relationship you don’t want.",
      "id": 104,
      "comments": [
        {
          "score": 1699,
          "content": "So glad to see this comment because it was my take as well. OP and the neighbor are in different stages of life and that is ok. OP doesn’t have to befriend someone she doesn’t have much, if anything, in common with. \nThe neighbor was rude to assume her kids were included in the invitation. She should have asked for clarification on that. It makes sense that OP, not having children, would not have expected them to come *especially* if they are noisy and rowdy, as I expect kids under age ten to be. \nOP was neighborly, in bringing the pie. And she made an effort at being friendly. It didn’t work out. She is not obligated to her neighbor in any way to provide friendship and certainly not childcare. \nBeing a single parent of three children with an absentee father I can absolutely sympathize with the neighbor for wanting friends and wanting a break, but she needs to work that out on her own.",
          "id": 105,
          "comments": [
            {
              "score": 501,
              "content": "It wasn't necessarily rude to assume the invitation included her kids. Different groups just have different norms. The neighbor might have just moved from a neighborhood where people share parenting and bringing your kids is so expected that you'd be surprised if she showed up without them.\n\nIt was shitty of the new neighbor to expect the rest of the \"village\" to help parent her kids, and to insult OP for not doing so. But a little compassion would probably make everyone happier. This woman finds herself in a new place, knowing no one, stuck at home with only her kids for company. She's probably lonely, miserable, regretting choosing this neighborhood, but trapped here for the foreseeable future. OP is NTA, but it wouldn't kill her to be a bit more kind.",
              "id": 106,
              "comments": [
                {
                  "score": 582,
                  "content": "Im sure you’re right about the neighbor and how she is feeling. As a person who absolutely does not like other people’s children, though, I sympathize with the OP. I find them exhausting.",
                  "id": 107,
                  "comments": [
                    {
                      "score": 262,
                      "content": "I too can relate with not liking other people’s kids. (I was actually given this book called [ I hate other people’s kids](https://www.amazon.com/I-Hate-Other-Peoples-Kids/dp/1416909885) as a joke)  The neighbor should find like a parents meetup group or something. Enroll the kids (that are old enough) in some sort of activity etc. make friends that way.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "As a mom of only one well-behaved little one I would still never assume I could bring her anywhere, especially not to a child free home. It was presumptive and rude to show up without having arranged childcare.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 304,
                  "content": "She brought them a pie and invited her to two outings… idk that sounds pretty kind to me?",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 208,
                  "content": "Molly has already shown OP that she expects to be catered to simply for being a parent, she's the type to get an inch and take a mile. She certainly wasn't being kind when she called OP a bitch.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I do find it funny that there's entitled people that believe because someone didn't pull out, it's somehow everyone else's problem too.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 169,
                  "content": ">OP was neighborly, in bringing the pie. And she made an effort at being friendly. It didn’t work out. She is not obligated to her neighbor in any way to provide friendship and certainly not child\n\nI do think the neighbor was very rude for a simple reason. When you have that many kids, bringing them along with you significantly increases the headcount of a gathering. If someone is inviting you over for a meal and has taken the time to ask about restrictions with food, you should let them know you come with \\*four more mouths for them to feed\\* that's budgeting the neighbor is used to, OP isn't.  Not giving notice is incredibly inconsiderate.\n\nOP has been plenty kind. Her kindness has been met with entitlement and pushiness from a neighbor who seems to think people that barely know her owe her. Extending yourself for someone like that is just an invitation to be treated like a doormat. Where is the neighbor's compassion for OP?",
                  "id": 113,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Not just that, but I'm stuck on this:\n\nOP was making *salmon* for lunch for everyone- which was *already* four people I think.\n\nSalmon is quite expensive compared to most lunch options, particularly the best kind that's never frozen. It's a lot to shell out to feed a pile of kids under six you never even met. I never met a little kid who even liked salmon enough to justify the cost when they are much happier eating far cheaper, just as healthy options. \n\nAre there entitled people out there really expecting someone you just met to feed thier small army of kids expensive fish without even a word you are bringing them?? Or checking to make sure they even *like* salmon so it's not wasted?? That's something you don't make much extra of, particularly four extra portions. Fish doesn't make good leftovers! Particularly salmon!\n\nThis lady straight-up assumed OP was cool shelling out *double* just to feed a bunch of little kids salmon. OP asked her about allergies and TOLD her she was making salmon, so I think she completely assumed OP would just be cool doubling her expensive meal headcount and cost for expensive fish!",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Probably an oversight. The area I'm from, it's assumed that inviting a mom with kids also means inviting the kids. This is probably because the area I'm living in has lots of moms and they like to gather together and network. Her neighbour probably came from some place similar and the lack of families with kids in the new area meant that there were different standards and it caught her by surprise.\n\nCould have been handled better by all parties involved. I see it as a cultural clash caused by moving from a high kids area to an area with few kids. A mess for all involved.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 153,
                  "content": "This. How much is this lady paying the \"village\" to babysit?",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 119,
                  "content": "I feel like it was kind to try and include her. Even if Mollys assumptions were understandable based on prior experience, it’s been made clear that is not the norm and doesn’t work for everyone in this scenario and rather than accept that she’s being entitled and demanding. I also cannot stand people who misuse the phrase “it takes a village”. Your spawn, your responsibility. That phrase is supposed to reflect gratitude for the people in your life who are willing to volunteer to help you with your kids or other parents who mutually help each other. It is not an entitlement and it certainly doesn’t obligate the world to participate in raising your kids.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 58,
                  "content": "If the invitation said, you can join us, and not you and your kids… then it was rude to assume 4 kids were invited to a childfree women lunch.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "I’d argue it’s actually pretty rude to assume that being invited for lunch comes with a plus 4. I don’t even assume I can bring a friend or my partner along to everywhere I’m invited without clarifying. When I invite someone over for a meal I’m planning to feed one extra mouth, not an entire extra family.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "It also wouldn't kill the neighbor to rein in her reactions to allow space for kindness and compassion.\n\nI wouldn't be too excited to extend an olive branch to someone who called me an asshole and a bitch (see OPs edit) because I declined to accommodate them.",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "It wouldn't kill her but it would make her life unnecessary harder, just because her neighbor decided to have 4 kids with a man who is barely home and also to move into a village.\n\nIt was her choice, so no, this isn't OPs problem and she doesn't need to be more then polite. She doesn't need to invite her for the group activities.\n\nAnd also: who the fuck give the own child someone who they met 2 times?",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 90,
              "content": "I don’t think it’s fair of OP to categorize the husband as absentee. If she’s a SAHM for four kids, wouldn’t one presume he’s, you know, *working* rather than shirking his family obligations?",
              "id": 122,
              "comments": [
                {
                  "score": 113,
                  "content": "OP says he is a truck driver so he is indeed working. My use of absentee in that sentence refers to the father of my children, not the neighbor’s  husband.\n\nI read OP’s use of absent as “not home much” vs. “not in the home at all,” but she doesn’t tell us what kind of truck driver he is. Some are home daily, some are long-haul, some are somewhere in-between.",
                  "id": 123,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I’m glad you’ve said this. For starters, some people just don’t like kids, and as OP stated, it seems these kids are difficult. I know people have said well maybe the neighbour assumed the kids would be invited because she came from a neighbourhood where that was the norm. But if the 3 other people attending lunch didn’t have kids, surely you’d assume it was a no kids affair? And not to mention the insults!! Of course OP wouldn’t want to be friends/hang out with someone who’s flown off the handle like that over pretty small things? And quite frankly, everyone in this situation is an adult, of course OP can decide not to be friends with someone when they don’t enjoy their company, especially when they’ve gone out of their way to be difficult.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 274,
          "content": "Making the choice to have kids also means you're choosing to be excluded from places and events that aren't kid friendly. Also not being able to find a babysitter is nobody else's problem but yours. NTA.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 122,
          "content": "When I had a young kid, I hung out with folks who had young kids.  She needs to go to the park or the pool or the library and meet the other moms in town.",
          "id": 126,
          "comments": [
            {
              "score": 4,
              "content": "Agreed. This reads like a clash between people who don't like kids and a mom with a brood in tow. Wrong dynamics all around.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 116,
          "content": "Thank you. Whatever the fuck that BLUF above was they clearly missed the point. As if adults without kids had to alter their lives for moms that have kids.",
          "id": 128,
          "comments": [
            {
              "score": 9,
              "content": "Yeah, very strange take to suggest OP sucks for not reading Molly's mind and knowing she intended to bring her children to events they weren't invited to while also acknowledging that Molly should have asked first. If Molly should have asked first then how does OP suck for behaving like someone who was not asked first???",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Yes they do! If I saw a family with a herd of kids on the sidewalk, I'd move to the side and not just ram right through them! lol.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "Agree. Mom of three here, NTA. Any parent with any sense of self awareness knows that socializing with kids changes things. And, expecting new neighbors and people you don't even know to accommodate you, is just too much. Yes, you can ask. And yes, it's OK when people say 'no.' End of story.",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Parents get SO butthurt when childless people don’t want to hang out with their kids",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "OK! I have an older child (early teens) who is very friendly with my friends and quite capable at holding her own in a conversation amongst adults. I still never assume that any outings we plan will include kids. Even given her ability to hold a conversation, sometimes we don't wanna be around kids for a little bit and that's totally OK. She's my responsibility, not anyone else's.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4152,
      "content": "The Y ta votes are blowing my mind. If someone invites you to their house or an activity or something you can’t just bring as many other people as you want. Op invited one person to lunch. Molly brought five people total and expected op to accommodate her. What if op didn’t have enough food to feed an extra four people? And to top it off, Molly called op names for not inviting her to things. I wouldn’t want to be mollys friend either. NTA",
      "id": 134,
      "comments": [
        {
          "score": 1641,
          "content": "I made salmon and quinoa for lunch anyways. And I definitely didn’t make enough for her kids. So yeah, that’s also a factor. I had no idea that she even planned on bringing them, she gave me no notice",
          "id": 135,
          "comments": [
            {
              "score": 332,
              "content": "Just so you know, eating lunch and hiking are not considered adult only events to most people.",
              "id": 136,
              "comments": [
                {
                  "score": 1861,
                  "content": "The forest by our house is a rough trail. It absolutely cannot accommodate a double stroller made for sidewalks, which is what she has. My house has a lot of glass breakables, and lunch was salmon and quinoa and mojitos. I wouldn’t consider either of those to be particularly child friendly activities.",
                  "id": 137,
                  "comments": [
                    {
                      "score": 251,
                      "content": "Did you invite her to lunch for salmon and mojitos, or did you invite your neighbour over for lunch? Did you invite her to walk a hard trail in the wood, or just to go for a walk?\n\nThat you knew what you meant doesn't mean she did. \n\nYou could have said sorry, it's not a kids thing but happy to have you if you can get a babysitter, you could even offer names/recommendations because most people have an idea who locally is trusted to watch kids/needs some extra cash.\n\nInstead you kinda trapped her and also seemed to judge her immediately. You didn't like her vibe, invited her over and turned her away at the door. She's alone in a new house and thought people were reaching out. \n\nESH, she's expecting too much but you could have been way more clear and been more understanding.",
                      "id": 138,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 102,
                      "content": "Shit, I’ll come be your neighbor. I don’t have kids and I love hikes and mojitos.",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 45,
                      "content": "I belong to a walking/hiking group.  We have one member who brings her small child in a stroller that is made for off-roading.  As long as we stay on trails, she and the stroller have no problem keeping up.  Now, if she had a couple walking toddlers/small children, that would be different.  Your neighbor has to make friends with other parents with small kids.",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 121,
                  "content": "Either way. OP should not be forced to have people she didn’t plan on inviting. She shouldn’t have to accommodate other people’s kids.",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 79,
                  "content": "It's still 100% the responsibility of the parent to confirm that their kids are invited though.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Otoh, it's also kind of wild (at least to me) to assume that all four young kids are invited without that being made clear beforehand, especially as OP doesn't have any kids and Molly doesn't know OP's childproofing levels on her house.\n\nHiking, it depends on the trail. Tho after the lunch incident, OP probably should have mentioned that it's a rougher trail and can't do strollers/young kids might struggle with it.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Little kids and hiking are a terrible combination. Especially with four kids. That is straight up dangerous. I hope you don't have children.",
                  "id": 144,
                  "comments": [
                    {
                      "score": 7,
                      "content": "No way, my three kids (under 6) are great hikers and campers. Baby is in the hiking backpack, and the other two walk between my husband and I. We’ve done some incredible hikes. Lots of breaks to look at bugs and cool rocks, but we still cover a lot of distance.",
                      "id": 145,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "4 and we hike.  You know they make hiking backpacks and trails come in different difficulty levels?  The more you know….",
                      "id": 146,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Actually, even if the other adults do have kids you shouldn’t just assume you can bring your kids. I’m sure my friends with kids check when something is planned if everybody is bringing their kids or if it’s an adult thing.",
                  "id": 147,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "I would never assume someone who doesn’t have kids has a house set up for four young, unruly children to just randomly show up. I wouldn’t ever assume when I receive and invite that it’s implied I can bring anyone besides myself. Even when I get invited to a BBQ, I still ask the host if it’s okay I bring my partner who I LIVE with. AND I bring something to the host as well.",
                  "id": 148,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 64,
              "content": "Y T A for liking quinoa.\n \nJK. Can't really stand the texture of it for some reason myself, though.",
              "id": 149,
              "comments": [
                {
                  "score": 146,
                  "content": "One of my friends/neighbors likes it a lot and I made it mostly to please her tbh. I tolerate it. The salmon was good and I ate more of that",
                  "id": 150,
                  "comments": [
                    {
                      "score": 15,
                      "content": "just goes to show you’re willing to make reasonable accommodations",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "My friend (A) did this to our other friend (B). B invited myself, A and her two young children for lunch. A shows up with her kids and her 4 much younger siblings. B did not have enough food and A gets mad saying she’s not going to exclude her brothers and sisters. A and B do not remain friends. NTA.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Turning them away at the lunch was zhe only r\nRsponsible option if your home is not in amy way set up to accomodate children.\nIf someone wanted to bring multiple little kids to my home right now I wouldnt allow it. Just eithin my  current line of sight I can see 6 serious child hazards.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "On the other hand she probably didn't think you would go high tier food for neighbood hangouts.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "Exactly. Nobody would be on the neighbor's side if she showed up to lunch with four adults.",
          "id": 155,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "It makes me think of The Real Bros of Simi Valley— you don’t just show up to a kickback with five randos and no booze.\n\nYou don’t show up to a lunch with four kids and nothing for them to eat.\n\nIt boggles my mind that she hasn’t looked for a sitter… in the world of technology, there are SO many ways to meet caregivers and hire them. It’s not like twenty years ago where you hope a neighbor has a high school aged kid who is decently responsible, there’s the NextDoor app, Facebook groups, care.com (which is ass), and tbh a lot of teachers or paras at schools will do babysitting gigs for parents. She can figure something out.",
          "id": 156,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "And doesn’t it seem kind of risky to unleash your four young children in a childfree home? You have no clue if that person has done any amount of childproofing at all, and you can’t watch four kids while socializing. Four kids let loose in my home are gonna end up having their hands on all kinds of things kids shouldn’t have access to. Crafting supplies to swallow or cut themselves on, weed and alcohol, cleaning chemicals, etc.",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yes, lets invite a SAHM with 4 young kids somewhere and be surprised when she brings kids with her. While misscommunication may be the key problem here, it's also the lack of common sense on the other party. The woman cant just lock her kids in a house while she's at lunch/hike. And if you dont want a mother to bring children with her, it's common decency to mention it on time ao she could get someone to watch over them. Not to mention berating and all the disgusting comments directed to the mother because her husband is a trucker. and if the food is your biggest concern, 4 kids under the age of six, ad a stroller to the mix, you could probably make a conclusion that 1 is just a baby, another is probably 2-3, and you're left with a 2 todlers. So its not 4 ppl, its more like 1.5 portions for all 3 of them",
          "id": 158,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1870,
      "content": "*Edited to change my position to full NTA, after reading OP’s edits.  *\n\nI’m going against the grain here and saying NAH, with a slight nod at the neighbor for not reading the room.  \n\nOP isn’t an AH for not doing or planning kid friendly things - why would she, she has no children, and doesn’t particularly like them.  And she’s not required to be Molly’s BFF.\n\nMolly, as soon as she realized none of the neighbors had children and didn’t do kid friendly activities, should have pivoted and (a) asked if kids were welcome at these invitations, and (b) upon realizing this wasn’t a kid friendly group, started looking for a friend group that was (playgrounds, library, etc).  I feel bad for her, I’ve been in her position, but it’s not ever ok to force your children into kid-free activities.",
      "id": 159,
      "comments": [
        {
          "score": 263,
          "content": "Agreed, although there's a little bit of AH on all sides for not being clear, and reacting strongly when they realized there was a misunderstanding. Everyone could have been a little more graceful in their responses. Outside of that, NAH.\n\nOn a side note, it's odd that the new neighbor didn't research the area better. I know the market isn't great so it's not always a choice, but if I had kids I'd look to move to an area where they might make friends on their street, especially if my spouse was going to be away as often as Molly's. But too late for that here.",
          "id": 160,
          "comments": [
            {
              "score": 15,
              "content": "It’s illegal for RE agents to tell potential buyers things about demographic characteristics like that.  I agree with you they should have done more research, they could have asked around or driven around the area to see if there’s kids out playing, joined the neighborhood FB groups, etc.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 175,
          "content": ">(a) asked if kids were welcome at these invitations\n\nHow is she not the asshole for not doing so, assuming that an invite to her is an invite to her and her kids, and as per OPs edit, completely taking over their walk and changing it in a wah that nobody wanted.",
          "id": 162,
          "comments": [
            {
              "score": 69,
              "content": "When I posted this, OP hadn’t added her edits.  Just read them now.  I do think Molly is an AH after reading the edits.  I also think Molly is a lonely, overwhelmed woman, single-parenting with an absent husband.  That’s no excuse for her behavior, but it does explain it.  It’s sad but its also not OPs problem.",
              "id": 163,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1188,
      "content": "NTA  She clearly doesn't understand the meaning of it takes a village.",
      "id": 164,
      "comments": [
        {
          "score": 758,
          "content": "Yeah I don’t think Molly understands that you can’t just make people be part of your village.",
          "id": 165,
          "comments": [
            {
              "score": 145,
              "content": "What do you mean?  If I move into an HOA, I better get something for my dues.  You're ALL baby sitters now! \n\n/s",
              "id": 166,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 224,
          "content": "Especially moving into an already existing neighborhood (which she obviously has the right to) and just unilaterally deciding that the people who live there will be her village. Who is she to decide that she's entitled to other people's time/help/friendship and that she gets to railroad *their* plans she's been kindly invited to? I get that she's probably exhausted and could use some friends but she needs to look elsewhere for them. Befriend some of the parents from her kids kindergarden, take them to the playground or other kiddy activities. She'll automatically meet people there who also have kids and would be happy to go on kid-friendly outings together.",
          "id": 167,
          "comments": [
            {
              "score": 103,
              "content": "Or even just be patient about it! There's a chance that OP and the other people in the area could grow to love Molly and her children the more they got to know each other. You know, like how most friendships work!\n\nThe fact that she jumped straight into her entitled demands and called OP a bitch would make me so unsympathetic. Who even tries to dump four kids on a strange woman right off the bat, barring emergencies? She's all sorts of wrong here.",
              "id": 168,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Non-native speaker here. What is the actual meaning of that saying?",
          "id": 169,
          "comments": [
            {
              "score": 114,
              "content": "Typically, when someone says \"it takes a village\", it's referring to how a community (family, friends, neighbors, etc.) should work together to help in a kid's growth and development in the world.",
              "id": 170,
              "comments": [
                {
                  "score": 65,
                  "content": "100 years ago, it would have been the actual village - particularly in small towns where everyone knew everyone, really only socialized with people in town, and were all more or less related to each other by blood or marriage. We still had a lot of this when I was a kid 30 some years ago in my small town. Any parent/grandparent/aunt/uncle would feel free to scold any kid getting into mischief and would, generally, be happily thanked by the actual parent for keeping their kid out of trouble. There are still members of that community I call \"grandma\" or \"grandpa\" as an honorific. But, again, it was a small town where everyone knew everyone and our literal village was the proverbial village.",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 72,
              "content": "The meaning is that raising kids is hard and a lot of work and so it's much better if you have a strong support system of people around you who can help you out, and who you help out in turn. Back in the day when people were less mobile the village you lived in was probably full of people whose families have known each other for decades and probably there's a fair amount of family dispersed around the small village from neighbors marrying neighbors. \n\nWhere this neighbor is going wrong is your \"village\" now isn't just the random people who happen to live near you. Now your \"village\" would be friends and family who care about helping you out because they care about you. She's trying to force these random neighbors into helping her out to their own detriment simply because they're nearby and she wants help, but she doesn't know them, they don't know or apparently like her, and so they have no desire or responsibility to help her out. \n\nIf she was nicer and didn't try to force them into helping her or expecting that they would even though they had no reason to, maybe they would have been more willing to welcome her into their friend group and help her out.",
              "id": 172,
              "comments": [
                {
                  "score": 8,
                  "content": "Thank you! That makes a lot of sense ☺️",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Let me know if more clarification would be helpful!",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "\"It takes a village\" is an old view of child raising. Where the whole community would raise each other's children, not just each set of parents to their child. And generally help each other. \n\nIt's often misused by people today to try to strong arm unwilling people in their general vicinity into babysitting for them without doing anything for the \"village\" themselves in return.",
              "id": 175,
              "comments": [
                {
                  "score": 12,
                  "content": "They rarely do anything for the “village”, it’s all about having someone else do the heavy lifting of raising their child. The kind of people who show up at a party and think the other people are free daycare so the parents can get day drunk.",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Or trying to demand free babysitting from relatives.",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "It takes a village to raise a child. The mom is using this very old expression to imply she expects neighbors (whom she doesn't know and has a very minimal relationship with) to aid her in raising her children in one way or another.",
              "id": 178,
              "comments": [
                {
                  "score": 5,
                  "content": "Part of the reason \"a village\" model would work at all is that moms would be able to share child care.  If one person is caring for two kids, it's not much labor to take care of one or two more.  \n\n\nIt's obviously not going to work to try to rope random people that you barely know into it.  It can even be dangerous, since you barely know them.",
                  "id": 179,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I absolutely agree. I am childfree and absolutely HATE when parent pull the \"it takes a village\" BS, knowing full well if I asked them to help with my dog the same way they ask others to help with their kids, I'd be laughed at. Probably mocked, too.\n\nI didn't want to let that abhorrence bleed into the explanation, which is why I kept it succinct.",
                      "id": 180,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "\"It takes a village to raise a child\" is the whole saying. It's an expression that generally means that it's a community effort to raise children, and no one person can do it alone.\n\nThe catch is that the \"village\" is supposed to be willing to provide said support, and the people receiving the support will *obviously* lend a hand back when others need it. Entitled people who use this phrase tend to ignore that part of the social contract.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I live in a “it takes a village” neighborhood. Kids go from home to home, we watch each other’s kids, feed them, pick up/drop off from school, camp, sports. If one parent has an event we’ll keep the kid(s) overnight then another parent watches them next day etc.",
              "id": 182,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "\"It takes a village (to raise a child)\" means that literally no one can do it alone.  The vast majority of human cultures would have a mom surrounded with her siblings, cousins, aunts, uncles, mother, and maybe even her own grandparents.  Everyone would have children, and society would always expect that children were welcome.  \n\n\nThe \"atomic family\" model in the US with one mom, one dad, and 1.5 children is very difficult and often isolates women (who may find themselves in the SAHM role, especially if they can't out earn the cost of daycare).",
              "id": 183,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I have a neighbor that did this exact thing when she moved in the neighborhood. Most in our neighborhood have kids. Her version of the village was that everyone do everything for her without reciprocating when someone else needed a sitter or whatever. And then made a scene at a mom’s night get together yelling at everyone who started to “refuse to help a struggling mom”. I have kids. That doesn’t mean I want to raise yours! It’s been a few years and I still avoid her at all costs.",
          "id": 184,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 937,
      "content": "NTA. I hâte that whole it takes a village bullshit. If you choose to have kids that’s on you. You don’t get to then put that on others and expect them to alter plans to suit you.",
      "id": 185,
      "comments": [
        {
          "score": 454,
          "content": "I hate it because these entitled parents never take part in creating a village, they just want the benefits as soon as they have a need.\n\nDig your well before you get thirsty.",
          "id": 186,
          "comments": [
            {
              "score": 37,
              "content": "A nd they never ask the village if it's okay for them to have half a dozen kids they expect the village to care for.",
              "id": 187,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "And I bet those parents would be pissed if their kids got disciplined by “the village”",
              "id": 188,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 209,
          "content": "The village is supposed to be other parents and everyone takes turns helping/watching the kids. It’s not harassing childless and childfree people to raise someone else’s kid for free. Birth control is free, use it.",
          "id": 189,
          "comments": [
            {
              "score": 9,
              "content": "Nah even other parents shouldn’t be roped into watching your kids. Kids are the responsibility of their own parents, full stop. The pawning them off on others any chance they get is out of control these days.",
              "id": 190,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "I pay taxes and wait for the green man to cross a road if kids are around, that's my contribution towards the village.",
          "id": 191,
          "comments": [
            {
              "score": 5,
              "content": "What is a green man?",
              "id": 192,
              "comments": [
                {
                  "score": 13,
                  "content": "It's the green light for pedestrians to cross the street. In the UK it's often shaped like a man walking. People ignore it if there are no cars but you generally wait anyway if kids are there to set a good example. \n\nSide fact: the green man in the UK is also a sort of pagan god , associated with life/nature and found on many churches here.",
                  "id": 193,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "It *does* take a village and I genuinely feel for SAHM's who don't have the support system in place to help them manage, but the village is supposed to be compromised of people who willingly choose to be part of it - other parents, grandparents, friends who enjoy helping you raise your kids and for whom you are providing support as well. \n\nI get the impression that Molly is lonely, isolated and unsupported. That sucks for her. But it's not on her brand new neighbours who were kind enough reach out to completely change all of their existing plans and lifestyles to accommodate her needs. That is an absurd expectation. Molly needs to go make some Mom friends.",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "The village is supposed to be family and close friends who choose to be there and offer support. Accepting offered help isn’t entitled, asking for help when you need it from those close to you isn’t either. \n\nBut demanding people (especially ones you hardly know) step in to be your village definitely is. OP’s new neighbour sounds nuts and very entitled.",
          "id": 195,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "It does take a village, just not my village.",
          "id": 196,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Agreed 100% but every parent I know does this shit. Can’t understand why people have kids just to dump them on somebody else every chance they get.",
          "id": 197,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 606,
      "content": "ESH.\n\nShe shouldn’t have assumed her children were welcome on the walk and lunch but since these are not explicitly adult activities you should have specified.\n\nWhat I think makes you the bigger asshole than her is the “absent father” comment in your post.\nHe’s not absent. He’s at work. There is a difference. You sound judgey as hell.\n\nOr to your mind should no truckers, military, merchant navy, and a million other professions that include travel or stints away from home be entitled to have a family?",
      "id": 198,
      "comments": [
        {
          "score": 254,
          "content": "Excellent comment. The whole tone of the post is that OP is above her.\n\nThe neighbour took some liberties though.\n\nEdit- After ops edits what a stuck up AH",
          "id": 199,
          "comments": [
            {
              "score": 60,
              "content": "Agreed. I know it's a situational subreddit, but just in general, op sounds like an AH.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "I’m rabidly childfree and would not want my neighbor’s 4 kids coming to my house. I’m always annoyed when colleagues have to bring their kids for a day or whatever but shit happens and you move on. That’s the consequence of being human — people are kids before they’re adults, and there is no avoiding them. It is what it is. \n\nThat said, I also took immediate issue with the tone of the post. There is a respectful way to be childfree and there is a disrespectful way. OP chose the disrespectful way.",
              "id": 201,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 51,
          "content": "Nice comment. My father was a trucker and while I did miss out on more ig \"physical bonding\" sometimes,i knew he was there and he loved me. And when he was home we all could have a good Ole time together.",
          "id": 202,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "OP didn’t like their “vibe” from the start. Whatever that means.",
          "id": 203,
          "comments": [
            {
              "score": 26,
              "content": "Working class.",
              "id": 204,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "apparently when op brought over the pie, the husband said something like “oh great, a pie” sarcastically + the wife hinted that she needed help for moving\n\nmy own personal opinion is that the duo were rude - op’s a literal neighbour who actually owes them jacks*it 🤷🏽‍♀️",
              "id": 205,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Lol what a pathetic response. If he WAS present, maybe mom could go out while he watches the kids. No one said he's a bad father, but he is ABSENT from the house. If he wasn't, this situation would be different because the mom would have more support. If you're gonna be away from the home for long stretches, maybe don't have four children under six?",
          "id": 206,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 463,
      "content": "NTA for not inviting her on things you don't consider child-friendly. You still could be her friend though and socialize with her on other occasions, if you like her otherwise.",
      "id": 207,
      "comments": [
        {
          "score": 1040,
          "content": "After the way she went off on me and called us names, myself and my friends decided we don’t want to talk to her anymore.",
          "id": 208,
          "comments": [
            {
              "score": 303,
              "content": "I wouldn’t want to talk to her anymore either, honestly it sounds like you & your friend group dodged a bullet with Molly. She sounds super entitled.",
              "id": 209,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 80,
              "content": "NTA - she needs to find kid activities so she can meet other moms with same age kids, to do stuff with.",
              "id": 210,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Don't listen to this person. You don't owe Molly anything. You tried and she sounds like the type of person if you give an inch, she will take a mile.",
              "id": 211,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 457,
      "content": "ESH. You were aware that she has 4 small children and is new to the area. What did you think she was going to do with them? You should have said, \"Is there any chance you could get a sitter and join us?\" If there was a someone of babysitting age on the street you could have mentioned this. \n\nShe is an asshole for the \"It takes a village\" comment to people she hardly knows.",
      "id": 212,
      "comments": [
        {
          "score": 421,
          "content": "Why would OP ask what she is doing with the kids? The invite was for Molly only. Molly should have verified that it was okay to bring the kids. Frankly OP shouldn't care what Molly is doing with her kids. It's Molly's job to figure out who will handle the kids or if it's okay to bring them.",
          "id": 213,
          "comments": [
            {
              "score": 181,
              "content": "I don’t think OP told Molly the invite was for her only. I have a baby and If someone asks me over for lunch and they know I have a baby then I’d assume they know the baby is coming. I’d probably double check but most people know that babies and moms generally stick together. If someone invited me to an evening activity like a party then the assumptions would definitely be different there since that generally isn’t a baby friendly activity.",
              "id": 214,
              "comments": [
                {
                  "score": 130,
                  "content": ">I have a baby and If someone asks me over for lunch and they know I have a baby then I’d assume they know the baby is coming.\n\nI don't think that's a fair assumption to make. I would not have assumed the baby is coming. Not everyone knows a bunch of parents. Not having a baby is the norm, and not bringing uninvited babies to lunch is also the norm. So I think it should be on the people with the babies to find out if the lunch invite extends to their babies and not assume.",
                  "id": 215,
                  "comments": [
                    {
                      "score": 52,
                      "content": "She shouldn't have assumed it, but it's an *understandable* assumption. It varies by region and social circle. Around here, you would most definitely specify 'no kids' on an invite to lunch at the neighbor's.",
                      "id": 216,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Especially being new to the neighborhood. It takes a bit to find a sitter in a new place.",
                  "id": 217,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "A baby, sure. Four kids? Hell no that would ever be assumed, lmao.",
                  "id": 218,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "That’s a good assumption if you’re being invited to hang out with other parents, not if you’re going somewhere that there are no kids.",
                  "id": 219,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 112,
              "content": "I was a SAHM when my kids were little, and I also assumed my kids were coming to lunch if I was invited. It was very rare that I would hire a babysitter during my husband's work hours. I understand this group doesn't work that way, but it did where we lived then. No one, even childfree by choice folks, cared if my kids came along. If they had, they wouldn't have been my friend group just because it wouldn't work for where I was in my life. So Molly may have (and sounds like she did from her village comment) lived in a previous neighborhood like that and didn't realize this one was different.",
              "id": 220,
              "comments": [
                {
                  "score": 199,
                  "content": "[deleted]",
                  "id": 221,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Its social etiquette to ask if the kids are invited and also for the person making the invitation to clarify if its adults-only or kids are welcome. The activities are lunch and a walk. These can be adults-only or kid-friendly. Just like Molly assumed that it was kid-friendly, OP assumed that the activities are adult-only and Molly would know this. Both rushed to judgment and created a misunderstanding.\n\nOP also claims the neighborhood is having a 4th of July block party and they aren't allowing Molly and the kids to join them because of this issue. This is what makes OP TAH. They are socially excluding Molly as punishment for her feud with OP and the kids are being punished as a result for existing.",
                      "id": 222,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "She just arrived how is she supposed to find a baby sitter ? Also when that first incident happened, why did she invite them to the hike knowing she would bring her kids ?",
              "id": 223,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 66,
          "content": "I highly agree with ESH judgement. The mean girl trope is so old and annoying, but so is blowing up someone’s phone for being a dick. Both parties need to be upfront and move on with life.",
          "id": 224,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "People who don’t have kids usually have no idea what it’s like to raise kids.  Expecting OP to consider Molly’s potential childcare needs is, frankly, ridiculous.  It’s a shame Molly moved her family into a neighborhood where she probably won’t meet people who have interests in common with her as a SAHM with four small children, and whose children will not have other neighborhood kids to play with.  But that’s on Molly.  OP is NTA.",
          "id": 225,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I'd honestly expect them to be at daycare during lunch and would've been shocked about 4 kids surprisingly showing up too. Not sure about the US but where I am daycare is free and almost every single toddler goes as it is seen as beneficial. Stay at home moms just pick half day instead of full day. So maybe I'd have expected the youngest to come over with mom if it's too young for free daycare. But certainly not all 4.",
          "id": 226,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 402,
      "content": "Definitely NTA, and the comments to the contrary surprise me. Molly is not entitled to OP’s friendship or time. OP gave it a shot and it turns out they don’t have much in common. OP doesn’t have to be around kids if she doesn’t want to, nor does she have to alter her lifestyle to accommodate them.",
      "id": 227,
      "comments": [],
      "relation": "Support"
    }
  ]
}