{
  "post content": "I (57M) own a small business. There’s only about 20 employees that work for me but recently I hired someone new. She seemed like a great fit at first but she’s started stirring up trouble mainly with one of my hardest working employees. I didn’t know this but apparently he has an only fans. The new employee came to my office one day holding a folder, keep in mind she’s been here for less then a month. \n\nShe dropped the folder on my desk and opened it up. She went into a spiel showing several pictures of him and other men doing things you’d expect to see on a porn account. She started talking about how inappropriate and disgusting it was for him to be doing things like this. I felt like this was especially dumb because she was looking at porn and wanted to degrade people making it? \n\nShe said he was putting out a horrible representation of our company. I really felt like this wasn’t fair cause it’s entirely up to him what he wants to do outside of work and I don’t control his body. She just got a lot angrier and started demanding me to fire him. I told her to just shut up and get out(probably what’s making me wrong here) She went out and told everyone else and now they’re demanding me to fire him too. I’d get it if we were watching children or something similar but we literally just make drawings for games. \n\nSo am I the a-hole for not firing him? Was I in the wrong here?\n\nI posted the update to my profile so everyone can see it",
  "id": 1,
  "comments": [
    {
      "score": 20518,
      "content": "NTA.\n\nShe had to seek those things out, and likely had to pay to see them. To my knowledge, it is also against OF rules to print pictures of the content, and it is definitely revenge porn for her to give those photos to you and others without his consent. Good for you for not firing him, and I would personally choose to fire her. She's toxic\n\nEdit: Wow!! Thanks so much for the awards, they're the first I've ever gotten!! I left for a wedding and didn't expect this post to blow up, much less for my comment to be at the top. Thanks to y'all and good luck to OP with damage control.",
      "id": 2,
      "comments": [
        {
          "score": 21641,
          "content": "I think I will fire her to be honest",
          "id": 3,
          "comments": [
            {
              "score": 10410,
              "content": "Good. I would also suggest a meeting or atleast an email about people's lives outside of work being their own, and no one else's business. His work life could become hell (due to no fault of your own of course) and sadly as a manager it's your job to do damage control. \n\nBe clear that anyone found holding his personal life against him will share the same fate as this woman.",
              "id": 4,
              "comments": [
                {
                  "score": 2955,
                  "content": "This. 100% this. Make SURE everyone is in the loop on this.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 765,
                      "content": "And not only would I fire her, I would tell her I am going to let him know she did this so that if he chooses to press charges against her, he can. He's likely now getting harassed and she's trying to get him fired. It doesn't sound like he did anything to her other than participate in a hobby/extracurricular/side hustle that she disapproves of. And she would be all bent out of shape if people combed through her past, her life outside work, and she'd be threatening legal action if it affected her job.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 398,
                      "content": "This. This. This.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1494,
                  "content": "I agree, /u/South-Sky8148, that you have to say something about this to the team. If you have decided to fire New Hire, I'd say something about bringing things to you, and those items are held in confidence. \n\nHowever, I'd also work with an employment lawyer to draft up a social media policy for your employees. On hand, yes, people should be able to express themselves without that impacting their job. On the other hand, do you want to retain employees that post racist or other incendiary comments online? A good lawyer can help you navigate this and minimize your liability as well.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 1885,
                      "content": "I’ll be sitting everyone down tomorrow. She’s getting fired immediately after",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Thank you. You explained it so much better than what was going through my head",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 211,
                  "content": "Unfortunately, it is NOT exactly through no fault of his own. This happened at the job, through the actions of an employee, and this is creating a hostile work environment. IANAL but the employee in question may have a legitimate complaint against the employer. OP should take firm action and make sure employee training assures all employees lawful protection against harassment.\n\nEdit: The gay man is the one who could claim a hostile work environment. OP could be liable because OP’s new hire wasn’t given an appropriate sexual harassment orientation and wasn’t supervised correctly. OP should contact an employment law expert.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 139,
                      "content": "A \"hostile work environment\" is a legal term in the US, and isn't just \"making work unpleasant\". Pretty sure it requires discrimination based on a protected class. \n\nI would talk to a lawyer before firing someone who has already proven to be this much trouble, just to make sure it's by the book.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 125,
                  "content": "Honestly if I was in OP's position, I would be livid at her. There's no right or reason for that to have ever come across his desk and I would love to hear her logic as to how an OnlyFans or even porn in general has any effect on her at all",
                  "id": 13,
                  "comments": [
                    {
                      "score": 30,
                      "content": "sounds like she's homophobic and looked him up for a reason to fire him.",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "I can’t imagine recognizing a person from porn (how much porn did she watched?) and then watching some more to get your coworker fired. The only reason why I wouldn’t have fired her on the spot, would be to call a lawyer to protect myself from her. She sounds toxic and dangerous.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Indeed, I am a it curious how she came across the pictures..... could have phrased that better",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "And be clear how she got her hands on this and if you fire her, make clear anything she's said about them.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Just dont name any names if you decide to do this. Even though everyone will know who it is about already you should try not to make it all about him. I would also have a private convo with him maybe to let him know that you dont give a fuck about what he decides to do outside of work.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1908,
              "content": "PLEASE do. \n\n*This* is the exact response that SWers need from vanilla employers. You are a top notch person, and this Dominatrix thanks you for being so fucking cool.",
              "id": 19,
              "comments": [
                {
                  "score": 2170,
                  "content": "I’m definitely firing her at this point",
                  "id": 20,
                  "comments": [
                    {
                      "score": 469,
                      "content": "*Respect*",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 447,
                      "content": "You’re a great employer. Screw the girl whos trying to ruin a life instead of focusing on her job. Keep the guy whos doing his work, because his life outside of work is irrelevant.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 215,
                      "content": "make sure you consult whoever you use as legal representation so you can properly articulate your reasoning for firing her such as her bringing inappropriate material into the company space or even if she used company property to get this and print it out as well as the possibility of it being illegal to violate a websites user agreement you may be able to call the police on her but before that talk to the employee she outed",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 198,
                      "content": "I’m an employer running a factory too.\n\nShe’s gone.  Done.  Toast.  Make it quick, definitive and public.  \n\nIf no no other reason than your own protection because there’s definitely the seeds of a suit here.\n\nBut really for the guy, a loyal hardworking employee.  Straight up violation of his privacy plus public humiliation.  He’s definitely been wronged.  \n\nAny opinions on his chosen lifestyle are irrelevant.  The most righteous usually have the most to hide (looking at you Jerry Falwell).",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 106,
                      "content": "Well, make sure you have a valid and documented reason for firing her. It sounds like she wouldn't be the type to simply accept being fired.\n\nBut, this raises so many questions:\n\n* How did she even find his Only Fans? Was she searching for him, all her fellow employees, or is she just a porn afficionado?\n* Where was she doing her searching and printing - at your business or at home? If while she's supposed to be working, well, there you go for a solid reason for firing her?\n* Was it the porn or gay part that was her problem?\n* Were you aware of the porn activity prior to her telling you? Have you ever had a complaint from clients/customers?",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 46,
                      "content": "Make sure you have witnesses that sit in on the termination meeting.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "Good, she's literally creating a hostile work environment.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Are you in a right to work state? She could claim discrimination otherwise. I'd check with an HR type attorney to be sure first to have your bases covered.",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "Please post a update when you do, I want to know how it goes down (Please)",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Just want to jump in and I say I have a lot of respect for you. I know that means nothing coming from a stranger but I have seen too many stories of this happening and the manager firing the employee instead of the one doing the harassment. And she is harassing him and as such should be the one fired.  As long as his outside activities don’t effect your business (with the exception of this crazy girl), then there is no problem. \n\nAnd I’m sure this has been said but I would also talk to the male employee. Let him know you don’t care what he does outside work and that he has your support. One to reassure him but also to legally cover yourself too.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 57,
                  "content": "I hope I end up with a boss like OP, I've been thinking about making an OF account myself but I don't exactly want to risk a coworker coming in with pictures of me dolled up and wearing a chastity cage, not something I think I could live down in the work place.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 15,
                      "content": "We joke about making a group acct to get some extra money in with our manager- even came up with usernames!",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "What is an SWer please?",
                  "id": 33,
                  "comments": [
                    {
                      "score": 56,
                      "content": "Star War-er\n\nAt least that's what my mind went to initially, it's sex worker.",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "Sex worker.",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Sex workers",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Sex worker",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "That was my question",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 285,
              "content": "Because she went and told the other employees about it rather than stopping with you, or going to another supervision focussed route, you pretty much have to. She created a toxic work environment which is damaging to the productivity of your business.",
              "id": 39,
              "comments": [
                {
                  "score": 184,
                  "content": "she is literally leading a (homophobic) torch-and-pitchfork mob against OP's best employee. Toxic might be a bit mild for this employee.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Do we know if it's homophobic? I didn't see anything about him being gay, he could just be straight guy with an OF account, I mean probably a fair few guys looking at it, but it doesn't say he's gay, unless I missed it.\n\nShe's a major arsehole regardless but it I guess it makes more sense if he is gay as well.\n\n&#x200B;\n\nEdit: nevermind I say one of OPs comments saying he is",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 27,
                  "content": "Her being homophobic isn't even the issue to me. She is, no doubt but even in a \"gay-free\" workplace she'd simply find other drama and this shit is ENDLESS. I wouldn't even bother thinking about if she is right or wrong, just boot her immediately. Workers busy with drama are unproductive and unhappy. The next mob will be going for the person who takes 3 sugars in his coffee without thinking of the expenses!",
                  "id": 42,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Fuck that, i take at least 4 sugars on my coffee, if i can taste the bitterness of the coffee, then it didn't have enough sugar :D",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 208,
              "content": "Be sure to send her a detailed email, outlining the fact that she brought porn into your business & showed it to you, without even a warning or your consent. That's sexual harassment, & her coworker could probably sue her for sexual harassment as well. That way you have a paper trail.\n\nSecondly, if a male employee showed you nude photos of a female employee, would you even be second guessing yourself right now?",
              "id": 44,
              "comments": [
                {
                  "score": 47,
                  "content": "These are extremely valid points OP!",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "This! I don’t want anyone sharing nudes of another colleague with me. Even of the cute consultant, it is very violating for everyone involved",
                  "id": 46,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Yes! She waltzed into a new job & in one month made the workplace divisive & put her male coworker in a shitty position. Who knows, maybe he turned her down & this was her revenge. Either way, she's toxic. OP, please talk with your male employee & let him know you've got his back, she potentially humiliated him at his place of work & i can't imagine what he's feeling.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 82,
              "content": "Please update once you’ve made your decision!",
              "id": 48,
              "comments": [
                {
                  "score": 162,
                  "content": "I will",
                  "id": 49,
                  "comments": [
                    {
                      "score": 32,
                      "content": "I would definitely talk with him as well if you haven’t all ready. Assuring him you have no problem with what he does outside of work and letting him know you won’t tolerate other employees harassing him will definitely make him feel better. You also need to have a group meeting talking about how the harassment of employees won’t be tolerated.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 82,
              "content": "At the very least this is some serious sexual harassment and unprofessional conduct from her. Absolutely need to fire her and if anyone wants to give you a hard time about it point out to them she opened you up to a potential lawsuit from the harassed employee. As to everyone else she involved they need a serious warning about how further harassment in the workplace will not be tolerated.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "You need to do something with her and the other employees so that the gay guy does not sue you for a hostile work environment.",
              "id": 52,
              "comments": [
                {
                  "score": 236,
                  "content": "She’s getting fired no matter what and they’d get fired for still talking about this because that’s a breach of contract",
                  "id": 53,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Something we do with toxic employees, is of course make sure they find themselves out the door, but also distribute a memo about expectations and intolerable actions. Then everyone is required to sign it. One thing I always include is that deviation from these expectations may lead to termination. No meetings, no space for folks to drag it out and beat dead horses. Just to the point. And then the topic is closed. The more space folks have to discuss something the longer it lasts and it gains traction.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 73,
              "content": "If you are anywhere in the US and fired him for this reason you’d actually be in legal trouble for discriminatory behavior.",
              "id": 55,
              "comments": [
                {
                  "score": 405,
                  "content": "I’m not firing him. He did nothing wrong",
                  "id": 56,
                  "comments": [
                    {
                      "score": 77,
                      "content": "Exactly. Good call. You have a problem employee and he isn’t it.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "Before you fire her I would call a company meeting and explain that in the future this type of petty snitching won’t be tolerated. It’s nobody’s business what someone does on their own time and you don’t have a problem with what people do unless they’re EXPLICITLY involving the company.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "You're being an awesome boss to him while everyone else is trying to pull a Les Miserables moment on him. Poor Fantine.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "It would be discriminatory if he fired him because he is gay.  It would not be discriminatory if he would fire any employee that has an OnlyFans.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "That is a massive overstatement of law. People can be fired in the US for having an Only Fans creator account. People can even be fired for being gay in the US as proven by the massive amount of LGBT teachers fired from religious schools. Hell, you can still be fired from a job even with legal protection because the laws don't proactively prevent the firing, they just provide an opportunity to go to court after you've lost your job.",
                  "id": 61,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 27,
              "content": "That's probably a good example to set honestly, just be conscious of the fact that others supported her rediculous notion so you may get pushback. Do this strategically and make it about her unprofessionalism and making the work environment hostile.\n\nYou're a great owner. Don't cave to her judgemental attitude.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I would fire her Pronto. She is nothing but trouble. Do you have a probationary period? She may have contamated the other employees. \n\nShe's also researching everyone! You might want to mention that to your employees.",
              "id": 63,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 86,
          "content": "[Text of original comment deleted for privacy purposes.]",
          "id": 64,
          "comments": [
            {
              "score": 56,
              "content": "Honestly, given she went through a paywall and then distributed the pics to others, what she's doing is stealing instead.",
              "id": 65,
              "comments": [
                {
                  "score": 33,
                  "content": "It's a contract violation. Possibly a copyright violation -- but I could make a fair use argument (new hire's use was non commercial, made to one person, does not compete with commercial use of the copyright).\n\nETA: So the harm to him is the value of one subscription...the fact that he has an only fans is fully public information. That's way different than the violation of having confidentially shared photos leaked.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Gosh, I would love to work for you. All of your responses are so level-headed, rational, and fair. You’re definitely NTA. This woman is creating hostility and it’d likely not stop at this man.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Displaying obscene material to another person without their consent is a crime in some states.",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "You’re right that she had to seek those out. Likely scenario is she was into him, he was like no way, she got mad and decided she was going to ruin him since he rejected her.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Also, depending on where they are,  revenge porn could be illegal",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I would make a police report as well, honestly.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Totally echo this.\nShes a bully and will make his and everyone else's lives hard the longer she's there. She had nothing to gain by this action.\nI reccomend suspending or firing her for bullying and harassment and as mentioned below having a dedicated meeting with your team about acceptable work practice after you leave the office.\nPeople need to feel free in 2020 to bring their whole selves to work. Shaming someone for their choices is wrong.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "There are a lot of places that have working legislation for revenge porn. She could be looking at something far worse than an unemployment line.",
          "id": 73,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "> definitely revenge porn for her to give those photos to you and others without his consent\n\nNah if it was purposefully and consensually made for public consumption than one can't be angry if the public views it. \n\nThat said, I agree totally with the NTA. Non work related activities outside of working hours and away from the premises shouldn't get folks fired.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4695,
      "content": "NTA - In fact, I think you're a great manager, I'd consider firing her though.",
      "id": 75,
      "comments": [
        {
          "score": 3706,
          "content": "I’m really tempted to fire her. All she’s done here is harass him",
          "id": 76,
          "comments": [
            {
              "score": 1617,
              "content": "Her harassment of him is the only legitimate grounds for termination in this story unless you have some kind of contract about behavior outside of work and it sounds like you dont. If she is otherwise hardworking, perhaps do a final written warning, but then terminate if she can't let it go.",
              "id": 77,
              "comments": [
                {
                  "score": 345,
                  "content": "If OP is in a right to work state, I don’t think you need a reason to fire someone.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 332,
                      "content": "*at-will employment, right to work has to do with unions",
                      "id": 79,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 42,
                      "content": "I know u/Jinxx913 already corrected, but just to clearly explain:\n\n\"Right to Work\" - employees can not be required to join a union as a condition of employment. So, for example, even if a grocery store is a \"union shop\", if hired, you can opt not to join the union. In non-\"Right to Work\" states, in a unionized store, membership can be a requirement for employment. 27 US states are currently \"Right to Work\" states.\n\n\"At-Will Employment\" - in essence, this means that either party (employer and employee) can end the working relationship at any time (i.e. at will), without cause. For employers, this means they can terminate an employee for any reason that is not a protected basis. 49 US states are \"at-will\" (Montana being the exception), but some do place certain restrictions on it.\n\nHope that helps.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "It’s called revenge porn when you share those types of images without the creators consent , which is a crime so op can fire the new worker",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "49/50 shot.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 187,
                  "content": "I think printing out pornography, bringing it to work and showing it to OP is sexual harassment. That is totally inappropriate for a work environment. And even worse if she showed the pictures to her coworkers in the office during business hours",
                  "id": 83,
                  "comments": [
                    {
                      "score": 4,
                      "content": "She literally could have just mentioned it. Going as far as she did is psychotic and harassment. I didn't even think about her showing them to co-workers. Then there is the question \"did she print out porn at work?\".",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "I mean. She's sexually harassing the man. I'd expect that repeated sexual harassment, including giving pornographic images of him to his boss, is a fireable offense. Especially if they're in a jurisdiction where he's protected from harassment over his sexual orientation, real or assumed.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "I believe you read the post incorrectly. The harassed worker is the hard worker, not the one that is harrassing.",
                  "id": 86,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "If she's been there less than a month, surely you can get rid for any reason if there's probation period?",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Printing and posting porn of a coworker qualifies as revenge porn.  \n\n\nAnd is a crime.",
                  "id": 88,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Didn’t he say the OF guy was hardworking?",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 125,
              "content": "If she’s sharing images of him in a sexual context without his consent then she’s probably guilty of a crime depending on which country you’re in. You should definitely fire her.\n\nEdit: fixed a typo. Learn to proofread.",
              "id": 90,
              "comments": [
                {
                  "score": 11,
                  "content": "Possibly not if he published it on the internet. That said, she still showed sexually explicit pictures in the workplace and harassed that poor man",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 72,
              "content": "Where you are do you have the 3 month probation period? Because if you do, you can let her go and don't have to explain why if she's only been there a month. But you do have good reason to fire her, she was harassing another employee, imagine how he'll feel knowing she harassed him and now he still has to work with her in a hostile environment.",
              "id": 92,
              "comments": [
                {
                  "score": 253,
                  "content": "I can fire her whenever so I’m going to",
                  "id": 93,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Hell yeah",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "Another thing to consider is that if you keep her employed after you KNOW she's sexually harassed one of your employees, he could sue you.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Also, I am sure someone else has commented on it but I really think this is from a place of homophobia, not her just being a prude and anti-porn.",
              "id": 96,
              "comments": [
                {
                  "score": 10,
                  "content": "I’m pretty sure it was just homophobia",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "How did she even find out about it?",
              "id": 98,
              "comments": [
                {
                  "score": 7,
                  "content": "She was looking through the only fans she’s following and was looking for a new one when she found his",
                  "id": 99,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Which is obviously nothing appropriate to discuss at work.  It would be one thing if the new guy was actively discussing it and disclosing it.  For some reason everyone is siding with her so when you fire her for good cause you will need to send a memo out like another post said detailing company policy and (if it's legal) detailing why this woman was fired and how what she did was inappropriate.  You may deal with a mutiny of sorts otherwise (assuming these people have any other options).",
                      "id": 100,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Make sure that you document all of the harassment. If you don’t already, create some employment policy guidelines and tell her in writing  that she has to abide by them. Don’t fire her unless you have evidence that she does not abide by them. This will make it difficult for her to sue you for wrongful dismissal.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": ">All she’s done here is harass him\n\nThat sounds like a reason to fire her. Do it before she causes more trouble.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "She's harassing him, she's interfering in his personal life, she's demonstrating poor judgment by telling you how to do your job instead of doing her own.\n\nHe's a high performer and this has no impact on his job. \n\nIf I were you, I'd first talk to him, tell him explicitly that his job is safe and that what he does on personal time isn't concerning to you. Tell him you're handling it, and if anyone harasses him about it to report it to you. \n\nI'd then talk to her, and explain (don't let her argue or respond, just explain) the following- you are the one who determines who is employed, not her. It is not an issue what he does on his personal  time, and he's not involving the company by doing it. If you're firing her, frankly I'd say that the reason is sexual harassment (because she brought his nudes in to the office, shared them with at least you, and shared his personal sexual activities with other employees creating an unsafe work environment for him, although you may want to check with a lawyer to get the best wording on this), and aside from that, its a job requirement to be professional, respect your coworkers and not disrupt regular business operations (and she is doing that by her actions). There's an argument for not firing her if she's a good performer so far, however I'd lean toward firing her if she's new because this shows absolutely terrible judgment. \n\nNot only that, but I'd fight against her unemployment as this could qualify as \"gross misconduct\", which is a disqualifier for unemployment in my worker-friendly state. Seeking out a coworker's explicit photos, bringing them in to the office, and sharing them/their existence with anyone is something that everyone should know not to do and is, in my mind, an example of gross misconduct in any field other than porn production (and even then, most of the time its still unacceptable).",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "It’s his private life and she’s brought it to the work place. She deserves the firing not him. You sound like a great boss with a good grasp on reality so I don’t doubt you’ll make the right choice. I wish all employers were as level headed as you. Good luck. I hope she realises what she has done once she’s unemployed.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "OP: \"I'm sorry but it's not working out; I have to let you go.\"  End of story.  No discussion, no nothing.  Make sure you monitor her on her way out.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2483,
      "content": "NTA. She violated his privacy and outed him at work. She should probably be disciplined.",
      "id": 106,
      "comments": [
        {
          "score": 1740,
          "content": "He was already out but no ones ever shown any form of homophobia or anything. The girls have a lot of fun trying to set him up with other guys but I guess it’s cause he posts porn that they’re so upset with him now? I’m really not sure",
          "id": 107,
          "comments": [
            {
              "score": 1329,
              "content": "Outed his nudes, not his sexuality",
              "id": 108,
              "comments": [
                {
                  "score": 1161,
                  "content": "Oh yeah that makes sense. Sorry my mind is a little jumbled at the moment",
                  "id": 109,
                  "comments": [
                    {
                      "score": 232,
                      "content": "She sounds a lot like a narcissist that has sent her flying monkeys after you.  She is probably jealous of all the status hardworker gets from his contributions and doesn't like being in a weak position relative to him.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "NTA. It sounds like you agree with everyone that she’s the one in the wrong here, but I want to further encourage you to let him do his thing. Just because sex work is a taboo work subject doesn’t make it a moral issue for you to solve (which you also seem to agree with). I really hope to live in a world one day where we don’t have to deal with people like her who sexually shame everyone in an attempt to match her idea of what’s right. It’s really disgusting to treat sex – the exact reason that we all exist – as something to be ashamed of (I know he’s gay and can’t procreate with other men, but gay people are wired to like sex just like anyone else). She’s definitely the asshole, and doubly so for outing him to all his coworkers.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 205,
              "content": "If it were me. I would fire her for sexual harassment, hunting for his nudes then spreading them around IS sexual harassment. I would then hold a meeting where you tell everyone that harassment is in no way tolerant. If they keep squaking inform them that ALL outside of work activities from them are not judged by management provided they are leagal. If they want to suggest a change to that policy they can start a test period for themselves where all activities they do, work related or not must be approved by management.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I'm curious, you said she told you he's putting out a horrible representation of your company, was there any indicator that you saw that people who view his content know where he works? If not, what he does as a consenting adult with other consenting adults is his own business, regardless, it was shitty of her as well as a HUGE violation of his privacy, publicly available photos or not, to bring those pictures to you and show other co-workers. That's just plain, blatant harassment. She should be punished if not fired and maybe consult with him on if he feels comfortable having an open discussion with the rest of the co-workers to clear things up and try to wipe out any animosity there. I feel bad for him how humiliating it must be to know everyone he works with has seen those images.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Why in the world is everyone on her side? Is it a religious/conservative town?",
              "id": 114,
              "comments": [
                {
                  "score": 8,
                  "content": "Sounds like he’s OP’s best employee. They might just be looking for a reason to tear him down.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Totally...but I’m surprised she got everyone on her vindictive side",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "I image most people in real life (not online) would have that reaction, honestly. The world isn’t that progressive at all.",
                  "id": 117,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "What if one of the guys started passing around porn featuring one of your female employees? That would definitely be harassment. \n\nThis one is worse because of the homophobia aspect.",
              "id": 118,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "This is odd and I am curious what she was telling the other girls. I find it strange they aren’t ok with him doing porn. They are ok with him being gay and try to set him up yet they are bothered by what he does with his sex life?",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Also a lot of people give lipservice to tolerance of gay people but when confronted with actual sexual behaviour or content can't contain their homophobia",
              "id": 120,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1406,
      "content": "NTA. I'd fire her for fostering a hostile work environment and trying to force you to discriminate against another employee. His side job is his business and in no way, shape or form impacts his ability to competently perform the job he does for you. It also sounds like there's some pretty aggressive homophobia at work here. That's the kind of thing that would probably open you up to legal liability if you did cave to your other employees. Probably worth sitting them down and explaining to them that you're an equal opportunity employer and harrassment will not be tolerated in the workplace.",
      "id": 121,
      "comments": [
        {
          "score": 262,
          "content": "I completely agree with this. By \"sitting them down,\" I hope you mean \"sitting down all the employees\", not just the ones making noise.",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Yes, if you're in the US, you're exposing your company to liability if you keep her, under the Civil Rights Act and under hostile work environment laws. I don't think it's worth it.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Yeah, this is absolutely heavily rooted in homophobia, I really can't imagine her reacting this way if it was hetero porn. They do this though, blame it on the SWer side, not the \"he's gay\" so they don't look like as MASSIVE assholes as they truly are.",
          "id": 124,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1195,
      "content": "NTA.  You need to fire her and then have an employee meeting make sure everyone leaves knowing why what she did was wrong.  I wouldn't talk specifically about the situation any further, but in general terms.  \"It's against company policy to do this, this, and this.\"",
      "id": 125,
      "comments": [
        {
          "score": 664,
          "content": "I definitely will",
          "id": 126,
          "comments": [
            {
              "score": 288,
              "content": "If you don't have a HR rep.. I'd bring in a consultant to talk about the legalities of what occured. Possibly speak on the ramifications of her actions. Also wether a lawsuit could be initiated by your business or the man involved wether or not you intend to...",
              "id": 127,
              "comments": [
                {
                  "score": 28,
                  "content": "[deleted]",
                  "id": 128,
                  "comments": [
                    {
                      "score": 2,
                      "content": "She’s a toxic employee, yes, but don’t quote the law if you aren’t an expert. What specific statute was she breaking.",
                      "id": 129,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 171,
              "content": "I think you need to pay someone to come in and do a sexual harassment training just to protect yourself\n\nEdit: not just protect the company, but protect your employee from harassment by his coworkers. In California these trainings are mandatory. It should be easy to find an HR company that specializes in this. They come in and train employees on proper workplace behaviors. \n\nIt would be best for everyone to be made aware of how inappropriate this event was.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "You need to take this seriously. I am a former stripper and cam girl, there are nudes of me all over the internet. \n\nIf one of my coworkers printed them out and brought them to work, and the management did absolutely nothing, i would call the police and a lawyer. \n\nYou are on super shaky ground here, my friend. Quit worrying about being amd asshole and *cover* your ass before it's too late",
              "id": 131,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Don’t name names in a meeting just in case someone doesn’t know about it. Personally I would say the following:\n\n“We has an incident where [employee] was spreading private and hostile information of a sexual nature about another employee. This cannot happen, and [employee] has been fired for her conduct. It is none of my professional business what you do in your personal lives, and it is nobody’s business to spread private and harassing information. This is a situation that can quickly devolve into serious sexual harassment, which is why decisive action was taken. If any of you have any questions or issues, feel free to talk to me privately however you feel comfortable.”",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "“Hey listen everyone, I wanted sit everyone down and discuss a sensitive matter.  You see, I recently had to let an employee go for doing some inappropriate things.  I just wanted to make it clear to everyone that it is not okay to log in to Jose’s Only Fans with the intent of distributing pictures of him taking his throbbing Latino cock in Jeff’s tight little ass.”",
          "id": 133,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1042,
      "content": "\"You're absolutely right, we will not tolerate such gross, obnoxious behavior in this office. Pack your things, you're fired.\" \n\nNTA.",
      "id": 134,
      "comments": [
        {
          "score": 820,
          "content": "Okay you win. I’m using this tomorrow",
          "id": 135,
          "comments": [
            {
              "score": 163,
              "content": "and let us know how it goes haha",
              "id": 136,
              "comments": [
                {
                  "score": 17,
                  "content": "[deleted]",
                  "id": 137,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Same",
                      "id": 138,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 90,
              "content": "PLEASE update lol! I would love to know her reaction and the rest of the staff",
              "id": 139,
              "comments": [
                {
                  "score": 2,
                  "content": "Oooo yes yes, a juicy update please!!",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "godspeed!",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Gotta make sure to check this tomorrow.",
              "id": 142,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 516,
      "content": "NTA\n\nYou own the business if your hardworking employee isn't publicly making his onlyfans account known and bringing a bad image to your company there isn't much of a problem. However this might sound far fetched but have you asked her how she came about this information. Perhaps as shes a new hire she might be purposely looking for dirt on coworkers to climb the ranks just an thought. Either way its his private life and no concern of hers.",
      "id": 143,
      "comments": [
        {
          "score": 556,
          "content": "Oh sorry I did ask. She said she was looking through the ones she’s subscribed to which is why I was so incredibly confused",
          "id": 144,
          "comments": [
            {
              "score": 483,
              "content": "So, she's looking at the porn that floats her boat, which is gay male porn?\n\nAnd then she tries to get him shitlisted??\n\nTell her to hit the bricks, she's going to cause you nothing but trouble...",
              "id": 145,
              "comments": [
                {
                  "score": 145,
                  "content": "OP already described her behavior prior to this as \"harassing\", so I'm leaning more towards she has been actively looking for ways to make his life miserable. \n\nThis type of person won't stop either. If she manages to chase the one employee off, she'll move on to torturing someone else - highly likely another employee again.",
                  "id": 146,
                  "comments": [
                    {
                      "score": 21,
                      "content": "This is what I'm thinking.\n\nShe sounds like an absolute delight of an employee /s ;)",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 283,
              "content": "I’m sorry, but for her to come to you and discuss her porn habits, then show printed pornographic images to you in your office and during work hours is so off the charts inappropriate I can’t believe you needed reddit to suggest termination. She is a lawsuit waiting to happen",
              "id": 148,
              "comments": [
                {
                  "score": 207,
                  "content": "Yeah I tend to really not know certain situations too well and because everyone else was agreeing I just wanted to make sure I was right",
                  "id": 149,
                  "comments": [
                    {
                      "score": 105,
                      "content": "That's legitimate especially when they all seem to be siding with her.\n\nBut even talking about sex at work can be sexual harassment so not only did she harass him but she harassed you by even bringing nudes to you at work. Im surprised she even somehow thought this was ok.",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Both you and him can probebly file charges against her for sexual harassment probebly.",
                      "id": 151,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "You need an HR consultant. This could get expensive real quick.",
                      "id": 152,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "You mentioned in another comment that the employee in question is gay. \n\nI can almost guarantee that her issue is with that. \n\nAnd is compounded by the fact that he's selling - gasp - gay porn. \n\nShe went out of her way to find his personal accounts and the only reason she could do that is if she has a personal issue with this guy already. \n\nIf she was 'going through the ones she was already subscribed to', she would have had to have been ALREADY subscribed to this employee. \n\nI know you've said you will, but fire her. She's toxic and shady and has plans. Not sure what they are, but she's already scheming within a month of employment.",
              "id": 153,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 48,
              "content": "Sounds like a strange conversation to have with your boss within the first month of working when you should be trying your hardest to impress your colleagues. She sounds like she may be more problematic down the line however firing her may be a bit too harsh and make it seem like your not letting her have an opinion. Perhaps talk to the two employees involved and try and reach a resolution",
              "id": 154,
              "comments": [
                {
                  "score": 61,
                  "content": "But she seems to be on the verge of creating a hostile work environment so OP could probably make an easy case for firing the new employee who probably isn’t even off of a probationary period yet.",
                  "id": 155,
                  "comments": [
                    {
                      "score": 66,
                      "content": "Not on the verge. She already has created a hostile work enviroment.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "If she just talked to the boss, maybe. But she went around other emploees publicly harrasing him, that's bad.",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Showing pornography at work is not an “opinion.” It is extremely unprofessional behavior and she needs to be fired for it. \n\nHonestly, any employee showing this kind of bad judgement is not an asset to an organization",
                  "id": 158,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "She subscribes to a porn site? I wonder if she's on it?",
              "id": 159,
              "comments": [
                {
                  "score": 138,
                  "content": "I don’t know and I’m not checking",
                  "id": 160,
                  "comments": [
                    {
                      "score": 3,
                      "content": "🤗😅🤗",
                      "id": 161,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 290,
      "content": "[deleted]",
      "id": 162,
      "comments": [
        {
          "score": 28,
          "content": "That's not what revenge porn is but yes he should fire her.",
          "id": 163,
          "comments": [
            {
              "score": 142,
              "content": "It is if she’s doing it to get him fired from a job.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "It actually is. Legally.   \n\n\nThe legal definition is any distribution of porn that is used with malintent to damage or hurt the person portrayed in the media.  \n\n\nThat's exactly what she did. The thing is not every state has a revenge porn law.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 244,
      "content": "NTA. But you should fire the other employee for sexual harassment and creating a hostile work environment.",
      "id": 166,
      "comments": [
        {
          "score": 148,
          "content": "I will",
          "id": 167,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 153,
      "content": "NTA, you're a good boss. His private life is none of anyone's business as long as he's not putting anyone in danger. Perhaps you should consider firing her if she keeps making a big deal out of this",
      "id": 168,
      "comments": [],
      "relation": "Support"
    }
  ]
}