{
  "post content": "My (28M) wife (31F) has recently started to express interest in being a SAHW to prep for being a SAHM. We don't have kids and haven't been trying, and before getting married, we talked about kids and work/home arrangement and we agreed that we’d both work prior to and once we had kids, and agreed we'd take turns with the 'stay at home' portion for the first year or two after potential kids were born then both back to work.\n\nNow she wants to do away with that and wants to be a stay-at-home wife until we have kids and then be a stay-at-home mom. I don't want that, I never wanted that, and I made that clear from the start when we got serious. I enjoy my job a lot but my salary can’t sustain a family and I don't want to go back to school and change careers like she wants me to to make it happen. I don't want to take up a second job either knowing I'd still be doing half the housework and childcare (not that that's a bad thing) whereas both my mom and her parents are local she'd have plenty of help during the day and able to get downtime.\n\nWe had dinner at my mother's a couple days ago with my sister and her kids. While we were there my wife goes:\n\n\"Your son's being mean, he won't let me be a stay-at-home mom.\"\n\nFirst my family took this as she's pregnant and got excited so I had to tell them that wasn't it. She just wants to be a stay at home. It turned into this three-on-one conversation about how I should let her stay home if that's what she really wants and I should be taking care of her and finding a way to make this happen for her. Finally I go:\n\n\"Would you two help her with the house whenever she needs it?\"\n\n\"Of course! That's what family is for! Especially when you start having kids we'll help!\"\n\n\"Cool. Keep that same energy and help me pay all our bills and every other expense to upkeep our current quality of life if you feel so strongly she should get to stay home.\"\n\nThey did not like that and told me I was being overdramatic. My mom called me stubborn and told me to find corners to cut to afford everything on my salary and drop things like streaming services, some of my hobbies, go from two cars to one, etc. We left and my wife wasn't too happy on the way home. She says I was out of line for saying that to my mom and sister especially since she thinks I was serious. Was I the a-hole for telling my mom and sister to pay our bills if they wanted me to go along with it?\n\nE: Please stop with the vasectomy messages. They aren't 100% reversible, success rate goes down each year post procedure and I DO want kids someday. I am mindful that a babytrap is always possible.\n\nE2: Holy crap this blew up. Thanks everyone for all of your responses. I do know to be careful of oopsie babies right now so abstinence instead of just condoms for now. For those of you insisting I reconsider- no, look I'm glad the Stay-at-home/one income works for you all and you enjoy it, but it's not for me. I'm well aware 1 income means being financially tight, but its more than that- I don't want the stress of making sure I'm making enough on my own with 2 jobs, and also doing my part in the house and being a parent. I'd much rather get to spend time with my kids when I have them, not be a stranger that falls asleep at dinner and spends a bit of time like my father was. Since this post was more about my mom and sister, (I know all about the issues my wife is presenting atm and my options) I'm going to tell them to lay off. Either they do, or I just drop contact with them but I won't be giving them an ultimatum about it. ",
  "id": 1,
  "comments": [
    {
      "score": 17714,
      "content": "NTA, because you didn’t bring it up to them, your wife did. She was being manipulative and you called her on it.\n\nBe careful. I could see a, “oops, we’re pregnant! Now I have to stay home!” moment coming…",
      "id": 2,
      "comments": [
        {
          "score": 5092,
          "content": "> Be careful. I could see a, “oops, we’re pregnant! Now I have to stay home!” moment coming…\n\nHaha, glad it wasn't just me seeing it.",
          "id": 3,
          "comments": [
            {
              "score": 1818,
              "content": "Me either. I feel that this is the end goal. Watch out OP. And you are NTA",
              "id": 4,
              "comments": [
                {
                  "score": 841,
                  "content": "More fool her.  It’s a thousand times harder being the one at home.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1842,
                      "content": "Seriously. Guaranteed she's seeing visions of sleeping in daily, cuddling babies and watching Netflix/Disney+ and doing Pinterest crafts while taking daily jaunts to the park. \n\nShe isn't seeing inconsolable baby wailing, colic, cluster feeding, nap refusal, blowout diapers, ten loads of laundry to wash/dry/put away daily, constant messes of various natures, toddler tantrums, and suddenly it's 6pm and you still have to get dinner on the table and all your kid will eat is chicken nuggets and macaroni.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 542,
                      "content": "Yeah but he said he will have to get a second job and still do housework. This woman just wants a free, easy ride in life. Hell I don't want to work either but I have to. I was laid off for 6 months a couple of years ago and my husband said he wished we could afford it because he didn't have to lift a finger around the house. Dinner on the table as he was walking in the door from work. But I had to go back. We couldn't afford to live as we do if I don't work too and I would never want to put all that on just him. We split the housework because we both work full-time. This woman doesn't care. She wants it all.  I'd leave before he is stuck if I was op. She is gonna get pregnant lay around and him have do it all. Get out now.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 163,
                      "content": "This part! She doesn’t have a clue what she’s asking for.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 53,
                      "content": "It isn't a thousand times harder.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "Bullshit. There are hours, parts of days, whole days, or even weeks when it's hard, but also plenty of time when it's not. I've stayed home and I've worked full time. Much, much harder going out to work exhausted from having young kids to staying home exhausted with them.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Doctor working 14 hour shifts - Staying at home is 1000x harder!!!11\n\nSoldier risking their lives in enemy territory - Staying at home is 1000x harder!!!11\n\nWorking two jobs to make ends meet - Staying at home is 1000x harder!!!11\n\nThis misconception needs to die. Staying at home is not harder than the vast majority of paid jobs. Is it easy, no. But stop making out that it's some kind of superhuman feat just to stay home and raise your own kids. Many would consider this a privilege. \n\nPlenty of parents manage to work and raise their kids BTW. But I guess it's still harder to stay at home according to you.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Not if she's only doing half of the chores and child rearing. OP will have work and his half...totally unfair NTA. She planned this from the start, agree to whatever before and change conditions after.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Seriously, I spent all of yesterday babysitting my niece and nephew, both under 5. It was the most exhausting day I’ve ever had. They were non stop all day.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Nope.  It was much harder for me to be a working parent than a SAHM.  You have all the home things that need to be done…then everything for your job on top of that.  And you can’t phone it in on either of those things.  Being a SAHM was a picnic by comparison.",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "For the first few years. Baby's and toddlers are attention intensive, coupled with everything else. Expecting OP to work two jobs, and then come home and do anything other then collapse, would be insane and lead to burnout/divorce. OP can't win. Works insane hours to support his wifes lifestyle desire, she inevitably feels lonely and files for divorce. A tale as old as time(let alone risk of both OP and wife burning out).\n\nOP got played by his wife and should consider an annulment depending how recent the wedding was.\n\nNTA  \n\n\nThe reality is, we are not biologically suitable for our current civilization structure. Our ancestors developed as hunter gatherers, and then agrarian peoples.  Modernity, is too hard and complex for most people to navigate successfully, so everything goes to crap, more often then not in peoples lives.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I was thinking the same thing. She’s gonna end up preggers in no time. And a SAHWife? To get ready to be a SAHM? Nah.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 369,
              "content": "OMG yes!  Be careful OP.  Your wife is never going to work again.  It happened to me.  She wants to be a SAHM, then your kids are in high school all day, are pretty self sufficient, and she still doesn’t want to work.  Oh, I’ve been out of the work force for too long.  I can’t learn the new technology.  Meanwhile, she’s out with her friends spending lots of money and isn’t even home helping the kids with their homework.",
              "id": 17,
              "comments": [
                {
                  "score": 121,
                  "content": "And then by this point if he hasn't already and wants to divorce he's going to have to pay spousal support because of that time out of the work force.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Considering she wants to transition to SAHW to 'prepare' for being a SAHM this is %100 correct. Now if she wanted to find a WFH and start a savings account to prepare for being a SAHM that would be one thing. But she wants to completely cut their income in half and get OP used to being the only provider. NTA and a little sus as well, what does she need all that time for right now?",
                  "id": 19,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Red flags!!!",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Are you sure we're not married to the same woman. That sounds exactly like my wife.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 155,
              "content": "Right? Start using condoms and keeping them in a locked drawer because I see her stopping her bc without telling OP",
              "id": 22,
              "comments": [
                {
                  "score": 424,
                  "content": "I love the idea that a dude could be *so* paranoid about his wife that he locks away his condoms and then when it gets hot and heavy gets up to unlock his drawer, allthewhile not considering to just... not sleep with her.\n\nIf you're that paranoid about your own partner, you shouldn't lock away your condoms, you should end the relationship lmao",
                  "id": 23,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Or lock up your Unit!!  Keep it in yer pants!!",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 183,
                  "content": "I feel if you are at the point of having to stop your wife from illegally trapping you with pregnancy it’s time to consider leaving and/or couples therapy because this is very unhealthy.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Yep. I’ve got a friend who was in his boat. Two people with good paying jobs and more than enough for their family, but would barely scrape by on one income. After the wedding wife suddenly want to be a stay at home mom more than anything, and hated to be told it wasn’t really feasible. First it was “oops I’m pregnant”. Then suddenly she was “fired” at 6 month pregnant but couldn’t collect unemployment for some nebulous reason. She was “looking for a job” for a bit there, but then “no one wants to hire a pregnant person”. Then she kept asking for a “few more months” of maternity leave as she called it. Their kid is three now. She blows their money as fast as it comes because she never could wrap her mind around the income change, he works so much overtime he never sees his son, and when you ask him about why she can’t work if he’s so clearly stretched so thin she’s got him trained with the “but who would raise our kid if she’s not home”.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "NTA. Get out now before there are kids. It will be much cheaper. She's looking for a sugar daddy so she can laze about.",
              "id": 27,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Oh yeah.\n\nThat lady is screaming for a sexual cut-off.\n\nNTA",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 876,
          "content": "This is EXACTLY what happened with my brother and his now ex-wife. She loved spending, but didn't like working, and even though they'd agreed not to have kids for a while, until both of their careers stabilised, she was suddenly 'accidentally' pregnant. \n\nWe tried to tell him, but he wouldn't believe it at first. Fast forward a few months, she's off work because the pregnancy was 'too hard' for her to keep working (it might've been, I don't know for certain, but I find it highly suspicious that she managed to have a pregnancy that was simultaneously so horrible she couldn't work, but easy enough that she could travel around the country...)\n\nMy brother was stressed, working overtime in a job he hated, buying the most expensive stuff for the baby because she wanted it, and thousands of dollars in debt... eventually he came back to us and told us that she had indeed gotten pregnant on purpose, and that was the end of their marriage.\n\nNTA and make sure all your bases are covered OP. Your wife has already tried manipulating your family to get her way, I wouldn't be surprised if the 'accidental' pregnancy is next.",
          "id": 29,
          "comments": [
            {
              "score": 248,
              "content": "I feel like this is a reason some men choose not to marry. I couldn’t imagine being the only income and working my life away/never seeing my own children because I have to pay all the bills. I’m a women and my husband and I have kids. I worked through all my pregnancies too but they were healthy pregnancies so I was able too ( even though some days could get rough ). We both work and live comfortably working a 9-5 and also both have 2-3 days off a week. I would be livid if he decided to be a SAHD because I would have to get 2 jobs to make ends meet and never even see the kids I helped create. That’s something that both spouses need to agree on before having kids for sure.",
              "id": 30,
              "comments": [
                {
                  "score": 105,
                  "content": "I don't know how but I've dated 3 men in a row that ended up being like this - had jobs, moved in together, then quit/got fired and refused to go back to work, leaving me to struggle with all the bills and the rent. I honestly will never get married because I'm terrified of it, and I am a woman! I am childfree though, so I don't have to worry about the kids part.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Yep there are men who do it as well, I dated some in my early 20s! I’m glad I didn’t have children with them either. I think it’s important for both genders to have a healthy work/life balance before having kids because both of you will have to have time to be an active part of the children’s lives.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Urgh! My ex husband did this! We got engaged, literally a week later he quit his job because it's too stressful and making him depressed. No discussion with me, just went ahead and did it. I was stupid enough to go along with it. I struggled for 3 years paying the bills and when we split he had the nerve to ask me where his inheritance money was...",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "This is a pretty common scenario that gets posted here.\n\nPersonally I don't care how much money my husband makes, but I don't want to be married to someone who does nothing productive with their time and doesn't contribute to our shared goals.  That is a deal breaker to me.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "[deleted]",
                  "id": 35,
                  "comments": [
                    {
                      "score": 3,
                      "content": "My ex quit working then had the nerve to get mad at me for working late. And also expected new cars and things like that.",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 181,
          "content": "Yea seriously. Pull out even if you're wearing a condom and flush the condom so she can't fish it out of the trash.\n\nEta: ok ok, don't flush it. Rinse it with water and pour hot sauce or some other obvious contaminant in it.",
          "id": 37,
          "comments": [
            {
              "score": 594,
              "content": "That's insane, just stop having sex if trust in the relationship has degraded to that degree",
              "id": 38,
              "comments": [
                {
                  "score": 183,
                  "content": "This. If trust in the relationship has fallen so low that I'm hiding used condoms to prevent my wife from, ahem, 'reusing' the contents behind my back, then I don't want to be in that relationship.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 15,
                      "content": "At the very least our sex life is taking a pause lol",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Yes, absolutely.  And I think after that dinner conversation I wouldn't want to be in this relationship.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "If a relationship's trust is so gone that someone isn't even willing to trust their partner with *consensual sex* then the relationship is on the rocks as is. Counseling at the minimum, break up at the worst.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 311,
              "content": "Do not flush condoms, please.",
              "id": 43,
              "comments": [
                {
                  "score": 124,
                  "content": "Correct, rinse under water then rubbish bin.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 48,
                      "content": "[removed]",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 58,
                  "content": "Better to eat them. Let those gastric juices do their magic.",
                  "id": 46,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Flush contents?",
                  "id": 47,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Keep hot sauce hidden in the bathroom and put some in the used condom and tie it off. It’s a fast and funny way to find out if you’re being baby trapped.",
              "id": 48,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 163,
          "content": "Or the ever so popular, “I quit my job,” for no reason at all.",
          "id": 49,
          "comments": [
            {
              "score": 45,
              "content": "I figure this is what's going to happen rather than the oops pregnant scenario.",
              "id": 50,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Followed by the it’s so hard to find a job that I want either before or after the oops it’s a miracle we are pregnant moment.",
              "id": 51,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 91,
          "content": "Also she will never do the SAH \"turns\" thing",
          "id": 52,
          "comments": [
            {
              "score": 28,
              "content": "That part confuses me. I don’t understand how that would even work.",
              "id": 53,
              "comments": [
                {
                  "score": 46,
                  "content": "In my country we have 20 weeks of maternity leave, followed by 32 weeks of parental leave that can be taken by either parent and/or split. \n\nIn practice, my husband and I found it was better for me to be at home (his breasts weren’t as functional as mine, we wanted to breast feed and I hated pumping and knew that would lead to using formula), so I took all 52 weeks, but plenty of families share the leave.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 18,
                      "content": "lol. in the US they have 0 weeks of leave, federally.",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "I shouldn’t have assumed US, I guess!",
                      "id": 56,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "A lot of companies (or countries) have leave for both parents, and you can choose when you take it within a certain time frame. For example, 4 months paid within the first two years. So one parent could take off their 4 months immediately after birth/adoption, then when they go back to work, the other parent takes their 4 months.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Wow. I can’t even imagine what that must be like! Sounds pretty amazing!",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I don't know if it's what they meant, but my husband and I rotate schedules. I work full-time, a regular M - F 8 - 5. He works part-time (because I can't afford to make him a trophy husband yet) on the weekends from 8 - 5, and some shorter shifts during the week sometimes. It _sucks_ because there's no real downtime or rest for either of us, and we don't see each other as much as we like, but he's pretty great at the primary parenting gig and financially, it's a wash between this and daycare.",
                  "id": 59,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "So very true, be careful OP. NTA",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "The good news is you don’t have kids so you can just split up now",
          "id": 61,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "I would take his mom's advice and sit down and figure out what corners need to be cut to make this happen....and just watch as another tantrum unfolds because surprise surprise, that means no TV, no internet, no hobbies for anyone, no extra food other than protein and grains and some, most likely canned, veggies, going down to just a one vehicle household (which op will obviously need to keep since he goes to work and his wife will need to rely on rides from everyone else).\n\nAlso showing her that she needs to do *all* the chores and cooking as a stay at home wife with little to no help from Op and how when the baby comes op still wont need to help because his mom and sister will help with the things his wife can't do while she's caring for the baby",
          "id": 62,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "🤣🤣🤣\n\nExactly this! NTA. She absolutely gets to change her mind about what she wants for her life. And so do you. Perhaps you don’t want to continue being married to a woman who expects to be taken care of and one who wants you to go back to school and start a new career so you can take care of her and your ‘future’ kids. For me, that would be a deal breaker.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "This. OP, sit down with your wife and tell her that if she wants to be a stay-at-home wife, then she picked the wrong partner. That you were clear from the beginning. And that it was also clear your career meant she had to work too. Then ask her if she wants to stay married or if this is a dealbreaker. All the cards need to be out on the table if this isn't what you two want. And tell her that she is not to bring family into your arguments. That it's immature and that her trying to get family to bully you is not going to make you just cave to what she wants.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6211,
      "content": "NTA, I’ve been here and the divorce will be horrible once you have children. Get out now. She’s shown her true colors, this is the warning sign.",
      "id": 65,
      "comments": [
        {
          "score": 1054,
          "content": "Seriously divorce this woman. Nta",
          "id": 66,
          "comments": [
            {
              "score": 261,
              "content": "Or at least get a vasectomy.",
              "id": 67,
              "comments": [
                {
                  "score": 122,
                  "content": "I don’t even think that’s enough here because she wants to be a SAHW now, whether or not kids happen!",
                  "id": 68,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Don't get me wrong but you can't really practice for a child, right? I guess she knows how to upkeep the house but you can't really prepare yourself for the sleepless night and the daily challenges a newborn gives to you. I guess she didn't want to say she wants to be a kept woman until they have kids.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Why would he do that, he said he wants kids and vasectomies aren’t always reversible. He could just go without sex until he starts dating again. People do this all the time!",
                  "id": 70,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 115,
              "content": "I usually don't like hastily advocating for divorce but your wife is manipulative or at the very least a naive idiot. She will have it her way whether you like or not op",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 328,
          "content": "I agree with this. That's just selfish on her part. There's nothing stopping her from working until you are both ready to start a family. Yes, get out now.",
          "id": 72,
          "comments": [
            {
              "score": 99,
              "content": "Get out now & you either spit the assets or split the debt - but BEFORE you have to pay child support",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 316,
          "content": "I agree end this now.  Being stay at home used to mean all husbands needed to do at home was mow the law, shovel snow  and take cars in for service.  If her expectation is you will be doing half the housework and childcare when home (don’t come at me I believe in involved parents of all genders - making a point here) plus working two jobs, or going to school while working to get a higher salaried job you don’t even want when the agreement was you would take turns being stay at home AFTER kids that would be a big nope for me.  I found out after I was with someone for almost two years he expected me to quit work, be a stay at home mom plus have way more kids then I could mentally and physically handle.  If you can do that great but it would have both broken me and been unfair to the kids.  I thought he loved me for who I was but it turned out he expected marriage to magically transform me.\n\nNTA\n\nGood luck OP.  Take care of you.",
          "id": 74,
          "comments": [
            {
              "score": 81,
              "content": "Ya I was wondering myself that if he were working two jobs why would he have to do 50% of anything if and when he wasn't working.",
              "id": 75,
              "comments": [
                {
                  "score": 69,
                  "content": "I'm a SAHM and my husband does no housework or cooking at all. He does home repair, helps with yard work, and drives kids to activities. \n\nHe's willing to do what's needed and when the kids were small he did a lot of diaper changes and baby watching but the kids are older now and don't need care 24/7, and the kids do chores so all the cleaning isn't on me. And I can get out of the house for lunch or dinner with friends whenever. \n\nBasically, housework and grocery shopping and gardening is on me, home repair and making money is on him. I don't think it would be fair to ask him to do 50% of the housework.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 4,
                      "content": "It isn't fair at all her lazy non working ass can do it 100%, just like he's making the money 100%",
                      "id": 77,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 191,
          "content": "Listen to them. I'm a 52 year old man that went through this. My ex claimed show had her \"hours cut\" first. Second, her, \"position had been eliminated.\" I got suspicious when she wasn't looking for anything. This was after I paid for her to go back to college and get a degree, which she could've done after high school, with daddy paying, but it wasn't, \"in her plans\" at the time. Turns out, after talking to her former boss, who I was friendly with as I was in an adjunct field, she had REQUESTED the cut hours and later quit. \n\n16 years and six figures later, I'm done paying child support, which she tried to get extended even though my son never went to college. She now works part time at a soft pretzel place in a mall making slightly more than minimum wage. My current wife and I started a business and now pull a healthy six figure income from the business. It's possible, but let me tell you buddy, there were meals of Ramen and Chef Boy R Dee at the beginning! \n\nLet this be a cautionary tale.",
          "id": 78,
          "comments": [
            {
              "score": 4,
              "content": "I'm curious to know, what happened to your son and all this? You said he didn't go to college.. did he end up as deadbeat as your ex? Or did he do well and followed your example?",
              "id": 79,
              "comments": [
                {
                  "score": 13,
                  "content": "He's doing fine.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Great!",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 106,
          "content": "I was going to say something similar. I haven't been in that situation but a friend has. OPs wife married him under false pretences. Likely she always wanted to give up work but wasn't upfront about it till after they tied the knot because she knew he'd run. She isn't going to change her mind and if OP stays with her she will find some way to manipulate him into funding her lifestyle. NTA, OP, but you may want to reconsider your relationship and if you choose to stay consider a post-nup",
          "id": 82,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "NTA\n\nAgreed. Get out. Suddenly deciding to make you the sole wage-earner after long term discussions to the contrary is a huge red flag. Roping your mother and sister into the debate to guilt you into acquiescence is another huge red flag. This person does not view your marriage as a partnership and her manipulations will only escalate.",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "As a general rule, spouses or partners that casually but blatantly go back on clearly stated and agreed-upon terms of going into a serious relationiship are entitled, narcissitic, manipulative, and abuseive assholes, and they always always get worse.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I know that people tend to jump to divorce every fast on Reddit, but I really do think you should consider it. You’ve been clear from the start what you want and she agreed until she did a complete 180. It’s ok to separate when you guys realize you don’t want the same things. It’s better to divorce now and find people who are better suited, than to have a messy divorce later when you have kids. It also seems like she doesn’t really have your best interest? It’s not just about her comfort (although yes she is carrying the baby for 9 months and giving birth so when it happens I would say she’s more of a priority) but you also deserve to have a bit of comfort. Getting rid of the streaming services or your hobbies, you having to go back to school and change jobs are all sacrifices that you will be making. Where are her sacrifices?",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Are you kidding? This is the warning sign?\n\nThat thing right there is a fuckin las vegas neon sign shaped as a big fat red flag pointing directly at op's wife.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yup - definitely not compatible on the kids front. This is not the mother of your children.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3592,
      "content": "NTA.  And your wife is manipulating your family to make you seem like the asshole.   Tread carefully before you introduce kids into this marriage.",
      "id": 88,
      "comments": [
        {
          "score": 679,
          "content": "In fact, I'd just turn it around on her: \"You do have a point - I want to stay home, as well, let's both quit our jobs and just live off our land.\"",
          "id": 89,
          "comments": [
            {
              "score": 123,
              "content": "Yes! Well as we want kids in the future it would make more sense for you to be a SAHW when you're pregnant and recovering from pregnancy, so I should really get my turn now. You can support me as a SAHH for a year, then it can be your turn!",
              "id": 90,
              "comments": [
                {
                  "score": 36,
                  "content": "Let's ruin our credit together. Yay ! 🤪",
                  "id": 91,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Or “Yes - we can go ahead and start that “taking turns staying home” thing”",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 181,
          "content": "This is the best answer here OP. Listen to it.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "Read this as: \"GTFO OP, because she isn't going to change and you're on a one way train to resentmentville.\" \n\nShe's trying to change the deal, to me that would be a dealbreaker. You need to have a hard think about what divorce means and how it will impact you if you let it happen with her as a SAHW vs. getting a divorce where you both have relatively equal jobs.",
          "id": 94,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "Great advice. I’d go further to say OP, don’t have sex with this woman at all until this issue is resolved. Accidents and ‘accidents’ happen.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2245,
      "content": "NTA, but this sounds like a HUGE marinara flag. Anyone who is so entitled (and honestly narcissistic) before children is only going to get worse after.\n\nLet's be real here she wants to stay home, not work, still have you be responsible for half the housework, AND is pressuring you to change careers away from something you enjoy to be able to afford her a responsibly-free lifestyle.\n\nAnd in top of that, she tried to get your family involved?\n\nThis reeks of childish entitlement.",
      "id": 96,
      "comments": [
        {
          "score": 458,
          "content": "Manipulation is my assessment. What really threw me off in this story was the “go back to school and start over” bit. I just can’t",
          "id": 97,
          "comments": [
            {
              "score": 98,
              "content": "And if he *does* that whole we'll take turns who works will turn into her saying \"you can't be a SAHD now, that would waste all the work/cost/time/education you put into changing careers! I'll just stay at home with the kids and you can keep working so that career change is worth it.\"",
              "id": 98,
              "comments": [
                {
                  "score": 7,
                  "content": "That person is beyond horrible and I hope OP considers divorce and moving on to a better person and relationship. I have special hate in my heart for manipulative people tho so I don’t know if waiting a bit and seeing things out is a wiser decision.",
                  "id": 99,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I’m all for growing your career opportunities, but he wouldn’t even benefit. She’d just stop working and eat up the increased earnings!",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 191,
          "content": "I was wondering that myself. Why should he have to work possibly 2 jobs to support her SAH dreams AND still be responsible for 50% of all the housework and childcare?  Not that she should be responsible for everything, but being a SAH wife/mom means housework and childcare is your job now during business hours, so you do the majority of it and you split what's left.",
          "id": 101,
          "comments": [
            {
              "score": 103,
              "content": "The problem for OP is that she has already proven completely willing to go back on an agreement.  She would probably agree to do all the housework just to get him to go along, but how can he trust her to follow through?  And he shouldn’t ever give up a share of childcare, or he ends up an outsider in his own home just there for the paycheck.\n\nI’m a little biased against anyone who wants to be a trophy wife.  No issue with SAHPs if that is what a family wants and it works for them.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Also she thinks his family should come and help her too because apparently cleaning the house would be too much for her even before kids. This woman is lazy and just wants an easy free lifestyle she expects you to finance while she lays around and eats bon bons all day watching soap operas. Leave her now. Find someone who really wants a partnership and not a sugar daddy",
              "id": 103,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "Half the housework *for now. She’ll eventually end up doing the bare minimum while he’s at work and then making him do more when he gets home. Had a friend like this and the wife eventually started saying she was depressed being home with nobody to talk to and couldn’t handle her responsibilities. She’d hire a babysitter while she went shopping and to lunch with friends.",
          "id": 104,
          "comments": [
            {
              "score": 6,
              "content": "I don't see why he has to do half the housework if she has no job at all, not even kids. If she had kids, I'd see him helping. However, she has no need of help at the moment.",
              "id": 105,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "great now i want some mozzarella sticks",
          "id": 106,
          "comments": [
            {
              "score": 10,
              "content": "you beat me to it",
              "id": 107,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Cheese curds are much better. A superior cheese to breading ratio and no dribbled out cheese.",
              "id": 108,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Have you tried halloumi cheese sticks? I loooooooove mozza sticks but Halloumi sticks are like mozza sticks on crack.",
              "id": 109,
              "comments": [
                {
                  "score": 5,
                  "content": "Even better, pepper and then grill the halloumi and then hit it with some lemon zest and drizzle with good olive oil.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I love that marinara flag is a thing",
          "id": 111,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "It seems like he and his wife have two very diff end goal. Since finances are one of the four big reasons people divorce I’d say get to a therapist or a lawyer now",
          "id": 112,
          "comments": [
            {
              "score": 3,
              "content": "Therapist AND lawyer.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Not the gd marinara flag 😂😂😂😭😭💀",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "This is another case of \"I don't wanna adult, you do it!\"",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Honestly if she’s so adamant on it, I would’ve told her I do little to no housework if that’s the life she wants.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1739,
      "content": "NTA\n\nYou talked about this before marriage. That's great.   \nShe has now broken the agreement the two of you made.  \nPlease do all you can to prevent her from getting pregnant until you can resolve this.   \nOtherwise, you're going to be really trapped and strapped financially, too.\n\nCounseling to see if there's a way to resolve this fundamental difference in desired lifestyles between you is the only solution here. The problem is that you will now have trust issues because she seems to have said one thing to get the ring and has now changed her tune. No telling whether she will agree to return to the prior arrangement and then pull another switcheroo when she gets pregnant. \n\nAnd your mother and sister can express their opinion on the matter -- once. But then they should have shut their mouths and said that the two of you need to work this out privately. So I understand your frustration that drove you to ask them those questions and I think that was about as polite a way to shut down the comments as you could muster. Not sure I would have been that restrained. \n\nGood luck.",
      "id": 117,
      "comments": [
        {
          "score": 131,
          "content": "This is a well considered response.  Hope the OP considers this good advice.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "Seriously. The guy needs to wear a chastity belt until this is worked out.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": ">So I understand your frustration that drove you to ask them those questions and I think that was about as polite a way to shut down the comments as you could muster. Not sure I would have been that restrained.\n\nThis, yeah. Both OP's wife and his family are way out of line here, and I applaud OP if that reply was all he did - mom and sis need to butt out and handle their own families.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 846,
      "content": "NTA. Don't be surprised if your wife quits work one day and doesn't tell you. Also do be surprised if she ends up pregnant soon either. She is entirely manipulating you and if it were me I would run. I wouldn't trust to have sex with her in fear of her getting pregnant to force what she wants even more.",
      "id": 121,
      "comments": [
        {
          "score": 242,
          "content": "I was thinking the same thing. She’s gonna baby trap you. Frankly I don’t think this relationship will work out In the future if you are this divided. \n\nYou are NTA, but u need a serious talk with her",
          "id": 122,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 90,
          "content": "Or just divorce her quickly while she still has a job. \n\n\nI'm not kidding either, if you can't trust someone financially anymore it's insane to stay married to them. Like, if they were bf/gf I wouldn't tell them to break up, but once married that all changes.",
          "id": 123,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 736,
      "content": "NTA - your mother and sister have no place in that conversation in the first place.  Sometimes, you need to hit people in the face with something outrageous to get them to understand that.\n\nNow, as to you and your wife, you need to come to an agreement you can live with, whatever that is.  Consider malicious compliance.  When the topic comes up, lay out what needs to happen in order for her to stay home.  If she wants to go back to a 1950's lifestyle, she needs to take the whole package.  \n\n* So, yes, you can indeed, get rid of streaming services.  It's not like you are going to have time to enjoy them anyway with all the extra work you are going to have to pull to make the budget work.\n* You can go from two cars to one.  Of course, since you are working and going to school, you will need the car nearly full time.  Your wife will have to make do with public transportation, rides from friends, and times you are at home and don't need the car.\n* You can put a hobby or 2 on hiatus, but it's only fair that your wife do the same.\n* If she doesn't have a job outside the home or a non-MLM home business, then the home \\*is\\* her job, and it won't be a 50/50 divide on the housework, but more like a 90/10 with her being the 90.\n* Same thing with eventual childcare.  She will be \"it\" while you are at work - and remember that work will include class time, reasonable study time, and group project time while you are in school to get that better job.  Whichever one of you is the SAHP will have the 90% childcare.  That's just the way it is.\n* Taht assumes that you aren't too tired to make a kid in the first place.\n* And, you will need to seriously budget.  More like militantly budget.  Down to the penny.  Both of you get an allowance for personal stuff.  And, it won't be much.  No fair pulling fun money from the grocery budget.  No lunches out for either of you.\n\nSIt down and make out the budget that you will need to have in order to make this work.  I'll bet it will be eye-opening.",
      "id": 124,
      "comments": [
        {
          "score": 625,
          "content": "I think I'm going to use these billet points the next time the conversation comes up lol I tried a theoretical budget sheet to show what life would be like if I went back to school or we tried surviving off my salary alone and all I got for it was \"Well that's what the better job is for.\"",
          "id": 125,
          "comments": [
            {
              "score": 610,
              "content": "That response from her is disgusting.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 471,
              "content": "That's a really terrible answer from her.  She doesn't sound like she wants to be a partner. She wants you to just take care of her.",
              "id": 127,
              "comments": [
                {
                  "score": 240,
                  "content": "Agreed.  She doesn’t want to be a stay-at-home anything.  She wants to be a kept woman.  NTA.",
                  "id": 128,
                  "comments": [
                    {
                      "score": 89,
                      "content": "Yeah I’d be worried about how she would take care of the kids if she’s gunning to not lift a finger 😬 - I think she’d probably push it off in the parents",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Let someone else be her sugar daddy",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Exactly what I tried to say in my comment. You've hit the nail on the head. She really comes across as manipulative and controlling. It's terrible",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 166,
              "content": "You can create a whole damn powerpoint presentation and it wouldn't matter because this woman has already chosen her course in life. The question is whether you will go along or not. \n\n\nYou're heading for an ultimatum conversation, not budget talk. You can't stay married to a partner who wants to not work for the next 2-3 decades or forever, so if this is her choice then she needs to go and find a partner who wants the same. And she absolutely needs to hear that coming from you. \n\n\nYou need to do this ASAP before she gets pregnant or quits her job because it looks like she's manipulative enough to attempt to do so. It would be a mistake to not take her seriously and think you can talk her out of it by telling her she won't get Netflix or a car.",
              "id": 132,
              "comments": [
                {
                  "score": 39,
                  "content": "100%. She’s already shown that she’ll go back on her word without a second thought about how it will effect OP. Even if she listened and agreed to his points, I wouldn’t trust her to follow through. People can and do change their minds, but it would be totally different if she expressed a valid reason and had a plan for how to make it work, not “because I want to” and “you’ll just have to work harder”. She didn’t change her mind, she just pulled a bait and switch. NTA.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yup.  If someone is lazy, entitled, and deluded, there isn’t a powerpoint in the world that will change their whole personality.  At best, she’d get it together for a few years but the relapse would already loom on the horizon.",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 104,
              "content": "Whatever kind of birth control y'all use, you better take extra precautions because she sounds like she's determined to get what she wants. One way or another.",
              "id": 135,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 89,
              "content": "[removed]",
              "id": 136,
              "comments": [
                {
                  "score": 27,
                  "content": "I'm giving you Au for that",
                  "id": 137,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Thanks!!!",
                      "id": 138,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 75,
              "content": "You realize another way of interpretation there is \"Be my slave and sacrifice your life for my benefit\"?  \n\nSeriously hate to break it to you but this relationship is over it just hasn't finished ending yet. You may not believe me today but you will when she quits her job, gets suddenly pregnant (not always that order)  and you're drowning in debt from trying to support her life choices and spending habits. You can either bail now while you aren't under water or later when you spend decades trying to get out from under the problem after the divorce. \n\nShe's nailed the warning sign up on the wall for you. Read it and react accordingly or suffer the consequences.   You're also NTA for your response to family. They're enabling her to destroy you. They obviously don't like you much.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "I'm currently a stay at home mom, and if that's what she wants to do, honestly the best thing to do is stop spending her income now and bank all of it towards savings/retirement/debt repayment until you're ready for kids. That way when you have kids and she stops working a) there are no massive changes to your budget needed up front (the big expenses in the first few years are childcare which you won't need and medical) and b) you have the savings cushion built up to handle anything unexpected that comes up.\n\n&#x200B;\n\nWe still have problems in our lives, but money isn't one of them, which helps a ton.",
              "id": 140,
              "comments": [
                {
                  "score": 7,
                  "content": "So he should accept what he doesn’t want? It sounds like they need both incomes now, so I’m not sure how he’d save enough in a few years—especially for retirement! If she never goes back to work, retirement sounds impossible.",
                  "id": 141,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "What about an education fund?",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Are you sure your marriage is worth it?",
              "id": 143,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Wow. Just wow. I'm sure other people have pointed this out, but what she said right there is her true motive. Basically all she wanted to do was lie to you about how you guys will both work even after you get married etc. You said that you guys spoke about it and that's what was agreed, so she was lying to you and telling you what you wanted to hear. What she really wants is to get married and just do nothing from her end with regards to finances. And I bet that even after you have a kid, she'll complain about how difficult it is to raise a kid and play the victim then too. \n\nSorry to be blunt about it OP, but this woman is using you. Also, the fact that she brought this up unprompted in front of your family shows that she's manipulative. She knows that if she just talks to you about it, you'll stand your ground. But bringing it up in front of your family gave her backup (your mum and sister). And what you said to them was absolutely right. But I (and I'm sure most people on here) think she's not gonna drop it. She's gonna keep pushing and keep finding reasons. And I'm sure she'll find more backup from her friends and family. I'm worried for you OP. I hope you have a prenup or something, because her saying what she did and the fact that she lied to try and get what she wanted is a massive red flag. \n\nJust FYI tho, I understand that sometimes, ppl have a change of heart about their role, career etc, and that's fine. But based on everything you've described, this isn't a change of heart. This seems calculated and planned, just for her to leech off you. Telling you to change your career just in order to give her the life she wants is fucked up. You're NTA, but please think about this, because you deserve better.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I think you need to sit down and really ask yourself if this is the woman you want to spend the rest of your life with man, it doesnt sound like you both have the same life goals.",
              "id": 145,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "100% agree here. Both husband and I are attorneys and very career driven pre kids. Virtually no house chores because we could afford all the help we needed. We agreed we both loved our jobs and would work. Kid #1 and #2 came back to back and my outside work was cut back due to maternity leaves. We cut back on expenses and started sharing house/child care chores 50/50. Then kid #3 came with A LOT of intensive medical needs including frequent medical related travel. So I quit work as agreed upon by both of us because she just needed it. My mother retired early as well to help with the other two (because three under 4). My husband still made enough for us to survive but (A) our living expenses were slashed and slashed and slashed to make up for it and (B) household chores definitely became a 90/10 split because I am home all day. Yes caring for a special needs child is a lot but he is working outside the house and commuting so just literally not there to do it. If he has an accident because he falls asleep driving or loses his job then we are really screwed. Now kid is stabilzed and all are teens and I am back to work and the standard of living has gone back up and our work hours are similar and chores/child needs are split 50/50 again. She is gonna have to do all the work if she is at home and you are working and school.",
          "id": 146,
          "comments": [
            {
              "score": 13,
              "content": "I'm glad your kiddo is doing better now!",
              "id": 147,
              "comments": [
                {
                  "score": 8,
                  "content": "Thank you kind stranger! We were lucky and blessed.",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "I agree on the 90/10 split on childcare and housework. That's rhe way I was raised. Mom stayed home when we were little and did the housework. That's my first thought when I read that OP was still expected to do half the house work. The SAHP does that",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yep. I have been the stay at home parent with the tight budget. It is absolutely NO fun whatsoever. \n\nIf she wants to stay home with children (which honestly is not a bad desire) then she needs to WORK now, and build that savings-and come up with ideas for passive income when she does stay home and get that going now. That's reality.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I still think this is not enough. Women back then were raised and taught to be moms and caretakers. They did it out of need (not easy to study or work) and/or out of upbringing. His wife just seems to wanting to be home out if laziness so she won't do a good job at it. \n\nNot to mention, one income was better compared to the household budget back then.",
          "id": 151,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 465,
      "content": "I’ve been a sahm for 10 years.  The decision for one person to give up their job is a two yes situation.   Not to mention, you don’t have any kids anyway.  Does she think she’s a trophy wife?  NTA.",
      "id": 152,
      "comments": [
        {
          "score": 369,
          "content": "I'm still trying to figure out what kind of prep goes into eventually being a SAHM when we currently aren't trying for kids.",
          "id": 153,
          "comments": [
            {
              "score": 268,
              "content": "Are you sure she’s not trying…. If she’s the one responsible for contraceptives I wouldn’t be having sex right now.",
              "id": 154,
              "comments": [
                {
                  "score": 210,
                  "content": "I always use condoms and she hasn't asked me to stop using them.",
                  "id": 155,
                  "comments": [
                    {
                      "score": 324,
                      "content": "I'd keep them somewhere she can't access them. I'm not saying she'd poke holes in them, but I'm saying to be smart and be safe.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 76,
                      "content": "Easy to poke holes in them where you’re not around. I’d be careful.. Consider abstaining altogether until this issue is fully resolved. She can’t get pregnant if you don’t have sex.",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 63,
                      "content": "You better hide your condoms, sounds like she’s getting ready while you’re not.",
                      "id": 158,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 57,
                      "content": "Mate... For the love of god, stop having sex and get a divorce before she gets knocked up and this woman takes half your income for the next 19 years.  You're incredibly lucky: she accidentally told you who she is now.  Trust me, she won't be going back to work after that couple of years home with the new kid(s) -- she lied about the life choices and about being an adult: adults who don't have kids work and contribute to the household.\n\nFind someone who isn't lazy af.",
                      "id": 159,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 34,
                      "content": "You sure they haven’t been tempted with? Open one and run some water through it….",
                      "id": 160,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "oh careful dude!",
                      "id": 161,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Yeah, sorry OP but condoms aren't 100% effective either. Like others have said, if your wife is *this* determined to do SAHW/SAHM and you don't even have kids yet, she can easily poke holes in them and that's that. If you aren't interested in having kids yet, consider getting her to get birth control shot or birth control implant. She seems like she wouldn't be trustworthy enough to not \"forget\" an oral BC. And even if none of all that other stuff, condoms can and will break in various circumstances. The safest way to keep from an accidental pregnancy is BC *and* condoms, each has the other to fall back on in case of failure.\n\nThat being said, if she already doesn't respect you enough to not keep to agreements you and she made before marriage, she's not going to respect you down the line either when you do have a kid, and it'll just get worse. I'd consider counseling if I were you. If she can turn around her behavior and get counseling for her manipulative behavior, there's a chance you might could work things out. But don't go breaking your back trying to show her the difficulties of the life she's envisioning. Just flat out say no if it isn't what you want. She can respect that, or leave. You've tried to offer compromise, have been super fair (more fair than I ever would have!). She wants you to hop through all these insane hoops so she can have a comfy cushy lifestyle while you do all the hard work, and that's not right. \n\nFor the record, I think someone mentioned in a sub somewhere about how there's counseling specifically geared towards an abusive person, I don't remember what it was called exactly. You might consider this route, because her behavior sounds narcissistic and selfish at the least. Regular counseling would just give her an outlet to say you're being unfair, controlling her goals, etc etc, with the counselor validating her abuse. That other counseling would help her recognize her behavior and actions as wrong and how she can go about changing that behavior to something more positive. Good luck OP, I really hope things get better for you!",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Yes, but what does She use?\n\nCondoms alone aren’t very effective in the long term.\n\nIn real life, about 15% of people who use only condoms will get pregnant each year.  https://www.plannedparenthood.org/learn/birth-control/condom/how-effective-are-condoms\n\nIf condoms are your only contraceptive, you need to add a second reliable method if you’re serious about preventing pregnancy.",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Buy your own condoms. Don't let her offer one up to you that was in the bedroom drawer or bathroom cabinet. If you're having sex, you just buy a pack of 2-3 or whatever, pull that seal off, open the fresh box and put on one. \n\nShe can prep condoms to break, tear, poke holes in them. \n\nAnd as mad as it sounds, dispose of them. Everyone throws them in the bin, bedroom, bathroom and empties it fairly quick. But you don't want her taking it as a doggy bag and im not kidding a turkey baster, filling it with your baby batter and squeezing it in there....\n\nYeah....that...",
                      "id": 164,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 37,
              "content": "NTA and I can't figure it out either: does she need the practice? Will there be a course for which she'll receive a certficate? What happens if she fails? My guess is that she'll 'prep' by doing SFA, but she doesn't get to unilaterally change course in mid stream and expect you to put in all the effort.\n\nSorry dude, but if she's a 'trophy' wife, I think your trophy was the booby prize.",
              "id": 165,
              "comments": [
                {
                  "score": 5,
                  "content": "What does SFA mean? I googled it but nothing came up that would make sense in this context",
                  "id": 166,
                  "comments": [
                    {
                      "score": 14,
                      "content": "My guess would be \"sweet fuck all\" lol",
                      "id": 167,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 27,
              "content": "Obviously she needs time to find hobbies to do when both your parents are taking care of the kid ...",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "There is no prep. I was a working mom for 14 years until I got pregnant with the one I’m pregnant with now. We’d actually planned for me to work until the birth and reassess our situation then. We’d always planned on me staying home this time, but if it wasn’t possible I fully understood that I would go back to work after 3 months. I’m high risk so I ended up leaving my job at 4 months pregnant. But this was all something we heavily discussed. My husband had to push me to leave my job. There is absolutely no preparation needed before she’s even pregnant.",
              "id": 169,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Before we had kids, I sat at home for a year at most did some cleaning and reorganizing. The SAHM prep only happened when I got pregnant by accident. Even then, that was only shopping for deals for baby stuff and reading/watching some baby caring content. Most of the parenting stuff happens after birth and is more of a learn-on-the-go situation. Each baby is different, you can’t “prep” for babies.",
              "id": 170,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Learning to sleep in.  Not making 'must do' lists that maximize time as now you have time.  Eating out with friends.  Watching TV or window shopping. It takes awhile to make the adjustment.\n\nNGL, it took me about three years *after* retirement before I no longer jumped out of bed, made a job list, worked the list, and tackled projects for my house.\n\nJokes on your wife, though, if she does become a SAHM and does all the housework, etc.  That job is ***so*** much harder than working as there's just no downtime, it can become mind-numbingly boring, and she'll be on 24-hour call.  (might be different if family will help ***all*** of the time)\n\nOh, you're so NTA. Adding another human and reducing your income isn't something a partner should spring on someone.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Zero. Zero prep. She just doesn’t want to work.",
              "id": 172,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 299,
      "content": "NTA\n\n&#x200B;\n\nGet a divorce now, your wife is an AH: She is trying to use your family to pressure you. She is an AH.\n\n&#x200B;\n\nAnd: Since you don't want her tp be a SAHW/ SAHM, make sure you don't get her pregnant.",
      "id": 173,
      "comments": [
        {
          "score": 10,
          "content": ">make sure you don't get her pregnant. \n\nOP, take this advice seriously. Your missus is likely to 'accidently' get pregnant and quit her job the moment she does or even before and expect you to just deal with it. \n\nHighly recommend counseling and an exit strategy. NTA.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 191,
      "content": "NTA but I wouldn’t be surprised if you came home from work one day and she told you she quit her job.",
      "id": 175,
      "comments": [
        {
          "score": 92,
          "content": "Because it’s *too stressful* and she ‘needs to be relaxed / mentally prepared before she gets pregnant’ /s",
          "id": 176,
          "comments": [
            {
              "score": 15,
              "content": "Then getting pregnant somehow never happens but she never looks for a job again",
              "id": 177,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "\"I got fired\"\n\n\"They were downsizing\" \n\n\"They cut my hours so I quit\"\n\n\"They were treating me unfairly, I had to leave\"",
          "id": 178,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}