{
  "post content": "I'm 40s F and have 2 children, \"Dax\" M12, and \"Mia\" F14. (Not real names for privacy.) \n\nMy kids don't get along super well, Dax thinks \"pranks\"are really funny, I guess like every 12 year old boy, and he annoys Mia with them a lot. It's something my husband and I have been working on as it's the source of many fights between them. \n\nDax gets a lot of prank ideas from YouTube and TikTok and will often recreate what he sees. Most of them are harmless (something like a fake spider in her food etc.), but this time I think he went too far.\n\nDax thought it would be funny to put Saran Wrap over the toilet before my daughter went to the bathroom. He says he got the idea from online? Idk if this is a thing but it's a terrible prank. Basically he put plastic wrap under the toilet seat so if someone sits on it, well pretty much it makes a mess instead of going in the bowl. Yeah I know, ew. \n\nSo he does this right before Mia goes in the bathroom to pee. When she gets in there she sits on the seat like normal, pees, and since there's plastic wrap over the hole, her pee collects on it and gets everywhere, all around the ground on the toilet and on her. \n\nShe comes to me crying. She's embarrassed because she's a teenage girl and this is... disgusting. I told Mia to shower and not worry about the mess. \n\nHere's where I might be TA... I go to my Son and yell at him for what he did. I tell him that's not an appropriate prank and he's old enough to know that's not okay. And then I made him clean in up. \n\nHe started crying saying it's unfair I make him clean his sisters pee. \"It's gross and he's going to be sick.\" He says \"it's from her body so she should clean it.\" But it was all his fault and literally his mess to deal with, I don't know why I should humiliate my daughter further or why I should have to clean it. And biggest thing, he needs to learn. \n\nI told him the mess was his fault and he should think about the repercussions of his actions next time, because this is what his prank caused. And then I stood in the doorway and watched as I made him clean all of the urine off the floor and toilet. \n\nI think it was an appropriate punishment considering it's really just the natural consequence of what he did, and it doubles as a general lesson in how to clean a toilet which he has to learn at some point anyway. \n\nWell my husband disagrees. This all happened while he was at work, and after he got home Dax complained to him. \n\nHe told me I was overly harsh on our son and \"put him in danger\" by exposing him to germs. But I gave him the same gloves I use when I have to wash the toilet and it's not like he was unsupervised. \n\nBut my husband is mad at me and told me I want \"too far\" and that's \"bad parenting.\" Of course my son is mad at me too. But my daughter is on my side. \n\nAITA? Am I a bad Mom?",
  "id": 1,
  "comments": [
    {
      "score": 28109,
      "content": "[deleted]",
      "id": 2,
      "comments": [
        {
          "score": 8234,
          "content": "Son already exposed himself when he decided he wanted to saran wrap the toilet. I mean there is evidence that poop bacteria spreads all over the washroom once u flush even if u put down the seat. NTA",
          "id": 3,
          "comments": [
            {
              "score": 1625,
              "content": "That was exactly what I thought but I guess cooties play by different rules than legit contamination hahaha",
              "id": 4,
              "comments": [
                {
                  "score": 1854,
                  "content": "Not just any cooties, *girl cooties.*  \nAnd, frankly, I'm concerned about that.   \n\"Dax, there's nothing different about cleaning a girl's bathroom.  \nIn fact, it's time for you to learn to clean the bathrooms just like every other human needs to.  \nAnd stop whining.\"",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1958,
                      "content": "Yeah, husband's reaction has a real strong whiff of \"cleaning toilets is women's work.\"",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "But what about the bacterias!!! Like noone else cleans up piss and shit.\n\nMake sure he's aware that when he was a baby you cleaned shit directly off his ass",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "...........in fact, that will be (one of) your chore(s) for the foreseeable future",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 192,
                  "content": "[removed]",
                  "id": 9,
                  "comments": [
                    {
                      "score": 150,
                      "content": "[removed]",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 32,
                      "content": "Welcome to life—actions have consequences and accountability.  Don’t want to clean up piss? Don’t put Saran Wrap on the toilet.  Now he knows.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 41,
                  "content": "[removed]",
                  "id": 12,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Aren't there female cooties and male cooties/s.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1396,
              "content": "Agree and also husband should start cleaning the toilet weekly too. It's quite clear he never does it and op does and high time to learn the toilet doesn't clean itself magically.\n\nNTA in the least op.",
              "id": 14,
              "comments": [
                {
                  "score": 572,
                  "content": "\nI guess he thinks women are immune to toilet germs but men will contract the Black Death if their precious hands get anywhere near a toilet and bottle of Clorox?",
                  "id": 15,
                  "comments": [
                    {
                      "score": 195,
                      "content": "Oh, hey, have you met my ex? \"Bathrooms are so gross I can't handle dealing with the germs and also I would rather continue to use it for months without cleaning it than get my precious hands contaminated by the cleaning products\" 🙄",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Second, this is the best way for your son to learn that actions have consequences. It's his fault there is a mess, he gets to clean it up.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "[deleted]",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Also, cleaning the toilet is one of the easier things in the bathroom.  Put in stuff, let it sit (I like the stuff that clings so I can get it everywhere).  Get brush, scrub with brush.  Flush.  Rinse brush.  Flush again.  Put brush away.\n\nIn any normal house full of reasonably hygenic people, cleaning the toilet isn't a big deal.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 513,
              "content": "And if she did poop, he would have found it a lot more disgusting to clean. He should feel lucky.",
              "id": 20,
              "comments": [
                {
                  "score": 208,
                  "content": "He is lucky she didn't have her period!",
                  "id": 21,
                  "comments": [
                    {
                      "score": 27,
                      "content": "I totally thought this is where it was going and imagined a murder scene in that bathroom.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I'd have taken it and shoved it into his shoes.",
                  "id": 23,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Husband and son use the toilet and I'm sure they don't have 100% aim, there must be pee around there. OP exposes herself to their germs too. \nYeah this was a proper punishment for the crime, OP did good.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "OP handled this fantastically.  Her husband, well, his reaction leaves *a lot* to be desired.  Furthermore, her husband should be totally on her side and driving the point home to their son that he should consider himself fortunate to only be cleaning a toilet.  \n\nThe message isn't becoming clear enough to the kids, and even adults, who carry out these viral pranks in an isolated environment such as a home that the same antics don't translate to \"Hahaha\" in the outside world.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Oh man…that just makes me wonder if he touched the entire saran wrap roll to the toilet while doing it…",
              "id": 26,
              "comments": [
                {
                  "score": 7,
                  "content": "Ew, I hadn’t even thought of that. Even if he didn’t, I’m sure he handled the roll after handling the toilet seat with ungloved hands. I hope he didn’t put that back in the kitchen. If he did, part two of his natural consequences should be disinfecting the shelf he put it back in, and paying for the replacement roll.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3522,
          "content": "\"Husband, since you feel strongly about this, the next time something like this happens we will allow you to clean up the mess.\"\n\n\"Oh, that's not fair? Well asking Mia to clean isn't fair because she didn't do anything wrong. And for sure I'm not going to do it because I think our son should do it, because he's the perp. So if you feel strongly that son shouldn't clean up, that only leaves you to do it.\"\n\n\"Oh, was that not the outcome you had in mind? What, cleaning up the bathroom is beneath you?\"",
          "id": 28,
          "comments": [
            {
              "score": 1643,
              "content": "Absolutely this. \n\nOP, Dax has been told multiple times that his sister does not find his pranks funny and does not want to be on the receiving end of them. He continues to do it anyway. Cleaning the bathroom needs to be the beginning of his consequences, not the end of them. \n\nFrom here on out, Dax needs to be 100% responsible for the ramifications of any pranks he pulls. He puts something in someone’s food and makes them not want to eat it? He’s now responsible for getting that person some replacement food. He does something that causes someone’s clothes or bed to get messy? Guess who’s doing that laundry?\n\nHis pranks are not harmless, and his sister should NOT be expected to put up with them. He needs to be told that pranks can only be done with willing and consenting recipients, which means his sister is out of the running. Full stop. She deserves to feel comfortable and safe in her own home, and you need to stop letting her brother steal that comfort and safety from her.",
              "id": 29,
              "comments": [
                {
                  "score": 570,
                  "content": "Exactly this. I thought the fake spider in the food thing wasn't harmless, especially to a 14 year old girl. Call me dramatic if you want but this could cause anxiety around food/eating disorders etc. Noone should feel scared/on edge eating in their own home. NTA OP",
                  "id": 30,
                  "comments": [
                    {
                      "score": 299,
                      "content": "Heck, my husband once joked about a specific bug I have a phobia about being in my food and I have never eaten that particular food again. He has also never joked about bugs being in my food again.\n\n(There could be some childhood trauma reasons I reacted that strongly and I am REALLY not interested in exploring them. The important thing is that food-related pranks are off-limits for me.)",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Agreed. I admit I have anxiety, so maybe people are much more logical than me. But if someone was messing with my food, I would be afraid to eat and would take to hiding food in my room/only eating from brand new packaging.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 172,
                  "content": "Such an excellent response.   And if Dad is concerned about exposing Dax to germs, Dad should be fine with cleaning it up himself.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "I would kind of go old school with this kid, if he put something in somebody's food he should eat it. My grandmother didn't like wasting food, if we did this as children she would have made the prankster eat the food. Probably even if it was fairly toxic to their health but maybe not take it that far.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Unwanted \"pranks\" is just bullying.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Your son is behaving poorly, and so is your husband.   I would not have allowed my son to torment his sister like this.  I wouldn't allow either of my children to torment anyone like this.\n\nIs he doing this at school or just at home?",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "readthethings13579 makes an extremely important point - \"willing and consenting\".  This is an important concept for a 12 year old boy to start learning, before he wants to play other games with girls.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 7,
                      "content": "He should’ve been learning that long before 12. :( But yeah, he needs serious remedial lessons now. \n\nOur kid understood it from age 8 if not earlier - just stuff like you don’t hug someone without permission. You could get blanket permission from someone - like his dad told him it was always fine unless it was dangerous timing like if he was cooking - but if you didn’t have that you had to ask. Like he always had to ask me because I have autoimmune arthritis so sometimes hugs hurt. He went through a phase of liking to give ‘surprise’ hugs and EVEN THEN he understood that he had to get permission in advance - like earlier in the day - to do a surprise hug at some point in the future. It did not seem to interfere with his hugging process to do so. If he could grasp something with multiple steps like ask early for permission to do something later, this kid can learn you don’t prank people who don’t consent to participating.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "It's called bullying, which is the goal of most pranks to embarrass and humiliate the victim. In this case, the perpetrator was also humiliated and embarrassed. Maybe he'll think twice before pulling another study. Your husband has a golden child and it's not his daughter. He's going to ruin his relationship with her if he doesn't stop supporting his son's behavior. I'll bet he thinks it's funny, too. NTA",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": ">Cleaning the bathroom needs to be the beginning of his consequences, not the end of them.\n\nAgree 100%\n\nOP — NTA\n\n\"Pranking\" is only fun for the person pulling the prank, not the person being pranked. For the sister, she's basically being constantly harassed.\n\nThe thing about calling it a \"prank\" is that not only does she get harassed, she later gets gaslit about how it's \"just a joke.\"\n\nI might be extrapolating this too far, but not punishing the son is low-key teaching the daughter that it's ok to be constantly treated badly by men, and that it's her job to get over it. *It's a really bad message.*",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "i’ve heard countless stories about pranks being taken too far & not in the sense of too far in this post (worse than that). i understand this might be a phase that a child takes interest in, but what happens when someone is actually harmed by one of these pranks? who is the one punished for physical harm? the perpetrator, thus the one pranking. \n\ni’ve heard of pranks where people have lost fingers, etc. i know this is a drastic example, but if possible consequences aren’t thought of, this could easily happen in the future. it’s complete lack of disregard for others.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": ">He needs to be told that pranks can only be done with willing and consenting recipients, which means his sister is out of the running.\n\nThis is a great time for them both to learn a lesson about consent:\n\n1. The son needs to learn that consent *is required.*\n2. The daughter should get a clear message and strong parental backing that *she does not have to put up with treatment that she does not want or consent to*.\n\nThe son sounds like he's on his way to becoming a little asshole, so I think he really needs to internalize that **enthusiastic consent** is what we are talking about.\n\nI'm really worried that the father low key is fine with the daughter learning that her job is to tolerate abuse. He needs to step the f\\*@k up and make it clear that what the son did is wrong, and that this isn't on her. She needs to know (for the future) that she can tell people to stop, that she can set boundaries and consequences, and so on.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 83,
              "content": "Perfect. \\*chef's kiss\\*",
              "id": 43,
              "comments": [
                {
                  "score": 132,
                  "content": "absolutely wash your hands before doing the chef's kiss",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "My first response. The son pulled a prank. He cleans it up. It really is that simple.\n\nWho would expect the person who was pranked to clean it up. That's the price of pulling the prank. Are these two serious????",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Also LOVE calling your own son the \"perp\" - legit. Love this answer, totally agree, OP you and NTA!!!!",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Slow clap emoji.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1422,
          "content": "Well you see, cleaning something put his masculinity in danger",
          "id": 48,
          "comments": [
            {
              "score": 478,
              "content": "And who, exactly, was supposed to clean it up?  I think this is what is at the root of Dad's issue, like you hint at.",
              "id": 49,
              "comments": [
                {
                  "score": 104,
                  "content": "Yes this was my thought as well. If not Dax, who was supposed to clean it up?",
                  "id": 50,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Someone who hasn't been blessed by the superiority of a penis, obviously.\n\n/s because it's reddit and someone will inevitably be a moron.",
                      "id": 51,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 89,
                  "content": "Really! Husband is a real piece of work and a major AH.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I think what cracks me up about  people like the dad is he feels like woman should continue to act like we live in the 50s meanwhile he doesn’t want to act like a man from the 50s. Dads back then would have put the fear of god into their kids if a prank like this was pulled. The kid wouldn’t have even tried to pull a prank like this.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 223,
              "content": "“But he could come into contact with GERMS…..dirty filthy girly germs! What if he catches ‘GAY’?! Cleaning is only the first step, next thing you know he’s wearing rainbows and training to be a hairdresser!”\n\nHusband is in the toxic man-closet and wants son to be part of the club.",
              "id": 54,
              "comments": [
                {
                  "score": 31,
                  "content": "Later that night in bed husband rolls over wanting sex...\n\nOP: \"Oh no I absolutely couldn't! I wouldn't want you to come in contact with my girly germs!\"\n\nThe husband is an ass😒",
                  "id": 55,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 203,
              "content": "I'm laughing my ass off, this is the truth",
              "id": 56,
              "comments": [
                {
                  "score": 213,
                  "content": "I have a roll of gaffer tape if OPs husband needs to secure his masculinity before cleaning.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 162,
              "content": "So fucking sexist",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 58,
              "content": "Yes, cleaning a toilet turns him into a girl.\n\n/s",
              "id": 59,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "Should not be using his genitals for cleaning.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Especially cleaning up *after a female*! The horror! I can just see his testicles retracting in shame.",
              "id": 61,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "If men clean too much their penises will spontaneously fall off.",
              "id": 62,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 814,
          "content": "Seriously, what the fuck is wrong with the dad?\n\nI can sort of see a 12 year old boy being an off the charts moron, but an adult?\n\nI'm this close to recommending OP prank the dad when he shits and see what he thinks. But something tells me he'll just act like a bigger asshole.",
          "id": 63,
          "comments": [
            {
              "score": 419,
              "content": "i ask the same question. i see a 12 year old that needs to spend less time online.",
              "id": 64,
              "comments": [
                {
                  "score": 426,
                  "content": "This was my thought. I’d pull his YouTube and tik tok privileges. He’s not mature enough to be on those platforms if he’s not mature enough to know a harmless prank from a destructive one OR mature enough to deal with the consequences of his own actions. OP, NTA. Have a serious talk with your husband though because he is way out of line. His attitude towards what happened is very telling and plays a huge role in your son thinking things like this are okay and that he is free from punishment because “it was just a harmless prank”. Gross. He needs to do better.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "I agree. Also, the fact that he gets such joy from pranking and causing discomfort specifically for his older sister is VERY troubling. The occasional harmless prank is one thing but humiliation pranks especially involving body fluids are NOT okay and that child needs to learn some empathy and to respect girls and women’s bodies.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Right? What if, god forbid, she was on her period?? Or even had the runs?? Then what?? This is an extremely embarrassing prank to pull on someone and could have been much worse than just urine. Daughter is at an age where her body is changing and it’s hard enough to deal with without someone you’re supposed to trust turning the bathroom into an unsafe space. If I was the daughter, I’d be paranoid ALL THE TIME.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Saving “off the charts moron” for future insults lol",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 606,
          "content": "NTA\n\nFirst off, way to parent!\n\n12 years-old isn't too young to learn about accountability, and your husband should know that. It's not like your daughter \"missed the toilet\" and got urine all over the place, and you forced your son to clean up her mess.\n\nOf course your son is mad. It's disgusting and he didn't think about the repercussions of a \"prank.\"\n\nThink your husband would have found it funny if he were victim?",
          "id": 69,
          "comments": [
            {
              "score": 139,
              "content": "Kind of sounds like the husband expects either the wife or the daughter to clean the toilet so he might have laughed if he were the victim because he probably still would not have expected to clean it up.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "And if the husband were the victim, would he have cleaned it? He would he expect to clean his mess?",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "What do you want to bet mom has had to clean up son's piss bc he's doesn't actually try to aim",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "That was my exact thought. Who would have to clean it up if the dad had been the victim of the prank.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 416,
          "content": "I cleaned mobile toilets from construction sites with pressure washer for several years, no PPE. Just close your mouth and eyes and turn away. Some of those toilets were between nasty and vile. I never got sick from that, but I've never been more sick than the years I had kids in kindergarten.\n\nI think the punishment fit the prank perfectly.",
          "id": 74,
          "comments": [
            {
              "score": 168,
              "content": "thank you for your service",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I read your first sentence and thought “they must have X-Men-level immunity!”  You’re spot on about schools… my children went to different elementary schools (due to disability program for one) and I worked in a third elementary; those were our germiest years of all.",
              "id": 76,
              "comments": [
                {
                  "score": 10,
                  "content": "My kid finished her second year of preschool. I swear, i felt like she'd go to school, come home sick, pass it around, we'd get her better--and it started all again on Monday.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I was going to say, what does dad think cleaners have to deal with every day?! NTA",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "That's a shitty job",
              "id": 79,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 352,
          "content": "No, you see women are naturally immune to germs from cleaning things like bathrooms and kitchens. Their son is a boy child, cleaning a bathroom could literally kill him.\n\n&#x200B;\n\n/s because the world sucks.",
          "id": 80,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 178,
          "content": "Exactly! Has that husband ever exposed himself to those germs and cleaned a toilet? Bet not. Husband is the AH.",
          "id": 81,
          "comments": [
            {
              "score": 21,
              "content": "Thinking back on numerous threads here, I figure the odds are even that OP's husband doesn't wipe (because that's gay) and leaves OP to deal with the crusts in his underwear (because mommy never complained about that).\n\nEven if he's not as bad as the worst, he's clearly part of the problem. NTA, your husband is, OP.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 95,
          "content": "This exactly, Does OPs husband never clean a toilet,?  And is he sitting down to pee? Because if not where does he think his pee splash is going?",
          "id": 83,
          "comments": [
            {
              "score": 16,
              "content": "Exactly where my mind went, on both him AND the son. \nThinking the next time OP is stuck on her hands on knees scrubbing their collective dribbles, she should carry on wailing & gagging, just a true spectacle of an ugly-cry. \n\nJr. should be shown a glimpse of his laughably ridiculous overreaction. Definitely throw in a good, \"oh g-g-god! The horror, the absolute germ-sprinkled HORROR I'm being exposed to at this very moment! 👐\" with a couple heaves for an added bonus, since it's clear Sr. is about as self-aware as an overripe avocado.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "Yeah it's time for this kid to get a reality check and have to actually have the chore of cleaning the bathroom weekly. Both of my kids had to clean their own bathroom every Tuesday and Thursday. They alternated weeks... I did the drain.. until they were about 14 and 15 and then I showed them how to clean that out..",
          "id": 85,
          "comments": [
            {
              "score": 16,
              "content": "And maybe time for the husband to get a reality check and take over bathroom cleaning duties for awhile!   \"Exposed to germs\"   sheesh!",
              "id": 86,
              "comments": [
                {
                  "score": 19,
                  "content": "OP, tell your husband that since he refuses to let his son clean the bathrooms/toilets, those tasks are now added to your husband’s list for weekly deep clean.\n\nBecause if his delicate son can’t be exposed to those germs, certainly the fragile women-folk shouldn’t be anywhere near toilet cleaning.  /s.\n\nClearly, this is a task for the ‘MAN OF THE HOUSE.“ (eye roll)  Tell him it is so dangerous that it’s a miracle your lady bits haven’t fallen off already.  What’s next? Will he expect you to risk your uterus by riding a train? 🚂\n\nReference: https://www.iflscience.com/people-once-believed-that-womens-uteruses-would-fly-out-on-speeding-trains-61343",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 8101,
      "content": "You were right. There wouldn't have been pee on the floor if he hadn't played his stupid prank. Your husband should back you up. He isn't doing Dax any good. I am tempted to advocate for his internet access to be restricted, he has shown he isn't using it responsibly. Btw, what did your husband think was suitable punishment? NTA.",
      "id": 88,
      "comments": [
        {
          "score": 4635,
          "content": "He's played kind of similar pranks in the past and we always deal with it by restricting internet/games in some way. I'm okay with him doing harmless things like using fake spiders around the house or jumping out from behind a wall, kids will be kids and some of that my teenager isn't really bothered by. But once it causes something physical I draw the line. One time he dumped water on her, which to me that crosses the line from \"prank\" to just being an AH. She got wet and had to change, that's not a practical joke you can just take back. \n\nWell usually take his Xbox for a week and restrict his phone so he can only text and call but not use apps. But clearly since he did this that's not working and I thought this punishment was more appropriate. \n\nBoth of my kids have/had parental restrictions on their devices until 13. I think once you're a teenager you can have your privacy, and that's what I did for my daughter. Right now my sons phone is still restricted since he's 12, so it shuts off at 10:30 PM, certain websites/apps are blocked, and I can see everything he does on there. \n\nBut since my son has a specific issue I might need to keep the restrictions on him for longer than I did with his sister. That'll make me the villain of the house though.",
          "id": 89,
          "comments": [
            {
              "score": 8697,
              "content": ">That'll make me the villain of the house though.\n\nYou misspelled “parent.”",
              "id": 90,
              "comments": [
                {
                  "score": 1620,
                  "content": "Best comment ever. This made me laugh so hard. It’s so true though. I don’t care how much mine dislike me- I’m still going to do right by them. Hoping it all balances out in the end’",
                  "id": 91,
                  "comments": [
                    {
                      "score": 699,
                      "content": "It can. I vividly remember my mom saying to me one time as a child when I was mad at her that she wasn’t here to be my friend. She was there to be a parent. \n\nI’m 30 now and we’re pretty good friends. I call her most days\n\nEdited to change “it does” to “it can”. As someone pointed out it can go both ways.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 116,
                      "content": "My mom said if your teenager doesn't hate you sometimes, you're not doing your job.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 106,
                      "content": "So true. So many people want to be their kids' friend that they forget to be a parent. Parenting means teaching them, and they won't always like that. Parent them as children so you can be friends as adults.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 98,
                      "content": "From ages 13 through 18(ish) my kids thought we were the most horrible strict parents.  Now we sit back and watch them with our grandkids and laugh our asses off. 😊",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "its like, do ya want a child who hates you but an adult who loves you?",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "The issue is that OP’s son won't understand in the end if his father continues to excuse his bad behavior. This can become a much bigger issue if OP’s son ends up harming someone outside the family with his pranks and immature behavior. Even worse, he can get hurt if someone not so forgiving lashes out at him. OP’s husband needs to work with OP as a team to make sure their son stops this behavior before he goes to college and the real world.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "If I had an award, you'd get it.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 21,
                      "content": "I got you",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "Sadly if Goodtime Daddy makes Mom be the only disciplinarian it will make her the villain of the house.  She has a husband problem that also needs to be dealt with. I wish her luck because i never had any success with mine. I'm the bad guy and i lost a kid over it because Dad never enforced a thing.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "This! Dad is trying to be the sons buddy treating this like it’s a “fun boy thing” your behaving like a parent and your doing better by your son acting that way. Be the villain, it’s better for your son in the long term",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 545,
              "content": "No, that makes you the parent. Parenting isn't a popularity contest. He is in control of having access to things, he just has to follow reasonable guidelines. He chooses not to, so there are consequences. He should be mad at himself.",
              "id": 102,
              "comments": [
                {
                  "score": 81,
                  "content": "While you’re right, unfortunately many people do see it as a popularity contest, especially when it’s one versus the other.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I tell me students that if they show self-control through their choices, I don't have to control them. They choose their consequences (whether good and bad!) by their behavior!",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 496,
              "content": "[deleted]",
              "id": 105,
              "comments": [
                {
                  "score": 1100,
                  "content": "Me. If he was home he would have done it himself and intervened. \"A parents job\" is how he put it. \n\nApparently it's \"dangerous\" for a kid because they don't know what they're doing and have \"weaker immune systems.\" It's literally a household chore though so personally I don't see his side.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 536,
                      "content": "Oh, give me a break.  As long as you use gloves and are careful it's no more dangerous than changing a diaper.",
                      "id": 107,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 486,
                      "content": "Sounds like your husband needs to be incorporated into the toilet cleaning schedule to get back in touch with reality, pronto. Nothing dangerous about cleaning a toilet, except some chemicals which you usually don't even need. You don't touch your face and wash your hands after, done. It's a perfectly acceptable chore for many kids 10+. \n\nAnd immune system? They aren't newborns anymore. Their immune system is stronger than yours or your husband's!\n\nEdit: NTA",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 266,
                      "content": "He wants to teach his son not to be responsible for his own actions and to not be able to care for himself.... Great.",
                      "id": 109,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 252,
                      "content": "As a Dad: your husband is a moron. First, pee might be gross, but it's sterile. No one is going to get sick from this.\n\nSecond, this is the best way for your son to learn that actions have consequences. It's his fault there is a mess, he gets to clean it up.\n\n You are sort of in a critical period in your son's development. You only have a couple years until he's a full blown teenager and isn't going to listen to you anyway. Take the time now to connect with him and help him learn that this sort of behaviour isn't acceptable. This means sitting down with him and talking about it once everyone has cooled down. Otherwise he's going to end up as an asshole adult.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 141,
                      "content": "Kids have stronger immune systems than adults. Your husband is kind of a dumbass.",
                      "id": 111,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 136,
                      "content": "Oh that’s such bullshit.  Sounds like hubby is not only a misogynist, he’s also an idiot.  He was worried about his son getting some kind of illness but not his daughter after SITTING in it?? \nI would have done the exact same thing you did.  He needs to learn that his actions have consequences.  If one of his pranks causes someone real injury or, god forbid, death, does your husband think he should just be grounded?? NTA  at all",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 116,
                      "content": "If he's the one insisting it's the parent's job, why doesn't he do it?",
                      "id": 113,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 111,
                      "content": "Anyone who has been responsible for cleaning a bathroom in a house with men/boys has probably cleaned more pee in their bathroom cleaning tenure than your son, and none of us have died from it. You're NTA.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "Would HE have done it? Or would he wait for you to get home?\n\nIf your kid is old enough to pull these kinds of pranks he’s old enough to clean up the repercussion.\n\nGood on you for actually parenting because losing video games/phone isn’t enough for something that gross.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "“Weaker immune system” is completely absurd.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 385,
              "content": "Has Mia actually told you that the ‘pranks’ don’t bother her, or are you just assuming that? I grew up with a little brother who loved ‘pranks’ and even though they didn’t do me any physical harm, having to watch out for them was exhausting and put me constantly on edge more than I let on to my parents. You might want to have a chat with Mia and find out just how much Dax’s behavior is affecting her.",
              "id": 117,
              "comments": [
                {
                  "score": 94,
                  "content": "Yes, this. Can you imagine the anxiety Mia probably has? OP needs to talk to her. \n\nAlso, this husband is an enabler and seems to really favor his son. Boo.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 11,
                      "content": "At first reading I thought you called the dad a \"Bozo\" and now I can't unsee it like dad is def a bozo.",
                      "id": 119,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Yeah my brother and I are no-contact because of shit like this. I am 32.",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 301,
              "content": "They’re not harmless. Your daughter doesn’t think they’re funny. No one does except the inconsiderate  brat you’re raising. No, not all 12 yo boys think hurting and scaring people is funny. He made a 14yo girl cry and it’s “the source of many fights between them.” \n\nYTA for letting it get this far. I’m sorry your husband isn’t helping you but YOU need to stand up for your daughter. Her brother is BULLYING her. He’s TRAUMATISING her, and you’re LETTING him with your ineffective “punishments.”  YTA.",
              "id": 121,
              "comments": [
                {
                  "score": 160,
                  "content": "A pranks only a prank if everyone is laughing.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 55,
                      "content": "Yeah otherwise it's just bullying. Sounds like OP has a major bully on her hands.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "THIS!  That poor girl is going to have PTSD.  Her brother is being cruel.\n\nSounds like family therapy is in order.  Where is all this anger coming from on your son's part?  Probably picking up some of the asshole attitude of his Dad.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "To this day, I still duck at the slightest loud noise. When my poor husband goes to throw something in my general direction, I cover my head. I flinch if someone walks behind me and I didn't hear them until they were close. It's ingrained in me, I can't help it.\n\nThis is your daughter's future, OP, if you continue to allow it. 20 years from now, she'll be ducking in a restaurant when a server is behind her and making everyone think her husband abuses her.",
                  "id": 125,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I’m so sorry:( /hugs. If you get a chance, please look into treatments for PTSD. You can rewire your brain to not behave thusly. \n\nBut in the meantime, *hugs*",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "She is going to end up hating her brother if she doesn’t already, and then Dad will be confused as to why his kids can’t stand each other. A more firm approach now will save OP’s family stress and heartbreak in the future.",
                  "id": 127,
                  "comments": [
                    {
                      "score": 15,
                      "content": "The daughter already wonders why her dad hates her and doesn’t protect like a father should.",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 178,
              "content": "why does your husband think your son is more important than your daughter? that is what he is clearly communicating here.",
              "id": 129,
              "comments": [
                {
                  "score": 503,
                  "content": "He's been the same way with my daughter on certain things. She skipped school one time to go to the mall. I took her phone for the weekend as punishment, and my husband fought me on that saying I was too harsh. He doesn't ever want to actually parent and hold either of them accountable.",
                  "id": 130,
                  "comments": [
                    {
                      "score": 463,
                      "content": "Seems like your husband wants to be what people call “the fun parent”.",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 180,
                      "content": "Oh, how convenient for him. He never has to be the bad guy and gets to swoop in, high five your kids and say “sorry Mom’s being so harsh!”\n\nWhat a joke.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 58,
                      "content": "This is unsustainable. Your kids are just going to learn that there are no consequences. I am an extremely laid back parent, but once it moves into harassment, it is completely different. Your daughter is now going to have to check before she press, she has to inspect her food before she eats. What's next!? Where does it end. Your home needs to be a safe place for your daughter as well as your son.\n\nYour husband might see this as to harsh, but how is it affecting your?\n\nAlso I wonder where this is stemming from. Was your husband harshly punished? Was he rule breaker? A prankster himself? What about this treks him it is ok for your son to do this to your daughter?",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "Sounds like a little family therapy would not go amiss. Your husband is a big part of the problem.  Does he understand what happens if neither of you parent?",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Then you need to become comfortable, and your husband needs to get on board with you being the parent, and your husband being Uncle Daddy. If he can’t bear to discipline his own children, and you’re meting out completely reasonable consequences, then he should let you just have at it and get out of the way. Your kids will be happier, you’ll be happier, dad will be happier. And I bet in their later years, your kids will have far more respect for you than for Dad.",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "NTA. You used to clean up his poop and urine as an infant and toddler. I would have made him clean it up too, what’s the consequence to stop him doing it again. Play stupid games win stupid prizes.",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "He's doing them both a *massive* disservice as a result. He wants to be the \"fun\" parent, letting you be the authoritative one. Your son is learning his \"funny\" behaviour at your husband's knee.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Counseling. Now. I'd also just say, taking the Xbox away from kiddo doesn't help, the Xbox had nothing to do with it. He's getting it from YouTube and TikTok, THOSE should be taken away.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "It sounds to me like you need to sit down with your husband, and have a serious discussion with him. He should know that his job isn't to have fun with them, his job is to raise *two* socially functioning humans. Punishment is absolutely *necessary* if you're going to raise a person, who is capable of functioning in society. Your husband sounds like an enabler of bad behavior.",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "FWIW I have a friend that divorced her sorry excuse of a parent, husband WHO WAS JUST LIKE THIS. \n\nLiterally saved the lives of her kids. I mean, he still let them drink his liquor but she was able to get court ordered limited visitation BECAUSE he refused to parent.  He actually ended up losing custody of any kind.",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 173,
              "content": "Info: what have the discussions that you have had with your son about his behavior been like? Have you had discussions about bullying, how it is wrong and how you can get in serious trouble? Does he act like this at school? Does he show any signs of being capable of empathy or remorse?\n\nHave you talked about how you shouldn’t do hurtful things to impress your friends or for internet likes? \n\nI don’t envy parents today. There are always hard lessons to teach during those developmental years. It’s made worse by technology being more influential than ever before. (Although as pointed out elsewhere. This is an old “prank”. It was never funny except to the bullies who pulled it)",
              "id": 141,
              "comments": [
                {
                  "score": 252,
                  "content": "I've talked to him at length so many times. He always appears to understand and it'll stop for a couple weeks but eventually he just does it again. \n\nHe doesn't have a huge problem outside of the house, fortunately. He has good friends who don't find this type of thing funny and don't encourage it. Which thank god for that because if his friends were in on it I'm worried he'd \"prank\" random people in public. It's odd cause no one around him finds any of this funny, yet he still does it just to impress himself.",
                  "id": 142,
                  "comments": [
                    {
                      "score": 526,
                      "content": "So you're saying he doesn't puul silly pranks when he's in a social setting and his actions have real repercussions, but he's okay with pullnig them on his sister at home? Sounds like repercussions are exactly what he needs.",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 153,
                      "content": "You really, really need to talk with your son about how women especially need privacy when going to the bathroom.  He's old enough to understand that this *always* crosses a line.  He also needs a good talking to about not messing with his sister's body in any way.  You're raising a future asshole/creep.",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 145,
                      "content": "What's your daughter's take on his \"pranking\"? Unless she actually finds out amusing, then you need to back up your daughter and stop the pranking. Because as of right now, your enabling the bully.\n\nYour son obviously has the capacity to know his pranking is not always welcome and when to shut it down (since his friends seem to have shut that down), but he continues totorment his sister because there parents have let him get away with it.",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "So if your son can tell that bullying his friends is wrong, what's the disconnect with him realizing that he's terrorizing his sister? Because pranks are only pranks and funny when everybody is laughing otherwise it's just bullying.",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": ">\"He doesn't have a huge problem outside of the house ... He has good friends who don't find this type of thing funny and don't encourage it.\"  \n>  \n>Maybe he wouldn't have a problem at home either if you weren't \"okay with him doing harmless things like using fake spiders around the house or jumping out from behind a wall\", with your poor daughter being the constant target. His friends don't encourage it, but you do.",
                      "id": 147,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "If he doesn't pull pranks around his friends because they don't find it funny but he does the behavior at home, it means he knows he can ***get away with it*** at home.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": ">es in some way. I'm okay with him doing harmless things like using fake spiders around the house or jumping out from behind a wall, kids will be kids and some of that my teenager isn't really bothered by. But once it causes something physical I draw the line. One time he dumped water on her, which to me that crosses the line from \"prank\" to just being an AH. She got wet and had to change, that's not a practical joke you can just take back.  \n>  \n>Well usually take his Xbox for a week and restrict his phone so he can only text and call but not use apps. But clearly since he did this that's not working and I thought this punishment was more appropriate.\n\nI would have a discussion with the husband about this now so you can both have a unified front.  \nTell the son no more pranks. Period. Not one. No matter how innocent. I agree he is traumatizing his sister with this BS.\n\nPunish the simple ones with toilet duty and reinforce. Should he do a particularly nasty prank again the husband will \"prank\" him by taking his Xbox out back and smashing it with a hammer while you both laugh at the \"prank\"\n\nPerhaps that will get the little shit's attention.",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 137,
              "content": ">That'll make me the villain of the house though.\n\nNo it doesn't.  If he was behaving the same way as your daughter he'd be entitled to the same rules. If he's going to behave immaturely then you'll treat him appropriately until you feel he has earnt his privacy.  That's parenting not being a villian. Two kids don't automatically get the same rules.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 113,
              "content": "NTA. Actions have consequences. When your actions cause your sister to make a mess, you get to clean it up. \nI'm curious, are all of his pranks directed towards his sister? Does she think any of them are funny? If Mia doesn't like any of them, then she is being terrorized by him, and all pranks need to stop. It's disrespectful and siblings shouldn't bully each other.",
              "id": 151,
              "comments": [
                {
                  "score": 95,
                  "content": "Mostly because he's not gonna do it to his parents and she's the only other one here. His friends aren't really into it, although he does play pranks on them too sometimes. His sister used to be a good sport about it and laugh so I think he marked her as being \"okay\" with them. Harmless ones she's fine with but actually causing a mess goes beyond a prank and isn't acceptable.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 70,
                      "content": "Maybe it's time for Mia to talk with him about how she's not ok with his pranks anymore.\n\nHe needs to get over this obsession with pulling pranks because sooner or later, he'll pull the wrong one on the wrong person and there will be greater consequences than cleaning the bathroom and having his phone taken away.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "\"Used to be a good sport\" is a funny way of saying \"used to be okay with family sanctioned harassment in her own home\" not going to lie. It feels like your husband isn't the only one dismissing your daughter's feelings.",
                      "id": 154,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "He’s not gonna do it to his parents because he knows that there will be actual consequences if he did that. He knows that you will refuse to protect his sister and so she is fair game. Think about that.",
                      "id": 155,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "Time to tell your son that Mia is no longer an acceptable target, but Dad is! He loves em and doesn't see the harm in them, I mean, let kids be kids, am-I right? Oh and **no** punishments for kiddo if the pranks on your husband go too far either. \n\nWhile I'm sort of half kidding on this, I would seriously recommend for you to tell your husband that you are forbidding your son from pranking your daughter moving forward but, since he thinks your son needs an outlet and, as your husband puts it, boys will be boys, well, you're going to tell your son that the only person he's now allowed to prank without any of your form of consequences is his dad. If your husband says that's not fair, not ok, whatever, ask him why he thinks that Mia deserves any of this when he doesn't. If your husband genuinely doesn't see much harm in this, it might actually be a good lesson for him to be placed in Mia's shoes for a couple of weeks and this might actually help him understand your side of things eventually. On the off chance that he doesn't, well, you've just taught your son a valuable lesson on consent instead lol.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Imagine how she feels where she can never be fully comfortable in her own home.  Where there is always a hint of worry in the back of her head that at any time she might get jump scared or have a fake spider in her food or fall on her.  I think you need to be more harsh.  I would not want to live in a place like this never knowing what is around the corner.  It sounds terrible.",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 103,
              "content": "Does Dad sneak him X Box time when he’s grounded?",
              "id": 158,
              "comments": [
                {
                  "score": 210,
                  "content": "No at least he's not that bad about it. But he sees pretty much any punishment outside of basic internet restriction as \"too harsh\"",
                  "id": 159,
                  "comments": [
                    {
                      "score": 236,
                      "content": "Actually 'internet restriction' is a punishment, while cleaning would be a consequence related to his actions. Natural consequences are much less arbitrary and much more educational and recommended in the long term, as it actually encourages the brain to think in terms of actions and consequences rather than 'just avoid being caught'.\n\nEdit: general block on prank channels would be a good addition actually until there haven't been any pranks on his syster in maybe a month or two.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 124,
                      "content": "I don't agree with punishing children either but they can be held accountable for their actions e.g. if they make a mess, they have to clean it up. It's not a punishment it's understanding you're an independent person who doesn't have a staff.",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 109,
                      "content": "Your husband doesn’t understand child development or parenting. Or health and safety. I’ve both taught 12-18 year olds and cleaned professionally- you were NTA and a good parent in holding your son accountable for what he did. (If it had been poop, I’d have recommended you clean it together, so you could show him proper procedure and how to sanitize). \n\nYour husband is discounting the shame and embarrassment to your daughter, and how your son took joy in causing her pain. Maliciousness should not be tolerated- your husband might need a remedial education in morals as well as the above. A good father would tell his son this has to stop, these pranks aren’t harmless, and show his son how to clean the whole house properly- and do it together. Your son clearly needs more responsibility in order to foster his development- and that’s not punishment, that’s education. Loving correction and enforcing boundaries are a gift- it’s how we help children make better decisions and be less anxious.",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 43,
                      "content": "I think dad needs to clean the bathroom for a few months",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Your husband is actually punishing your daughter by letting your son terrorize her.",
                      "id": 164,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "So your husband thinks that boys will be boys huh? I think that's your problem. You're teaching your daughter that she can just be terrorized by men and as long as they find it funny her feelings don't matter. Your son is a bully, at least that's what it looks like from here, and your husband is not only enabling it but also teaching your daughter that it's okay for men to bully her.",
                      "id": 165,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "> I am tempted to advocate for his internet access to be restricted, he has shown he isn't using it responsibly.\n\nRight?  Take away/block access to Tiktok and YouTube.  If he's getting the ideas there and he's unable to control himself then he isn't old enough to be watching these things.",
          "id": 166,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3264,
      "content": "NTA.  Your kid is learning what it means to reap the consequences of his actions.",
      "id": 167,
      "comments": [
        {
          "score": 2259,
          "content": "This was my thinking. It wasn't much of a \"punishment\" in my mind, just the natural consequences of what happened from the prank. \n\nBut he was balling his eyes out the whole time and my husband says I went too far so now I'm rethinking my decision.",
          "id": 168,
          "comments": [
            {
              "score": 2114,
              "content": "NTA, Jesus. Tell your idiot husband that next time your son does something like this you will leave it for HIM to clean because you and your daughter are not doing it! Please stand firm on this, you are not the AH.",
              "id": 169,
              "comments": [
                {
                  "score": 706,
                  "content": "No. The sons gotta do it. The husband sounds like a damn moron. Sorry OP. He literally has the view of a 12 year old lol. But having the son clean up after his actions teaches him a lesson, letting mom OR dad clean up just teaches him mommy and daddy will allow and fix any situation he’s in… PS I loved jokes/pranks and probably would’ve been laughing while cleaning the pee. Do I regret a bunch of them, yes. But my parents taught me I had to reap what I sow and it worked out well",
                  "id": 170,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I agree the son's gotta do it, but if the husband can't see that despite being a grown ass man, maybe he needs to do it too so he can learn.",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 92,
                  "content": "He'd probably be happy to to \"protect\" his boy",
                  "id": 172,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Nah, once he's forced to clean it up once or thrice, he'll get sick of this shit too.",
                      "id": 173,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 721,
              "content": "Of course he was crying. He was unhappy that he wasn’t getting away with his shitty prank.",
              "id": 174,
              "comments": [
                {
                  "score": 185,
                  "content": "I think this was more of a uriney prank. The kid should be glad it wasn't a shitty prank! It could have been so much worse! LMAO!",
                  "id": 175,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I actually thought this story was about to take a turn and she would be on her period. which would be horrible. What did he expect?? not to clean up the mess he chose to create?? Hard lessons need to be learned. NTA and OP shouldnt even doubt that, and husband is an enabler of bad behavior. Its important to teach boys not to harm others very early.",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "Do you mean he was pissy for not getting away with it?",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "When she yelled URINE A LOT OF TROUBLE he was quick to protest",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 355,
              "content": "Of course your son was upset.  He had to face the consequences of his actions and did not like it one bit.\n\nMaybe you should serve asparagus at dinner from now on.",
              "id": 179,
              "comments": [
                {
                  "score": 58,
                  "content": "Now THAT might be something to get sick over! 😂",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 308,
              "content": "My dad is a child developmental and educational psychologist.  The punishment you gave your son is EXACTLY what my dad would have done.  Natural consequences of actions are far more effective at curbing unwanted behavior than unrelated consequences like losing screen time. However, another natural consequence should be your son completely losing access to YouTube and tiktok.\n\nYour husband isn't being a good dad by shielding his son from consequences and is being a bad husband by not backing you up.  I bet he thinks those pranks are funny.",
              "id": 181,
              "comments": [
                {
                  "score": 89,
                  "content": "Since the dad is clearly okay with the pranks and cleaning them up i would say Dax should start pranking dad instead and leave Mia alone",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Yeah, OP’s husband has some weird punishment hangup. They should go to couples counseling to figure out why he thinks it is ok to keep enabling bad behavior.",
                  "id": 183,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 225,
              "content": "You guys need to nip this crying to the other parent behavior too.\n\nYou should both be a united front. Kids love to play one parent off against the other to get their way.",
              "id": 184,
              "comments": [
                {
                  "score": 30,
                  "content": "I noticed that too and completely agree",
                  "id": 185,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "My sister did this and it had my parents on the brink of divorce as a result. She’d get in a disagreement/fight with my mom, then run to my dad and he’d look at it “logically” instead of immediately backing my mom and it really tore our family apart, especially since my sister was twisting words and he didn’t believe my mom’s “side of the story.”\n\nOP, my story could easily become your future if you don’t take immediate action and align with your husband.",
                  "id": 186,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I'm with you, except her husband is the one who needs to get in line with her.",
                      "id": 187,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 168,
              "content": "NTA. And do not rethink your decision. Your husband should be backing you up, why isn't he stopping your son from constantly pranking your daughter?",
              "id": 188,
              "comments": [
                {
                  "score": 27,
                  "content": "I love a good prank war but the fact that his sister is obviously upset by his pranks and not participating is also insanely disrespectful and your husband is being a horrible parent to her. All your son is learning is that he doesn’t have to respect others and their boundaries if he doesn’t feel like it. It’s fine to play silly pranks with someone who also thinks it’s funny but not when they don’t. The fact that his sister is just expected to deal with it because boys will be boys just adds a big dose of misogyny to his lesson in entitlement.",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 96,
              "content": "You need to cut down his access to these pranks on YouTube and TikTok. He needs to have consequences to his actions. Making him clean is a good step but there also needs to be limits on what he views online. Imagine him doing a prank in public and recording it. We’ve seen how horribly wrong they can go. Good luck op!",
              "id": 190,
              "comments": [
                {
                  "score": 20,
                  "content": "I agree.  Block these sites. He isn't old enough to understand that they are not funny.  Also, his friends will be like woah your parents are strict, but it is possible his friends will learn that their actions have consequences through. You could make a generation of kids not be AH's.",
                  "id": 191,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 72,
              "content": "Actually, you may not have gone far enough, given that he pranks so much.  But you’ve now set a baseline and it should ramp up from here. \n\nKids are always going to whine and complain about “punishments.”  Goes with the territory. My daughter would try and get out of the consequences we set, saying she learned the lesson and promising not to do it again. My standard response was usually “well, I pretty sure the thief tells the judge that very same thing; and the judge looks at him and says ‘well, isn’t that grand…but if you do the crime, you still have to do the time.’”",
              "id": 192,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "NTA. You made the absolutely right decision. Read these responses to your husband so maybe he’ll see the other side of this problem. He’s not doing his son or daughter or you  any favors. Thank you for being the responsible parent.",
              "id": 193,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "Maybe your daughter should have filmed him crying like a baby while cleaning pee and sent it to his friends as a \"prank\"",
              "id": 194,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2768,
      "content": "NTA\n\nBut I have a feeling your husband and his reaction are why your son is still pulling stupid pranks. Does husband always undermine you like that?",
      "id": 195,
      "comments": [
        {
          "score": 1855,
          "content": "He has a \"boys will be boys\" attitude about it",
          "id": 196,
          "comments": [
            {
              "score": 2428,
              "content": "I fucking hate that saying. What a fucking cop out.",
              "id": 197,
              "comments": [
                {
                  "score": 860,
                  "content": "I hate that as an excuse. There’s no ‘girls will be girls’ though. Always the same line to let boys get away with doing dumbass shit.",
                  "id": 198,
                  "comments": [
                    {
                      "score": 273,
                      "content": "The girls will be girls is when they call us too emotional or illogical. 👍 Remember we can't control ourselves like the mens can",
                      "id": 199,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 90,
                      "content": "My neighbour actually pulled a “girls will be girls, there are four periods in this house.” \nWhen I yelled at her kids for breaking glass in my driveway :) 19 years old isn’t a child but okay.",
                      "id": 200,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 35,
                      "content": "I like the gender neutral kids will be kids. Because all kids do dumb shit at some point because they don’t know any better or are pushing the boundaries to see what is acceptable as they’re trying to develop their sense of self. That’s normal. \n\nTbh, he’s 12 and watching AHs online. I’m not shocked that he pulled this, and yeah, it’s been a stupid prank for a while though it was an April fools day one when I was a kid. This is absolutely one of those kids will be kids. That being said, kids need to be taught how to behave andOP handled it exactly right. \n\nHe deserves the natural consequences and hopefully it’ll make him think twice about what he does to others. It’s not like OP said he needs to be the only one cleaning all bathrooms for a month or something.",
                      "id": 201,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "And then he thinks it's \"dangerous\" for boys to clean a toilet?\n\nFuck right off with that sexist garbage.",
                  "id": 202,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 645,
              "content": "Ahh, the infamous \"Boys will be boys\"; purveyor of rapists, abusers, sexual assaulters, revenge porn makers, and general assholes since the beginning of time.\n\nYou should nip that shit in the bud. the fact that your son thought his sister pissing onto herself is a funny joke portends bad things for his future. He isn't 8 or 5 - he's 12, and should have developed some empathy, a sense of boundaries and propriety by now.\n\nYou got yourself a husband problem. The fact that your daughters father doesn't see that he should be standing up and showing her he won't stand for his daughter to be humiliated like that - that it's ok for her to be humiliated and abused but it isn't ok for her brother to be humiliated or held responsible/face consequences for his actions - is setting an awful example for her future relationships and expectations of the men in her life.\n\n**If you read nothing i said, please read this:**\n\n**Her dads treatment of her will set the example and resonate** ***for the rest of her life -*** **and in this case he is failing hard.**   \n**That's his true failing here- he is being a boydad, and forgetting he's a girldad, too.** \n\nNTA.",
              "id": 203,
              "comments": [
                {
                  "score": 101,
                  "content": "I hope she doesn't grow up thinking it's okay to be treated like this in a relationship. I feel so bad for her being stuck in this living situation. Being a teenage girl already sucks, and when your father doesn't care if you are humiliated, it has to be about a thousand times worse.",
                  "id": 204,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "u/Small-Raspberry-6561 please show this comment to your husband.",
                  "id": 205,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "OP's husband needs to prepare himself for their daughter to never want to talk to him after she leaves home. If he won't stick up for her and shut down their son's pranks then she'll never be able to trust him to support her.",
                  "id": 206,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I love this comment. The \"Boys will be boys\" attitude belongs in the 1950s. Your husband is telling your daughter that her self-esteem, self-worth and existence is of less worth than \"his\" son's. This will have detrimental effects on her future relationships. Will your husband laugh and applaud if her future partner constantly humiliates her and directs physical attacks towards her? If not - why is he letting her brother get away with it?\n\nThe pranks need to stop. And your husband needs to learn what it's like to be a teenage girl growing up in an unsafe household where no-one values her feelings.",
                  "id": 207,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 491,
              "content": "Your husband sucks.  Son sucks.  Your poor daughter! \n\nYou’ll be lucky if she does not go no contact eventually.  This is abusive behavior being sanctioned by your husband.",
              "id": 208,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 424,
              "content": "Ah yes, “boys will be boys” get ready for your son to be arrested for SA in college when he pulls a “prank” on the wrong person",
              "id": 209,
              "comments": [
                {
                  "score": 134,
                  "content": "Or hazing. This attitude will fit in well in a frat, unfortunately",
                  "id": 210,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 29,
                  "content": "Been looking for this comment.\n\nSpot on. This behavior goes unchecked, this is exactly where it’ll go. \n\nFrom my experience, these ones also grow up perpetually lonely or miserable, because most people don’t like being treated like shit. Imagine that.",
                  "id": 211,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 303,
              "content": "Ugh, that's my biggest pet peeve. When parents have the \" boys will be boys\" attitude, it usually means a kid growing up to be a spoiled AH that doesn't recognize that actions have consequences. They are also the guys that get into relationships and do these\"pranks\" on their partners and when the partner is humiliated or upset they'll say \"What? it was just a joke. You're too sensitive\" uggghhh",
              "id": 212,
              "comments": [
                {
                  "score": 8,
                  "content": "Yeah. Like there’s some truth to it, but you know when it’s getting pulled out that it’s going to be justifying some terrible behavior.",
                  "id": 213,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 283,
              "content": "Your husband is sexist and it's affecting your children. You do see that, right?",
              "id": 214,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 127,
              "content": "\"Boys will be boys\" is an utterly archaic attitude and even if it weren't should only apply to climbing trees and getting covered in grass stains and mud and similar. It's a cop out to excuse bad parenting and it needs to stop. It drives me mad when MIL tries to pass things my son has done off as this when I'm trying to correct behaviour",
              "id": 215,
              "comments": [
                {
                  "score": 21,
                  "content": "Agreed. There are occasionally some great stories that I see online, like a woman who went to Statbucks one days and there happened to be all women on, so there were compliments, \"have a great day\"s, etc, but then visited another day. It happened to be staffed by all men, and they were trying to help their co-worker name his scorpion. They had a list of names to vote on, or you could add your own. I've seen another about a group of guys who found a woman's keys and got incredibly excited about it. THAT is what \"boys will be boys\" should be about. Harmless, sweet, funny things. Not an excuse for disgusting actions and misogyny.",
                  "id": 216,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I remember that story, and I do like it, but also it makes me cringe a bit because it's still putting genders into boxes and subtly saying 'Well, of course *women* would never name a scorpion! And men would never give compliments! It feels somehow still derogatory. Especially when many women I know would be excited to name a scorpion lol",
                      "id": 217,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yah like I had a friend who joined a frat in college and one of their hazing events was typical “boys will be boys” shit. The brothers told the pledges to go outside and find a stick. Boys being boys, they all went and looked for the biggest stick they could and were saying stuff like “look how big my stick is”. The brothers then said they all had to hold one end of the stick in their hand with the other end pointing to the sky, look at the end above them, and spin as fast as they could for a minute. That’s “boys will be boys”. Aka dumb shit, not sexual assault",
                      "id": 218,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Even then it's a bit ridiculous as when I was a young girl, I often climbed trees and was covered in mud/grass stains. It was weird to me growing up and seeing this rhetoric that those are 'boy' things when they were things I had done my entire childhood.",
                  "id": 219,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Agreed!! \"Omg my 5yr old is playing outside boys will be boys\" more like kids will be kids",
                      "id": 220,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 101,
              "content": "Yeah, OP, your main problem here is a husband problem.",
              "id": 221,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 87,
              "content": "“Boys will be boys and girls will be women,” eh? Classy. I see why you married the guy. 🙄",
              "id": 222,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 55,
              "content": "Absolutely not. We are way past ‘boys will be boys’ in this day and age. Boys should be held accountable for their shitty actions just like any girl would be. I would have made him clean it up AND taken away his games so you’re less harsh then I am. I’m sure your son will think before doing something like that again, so you’ve done the right thing. NTA.",
              "id": 223,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1470,
      "content": ">He told me I was overly harsh on our son and \"put him in danger\" by exposing him to germs. \n\nSo your daughter should have been exposed to germs instead and had to clean up a mess she in no way had a hand in making? What is that? \n\nNTA. Cleaning the toilet isn't torture or harsh punishment. It's a household chore someone has to do. He just made it dirtier for himself by pranking his sister. Maybe he'll knock it off finally and poor Mia will get some peace.",
      "id": 224,
      "comments": [
        {
          "score": 430,
          "content": "He probably thought OP should have cleaned it.\n\nNTA but your husband is - and your son will be if you don’t get a handle on these “pranks.”",
          "id": 225,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 158,
          "content": "THIS!\nHe didn't even got 'punished' in that way, he was held responsible for his actions and needed to deal with the direct consequences. Why should OP deal with the consequences of HIS actions. \nHe knew where the pee would end up, and probably the thought of his sister cleaning it up was what motivated him. \n\nAlso it's just pee, people act like it will burn your skin or something. As long as he washed his hands after cleaning, he will be fine. :D",
          "id": 226,
          "comments": [
            {
              "score": 11,
              "content": "Yeah I don’t see how cleaning up a mess you made constitutes being punished.",
              "id": 227,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 128,
          "content": "makes me wonder if the husband cleans anything in the house, because wtaf is that stance.",
          "id": 228,
          "comments": [
            {
              "score": 24,
              "content": "You know he doesn’t.",
              "id": 229,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": ">so your daughter should have been exposed to germs instead and had to clean up a mess she in no way had a hand in making?\n\nof course because everybody knows women are naturally anti-bacterial according to a study I made up",
          "id": 230,
          "comments": [
            {
              "score": 8,
              "content": "Thanks, I snorted my coffee up my nose. Needed that today. :D",
              "id": 231,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "If he is that concerned that cleaning the toilet is \"exposing him to germs,\" I hate to see what this boys college bathroom will look like.",
          "id": 232,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I really hate ridiculous germphobia. People clean up pee all the time. People everywhere every day  clean up after babies and incontinent people and survive to talk about it.  Kids need to get used to getting their hands dirty so they don’t grow up to be afraid of everything.",
          "id": 233,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 832,
      "content": "NTA. I can see who has let your son get away with bullshit pranks in the past.\n\nDoes your husband think you would have been “in danger” and “exposed to germs” if you had been the one to clean the toilet? Or is it only his precious son who is that delicate that he can’t clean?",
      "id": 234,
      "comments": [
        {
          "score": 246,
          "content": "NTA, pranks are pseudo-bullying behavior and erode trust quickly, and can cause pointless escalations.  And as humor goes they are lazy.  Parents tolerating any pranking at all are just raising assholes.",
          "id": 235,
          "comments": [
            {
              "score": 14,
              "content": "Exactly. It's only a joke if everyone laughs at the end. If the person at the center of the joke isn't laughing, then it's cruelty not humor.",
              "id": 236,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 644,
      "content": "NTA. This is actually excellent parenting. Your son may rethink his actions in the future if he knows that he may be the one to suffer the consequences. You can also ask hubby if he wanted you to leave the mess for HIM to clean when he got home from work??",
      "id": 237,
      "comments": [
        {
          "score": 242,
          "content": "I think we understand why they aren’t having any luck fixing the son’s behavior based on the father’s reaction. Parents are not on the same page.",
          "id": 238,
          "comments": [
            {
              "score": 91,
              "content": "This. OP, I suspect your husband doesn't see the harm in the pranking. It so, he needs to butt out before your son hurts someone.\n\nI really, really loathe Internet pranking culture.",
              "id": 239,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 390,
      "content": "NTA. Janitors clean up other people's pee and worse all the time. Give him some gloves and tell him not to be a whiny brat.\n\nAlso, ban him from YouTube and TikTok.",
      "id": 240,
      "comments": [
        {
          "score": 34,
          "content": "This. Pranks like these shouldn't just end in a \"clean it up and that's the end of it\" punishment. It sounds like he does this a lot, so banning him from these toxic influences sounds like a great idea. Or at least just be more mindful of the content he watches.",
          "id": 241,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 338,
      "content": "NTA your husband is a massive A for calling you a bad parent. \n\nConsidering people can drink pee because it’s mostly sterile, the precious boy is safe.\n\n Is your husband responsible for cleaning the toilet at all or is it just you? If it’s you, you might want to put him on toilet cleaning duty from now on, since he has shown an attitude about it and his attitude may be sexist rather than germ conscious that he protests.",
      "id": 242,
      "comments": [
        {
          "score": 76,
          "content": "Urine is not sterile that's a myth.",
          "id": 243,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "This is the vibe I got. It’s not a man’s job to clean up toilets, only women are immune to toilet germs! Ugh",
          "id": 244,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Urine outside of the body is not sterile. It picks up bacteria as it exists the body. Urine in the bladder, provided the person doesn't have a UTI, is sterile.",
          "id": 245,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Patches O’Houlihan? I thought you were dead!",
          "id": 246,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 295,
      "content": "Your husband sounds like he babies your son way to much. \"Expose him to germs and put him in danger\"? You all live together, there is fecal matter and all of your germs everywhere no matter how hard you clean. \n\nYou did the right thing. You do something stupid, you pay the consequence. \n\n100% NTA. Good on you for being a actual parent and punishing your child correctly.",
      "id": 247,
      "comments": [
        {
          "score": 86,
          "content": "Son already exposed himself when he decided he wanted to saran wrap the toilet. I mean there is evidence that poop bacteria spreads all over the washroom once u flush even if u put down the seat. NTA",
          "id": 248,
          "comments": [
            {
              "score": 10,
              "content": "Even that bacteria isn’t dangerous at all except maybe the son purposely cut his finger and rubbed the wound all over the toilet.",
              "id": 249,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Came here to say the same. The germs in that pee are no different than the germs around the rest of the house. \nThis has nothing to do with that and everything to do with the idea that the boy can get away with his so-called harmless pranks and that it’s a woman’s job to clean up after him. \n\nNTA, OP, you keep being a kickass parent! This is absolutely a perfect example of the punishment fitting the crime.\nMaybe husband needs some hard lessons on the realities of being a woman. \n\nAlso FTR, the “boys will be boys” mentality is such BS. I once did a massive research paper on gun violence in America re: mass shootings. There are sooo many reasons men are overwhelmingly the perpetrators in these events. Not saying your boy will become a mass shooter - just saying that the mentality that boys can get away with whatever they want and society will just shrug their shoulders and go “oh boys will be boys” is wildly harmful to their futures. Boys need to learn boundaries and responsibility and this attitude does not breed such.",
          "id": 250,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}