{
  "post content": "My uncle had a beautiful little girl 3 years ago, and both my uncle and aunt are still heads over heels about her.\n\nProblem is, they suck at parenting and won’t let anyone tell them that they’re wrong.\n\nFor starters, they’re anti-vaxxers, and have refused to give her any shots; where I live, they’re mandated by law and kids cannot legally attend school without a vaccination certificate, but they’re homeschooling her. Loophole, I guess.\n\nSecondly, her daughter has a horrible behavior, screaming, talking over adults, throwing tantrums and constantly touching fragile objects even when repeatedly telling her not to.\n\nThe event that broke the camel’s back was this:\nOne night, we were having a family gathering at my house, and while my mom was praying (she’s very catholic) the kid farted really loudly.\n\nHer parents just laughed, and carried on like if nothing had happened.\n\nAfter this, I don’t want her in my house anymore ever again, and I will let her parents know that she is not invited anymore, I don’t care if it ruins my relationship with them at this point.\n\nMy mom doesn’t want to do this, as she wants to keep our family very close (she’s very traditional)\n\nWIBTA if I went against her wishes, and told them that she’s not welcome here anymore?\n\nEdit: since so many people are asking why the farting ticked me off so much; it wasn’t the farting itself, kids do that.\n\nWhat annoys me is the fact that they refuse to teach her why that is not okay, and don’t make any effort to fix this behavior, in fact, they seem to encourage it with laughter, and this applies to many other things.\n\nWhen she has a tantrum they generally stick an IPad in front of her, and she calms down momentarily, but misbehaves shortly again.\n\nEdit#2: I should mention that she starts screaming, yelling, and sometimes crying when no one is paying attention to her. I mean, whenever her parents aren’t focused on her, she starts yelling, whenever she’s doing something and people aren’t watching her, she yells and cries, it just keeps happening and her parents don’t even try to do anything.\n\nEdit#3: I just realized I should mention that I’m from Ecuador, and culture here is different. Farting is disrespectful in our culture, and we should at least say sorry when it happens. Kids are expected to be well behaved, and this is the case the majority of times.\n\nEdit#4: I shouldn’t have said “ever again” in the title, that’s not what I meant, I was annoyed and made a mistake, sorry.\n\nEdit#5: I refer to her as my niece Bc my uncle is my cousin, he’s older than me and he has a kid, so I refer to him as uncle and to her daughter as niece.\n\n*update*\n\nTalked with my mom, she agreed that the kid was making many guests uncomfortable, and we decided to tell her parents that until her behavior improves, she won’t be invited here anymore.\n\nOf course, they’re mad at us, but we have considered the pros and cons, and we have decided to take this course of action.\n\nThanks for all that replied to this post",
  "id": 1,
  "comments": [
    {
      "score": 203,
      "content": "ESH\n\nThe parents for not setting boundaries. Also antivaxxers.\n\nYou for drawing the line at farting. \n\nShe's 3. Ever heard of the terrible 3's? It's what they do. I'd be more understanding if she had almost broke something or hurt herself on something after being told to stay away or not do a thing. \n\nBut you decided to die on fart hill so there's that.",
      "id": 2,
      "comments": [
        {
          "score": 40,
          "content": "It’s not the farting itself, it’s everything else, the tantrums, the messes, etc.\n\nThe farting annoyed me because it clearly offended my mom, and the parents did not apologize",
          "id": 3,
          "comments": [
            {
              "score": 65,
              "content": "It didn't offend your mom to the point of her agreeing with you though. \n\nOnce again, she's 3. Toddlers have tantrums all the time. My son had a tantrum because I tried to bring toys for him to play with outside of the house. Another time he refused to eat something, so I ate it, cue freak out. \n\nThe parents should clean up after their child but other than that, she's going to be messy.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Hey, kids fart. It happened at that point in time. I think you're more offended by her parents' overly permissive style (technical term; non-parents, non-technical) and how they respond to her behavior.\n\nYou don't have to allow them in your home if you don't want. That's your choice. Up to them whether they shape up or not.",
              "id": 5,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I actually think he's right with the farting. I get it, everyone farts, but the difference is, if you fart during a moment of silence, like a prayer, it is super fucking rude to just laugh about it rather than say excuse me. Still, the parents are TA, not the kid; they clearly haven't learned manners, and that's on the parents.",
          "id": 6,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Random, but I was feeling a bit down this morning and reading your comment (specifically the words \"fart hill\") made me laugh. So thank you for that! 🙂",
          "id": 7,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "NTA because all of the people saying she's 3 forgot that most people go through that and then they develop because their parents help guide them through that stage. Instead these parents aren't helping guide her down the right path. It's the parents who need to change. OP isn't blaming the daughter but the parents but she doesn't want to be around the daughter because of the parents lack of guidence",
          "id": 8,
          "comments": [
            {
              "score": 6,
              "content": "Three year olds are assholes sometimes. Mine sure was. He'd make a mess, I'd clean it up. \n\nOnce he was extremely excited about his penis, so he decided to pull his pants down in the middle of Costco. Was I horrified?  You bet. Did I yell at him? No. Did I calmly tell him that he probably shouldn't do that? Yup. And now he doesn't flash his penis in public like he used to. \n\nESH because the parents don't seem to be parenting correctly and because OP doesn't seem to understand that THIS IS NORMAL 3 YEAR OLD BEHAVIOR. A 3 year old is still trying to learn how to communicate its wants and needs, but doesn't always have the words to do so. A 3 year old also doesn't understand messes because whenever it makes them, somehow by some sort of magic, everything gets returned to its rightful place. \n\nA cool way to find a middle ground is the next time the child does something, use a deep, scary voice and say NO. Whenever someone who wasn't me did that to my son, it'd scare the bejesus out of him.",
              "id": 9,
              "comments": [
                {
                  "score": 2,
                  "content": "It doesn't seem like it will change though. All 3 year olds are like that but this one isn't at least being helped. If he was being helped OP would be the asshole, if it was somewhere in between where they were trying but she is particularly bad, and in this situation they aren't helping at all and OP is NTA because this will help them realise they have to get their act together.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 76,
      "content": "The 3yo girl sounds like 3yo girl to me.\n\nYour house, your rules.... but YTA",
      "id": 11,
      "comments": [
        {
          "score": 100,
          "content": "Absolutely not. I detest that argument. \n\n*insert obnoxious untrained child* \n\n\"Stop getting upset, they're only 2-3-4-etc.\"\n\nNo. What's happening is that parents are afraid to discipline their children because they don't know how much authority is too much authority, and they don't want to stifle their child's creative nature, so instead of putting any thought into training children they give them free roam of their house.",
          "id": 12,
          "comments": [
            {
              "score": 63,
              "content": "\"They're only 2-3-4-etc.\" happens to be a very good argument at that age.  2 year olds can't understand half of what you say.  3 year olds have just learned to speak.  You have to be patient with toddlers; half the time they won't even understand what they did wrong and certainly not *why* what they did is wrong.  Do you have any experience with young children?",
              "id": 13,
              "comments": [
                {
                  "score": -21,
                  "content": "You're wrong. 2 year olds can understand what you are trying to say or want. Hell, some kids as young as 1 year old can even understand what they should or shouldnt be doing. Stop giving children less credit than they deserve. 3 years old children are walking, talking, reasoning, problem solving. If you as a parent are willing to put in the effort to interact with the child instead of just shrugging off the behavior and distracting them with shiny things, this situation could easily be avoided or at the very least a teachable moment. Be patient, yes. But using their age as an excuse for behavior that could easily be corrected is wrong and giving the parents more slack than they deserve.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 36,
                      "content": "No.  You're wrong.  You can't control 2-3 year olds completely.  The best you can hope to do is manipulate or distract them.\n\nYes, they can understand some things and you can use the opportunity to *try* to teach them.  But *try* is the important word here.  You absolutely cannot control them at this age.  If you were insistent enough on controlling them, you'd probably be abusive.\n\nThey don't even know what's real and what's not real.  [Check out this link](https://healthywa.wa.gov.au/Articles/A_E/Child-development-2-3-years) for a better understanding of the mind of a 2-3 year old.  Stop giving toddlers more credit than they deserve, because it's not healthy for them.  They're not adults, and you're expecting too much of them.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "The prefrontal cortex, the part of your brain responsible for decision making, risk assessment, and impulse control, takes 20 something years to fully develop. 3 year olds do not even sort of have the ability to stop themselves all of the time. Many teenage and 20-somethings still don't. As others have pointed out, you can't control a child. You can guide and set an example and show them love but they are their own people.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "You can keep counting those numbers all the way up to 18 and suddenly peoples kids start getting into legal trouble cause they never leaned to discipline them. Most kids will throw temper tantrums and when they start you need to parent them and explain that they cant do that to get what they want. People saying that 2 or 3 year olds dont understand are both wrong in assuming they cant understand you and also wrong in assuming that there aren't other ways to show them. Knowing how and when to use Positive and negative reinforcement/punishment is crucial to well behaved kids",
              "id": 17,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": " I’m not trying to justify myself and this is a legitimate question.\n\nAm I really the asshole for not wanting tantrums and having to clean up after a kid in my house? I would gladly receive her in my house again if her behavior changes",
          "id": 18,
          "comments": [
            {
              "score": 9,
              "content": "No you're not wrong. But the issue isn't the child. It's the parents. Children do everything people are describing here but it's up to the parents to control it and her parents aren't. \"She's just 3\" is no excuse for failing to discipline your child. I have a nephew who is almost 5 and a niece who is almost 3. Both are capable of learning what behavior is acceptable. They push the limits as children do of course, but then they're punished for it so they can learn not to do it again. Despite knowing something is not acceptable, they STILL do it because they're children. That's to be expected. But the parents still need to continue to correct behavior.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "My 2 year old niece throws her babies around and laughs. What you're describing is a kid being a kid. It's not the kids fault.",
              "id": 20,
              "comments": [
                {
                  "score": 4,
                  "content": "True. Maybe she should just tell her Uncle that none of them are welcome in her house until they can reasonably manage a 3 year old.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Not the kids fault but i dont think OP is an asshole if he doesnt want to deal with it.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Yes.\n\nThey are born knowing nothing, they need to learn how to be little people from somebody, and that takes time. \n\nIt sounds like all she is learning from you is how to be negative, how to focus on what's wrong, and how to judge people. \n\nYour home, your absolute right to be an asshole if that's how you want to spend your one lifetime.",
              "id": 23,
              "comments": [
                {
                  "score": 45,
                  "content": "Yes and no. A three year old is going to act like a three year old, but if the parents aren’t attempting to correct her behavior, as the post indicates, then no, OP isn’t responsible for cleaning up after the child. That’s mom and dad’s responsibility.\n\nSo it isn’t the issue of the child herself but the parenting, or lack thereof.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Lmao what? She's 3 years old and hasn't been told anything. She's not learning a damn thing 😂",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Sure kids are born knowing nothing. However, you don't learn manners in a one time seminar at the age of 5. You learn them gradually from the time you're a baby. At 3 kids are going to throw tantrums, talk during movies, and fart at inappropriate times. They're still learning and in order to keep learning this 3 year old's parents instead of laughing needed to quickly scold her and have her apologize. The \"it takes a village\" mentally only works is if the parents set up a base level that includes basic manners and also they let the *village* be able to discipline minor bad behavior. In this case the parents aren't disciplining or allowing others to do the same and this incident was basically the straw that broke the camel's back.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "NTA because all of the people saying she's 3 forgot that most people go through that and then they develop because their parents help guide them through that stage. Instead these parents aren't helping guide her down the right path. It's the parents who need to change. OP isn't blaming the daughter but the parents but she doesn't want to be around the daughter because of the parents lack of guidence",
          "id": 27,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "no she sounds like a child raised by two morons who dont understand what discipline is. 3 year olds know how to behave if you actually, ya know, ***PARENT*** them.",
          "id": 28,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 0,
          "content": "Fuck sake I hate this attitude. Your nta. A lot of people just a ccept that 3 year olds behave like this as an e x use for thier shit parenting especially parents in this era.",
          "id": 29,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 46,
      "content": "[deleted]",
      "id": 30,
      "comments": [
        {
          "score": 5,
          "content": "NTA because all of the people saying she's 3 forgot that most people go through that and then they develop because their parents help guide them through that stage. Instead these parents aren't helping guide her down the right path. It's the parents who need to change. OP isn't blaming the daughter but the parents but she doesn't want to be around the daughter because of the parents lack of guidence",
          "id": 31,
          "comments": [
            {
              "score": 4,
              "content": "Copying and pasting your argument everywhere doesn’t make you right. OP isn’t banning the parents, they are banning the kid. The kid who literally is too young to behave in the way OP wants. Sure, OP can ban whoever the hell they want from their home. But this isn’t r/legal advice, this is AITA, and yes, banning kids because they are acting like normal kids in a developmentally normal way does make them an asshole.",
              "id": 32,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -13,
          "content": "That’s the problem, they refuse to teach her and just put an IPad in front of her to calm her down during tantrums.",
          "id": 33,
          "comments": [
            {
              "score": 22,
              "content": "[deleted]",
              "id": 34,
              "comments": [
                {
                  "score": -1,
                  "content": "NTA because all of the people saying she's 3 forgot that most people go through that and then they develop because their parents help guide them through that stage. Instead these parents aren't helping guide her down the right path. It's the parents who need to change. OP isn't blaming the daughter but the parents but she doesn't want to be around the daughter because of the parents lack of guidence",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 40,
      "content": "Lol @ the farting! I doubt that the 3-year-old did that on purpose, but you're NTA. It's your house.",
      "id": 36,
      "comments": [
        {
          "score": 1,
          "content": "It’s not the farting itself that ticks me, it’s the fact that they haven’t taught her when that’s okay and when that’s not okay, and they don’t make any effort to teach her that",
          "id": 37,
          "comments": [
            {
              "score": 40,
              "content": "She's barely learning potty training. It's a little early to expect a three year old to hold in her farts. Not the time to be teaching that.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "[deleted]",
              "id": 39,
              "comments": [
                {
                  "score": 2,
                  "content": "Well man, my mom has 14 siblings, my dad has 6, meaning there are A LOT of kids in the family, some are around the same age as her.\n\nThey know to be respectful of adults, they know what NO means, they never misbehave severely.\n\nThis little girl, on the other hand, is never respectful of adults, always wants to be the center of attention, and it’s all her parent’s fault, and they do not plan on fixing that.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I was raised in a cult where toddlers were also \"well behaved\". Yeah, because we were abused into compliance.",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Do you have children of your own?",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "It's a bodily function, my dude. Farts happen when they happen, especially when you're little. No one should be banned for a natural bodily function. You shouldn't be offended by a child's gas. You shouldn't expect a child to \"hold in\" a fart for an indefinite period of time. YTA because you have unreasonable expectations about what a 3 year old can do.",
              "id": 43,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 19,
      "content": "NTA if shes running around and screaming in your house... but a little weird that farting is where you draw the line. Tbh if my three year old farted I'd just laugh too. Not sure what else youre supposed to do lol apologize? Its a fart.",
      "id": 44,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 16,
      "content": "YTA \n\nHonestly, you come across as someone that just doesn't have the patience for small children. Getting bent over a three year old farting? That seems like a you issue. That said, it's your house, and if you don't want small children in your house, that's your prerogative. Her behaviour will get better as she becomes older and better socialized. Maybe when she's 7 or so you can allow her back in your house assuming your aunt and uncle don't cut ties with you over you banning their daughter.",
      "id": 45,
      "comments": [
        {
          "score": 9,
          "content": "Yes, you’re right, I do not have patience for the majority of small children. Am I really the asshole for not wanting to have tantrums around and having to clean up messes?",
          "id": 46,
          "comments": [
            {
              "score": 6,
              "content": "It's okay to not like children at that age. Most people don't. IMO suffering through it every now and then  (I assume they aren't constantly bringing her to your house) is worth it to maintain family ties and avoid hurt feelings. But it's your life and you may have different priorities than me.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Yes, yes you are. No matter how well behaved you think you were as a kid; guaranteed you did stupid shit like this. \n\nYour house, your rules; but the more you try to justify your actions the more of an asshole you become.",
              "id": 48,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Yes. YTA. At one point in your life, you threw temper tantrums and made messes, You got better. Now you pay it forward with patience because someday, you will be the one who needs their diaper changed, and people won’t like it, and you will probably be crotchety and obnoxious, but the people who love you anyway will tolerate it because that is what Non-Assholes DO.",
              "id": 49,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "NTA because all of the people saying she's 3 forgot that most people go through that and then they develop because their parents help guide them through that stage. Instead these parents aren't helping guide her down the right path. It's the parents who need to change. OP isn't blaming the daughter but the parents but she doesn't want to be around the daughter because of the parents lack of guidence",
          "id": 50,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14,
      "content": "NTA \nThe little girl isn’t either, she’s being a kid and then learning from her parents that her bad behavior is acceptable to them. \nI’ve read some of your comments explaining that it was the parents laughing and not chastising the girl that broke the camel’s back, although I think it’s small sometimes that’s how it is. \n\nI have toddler siblings who can understand what is disrespectful and that it won’t be tolerated. Kids slip up sometimes but they can be pretty smart when you explain to them that certain behaviors are wrong.",
      "id": 51,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "NTA for not wanting to deal with tantrums, messes, or screaming. Most toddlers I know and babysit as a 15-year-old have been taught about controlling noise, remaining respectful, and being kind with a few simple steps. If they're shitty parents, they're shitty parents. Sure, ban them. I rolled my eyes to the point of seeing my own brain when I read \"anti-vaxxers.\"",
      "id": 52,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "YTA.  She's 3.  Only someone who has never raised a child, or an abusive parent, would blame a 3 year old for inappropriate behavior.  Some of it is a reflection of the parents, but some of it is out of control of the parents... They pick up some inappropriate things from daycares, or a cartoon they watched, or are just now experimenting with their boundaries.  Parents can't prevent every bad behavior at all times for a child that's 3.\n\n3 year olds have only been able to form full sentences for a year or less.  Think about it.  They're practically still babies.  Hell, most of us are still immature until our 20s, and you're going to sit here and get mad at a 3 year old for not being mature?  Again... YTA.",
      "id": 53,
      "comments": [
        {
          "score": 4,
          "content": "I’m not blaming the kid, I’m blaming the parents.\n\nBut I just don’t want any of that happening in my house anymore.\n\nWhat else can I do?",
          "id": 54,
          "comments": [
            {
              "score": 10,
              "content": "First of all, if you have to ban someone, don't ban the niece. Ban the parents.  The 3 year old has done nothing wrong.  Ban the parents for not controlling their kid.\n\nHowever, like I said, controlling a 3 year old is an extremely tall order.  With my first child, I tried everything to control her when she was 2-3 -- positive reinforcement, negative reinforcement... Any attempt to control her just made things worse.  It turns out, she just needed to get a bit older.. around 4 or so she started understanding things like causality, right/wrong, and consequences.\n\nI'm not sure what about her behavior is unacceptable in your household... If you just \"don't like it,\" I would suggest maybe just being more patient and understanding.  Spend some time with the niece... Try to entertain her with some toys and understand how she works.\n\nIf you're worried about her safety or your property, that's a legitimate concern.  Just tell the parents you don't think your home is childproof enough and suggest some other places to meet up with them.  No need to call it a \"ban\"... More like a safety measure.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "NTA because all of the people saying she's 3 forgot that most people go through that and then they develop because their parents help guide them through that stage. Instead these parents aren't helping guide her down the right path. It's the parents who need to change. OP isn't blaming the daughter but the parents but she doesn't want to be around the daughter because of the parents lack of guidence",
          "id": 56,
          "comments": [
            {
              "score": 1,
              "content": "I think only the first Edit was in place when I made my judgment.  All I had to go on was that the kid screams, throws tantrums, and touches things they shouldn't (normal 3 yo behavior) \"even when told repeatedly not to\" (which implies someone was trying to correct the behavior), and that the kid farted loudly once at an inappropriate time and the parents laughed (this is a pretty petty and minor thing to get upset about a 3 yo doing).  Later on he edited in that the parents don't try to do anything, but that kind of contradicts the \"even when told repeatedly not to,\" so I'm not sure what to think.\n\nI'll add that I do think the parents are assholes for not vaccinating their kid, but that is not really the issue here from what I can tell, and I'm not sure why he mentioned it, except to try to stack judgments in his favor.",
              "id": 57,
              "comments": [
                {
                  "score": 2,
                  "content": "I think the repeatedly told not to is for other people who are not the parents trying to help and they just laugh it off",
                  "id": 58,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "Nta. I would say banning them is a step too dramatic right now but pointing out how her behavior is wildly out of the realm of acceptable and they are making no efforts to teach her otherwise will lead to them not being allowed in your home. While I'm not religious myself, I recognize that praying is a deeply personal thing to be respected. Parents need to be teaching the kid that 2 minutes of her not being the center of attention is ok, and she needs to be respectful of others. 3 year olds are very intelligent and can be reasoned with, and their methods of coddling her and just sticking an iPad in front of her face are setting her up for failure for dealing with her own feelings, and an escalation of behavioral issues later on that will be progressively harder and harder to deal with. They need to be snapped back to reality, and if they refuse to parent their child THEN let them know they are jo longer welcome.",
      "id": 59,
      "comments": [],
      "relation": "Support"
    }
  ]
}