{
  "post content": "Y'all this is such a juvenile situation but my feelings are hurt and I'm not sure if I'm being immature/sensitive. Long time lurker of AITA, first time poster. Throwaway.\n\nCast: Me (22F), Cori (28F), Sio (28F). All in a phd program together. \n\nI became friends with both long ago, when the program started. Got along with them great. Didn't love how Sio talked about other people, but felt it wasn't my circus. Then one day, Sio sits me down and LISTS all the ways I am a bad person and what I need to fix. Given that we are grown-ass adults, I took it to heart - figured I need to improve, but of course I was sad that my personality sucked. Told Cori about it and she basically went \"Pump the breaks, Sio is being bitchy. If she doesn't like you, she's allowed to but you don't have to 'fix' yourself per her criteria. Your personality doesn't suck, if it did, why would I or anyone else be your friend.\" Which flipped on the light in my head that Sio isn't my kind of person, and looking back, realized she had been bullying me - small digs, makes fun of me in public, always commenting on what I eat, making derogatory comments about my hair, how I wouldn't win in this little contest we were both in (I already thought I wouldn't win since I didn't have much experience since I'm 22 and she's 28, so I brought up the concern, and she agreed I wouldn't win). To reduce drama (ugh are we all 13), I just stopped hanging out with Sio, and Cori knew of this and encouraged 'cutting bullies out of my life'. Simple, clean.\n\nThen I find out that last weekend, Sio and Cori and their one friend *went to a party together*. They did boozy brunch, got manis, pregamed, and then went to the party with their wives (all same-sex couples). And I didn't hear of it until I saw the Instagram posts. This suggests a close bond between them. And I feel betrayed by Cori's closeness to Sio. I approached her and said I feel betrayed that Cori, who I consider my closest friend in the phd program, is so close with the girl she ENCOURAGED me to cut off. Cori told me I'm being oversensitive and touchy and she's allowed to be friends with whoever she wants was long as they're not racist/homophobic/anything like that, and since Sio was never mean to Cori, only to me, so why would Cori cut Sio off. Now I'm sad *and* baffled, and that's too many emotions.",
  "id": 1,
  "comments": [
    {
      "score": 46,
      "content": "ESH. \n\nYou’re mad at Cori for doing exactly what you did. You saw Sio being a complete bitch to others, accepted it because she hadn’t yet done that to you and it “wasn’t your circus,” and continued to hang out with her. Now that Cori does it, you have a problem with it? I would to, but I wanted to point out the hypocrisy. \n\nYou are right to cut out Sio. You are even right to cut out Cori if that’s not a healthy relationship for you either. Ultimately, do what makes you happy. But from here out, if you see someone being a shitty human, then speak up. \n\nYou can’t control what anyone does. Only what you do. That’s part of adulting. If you explain to Cori why it hurts you that she continues to hang out with Sio, someone she told you to cut out, and she doesn’t want to end the relationship, then you have no choice but to accept that and act accordingly. Maybe to Cori, it’s “not her circus.” \n\nYou’ll be fine. Focus on school. You have so much life ahead of you.",
      "id": 2,
      "comments": [
        {
          "score": 5,
          "content": "Thank you. I will say - I never saw Sio being a bitch to anyone, her bitchiness to me came as a complete shock. Just that I didn't like how she talked about people - she would vent to me about her parents expecting her to watch out for her younger sister Amy, and the parents would blame Sio if Amy did anything wrong (Amy is also an adult so the parents are fully in the wrong). But Sio would vent to me saying her 'turdface parents' and 'parasite Amy' are 'ruining her life'. But I thought that she was just exaggerating as a part of the venting. I would absolutely not have put up with her BEING a bitch to anyone",
          "id": 3,
          "comments": [
            {
              "score": 1,
              "content": "Is Amy disabled?",
              "id": 4,
              "comments": [
                {
                  "score": 3,
                  "content": "Nope. Just younger.",
                  "id": 5,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "[deleted]",
          "id": 6,
          "comments": [
            {
              "score": 1,
              "content": "Thanks 💛",
              "id": 7,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 15,
      "content": "ESH. A PhD program, you say? Huh.",
      "id": 8,
      "comments": [
        {
          "score": 9,
          "content": "RIGHT?! I'm mad at myself for being upset by this kind of petty stuff tbh",
          "id": 9,
          "comments": [
            {
              "score": 2,
              "content": "I can see why they are so much older in the program. They haven’t matured yet. Maybe one day.",
              "id": 10,
              "comments": [
                {
                  "score": 5,
                  "content": "It's the reverse haha I'm the baby of the program. And that makes me very sensitive personally - I'm very insecure and have imposter syndrome and I'm convinced I'm doing everything wrong and behaving like a child",
                  "id": 11,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I think you need to realize your youth is something you should be proud of as you have accomplished a lot in a short period of time. \n\nYou have the rest of your life to be the older one. Promise.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "Because if \"Sio doesn't like you, she's allowed to\"\n\nNAH except Sio.\n\nYour friends friend doesn't like you, it doesn't mean your friend has to not like her.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "People don’t have to like you and vice versa. The advice was sound. On the flip, your feelings are valid. She’s hanging with a person to treats other poorly and justifying it- it hurts more when you consider said person your close friend. I have friends that do not get along so they don’t associate- I certainly wouldn’t tolerate them being disrespectful. \n\nMy friends have a friend that I do not get along with in the slightest. No matter what I think of her, I’d never disrespect her. There is a reason my near and dear hang with her. I don’t see it, I just say hello and we stay on opposite sides of the table/party/event. \n\nMy mother always told me- to have good friends, you need to be a good friend. Only you can decide that for yourself. \n\nSo my question is- If Sio treats you that way, how long will it be before she treats Cori that way? And when is ok for Sio to treat people that way, when it’s not her (Cori) ?",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA I had a friend pull this crap too. I got rid of her. I don't ask for much but if your going to be friends with someone who tried bullying me then your no friend of mine. It's just that simple. As for the bully quit letting her do it stick up for yourself. She only keeps doing it because you allow it.",
      "id": 15,
      "comments": [
        {
          "score": 1,
          "content": "Oh I don't hang out with Sio at all anymore :) Didn't need that in my life.",
          "id": 16,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "ESH\n\nSio sounds like an absolute C-unit. Presenting you with a list indeed!\n\nCori can speak to whoever she likes, but she's not much of a friend if she isn't going into bat for you against people who are literally bullying you.\n\nYou don't have the right to be mad at Cori, either. That's her choice.\n\nYou DO have the right to thank the trash for taking itself out and remove both of them from your life.",
      "id": 17,
      "comments": [
        {
          "score": 2,
          "content": "She had a BULLETED list on her phone it was wild.",
          "id": 18,
          "comments": [
            {
              "score": 1,
              "content": "[removed]",
              "id": 19,
              "comments": [
                {
                  "score": 1,
                  "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
                  "id": 20,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "YTA",
      "id": 21,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "YTA simply because you never spoke up when you witnessed Sio’s bullying behavior the way she spoke about others (“not my circus”) so you can’t be upset that Cori is doing exactly same thing as you. \n\nI hope in the future you don’t wash your hands of the situation when you see/hear someone (especially a friend) being a bully.",
      "id": 22,
      "comments": [
        {
          "score": 2,
          "content": "Sorry I'm realizing how that comes across. Adding an edit to the post about what I meant by 'not my circus'. She didn't bully anyone in front of me, but I explained this in a separate comment:\n\nI will say - I never saw Sio being a bitch to anyone, her bitchiness to me came as a complete shock. Just that I didn't like how she talked about people - she would vent to me about her parents expecting her to watch out for her younger sister Amy, and the parents would blame Sio if Amy did anything wrong (Amy is also an adult so the parents are fully in the wrong). But Sio would vent to me saying her 'turdface parents' and 'parasite Amy' are 'ruining her life'. But I thought that she was just exaggerating as a part of the venting. I would absolutely not have put up with her BEING a bitch to anyone",
          "id": 23,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "YTA\n\nYou can control only who you spend time with, not who others spend time with. Cory's actions are unwise (it's just a manner of time before she's the target of Sio's malevolence (as soon as Sio needs to make her the enemy in favor of another friend), but that has little to do with you.",
      "id": 24,
      "comments": [
        {
          "score": 3,
          "content": "But isn't it good communication to express to Cori how I feel? Given that we're close friends?",
          "id": 25,
          "comments": [
            {
              "score": 2,
              "content": "You can let her know how this makes you feel but you can't express it in an accusatory way nor expect her to react sympathetically or however else you WANT her to react.",
              "id": 26,
              "comments": [
                {
                  "score": 3,
                  "content": "Ahhhhhh I see what you mean. Thank you! I now see I was being a bit manipulative - \"Here's how I feel, so here's what you need to do to fix it for me\"",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "NTA\n\nYou and cori are not as close as you think. She is allowed to be friends with whomever she wants. Just like you are allowed to be angry and uninterested in continuing the friendship. This is not juvenile. We are the company we keep.",
      "id": 28,
      "comments": [
        {
          "score": 2,
          "content": "That 'not as close' part is what is so difficult to reconcile. Cori invited me to her baby shower! Very soon, I'll be booking tickets to Florida (her home) for it, and that's a long expensive trip from the opposite coast. Sio isn't invited. If the roles were reversed, I'd be fine giving up my 'non baby shower close' friendship if they hurt a closer friend.",
          "id": 29,
          "comments": [
            {
              "score": 1,
              "content": "Go. Have fun. Just remember not to get your preverbal heart broken.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}