{
  "post content": "Daughter is 16. Her mom and I are divorced.Daughter has been caught smoking pot several times from the age of 14. Her mom and I have collectively punished her several times for this. The last time we caught her, I started drug testing her. Her mom doesn’t agree with it, but we have caught her so many times now that I think this is the best way to prevent her from doing it.\n\nI don‘t normally go through her room, but the router for the house is in there, and I needed to reset it. When I go into her room, I found a mushroom cap on black paper hidden underneath her desk. I look up what the hell it is and it is a spore print for magic mushrooms. I go through her room further to find an entire damn aqarium filled with mushrooms in the back of her closet. obviously I am enraged, so I wait for her to get back from school, and I called the police. She was arrested, booked and released into her mother’s custody.\n\nHer mother is pissed, and saying that I may have ruined the kids life for no reason, but we have tried to correct her drug abuse several times to no avail, and it has escalated. She now has a court date and can answer to the law since she doesn’t take the rules in my house seriously. I doubt she’ll get more than probation anyway.\n\nMy parents are also pissed though, saying that this could have been handled inside the home, and that’s why I’m here. I’m wondering if I over reacted and would like a more impartial judgment.\n\n&#x200B;\n\nI am making and edit to respond to a few things.\n\nThis was a small ten gallon tank. I guess people are picturing something larger. There were a lot of mushrooms in there though. My daughter has a small walk in closet that is, honestly, so messy that I don’t bother to look in there too much. Because she has been passing her drug tests, I have been cutting her slack. I honestly would not have called the police if I thought that she was going to get a jail sentence at all.",
  "id": 1,
  "comments": [
    {
      "score": 23298,
      "content": "YTA.   Getting your child a criminal record over mushrooms is most definitely not going to help her.\n\nDon’t rely on the criminal justice system to parent your children.",
      "id": 2,
      "comments": [
        {
          "score": 4847,
          "content": "I think now is the best time for her to catch a case. Juvenile records are sealed. If this happened in 2 more years, the long term damage would be astronomical. This gives her a chance to make better choices while mitigating the consequences for her future.\n\nJuvie court doesn't parent. Most likely there will some form of court mandated rehab or outpatient treatment, since this is a first offense, and any program worth a damn is going to work on family dynamics as well.",
          "id": 3,
          "comments": [
            {
              "score": 3308,
              "content": ">since this is a first offense\n\nThat's how it should work, but it doesn't always go like that. \n\n\nAnd juvie doesn't rehabilitate, on the contrary. If you go to prison as a soft criminal, you are probably coming out as a hard criminal.",
              "id": 4,
              "comments": [
                {
                  "score": 490,
                  "content": "I just wanna point out that way too many of you assume that the OP lives in the US, not just here but in almost every thread. Not every justice system treats drug charges as seriously as the US, for instance it blocks zero opportunities in my country for a minor. Just put INFO in the  comment and ask OP what country he's from, otherwise it's nothing but conjecture from both sides.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 515,
                      "content": ">for instance it blocks zero opportunities in my country for a minor\n\nIt blocks zero opportunities in my country too...and that's because you get fined instead of arrested. This MINOR girl got arrested and taken to the police station from her own home. That doesn't just happen. \n\n\nAlso, mushrooms van grow quickly. There's a good chance that she had so many that there is a suspicion of dealing. Especially since dad thought there were enough to suspect dealing. That's serious in every country.\n\n\nAnd there are also countries where drug offenses get treated worse then in the US.\n\n\nAnd OP talks about States.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "[removed]",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "In the US, in most jurisdictions I know of, Shrooms are charged the same as Heroin, which could end up with her being charged with Felony possession, felony manufactoring, and felony intent to distribute depending on how many she had. 1g being seen the same as 1g of heroin. At least in my state in my county...so, ya it could fuck her life up permenantly.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 194,
                  "content": "[removed]",
                  "id": 9,
                  "comments": [
                    {
                      "score": 1241,
                      "content": "No, the person you commented to is correct. Juvie is a Criminal Creator. Source: am forensic psychologist.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 515,
                      "content": "Nah. Had a small stint in juvie at 15 for smoking weed. Never even thought to try anything harder until then. Those 3 weeks spiralled into what turned into being an almost 5 year drug addiction ending in a 6-month rehab  stay. Person you’re replying to pretty much had it spot on.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 126,
                      "content": "Have you been in jail? do you have experience of working with folk that come out of such \"regenerative\" places?",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 44,
                      "content": "Have you ever been to jail or prison?",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Agreed- they don’t realize once a kid has a charge, they are labeled for life, and have a hell of a time ever coming back from that. Additionally, when a parent causes this, they have NO reason to every trust an adult in their life again..& many times have no idea where to turn for help at all in the future..",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I was blackmailed into entering a psych ward for a short time for suicide. What I was taught was what the best drugs were to do to commit suicide on, and was slightly mentally scarred by other patients going into my room and stealing my underwear/shampoo (I'm a male) and the front desk not giving a damn. The programs they have in there are very short and broad to avoid triggering people.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "It's a proven fact.  Would you like sources?\n\nEDIT: For those that were curious, it was a post about how people have crazy ideas about the american prison system.",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "it seems like I’m the only one taking your comment as in people having some fantastic ideas about the fact our system actually rehabilitates people whereas, in actuality it does not.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Kids go in for magic mushrooms , come out with connections and influence for more dangerous and worse things on top of being more rebellious , betrayed and closer to 18 where things don’t just ‘dissapear’ and crimes that get you 6 months turn into crimes that get you 5 years . I’d bet everything that this guy has never asked his daughter why or tried to understand what is driving her down this path. Just slam the punish hammer tell her she’s wrong your right she’s bad. Magic mushrooms aren’t even addictive or harmful there’s plenty worse things the kid could be doing that might  require outside assistance. Should be some self reflection on what as a parent he can do better instead of always looking at what someone else does wrong, especially your kid. Ok boomer",
                  "id": 18,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 938,
              "content": "NO NO NO!!!!! OP YTA!!\n\nsome of you guys are all wrong!! Just because a kid catches a case does not mean shit is sealed!! I’m 25 years old and I’m currently struggling with depression because my piece of work parents physically abused tf out of me, I hit my mother back in self defense one day and after that she called cops I had been in and out of juvie from age 14 to 18 and every single time it was because my parents put me in there. They thought it would be cheaper for them to keep me locked up in a cell then to pay for my basic teenage needs. \n\nI tried to get into the military from age 20 until this year I finally gave up. I got the run around, lied to about them doing my complicated juvie record, waivers that had to be waited on for the past 5 fucking years. I tried every single branch there was. It was concluded, I had a conduct disorder. I’ve ultimately been so EMBARRASSED AND ASHAMED of my situation that I’ve cut off a lot of friendships because I’ve just wanted to hide. My parents will never be sorry nor give two shits to understand the HELL I’ve endured the past 10 years (being in the juvenile system, treated like a piece of shit criminal, then getting the run around and rejected from THE MILITARY) for fucks sake! \n\nDONT BE A STUPID SELFISH PARENT AND THROW YOUR KID AWAY TO THE SHITHOLE SYSTEM!!!!",
              "id": 19,
              "comments": [
                {
                  "score": 185,
                  "content": "I'm sorry, dude.\n\nAmerica is messed up.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 14,
                      "content": "This is not a specific issue to America man.",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "That's not an America problem, that's a parenting problem.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "This isn't America, this is his parents failure",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 115,
                  "content": "Yep. Sure you might not have to declare it on a criminal background check but if his daughter ever need a security clearance it’ll show up. Not that’s it’s an automatic disqualification but it’ll show up. And if she lies about it, and it shows that’s a serious offense.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "The military rejects tons of people for dumb reasons. I know that it might be something you wanted to do, but getting rejected by the military isn't embarrassing or unusual at all. They deny tons of people.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 5,
                      "content": "They also let in tons of people. There’s people with top secret clearances that have felonies on their record from their teenage mishaps.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 697,
              "content": "Someone who uses mushrooms doesn't need outpatient or rehab. I'm sorry but they just don't. If anything this will just make her more sneaky. This won't teach her \"if I do mushrooms I'll be in trouble\" it will make her think \"wow my parents are assholes\"",
              "id": 27,
              "comments": [
                {
                  "score": 344,
                  "content": "Wrong. If she were an adult I would agree. But no kid should be using anything with psychotropic properties on a developing brain. She may not need rehab, but she needs something because that IS a problem. Once your brain stops developing and you are an adult it is much different. This girl has a problem. She isn't addicted, but she is engaging in harmful behavior. I don't agree with the OP on how he did this, but the idea this isn't a problem isn't accurate.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 188,
                      "content": ">Once your brain stops developing and you are an adult it is much different.\n\nThe brain doesn’t stop developing until ~25, well past the point literally every country considers someone an adult.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 54,
                      "content": "I didn't say it wasn't a problem I just said rehab won't help because it's not an addiction problem. It's just a kid who experimented and I really don't know the cure for that or if there is one",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 99,
                  "content": "*parent. I would be surprised if she didn’t fight to live with her mom full time after this.",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 480,
              "content": "She's going to get charged as an adult. You'll see. It sounds like she had enough for a distributing charge.\n\nThere are just no words for how much of a shithead OP is. A drug conviction cuts you off from a lot of sources of financial aid too.",
              "id": 32,
              "comments": [
                {
                  "score": 152,
                  "content": "Would you call the daughter the asshole if the cops came and ended up charging OP with drug manufacturing as well? Her charges are probably felony possession with intent and a drug manufacturing charge. If OP's dad is renting, then he is 100% gonna be evicted over this even though it's not his grow op.\n\nEdit: btw, the whole \"growing them to treat depression\" story everyone keeps claiming is false. Not once did OP say his daughter claimed thats why she did it, that is literally fake and being added by AITA users so they can feel justified calling OP an asshole. The daughter is the real asshole for growing mushrooms to sell.\n\n You don't grow drugs in your parents house without their knowledge and permission, **ever**",
                  "id": 33,
                  "comments": [
                    {
                      "score": 143,
                      "content": "[deleted]",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 30,
                      "content": "Kids never do stupid shit.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Being charged as an adult, depending on the charge, may also cut off the ability to rent in the better apartments once she leaves home, which will surely be ASAP",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 394,
              "content": "[deleted]",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 339,
              "content": "Juvenile records mean that a lot of colleges won't accept her and a lot of scholarships are out of reach for her now. For an aquarium of mushrooms. \n\nThis goes beyond fear of drugs and into rage about not being able to control his daughter.",
              "id": 38,
              "comments": [
                {
                  "score": 168,
                  "content": "You can't get any kind of financial aid for college with a drug charge in the US.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Hopefully, she'll get the \"intervention-not guilty\" trial where she doesn't get a conviction but needs to attend a bunch of bullshit drug classes and do some community service.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 242,
              "content": "16 year old with an entire aquarium tank full of mushrooms can be charged as an adult. Especially if they found any other drugs in her room. Its pretty serious. She could be charged with possession and perhaps intent to distribute",
              "id": 41,
              "comments": [
                {
                  "score": 183,
                  "content": "I mean, if she had an entire aquarium full of mushrooms, she probably HAD intent to distribute. I'm not saying that psychedelics are bad or that doing them makes you a bad person, but if a 16 year old girl is trying to sell shrooms to her classmates, she's probably not going down a very good road.\n\nJuvie probably won't help her, but I also doubt she'll see any time for a non-addictive drug offense at her age. If anything she'll probably be forced into community service or a program.\n\nEveryone wants to act like OP is a shithead, but I assume most of them never had to deal with their 10th grader becoming a drug dealer. It's not like there's an easy solution to that problem.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Probably had intent... who grows one dose of mushrooms? Please leave your clown shoes by the door before you walk in this house.",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "Your sentence isn’t based on how “addictive” a drug is. Hallucinogens are literally the worst class drug you can be caught with.",
                      "id": 44,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "They barely weigh shit after they've been dried, one tub dried truly could be for personal use only. Why not put together a few months or year supply?",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Shrooms are charged as a class 1 drug in my state, same as heroin, same as meth, same as crack. With an aquarium full she could get charged with manufactoring, intent to distribute, and possession, all A felonies per the state with a max of 25 years. They would most definitely prosecute her as an adult in my jurisdiction. We just had a 17 year old tried as an adult for growing 21grams of shrooms, he got 2 years in prison.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Wow. So OP basically turned his daughter over to the prison system to turn her into a hardened criminal. What brilliant parenting.",
                      "id": 47,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "An average aquarium will only yield about an ounce (28g) of dried mushrooms. Not a huge amount.\n\nAlso heard growing shrooms isnt illegal its the drying process that is. Just like growing poppy flowers",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 148,
              "content": "Whether it's the best time or the worst time, it still doesn't excuse OP for calling the cops on his own daughter over some damn mushrooms.",
              "id": 49,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 39,
              "content": "I recently learned that they are sealed, but not for the military, at least in the US. This will limit the jobs the kid can do if they decide to join a branch of the military.",
              "id": 50,
              "comments": [
                {
                  "score": 32,
                  "content": "And not for any federal law enforcement or teacher certification.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This is bullshit.  I was arrested for weed at 15 and I joined the military and ended up getting a TS SCI clearance. With access to any MOS I wanted.\n\nTry again.",
                  "id": 52,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "Juvenile records *can* be sealed. If one doesn't fill out the paperwork, pay the fees, and go to court to get them sealed, they won't be.\n\nETA source: oh, fuck me, I should really get my record of \"throwing a *metal* PVC pipe\" (really) sealed. It already screwed me once",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1348,
          "content": "[deleted]",
          "id": 54,
          "comments": [
            {
              "score": 137,
              "content": "Yah mushrooms are a god send for anxiety. I'm sorry you had to go through that.",
              "id": 55,
              "comments": [
                {
                  "score": 9,
                  "content": "Psilocybin mushrooms are probably the best thing I've ever done. OP it just a vindictive asshole who can't properly communicate with his daughter about how he feels. This is all about communication, not drugs.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 83,
              "content": "Oh I went to wilderness therapy also. My parents sent me voluntarily because they thought I was a “troubled child” and it was just easier to pay some mormons in Utah to fix me - it fucked me up pretty good and I still haven’t forgiven them. Learned a lot about drugs there.",
              "id": 57,
              "comments": [
                {
                  "score": 22,
                  "content": "I learned after being dropped off that I would be in the backpacking wilderness therapy rather than the normal summer camp.  I lost 37 pounds in three weeks hiking (despite the fact that midway through I acquired access to a 5lb block of cheese and ten minutes unmonitored;  Down the hatch).  I was at one point deprived of safe water supply for a period of several days, and forbidden to drink from unsafe streams.  I had to sit through cult-related conflict resolution procedures for \"making a face\" and put in timeout for an afternoon;  The stick at that point was sending me to the literal prison camp that they ran in the next mountain over.  Two kids tried to escape while I was there.\n\nDidn't learn anything about drugs.  I did learn how to convincingly stage a psychotic breakdown.  The infected wounds from hip and shoulder belts, and the feet so swollen I could barely walk helped, I'm sure.  They put me back in the day camp, where I got to witness things like a uniformed police officer called in to threaten a younger child who wouldn't stop crying, and what the counselors described as the \"hick neighbor with bloodhounds\" who brought back one escapee.\n\nThis because of an ADHD diagnosis that arose from teachers disgruntled at my lack of enthusiasm coupled with a high IQ test.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 77,
              "content": "wait they sent you to mandatory rehab for fucking mushrooms? they sent you to mandatory rehab over a non addictive drug? How stupid can they be?",
              "id": 59,
              "comments": [
                {
                  "score": 24,
                  "content": "> wait they sent you to mandatory rehab for fucking mushrooms?\n\nI got it for weed. that scene in halfbaked was 100% on point.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Same. They had me watch a video about how \"all drugs is the same!\" and a weed addiction was a stepping stone to a cocaine addiction. \n\nJoke's on them, weed is legal where I live and I'm not cool enough to know where to buy coke anymore.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Psychedelics are schedule I drugs. As far as the law is concerned, there is no difference between a mushroom cap and a baggy of meth. This is why the drug war is bullshit.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Its a different logic with very religious/strict parents, unfortunately.",
                  "id": 63,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Welcome to republican America!",
                  "id": 64,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "> The rehab was that stupid wilderness therapy bullshit. I had to eat canned beans and talk about my feelings with meth heads for a month in the middle of the woods.\n\nMy brother went to one of those for pot. It was pretty useless and apparently on those wilderness trips they all smoked pot together.",
              "id": 65,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "what a fucking snitch",
              "id": 66,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 599,
          "content": "Yeah jesus fucking christ. While people are fighting to stop jail sentences for non violent crimes because of the damage being institutionalised does, OP is trying to put her IN the system.\n\nYTA",
          "id": 67,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Thank you. \n\nI wish Reddit understood this more consistently. There was another thread where everyone cheered on a father who was leaving his 18 yo son to deal with a DUI arrest by himself. For sin9 some reason people loved that approach. \n\nThe \"justice\" system isn't just, and using criminal Justice to teach kids lessons is a terrible idea.",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Is she white?  If she’s white this might be a dose of reality.  If she’s not you just fucked her for life and will likely bury her before she does you.  Sucks but it’s true. Once a black juvenile ends up in the system the system will grind them until they are dead or in jail for life.  Good job father of the year.",
          "id": 69,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Also if you don’t like her friends now wait till you meet the new ones she makes in juvie.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Definitely, pot and mushrooms in spite of how they're treated in the legal systems in some places, are not ruin your life type of drugs. While you have every right to  punish her as a parent, the legal system treats them as disproportionately severe offences. Sicking them on her is just cruel. You have a better chance of turning what was just an experimental phase into actual criminal activity once she feels like she's stuck on the wrong side of things with a record",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Sorry bro YTA.\n\nGetting the law involved helps nobody. Best thing you can do is give her the positive reinforcement she’s looking for with drugs.\n\nShe needs to trust you. That’s not helping. Try to be someone she can go to if she needs help.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Also very much TA for taking such drastic action without even discussing it with her mother.",
          "id": 73,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "You literally put her life at risk. What might have happened if she saw the cops and suddenly reached for her phone?",
          "id": 74,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 9282,
      "content": "YTA. There are so many better ways to handle this situation. You could have first figured out why she had the drugs. A lot of teenagers who abuse drugs have underlying issues going on that need to be addressed. You didn’t try to do that. You could have found help with a family therapist, or even a personal therapist for her, that could have helped her through this time. You could have sent her to rehab. All of those things would have potentially helped her. You did absolutely nothing but make it clear that she can’t come to you if she’s ever in trouble.",
      "id": 75,
      "comments": [
        {
          "score": 3619,
          "content": "Man, she’s gonna hate her dad so much.",
          "id": 76,
          "comments": [
            {
              "score": 1501,
              "content": "He's going to be dismissive of her feelings of hate too, but by that point she won't care anymore. Pretty sure this dude just ended his relationship with his daughter. Wonder how many years or decades or lifetimes it will take him to actually realize it.",
              "id": 77,
              "comments": [
                {
                  "score": 680,
                  "content": "He will continue to blame his kid and avoid all responsibility.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 511,
                      "content": "I love how he “Magically” found a hidden stash while resetting the router.",
                      "id": 79,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 135,
                      "content": "It's probably a fake story for karma, anyway.",
                      "id": 80,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Did he and my dad go to the same shitty parenting school?\n\nCoz damn if thats not what I am living with right now",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "You know my dad, I see.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Yeah well... With these \"dad knows best\" pricks it's all about their fragile egos (\"you will obey my rules!\") anyway. So even if she does rightfully hate him the rest of her life, it will just serve to strengthen his victim narrative (\"I don't understand why my kid won't visit me\").",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 176,
              "content": "[removed]",
              "id": 84,
              "comments": [
                {
                  "score": 3,
                  "content": "Nothing but living under constant monitoring.",
                  "id": 85,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "As someone that went from sober to booze to weed to hallucinogens in my first year of high school, OP sounds like he fosters the exact type of negative home life that drove me to substance abuse.",
              "id": 86,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "I would have.",
              "id": 87,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Yup. Probably just ruined their relationship for quite sometime if not forever",
              "id": 88,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Yeah, that's the end of a good relationship forever.",
              "id": 89,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "As much as I hate to agree with a comment like this, it’s true. It’s very reminiscent of the “tough love” my dad often imposed on me. At 21 I haven’t talked to him for close to two years now, and it sucks not having a dad but the trouble it feels like I go through just by having a conversation with him outweighs that. Hopefully OP can take this as a learning experience and move forward to have a healthier relationship with his daughter.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Understandably. The fact that people go to this extent over something that is legal in many places is insane.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "That's my type.",
              "id": 92,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 541,
          "content": "Yeah, say goodbye to your kid ever ever trusting you again, or telling you anything going on her life. That is DONE. YTA (the OP, to clarify).",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 291,
          "content": "But aren’t those things more difficult than calling 911 and dusting your hand off while saying “welp, she’s the criminal justice systems problem, now”?\n\nIt’s fairly obvious why 1) his wife left him and 2) his daughter feels the need to drown her sorrows with substances. With a “dad” like that, I’d be shootin dope and robbing banks in no time.",
          "id": 94,
          "comments": [
            {
              "score": 18,
              "content": "[deleted]",
              "id": 95,
              "comments": [
                {
                  "score": 17,
                  "content": "Two years of drug tests instead of rehab or family therapy does not speak kindly of the father, to be fair.",
                  "id": 96,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Right, and testing for pot at jobs is why a lot of people I know moved on to either shrooms or coke (usually not both but you never now) so testing her just seems like a terrible idea from every angle...",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Ok but here’s the thing: if the daughter was a monster he absolutely would have included these wrongdoings to get people on his side. I feel like this post isn’t real anyway but still.",
                  "id": 98,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "This kid is a nightmare because her dad is on her ass making her take drug tests. He literally says he doesn’t like her.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 77,
          "content": "This girl needs her dad on her side, helping her understand what these substances do and that she can come to him for help and advice and, oh I don't know, some fucking fatherly love? This is one of the most obvious YTA I've ever seen. \n\nOP, good luck ever connecting with your daughter. Jesus Christ.",
          "id": 100,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6134,
      "content": "YTA , Sheesh, I can see why she is rebelling.",
      "id": 101,
      "comments": [
        {
          "score": 1557,
          "content": "This. I mean, I don't condone drug use or anything, but isn't having your kid's trust more important??",
          "id": 102,
          "comments": [
            {
              "score": 755,
              "content": "Every problem a person has usually stems from deep set  roots of family issues. The OP? sounds controlling AF.",
              "id": 103,
              "comments": [
                {
                  "score": 188,
                  "content": "I disagree. I worked with juvenile delinquents for a few years, and the ones who had severe consequences for stuff like this tended not to go back. The ones where the parents didn't do much were the repeat offenders.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 399,
                      "content": "Very close family member works in the law and justice system here: the moment you do this to your kid, who has a history of drug use, who is gone through some clear emotional crap from a divorce and you do not take action, as a team, as a family unit (note I am saying unit, no husband and wife, just the unit that formed that kid)  in family counselling, with all the members involved and supporting one another? you are damaging the very weak bonds that are holding whatever remains of these folks together.",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": ">I worked with juvenile delinquents for a few years\n\nDo professionals usually refer to them as juvenile delinquents? Also, there's a lot of data to support that the juvenile justice system and harsh penalties have created a [school-to-prison pipeline](https://en.wikipedia.org/wiki/School-to-prison_pipeline).",
                      "id": 106,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "If the parents don't do much. We're talking about a screwed up legal system here.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Uh huh. Sure. Because people who work with juvenile offenders refer to them as delinquents...",
                      "id": 108,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Also, mushrooms and weed are, of all drugs kids can be taking these days, a seriously low priority. \n\nI'm not saying there's not cause for concern, but holy shit, have a fucking conversation with your kid. Find out *why* they are doing this. WTF.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 152,
          "content": "Parent of younger kids here, I can see how doing drugs is rebelling, but cultivating an aquarium full of mushrooms??? That seems to go beyond rebellion...",
          "id": 110,
          "comments": [
            {
              "score": 148,
              "content": "Mushroom spores are much easier to buy than actual shrooms where I’m from considering they are legal in most places and you can order online, they’re also so so easy to grow that I would say she’s done this simply because it’s easier than finding a dealer that sells mushrooms.\n\nThe other option would be to go out looking for them in the wild but then you have no idea on the potency. So realistically what she has done is the safest way she could have tried an already pretty safe drug.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "That says massive issues with parenting. There are holes in this story, this kid has gone through some big crap and counselling was not followed cos \"kid isn't liking it\". At that point is when parents had to put the fist down and exert parental responsibility. \n\nSource: parent too.",
              "id": 112,
              "comments": [
                {
                  "score": 16,
                  "content": "The way they handled her smoking pot was probably what caused even more problems between parents and the daughter which would only worsen the “problem”. I mean I’m just assuming that the parents exaggerated the seriousness of the fact that she smokes weed.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Facts. Smoking weed is so common at her age and this mans b acting like its heroin",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Yeah honestly, won't force counseling but will get your kid arrested?  Weird priorities.  It screams of caring more about power than actually raising a human.",
                  "id": 115,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "It's legal in many countries, you can buy a starter kit for 20 bucks, just add tap water and they will grow. It's not a meth lab or something.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "\"I can see how doing drugs is rebelling, but cultivating an aquarium full of mushrooms???\" You do know that shrooms are one of the milder drugs after weed and alcohol and by the aquarium is how you grow them, right?",
              "id": 117,
              "comments": [
                {
                  "score": 3,
                  "content": "Alcohol is arguably harsher and has higher addictive potential, tbh. It’s just socially normalized",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Then maybe he should have gotten her some help the first time they caught her smoking pot. He could have gotten them into therapy, instead he chose to be super controlling. He could have tried to figure out what was at the root of all of this, instead it sounds like he's jumped on her with both feet and caused more problems.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4599,
      "content": "YTA. Surprised if she ever talks to you, after this. Good luck.",
      "id": 120,
      "comments": [
        {
          "score": 2551,
          "content": "Also, calling smoking marijuana “drug abuse” is laughable.",
          "id": 121,
          "comments": [
            {
              "score": 786,
              "content": "[deleted]",
              "id": 122,
              "comments": [
                {
                  "score": 149,
                  "content": "Drug abuse in children is usually a symptom of severe home life issues.  The Venn diagram of people I know who have a healthy relationship with their parents and people who abuse drugs is two circles which don't touch.\n\nI'm not going to say it's fine, but I'm willing to bet negative effects from stress significantly skew the data on how bad drugs are for teenagers.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Eh, I had great parents, was happy and did well in school. I just also really like weed, so I smoked it pretty frequently. Never did anything else, though, and it's never really had a negative impact on my life (other than the munchies I guess). I just think calling smoking pot \"drug abuse\" is an exaggeration.",
                      "id": 124,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 290,
              "content": "A CHILD smoking marijuana is drug abuse. She's been smoking it since the age of 14. Her brain is still developing and there are documented issues with regularly using weed at a young age, mostly with memory or lower IQ I think. Just because it's not going to kill her young doesn't mean it's not bad for her.\n\nI agree YTA but using marijuana and mushrooms at 16 is something OP should deal with, just in a reasonable manner.",
              "id": 125,
              "comments": [
                {
                  "score": 23,
                  "content": "You are correct, but compared to the criminal justice system, it's something that may be dealt with and improved over time with love and attention. also the mushrooms are very safe. Safer than smoking.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "OP says in a comment that she has been passing her drug tests. So maybe she isn’t even using",
                  "id": 127,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I doubt OP is testing for shrooms (honestly I don't even know if it's possible to test for that) so she might have started doing shrooms because she can't smoke weed anymore.",
                      "id": 128,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 232,
              "content": "[removed]",
              "id": 129,
              "comments": [
                {
                  "score": 823,
                  "content": "There is evidence that it’s not great for the developing brain. I’m as pro weed as anyone but it should be 18+ still. Also, mixing weed and alcohol together impair driving more than alcohol alone, so it’s better to keep it out of the hands of teenagers who are more likely to make those kinds of bad decisions (drinking and driving) in the first place.",
                  "id": 130,
                  "comments": [
                    {
                      "score": 236,
                      "content": "Like I said, I don’t think it’s great for a 14 year old to be smoking every day, but if you catch your kid with meth, you go straight to rehab, whereas if you catch your kid with weed or shrooms, you have a talk with them and try to explain/understand the pros and cons of their behavior. \n\nDon’t let her off scot-free, but don’t go straight to punishments and police.",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 134,
                  "content": "As far as marijuana goes, inhaling anything into your lungs other than oxygen isn't healthy for you. I'll still take a phat bong rip, but it's not 100% harmless.",
                  "id": 132,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Well, fair point.",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Air really isn’t that great these days either",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "If you only inhale oxygen it wont be good for you",
                      "id": 135,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Other than air*",
                      "id": 136,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 62,
                  "content": "This is so laughably false it’s sad.   Reddit just loves its drugs.\n\nMarijuana has been shown to inhibit brain development in teenagers.  Smoking it is also bad for the lungs.  Weed used to self medicate depression can cause a dependency.  Being under the influence of weed or shrooms mixed with the irresponsibility of a teenager can also result in poor decisions or injury.\n\nSo no.  You are completely wrong.",
                  "id": 137,
                  "comments": [
                    {
                      "score": 15,
                      "content": "[removed]",
                      "id": 138,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "I agree, I smoked weed as a teen thinking it was fine and really regret it! I’ll never know if my memory would be better had I not done so. Once I left high school and being under my parents roof, I used weed way to much at the start of uni. If I just asked for help with the psychological issues I was trying to distract myself from by using earlier then I wouldn’t have gone down this road of years of abuse. I’m glad I stopped using though the year before it became legal, if I were legal when I was 14 then I would have abused it more.",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "This shit is just as dangerous as DARE.  Just because it doesn't kill you or have you begging in the gutters doesn't mean it's harmless. Smoking pot is seriously bad for the lungs, not to mention long term memory and REM sleep take a serious hit, two things growing teenagers need.",
                  "id": 140,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "They aren't harmless....",
                  "id": 141,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 81,
              "content": "Obviously an overreaction on OP's part, but I have to say that my concern as a parent in this situation would more be about what the kid was building up to. Like why did she have so many, why was she growing it herself, etc. \n\nDepending on how old OP is, they might have grown up right at the height of the 'DRUGS = BAD\" focus in schools, etc. Could explain their reaction and overall sentiment.",
              "id": 142,
              "comments": [
                {
                  "score": 6,
                  "content": "Growing is the best way to get mushrooms and where I live it's the only way. You can pay $45 for a dose, and that's assuming anyone has any or theyre even in season. Or you pay $12 for the materials to grow your own and get several doses",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I would say for someone so young it is crossing the line into abuse. Her brain in still growing.",
              "id": 144,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "As a daily pot smoker, at 14/16 it is abuse.",
              "id": 145,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3253,
      "content": "YTA. Drug addiction needs to be addressed MEDICALLY. What do you think will happen now? Jail or nothing. Well done.\n\nThe police is not here to help you suck less at parenting.",
      "id": 146,
      "comments": [
        {
          "score": 1326,
          "content": "[removed]",
          "id": 147,
          "comments": [
            {
              "score": 1254,
              "content": "Dude yeah, it’s weed and mushrooms.  Wtf ppl talking about “drug addiction.”  OP sounds like a *nightmare*",
              "id": 148,
              "comments": [
                {
                  "score": 375,
                  "content": "This has been happening since she was 14 and now her relationship with drugs has escalated to her commiting a felony, regardless of whether or not shrooms should be legal ~~growing a schedule 1 substance definitely crosses a line.~~\n\n It's not the drugs that shes taking that's the issue, it's her determination to do them at such a young age. Ignoring the fact that studies have shown drugs to negatively impact development at this age, her determination to get her hands on drugs imply a whole other set of issues for her. \n\nThere some deep seated issues here that needs to be dealt with and OP has tried everything including therapy. What is he supposed to do which he already hasnt?\n\nEdit: fixed my boomer terminology\n\nEdit 2: all you people getting caught up that I used a terminology that triggers you are missing the point either intentionally or otherwise.",
                  "id": 149,
                  "comments": [
                    {
                      "score": 716,
                      "content": "> and growing a schedule 1 substance\n\n\nI agree she shouldn't be doing it, but using terms from the war on hippies is nothing more than fearmongering.",
                      "id": 150,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 387,
                      "content": ">schedule 1\n\nThe DEA drug scheduling ranking is nonscientific and basically completely arbitrary. It's a ranking of how severe certain drugs seem to social conservatives, not how dangerous the drugs actually are. If it was a ranking of how dangerous the drugs are, alcohol and tobacco would be at the top and marijuana and mushrooms would be at the bottom.",
                      "id": 151,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "The fact that its schedule 1 is the biggest reason not to call the cops. The sentencing is way overblown for mushrooms and the juvenile and adult prison systems in US  are designed mostly for profit, not for rehabilitation. OP definitely turned a possible problem into a serious problem.",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "So adding a felony to the kids  criminal record will surely help their future.  Yeah great parenting.",
                      "id": 153,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 243,
                  "content": "I mean as someone who loves shrooms and weed, I have 100% seen them be abused. People can get addicted to anything and anything in excess isn't good. Plus she is WAY too young to be getting into psychedelics, her brain is still forming and tripping all the time isn't going to help. I don't know if I'd go so far to be out here calling her a drug addict but she definitely has a drug problem that needs to be addressed without the police.",
                  "id": 154,
                  "comments": [
                    {
                      "score": 40,
                      "content": "I really hate this whole \"just because it's not addictive it's perfectly safe\" attitude. I've seen weed abused and to be honest, they acted pretty mentally addicted. Just because something won't give you withdrawal doesn't mean people can't get addicted to the high.\n\nIf you can't stop... that's pretty much addiction. And a lot of people I met that smoke weed regularly CAN'T stop. It can affect sperm so I knew a guy who was supposed to stop since he and his wife were having trouble conceiving. Nope. He couldn't do it. Missed it too much. How is that not addiction?\n\nI think you should be able to do what drugs you want. But at the same time, not all \"safe\" drugs are safe and harmless for everyone. Just cause they don't have physical issues (and let's be real, smoking plants isn't good for your lungs) doesn't mean they can't be harmful to your life socially.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I agree. If she was my daughter I would be concerned too but no way in hell would I call the fucking cops on her.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 94,
                  "content": "I mean, they may not be physically addicting like heroin or meth, but they absolutely can be psychologically addicting, especially at an age where your brain hasn't even finished developing (or if you have an addictive personality paired with psychological issues you don't know how to treat otherwise).\n\nffs I've seen handfuls of people, teens and adults, with depression and anxiety get addicted to pot and psychadelics, not because they're physically addicted, but because they've mentally groomed themselves to think that smoking pot 24/7 is the \"cure\" (when in reality 9 times out of 10 it just makes their anxiety and depression worse because it sends them on a paranoid, drug-induced spiral). at that point it's just an escape, not a real solution. I left my last boyfriend because of that shit - because he wasn't willing to seek actual help for his issues beyond \"pot makes me feel good for an hour so I'm just gonna constantly be so high I don't have to worry about functioning in the real world.\" Do you know how difficult and emotionally taxing it can be to be in a relationship with someone like that? \n\nIt's not good for your mental health to depend on a self-diagnosed \"cure\". It would be one thing if these people were prescribed marijuana to help with their anxiety but some of these people were straight up told by their doctors and therapists to STOP smoking because it was becoming more of a crutch than a legitimate treatment. \n\nIf you have an addictive personality, you can get addicted to *anything* that gives you an escape from the real world and your problems. It's why people can get addicted to television or video games.",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 53,
                  "content": "Okay drug abuse wtf ever but repeated drug use in a teenager can have lasting affects, just cause they won't kill her doesn't mean they shouldn't be worried",
                  "id": 158,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Is it crazy though? OP is a nightmare but I think people shrug off addiction to weed way too easily. People get addicted to food, and that doesn't affect your brain nearly as much.\n\nI smoked myself into debt and could not stop for *years*. I lost many things close to me and hit rock bottom before I realized I needed to stop smoking. I actually didn't smile for *two months* after I quit smoking!\n\nI still think weed should be legalized, even recreationally (that's not for government regulation to decide, and it just gets used to punish minorities disproportionately), but I think it's dangerous to say that you \"can't get addicted\".",
                  "id": 159,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Wow. Y'all must be young and use often. Whoever tells u that MJ and shrooms are not addictive means u uve listen and over use. Bottom fucking line. I've seen many people unable to put weed down and many people unable to put shrooms down among other drugs. However,  being a young person means experimenting and it's only natural. Its whether if that individual continues and turns into to abuse when they become of age.",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Hey man if shes smoking weed and doing shrooms at 14, she's most likely gonna go onto harder stuff. If she was smoking weed and doing shrooms at 18 I wouldn't be worried in the slightest. But 14 is too young and GROWING shrooms is a big step. If someone offers her something harder, she's proba gonna take the risk.",
                  "id": 161,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "Maaaybe maybe a teenager needs attention and therapy rather than drugs ?",
              "id": 162,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Haha I'm glad someone here has some sense!",
              "id": 163,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "While this definitely isn’t a real addiction (although people sometimes become mentally dependent on drugs that aren’t actually addictive because it makes them feel better) the daughter does need treatment and not a criminal record. A good number of teenagers who do drugs - especially in large amounts and that frequently as the daughter seems to be doing them, do them because they have underlying mental health issues and use the drugs as a way to “treat” it and keep doing it because it makes them feel good for a bit. It very often starts with weed and then people move on to other things when that stops working - not that whole “weed is a gateway” thing they used to push, but it’s not people using them recreationally, they’re using it how they should be using therapy and maybe real medication.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Not saying that OPs daughter is addicted or not, because we don't have enough info for that. But things that don't have inherently addictive properties can still be addictive. People get addicted to porn, to gambling, to tv, etc. Basically anything that makes you feel good you can get addicted to, and if you do it complusively or it starts effecting your life then you are addicted.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "She's been using drugs since 14 and is growing them at 16. This situation desperately needs more therapy.",
              "id": 166,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 64,
          "content": "What MEDICAL solution do you propose for “addiction” to mushrooms lmao",
          "id": 167,
          "comments": [
            {
              "score": 133,
              "content": "Family therapy. Divorce is considered an [Adverse Childhood Experience](https://www.childwelfare.gov/topics/preventing/preventionmonth/resources/ace/) that can increase likelihood of risky behaviors. Most teens who smoke pot use it to treat anxiety, and it's likely the same case with the shrooms. The dad needs to get her help for the underlying issues instead of punishing her for having issues he likely helped cause.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "The same medical intervention used for things like gambling, gaming, and porn addictions.\n\nThe ignorance on here is astounding. No, marijuana and mushrooms don't put crazy chemical hooks in you like opioids. That doesn't mean that addiction to these substances isn't real. People reacting the way you're reacting makes it so much harder for people with addictions to get help.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2151,
      "content": "So, #1, this was handled completely inappropriately. \n\nYTA, also.\n\n\\#2, I don't know whether to chalk this up to extreme/strict parenting, over-reaction, anger-induced reaction, or what really. \n\n\\#3, I understand what drugs can do to a family, and while yes I agree that you should of course be addressing this, there are other manners and directions to take versus jumping to arrest!\n\n\\#4, \n\n> I don‘t normally go through her room, but the router for the house is in there, and I needed to reset it. When I go into her room, I found a mushroom cap on black paper hidden underneath her desk. I look up what the hell it is and it is a spore print for magic mushrooms. I go through her room further to find an entire damn aquarium filled with mushrooms in the back of her closet. \n\nYou went into her room with the intention of snooping. The router \"being in there\" is a boldfaced lie. Admit that. So, that part is over-board to me. However, everyone parents differently. \n\n&#x200B;\n\nUltimately, this should have been handled differently, as a family, and not so extremely. And yes, you have marred her future due to this. I don't believe that this should have been a tactic used. Mushrooms, and other psycho-actives are massively different than harder drugs such as heroin, or cocaine. Oy, just oy.",
      "id": 170,
      "comments": [
        {
          "score": 561,
          "content": "But straight up, if your child may be using drugs why not look in their room? She managed to have a shroom farm and he didn’t notice. That’s just a lack of observation on OPs part. How the hell is you child GROWING drugs in your house without you noticing?",
          "id": 171,
          "comments": [
            {
              "score": 399,
              "content": "It seems pretty amazing to me that this dad would jump from not even looking in her room for drugs when he knows she uses them without permission...\n\nTo calling the cops. That seems like a pretty enormous chasm.",
              "id": 172,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "It’s actually really easy to hide you just need like a Tupperware container",
              "id": 173,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Rather easily. A good amount of psilocybin mushrooms can be grown in a box not much larger than a shoe box, and they thrive in the dark. A friend of mine grew batch after batch after batch under his bead and his parents were none the wiser. How often do you look under someone's bed unless provoked?",
              "id": 174,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 74,
          "content": "Best part is that he just happened to find her spore growth under her dresser as he made that amazingly long and difficult trek to hit the power button on the \"router\" that he had in her room.",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": ">You went into her room with the intention of snooping. The router \"being  in there\" is a boldfaced lie. Admit that. So, that part is over-board  to me. However, everyone parents differently.\n\nThank you for posting this. This was also my initial reaction and I thought I was being overly paranoid, which causes me stress. My parents would constantly snoop and make up lies about it, or do abusive shit and then try and cover it up with insane nonsensical narratives. They even went as far as trying to say my \"delusions\" about their behavior were a symptom of mental illness, and tried to medicate me so I would stop \"freaking out\" about their gaslighting. Eventually I got fed up and started recording them and got proof they were doing some fucked up shit. When I confronted them with evidence I was received with threats of violence and disownment if I didn't delete the recordings. To this day they deny everything and if I dare mention how I'm still emotionally fucked up and have trust issues as an adult, I get a nice dose of \"UGH TYPICAL YOU BLAMING US FOR ALL YOUR PROBLEMS\". These are the same people who threatened and cried like babies when I \"didn't call them enough and say I love you\" when I first left home.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "There's a reason shrooms don't show up on basic drug tests and it's because they're not hardcore enough for cops or parole officers to care. Used to work as a line cook and 90% of my coworkers were on probation for drug related charges. All of them used shrooms because their drug tests would come up clean unless they order a specific, expensive drug test specifically for shrooms. Which never happened to any of them. \n\nNot condoning drug use, just agreeing that shrooms aren't as bad as the alternative drugs available, and OP probably should have tried to handle it internally before calling the cops. YTA for damaging your vulnerable relationship with your daughter before trying to take care of her with therapy and medical doctors rather than involving the law right off the bat.",
          "id": 177,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Also he specifically said the mushroom cap was hidden under her desk. Is the router also under the desk and he saw the drugs while resetting the router? Or is the router somewhere else and he just happened to start searching underneath the desk while he was in her room....?",
          "id": 178,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1582,
      "content": "YTA for calling the cops on your kid . You’ve just broken any trust she had with you . Do your research, mushrooms can assist in mental health. \nBut - mushrooms? You got her a criminal record. In three years she could be a completely different person, but will have that around her neck and on every CV . \nHow about talking , listening and learning ?? \nYour ex is right .",
      "id": 179,
      "comments": [
        {
          "score": 262,
          "content": "I mean, I think it's kind of unreasonable to expect your parent to be cool with you growing a schedule I substance in your closet. Like, wink wink, we will just overlook this thing that could potentially cost me my house, if you get caught and the cops find out I knew you were growing here and didn't do anything about it.",
          "id": 180,
          "comments": [
            {
              "score": 749,
              "content": "It's almost like there's a middle ground between letting her grow them and calling the cops.",
              "id": 181,
              "comments": [
                {
                  "score": 125,
                  "content": "No this is reddit, either the cops get called or you failed as a parent and your kid becomes a drug dealer that ends up killing her entire school by selling bad drugs",
                  "id": 182,
                  "comments": [
                    {
                      "score": 5,
                      "content": "*points finger to head* \nCan't fail as a parent if you teach them how to make good drugs so no one dies",
                      "id": 183,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 153,
              "content": "It's almost like he could get rid of the aquarium and throw it away himself without calling the cops",
              "id": 184,
              "comments": [
                {
                  "score": 10,
                  "content": "Yea but then how are the police supposed to parent the daughter? It's almost like you expect this guy to parent his own child...",
                  "id": 185,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "I may have missed it, but I've been scrolling for this response. I cant be the only one who had a friend come to me in school with \"theres no way they didnt find my weed/mushies/booze, cause I got home and they were emptied/moved/gone; they totally know\"\nSo ty for saying this.",
                  "id": 186,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 71,
              "content": "That’s why you thrown it all away instead of jailing your child for manufacturing and trafficking schedule 1 drugs",
              "id": 187,
              "comments": [
                {
                  "score": 3,
                  "content": "This is so far down the comment chain I doubt it will be seen, but it's not illegal to grow psilocybin for \"research\" purposes, and spores are easily attainable online.  It is however very illegal to sell them.",
                  "id": 188,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": " No one here is saying he should have been “cool” but the cops were a stupid call",
              "id": 189,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "He didn't need to overlook them and shouldn't have done. But he definitely shouldn't have called the cops on his still very much a child daughter.",
              "id": 190,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "Mushrooms can assist mental health, but it’s hard to justify a 16 year old with a brain that isn’t fully developed using them.",
          "id": 191,
          "comments": [
            {
              "score": 4,
              "content": "It's harder to justify calling the police on a non-violent child because she wasn't following the rules. This looks more like an ego trip than an act of love.",
              "id": 192,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Mushrooms are not a recommended treatment for ANY teenage mental health issues.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1227,
      "content": "[deleted]",
      "id": 194,
      "comments": [
        {
          "score": 310,
          "content": "The part where he says she'll \"probably just get probation\" really set me off. He has no idea what he did. He acted impulsively and obviously hasn't even bothered to look up what she could be facing. YTA all the way.",
          "id": 195,
          "comments": [
            {
              "score": 126,
              "content": "[removed]",
              "id": 196,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "Well she certainly won’t get ANY financial aid. \n\nSchools and FAFSA don’t mess with drug charges. So I’m not sure what he expects to happen with her future now.",
              "id": 197,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "She could easily face years in prison even at 16",
              "id": 198,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Seriously I’m pissed reading this.\n\nYou suck OP.",
              "id": 199,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "He could Google what a spore print was but not the horror stories of people stuck in the criminal justice system, or the mandatory minimum punishment for intent to distribute a psychoactive substance... he was only thinking of himself.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Even if she ends up not going to jail, every interaction with law enforcement over this is going to be a reminder that her dad did this to her. She isn’t going to be regretting her actions, or wishing she hadn’t used drugs; she is going to be thinking her dad caused all of the problems",
              "id": 201,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "You know, people keep mentioning her having a criminal record and all that it comes with, but I think many miss an important point.\n\nIt's possible that she only gets probation, does some community service, and maybe it'll be sealed.\n\nBut try getting any governmental financial assistance for college with a drug charge on your record. It won't happen. Period. Unless her parents are fucking rich, she'll have to try and get private loans (not an easy option now *at all*). She won't get Pell grants or anything of the like.\n\nI'm actually upset for this girl. One of the people she should have been able to trust in this world just completely fucked up her life.",
          "id": 202,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 845,
      "content": "NTA. Id like to preface this by saying I dont think smoking pot makes you a drug addict but there have been studies that shown drug use negatively impacts development of teens and kids. This kid isnt just smoking pot once in a while, they're commiting a felony growing ~~a schedule 1 substance~~ shrooms in their house. That definitely crosses a line.\n\nAll that being said, there are so many people completely out of touch with how the world works. This isnt some over controlling parent trying to control their kid. This is a parent who's tried doing everything in their power to stop their kids escalating relationship with drugs.\n\nOPs already tried to deal with his daughter's drug problem by keeping it in-house and in the family. He event tried therapy which his daughter is actively rejecting. None of this worked and her behavior has escalated to growing a schedule 1 controlled substance in the house. So what we he supposed to do after catching her growing mushrooms, punish her again? That's shown to have no effect on her.\n\nOften the only time when people with drug problems stop abusing is when they get a wake up call. Clearly parental intervention wasn't enough. Shes also a minor so this is the best time for her to face legal consequences as theres a high chance it wont stick on her permanent record.\n\nI feel like a lot of people dont know that in most states, most first timer minor drug offenders get placed in court mandated rehab programs. A lot of people in the comments are acting like OP just sent her straight to prison without trying anything else when in the comments OP has said hes tried various therapy options as well as more standard punishments.\n\nEvery day I become more convinced that the majority of people in this sub are teenagers who have no idea how things work in the real world.\n\nEdit: because I'm getting tired about repeating this, this isnt about the drugs she was doing, it's about the relationship she has with them that's caused her to commit a felony to get them after pursuing drug use for 2 years despite the consequences. That's an unhealthy relationship at best and abuse at worst. Yes, pot and shrooms can still be abused even though they aren't addictive.",
      "id": 203,
      "comments": [
        {
          "score": 511,
          "content": "I'm honestly surprised to see so many votes for OP being the AH. It clearly says in the post they have tried to correct her at their level. The amount of disrespect for his daughter to grow mushrooms in her father's home is mind blowing. OP is sooo NTA.",
          "id": 204,
          "comments": [
            {
              "score": 356,
              "content": "I honestly think most people in this sub are kids or teenagers themselves. It explains the disconnect with how the world works and why theres so much sympathy for her doing drugs at her age.",
              "id": 205,
              "comments": [
                {
                  "score": 179,
                  "content": "Or people with parental issues who never got over them. I also think it is pretty funny how people say \"It's against the law, but the laws are stupid!\" or something to that effect, which further proves their immaturity. I bet 90% of the people voting have never had kids.",
                  "id": 206,
                  "comments": [
                    {
                      "score": 22,
                      "content": "I think it's more telling the ones who said he should just overlook the laws because she's his daughter. As if the cops are going to care about the parent bond/trust when they find out he knew she had industrial quantities of Shrooms in the house. \n\nI get that calling the cops was kind of extreme, and it could possibly ruin his relationship with her, but 2 years of drug abuse, that's clearly escalating? It's either the cops get called, or she gets involuntarily committed to a rehab facility. And rehab doesn't work unless the person thinks there's a problem.",
                      "id": 207,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 96,
                  "content": "Exactly fucking this.\nI wouldn't waste my time asking on here about a situation like this.\nAll the top comments read like the response of either teenagers or early twenties, or even around my age (late twenties) who never grew up.",
                  "id": 208,
                  "comments": [
                    {
                      "score": 16,
                      "content": "[deleted]",
                      "id": 209,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "So many comments assuming that if OP was a good parent then the kid would not have done drugs.",
                  "id": 210,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Can we get verified adult flairs? I couldn’t believe how far I had to scroll to see NTA.  \nLike she’s 16 and has graduated from pot to growing shrooms. I’m not saying I personally believe either are bad but that’s fucking *young* to be doing that. Most kids I knew had maybe tried shrooms they got out of a cow field like 1-2 times and I hung out with sketchy kids.  \nYou don’t grow shrooms for personal use you grow them to sell. She’s lucky she didn’t get a distribution charge.\nIt’s a cry for help but Jesus how far is he supposed to let this go? When she starts heroin? (Inb4 pot and shrooms are plants and natural- you and I dont know what she is or isn’t willing to experiment with.)\n\nOp please get her to a therapist. Your daughter is hurting and probably feels betrayed right now.  She needs someone she can trust who can talk to her about coping and making healthy decisions. On a legal note when she goes to court she needs to show remorse, and showing that she’s tackling the problem will help her immensely.",
                  "id": 211,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 166,
              "content": "Right? This kid is growing schedule 1 drugs in the house! She is likely dealing. This is getting worse, not better. She needed more intervention than they were able to give her. It may have been a bold move, but it makes sense!",
              "id": 212,
              "comments": [
                {
                  "score": 108,
                  "content": "That's my issue with the whole thing. A baggie of weed or a couple of shroom caps for personal use, ok whatever, but she's growing a large enough quantity to deal. That's a whole other kettle of fish they are dealing with. NTA.",
                  "id": 213,
                  "comments": [
                    {
                      "score": 64,
                      "content": "It’s like she’s committing a crime and everyone is upset for her having consequences...\n\nIt seems like dad was at his wits end. I never did drugs in high school so I can’t imagine how the daughter is feeling. I know that I never wanted to disappoint my parents but maybe that was just me",
                      "id": 214,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Exactly. This has escalated from a teen recreationally smoking pot, to either feeling the need to grow a massive amount of shroom or sell a massive amount of drugs. Neither is a healthy relationship with said drugs.",
                      "id": 215,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "\n>Right? This kid is growing schedule 1 drugs in the house! She is likely dealing.  \n\nOoooohkay, let's take a step back here. Yeah mushrooms are schedule 1 but that is **entirely** because of ignorance around drug laws. They're harmless, and often beneficial. They also fit none of the criteria of schedule 1 drugs, but you can thank republicans for that.\n\nSecond of all \"likely dealing\"? I doubt it. More than likely she wanted to try shrooms and nobody sold shrooms. The spores are legal and cheap on the internet, and once they're growing you pretty much just let them go. If she had a scale and baggies and all that it'd be a different story, but nothing about this says intent to distribute other than the volume.... And I mean there's no reason to just destroy them once you have X amount.",
                  "id": 216,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 77,
              "content": "Same! Not even an ESH is being thrown around. It's not like he found a little pot or a mushroom. She was growing drugs in his house.",
              "id": 217,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "But drugs are safe! DARE lied to me! Its just rebellion, you abusive tyrant!\n\nShe has a freaking aquarium filled with drugs. If she's not selling, I'll eat my hat.",
              "id": 218,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "There are a lot of drug users on Reddit...",
              "id": 219,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Redditors take the side of whoever smokes pot.",
              "id": 220,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 109,
          "content": "Can't believe I had to scroll down so far to find this NTA answer. Even as someone who is still the same age as the daughter I totally agree",
          "id": 221,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "I agree with this 100%. Now is the perfect time for her to have a wake up call, since she is still a minor and this won’t go on her permanent record.",
          "id": 222,
          "comments": [
            {
              "score": 14,
              "content": "She likely had more than 100 grams if it was a fish tank. That's a 5 year federal minimum sentence.",
              "id": 223,
              "comments": [
                {
                  "score": 7,
                  "content": "This needs more attention.",
                  "id": 224,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Depending on where she lives, she can be tried as an adult and this can permanently be on her record.",
              "id": 225,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "So much all of this.  I read the OP and thought \"well yeah, two years of both parents trying to correct her to no avail and now she's not only doing shrooms, but keeping an aquarium full of them?  That's insane, and has to be stopped.\n\nWould I have called the cops? No. But in my opinion /u/Redditthrowaway2947 is NTA for it.  My sister and brother both did a lot of pot in high school.  My brother's usage resulted in him dropping out of college. He later went back, got a nursing degree, but then started using K2, going into rehab, and losing his nursing license.  My sister never had issues in school (did a lot better than my brother or me), but then someone found out she smoked, and now she's on a three year diversion contract with the state to avoid losing her nursing license. \n\nBoth of them should have been put in their place much earlier in life, but they weren't because my parents didn't want to \"ruin their lives.\"  But, as it turns out, they managed to do so on their own because they never learned any true consequences for their actions.  \n\nWhatever someone personally thinks about any particular drug (pot for my sibling's sake, mushrooms for the OP), it doesn't change the law, nor does it change the absolute absurdity for a teenager to repeatedly ignore parental rules on those drugs even to the point of the OP's daughter.",
          "id": 226,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "This 100% . Anyone freaking out on him has never patented a kid on the path to self destruction. It’s no longer about “preserving trust” you are literally sometimes just trying to stop them from killing them selves. He was put in a position where there was not many choices .. what is he going to do? Sit down and tell her not to do it anymore? - she isn’t going to listen \nScream and yell? She won’t care\nGround her? She still goes to school.",
          "id": 227,
          "comments": [
            {
              "score": 10,
              "content": "Some kids are just assholes that cannot be reasoned with and it's not always the parents fault. People need to realize that.",
              "id": 228,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "My god common sense does exist on this sub",
          "id": 229,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Finally, a good take. The kid needs to learn that there are consequences for her actions. Y’all acting like committing a felony is okay and that he should just be chill about it because she’s his daughter.",
          "id": 230,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Finally, someone with sense.",
          "id": 231,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "My thoughts exactly.\n\nNever mind the fact that IF she did get caught with them, it's his house. Surely he'd end up catching some charges if that were to happen.\n\nSure, the NAP isn't being violated, but save the \"it's a victimless crime\" argument until not only she's a legal adult, but when she lives on her own.",
          "id": 232,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Seriously? I've been in rehab for 2 months for Pot abuse. My parents did the same as OP and called the cops on me but luckily I Ubered to the first rehab I found on Google before they could arrest me.\n\n What I've learnt is that addiction in general is not spontaneous, and repeated addiction - an addictive personality - is a strong sign of addict trying to fill an emotional hole left behind by his/her parents. My mother divorced twice and her second husband was physically and emotionally abusive and was also showed favouritism to all my siblings. My mom divorced him and her new \"boyfriend\" physically abused her, sometimes in front of me. \n\nI would imagine that OP did not bother to add any information that wouldve definitely antagonized himself, like the way he was raising his daughter or the mental effects the divorce had on her. Perhaps the reason for the divorce would also shed a bit of light on the possible triggers for such an addictive personality.\n\nSelf-righteous parents such as yourselves who respond with NTA cannot take responsibility for the way their kids turn out. Only if your kid is getting good grades and has good ambitions or lifestyle then that's because you raised correctly, but if they are addicts and are bad apples then it's not your fault. At the very least everyone should be responding with INFO to try and understand the underlying issue involved. \n\nFor a child at SIXTEEN to be so heavily involved with drugs is a strong indicator that there is an underlying emotional wound. You think you know how the real world works? You have never suffered with true addiction.",
          "id": 233,
          "comments": [
            {
              "score": 3,
              "content": "Well said. I wish you luck, brother",
              "id": 234,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 763,
      "content": "YTA- there is strong evidence that punishment doesn't help when combatting addiction and drug use in general. What helps is support and rehabilitation/therapy. Try talking to your daughter if she'll even talk to you after that, and I'd recommend family therapy.\n\nEDIT: Since so many people have been commenting that shrooms aren't addictive, I've added that support, love, and rehabilitation/therapy are the best way to help people that use drugs to use them in a healthy manner or to stop using them. The most important thing is that OPs daughter needs to feel supported and given OPs actions she probably doesn't right now.",
      "id": 235,
      "comments": [
        {
          "score": 514,
          "content": "Addiction is not at play in this situation.",
          "id": 236,
          "comments": [
            {
              "score": 432,
              "content": "This thread made me realize how fucking badly educated people are about drugs, psychedelics especially.",
              "id": 237,
              "comments": [
                {
                  "score": 257,
                  "content": "It’s fucking shocking lmao. Like everyone agrees OP is the asshole, which is good I guess? But the amount of misinformation in this thread is incredible. Reagan is hoopin and hollerin in his grave right now, he fucking killed it.",
                  "id": 238,
                  "comments": [
                    {
                      "score": 80,
                      "content": "I wish there was just factual drug education. Fear mongering doesn’t work! We need to be honest with young people.",
                      "id": 239,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "From the point of view of a heavy addict, here, Reddit discussion of addiction is very amusing. It's either ridiculously overestimated or outright ignored. But the study of addiction is also severely underfunded so there's all kinds of wrong info floating out. Like, dude, I've seen many doctors and medical professionals that don't know shit about shit. The only thing they know is what to give me so I don't have a seizure.",
                  "id": 240,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Even if there's not physiological addiction, there can still be psychological addiction.\n\nAnd drug-seeking behavior is evidence of addiction.",
              "id": 241,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I'm not sure about the accuracy of this, but isn't there two form of addictions? There's chemical addiction and psychological addiction (this is is sort of what happens to obese people who can't stop eating unhealthy foods and things like that). I just think you're talking about one type of addiction while everyone else is talking about a different one, more like a mental crutch than a chemical craving. \n\nI learned this in form 4 biology so it might not be all that correct, let me know if I'm off the mark.",
              "id": 242,
              "comments": [
                {
                  "score": 3,
                  "content": "I'm pretty sure that's outdated information. The only qualifier of a chemical addiction is that of the ingestion of foreign substances that alter your brain chemistry. But so-called \"mental addictions\" do exactly the same thing and absolutely can and do manifest physical symptoms of withdrawal.",
                  "id": 243,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "well, i dont think they are addictive in itself.  but there is the addiction of relying on it as a means of coping.\n\nthought this could be in many forms...food, shopping, coffee, etc.  \n\ntho i guess lot of ppl think its addictive like cigs still",
              "id": 244,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    }
  ]
}