{
  "post content": "Last weekend, one of my friends organized a group of people to go do fall things. We rented a van and went to a few breweries/wineries. \n\nWhen we got back, we stopped at a pub to hang a bit before going home. There were about 12 of us so they seated us at a table. People ordered food and drinks. When the check came, one of the guys quickly gave his card and after signing, looked around and said okay everyone venmo me $45.\n\nThis threw me off because many people had ordered meals, sides, drinks and shots. I had ordered a diet coke (I had to drive 1.5 hours home) and shared an appetizer with my husband. I asked if we could each venmo him for what we ordered and he seemed annoyed. He sent everyone a pic of the receipt and had everyone venmo him for what they got.\n\nFor context, I'm fine splitting the bill evenly when everyone orders roughly the same thing. But also if I ever put my card down, I always ASK everyone if they want to split it evenly or not, not just assume.\n\nMy husband thinks I'm being cheap and should've just split the bill evenly with everyone. I know I'm more money conscious than others so I'm wondering am I the a-hole?\n\nETA: we were expected to pay $90 (including tax and tip) for me and my husband, since my husband did have a drink and a shot in addition to what I had, our actual total we ended up paying came out to $53 (including tax and tip)",
  "id": 1,
  "comments": [
    {
      "score": 10564,
      "content": "NTA \n\nWhy should you pay for other peoples food.  Just pay for what you had Coke and apetizer shared with your husband. What 20 max.\n\nWas hour husband expected to pay as well?",
      "id": 2,
      "comments": [
        {
          "score": 4934,
          "content": "Yes he was, so it would've been $90 from both of us. My husband did have drinks/shots so our actual total for the two of us came to $53",
          "id": 3,
          "comments": [
            {
              "score": 2776,
              "content": "Oh hell no, i would have done the same thing! That’s ridiculous!!!",
              "id": 4,
              "comments": [
                {
                  "score": 573,
                  "content": "Typically, what happens is 1. you’re with good friends so spending extra money on your friends is not a big deal (I’m happy to spend money on my friends because I love them), 2. sometimes you’re the person who orders more and sometimes you order less so these things even out over time, and 3. splitting the check depends on who you’re with. If someone wants to only pay for what they ordered, that’s fine.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 383,
                      "content": "Even with 1, if the difference is big enough, a good friend would chip in extra. Being considerate goes both ways. And with 2...it really depends. I have certain friends who just eat more and drink more than others, others who prefer a steak/wine dinner, etc pretty much all of the time...it wouldn't average out.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 115,
                      "content": "I usually don't mind as well, for the reasons you mentioned.\n\nWhen somebody orders significantly less than everyone else, though, it's often because they're *trying* not to spend much money. So yeah, their low total may bring the group's overall average down, but the amount that everyone would pay splitting evenly may still be more than they can afford. Super uncomfortable.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 80,
                      "content": "I generally don’t mind covering a little extra for good friends because it does balance out. But I still wouldn’t cover 45 dollars on a bill where I only had a soda and half an appetizer. And I wouldn’t expect a friend to pay that much either.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 49,
                      "content": "True but that only works in a situation where going out with that particular group is a common occurrence.  Going out, for me, isn’t a luxury I can afford but sometimes people will insist on you coming along (this has happened with family members several times).  In those situations I am careful what I order.  I make sure I order what I can afford plus tip.  If someone said to me, “your portion is $90,” but my husband and I budgeted for $30 it would be an issue for me.  It really boils down to your financial situation.  I too would spend money on people if I could do so.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "But often there are people who always spend more and people who always spend less. Non-drinkers and vegetarians are in the situation every single time they go out. They are always put in the position of either paying more than their fair share or having to awkwardly object. Friends who do this to them are shitty.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "3 matters a lot. We would have big group dinners and people would want to split the checks.. ok.. several of you are doctors or famous authors who order away without a care in the world, while we are not that and ordered the cheapest thing and 1 drink.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I love my friends but I am still on a budget and I make my choices accordingly.  I don't have spare cash to subsidize my friends' meals. I also have a bunch of allergies and don't drink so my total is typically less and wouldn't average out.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "1. Sure, but shouldn't they also feel the same?? Thus the people spending more should be owning up and chipping their part at least close to fair.\n\n2. I'm NEVER the person who orders more. For one I don't drink...\n\n3. I mean that goes without saying.\n\n--------\n\nIf I'm splitting evenly its a charity, plain and simple. It's not fair, it's charity. The same way as just straight up paying for an event etc is. Something else good friends often do (at least where I'm from).",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "To me it’s more about financial imbalance really. Like if everyone in the friend group is stable with good jobs then splitting everything evenly is fine and should even out and you come across cheap wanting to count up everything on the receipt. But the friend group should be sensitive if they know money is tighter for OP, and OP is definitely an asshole if everyone knows they earn a lot more than them.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "The problem with number two is that some people consistently order less, and some people consistently order more. What adds significantly to the bill is alcoholic drinks, desserts, and appetizers. So a person who doesn't drink, or who is dieting, tends to always order less. Also, some people are much more frugal. I once traveled with a friend who was very frugal. I couldn't understand why. Well, she had saved enough that she was able to put down a good down payment on a house in her mid twenties.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 802,
              "content": "I had a co-worker who did this type of thing. When I went out with our group, I made sure to have cash with me to cover my amount. I’m not paying for someone’s entree and wine when all I had was a beer and split an appetizer with someone. It got so bad that I wouldn’t go out with the group anymore if he was going.",
              "id": 16,
              "comments": [
                {
                  "score": 595,
                  "content": "Me too! My friend would order multiple bottles of wine, appetizers, entrées, and then expect everybody to split the bill. We caught on quickly, and would grab the waiter and tell him we were paying for our own meals. She got really upset, but there was no way I was subsidizing her dining.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 190,
                      "content": "When she got upset, how did she possibly justify it?",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 78,
                      "content": "The only time you should order a bunch of shit for the table that no one asked for is if you're in a place financially where you plan on covering it all for the table on your tab.\n\nThere is nothing worse than someone ordering a bunch of shit you don't want and then insisting you try some... then asking for an equal split on the bill.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 52,
                      "content": "\"but I got those for \"the table\" is it my fault I didn't let anyone else have any?\" /s",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "I think we all have THAT friend who order the most expensive starter & main, a glass or two of wine and then wants to split the bill when all you had was a salad and fizzy water.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Should have outdone her by ordering even *more* extravagantly than she did, then still expect her to split the tab evenly.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 156,
                  "content": "Same!  I worked at this company where the department went out for lunch almost monthly for birthday celebrations.  When the check would arrive, they'd want to split evenly and pay for the birthday person's meal.  A co-worker and I (who were both on tight budgets) would order maybe $20 (including tip) and we'd get stuck having to \"split\" the bill at double (if not more) than what we ordered.  I didn't mind paying for the birthday recipients meal but I did have a problem paying toward everyone else.  Her and I eventually stopped attending the lunches.  When asked why we wouldn't attend, I told them flat out that I couldn't afford to supplement everyone else's huge meals and drinks.  I ordered a sandwich and soda, while Steve ordered a steak and 2 beers.  I'm not paying for it anymore.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 27,
                      "content": "So what I did when I know that it is a split check no matter what because it’s someone’s birthday, and we’re sharing the birthday person’s cost, and this is something that keeps happening, I’d start ordering more and making sure I’m ordering the same amount as everyone else. Granted I was on a budget too bad then but at least if I was forced to pay $50 for a $20 meal, I’d be getting my money’s worth.\n\nETA: I only did this if I absolutely had to go out with those ppl on multiple occasions aka for work socializing and splitting checks didn’t work neither did bringing cash and just paying for my portion and the birthday persons portion and tip and tax.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Most companies I’ve worked at the manager or most senior person picks up the check for the person being honored.",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 80,
                  "content": "I went out twice with a group who was like this (a bunch of co-workers). They were drinkers and I am not. They legitimately expected me to cover a share of *their* drinks and not just my own meal.\n\nNope. I paid the first time because it was like an extra $10. The second time we were out for a while and my share would have been $25. I nicely, but firmly, said I was not paying for alcohol I did not drink. I left cash to cover my entree and tip and let them sort the rest out. They were salty about it, but dealt.\n\nI was shocked when they invited me out again, but I declined that and future invites. It just wasn't worth the hassle for people that were just acquaintances at the end of the day.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 52,
                      "content": "The way I handle this whenever I go out with coworkers is when I place my order I always tack on \"I'm not sure what the rest of the table is doing but I'd like my order on a separate check please.\"",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "I had a coworker like that, too, and it actively impacted how people planned for holiday meals, birthdays, retirement meals, or even just lunches at out of town conferences (for day trips, overnights would at least be individually comped & we weren't expected to eat most meals together). Had to call ahead at restaurants & ensure that they could bill on separate checks for 20+ people, or that they were places where you pay at the counter when you order. Similarly, had to have a cash contribution option for potlucks or prepaid in-office pizza parties.\n\nA lot of overhead labor and mental efforts put in because this guy would mooch for $30-50 meals on the table's dime or be a sad-sack about how \"broke\" he was.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I feel like at that point you just...stop inviting him. What's he gonna do- complain to HR that you're excluding him from events happening off the clock and off work property because he's a cheapskate? I'm sure \"we're not inviting him because he consistently orders food he can not pay for and expects us to pay. None of us can afford to subsidize his $60+ meals.\" would solve the issue. They can't force you to feed him out of your own pocket",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Kind of reminds me of https://www.youtube.com/shorts/Oa8s07agHeY",
                  "id": 30,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I assumed this was going to be credit card roulette, which does not seem to be on youtube",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I always order separately. If I go out for like a birthday event for a colleague, I go to the bar and order separately. I then pass a $20 to whoever organised the event to buy the birthday person a drink or cover their dinner or whatever.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 119,
              "content": "Is your husband kind of a “don’t rock the boat”/people-pleaser type?",
              "id": 33,
              "comments": [
                {
                  "score": 85,
                  "content": "Yes definitely lol",
                  "id": 34,
                  "comments": [
                    {
                      "score": 66,
                      "content": "Welp, then he should find a therapist he likes and start working on why he has a hard time with setting boundaries. I don’t say that critically; really everyone should. Even though you seem to have a head start lol, I’d encourage you to do the same. Grow together (separately).\n\nAbsolutely NTA. I think your hubby means well, he just needs to take a hard look at his own Shadow; essentially the things we had to push away about ourselves to survive our childhood.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 69,
              "content": "Since you have the receit, here is a fun thought exercise. Multiply 45 by the number of people and see where you land.",
              "id": 36,
              "comments": [
                {
                  "score": 99,
                  "content": "It did come out to the total amount! So luckily he wasn't trying to make money off of it",
                  "id": 37,
                  "comments": [
                    {
                      "score": 45,
                      "content": "Well that depends - how much was his share?",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 33,
                      "content": "Was his like $120 tho? ;)",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Actually glad to hear that. Apologies for the insinuation. The whole pay fast and then decide to split just seemed weird to me.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Not making money directly but he probably did it to get credit card rewards/points. When we go on big group family 9r friends vacations im always happy to put everything on my credit cards and have folks pay me their share later.  I dont complain or say anything if people want to pay separate though",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "He was trying to save money tho.",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "Wtf is a receit?",
                  "id": 43,
                  "comments": [
                    {
                      "score": 2,
                      "content": "A typo.",
                      "id": 44,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 36,
              "content": "By any chance did the guy who threw down his credit card have a more expensive tab than the others?",
              "id": 45,
              "comments": [
                {
                  "score": 55,
                  "content": "He wanted the points is what I'm guessing on top of having people subsidize his tab. There are variations of this game. My sil ordered 2 dinners once. One to take home for the following day. Lobster. Uh sorry but no. People who don't drink or don't drink a lot find themselves in this predicament also. I don't want to be viewed as a cheapskate so I don't do group dinners anymore.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 50,
                      "content": "I don’t get this. I don’t get being called cheap because you only want to pay for what you ordered. Being cheap is not wanting to pay your fair share, or not wanting to pay at all. The people ordering a ton of stuff then expecting everyone else to subsidize their order and split everything evenly are the cheap ones.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "The fucking points thing kills me. I pay cash so I can leave and not wait around. People get all offended when I drop cash and bounce. It's not my fucking problem you need to wait for your card",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 30,
              "content": "You just subsidized this jackass’s meal and drinks while also getting him points and rewards on his credit card. \n\nThat’s why he was so eager to volunteer and then expect everyone to just Venmo anyway. Like why? Him paying didn’t make it easier if everyone has to jump through hoops of shitty online services anyway.",
              "id": 49,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "Never split the check with a group. Save yourself the hassle. It's a mess calculating the cost, tax and tip. The few times I've split with a group, it's always felt unfair. \n\nWhen the waitress comes to you, make it clear that you are on a separate tab. Unless it's one of those places that won't allow it.",
              "id": 50,
              "comments": [
                {
                  "score": 4,
                  "content": "If I may challenge this a bit:\n\nI don't see this as the responsibility of the customer to remember this to make the server's vending easier. I see it as the responsibility of the server, if they need to know who is on what tab, to ask the question before charging. For all I know, this particular server doesn't need this information until paying the check. If they don't ask, I don't assume they need the information. \n\nI've experienced this countless times: server asks before collecting orders who's together and who's separate.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Please tell your server up front. It makes their lives easier depending on their system, and models the behavior for your fellow diners who might also choose that option once they’re reminded it exists.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Telling them up front is important so they can ring it on separate tickets. If you wait til the end, they have to split the ticket. This might not be the case at every single restaurant, but it has been in my experience.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I've been in restaurants where they won't split the check for large parties.",
                      "id": 54,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Then thats all you pay,",
              "id": 55,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "\"Honey, we should've just paid double our tab, nbd\"\n\nUh, no, I'm not doing that, and it's not just me being cheap. Holy crap.",
              "id": 56,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "That's too much of a difference. Up to 5 per person, I would say you would be a bit annoying, not necessarily TA, but a bit of a bean counter, but this is a big difference and you are totally in the right about being annoying here.\n\nNTA",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 75,
          "content": "And drinks! As someone who doesn’t drink not by choice, I’d be super pissed if I had to pay for peoples drinks when I couldn’t have any. NTA.",
          "id": 58,
          "comments": [
            {
              "score": 28,
              "content": "Completely agree with this. I don’t drink and I always get screwed when splitting the check. I’ll get a $3 soda and everyone else will get $20 in alcohol and I’ll be forced into splitting. Eventually I started putting my foot down or preemptively asking the server for separate checks or just bringing lots of change so I could pay my share plus tax and tip and not have it be a thing.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "The guy who said \"Just venmo me\" is also a dick.\n\nI have some friends like this. We went out to a fancy BBQ joint that opened a few years ago. Sat at the table and they said no split checks.\n\nMy wife and I don't do appetizers and split our entree. Prob $40 for our food and drinks. They tried splitting it down the middle with some fuckers ordering like 4 appetizers. We didn't eat em because we didn't want em.\n\nFuck those people.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I ordered a Tyranna-Caesar salad and that's what I'm paying for.\n\n   - Ann Perkins",
          "id": 61,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "NTA but I get the guys annoyance. Now he has to track everyone down to make sure he’s not getting screwed over. \n\nNext time just suggest everyone pay for themselves if you can.",
          "id": 62,
          "comments": [
            {
              "score": 7,
              "content": "Plug for Splitwise -- it's an app that lets you split bills and expenses with a group. It's fantastic for group dinners and trips.",
              "id": 63,
              "comments": [
                {
                  "score": 3,
                  "content": "Their dining app is called “plates”. It allocates each dish based on who split it and allocates tax and tip.",
                  "id": 64,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Yeah I had weight loss surgery a couple of years back, so when I go out with friends I’m either sharing a bit of their food, or ordering an app and a water. No one expects me to pay a full share when we do that. I DO pay for half if I’m eating off other people’s entrees (these are good friends who offer that), or else I just pay for my food alone.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This is obviously the idea of the person/people that ordered full meals/drinks",
          "id": 66,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2062,
      "content": "NTA\n\nThis is not a \"you're cheap\" but a \"he's greedy.\" I bet he ate more than 45 dollars worth of food.\n\nAs a general rule, anyone who offers to pay for the entire table without being asked and without there being a need is either 1)covering everyone and being super generous or 2) pulling some kind of bullshit like this. The only benefit to paying with one tab when everyone was prepared to pay separately and then doing Venmo after is to farm credit card benefit points and/or try to get your bill free/steal a small amount from everyone at the table.",
      "id": 67,
      "comments": [
        {
          "score": 436,
          "content": "I'd add a third of wanting the credit card points. I'll gladly pay and have everyone venmo me their fair share (not a BS split like this) just to collect the free $5.",
          "id": 68,
          "comments": [
            {
              "score": 215,
              "content": "the person you are replying to literally said the exact thing you said.",
              "id": 69,
              "comments": [
                {
                  "score": 73,
                  "content": "The person you are replying to literally said the exact thing you said.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 33,
                      "content": "The person you are replying to literally said the exact thing you said.",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "yes but they also edited their comment",
                  "id": 72,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 55,
              "content": "Yeah in my friend group we decide who puts stuff on their card partly based off of who will get the most points.  We always text the receipt to the group though, and everyone is responsible for covering their own food/drink.  \n\nSplitting the bill evenly made sense sometimes when we were trying to pay cash, but with credir cards/ venmo it's super easy to just pay your share.",
              "id": 73,
              "comments": [
                {
                  "score": 26,
                  "content": "Splitting the bill evenly is only appropriate when you are eating family style, and everyone is drinking tea or soft drinks.",
                  "id": 74,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "This sounds exhausting.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Sorry.  I don’t do Venmo or CashApp.  I didn’t ask you to pay for our meals.  Do you accept credit cards?",
              "id": 76,
              "comments": [
                {
                  "score": 25,
                  "content": "I accept Venmo, cash or check. \n\nMost of the time, for large parties restaurants prefer one tab. They may even require it. Servers have other tables to attend and can’t spend 10+ minutes itemizing the bill, figuring out who ordered what, splitting apps.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Unfortunately, I only travel with a credit card.  Thanks for the meal.\n\nThat is exactly why you tell the server at the beginning that your check will be separate.  Then they don’t need to worry about splitting it out separately later.  It is already separate.\n\nWhen I go out to eat with my parents, siblings and their spouses, my nieces and nephews, I’ll pick up the tab, but it is because I am paying for everything.  I do it to because I want to when I’m visiting home.  A thank you is all I get back from them, which is plenty.",
                      "id": 78,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "Damn I didn’t even think of that \n\n12 people @ $45 each is a $540 bill\n\nMy AMEX gives me 4% cash back on grocery+gas, 2% on everything else\n\nSo I’d have made ~$11 running that tab through my card and having everyone transfer me \n\nDoesn’t seem like much but that’s 1/4 of your share",
              "id": 79,
              "comments": [
                {
                  "score": 12,
                  "content": "Bigger risk of someone short changing you on a bill of that size than you profiting IMO",
                  "id": 80,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Exactly. And all these “just pay what you owe” poors on this will most likely forget about tax and tip. Reddit is full of cheapskates",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I'd add a fourth reason which is trying to get some free credit card points.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": ">The only benefit to paying with one tab … is to **farm credit card benefit points**…\n\nThey really spelled it out and you still missed it",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "Exactly! Snatching the check is only acceptable if you are paying the whole thing. Otherwise you check in with everyone else about how you want to settle the bill.\n\nSometimes we do an even split, but only if everyone pretty much got the same thing. If one guy does 5 shots and another just got a coke? No way.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "With a larger party they (the restaurant) might not be willing to split the bills in which case it makes sense for one person to pay while the rest of the party Venmo’s or whatever. However, splitting the tab evenly versus each paying their own should be a group decision",
          "id": 85,
          "comments": [
            {
              "score": 11,
              "content": "It's 2023, I've yet to be to a restaurant with a difficulty in managing table tabs in over a decade.",
              "id": 86,
              "comments": [
                {
                  "score": 11,
                  "content": "Maybe it’s regional? It’s super common where I live (upper Midwest)  that parties over 8 or so they won’t split the bill.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I'm in FL, here it's super common and one of the first questions you get as a table is bill spread.",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "It’s common in the northeast as well (though I will say having the terminal come around is becoming more popular) but any place divey or old will not split over 6 usually",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Then you probably never go out with more than one other person.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 7,
                      "content": "No seriously where are you guys all eating that the waiter doesn't just ask how the bill is split when you start ordering? It takes 10 seconds to pass the card reader around the table and have everyone pay for their meal.\n\n\nI'm 40 and literally never been in this situation where everyone averages out the bill like this, but it seems to come up all the time on reddit.",
                      "id": 91,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": ">a group decision\n\nAnd how might you propose a group reach that decision? If its by majority then OP shouldve  agreed. If you need unanimous decision then they could be sitting there for a long time.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "And drank. NTA",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Offer to pay on credit card....get cash from everyone else.... leave crappy tip... profit!",
          "id": 94,
          "comments": [
            {
              "score": 11,
              "content": "I'm in pizza delivery, and have noted on many occasions the person who 'volunteers' to go to the door for a group will pocket the tip.  When the order is $51, and you walk up to me with $59 in you hand, you ask the price and then pull $8 out of the stack and put it in your pocket we know what's going on.",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "My brother used to do this and he would write it off as a business expense. But yeah, it was to get the airline miles lol.",
          "id": 96,
          "comments": [
            {
              "score": 8,
              "content": "I don't even mind the farming for points/miles, but yeah I'd big time have a problem paying 45 if my bill is actually 15.  And I'd have the problem with the assumption.",
              "id": 97,
              "comments": [
                {
                  "score": 4,
                  "content": "Yeah, I absolutely refuse to split a check like that.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "No, it's 'he's lazy.'  OP says in other comments that the bill really did come out to 45/person.  He just didn't want to have to manage a bunch of individual amounts.\n\nStill not right, but assuming maliciousness in all things isn't fair.",
          "id": 99,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Always hate this, I tip well, and it's often used to make their bill smaller.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "He could also be using a business credit card and will write it off.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Exactly this. In group meals/outings/etc. I’ll always offer to put down my card if people want to Venmo me (because I like the points). If they want to divide it up another way, or someone else wants to pay that’s okay too though.\n\nIn a big group setting. I’ll gladly pay an extra bit of money to not have to do the math, but I’d limit it to like $10 more than what I consumed. If everyone’s having steak and lobster and I got a hamburger, don’t even ask to split it evenly.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 773,
      "content": "[deleted]",
      "id": 103,
      "comments": [
        {
          "score": 234,
          "content": "Wow I'm sorry, that sucks. That's a good tip, I'm definitely gonna do that now moving forward!",
          "id": 104,
          "comments": [
            {
              "score": 144,
              "content": "[deleted]",
              "id": 105,
              "comments": [
                {
                  "score": 42,
                  "content": "Pretend there's an article called 'Earning and Saving Clean Money: How to Avoid Feeling Financially Guilty or Cheated'.  And that you can no longer find the article🤔\n\nThere's a section on dining out. Because it adds up, you want to pay attention to this disposable income.\n\n1. ALWAYS have the cash on hand.  Even the strongest banks can have an emergency where funds are temporarily unavailable. \n\n2.  For the same reasons number 1, Apps like Venmo , Cash App, Zelle...to 'repay' are a BIG NO.  You never know someone's financial situation. And it's irresponsible to find that you must pay someone back later than you intended or to forget and have to be reminded.  \n\n3. NEVER split a bill.  Statistics show that, since it is nearly impossible to pay the correct amount, you will always pay too much or not enough. And it adds up. Not so much the dollars, but the sense. Because either way, subconsciously, it leaves a negative feeling.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 15,
                      "content": "It's interesting advice, but reads as extreme and pretty absolute.\n\n\"NEVER split a bill\" is definitely overboard.",
                      "id": 107,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I work with too honest people - they’ll routinely tell me to kick them a five for a coffee that I know is closer to seven. So I send them eight bucks to even out the score since they end up doing it for everyone like that.",
                  "id": 108,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 62,
              "content": "I worked in the industry for two decades and I LOVED splitting up bills for people, seriously! Splitting bills always meant I got a bigger tip in total because most people will tip a higher percent if it's a small amount. Also, it's super easy to split tabs with most systems, so, it's not usually putting anyone out. So, the only people who get annoyed are the people who wanted to pay less instead of their fair share.",
              "id": 109,
              "comments": [
                {
                  "score": 16,
                  "content": "As a server the pain from splitting checks isn't from actually splitting them, it's from running 12 credit cards. But that's just part of the job and I am always happy to split checks for people because that's what's fair lol",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "I went to a very popular (but seriously ran down) restaurant with co-workers and some of their family members.  When it came time to pay, the waiter/manager, said we don't do checks, pay what you think you owe.  I knew my co-workers were cheap on tipping, and he was probably relying on people to overpay to be safe.  I'd love to know how that worked out for him.  I was near the end of the end of the line so when I handed over my cash I made it a point to break down my tab meal, drink, tax, & tip.  He wasn't happy, I didn't care.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Wow.  That sounds like an HR nightmare",
          "id": 112,
          "comments": [
            {
              "score": 19,
              "content": "[deleted]",
              "id": 113,
              "comments": [
                {
                  "score": 6,
                  "content": "Never ever will I work again in a small company. Had enough issues for a lifetime.",
                  "id": 114,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yep. People wax poetic all the time about how great 'small businesses' are ... but they can often be some of the very worst places to work for, and they're often some of the very worst when it comes to abusing their employees.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 22,
          "content": "Oh man I usually pay for the points but I'm upfront about it and always send a picture of the receipt to everyone involved.\n\nI actually got my friend to get themselves a card recently to help build up their credit so now we switch who gets to pay.\n\nI would be so angry if a coworker or boss did that to me.",
          "id": 116,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": ">  say they left a really good tip\n\nThis is one thing that really gets me. Tipping should be everyone's choice. Why should I pay more because you tipped generously?",
          "id": 117,
          "comments": [
            {
              "score": 2,
              "content": ">I do delivery services locally, and I do a $1 tip online and then give cash for rest.  \n>  \n>I understand that may mean that drivers are reluctant to take my order but I do think it's better that way then putting high tip then lowering it(I Understand this is a thing).  \nI prefer to give cash--their accounting habits are up to them, not me.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Ugh yes, my bf and I would dine regularly (at first) with some other friends, and one got a really wealthy boyfriend… like generationally wealthy for another country. \n\nThe first time we all went out to eat, he ordered a bunch of apps for the table… I typically don’t order stuff to share/start very often so I thought he was treating on this part at least, and ate some. \n\nWhen the bill came, he was like “welll since everyone ate appetizer x, y, and z, everyone pay (even split of the whole bill).”\n\nIt wasn’t a super expensive place and I was still in my mid 20s so I though that was fair or my bad…\n\nafter like two more of these instances, we started making sure not to taste any of the shared stuff “for the table,” sitting at the end, and asking the server quietly at the start for our own bill. \n\nAt WORK this would drive me nuts.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 276,
      "content": "NTA. Splitting a check should be decided ahead of time, it's not that hard to do your math especially if there are big swings between bills",
      "id": 120,
      "comments": [
        {
          "score": 47,
          "content": "Yea I don't understand people like this at all. In my friend groups we always just paid for whatever we ordered. Unless it was a special occasion and we were specifically taking someone out, then that person didn't pay for shit and everyone else covered them. But, like you said, that was something we all planned and agreed to and would make sure we kept things within everyone's budget. And on those special occasion outings, whoever was being treated didn't go overboard and order the most expensive shit on the menu to take advantage of the rest of the group.",
          "id": 121,
          "comments": [
            {
              "score": 2,
              "content": "Just depends on your group. I can't remember the last time I went to dinner and we didn't just split it evenly.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -4,
              "content": "\\>In my friend groups we always just paid for whatever we ordered.\n\nIn large groups, this becomes unwieldy because there invariably are people who underestimate their portion of the bill. They don't count their share of the apps, forget drinks (especially their share of a bottle of wine), think 8.99 is 8.00, or just can't fucking add. \n\nI went on a vacation with like 8 engineers and we'd still be short like 20% of the bill each time. \n\nFuck trying to forensically account for a meal at the end. Split it evenly. If you have a scenario like OP where they truly just got a diet coke and ate three wings, I'd exempt them all together. And just divide the bill by two fewer people. Or let them pay towards the tip or something.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Imo there is nothing to decide you pay your share. Even split literally never makes sense to me.",
          "id": 124,
          "comments": [
            {
              "score": 7,
              "content": "The one exception is if you all had the exact same thing/same price thing.",
              "id": 125,
              "comments": [
                {
                  "score": 9,
                  "content": "Yeah but then the options are the same, If everyone’s share is $25 you are still only paying your share, it just happens to be the same amount if split evenly.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "> Even split literally never makes sense to me.\n\nIf you've all had roughly the same amount, and you're good friends, and you're all in roughly the same the same financial position, it makes a ton of sense, especially if you've shared some stuff. It's so much easier. If you're at a place where they can't split it for you, it can be annoying to go through the bill, work out who had what, start adding stuff out, and work out tax and tip (if you're in the US/Canada). And there's a sense that it will (roughly) even out in the long term - some times you pay a little more than you owe, and sometimes you pay a little less.\n\nBut it should always be consensual and unanimous. Peer pressure to split evenly is really shitty",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Worst case scenario she and that guy are the only ones who cared.\n\nBest case, and the most likely -- at least one other person thought, \"Thank you for saying something.\"🤔",
          "id": 128,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 227,
      "content": "NTA can't fucking stand people who do this. The guy orders half his body weight in food and alcohol and then gets to look all magnanimous by putting the bill on his CreditOne card even though he's basically using his friends as coupons.",
      "id": 129,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 145,
      "content": "NTA you aren't cheap, you aren't willing to pay more for others who might take advantage of splitting evenly. \n\nFunny thing I saw several times: those who want to split evenly are usually those who get the most drinks and/or r most expensive food. That way they can save some bucks and others don't want to speak up because they will be called \"cheap\" from exactly those persons.",
      "id": 130,
      "comments": [
        {
          "score": 75,
          "content": "So so true!! Many moons ago, I took my sibling out along with her roommates when they first started grad school in the city I was living in. A friend who worked nearby asked if she could come bc she liked the restaurant. She was also an alum and excited to meet the newbies. My friend ordered the most expensive truffle pasta dish (3x the cost of others) and two glasses of wine. My sibling and roommates ordered simple pasta dishes and had water. Guess who wanted to split? I told my friend straight out no and that her portion was significantly more than all of ours. I later gave my sibling and their roommate back all the money bc I didn’t tell them (bc ppl over order when you do), that it was on me but didn’t want to cover my friend’s portion. Needless to say, that friend never really talked to me again and I was fine to have one less mooch in my life. Still shocks me to this day that she was making 6 figures trying to sponge off some new grad students.",
          "id": 131,
          "comments": [
            {
              "score": 34,
              "content": "Well, that's the reason why rich people stay rich. It's not always old money but being either frugal or leeching off.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Some people really have absolutely no shame... and it shows.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Well-off people forget that other people don't have money to burn.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 94,
      "content": "NTA what is this trend of be expected to subsidize other people’s meals??",
      "id": 135,
      "comments": [
        {
          "score": 22,
          "content": "[deleted]",
          "id": 136,
          "comments": [
            {
              "score": 3,
              "content": "> I know certain restaurants won't split larger bills but how that equated to everyone doing an even split is beyond me.\n\nIf they tell you upfront that's one thing, but if it comes time to pay and they spring that on you, fuck that.  They have no leg to stand on if they try to escalate it to a legal matter when you are willing to pay for what you ate.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": -1,
          "content": "It isn't a trend really. It's extremely common to lump in meals with other shared expenses when you're doing a trip/day. \n\nLike $40, it is fair to not want to pay a share if you aren't getting anything. But also, $5 is $5 as well. It's also fair to not want to pay $1 more than you naturally 'owe.'\n\nIt depends on OP's/her husband's income on whether or not this is 'cheap.' Like OP says, if people are getting mostly the same thing its no big deal if someone is spending a bit more/bit less. Someone who went into the bill to argue over $5 would be seen as cheap. After calculation on the bill, her and her husband owed $53, so the line she drew was at $18.5 per person. I understand that that's a big chunk of change to many people, but in the context of the day it was likely not a huge difference in expense and that's why it can come across the way it did.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 73,
      "content": "NTA\n\nEspecially when drinks are involved there are way too many people who will try to take advantage of a split check.",
      "id": 139,
      "comments": [
        {
          "score": 5,
          "content": "A compromise I found a couple times was we split the check, but we also agreed ahead of time on one meal and dessert each (no more than $10-15 variation there) and alcohol would be separate. Started doing it at a college event, where we had to Set Limits to use the college's money (college won't pay for alcohol, expenses have to be justified) but it was sensible enough to stick with.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 67,
      "content": "[deleted]",
      "id": 141,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 54,
      "content": "Weird question: Is this an American thing? Splitting the bill evenly? Canadian here, and I have never encountered this in my near 50 years on this planet. The server just asks which people get billed together and then each person/couple/group gets their own bill.\n\nI keep seeing bill splitting disputes on AITA, and it's the weirdest thing to me.",
      "id": 142,
      "comments": [
        {
          "score": 34,
          "content": "A lot of restaurants won't fuck around with trying to keep 7 different checks at a seven person table.\n\nAlso, it's harder to split checks when people are sharing food. Like bottles of wine, appetizers, etc.\n\nThere is also a socioeconomic class aspect of it. College students and lower income people don't want to evenly split a check because they need the money more.  For upper middle class people, you look like a cheap asshole if you want to account for every penny on a bill.\n\nWhen I go out to dinner with friends of the same social class, we always split it evenly. Unless it's lopsided like what happened to OP. In that situation, I wouldn't let OP pay anything at all. If we go to dinner with my sister's family, who won't let me pay outright, I'll do the math because I don't want them to pay for my second 15 dollar manhattan when they make a lot less than I do.\n\nWhen you are splitting a bill evenly, you have to be somewhat cognizant of the amount people are spending. When I go out with my wife's coworkers, they tend to get cheaper entree's and less appetizers. So I either follow the lead or insist on paying more. \n\nThe goal is a less stressful division of the bill, not to freeride on other people.",
          "id": 143,
          "comments": [
            {
              "score": 17,
              "content": "> A lot of restaurants won't fuck around with trying to keep 7 different checks at a seven person table.\n\nWhy?  It's a few taps extra on the ordering system.",
              "id": 144,
              "comments": [
                {
                  "score": 15,
                  "content": "I don't know why, they just don't.  I've actually had waiters refuse to divide checks for larger groups (6-12 people) at sit-down restaurants in the US.\n\nSo now I do what OP requested: Pay, leave a nice tip, snap a picture of the check, and let everyone Venmo whatever they feel like.  Contrary to popular opinion, I find I usually end up fronting more cash when I pay of the bill, but I don't mind.",
                  "id": 145,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Is that a regional thing maybe? Here in New England, I've never had a server react poorly to being asked to split a large check.",
                      "id": 146,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "A lot of restaurants I've been to print it on the actual menu that they won't split checks for a group past a certain size.",
                      "id": 147,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "It’s dumb. I was a server for a long time (in the US) and it honestly wasn’t that hard to split bills. But definitely easier if your table tells you AHEAD of time vs trying to split it all up after",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Some have antiquated ordering systems. Newer systems have the waiter run around with a tablet or device so you can even just quickly pay at your table. I much prefer restaurants that do this",
                  "id": 149,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "It is easy for a server if it’s the type of place where you sit down and are in the same seat the whole time. It’s much more difficult if it’s a pub type place where people are standing up, moving around, sitting back down in a different spot. The server is using your seat as how they are keeping track of what you ordered. If you sit down and order a beer, then get up and go to the bar to take a shot, and come sit back down in a different seat, and then order an appetizer, they are going to assign the appetizer to that new seat and not the person ordering. Then it gets messed up because everyone moved around. Then the customer is pissy with the server and starts bitching about how they got an extra Coors light on their bill and it’s a whole thing. In those situations it is unreasonable to ask the server to keep separate tabs. Otherwise, if you’re staying put, usually totally fine.",
                  "id": 150,
                  "comments": [
                    {
                      "score": 0,
                      "content": "And yet Canadian establishments manage it all the damn time.",
                      "id": 151,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Haha and servers get 18% tips, I think that is enough to cover having to remember who’s ordering what.  It’s not a problem in Canada, it’s a made up excuse in USA",
                  "id": 152,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 0,
                  "content": "Lazy fucks. I've been to several countries this year and they all do it with no issue. They hate to do it in America for some reason and a lot of restaurants will even have a rule that forbids splitting it beyond 3 or 4 or whatever number",
                  "id": 153,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 0,
                  "content": "Yep. And every server I’ve met has easily done it. Servers depend on tips so it’s not in their best interest to be difficult about splitting checks.",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "It's not everywhere in the US, but there are a LOT of people who think if you go out for a group dinner you should expect to split it evenly. I personally hate it, but my group of friends generally does this.\n\nI now tell people in advance if I'm not in a position to split the check that night, and I will often just open my own tab at the bar to avoid having to split those bills.",
          "id": 155,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "[deleted]",
          "id": 156,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "I’m Canadian and used to have a friend who would pull this shit in a group. But yeah servers offering separate cheques has become really common here now.",
          "id": 157,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Yes it happens a lot. Most of the time I go\nOut with friends we split evenly. But if someone wanted to jsut pay for what they got, that’s fine too. It’s just easy to throw a few cards in and not worry about math",
          "id": 158,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "There's quite a few restaurants near me in the USA who refuse to split checks for groups of 6 or more. It's overhead for them and then they get in the middle of who ordered what, and then if 2 checks end up splitting an appetizer...",
          "id": 159,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "I'm also Canadian and I've always gotten separate bills when going out with a group.",
          "id": 160,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "NTA\n\nCanadian, have seen it happen, but plenty of restaurants here say up front that they won't do separate tabs for parties over x people.\n\nBetween the \"everybody just put in enough cash for what you ate\" and the cheapskates in the group not putting enough for tax and tip, fucking over everyone else; or the people doing the \"oh let's just split the whole thing\" BS, I always ask for my own tab or don't go out again with people who pull that once.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -3,
          "content": "My friends and I split bills all the time because it's just easier logistically. Why waste everyone's time running 7-8 cards when you can do it once and just leave.",
          "id": 162,
          "comments": [
            {
              "score": 4,
              "content": "Honestly, given how often this very topic pops up on AITA, I’m not sure that the headache and potential hurt feelings is worth the 5-10 minutes that are saved, but obviously YMMV.",
              "id": 163,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}