{
  "post content": "My fiancé male 33, and I female 34 have been together for 5 going on 6 years, I was there for him for his drug addiction and raised his daughter while he was in jail and homeless and in rehab. I have a son from a previous relationship (15 male), and we have a son together (2 male).\n\nThis last weekend was his daughter's 13th birthday and the day before he messaged me to say that his daughter doesn't want my son at her birthday because her boyfriend is coming, my son and her boyfriend get along very well, and she feels like she will be left out.\n\nSo, I messaged my fiancé and said I would stop by and give her, her gift but I'm not staying as my son was excited about seeing his sister on her birthday and he was sad that he wasn't invited anymore. My fiancé then got angry that I was making a huge deal out of it saying she's allowed to have whoever she wants at her birthday, which I agree she has every right, just as I have every right to show up because my son was upset about being uninvited, he knows I will always have his back.\n\nHis mom called me to find out what was happening, and I told her what he had said, she told me that his daughter never said that she didn't want her brother there and that we must come, but I said no because my son was upset. I did not tell my son that my fiancé was the person who uninvited him, but he figured it out and asked me if it was my fiancé, not his sister who didn't want him around.\n\nI ended up taking my son to the movies and the arcade but when he saw his sister at the mall, he decided he didn't want to stay any longer and we left.\n\nAm I the A\\*\\*hole for being upset about this whole situation?\n\nUpdate.\n\nSorry its taken so long for an update. I spoke with my stepdaughter and she told me that it was not her choice for my son to not be invited, it was his choice to disinvite my son. I understand him wanting to make sure his daughter has a good time but my son and her boyfriend are both older children a simple conversation would have saved all of this.\n\nShe believed I was angry with her and that's why I didn't come, I explained to her that I wasn't angry with her and that I will always be there for her.\n\nFor all those asking, I have no idea why he wanted to disinviite my son. We had been planning the day before and everything was fine, no mention of anything until the message saying he didn't want my son to come.",
  "id": 1,
  "comments": [
    {
      "score": 8071,
      "content": "NTA. Why did your fiance not want your son at the party? Why did your fiance lie and blame his daughter for disinviting him? Why did your fiance want to exclude your son and get mad when you had his back? These are questions that I would need my fiance to answer to my face. Then I would seriously consider if I wanted a relationship with a man like that. From reading the first paragraph alone it sounds like you are completely done with this man to begin with and that this episode was your witts end. It is easier to end an engagement than it is to end a marriage. I am proud that you had your sons back. It seems like your fiance has growing up to do.",
      "id": 2,
      "comments": [
        {
          "score": 2540,
          "content": "This is definitely a fiance problem.",
          "id": 3,
          "comments": [
            {
              "score": 3514,
              "content": "Well yah within a 6 year time period he was on drugs, in jail, homeless, and she still decided to have a baby with him and stay with him. This is a fiance and OP problem that she's wrapped her son in by not picking a better partner. ",
              "id": 4,
              "comments": [
                {
                  "score": 1802,
                  "content": "I know this is a reply, but it really should be the top comment. Getting so sick of seeing people jump head first into dumpster fires, and then wonder why they smell burning trash. \n\nLady, you picked an obvious loser—you fucked around, and now you’re in the finding out stage. I have no sympathy for you, but your kids didn’t make these idiotic choices they’re having to suffer for.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 464,
                      "content": "And she has a kid with this loser. Genius move",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 221,
                      "content": "Or why they're getting 3rd degree burns...",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 195,
                      "content": "1000% agree!  Stupid choices sadly impact the son.  Take son and stepdaughter out for special birthday treat, dump the loser, and make smarter choices!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 158,
                      "content": "Seriously. Not an AH for this citation. But a huge asshole for staying with a man with this much baggage when you have a kid. If you wanna play “I can fix him” with someone at least wait for your kids to be adults. The fact that he obviously doesn’t like her son isn’t helping her look any better.  ",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "People don’t always know their choices are dumb. OP may have had a childhood full of trauma and adults making bad choices and be unable to see unacceptable behavior in a partner in a realistic light.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": ">people jump head first into dumpster fires, and then wonder why they smell burning trash. \n\nThis needs to be some type of motivational poster or be on a mug or t-shirt.\n\nUnfortunately we women are raised to take care of people, try to save people & give guys a chance.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Love your metaphor!",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Damn you didn't have to come for her like that XD\nBut I really loved that phrase, I can relate, I've jumped into a few dumpster fires before :(",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "But she can fix him!",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": ">Getting so sick of seeing people jump head first into dumpster fires, and then wonder why they smell burning trash.\n\nStealing this phrase!",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 188,
                  "content": "Right? Like who da fawk says mmmmm yes drug addicted, homeless and  prison. Sexxxxy!That's who I'm gonna expose my minor child to! As a matter of fact I'm gonna procreate with him!  Like those aren't just redflags those are freaking banners waving over the worlds largest dumpster fires! 🔥",
                  "id": 16,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I work in a men's prison.  I see these women every Friday as they arrive for visiting hours.  I see them on Tuesdays and Thursdays as they arrive/leave for/from \"72-hour family visiting\" aka conjugal visits.  The children are dragged along for it all.  I see the \"you're the only one\" letters written in the same handwriting to numerous men and I see the inmates receive the \"you're the only one\" letters from many, many women.\n\nThese women volunteer to be taken advantage of. I will never understand the attraction. \"Bad boys\" are cute only in the movies.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 86,
                  "content": "A fiance problem based on a \"broken picker\" problem. Why was OP willing to accept so many red flags for so long?",
                  "id": 18,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Aside from the \"broken picker\" problem, as you so eloquently described it, I'd be willing to hazard a guess and say that it's a bit of an \"I can fix him/her/them!\" mentality.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 79,
                  "content": "It broke my heart, her listing the absolute litany of extraordinary things she has done for this man - she sounds so generous of heart - and in all of this there's not a single mention of ANYTHING he has done for her.\n\nThe bar is so low. So many stories of one partner who takes and takes and takes and isn't even fucking appreciative of how lucky they are to have a loyal, dedicated partner . . . and gives absolutely nothing in return. Except usually another small child to be caught up in the mess. Heartbreaking.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Dick is abundant and of low value. I wish more women would hold men to the high standards they deserve.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Exactly ",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Bingo.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I was thinking the exact same thing. Why in the world after him being an addict in jail homeless and in rehab would you ever have a child with this man.\n\nOP, you need to get yourself into therapy to figure out why you’re willing to be a doormat to someone like this. And seriously, consider ending this relationship or at the very least don’t marry this man till you guys get this figured out. Quite often, addicts have a lot of very bad behaviours that remain even after they’re sober.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 334,
          "content": "Yeah I feel like we have a lot of missing reasons here. Why did the father go off script and disinvite OP’s son? Without that info we are all speculating.",
          "id": 25,
          "comments": [
            {
              "score": 175,
              "content": "That I have no idea about either when we were together the day before planning the party everything was fine. the next night I got a message saying his daughter didn't want him there anymore.",
              "id": 26,
              "comments": [
                {
                  "score": 211,
                  "content": "Well, that’s what you need to find out. Possible that he has some weird issue with your son, or maybe he misheard his daughter and it was an honest misunderstanding.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 106,
                      "content": "Or the daughter did say it and then realized \"consequences\" and changed her mind. Then the mother laid the blame on Dad. \n\nHowever, the likelihood that dad just has a secret disdain for the baby he didn't make is far more likely.",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Also a possibility that he thinks his daughter has feelings for her step brother and he imagines he accepts them. While not the same age dynamics, something similar happened to me. When I wad 18 my mother and I hit a rough spot and we moved in with her brother. We knew his daughter (10) had a puppy crush on me, basically since she was born, but now, the mom started to imagine that I had similar feelings for her. Maybe it plated into that I never had a girlfriend, but that was mostly due to my own confusion (bi with male preference) and other things.\n\nMy mom and I hoped the fuck out when my mom's sister in law started to imagine me falling in love with her daughter.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 98,
                  "content": "You need to find out what’s going on from both your fiance’ and your stepdaughter. You don’t need to be confrontational with her about it, just ask for clarity. Is your fiancé a good stepdad? If he’s not he shouldn’t be your fiance. This is not okay and I wouldn’t stay with someone who thought so little of my son.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 22,
                      "content": "The fact that he would ask his stepson to not go to the party is kinda saying nope, not a good stepdad. I get this is one incident. But if they were biological siblings, the brother would be expected to be there. You don’t do to  a stepchild what you wouldn’t do to your own. \n\nIf there was a legit reason to not have him there, a good stepdad would be honest with mom about it so they could handle it together with minimal hurt feelings and he would have backed the decision to stay with the son.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "I have a feeling your fiancé lied about his daughter. Talk to his daughter directly. And confront him. Don’t let him get away with anything.",
                  "id": 32,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "You need to protect your son OP, he should always come first. If your fiance is actively excluding him from things now before you're even married, what is it going to be like when you tie the knot. Talk to him and get a straight answer one way or the other.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "can't you just ask him?",
                  "id": 34,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "First - family comes to family birthday parties.  Your fiance has an issue, you need to sort this out between the two of you because now your kids are suffering the consequences of your immature fiance and relationship,\n\nHelp each other be better.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 211,
          "content": "It’s got to be worrying to OP that the fiancé is apparently the only person who doesn’t want the son around. Both the stepdaughter and fiancé’s ex wanted the son there, but fiancé lied to keep him away. Sounds like it’d be a happy family unit without the fiancé around.",
          "id": 36,
          "comments": [
            {
              "score": 105,
              "content": "In situations like this, when the Fiance goes back to jail, they’ll be a big happy family again.",
              "id": 37,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Wait, where did you see that about fiance's ex? The post just references his mother (the daughter's grandmother). Is there a comment about his ex?",
              "id": 38,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 127,
          "content": "Agreed. You raised his daughter and he wants to exclude your child? TF?",
          "id": 39,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "When your son was 'uninvited' you refused to stay.  You were invited. that is a invitation, not a summons.  You may get along with his daughter but he is definitely an a-hole.",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "First, BRAVO to you for standing by your son in this, it’s heartbreaking reading the threads on here where parents do the opposite. You’ll never regret sticking up for your kid.\n\nSecond, you need to figure out why your fiancée lied about something to you and your son’s face. Don’t allow any gaslighting (you need to prioritize her, it’s not that big a deal, why can’t she have a special day?). What she did was sow the seeds of separation between family, and broke the trust that’s foundational to any relationship.\n\nHope you consider that and really get to the bottom of this BEFORE you get officially married.",
          "id": 41,
          "comments": [
            {
              "score": 44,
              "content": "Why would she even think about marriage to that loser? Especially now.",
              "id": 42,
              "comments": [
                {
                  "score": 5,
                  "content": "These threads come with so many twists and turns that an honest conversation be for a big move like that can make any decision easier.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Naw OP got into a dumpster fire of a relationship with a loser and she did not stand by her son by staying with this horrible man",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Standing by the son? She made the active choice not to tell her son it was the fiance who didn't want him there rather than the daughter. Potentially damaging the kids relationship to protect the fiance. That's not standing by the son.\n\nAnd why do you keep saying what she did? the fiances the liar and hes a he",
              "id": 45,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "And why would you have a baby with someone with that history?",
          "id": 46,
          "comments": [
            {
              "score": 4,
              "content": "I mean, people change, but then there's people like OP's fiancé.",
              "id": 47,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Also why not ask her stepdaughter directly?  \n\nThe lack of communication in this entire post is incredibly concerning but OP seems to be a good mom if nothing else.",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "👏👏👏👏👏",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "It's easier to end an engagement than a marriage, but there is no ending having to raise a child together (even if living apart)",
          "id": 50,
          "comments": [
            {
              "score": 3,
              "content": "If he even has anything to do with the kid you know how some daddies get bitter when the woman leaves",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2527,
      "content": "If the fiancé is already lying to you I suggest you seriously re-think marrying him.  I'll give you another reason - He has no respect for your son which is another red flag.",
      "id": 52,
      "comments": [
        {
          "score": 1039,
          "content": "she helped raise HIS kid while he was homeless and in rehab and he doesn't respect her son? damn the audacity of this man, ruined a perfectly good relationship between the kids.",
          "id": 53,
          "comments": [
            {
              "score": 374,
              "content": "Also, romantic partner who was in rehab is now lying to you? Yeah no thanks. It could be a relapse, it could be a lack of interest in the son, it could be his addiction manifesting in another way (ie fiancé doesn’t want the two kids in the same room right now and able to connect dots on lies…..) \n\nEither way, he’d have very little time to both come clean and fix the kids’ relationship before I’d be noping out. What does he bring to the relationship to make this worthwhile?!",
              "id": 54,
              "comments": [
                {
                  "score": 74,
                  "content": "There’s no evidence for this in the post, but based on how I’ve seen addiction relationships go, probably negging the hell out of her so she feels like she has to stay with him while also lovebombing her when she does what he wants.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "I don't think he's lying. I think the daughter did say something to the dad. The reason was very 13 year old-ish. Parents don't make up that sort of reason. \n\nAs for the fiancé's mom. She's probably just making an assumption. Oh my granddaughter would NEVER uninvite stepbrother.\n\nWhat the fiance did wrong was let her disinvite the brother. Her reason wasn't good enough. And now he's doubling down.",
          "id": 56,
          "comments": [
            {
              "score": 24,
              "content": "I mean they do if they're just as childish.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I mean if *HE* didn't want the son around saying that his daughter didn't want him there would be a very good cover up.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Well, she's an idiot because her boyfriend probably won't appreciate her being mean to her stepbrother/his friend either.  She and her Dad have created a rift in the family for no reason. But, she's 13.  Her Dad is an adult and should have explained what would happen, and worked out a compromise (like inviting the stepbrother, and then organising a date with the boyfriend later).  So it's still his fault, even if he's telling the truth.\n\nIf I was OP, I really wouldn't bother trying to find out any more, I'd be done with him.  He sounds like a loser.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "What about the oldest son just “guessing” that it was actually the fiancé who didn’t want him around?  How does a kid figure that out without there being other clues in their relationship?  My guess is that the oldest son has been receiving triangulation in less visible ways from the fiancé for years, which is why it was impossible for him to miss now.  Kids notice shit like that.  NTA for not going op, but YTA if you marry this asshat without investigating how your son could guess something  like that without being told.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "I was wondering why she was still calling him fiancé.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "She had a child with him AFTER ALL THE RED FLAGS. She’s TA for dragging her then 10yo son into the mess in the first place.",
          "id": 62,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Her post has more red flags than Spain during bullfight season. I don’t even know where to start…",
          "id": 63,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1183,
      "content": "NTA for standing up for your son, but why would you marry someone who doesn't seem to want him around?? Going through with the marriage without sorting this out first would make you the A and you could lose your son in the process.",
      "id": 64,
      "comments": [
        {
          "score": 285,
          "content": "***THIS IS THE BIG QUESTION.*** Is OP sure that idiot fiancee isn't using again? Because \"stepson and daughter's boyfriend get along *too well* so I need to keep stepson away\" is an idiotic train of thought. \n\nNTA",
          "id": 65,
          "comments": [
            {
              "score": 37,
              "content": "This part! That shit sounds like meth head math. You probably onto something.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 670,
      "content": "NTA. Why on earth would your fiancee disinvite your son? So the anger absolutely should be directed at him, not step daughter. She soubds like she is innocent in all this as well. Fiancee is wrong for this.",
      "id": 67,
      "comments": [
        {
          "score": 198,
          "content": "I hope that OP explains to the stepdaughter what happened. She should understand that her dad instigated this. \n\n  \nAlso since it sounds like the relationship is falling apart, I hope that OP reaches out to her stepdaughter's mom and offers to support her in court for full custody. Her fiancee was absent (in prison for drugs, no less) and if it were not for OP, mom would have received full custody before now. He's not a fit parent.",
          "id": 68,
          "comments": [
            {
              "score": 118,
              "content": "Her mother abandoned her when she was 6 months old. We haven't seen or heard from her in years.",
              "id": 69,
              "comments": [
                {
                  "score": 12,
                  "content": "Hats off to you for raising her while he was doing time etc. you didn’t have to, but because of you she had a more stable upbringing. \n\nThe fact he wouldn’t do the same for your child though… I would cut my losses there, children always come first. You could always give the daughter a way of contacting you as you’re the acting mother in her life, but your son shouldn’t have to feel like he isn’t good or important enough for a man whose values don’t align with your own and your son’s.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Im not super well-knowledged on it, but I do know there are cases where the person who raised the kid can be deemed the kids gaurdian, even if they aren't related by blood. If thats something you wind up wanting or needing to do in the future.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 68,
              "content": "If the step-daughter has a mother, why did OP raise her while fiancé was in jail and rehab?  Something tells me her mother is not in her life.",
              "id": 72,
              "comments": [
                {
                  "score": 75,
                  "content": "Yes, it was fiance's mom that called her, not the childs mom",
                  "id": 73,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Took me a while to get it too",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Oh!  I missed that.",
                      "id": 75,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 472,
      "content": "Granted, you rightfully defended your son during the party.  But, once you learned that your fiancé was the sole perpetrator, you were about to let him off the hook altogether and let his daughter continue to get thrown under the bus. That guy is bad news.  For whatever reason(s), he hurt your son, and you know it but you don't want to believe it. Unpopular take here, but YTA.  You shouldn't be upset about the situation, you need to be squarely upset at your fiancé for causing all of this.",
      "id": 76,
      "comments": [
        {
          "score": 104,
          "content": "I asked for some more information because I got the same sense you did: she was willing to let the stepdaughter continue to take the blame for her son being uninvited. If that’s the case then I think this is an ESH situation (minus the two teens). They both were willing to sacrifice the step/daughter for the fiancé. The girl was innocent and wanted her brother there, and now he seems to think his sister no longer wants him around.",
          "id": 77,
          "comments": [
            {
              "score": 110,
              "content": "Hi, I didn't want to say anything on her birthday because its 13 a big one. But I'm fetching her from school tomorrow and going to talk to her about it.",
              "id": 78,
              "comments": [
                {
                  "score": 109,
                  "content": "But I don’t get this then. If it’s a big birthday for her then why did you punish her by you and your son not being there when she wanted you both there?. You should have both gone and your fiancé could go eat his feelings and you’s can unpack wtf he was doing after that?",
                  "id": 79,
                  "comments": [
                    {
                      "score": 52,
                      "content": "She literally said her son was upset. He wasn’t in the emotional state to go to a party and pretend like everything is okay. Do you know how much that  sucks? He was just gonna be a downer and the birthday girl was completely innocent. She should have a nice party.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 64,
                  "content": "Ladies ladies ladies. It’s ok to be single. It’s ok to have standards. It’s ok to not settle. Are we so desperate for a relationship we pick whoever will take us? I’m so disheartened to keep reading things like this. Fiancé that is a drug addict, was in jail, homeless and I had to raise his kid because I supported him through all this have a kid with him and now he has the audacity to mistreat my kid and my response wasn’t pink rocks and dump him? Oh heck no. I wouldn’t tolerate anyone hurting my kid and doing this let alone a catch like this guy",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "Good luck.\n\nDude is shitty enough that he tried to turn his daughter into the bad guy disinviting your son, and he's also stupid enough that he thought it wouldn't ever come up in the future.\n\nSounds like she'll need all the outside help she can get.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "You did not answer what I wanted clarification on. I specifically was talking about clearing it up with your **SON** that the person he considers a sister didn’t uninvite him from her birthday. You skirted around that in your post like you’re doing now. Did you confirm that it was your fiancé and not your stepdaughter who rescinded the invite?",
                  "id": 83,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "Speak to your fiancé first! He seems to be the catalyst in all of this. Does he work? Does he help support his daughter the child you have together? Does this man have any redeeming qualities?",
                  "id": 84,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Since when is 13 a “big” birthday?",
                  "id": 85,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 77,
          "content": "This if she stays it'll only get worse. He'll push her son right out of her life. I hope she does the right thing and gets out now.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Great job pointing out the elephant in the room",
          "id": 87,
          "comments": [
            {
              "score": 32,
              "content": "For real dude. OP needs to open her eyes and realize that fiance wants only his children involved, he's trying to start pushing OP's son out of the picture now that he's older and a few years away from adulthood. At least that's how it looks with the info given, why else would the his step son suddenly just not be welcome at a family event like his step sisters birthday party??",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Naw, I agree with you. She definitely sucks for having trash taste in men. If it was me, I'd have taken my kid and my adopted daughter (junkies aren't parents) and left. Once he got clean of he wanted her back take me to court",
          "id": 89,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 303,
      "content": "> he messaged me to say that his daughter doesn't want my son at her birthday\n\n\n> she told me that his daughter never said that she didn't want her brother there\n\n\nSo you allowed the lies from your fiance to drive a further wedge between your son and his daughter, the kids that you should want to accept each other as part of your future potentially blended family.\n\n\nYou were pouty and childish is this, I feel.\n\n\nYTA for sticking with such an asshole fiance and for not even attempting to repair what he wanted to break.",
      "id": 90,
      "comments": [
        {
          "score": 65,
          "content": "Agreed. Op should have taken her son to spend time with his sister and friends, while reconsidering the relationship with the lying fiance.",
          "id": 91,
          "comments": [
            {
              "score": 36,
              "content": "Yeah, i dont get that logic, she would rather make her son upset at his step sibling and most likely at OP when the truth comes out, instead of confronting her fiance???",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Yeah, i dont get that logic, she would rather make her son upset at his step sibling and most likely at OP when the truth comes out, instead of confronting her fiance???",
              "id": 93,
              "comments": [
                {
                  "score": 45,
                  "content": ">  I was there for him for his drug addiction and raised his daughter while he was in jail and homeless and in rehab. I have a son from a previous relationship (15 male), and we have a son together (2 male).\n\n\nI honestly don't think logic has ever existed in this relationship beyond making her fiance happy. *shakes head*\n\n\nPoor kids. ",
                  "id": 94,
                  "comments": [
                    {
                      "score": 7,
                      "content": "If I wasn't there for his daughter no one else would have been, Hès been sobber for a year now and i honestly thought things were getting better.",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Excellent point!!",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 158,
      "content": "NTA. Are you sure you really want this person in your lives?",
      "id": 97,
      "comments": [
        {
          "score": 98,
          "content": "I feel bad for the OP's son. Why would you voluntarily expose your child to someone dealing with addiction like that?",
          "id": 98,
          "comments": [
            {
              "score": 35,
              "content": "THIS. So irresponsible of her to drag her son along into a messy relationship full of drugs and jail???",
              "id": 99,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "I would be done so fast. He deliberately hurt her child.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Sadly they have a 2 year old together so they are connected for life. Ugh ... not that it means they need to stay together, but a truly 'clean break' is impossible.",
          "id": 101,
          "comments": [
            {
              "score": 19,
              "content": "Well, given his history of addiction and jail time, custody of the little one should be a foregone conclusion... I do worry about the hopefully-STBX's poor daughter though.",
              "id": 102,
              "comments": [
                {
                  "score": 2,
                  "content": "Odds are she'll end up with her too.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 113,
      "content": "Some of us here need more info and clarification for a judgment as right now, I'm leaning towards E S H based on what you have provided so far.\n\nIt sounds like stepdaughter didn't disinvite, and that was clarified by her bio mom? Step daughter did want son there, but you still kept him and yourself back from the party? Why didn't you talk to stepdaughter yourself and clarify her desires,  then facilitate a conversation with both teens(should fiancés claims be indeed proved false)? How involved is grandma if you raised this girl? Is grandma being accurate in her information that her granddaughter has not said or believes that about her stepbrother, or does daughter just not actually tell grandma anything? Do you not believe grandma's word for some reason?\n\nEdited spelling and incorrect word choice. Correction due to clarification of comments/ changed \"bio mom\" to \"grandma\".",
      "id": 104,
      "comments": [
        {
          "score": 46,
          "content": "I believe it was the fiance's mom who called (\"his mom called\"), not the bio mom.",
          "id": 105,
          "comments": [
            {
              "score": 18,
              "content": "You beat me to it. Not bio mom. Future MIL.",
              "id": 106,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "I had to go back and re-read. And Omg, I don't know how I missed \"-HIS-mom called me\". THANK you for pointing out my mistake and clarification.  I'm guessing I just read it as \"her\"?  This clarifies some things. Thank you.",
              "id": 107,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "This is such an important point especially as some commenters are veering off into accusing OP of interfering with bio mom's opportunity to raise the girl because OP helped raise her while the fiance was homeless and in jail.\n\nLet's hope they read your comment.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 25,
          "content": "That's why I voted Y-T-A.  I think OP believed the bio mom because she reached out to her and invited them back.  But, OP would rather remove her son from the situation and hope things will just cool over between him and his stepsister than to investigate and confront her fiancé.",
          "id": 109,
          "comments": [
            {
              "score": 7,
              "content": "OP says bio mom left when daughter was 6. They haven’t hear from her since. It was OP’s future MIL that called.",
              "id": 110,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I believe it was the fiancé’s mom who reached out to OP (the stepdaughter’s grandmother). \n\nBut I have the same issue you do and am currently on the fence with my voting because some things are unclear to me.",
          "id": 111,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "It was clarified by *fiancé's* mom. \"*HIS* mom called. She said 'his daughter would never do that\". It wasn't the bio mom - it was future MIL. Getting more confusing.",
          "id": 112,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 103,
      "content": "Are there no adults in this situation emotionally mature enough to help these teenagers navigate this?? I mean, it didn’t turn out to actually be an issue between the siblings, but when y’all thought it was, were all of you just going to cross your arms like toddlers and say “Fine! If he’s not going, I’m not going!” and leave it at that with no further conflict resolution? It sounds like you and your fiancée aren’t communicating well or really talking to each other, either, since you and him were communicating through his mom instead of you calling or texting and asking “hey what gives??” ESH except the poor kids. You and your fiance, who is absolutely also an a-hole if what his mom said is true, need to grow up. I know Reddit’s go-to relationship advice for almost every dilemma is “break up!” but why weren’t you aware of any ill feelings from your fiancée towards your son? Why expose your young son to a partner in active addiction who isn’t even his father? Lotta stuff going on here. ",
      "id": 113,
      "comments": [
        {
          "score": 39,
          "content": "It’s crazy how OP quite literally just chose to ignore basic communication skills here. She didn’t bother talking to the step daughter TWICE (before the party and at the mall), didn’t bother to talk to the bio mom. Then basically gaslit her son by taking him somewhere else when it was clear BEFORE they went it was the fiance who schemed all of it up.",
          "id": 114,
          "comments": [
            {
              "score": 8,
              "content": "It's crazy that you didn't bother to read that it was her fiance's mom--OP's future MIL--NOT the bio mom, who told OP the girl wanted OP's son at her party.\n\nIf the girl really didn't want OP's son at her party and the OP questioned the girl, it might upset the birthday girl and you all would be accusing OP of ruining the girl's birthday by \"confronting\" her over an invitation that was the girl's choice to include or exclude guests.\n\nYou all expected the OP to have all the answers to what really happened as she was trying to navigate this mess and do what was most supportive of her own son.",
              "id": 115,
              "comments": [
                {
                  "score": 3,
                  "content": "We don’t expect her to have the answers, we expect adults to communicate with each other.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Bio mom is not in picture.",
              "id": 117,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 99,
      "content": "So let me get this straight so for 6 years you exposed yourself and your son to an addict but him uninviting your son to a party is where you draw the line. \n\nYou have willingly chosen this bs. Deal with it. \n\nYTA",
      "id": 118,
      "comments": [
        {
          "score": 13,
          "content": "I agree. I seriously wuestion her judgment. I commented something similar.\n\n\n🙄",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Not only exposed her already existing son, she went and had another kid with the dude.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}