{
  "post content": "So freshman year of college, I began working on this project casually. I like to keep notes on women I talk to about their favorite things, activities they enjoy, gifts/candy they like, sappy shit like that. I suck at remembering things like that so I decided to keep a spreadsheet.\n\nEventually after getting a handful of entries. I offhandedly mentioned it to my friend group. One had the idea that I share it with them so we could all keep new entries as they “caught” different entries. \n\nSo this expanded further. Right now about 40 guys have access to it and it’s mainly the guys in my frat, and the women featured are girls from different sororities. We also added more information such as like where you should take them if you really wanna impress them. We don’t keep this information for any nefarious or scumbaggy reasons. \n\nJust to help us know what to do if we want to impress certain girls. Like the original idea of this was just to keep information like favorite color so I didn’t every forget their favorite colors. Now it’s helping a lot of guys.\n\nSomehow, a girl who was on the list found out and she was pissed tf off. She was eventually able to trace it back to me so I assume someone who was simping for her snitched when the Pokédex wasn’t making the girl like him.\n\nSo she’s pissed off and she made it out to be a guide to hooking up with women, when it’s most definitely not that. It’s just to make impressing them on dates easier. That’s it. She’s made a big deal of this telling so many girls around campus and now they’re all saying that by the start of the fall semester, none of them will be visiting our fraternity or going to our parties.\n\nNow all the guys are mad at me, when I’m not even the one who told girls about the list and they were all also using the list. I also think it’s unfair to say the list was all about sex when it wasn’t at all.\n\nAITA?\n\nEdit- I’m not a stalker. There was no information in it that could’ve been used to hurt someone. Only to have a better date. And it isn’t about sex. I never used it for just sex.",
  "id": 1,
  "comments": [
    {
      "score": 14202,
      "content": "YTA-but mainly for thinking everyone is too stupid the see the real intention behind the list. There isn't a person on here who believes this list isn't for sexual or nefarious reasons",
      "id": 2,
      "comments": [
        {
          "score": 5332,
          "content": "If they wanted more than sex, they would make the effort to learn about the girls like a normal, non-stalkery person. Also, I bet the guy who spilled the beans did it because she noticed he knew way too much about her... because girls aren't stupid, we tend to notice when guys know things they shouldn't.",
          "id": 3,
          "comments": [
            {
              "score": 2304,
              "content": "Whaaat ? A dude knows all about my hobbies, likes, the places I’d like to go when we barely talked ? Omg, what a genius he is ! My dumb female brain could never figure out how he does that !",
              "id": 4,
              "comments": [
                {
                  "score": 858,
                  "content": "for real \"random dweeb who just started talking to me seems to know everything about me, what the fuck\"",
                  "id": 5,
                  "comments": [
                    {
                      "score": 534,
                      "content": "And since it’s a database accessible by 40ish frat boys, it’s probably not just one boy who magically knows these things. Imagine having guy after guy after guy knowing the same several facts about you they could have no way of knowing. But our dumb girl brains could never put the pieces together, obviously.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 41,
                      "content": "Random dweeb? But they are in a frat! You should be honored!",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 468,
                  "content": "No, see, I'd be swooning, because *clearly* this means we're soulmates.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Yup, he just happened to like white claw and vegan açaí bowls.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 330,
                  "content": "Kind of reminds me of the one stalker story going around internet where the dude decided to gather information about his crush, like phone number, where she lives etc. He reasoned that \"when she finds out I already know all this, she will trust me more because she knows she doesn't have to hide anything from me\".",
                  "id": 10,
                  "comments": [
                    {
                      "score": 92,
                      "content": "OH NO WHAT??",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 30,
                      "content": "The “Criminal Minds” episode about cyberstalking was terrifying because while the endgame was sensational (as usual) the story about the methods was straight from several well-publicized cases. There’s so much info on social media that it’s easy to act socially compatible without ever actually meeting someone. “I was in Cabo last month.”  “Wow, we were there last week! [and posted on Instagram]”. “Cool!  Did you check out [bar she mentioned on Instagram]?” “Yes!”",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1044,
              "content": "This is exactly what I was thinking. If a guy I just met suddenly knew shit about me, I’d have lots of questions.",
              "id": 13,
              "comments": [
                {
                  "score": 146,
                  "content": "It's super creepy",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 563,
              "content": "It does sound like the smoking gun was a real life use of the I Never Said It Was Poison trope, revealing information that had no good way of being known.",
              "id": 15,
              "comments": [
                {
                  "score": 297,
                  "content": "I Never Said I Was Poison Type if we're going to stay on theme.",
                  "id": 16,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 191,
              "content": "But why would you play on normal mode when you have the cheat codes? /s",
              "id": 17,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "I think the main sign this was about sex is there was no information about men on it. If OP just wanted to remember things people told him to impress, and not for that to be used in a romantic setting, then he'd want to impress his male friends too. Men arguing that they're not sexist or after sex never use their problematic behaviours on men. \n\n\n\n\n\n\n\nPlus, using the word 'simping' says a lot about his attitudes towards women.",
              "id": 18,
              "comments": [
                {
                  "score": 14,
                  "content": "Exactly. The simping comment rubbed me the wrong way. Glad I’m not the only one.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1382,
          "content": "No, no, no. Obviously it’s just to help them have better dates! Why would they want to have better dates? Certainly not because they wanna fuck em afterwards, that would be nefarious!",
          "id": 20,
          "comments": [
            {
              "score": 298,
              "content": "It reminds me of Dennis taking women on boats to scare them into sleeping with him, but then is like “who said anything about rape? I feel like you’re completely missing the point!”",
              "id": 21,
              "comments": [
                {
                  "score": 92,
                  "content": "It’s the implication.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "These dudes are definitely using the DENNIS system.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1022,
          "content": "The most honest/revealing line in the post: \"...I assume someone who was simping for her snitched when the Pokédex wasn’t making the girl like him.\"",
          "id": 24,
          "comments": [
            {
              "score": 653,
              "content": "I'm sorry, but I will never be able to take a person seriously when they have used the word \"simping\"",
              "id": 25,
              "comments": [
                {
                  "score": 249,
                  "content": "Yeah that’s straight up incel dogwhistle",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 141,
                  "content": "I think it's a funny word to use in ways it wasn't intended for (friends playing board games and one realizes they won't win so they start helping another person win instead - we all go \"hey hey don't simp!\").  But when ***actually*** used as an insult surrounding sex and gender it's just ewww.  \n\nLike how my friends and I that are gay or bi will go \"gaaaay\" at each other as fake insults but if someone actually tried to use it while tearing down one of us we would step up to tale them down.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "That, and “making the girl like him.”",
                  "id": 28,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "“Pokédex” is what did it for me.",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 852,
          "content": "Oh, he admits it's for sexual reasons, saying \"it's not JUST for sexual reasons,\" as if that in ANY way makes it better or him not a comple fucking asshole.",
          "id": 30,
          "comments": [
            {
              "score": 44,
              "content": "Right. His edit is even worse.",
              "id": 31,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 41,
              "content": "He also said the “original idea” was to keep track of stuff like favourite colours but I'm wondering how much it changed from that.",
              "id": 32,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 432,
          "content": "I feel its important to note that even if this wasn't about sex (which it clearly is), this would still be creepy af and legitimately dangerous to the women involved. Someone could easily use that database to stalk or scam any woman listed.",
          "id": 33,
          "comments": [
            {
              "score": 31,
              "content": "I agree. That makes OP a predator for the society.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 307,
          "content": "The whole post gives off creepy vibes.  The icing on the cake is knowing OP is in a frat.  YTA OP.",
          "id": 35,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 198,
          "content": "So obviously creepy and definitely for sex. Otherwise he'd surely have a 'Pokedex' of all his male friends likes and dislikes too, no?",
          "id": 36,
          "comments": [
            {
              "score": 24,
              "content": "Yeah, how else will bros be able to impress each other with their knowledge of each other’s trivia and stats?  Normal conversation, the kind humans have with each other???",
              "id": 37,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 63,
          "content": "Saying that they want to use the list to \"impress\" a girl to make it easier to get a date is just the first step in eventually getting in their pants. OP is too dumb to realize that he is already admitting that they are using it for awful reasons. \n\nOP, YTA",
          "id": 38,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "The jackass literally spilled the beans with\n\n>when the Pokédex wasn’t making the girl like him",
          "id": 39,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": "If he were making one for women and men in his life. He straight up determines stuff they like sappy shit. But sharing it with his frat bros? Massive YTA.\n\nCreepy. Creepy. *Creepy.*",
          "id": 40,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12072,
      "content": "YTA. You said it was created to help you remember stuff about the girls you were dating and it wasn't for nefarious reasons, but you also say that a guy probably gave up the fact that your \"pokedex\" existed because the info on it wasn't getting her to like him. That sounds like manipulation and that is nefarious.",
      "id": 41,
      "comments": [
        {
          "score": 5057,
          "content": "Manipulation is the perfect way to describe this. They’re making these girls think they actually took the time to plan something special for them when in reality all they did was search their name in a fucking spreadsheet in order to “have a better date” aka get sex from them. Completely not okay and I bet all of those girls feel violated from this whole thing knowing there’s random men out there who know all that shit about them.",
          "id": 42,
          "comments": [
            {
              "score": 2300,
              "content": "It's Groundhog Day. Bill Murray learns everything he can about her character and pretends to be into it all so he can sleep with her during the beginning rounds. \n\nAnd rightfully, she thinks it's kind of weird and creepy *because it is*.",
              "id": 43,
              "comments": [
                {
                  "score": 795,
                  "content": "What is going on in OP's head for him to think this isn't creepy at all? Few things:\n\n1) I understand being forgetful. Most of us are. But asking them to remind you is also an option. No one creates a spreadsheet and then willingly shares it with MULTIPLE PEOPLE.\n\n2) YTA",
                  "id": 44,
                  "comments": [
                    {
                      "score": 146,
                      "content": "This! When I started talking to the person I like I kept a little sticky note becuase my memory on favorite colours/fruits etc can be terrible. Not a single soul has seen that little note and no one will. Imagine how creepy if would be if I gave it to some guy so he could pretend to care or know about her. Shit like this is what genuinely worries me with some people. 40 plus dudes as well creepy as fuck.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 46,
                      "content": "I keep notes on my FRIENDS' favorite colors/tv shows, and any dietary restrictions they have. To make up for my poor memory, make it easier to get them birthday gifts, and to avoid accidentally poisoning anybody. I genuinely can't imagine sharing even those pretty vague facts with random people, let alone compiling a spreadsheet of every fact I can think of about them. That is genuinely dangerous behavior.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "He doesn't see women as people. Want proof? Bet he doesn't keep a pokedex of his male friends' likes and dislikes.",
                      "id": 47,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "Also sounds like an early Stephen King short called I Know What You Need. So, yeah, it's officially super creepy.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 78,
              "content": "to \"make dates easier\"... so more successful if your end game is sex. all of this information is to bypass getting to know a girl, so you get to your end game faster..\n\nnone of this \"it wasn't about sex\" thing, what else were you trying to save time for? getting to know someone on a date *should* be the end game, it *is* the fun part. but if you're cheating your way out of it then your angle is clearly something else.\n\non top of which, guys have all this information on girls, so what is left to talk about? the guy. girls didn't get a cheat sheet on their date, they had to learn about their date the old fashioned way - by getting bored to death listening to a guy talk about himself for 4hrs... no wonder it wasn't working!\n\nand I don't buy the - just helps me remember things- bit. that would work if you personally were actively dating 40 women, but you're not. you hang out, it doesn't work - why do you need to know which jonas brother was her favourite? you don't. you take her star sign and her favorite colour and you forget it and move on. storing it was never about a bad memory, it was 100% to pass this information on to other ppl\n\ngross",
              "id": 49,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "Yeah, these girls thought they were just having a conversation, in reality they were spilling the beans to 40 creeps who thought they’d found cheat codes for sex.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Yeah, pretty much.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2553,
          "content": "Also funny how he doesn't need a \"pokedex\" to remember what his guy friends like/dislike. And I'm sure their likes and interests aren't considered \"sappy shit\" to him either.\n\nHey OP, maybe try viewing women as human beings and you won't need a database to manipulate them with.\n\nYTA and putting women in LITERAL danger. This is so creepy YTA YTA",
          "id": 52,
          "comments": [
            {
              "score": 690,
              "content": "It's like a little group of incels that haven't hit cocoon stage yet.",
              "id": 53,
              "comments": [
                {
                  "score": 32,
                  "content": "Incel larvae\n\n . . . What do they turn into after the cocoon stage? Given that they're already this bad, do I want to know?",
                  "id": 54,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Depends on the subspecies. Some turn into domestic terrorists, some turn into politicians.",
                      "id": 55,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "This is the one. Take my award! 👏🏻👏🏻👏🏻\n\nYTA, OP, and bull-fucking-SHIT it wasn’t being used to get sex. You wouldn’t need an entire *spreadsheet* if the only goal was to find a nice, wholesome relationship with someone you’re interested in.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Seriously second ALL of this. Why not get to know women instead of trying to make it \"easy\", on all of your buddies to get with them too, OP? YTA",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1560,
          "content": "I think he is literally the biggest AH I’ve seen in a while. It’s REALLY misogynistic, women are not cattle.\n\nAnd calling it a “Real life Pokédex”? What is he, 5?",
          "id": 58,
          "comments": [
            {
              "score": 445,
              "content": "If this is real, I think it's a candidate for one of the worst of the year.",
              "id": 59,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 35,
              "content": "\n>And calling it a “Real life Pokédex”? What is he, 5?\n\nI read that and felt so much second hand shame. I hate that feeling. I had to leave that cringe sub eventho I like when its funny sometimes. But most times I just wanna go and jump off a house or something",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 564,
          "content": "And he was \"simping\" for her",
          "id": 61,
          "comments": [
            {
              "score": 310,
              "content": "And the fact that he thinks that someone who was \"simping\" for her told her it was him instead of her just figuring it out on her own",
              "id": 62,
              "comments": [
                {
                  "score": 167,
                  "content": "yeah like after the second, maybe third, dude who knew exactly what I liked I feel like most girls would've figured it out, especially if they're all from the same frat",
                  "id": 63,
                  "comments": [
                    {
                      "score": 35,
                      "content": "The moment he said another guy must be \"simping\" for her he let the cat out fo the bag about who he really is.\n\nYTA",
                      "id": 64,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "It's a shame they didn't have it in the file that one of her dislikes included being on file.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 82,
              "content": "As soon as I saw that word i knew exactly who we were dealing with....",
              "id": 66,
              "comments": [
                {
                  "score": 50,
                  "content": "The minute someone uses that word he's the a-hole...",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "Such a red flag that I almost skipped the rest of the post to go drop a YTA ruling.",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "This right here! Like wtf of course he’s TAH",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 82,
          "content": "If it's about everyone you met, whatever gender they are, then yes i can believe it is \"for you to remember people coz you are bad at it\", it's weird, but not creepy.\n\nBut it's a list of girls, for a bunch of guys.\n\nAnd you are trying to tell me this isnt about hooking up? What you think everyone is stupid?",
          "id": 70,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 36,
          "content": "Yeah. If I was admin at that University I would decertify the entire frat and put every single person involved in creating that list on double-super-secret-academic probation and send private messages to every woman on the list so she knew what private info about her is being used by a coordinated, predatory group.\n\nYTA and I would warn every woman in my life about you and include links to everything. You need a good look in the mirror and need to do a lot better. This is honestly infuriating to me.",
          "id": 71,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "My time with this post was essentially: \"Well, the title makes them a clear AH, but let's read the post and find out.\" \"Oh, he was just keeping notes to help them remember? Well, that's not so bad.\" \"Aaaaand now he's got others joining in and they're sharing notes. Whelp, that came back to AH REAL fast.\"",
          "id": 72,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "Also, like, comparing it to a Pokédex? “Gotta catch ‘‘em all”? How much you wanna bet at least half these guys wouldn’t marry a girl because she slept with “too many” people? (For clarity there is no such thing as too many imo.)\n\n& like others have mentioned. Just because *you* aren’t going to do anything nefarious doesn’t mean *no one* will do anything nefarious. Considering the stats of abuse against women & girls, & 40 people having access to this, I’d honestly be surprised if no one has done anything nefarious with it. & that’s without getting into OP’s misunderstanding of what qualifies as nefarious…\n\nYTA 100%",
          "id": 73,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11738,
      "content": "> We also added more information such as like where you should take them if you really wanna impress them. \n\n> We don’t keep this information for any nefarious or scumbaggy reasons.\n\nSo you don't think keeping a secret spreadsheet of the likes and dislikes of a bunch of girls is scumbaggy when the list exists solely to help your frat bros pretend to really know them?\n\nYTA and so are the rest of the guys with \"access\" to this list. Grow up.",
      "id": 74,
      "comments": [
        {
          "score": 2474,
          "content": "Yes and even if one person isn’t using it for nefarious reasons does not mean that everyone will have this same idea",
          "id": 75,
          "comments": [
            {
              "score": 2228,
              "content": "I can't see any other uses than nefarious here because it's not like these frat boys are trying to wife these girls. Let's call a spade a spade here.\n\n**It's a boy database intended to make it easier for these frat boys to trick the women into giving up sex.**\n\nThis database is highly invasive and creepy and I can't wait for any of the girls to find out about it and press charges.\n\nOP and all of these guys are MASSIVE ASSHOLES.\n\nEd. OP even if you just made a database like this for yourself that would still make you an asshole. We all know you're not doing this out of respect for women, you're doing it to better convince women you're a good guy so you'd get laid. The fact you gave a bunch of guys access to your database proves you're not.\n\nA good guy would take this as a learning experience, delete the database and are more mindful in the future. Your call.\n\nSecond edit: Just to add that where I live it is SA to get sex through coercion, threats and FALSEHOODS. Frauding your way into getting a person to sleep with you may equal rape in the eye of the law.",
              "id": 76,
              "comments": [
                {
                  "score": 832,
                  "content": "Guys back in my high school had a thing like this, everyone knew it existed, I'm pretty sure it had been a tradition for many years. They weren't trying to be cute with the name though, they just called it \"The Meat Catalogue\". I completely forgot about this, until now. Ew",
                  "id": 77,
                  "comments": [
                    {
                      "score": 325,
                      "content": "*Gag*",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 80,
                      "content": "Guys at my school ranked every girl and gave detailed reasons. Parents needs to raise their sons better. We have way too many little sociopaths running around.",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 66,
                      "content": "[deleted]",
                      "id": 80,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 29,
                      "content": "My first instinct was to downvote this solely because of that name 🤮 Gross",
                      "id": 81,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "Ew",
                      "id": 82,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "*retch*",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 679,
                  "content": "This. Add in that repeatedly referring to the spreadsheet as a Pokedex objectifies these women. They aren't Pokemon. You literally even used the phrase \"catch them all\" and you still can't see that this is scumbaggy??\n\nYTA",
                  "id": 84,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 24,
                  "content": ">she made it out to be a guide to hooking up with women, when it’s most definitely not that. It’s just to make impressing them on dates easier. \n\nOP even admits it in his post! She's right and his sentence isn't exculpatory at all.  He concedes its to help on dates, aka hooking up with women.  Such an asshole!",
                  "id": 85,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": ">an't see any other uses than nefarious here because it's not like these frat boys are trying to wife th\n\nIn my HS they were exchanging pictures and info like hockey cards  \nthey were thrown out for juvenile pornography and general duchiness",
                  "id": 86,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1311,
              "content": "Right? How long until someone adds a \"favorite sex position\" or whatever?",
              "id": 87,
              "comments": [
                {
                  "score": 798,
                  "content": "As soon as the other information 'works' and one of them gets laid. I'm sure they'll also track who an individual slept with.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 320,
                      "content": "And how many times, and where, etc…",
                      "id": 89,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 237,
                      "content": "Ugh. This just gave me the ick. You are so right. Maybe even make it into a competition. He’s already pretending like it’s a game with the Pokédex name",
                      "id": 90,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "And slut-shame the girls after...",
                      "id": 91,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 38,
                  "content": "Or their emotional baggage that they can exploit.",
                  "id": 92,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 28,
                  "content": "I assume that kind of crap is on there. I don’t see why we should believe OP is terrible enough to make this, but not terrible enough to put super inappropriate things on it too. People often leave out inconvenient facts to push the crowd in their favors",
                  "id": 93,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "I'd bet real money there's already sex stuff on there.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I don't make sucker's bets.",
                      "id": 95,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Right. 40 Guys have access to this information?! 40! It's ridiculous to assume it's all just sweet natured and aimed at bringing the best flower choice to their door.",
              "id": 96,
              "comments": [
                {
                  "score": 17,
                  "content": "40 that he knows of. That’s not counting if those 40 have shared it with others not in their frat",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1312,
          "content": "Also don't forget this line:\n\n>so I assume someone who was simping for her snitched when the Pokédex wasn’t making the girl like him\n\nNo one uses the term \"simping\" unless they're looking at women as a hookup culture. \n\nHonestly the information tracker was okay at first, but only when it was just OP keeping it for himself. I thought OP may just have a hard time remembering details and/or reading someone (like Abed from Community when he tracked his friend's [attitudes](https://www.youtube.com/watch?v=VNJN1aV8YWI)). There's nothing inherently wrong with keeping notes about your friend's special dates (birthdays, etc), favorites, dislikes, and other information important to them.\n\nTo share that with his whole frat is what took it too far. At that point it became a \"cheat sheet\" for hooking up with all the sorority girls. I also bet that everyone who had access to the hookup sheet called OP a \"genius\" or a \"legend\", or any other term of endearment, until they got found out.",
          "id": 98,
          "comments": [
            {
              "score": 380,
              "content": "Thank you! As soon as I read simping I was like I've read all I need to 🚩🚩🚩🚩",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 313,
              "content": "that quote also lets slip that the “pokédex” is about “making the girl like him”, OP can say all he wants that it’s “definitely not a guide to hooking up with women” but his suspected motives for it being leaked are that someone was unsuccessful at using it to hook up with a woman.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "Using the word snitched is pretty telling too. \n\nPeople concerned with being snitched on know what they're doing is not above board.",
              "id": 101,
              "comments": [
                {
                  "score": 14,
                  "content": "\"We would have gotten away with it too, if it wasn't for you kids!!!\"",
                  "id": 102,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 64,
              "content": "[deleted]",
              "id": 103,
              "comments": [
                {
                  "score": 40,
                  "content": "Well, he considers them human, so he probably has an easier time remembering the things they say.",
                  "id": 104,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 28,
              "content": "Well in his edit he says this isnt about sex but then says it's not just about sex so clearly it was used to hook up with these girls some or is about sex for some of these guys so really it is just about sex now because its not his sole profect anymore",
              "id": 105,
              "comments": [
                {
                  "score": 45,
                  "content": "\"Look, it's not ONLY about sex. We just all use it to get sex, but that's not what it's for\"",
                  "id": 106,
                  "comments": [
                    {
                      "score": 13,
                      "content": "\"It absolutely has many practical applications other than sex, we just haven't discovered them yet because we've been too busy using it for sex.\"",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Exactly this. And he couldn’t *fathom* that maybe the dude who told, told because he was disgusted by this list and wanted to be a good person. It’s obviously someone who was so desperate to get laid he blew his ‘bros’ in.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 772,
          "content": "The fact he called the person who ratted on him to the women a \"simp\" really tells me all I need to know about this dude. Typical frat bro.",
          "id": 109,
          "comments": [
            {
              "score": 345,
              "content": "I like the posts where people dig their own graves by showing us who they are. You can spin a story but language doesn't lie.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 745,
          "content": "Also, the only woman who found out about it was furious, but OP still doesn't see the problem.",
          "id": 111,
          "comments": [
            {
              "score": 464,
              "content": "Clearly she’s just an overly dramatic female who can’t understand that the list isn’t for nefarious purposes 🙄 \n\n/s …just in case",
              "id": 112,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 429,
              "content": "Woman 🧐 do you mean entry?",
              "id": 113,
              "comments": [
                {
                  "score": 119,
                  "content": "\"I don't get it entry number 57 didn't liked it...\nMaybe should I put susceptible and doesn't like to be compared to a Pokémon in it...\"",
                  "id": 114,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "Pokéwomon?",
                  "id": 115,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 268,
              "content": "Because clearly the girls are the problem, duh.",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 90,
          "content": "Incel vibes",
          "id": 117,
          "comments": [
            {
              "score": 18,
              "content": "1000%",
              "id": 118,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 71,
          "content": "[deleted]",
          "id": 119,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Facebook started like that. Just wait until Mark finds out and sues OP.\n\nYTA.",
          "id": 120,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10919,
      "content": "Dude,  it's creepy and gross. If course it's a hook up guide don't pretend it isn't.  YTA",
      "id": 121,
      "comments": [
        {
          "score": 2682,
          "content": "Exactly. Saying it’s not about sex but a guide to better/easier dates. Wtf does he think the end game is for these dates? He’s giving these boys a cheat code as if these girls’ lives and personalities are a game to them. Creepy.",
          "id": 122,
          "comments": [
            {
              "score": 1546,
              "content": "> a game to them\n\nWell he did call it a Pokedex so you're not wrong.",
              "id": 123,
              "comments": [
                {
                  "score": 134,
                  "content": "Gotta catch m all...",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1048,
              "content": "The whole “Pokédex” thing is absolutely dehumanizing. Once people are dehumanized - they will be abused because they’re seen as lesser, something to pursue, and/or a game to play. Women at OPs school aren’t meant to be captured and gamed into dates. I get what OP was trying to do and how a log might be helpful to him but once it called them game characters and was shared it became problematic.",
              "id": 125,
              "comments": [
                {
                  "score": 397,
                  "content": "It's problematic no matter how you refer to them. It's dishonest and borderline abusive. Imagine you're a woman who meets someone that seems to be the perfect fit for you - shares all your interests, loves doing the same things as you, cares about you so much he remembers all the little things you say. You could really see a future with this guy. \n\nThen you find out that it was all basically a scam so he could hook up with you because someone made a pokedex to help him \"catch\" you. He goes and does it to another woman the next weekend. It's awful.",
                  "id": 126,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Not to mention it's another way for men to hate women. \"Well, I followed everything in the pokedex, why doesn't she sleep with me? She must be a (insert any horrible, derogatory name here).\"\n\nThis is like the problem actions movies/any movie has: training men into thinking that women are \"rewards,\" not people. This is how the Nice Guy epidemic was created. This absolutely horrible thing OP is doing is going straight towards that.",
                      "id": 127,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Exactly. Even if I try to believe his claims for starting the list (though I really can't) I wonder what brain he used to get into college because he really couldn't possibly used the same one to think a bunch of guys (especially typical frat guys) wouldn't use it as a hookup list.\n1) If OP had kept his list to himself and 2) didn't refer to it like a game then I might have been able to maybe think it was started for his \"bad memory,\" but the fact he shared it far and wide and refers to it like a game makes his fiend innocince impossible to believe.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 511,
              "content": "Because for OP women are not human beings. They are just objects to be fucked by men.",
              "id": 129,
              "comments": [
                {
                  "score": 357,
                  "content": "Even better, we're on par with little imaginary animal creatures who's purpose is to be tracked, caught and traded 💁‍♀️ \n\nI've loved Pokemon all my life but this is gross.",
                  "id": 130,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Well, now you’re on the list as “loves Pokémon”\n(I do too, and I’m furious it will remind me of this dude)",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 242,
              "content": "But his edit even indicates the \"not about sex\". He says that he's never used the guide for JUST sex...which implies to me that sex is a use for this guide.  I'm not sure what the other uses are.",
              "id": 132,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 125,
              "content": "Imagine every guy you talk to suddenly having the same exact talking points, inviting you to the same restaurant, and so on.\n\nIt's so short sighted. Not only are they boring the shit out of the people they're targeting (and it is targeting), they're also making themselves completely replaceable and disposable – you know, the way they view women. I hope all the dumbshits get what they deserve, left with no one but each other.\n\nYTA",
              "id": 133,
              "comments": [
                {
                  "score": 14,
                  "content": "YTA~They deserve to be kicked out of school, imo. I don't see this pokémon sheet as anything different then hazing, (which is forbidden on college campuses) if anything it is way worse. You've made it easier for nefarious guys to stalk and rape their victims. I can't believe you don't understand this behavior unacceptable, and makes you in major a****** territory.",
                  "id": 134,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "Also, he didn’t say it wasn’t about sex. He said it is not JUST about sex. So yeah, it is about trying to trick women into sleeping with them.",
              "id": 135,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1531,
          "content": "If this is true I hope the college administrators are made aware of this.",
          "id": 136,
          "comments": [
            {
              "score": 737,
              "content": "If it’s true, I hope a student writing for the school news is made aware of it. One small article would be sufficient.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 473,
              "content": "Remember that there once was a rating website of female students is now known as facebook.",
              "id": 138,
              "comments": [
                {
                  "score": 181,
                  "content": "I legit thought this was a parody post for that at first. (Small correction though, I thought the hot/not ranking system came before Facebook, rather than became it. Two separate projects by the same creator.)",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "I was going to call him a low-class Zuckerberg in my post.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 32,
                      "content": "That's just Zuckerberg then. Cause money and fame doesn't make you classy. His original facebook was just as creepy as this dude's Pokédex imo.",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Maybe one day OP will make a technological innovation that furthers the machinations of governments planning genocides and we’ll look back and find this to be almost cute.",
                  "id": 142,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 247,
              "content": "[removed]",
              "id": 143,
              "comments": [
                {
                  "score": 176,
                  "content": "It does technically break Greek life rules depending on what frat he’s in. Sororities would cut off contact with a fraternity engaged in that type of behavior, and their nationals may put them on probation",
                  "id": 144,
                  "comments": [
                    {
                      "score": 41,
                      "content": "I was going to say, I was Greek in college and the standards they have are much more strict than the university’s. Plus colleges love to make examples of Greek orgs anyway so it’s kind of a double whammy.",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 119,
                  "content": "It might be gross and creepy enough to encourage girls to not date the guys in that frat, though.\n\nThere’s a lesson here, OP: when you reduce women to objects, they don’t tend to like it. “There’s no information there that could have been used to hurt someone”- says the man who calls this database a “Pokédex”. You’re under the impression that all this personal information shouldn’t be earned. \n\nAnd its nice to say it isn’t about sex, but if you think that people haven’t or won’t alter it to make it about sex, you’re naive.",
                  "id": 146,
                  "comments": [
                    {
                      "score": 18,
                      "content": "He's full of it, it is always about sex. If there is any attraction whatsoever, it is sex. Unless someone is looking for a completely platonic relationship, is incapable of sex, or has another motive in mind, every interaction is shrouded in sex. From that person interested in you at the bar to that co-worker asking you on a date to get to know you better all results from that primal place to copulate. Even if the goal is to find someone you are compatible with or marry doesn't take from the fact you are looking for someone who wants to have sex with you too. He is naïve or full of shit to say it's not about sex. This is not a guide to find the perfect babysitter lol \n\nTo actually alter the guide tho to reflect sexual preferences and such would be even more disrespectful to women. ugh",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 44,
          "content": "I feel like creepy and gross don’t cover it.\n\nIs there a qualified linguist in the house? We need better words!",
          "id": 148,
          "comments": [
            {
              "score": 20,
              "content": "Ominous, nightmarish, disgusting, disturbing,  discommoding, and frightening are all words that came to mind reading this lol",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "It's not a hook up guide! It's a guide for impressing the girls on dates so you can hook up with them! Toooootally different. /s\n\nobviously YTA, just because you couch things in cute or non-threatening terms don't actually make things cute or non-threatening. Even if your original intent was \"don't forget my friends' favorite colors\" (...I'm *sure*), once you started making that information available to people who don't even *know* these women without their knowledge or consent you jumped right over the line into creepy. Just. Ugh. Seriously??",
          "id": 150,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "He's been posted in r/niceguys along with some of his responses in pms regarding this post. He's trash and definitely TA. \n\nETA: here's one. https://www.reddit.com/r/niceguys/comments/vocwfw/oop_hes_getting_agitated/?utm_medium=android_app&utm_source=share",
          "id": 151,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10825,
      "content": "Ooookay, let me see if I can explain this...\n\nImagine you're a girl. Imagine talking to a guy, maybe going on a date or two, whatever, and he seems nice. You two get along and seem compatible.\n\nThen you find out that all those nice things he did was because he had access to a database of information about your likes and dislikes and other information. Not only yours, but a bunch of other womens info too. And not only that, but LOADS OF GUYS have access to this info.\n\nNow, as a girl, you are HYPER AWARE of the danger of sexual assault, stalking, etc. Quite probably you have female friends and/or family with traumatic experiences regarding this. One of the few ways you have to keep yourself safe is to share information about yourself wisely. \n\nAnd suddenly, you realise that TONS of guys, guys you do not know and do not trust, have had all this information about you to try and win you over.\n\nThat is **fucking terrifying**, for what I hope are obvious reasons.\n\nThere is plenty of other things wrong with this (you've basically set out a goddamn menu of women for men to pick and choose from, describing it as a \"pokedex\"), but hopefully this might give you somewhere to start.\n\nYTA. Delete this database immediately. Your \"convenience\" does not trump women's safety.",
      "id": 152,
      "comments": [
        {
          "score": 4785,
          "content": "\"OP has offered the following explanation for why they think they might be the asshole:\n> I may be the Asshole for making girls no longer want to hang out with guys in my frat\" \n\n\nHe doesn't even care about women's safety he's only rethinking it now because it's affecting the social lives of the guys in his frat 😭😭😭",
          "id": 153,
          "comments": [
            {
              "score": 1919,
              "content": "“I’m sorry ^^I ^^got ^^caught “",
              "id": 154,
              "comments": [
                {
                  "score": 195,
                  "content": "That's exactly what this is.",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I'm sorry...for how this affected my bros",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 658,
              "content": "WTF… dudes a total meathead with no empathy apparently. At least none for the girls he talks to… what a major AH",
              "id": 157,
              "comments": [
                {
                  "score": 184,
                  "content": "Women aren't human to him, we probably aren't even considered on the same level as pokemon, despite the title. At least pokemon aren't viewed as sex toys by obnoxious frat dudes.\n\nThe 'pokedex' is more like a menu or a catalogue of women.",
                  "id": 158,
                  "comments": [
                    {
                      "score": 19,
                      "content": "> at least Pokémon aren't viewed as sex toys\n\nI see you've not spent much time on the porn side of the internet. Please maintain your innocence and never Google Pokémon without the NSFW blocker on.",
                      "id": 159,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "\"Women aren't human to him.\"  \n\n\nNo. They're Pokemon. He's trying to trap them in his balls. Next up is trying to make them fight each other.  \n\n\nOP, if real, YTA.",
                      "id": 160,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "So, a frat boy. Future leader of America.",
                  "id": 161,
                  "comments": [
                    {
                      "score": 18,
                      "content": "40 years from now this Reddit post will go into evidence at his senate confirmation hearing.",
                      "id": 162,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 89,
              "content": "One of these 40 dudes is going to r*pe someone (if they haven’t already) and gaslight them into thinking it was consensual. Guarantee it",
              "id": 163,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "I was involved w a guy in a frat (theta xi I’ll call em out! Idc!!)\n\nNow I’m definitely fat mind you, but I’m also a pretty kick ass woman if I do say so myself. And the guy I was involved w was also my best friend from before he joined this frat. Anyways, he was always so wishy washy about us and one day it felt like he’d commit and the next day it was “I just want my freedom!” And y’all…this shit HURT. Time and time again. And I was in a sorority myself right- so I knew some of his brothers, he knew ALL my sisters and my sisters were close w this frat too. Anyways, I finally found out through one of my sisters who had a similar issue w another brother that these brothers used their chapter meetings (for anyone not aware, chapter meetings happen once a week and are week Greek orgs are supposed to talk about important things like event planning, new member recruitment, and basically the functions of the org- there’s also typically formal and informal meetings the biggest difference being for formal meetings you wear pin attire and talk in Roberts Rules) anyways- these dudes used their chapter meetings to discuss the girls guys were involved with. They discussed their hookups and debated the validity of relationships! And these assholes believed this guy shouldn’t date me SIMPLY because I was fat. \n\nAnyways-\nOP YTA and show a long and disgusting history of sexism and all around douchery found in frats.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Omg I missed his reason for being the asshole. He thinks he is being an asshole toward his friends, he doesn’t realize he is being an asshole toward the women. Holy shit. Holy shit.",
              "id": 165,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Don’t be ridiculous. Women aren’t people. How could you even compare them to his frat brothers.",
              "id": 166,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 858,
          "content": "Thank you for saying this! This awful “Pokédex” 100% reads as a menu to order your next sexcapade. Clearly the guys are using this list for those reasons, and clearly OP knows cause he wasn’t surprised by knowing someone did that and pushed blame to others who use the list as well.",
          "id": 167,
          "comments": [
            {
              "score": 33,
              "content": "Exactly like a menu. \"Hmm, I think I'll try the Amber, she only costs handpicked daisies and a diet Coke.\"",
              "id": 168,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 831,
          "content": "This this this. I would also be interested to know if the information really is just favorite colors and ice cream flavors. Or if there are also info like phone numbers, majors, places of work, which sorority they belong to etc. You know, prime stalker material. Doesn't even have to be OP, it only takes one of the bros to add a column.",
          "id": 169,
          "comments": [
            {
              "score": 541,
              "content": "I have met far too many frat guys that I have a hard time believing this is just about favorite foods and colors.  I bet you anything there is a column about how far they will go on the first date and how many guys she has slept with.",
              "id": 170,
              "comments": [
                {
                  "score": 278,
                  "content": "Absofuckinglutely! He’s trying to paint frat boys as innocent guys who would never take advantage of women lmfao. Gtfoh OP anyone who has ever met a frat boys know exactly what else is included in this weird spreadsheet.",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 231,
                  "content": "My ex-frat treasurer boyfriend, upon hearing that it “isn’t about sex,” scoffed and literally said “it’s a *frat,* yes it is.”",
                  "id": 172,
                  "comments": [
                    {
                      "score": 77,
                      "content": "Right. I mean, if it's a \"pokedex,\" they're clearly keeping track of which girls they \"caught.\" and 1000% theres a running joke in the frat about \"gotta catch em all\" disgusting",
                      "id": 173,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 39,
                      "content": "I dont trust frat guys in general but especially if they have a database of a bunch of girls they share.",
                      "id": 174,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "I'd be shocked if dimensions/breast size wasn't a coulmn",
                  "id": 175,
                  "comments": [
                    {
                      "score": 24,
                      "content": "What they will and won't do in bed",
                      "id": 176,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 149,
              "content": "Trying to think of the last time I went on a date and we got on the subject of \"favorite color.\"\n\nI'll update when I've got something.",
              "id": 177,
              "comments": [
                {
                  "score": 19,
                  "content": "Remember though posts are archived after six months",
                  "id": 178,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 136,
              "content": "It's not funny but I just laughed at the idea that knowing a woman's favourite colour would be in any way useful to wooing her. Like, \n\"Hey baby, you look like your favourite colour is blue.\"\n\"It's like you can see my soul.\"",
              "id": 179,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "As a shared, *editable* document, who’s to say there weren’t MULTIPLE COPIES made for other’s personal use with those specific details. You just know OP didn’t set restrictions.",
              "id": 180,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 595,
          "content": "This is classic r/niceguys material. He’s treating women like objects. OP should read through that sub to get a picture of what he looks like.",
          "id": 181,
          "comments": [
            {
              "score": 77,
              "content": "Oh it’s there already. Was posted within minutes!",
              "id": 182,
              "comments": [
                {
                  "score": 94,
                  "content": "It is in fact [right here so OP can go read how badly he's getting roasted in two places now!!](https://www.reddit.com/r/niceguys/comments/voamzs/hes_just_helping/?utm_medium=android_app&utm_source=share)",
                  "id": 183,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 380,
          "content": "This. OP has made all of these women into vulnerable targets for any asshole, creep, or potential sexual assaulter. Honestly sounds like this might be illegal.",
          "id": 184,
          "comments": [
            {
              "score": 115,
              "content": "Depending on where he lives, this might be illegal. It delves into the realm of stalkerish and the fact that everyone can trace it back to him is a big fat uh oh. Personally I think that dude has black listed himself at this university in terms of dating. Also that he needs to get rid of it ASAP.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "In the EU, if you are any of those women, you could probably fuck them with GDPR",
              "id": 186,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 313,
          "content": "I was horrified when I got to the line about 40 guys have access to this information.  It's fine if you want to make a couple notes about someone for your own memory issues, but this just sounds so creepy.\n\nOP- if I was that girl, I would make sure that everyone else knows how creepy you are and to stay away from you and your frat.  YTA",
          "id": 187,
          "comments": [
            {
              "score": 129,
              "content": "Is report it to administration. This is predatory.",
              "id": 188,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 299,
          "content": "Yes, this, all of this. I'd be paranoid about trusting any guy at school after this. But hey, OP, the information in your pokedex just helped even more people! Now all those women know exactly who not to trust! And you'd better believe they'll pass down that information.",
          "id": 189,
          "comments": [
            {
              "score": 130,
              "content": "A CreeperDex. \n\nGotta avoid em' all! 🙄",
              "id": 190,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 210,
          "content": "This times a million. It’s creepy af and they don’t know HOW MUCH information is on there. Their birthday, phone number, address?? Their likes and dislikes? What about deeply personal information they only shared when comfortable that now a cohort of frat douches knows about? \n\nYikes on trikes.",
          "id": 191,
          "comments": [
            {
              "score": 11,
              "content": "Depending on how much is there, he and anyone who knew about it/used it could (and should) face disciplinary action. I hope the girls spready the word fast.",
              "id": 192,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 134,
          "content": "Exactly. I said it in another comment, but this is everything a guy needs to convince a woman he knows her and talk her into accepting a ride from him or going with him to a secluded space.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "He doesn't even has to \"imagine being a girl\". If this guy found out that there's a database about him, made by *bi or gay* men, he surely will be overly pist and immediately assume is for sexual reasons instead of \"it was a list of safe people to be around with\" to name an example.",
          "id": 194,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10263,
      "content": "YTA. \n\nThat’s just creepy. \n\nAnd the fact that you shared it with other people and allowed them to edit it is disgusting.\n\nAlso..”entries”?? These aren’t “entries” these are actual people you’re talking about here. \n\n“The Pokédex wasn’t making the girl like him” so much for it not being for nefarious reasons\n\nEdit to add after your comment saying nothing on there can hurt people: you have a list of several women’s favourite places, so places they are likely to often go to and now approx 40 people have access to that information, and now know the most likely place to find these girls. How is that not information that could result in them getting hurt!",
      "id": 195,
      "comments": [
        {
          "score": 1743,
          "content": "I find it interesting that that many frat guys are inept when it comes to remembering simple details about girls. OP, YTA and must think people are stupid for believing your lame excuse for why this spreadsheet was created.",
          "id": 196,
          "comments": [
            {
              "score": 721,
              "content": "Right. How many girls is he trying to impress at a time that they can’t remember basic facts. I still remember the favorite color of some guy I had a crush on in HS. Mint green 😍",
              "id": 197,
              "comments": [
                {
                  "score": 246,
                  "content": "I remember the favorite ice cream flavor of some guy I went on two dates with three years ago lol",
                  "id": 198,
                  "comments": [
                    {
                      "score": 74,
                      "content": "Well don’t leave us hanging! What was it? 😉",
                      "id": 199,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 48,
                  "content": "I forget birthdays, I’ve forgotten my own birthday a couple of times but I’ll be damned if I don’t remember the offhand comment one of my partners made about strawberry milkshakes being her favorite flavor",
                  "id": 200,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Yeah because those are THE best milkshake flavor. Also that’s very sweet.",
                      "id": 201,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 515,
              "content": "He doesn't seem to need one to keep track of details about his guy friends.",
              "id": 202,
              "comments": [
                {
                  "score": 88,
                  "content": "Particularly since he’s so certain none of them are using this in what he judges to be an acceptable way.   He can remember every detail of how every man in his school is using this but not basic information about women he’s supposedly interested in?",
                  "id": 203,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "Because he doesn't wanna fuck em",
                  "id": 204,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "And being nice to your guy friends is probably not considered \"simping\".",
                  "id": 205,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 416,
              "content": "They would have to care enough to spend time in getting to know the girl and remembering the details. They essentially made it a game with a cheatsheet of how to get into a girl's pants with the least effort.",
              "id": 206,
              "comments": [
                {
                  "score": 14,
                  "content": "Bingo",
                  "id": 207,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 315,
              "content": ">\\*Many frat guys are inept when it comes to remembering simple details about girls\n\nIts because they don't actually care, the girls they're trying to get are just a number to them/will confer status for them because they're hot and that's it. It's not about finding human connection for them.",
              "id": 208,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 168,
              "content": "\"Is to much to remember their favorite colour, is much more easier to keep an updated and detailed spread sheet with all of their details of as many different women as possible and to instruct more frat bros in how to use it and how to add more information... But it for nice reasons!\"\n\nOP, probably.",
              "id": 209,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 154,
              "content": "\"I find it interesting that that many frat guys are inept when it comes to remembering simple details about girls.\"\n\nWell, that would require the bare minimum of caring about the girl as an individual. OP is just collating data so the frat guys can cut through all that noise.",
              "id": 210,
              "comments": [
                {
                  "score": 24,
                  "content": "Wait, are you suggesting women are people too?! With individual thoughts and dreams?!",
                  "id": 211,
                  "comments": [
                    {
                      "score": 15,
                      "content": "And favorite colors too!",
                      "id": 212,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 144,
              "content": "They aren’t, but why do the legwork in getting to know a girl when you can lie about things you have in common and fuck her that much more quickly. Whatever OP says is totally bullshit. This is a bang Rolodex. So disgusting and pathetic.",
              "id": 213,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 105,
              "content": "Exactly. Nothing wrong with making small notes from time to time to remember things on friends or partners, like when their birthday is or what they’re allergic to(I like to make food for my friends a lot). But beyond that it’s just creepy.",
              "id": 214,
              "comments": [
                {
                  "score": 20,
                  "content": "Favorite foods and foods they dislike is so handy. I have a friend who dislikes deviled eggs or mac 'n cheese. 😳 I know to bring something else over.",
                  "id": 215,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Yeah, I was all ready to say NTA: \"some people are just forgetful, it's considerate to keep notes on the people you care about!\" But this Pokedex is quite a bit beyond that.",
                  "id": 216,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Note how these guys always seem to think saying \"I am not a stalker\" makes it true.",
              "id": 217,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1490,
          "content": "Yup, completely creepy. People don't enjoy being treated like objects, and women especially are sensitive to things resembling stalking or ways to manipulate them. Which this is.\n\nSo... are some of you dudes trying to \"catch 'em all?\" Eww\n\nYTA",
          "id": 218,
          "comments": [
            {
              "score": 608,
              "content": "Not even objects.  Objects are real and take up space in the universe.  He treated them like imaginary wild animals.",
              "id": 219,
              "comments": [
                {
                  "score": 418,
                  "content": "And the fact he doesn’t think a group of frat boys aren’t using this to be “nefarious,” is just chef kiss. You are taking these women’s info and putting it into a database without their implicit consent, so that these guys know how to act in order to impress them so they eventually can get into their pants. You all are selling yourselves as people you aren’t in order to get with a girl. It’s manipulative. It’s gross. It’s creepy.\n\nBut calling it a Pokédex is really fucking special. Whats the catchphrase for Pokémon again? Oh right “gotta catch ‘em all.” \n\n\nYTA\n\nEdit to respond to your edit: just because *you*, OP, aren’t using it for an immediate hook up, it doesn’t 1) change the fact you are giving other frat bros the means to do so by giving them access to info they wouldn’t otherwise have in order to play someone they aren’t to gain a woman’s trust 2) make it any less creepy and manipulative and 3) doesn’t mean you wouldn’t eventually get sex out of whoever you end up going after from your little “Pokédex.” Still gross. Still needs to be shut down. You owe ever one of those women an apology, and they also do not owe you forgiveness. What you pulled was a a huge violation of trust and privacy.",
                  "id": 220,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 43,
                  "content": "I mean all he's doing is assembling cheat codes to get past the boring parts of paying attention to individual girls and learning about them.  I mean, why do that when you can pull up your Pokedex, figure out her cheats, and skip ahead to the goals of the next stage.\n\nBut not sex.  No one would ever use this for sex.  ESPECIALLY not a group of frat bros!!!\n/s\n\nSeriously,this is like the plot of a bad 90s Rom Com, only in this case OP is definitely not the protagonist who learns a lesson.  That'd be the guy who realized how terrible it all was when the girl he liked started liking a jerk with the list and confessed everything!  Thus ruining it for everyone!  Or maybe he's really in love with the girl but some OTHER frat bro is into and she (who swore she'd never date a frat guy, but made an exception for the protagonist) is weirded out that a frat brother seems to know everything about her.  He spills the beans, everything blows up, and now the real protag has to win the girl back and learn who his TRUE bros are and probably start his own fraternity that only respects women!\n\nSorry...got lost in writer mode there...",
                  "id": 221,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 767,
          "content": "[removed]",
          "id": 222,
          "comments": [
            {
              "score": 237,
              "content": "Also, this:\n\n>sappy shit like that.\n\nLike wtf is *that* about? I guess women liking things is sappy now lol.",
              "id": 223,
              "comments": [
                {
                  "score": 120,
                  "content": "\"Oh you have a favourite place to eat?? That's so sappy. Food is purely fuel to me.\"\n-OP, probably",
                  "id": 224,
                  "comments": [
                    {
                      "score": 36,
                      "content": "Why are women's interests treated this way? Like I genuinely wanna know lol.",
                      "id": 225,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 671,
          "content": "What really got me is \"caught\". So gross and dehumanizing",
          "id": 226,
          "comments": [
            {
              "score": 343,
              "content": "His reasoning why he thinks he might be the asshole is \"for making girls no longer want to hang out with guys in my frat\". He doesn't give a fuck about all the women he creeped out, he's just upset that now his frat brothers blame him for girls not wanting to fuck them anymore.",
              "id": 227,
              "comments": [
                {
                  "score": 16,
                  "content": "Oh my god I didn’t even see that. This guy is such a dick",
                  "id": 228,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 567,
          "content": "A guy I was seeing used to be in a frat. He told me that he and the other guys in the frat would make a spreadsheet of various girls’ menstrual cycles, and would add to it when they found out a new girl’s cycle. Hearing that killed all of my attraction towards him. This “pokedex” reminds me of this a lot. OP is an asshole. Both guys pretended they didn’t use the information to try and hook up with girls. Why the fuck did you make it then? How would OP feel if the women in the sorority made a spreadsheet of dick sizes and whether they are circumcised or not?",
          "id": 229,
          "comments": [
            {
              "score": 101,
              "content": "wtf that's so disgusting. That's medical information that they don't need to have. They're not doctor's or anything. The only people who might have a legit reason to know would be roommates so they could remind you that its coming up and ask if you have the stuff you need. Or maybe an SO so they can buy you chocolate when you're about to start (chocolate always makes me feel better).",
              "id": 230,
              "comments": [
                {
                  "score": 134,
                  "content": "Yeah we used to work at a bar together. My shift finished and I was sitting at the other side of the bar doing my cash-out and he was closing up the bar. He said this to me and a few other coworkers, including our manager, as if he was bragging. He said it like it was supposed to be impressive. I stopped doing my cash-out for a second and looked at him to check if he was serious. He was. I told him that I wouldn’t be talking to him for a bit after hearing that. His smile dropped and he got kinda pissed and said “oh come on, all the guys at the frat were doing it.” I shook my head and said “no, that’s fucked up.” He stood there dumbfounded for a bit until the manager said “women are a lot more entitled now than they used to be, eh?” And they both started laughing and slapping each other on the back. That made it worse for me.",
                  "id": 231,
                  "comments": [
                    {
                      "score": 79,
                      "content": "I bet he added you to the list under menstruating today.",
                      "id": 232,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 53,
              "content": "Making a spreadsheet of women’s bodily functions and medical information is even more creepy",
              "id": 233,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": "Imagine if a sorority tracked men and their dick sizes. 😬",
              "id": 234,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 330,
          "content": "I'm thoroughly disgusted, its one thing to create a document to help remember things about your OWN friends like birthdays, allergies, fav colour/ food for said birthday ideas. I'm autistic I can see the value in an aid like that. OP's doc only tracks women, shares it with with 40 other men. Refers to the subjects like they're Pokemon, Gotta Catch Em All right? Even if OP as they swear have no nefarious intentions, how can they vet and be sure that the people he shared this with & the people they will share this will won't have bad intentions for these women. OP YTA & have aided predators if you aren't one yourself. be fucking ashamed.",
          "id": 235,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 308,
          "content": "OP is TA.  This js like how Zuckerberg got started.",
          "id": 236,
          "comments": [
            {
              "score": 93,
              "content": "slightly different as The Zuck was rating girls on their hotness. But certainly has the same energy. \n\nBig time creepy.",
              "id": 237,
              "comments": [
                {
                  "score": 124,
                  "content": "You don’t think the pokedex had a hotness rating?!? Bet it talked about their waxing habits and cup sizes, let’s get real. It’s not gonna be just, “Pink is Buffy’s favorite color.”  It’s gonna be “Small tits but perky and will give head.” Or “won’t put out til the third date - don’t bother.”",
                  "id": 238,
                  "comments": [
                    {
                      "score": 29,
                      "content": "It will be coded, but same information.",
                      "id": 239,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 152,
          "content": "I might have given OP a pass if it was a spreadsheet for himself only as I can understand not wanting to forget things *about* a person. But the second they shared it he lost me. \n\nYTA OP. That's just creepy, and fully naïve to think a shared cheatsheet for dates isn't nefarious in nature.",
          "id": 240,
          "comments": [
            {
              "score": 35,
              "content": "He doesn't keep a spreadsheet of his frat friends, it's just creepy af regardless if he shares it or not.",
              "id": 241,
              "comments": [
                {
                  "score": 26,
                  "content": "Exactly. If he has entries for his grandpa’s favorite foods and his frat buddies’ birthdays and restaurants to take them, it’s probably a helpful work around for a caring person with memory issues.  The reality is he is treating the women at his school like prey.  The fact he thinks it’s cute to call this a Pokédex instead of realizing just how misogynistic and objectifying that is tells me all I need to know.",
                  "id": 242,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Yep. I have memory issues due to a TBI and I have to keep notes like this or *I forget people I know exist.* But I do it for EVERYONE I know, regardless of gender or relationship... OP is just a creep, and so are his disgusting friends.",
                      "id": 243,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "I feel like OP is trying to sound naive and appear more innocent about the whole thing, but even if OP was naive and thought that, i can almost guarantee that other members at the frat were using it with bad intentions.",
              "id": 244,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 75,
          "content": "Theres tons of dating sims like stardew valley where people value gifts differently. He still chose to compare it to a game about capturing animals for a checklist. Seems telling.",
          "id": 245,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7559,
      "content": "YTA. You and all the boys who wanted access to this 'pokedex'. Did any of you think that gosh...maybe...**maybe** talking to the girls and finding out through normal communication of what they like? Sure, noting down what they like after talking to them for PERSONAL USE is fine (e.g. likes a certain flower that can be used for a gift). However, literally having a 'collect them all' pokedex which allows the other guys to put no effort into talking to the girls is weird and makes it sound like you are all treating this as a dating sim.",
      "id": 246,
      "comments": [
        {
          "score": 3494,
          "content": "Strange how he doesn't need a pokedex to track of what his guy friends like.",
          "id": 247,
          "comments": [
            {
              "score": 2063,
              "content": "The fact he continues to call it a Pokédex makes it sound like women are a different species who he is incapable of understanding without hard data. Instead of you know- being human beings???",
              "id": 248,
              "comments": [
                {
                  "score": 648,
                  "content": "And to make it a competition of who you \"caught\" and I guarantee there was at least, if not dozens of, \"gotta catch 'em all\" jokes in their group chats.",
                  "id": 249,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 446,
                  "content": "You know these frat douches were trying to “collect them all” 🤮",
                  "id": 250,
                  "comments": [
                    {
                      "score": 20,
                      "content": "The comment about how she only found out because of a guy \"simping\" on her is totally gross too",
                      "id": 251,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 311,
                  "content": "That's called misoginy, it's sooo cool to see women as pets, prices or objects that people ask if they're in the wrong for dehumanizing them like that",
                  "id": 252,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 459,
              "content": "Why would he, he is not trying to fuck them lol\n\nI love how OP acts like a 5 year old that just got caught doing something wrong and thinks that pretending to not know it was something wrong could work lol",
              "id": 253,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 413,
              "content": "Right? I’d be way more forgiving if it was a thing he made for his friendship group so that he has ideas for what to give them for their birthdays and stuff. But no, he only did this for the gender he is attracted to. OP must genuinely think we’re all idiots if he thinks we won’t realise it’s obviously made with the goal of ‘wooing’ them (probably fucking them too).",
              "id": 254,
              "comments": [
                {
                  "score": 421,
                  "content": "Yep, I could understand if it was a neurodivergent thing, but 2 things push it to creepy for me:\n\n- It’s only information about women.\n\n- The fact he distributed it to other men with the intent of objectifying and manipulating the aforementioned women. \n\nI say manipulating because of this line:\n\n>I assume someone who was simping for her snitched when the Pokédex *wasn’t making the girl like him*\n\nIf that wasn’t already YTA, how about the classic “she’s made a big deal of it” reaction to a woman expressing discomfort.",
                  "id": 255,
                  "comments": [
                    {
                      "score": 35,
                      "content": "He's TA just for using the word \"simping\" and thinking that gives him any justification in his argument.",
                      "id": 256,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 187,
              "content": "i like his edit at the end \"im not a stalker! im just a creep!\"",
              "id": 257,
              "comments": [
                {
                  "score": 15,
                  "content": "Por que no los dos?",
                  "id": 258,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 114,
              "content": "Silly rabbit, girls aren't people. Friends' likes and interests are permanent info; you only need to remember the girl's interests until Monday morning.",
              "id": 259,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 84,
              "content": "Excellent point 👌",
              "id": 260,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Hmm. This point here.",
              "id": 261,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 520,
          "content": "What's even creepier is that the guy is just doubling down and insisting that it shouldn't be creepy at all and that they shouldn't be blamed at all for this list. There's also blame levied at the women for finding it creepy and warning other women away from the group. \n\nPlus we all know that these guys were likely adding other info to the guide, like how \"easy\" someone was, remarks about their bodies, and so on.",
          "id": 262,
          "comments": [
            {
              "score": 180,
              "content": "I mean, this isn't a romantic or screwball comedy. There's a reason why people look back on older movies and talk about how creepy and problematic they are in hindsight. (Revenge of the Nerds, anyone?)",
              "id": 263,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "OP tried to make real life HuniePop. (And totally missed the point where even HuniePop mocks it’s players for doing what he did. Lmao.)",
              "id": 264,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 356,
          "content": "This^.  I don’t have a great memory so when I’ve dated someone (or friends sometimes) I wrote down things they like or gift ideas so I’d remember them, and I think that’s the similar to how you started this. But it went way too far. YTA\nEdit: I would even add that when friends with or dating someone it’s not totally inappropriate to ask a closer friend of theirs for advice for gift ideas or that kind of thing. But that’s the extent\n\nAlso edit for grammar",
          "id": 265,
          "comments": [
            {
              "score": 244,
              "content": "Yeah and it’s because that involves putting effort into something for someone you like. \n\nThis lets them cycle through women and use the facts like buttons they can press to gain approval. \n\nAlso, if you like a girl enough to write down her interests, even if later you don’t have romantic feelings, presumably you wouldn’t want to throw her to a group of forty other men who will use this as a shortcut. Because, generally, if you like and care for someone, you want them to be with someone good. It feels like the women aren’t people. They’re species to study in order to play with or domesticate. Yuck.",
              "id": 266,
              "comments": [
                {
                  "score": 67,
                  "content": "And who says that the women want to do the same thing on every date? Just because I was impressed that we went to Chez Louie on one date with a guy doesn't mean that I wouldn't be impressed by a candlelight beach dinner with another.\n\nIt screams that these guys are lazy and just want a 'shortcut' when it comes to dating. And what's with the name Pokedex?",
                  "id": 267,
                  "comments": [
                    {
                      "score": 42,
                      "content": "And how creepy is it if you date a new guy and he randomly says, \"I know you're favorite color is blue and you love tulips?\"  That's something he should find out by talking with you not looking into \"A Pocket Guide to Girls on Campus.\"",
                      "id": 268,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "That's what I was thinking.  Ok Bad memory so this list is just for him to help remember.  I can be hard to remember 100 new things all at once.  As soon as I read he shared it to 40 people.  I was like nope he's now the AH.  \n\n\nOP YTA",
              "id": 269,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 174,
          "content": "Oh my God you're right about it feeling like a dating sim 💀 imagine how weird it would be for someone you just met to know these random facts about yourself like they studied up on you. Eventually she could trace it back to whoever she told and know the information spread around. Have no idea how these frat boys thought they would get away with this.",
          "id": 270,
          "comments": [
            {
              "score": 18,
              "content": "Sarah? Back, back, forward, X, A, double jump \n\n\nCassie? X, jump, A, A, B, X",
              "id": 271,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 136,
          "content": "It’s also pretty creepy if someone who rarely asks you any of your favourite things just know things. It’s very stalker ish",
          "id": 272,
          "comments": [
            {
              "score": 89,
              "content": "Right?! Imagine one of those girl's is \"popular\" and all of a sudden, ten different dudes know exactly what she likes and how to seduce her, and there's not anything about this that these women should consider off-putting, never mind creepy.",
              "id": 273,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "But-but-but females aren't some kind of HUMAN or anything, they're \"entries\" to be \"caught\"!",
          "id": 274,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "It's especially weird, because the data is probably WRONG.\n\nThey have no idea what the girl does or doesn't like because their interactions have likely been limited. Who's validating the data? Certainly not the girls.",
          "id": 275,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6142,
      "content": "Yta it's creepy.  If you just made note of one person you were dating it'd be ok but information on lots of women is gross",
      "id": 276,
      "comments": [
        {
          "score": 3049,
          "content": "Using the word pokedex is deeply uncomfortable, like women are videogame creatures. Pokemon in the anime get better treatment as individuals rather than for filling a tick list, unless it's Paul or Go being the trainer.",
          "id": 277,
          "comments": [
            {
              "score": 941,
              "content": "Exactly it turns them into novelty objects. It’s dehumanizing and objectifying. Totally gross.",
              "id": 278,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 503,
              "content": "Videogame creatures that are captured and basically enslaved who do whatever you order.\n\nIt is not a good comparison to make to women.",
              "id": 279,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 477,
              "content": "Gotta fuck them all…",
              "id": 280,
              "comments": [
                {
                  "score": 351,
                  "content": "Yeah, there's no way he didn't used this slogan with his frat, referring to this \"Pokedex\".",
                  "id": 281,
                  "comments": [
                    {
                      "score": 187,
                      "content": "Not one guy in this 40 guy group using the document pointed it out either...how dehumanizing and downright creepy this was.\n\nFunny thing is, the whole world could come and write YTA here, and OP would still convince himself that the document was about...**\"favorite colors\"**.",
                      "id": 282,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 64,
                  "content": "There's a Ditto joke in here somewhere but I got a migraine so y'all will have to do the legwork yourselves.",
                  "id": 283,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 410,
              "content": "Who wants to bet they created a points system and tracked their scores?",
              "id": 284,
              "comments": [
                {
                  "score": 54,
                  "content": "[deleted]",
                  "id": 285,
                  "comments": [
                    {
                      "score": 18,
                      "content": "The addition of \"I never used it *just* for sex\" (italics mine, but necessary for emphasis) also skeeves me out.",
                      "id": 286,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 351,
              "content": "Like not just video game characters, animals you capture. Like fucking gross dude. Doesn't help the image that he's in a fraternity.",
              "id": 287,
              "comments": [
                {
                  "score": 34,
                  "content": "The frat thing definitely makes it so much worse. A gross list of women in a guy friend group? Really bad and disgusting. But in a frat? So much worse scary and disgusting",
                  "id": 288,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1851,
          "content": "I would feel so betrayed being one of those girls. Imagine going on a date with a guy to find out you have so much in common and getting excited about a possible relationship. Only to find out it was all information he got from a spreadsheet added by a bunch of other people you know.",
          "id": 289,
          "comments": [
            {
              "score": 816,
              "content": "It’s like a stalking club",
              "id": 290,
              "comments": [
                {
                  "score": 26,
                  "content": "exactly! your comment doesn't have enough likes...",
                  "id": 291,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 72,
              "content": "this is literally exactly what i said in my reply lmao\n\nit ruins everything imo",
              "id": 292,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "They’re like “it’s totally not used to get hookups” like surreeeee buddy",
              "id": 293,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 404,
          "content": "I have a terrible memory and I'll create a note on a date/partner while starting to see them, but I think the key differences are that I don't compare it to Pokémon and I DELETE IT AFTER WE BREAK UP why would I want to keep information on the guy I saw twice in February",
          "id": 294,
          "comments": [
            {
              "score": 318,
              "content": "Plus, you're not sharing those details with 50 other creeps.",
              "id": 295,
              "comments": [
                {
                  "score": 13,
                  "content": "And passing it around like trading cards. Holy! Fuck!",
                  "id": 296,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "This, I think keeping a list of things your partner likes or not like is fine, some people like to write diary entries to remind themselves, others like a clear list. There are stories of couples who has been married for decades who have little notebooks of their partners likes and dislikes for anniversary and stuff, and those are cute. But that should be only for current partners. Why would anyone need to keep a list of preferences by their ex????? OP is so wrong...",
              "id": 297,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 154,
          "content": "What happened to just.... get to know a girl on a date is what I'm wondering. \nMost females I know would be irked to find out a guy found out what she likes from some index of the girls on college. \nI would wonder to start with even how the heck this guy knows alot of my favorite things. Just nope.",
          "id": 298,
          "comments": [
            {
              "score": 122,
              "content": "But then I have to listen and care about what she says like????",
              "id": 299,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 30,
              "content": "Yeah, but why put in any effort if you can just speed-run to the sex part and disappoint her there instead?\n\nSeriously, all the “no, it’s not for sex, just for *better dates*” shit is making me think that this wank-clown is either dumb as shit, and doesn’t realize that dating often leads to sex, or he thinks that we’re all idiots and don’t know that.",
              "id": 300,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6013,
      "content": "Seeing as the information on your list are things that a guy should put in the effort to learn from the girl, face to face, not a cheat sheet… this is creepy. If I was approached by a guy who knew a bunch of stuff about me, I’d be suspicious too. Why? Because why would you want to impress me? Likely because you want to get in my pants. If you had good intentions to date me and get to know me, the cheat sheet you made would be irrelevant since the fun is in going on dates and finding out who I am first hand. Instead your Pokédex (which by the way is kind of an insult unto itself “gotta catch them all” *barf*), is bordering on stalker level creepy and sad-level desperate. \n\nWAIT! But then you shared it with others?! Ok so now you’ve created a legion of creeps who, instead of having the courage to talk to these girls themselves, have a sheet and they can pretend to be into the same things so that maybe they’d have a shot with them?!… not only are YTA, but in you making this AND sharing it, it’s such a red flag. Compounded by the fact that you see nothing wrong with making it and sharing is a red flag showing your lack of compassion, empathy and self awareness… because at the end of the day, the vibe doesn’t check out, the Pokédex would make any normal, sane woman feel unsafe.\n\nYou’ve systematized the getting-to-know you phase of a potential romance. Quite frankly, in you doing that, you’ve robbed yourself and your bro-gang the chance to develop genuine connection (read chemistry) with someone which is half the fun of getting to know a potential new date. Here’s the kicker, on some level, you KNOW that women love feeling seen and someone getting to know them… but this is supposed to be a natural process that comes from spending time with someone. So when he’s faking that phase because of joke Pokédex and she finds out, the entire experience is marred and ominous because he was being disingenuous about connecting with her. This is the lack of empathy, therefore it is creepy, which leads to feelings of unsafe. Good luck man…. you’ll be wanting to change schools. No way the news of this won’t spread like wildfire amongst the women at your school.",
      "id": 301,
      "comments": [
        {
          "score": 1258,
          "content": "Sums it up perfectly. The lengths that some men will go to to avoid having to treat women like **people** instead of things!",
          "id": 302,
          "comments": [
            {
              "score": 17,
              "content": "Exactly! We're not toys for you to enjoy with a rigid set of instructions until you get bored of us.",
              "id": 303,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 940,
          "content": "No girl at that school will want to talk to OP, let alone go on a date after that.",
          "id": 304,
          "comments": [
            {
              "score": 321,
              "content": "Yup. He’ll be labelled and excommunicated",
              "id": 305,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 180,
              "content": "Fortunately for him, there's not some kind of INTERconnected NETwork of users sending messages out there that allows information to be spread quickly via some electronic device in their POcKEts, filed in an inDEX, containing all their names, so all the women at school know which guys to avoid. \n\nIf I were him, I'd hate to live in a society where that is possible.",
              "id": 306,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "I hope you are right.",
              "id": 307,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "not just OP but any guy associated with him, so the whole fraternity and probably anyguy who goes to the same university. I certainly wouldn't take my chance and date a guy in the same university if a guy like him did that to us.",
              "id": 308,
              "comments": [
                {
                  "score": 20,
                  "content": "Lol I'm now imagining any guy at that university who tries to ask a girl out being like: \"Don't worry, I don't know your favourite colour or favourite sweets yet, I've never spoken to THAT GUY.\"",
                  "id": 309,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 120,
          "content": "This is all 100 percent true and reminds me of mark Zuckerberg’s “hot not hot” predecessor to fb I gotta say. Fb and it’s origins are gross.",
          "id": 310,
          "comments": [
            {
              "score": 17,
              "content": "I was going to mention this too!!!! Very early Facebook vibes",
              "id": 311,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 95,
          "content": "I could tell he was referring this to a Pokédex as an attempt to diminish the seriousness of his actions. Too bad it reveals another problem: he has dehumanized us to the point that we are a LITERAL GAME! A point in a game of the trainer collecting as much Pokémon as they can to be superior over others. We’ve literally been reduced to animals in a fantasy world and he thinks that it was humor to shield severity.",
          "id": 312,
          "comments": [
            {
              "score": 16,
              "content": "It is also one of many indicators that he saw this as him making a kind of walkthrough for dating. As though you just have to shove certain sweets into a woman's face and answer questions in a certain way to score with real women. This guy has played too many dating games and I hope he likes them, because I don't think he will have a real relationship any time soon.",
              "id": 313,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "Exactly. On a date, I want to see if a guy and I are genuinely compatible, not to be “impressed” by some carefully choreographed routine informed by my preferences. If a man wants to plan a date and make sure we go somewhere I'll enjoy, it's really not that complicated: he can ask me what I like.",
          "id": 314,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Sharing information like OP is definitely a red flag for invasion of privacy. I worry there might be a potential predator within those 40 guys that has information on them. \n\nThis is definitely a safety issue. OP can be in hot water if something bad happens",
          "id": 315,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Agreed. And OP better be ready for someone to tell the Panhellenic Council, the Dean of Students or the student newspaper about it because there will likely be repercussions for both him and his fraternity if that happens. Even if Greek life or the school end up not being able to do anything because it somehow doesn’t technically violate anything, I bet a student reporter would still love this story. This guy, and anyone else associated with the list, will be screwed. \n\nSo, let me add my YTA here and say this guy better pray this doesn’t haunt him in some big ways.",
          "id": 316,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "He especially lost me at \"simping for\". That's A-grade incel speak there!",
          "id": 317,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "Well said! Hats off. 👏👏👏\nTo OP and his buddies: coming from an older dude who's currently happily married to a wonderful woman (this is where you want to be later in life): women are human beings that you need to treat with respect, if you do that, you can get to experience a deep connection beyond anything you've currently experienced in your life (or so I would assume). Getting to know a woman or another person can be a wonderful experience - don't ruin it by writing creepy dating manuals. Realize that you're young and try to recognize this as an opportunity to learn from your mistakes. Learning to accept that you can be wrong, to admit it, and learning from your mistake, is a skill that will also benefit you greatly later in life.\n\nI'm sorry if I sound patronizing, I don't really mean to be. I don't want to excuse your pokedex, but people make mistakes - our assignment in life is to realize this and reflect over it and learn from it, become a better person. For in becoming a better person, your life will also be much better for you. Good luck, man! 😊🙏",
          "id": 318,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "This!! It's perfect!!",
          "id": 319,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4855,
      "content": "Yep...YTA.\nIf it was for yourself then you could possibly get a pass depending on the information. But the fact you shared it around and allowed others to edit and use it. That alone makes YTA",
      "id": 320,
      "comments": [
        {
          "score": 2067,
          "content": "And while he claims it's not for nefarious reasons the reason is obvious, how to get a girl to sleep with you and what you need to say and do. That's the definition of nefarious and creepy. Yta\n\nEdit, I can't believe I never thought of this right off but good money says OP calls it a pokedex because you gotta catch em all, and more than one person uses it to keep score making it even more disgusting.",
          "id": 321,
          "comments": [
            {
              "score": 671,
              "content": "Yes. And why not (*gasp*) just be yourself and see if she likes the actual *you*.",
              "id": 322,
              "comments": [
                {
                  "score": 266,
                  "content": "Niceguys™ incoming",
                  "id": 323,
                  "comments": [
                    {
                      "score": 27,
                      "content": "Once I saw op use \"simping\", I stopped reading. Case closed.",
                      "id": 324,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 186,
                  "content": "Because the real him is someone who views talking about interests as \"sappy shit\".",
                  "id": 325,
                  "comments": [
                    {
                      "score": 142,
                      "content": "And crushing on someone as “simping for.” Disgusting.",
                      "id": 326,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 147,
                  "content": "Nahh that shit *totally* only works in the movies. /s",
                  "id": 327,
                  "comments": [
                    {
                      "score": 205,
                      "content": "I was actually thinking that this sounds almost like a rom-com plot. Dude creates list of how to get various girls at school, guys love him for it, he loves using the list himself. Then one day he meets a girl he can't categorize, on whom the tricks don't work, and he just has to have her. Yada yada yada, fall in love.\n\nThe thing is, taking dating strategies from rom-coms is a terrible idea IRL because, case in point, it's freaking creepy",
                      "id": 328,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 322,
              "content": "Yeah, congratulations, OP! You get to be the dude that the girls remember as \"that creepy guy I went to college with\". I would feel so disgusted if I were one of those girls.",
              "id": 329,
              "comments": [
                {
                  "score": 21,
                  "content": "He's probably a \"nice guy that got friend zoned\". Imagine thinking you were friends with this guy, only to find out that he's making a spreadsheet, detailing a plan to get in your pants, and sharing it with all his friends.",
                  "id": 330,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 258,
              "content": "How much much do you wanna bet that the “simp” said something to the girl along the lines of “but I know you like pizza!!! You HAVE to sleep with me!! I’m a nice guy waaaaahhhhhhh”",
              "id": 331,
              "comments": [
                {
                  "score": 118,
                  "content": "I bet he got caught knowing something that the girl never told him, so he looked like a stalker. Favorite kind of pizza on a first date, trip she'd taken years ago, whatever. \n\nI'd be creeped the fuck out, and if she pushed to know how he knew,  any guy with an ounce of common sense (which clearly this group doesn't have MUCH of, but still), would rather go with \"there's an index, it shows we caaaaare\" than \"yep, I'll let her think I'm a stalker.\"",
                  "id": 332,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 91,
                  "content": "That or a friend just told her to be careful, she's on this list and all these dudes are talking about her.",
                  "id": 333,
                  "comments": [
                    {
                      "score": 59,
                      "content": "Honestly, if we're treating dating like a game of Pokemon, the obvious cheat code would seem to be \"Hey, just so you know, that creepy guy is sharing personal details about you around the frat\"",
                      "id": 334,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 167,
              "content": "And he started it because he has \"a hard time remembering things.\" Does he have a list for men he wants to impress? One for business networking? One for study groups? One that isn't about \"getting to know girls\"? Or do women just fit so well in a spreadsheet. \n\nHonestly, if this were actually an aide for memory, not a problem. But as it sounds specific to the fairer sex, he's the AH.",
              "id": 335,
              "comments": [
                {
                  "score": 23,
                  "content": "Are there really *that* many favorite colors?",
                  "id": 336,
                  "comments": [
                    {
                      "score": 18,
                      "content": "[removed]",
                      "id": 337,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Yes, that's exactly what this is. I sense a creeper  in the making.",
              "id": 338,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 160,
          "content": "And all the guys that used it as well",
          "id": 339,
          "comments": [
            {
              "score": 117,
              "content": "Yes! The conflict seems to be between OP and the other guys, who are mad at him. So it should really be ESH, since both parties are TA. The girl is not, of course.",
              "id": 340,
              "comments": [
                {
                  "score": 25,
                  "content": "Yes the other guys are just a bunch of hypocrites",
                  "id": 341,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 136,
          "content": "Also... he just re-invented Facebook.",
          "id": 342,
          "comments": [
            {
              "score": 49,
              "content": "The worst thing is its not even Facebook. Its telling he compared it to a game where you capture creatures instead of any dating sim or game that has women as people. \n\nIts literally just a group effort to collect stalk women.",
              "id": 343,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 45,
              "content": "yup this guy sound slike a zuck sort of creep",
              "id": 344,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "“Simping.”\n\nYTA.",
          "id": 345,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "shared it with like 50 other people lmao. so they could bang girls they don't give a shit about, BUT IT'S NOT ABOUT SEX OK GUYS! op said so. \n\nwhat a disgusting post lol.",
          "id": 346,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "Typical frat dudes. You really gotta go above and beyond to counteract the negative stigma of being in a frat and this guy went the wrong way",
          "id": 347,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}