{
  "post content": "I had adopted my older son [7M] about 4 years ago after practically being the only \"dad\" he had around for another 2 years before that. Wife's ex was a POS who left her pregnant and struggling.  For all intents and purposes he is my son, and well he knows about his sperm donor but in his own words, \"that man is nasty, I can't believe he could ever be my father.\" \n\n\nMy parents were less than thrilled that I married a woman who had a child, but (at least I thought) they had adjusted in a short while, and when I adopted him, they also jumped into the role of grandparents. And things were pretty normal for about 3-4 years. \n\n\nWife and I had our second child this year, and at the time of announcing the pregnancy, my mom made an underhanded comment to me in person \"I'm glad you finally saw sense and decided to have your own child.\" I rebuked her quite hard and stated that I'm not going to tolerate any favoritism towards their biological grandchild in front of me, or my children. That she is free to think whatever she wants but she cannot state it to me, or my wife, or my children ever. \n\n\nWell, my parents didn't comply. It started with stuff like forgetting to get my older son a gift when they came to visit, to when outright a while back when we went out for a meal during their Christmas visit, parents stated IN FRONT OF MY OLDER SON, that my wife should pay the tab for her son. To avoid creating a scene right there, I went and paid the entire tab and paid for a cab to take them home, as I didn't want them to be in the same car as me and my wife. \n\n\nAfter we all got back home, I told them that they are free to use their room till their flight day but they should not expect any kind of service from my wife (she handles most of the food) and that they cannot see either of my children. It got me quite an outrage from my extended family, and for the time being I'm myself being low contact with them because the restaurant incident had pissed me off. They also attempted to pick my child up from daycare but I gave strict instructions to not hand our baby to anybody but my wife or me, so it worked out and they left within 3 days. \n\n\nMy brother is on mom-dad's side. I got comments from the trio where they said \"We should've NEVER let you marry her,\" as if it was upto them at all. Being the younger son truly sucks. Anyways, I am currently low contact will all family, and have laid out 3 strict conditions to allow visits again: \"1. A proper apology to my wife, 2. A proper apology to my elder son and 3. NEVER showing any kind of open favoritism again, this includes either buying gifts for them both while visiting or don't buy gifts at all, never making my elder kid feel like they aren't his grandparents, etc.\" \n\n\nExtended family and my brother make me feel like the a-hole for, in their words \"putting a kid who is not even his child before his parents.\" So AITA?",
  "id": 1,
  "comments": [
    {
      "score": 5066,
      "content": "NTA he IS your child, just because you aren't related by blood doesn't mean shite. I would go completely no contact with all of them until they all apologize.",
      "id": 2,
      "comments": [
        {
          "score": 1242,
          "content": " \n\nIt's much better to have no extended family than to have them mistreat you and treat you like shit.",
          "id": 3,
          "comments": [
            {
              "score": 321,
              "content": "they are abusing this child by doing this.",
              "id": 4,
              "comments": [
                {
                  "score": 182,
                  "content": "How can anyone treat a child like this ? Ugh I hate people",
                  "id": 5,
                  "comments": [
                    {
                      "score": 220,
                      "content": "Even my cats are better than this. When I brought a new kitten in, sure, the elder cat growled, but she also groomed him while growling ….",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "I mean, my uncle refused to even acknowledge me for 2 years because my mom had me out of wedlock (I'm 47). I was punished for my mother's choices a lot.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "Call me immature, cold-hearted, or whatever you want but the moment they started mistreating my oldest it would be the end of the relationship for me. NC and no chance they would be back in my life or my family's life. Period. I'm truly disgusted with these people.",
              "id": 8,
              "comments": [
                {
                  "score": 25,
                  "content": "Yup. Op's parents are the type who either will never learn at all. Or will only learn when they lose all contact with their Grand kids.\n\nHalf measures don't do shit with people like that.\n\nTo his credit OP sounds like an amazing guy. Recognizing the behavior and immediately putting his foot down.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Nothing makes me more thankful for my family than posts like this.",
              "id": 10,
              "comments": [
                {
                  "score": 3,
                  "content": "Dude 100% same. My 5 year olds father was barely involved and when she was 3 finally got it through his head it was too expensive to keep violating the court order to try and continue to abuse me, he dipped. My husband is her daddy and his family loves her JUST AS MUCH as their bio grandchild I gave birth to in August. They were freaking OVER THE MOON to get a daughter in law and TWO granddaughters in one fell swoop. My 5 year old doesn't even KNOW what the hell half siblings are. My husband his family and the 5 year old would fight you if you even thought about saying they aren't her family. I didnt get inlaws, I got an extra few branches to my family tree. Posts like these remind me that there are worse things than my in laws overwhelming me because they love me so much.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Especially if the extended family acts this way!",
              "id": 12,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 392,
          "content": "Right? If OP adopted this boy, he literally is OP's son.",
          "id": 13,
          "comments": [
            {
              "score": 243,
              "content": "Even if he didn't legally adopt him, if he willingly took on the fatherly role he's the boys daddy.",
              "id": 14,
              "comments": [
                {
                  "score": 50,
                  "content": "The Yondo quote.\n\"He may have been your father boy, but he wasn't your daddy. \"",
                  "id": 15,
                  "comments": [
                    {
                      "score": 2,
                      "content": "*Yondu. But still applies",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "To me, that's the most important part of all.  An adoption went through.",
              "id": 17,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "No difference between this and genetics. We give either the importance we want, really.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "And they are literally grandparents to both kids.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 285,
          "content": "You're right, but id also add that the grandparents should never be alone with either kid. As soon as the parents are away they'd be showing off their preference for the younger kid, and who knows what awful nonsense theyd spout to the kids.\n\nThey cant be trusted. Cut them out, apology or no.",
          "id": 20,
          "comments": [
            {
              "score": 376,
              "content": "[removed]",
              "id": 21,
              "comments": [
                {
                  "score": 365,
                  "content": "While it is exactly as serious as you mention, I must say that I kept precautions in place and because they acted predictably, I have leverage and evidence to incriminate them if necessary. It was a possibly dangerous situation, which ended with me holding incriminating evidence on their head.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 110,
                      "content": "You took precautions, but the fact that they attempted what would legally be kidnap would make me go with a firm NC.  Your family has proved that they can't be trusted in contact with your children.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 49,
                      "content": "The fact that you or even considering blackmail / leverage is a major issue here.\n\nI work in child safety and I'm not saying this lightly. Something is very seriously wrong with these people. You should never let them see either of your children again regardless of how this plays out. Something is also very seriously wrong with you and your wife that this has been ongoing and you're all thinking like this. You need therapy individually and as a couple. Either you got some serious issues going on or you have let these seriously dangerous people make you toxic as well.\n\nEdit: I said this in a following comment but I want to add it to this as well.\n\nIf you have evidence that someone is committing crimes that make them unsafe to be around a child, you need to act on those, not accumulate that evidence for use at a time that's convenient for you. That would be something that's extremely serious and a safety concern.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Make sure those precautions stay in place wherever your younger child attends daycare/school. Review these plans with any new people. I know you said they flew in, but they can still pop in. It is helpful to have pictures of your parents and brother at the on file.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "This was my greatest concern too.  What were they planning? a little Outing? Or something more serious?",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 61,
              "content": "TOTALLY!\n\nThe parents will spout nosense in front of the kids for years if allowed to stay around them. It will hurt both kids in the long run. I wish my bio dad had protected me like this from awfull blood related people.\n\nOP better keep the no contact between grandparents and the kids, bc it will be awful to have both on the same place.\n\nOP IS THE DAD OF 2 KIDS! The parents and brother can f\\*\\*\\* themselves.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Happy Cake Day! Also, agree that these ppl can't be trusted, not to mistreat an innocent child.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 120,
          "content": "I could never imagine treating an adopted child like less than; you bring them into your family & that makes them family (blood does not equal family). Family is a sense of belonging, familiarity, safety.",
          "id": 29,
          "comments": [
            {
              "score": 54,
              "content": "Most people accept that if you adopt a dog or a cat they become part of your family unit and you love them fiercely. Fewer people seem to accept that if you adopt a child the same thing happens. \n\nOP is absolutely NTA for loving and protecting his son.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "this is more common than you would think. but I bet listening to those people talk you think the child comes first. but the way they act states otherwise",
              "id": 31,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Oh my god yes.  Like he has drawn hard boundaries and they are still acting like their behavior was justified.  They are miles apart on something where there is no compromise.",
          "id": 32,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I don't think any apology can make up for what they already have done and I don't think it could be believed. They can't be trusted not to lie to get access to the baby then behave with continuing abuse on the sly. There's something really wrong with the rest of the family and I don't think they can be trusted around children at all. Also, good thinking on warning the daycare in advance.",
          "id": 33,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I would go NC all together, the oldest son will pick up on their attitude towards him or they will  say things about or to him behind your back.",
          "id": 34,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This, NTA absolutely, but I'm not sure I'd believe the apology of people who 1.) insist that your adopted child isn't your child; 2.) are willing to overtly, intentionally hurt a 7 year old child both in word and deed (younger child gets present; older child doesn't) and 3.) go behind your back and try to snatch your younger child from daycare against your wishes, which is otherwise known as kidnapping.\n\nI mean, if you could get a believable, sincere apology, filled with remorse and newfound insight, maybe...but I suspect this would be a lot like getting blood from a stone.  A stone in the shape of a human heart, but still a stone.",
          "id": 35,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Why does an apology matter? They don't love his older son or see him as a grandchild. He will figure that out even if they bring him gifts and pay for his dinner. The apology would only be so they can see the younger child and as soon as the younger child is old enough to see them on his own, they will cut the older child off.\n\nStaying away is the best option",
          "id": 36,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "NTA.  They've had several years to come around to the fact that he is your son in every way but DNA and they haven't. The birth of your younger child seems to have only exacerbated their feelings and actions about your oldest child. You drew the line in the sand about their treatment of your kids and their response has been to double down about how they see your kids and their actions. Honestly, I don't see them changing their behavior or beliefs about your kids and IF they do start to conform to your rules I don't think I personally would ever be able to trust them with my kids because there would always be the fear about what kind of comments and treatment of the oldest when your not around.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 873,
      "content": "NTA. You are a great dad!",
      "id": 38,
      "comments": [
        {
          "score": 135,
          "content": "Such a great dad! Honestly, this is better for your younger child too; you wouldn't want them putting their vile ideas in his head as he grows. \n\nNTA.",
          "id": 39,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 656,
      "content": "NTA\n\nIf they know the specifics and are agreeing with your parents then they are AH. You do not want your older son to be treated badly by them, and you do not want to raise your younger son to think adopted children are not family.\n\nYou probably have to cut them off because you can't trust them anymore. You would be watching for favoritism, or slights for the entire time any of them are with either of your children.",
      "id": 40,
      "comments": [
        {
          "score": 528,
          "content": ">You probably have to cut them off because you can't trust them anymore. You would be watching for favoritism, or slights for the entire time any of them are with either of your children.\n\n\nI'm avoiding the nuclear option and giving them one chance to correct their wrongs in this case because they were normal grandparents to my elder son before my younger son was born. \n\n\nWife is still heartbroken over the incident though and I'm considering a complete cut off till I get compliance with my conditions. I'm just finding it a bit difficult to cut them off completely but I think I'll do it.",
          "id": 41,
          "comments": [
            {
              "score": 444,
              "content": "Your wife will never trust them again.  And she shouldn’t.  And, even if they make honest amends, she’ll never be the asshole for not liking them or trusting them with her kids.",
              "id": 42,
              "comments": [
                {
                  "score": 367,
                  "content": "Well, it was wifey who suggested extending an olive branch out in case they are willing to treat our kids equally. I inclined more towards going NC early on but have accepted her call in this, if she thinks that they can be given a way out, I'm agreeing with her.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 237,
                      "content": "That’s a very good way of letting her be in the driver’s seat. Yes, you are both the parents of your oldest child. But these are your parents. If the two of you can come together about how to deal with your parents and communicate effectively with each about this, you two will always find the right solution",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 137,
                      "content": "Your wife sounds amazing and like such a sweetheart\n It would have been over for me once they tried to essentially kidnap your kid. They knew they weren't allowed to see him and tried to take him without your knowledge, does the rest of your family know that bit?",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "You also don't have to make a \"forever\" decision now.  Go no contact with everyone - mute texts, reroute emails to a folder etc for a few weeks (check them occasionally if you want to make sure there is no emergency).  Then take stock with your wife - how do y'all feel?  Any desire for contact?  Has there been any true family contrition?  If needed, take some more time before deliberating contact and olive branches.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "You shouldn’t trust them again if only because they tried to pick up your child at daycare without your permission. That is utterly terrifying.",
              "id": 47,
              "comments": [
                {
                  "score": 45,
                  "content": "Yeah no trust involved. The olive branch I'm extending is quite restrictive already. It's so restrictive that I'd be surprised if they take it.\n\n\nMaybe I'm doing mental gymnastics to say that \"hey we gave them a chance, they didn't take it.\"",
                  "id": 48,
                  "comments": [
                    {
                      "score": 14,
                      "content": "As they say, ‘the ball is in their court’",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "> I'm avoiding the nuclear option and giving them one chance to correct their wrongs in this case because they were normal grandparents to my elder son before my younger son was born.\n\nI wish there was some way to help them see the harm that they are creating. They cared once and I would like to think that they haven't suddenly transformed from the people they were into callous monsters. Maybe some sort of therapy could help wake them up? Regretfully, if they can't or won't realize that their behavior is abusive and harmful to both children, then they will have to lose their access to the family.",
              "id": 50,
              "comments": [
                {
                  "score": 69,
                  "content": ">I would like to think that they haven't suddenly transformed from the people they were into callous monsters.\n\n\nIt was rather sudden though. My mom made that ridiculous comment that I mentioned ON THE DAY we announced the pregnancy. \n\n\nIn my son's eyes, they turned from normal grandparents into mean grandparents suddenly.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 31,
                      "content": "I think the fact your son is seeing the situation as it is, while heartbreaking, means you're handling the situation properly.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "And in their own son’s eyes, they turned from normal grandparents to people without grandchildren. \n\nThat is what I would tell them. You are sorry to hurt their feelings but like all good parents, you have to put your children first. Tell them that if they cannot treat the siblings fairly, you will accept that. But their favoritism is equally harmful to both, and you can’t let them hurt your kids. \n\nTell your parents it is better to have no grandparents than hurtful grandparents. Thank them for their honesty and promise to send photos occasionally. And assure them that when the kids are old enough to understand, you will explain to them why they don’t have grandparents.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Makes me want to cry. My niece married a man with 3 children (all under 4 and abandoned by wife). My niece adopted them and my sister treats them as if they don't exist (she has one child of her own who was 4 when she married). My niece told sis she treats them all the same or she sees none.  \n\nSis seemed to comply. Greatniece told my niece that Gramma says she doesn't have to let the others play with Her toys. That was it. Sis doesn't see Greatniece anymore. Her loss. They all are lovely.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "If anyone throws the ridiculous \"blood family\" trope at you, just say \"LOVE IS THICKER THAN BLOOD\".",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I am aware it might sound like too much too early for someone young and healthy, but please consider setting up an ironclad will  and custody emergency plan for you and your wife and the children.\n\nIf something happened to the both of you, leaving the kids, there has to be a plan in place so it's not up to whoever living relatives they might end up going to. \n\nIf your wife has good family, or you have a trusted friend who would be willing, talk to them and put it in writing, with a lawyer, who should take care of and make decisions for both kids. Even if your family agrees to your terms and you increase contact again, you know where their heart lies.\n\nYou are doing great standing behind your sons and wife, and I hope you'll never need it, but with family like that I really recommend setting everything up for a worst case scenario. Working in the hospital we see all sorts of family drama and heartbreak when family is not onboard with what the incapacitated/deceased person wanted/wished for - even single people without kids should have some document in place in case they can't make decisions anymore about their own care lest ignorant family swoops in and is suddenly authorized to decide what they want. No one is too young to have a plan in place. Things happen, and if they don't, you're lucky and will only have wasted some legal fees for some precautions.",
              "id": 56,
              "comments": [
                {
                  "score": 19,
                  "content": "I do have a plan in place for custody in the cases where either I'm incapacitated or both my wife and I are incapacitated. My wife also has a plan in case she is incapacitated. We are working on updating our wills.\n\n\nBasically both our kids will go live with their aunt (wife's sister). She also has 3 kids of her own and her husband is a great person himself, so I trust them with my kids if anything were to happen to me and my wife. That's what's the plan for now.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "All you're asking for is common decency towards a child.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "That's an incredible hard decision. I truly wish you did not have to make it. \n\nYou sound like a great human being, you and your family deserve so much better than what happened to you.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "They tried to kidnap your kid. They knew they didn't have permission to take them but they tried anyway. Go nuclear.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Your parents are proving that sometimes the family that you choose is way more important than the family that you accidentally get by birth. I am appalled by your parents! Your eldest son became less family to them after you had a bio son???? Just unbelievable. Your sons are so lucky to have a dad like you ❤",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "They literally tried to *abduct your child*. They annihilated any chances they had left.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Don't let them be alone with your younger son. They will indoctrinate him to think less of his brother. This is how grandparental alienation works.",
              "id": 63,
              "comments": [
                {
                  "score": 6,
                  "content": "That's exactly what I fear might happen. They won't get unsupervised visits ever even if I allow something.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 259,
      "content": "NTA. As an adoptee who carries the scars of being treated like I wasn’t really part of the family for my entire childhood, all I can say is please continue on course.  It matters.  Much better not to have extended family than to have them abuse and treat you like shit.",
      "id": 65,
      "comments": [
        {
          "score": 47,
          "content": "I am so sorry for the pain you had to endure grown up. Please know that you are a special person. Stay strong and safe.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I experienced this as well.  I am NC with my “parents” and one sister.  One sister I do text from time to time but it’s really only about deaths, etc.  I wish I had gone NC a lot sooner for my own mental health.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 135,
      "content": "NTA - not even close to being the asshole. My brother and his gf are in a very similar position. Just had a baby but his gf has a 7 year old from a past relationship. My brother loves that kid like he’s his own. Baby is just over 1. Comments were made about how they need to get married and comments about how the new baby is their “real” grandchild. \n\nMy brother essentially cut them off after several attempts of communicating. It is so hard for parents to take criticism from their kids. They think it’s okay to not follow rules parents set for the kids because they’re the grandparents. They think cause they’re your parents they still have say in how you should live your life. \nSorry but no- you follow the rules or you don’t get time with either the kids or your son and his wife. \n\nPut your wife and children first. Always. Your family probably thinks they can bitch and moan enough in order to make you feel guilty and admit you’re wrong. Don’t allow it. Stand your ground. Both your babies are your children and their grandchildren. They deserve to be loved equally regardless who the biological father is. \n\nThe rules you set in place to allow future visits are completely fair. I’d tell them they’re your children and that them along with your wife do come before anyone. That’s just reality.",
      "id": 68,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 118,
      "content": ">They also attempted to pick my child up from daycare but I gave strict instructions to not hand our baby to anybody but my wife or me\n\nYour parents are deranged. As bad as treating one child differently because they are adopted is, trying to take a 3 year old from daycare without the parents' knowledge crosses the line into dangerous.\n\nNTA",
      "id": 69,
      "comments": [
        {
          "score": 57,
          "content": "This is grounds for law enforcement and a restraining order",
          "id": 70,
          "comments": [
            {
              "score": 120,
              "content": "Yes they are. I have an email from my daycare rep detailing their attempt to pick my kid up and I have both my call with my daycare rep and my call with parents telling them to back off recorded. \n\n\nBut I'll keep my weapons at bay until they try to show any sort of audacity to sue for grandparent rights or anything. Everything is recorded, compiled and well kept. My wife also has complete access to the record I have kept so that she can use it against them if ever needed. I like to be prepared for anything, so after this shit happened my first priority was to ensure that my wife would have help in case I was incapacitated to do this myself.",
              "id": 71,
              "comments": [
                {
                  "score": 57,
                  "content": "Very very smart planning. It’s hard to think about the what if’s surrounding your passing and yet you did what is necessary to protect your family. You’re a great husband and dad.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 70,
                      "content": "I lost a very close friend to a drunk fucker on the road 2 years ago. Everyone has to go one day, many earlier than others. It's almost always universally better to be prepared for anything that can happen.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Are your wills up to date? Who is the guardian if something happens to both of you? Also health-wise, make sure both kids are covered.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "> But I'll keep my weapons at bay until they try to show any sort of audacity to sue for grandparent rights or anything.\n\nWith all due respect, they already attempted a kidnapping. Going through the courts would be a step *down* from that in intensity.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 2,
                      "content": "This\n\nFrankly, they already made the first step. Waiting to see if they do anything worse potentially endangers the kids.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 90,
      "content": "NTA. \n\n>\"We should've NEVER let you marry her,\"\n\nAbsurd beyond belief.",
      "id": 77,
      "comments": [
        {
          "score": 4,
          "content": "As if they have a say🤣. Bravo OP, for being a kick ass dad. NTA",
          "id": 78,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 62,
      "content": "NTA, you adopted him, he's YOUR SON and THEIR GRANDSON.\n\nIf they can't understand that they can go hang.",
      "id": 79,
      "comments": [
        {
          "score": 7,
          "content": "Exactly. I can't adopt my step daughter, as her bio dad is still around and sort of okish. It doesn't matter.... she is my daughter. \n\nI am blessed that my parents see it the same way. They love my little girl without reservation. OP is NTA. You protect your kids... from everyone even family",
          "id": 80,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 47,
      "content": "NTA at all. But your family members are all AHs. You are saving your older son a lifetime of hurt. Because even if they \"agree,\" your parents will find ways to make sly comments, false comparisons and any way they can thrust their darts.\n\nI would be very surprised if they ever give in. Be aware they will try some feints, because they will want to get to your younger son.",
      "id": 81,
      "comments": [
        {
          "score": 68,
          "content": ">I would be very surprised if they ever give in. Be aware they will try some feints, because they will want to get to your younger son.\n\n\nI set my conditions in such a way because of that. I would be quite surprised if they didn't attempt to bargain on what I've stated down and openly complied. \n\n\nI have the incidents recorded and have some of their mean texts and stuff screenshot and compiled in a folder that my wife knows where to find. I have done this so that in any situation they won't be able to file for grandparent rights.",
          "id": 82,
          "comments": [
            {
              "score": 6,
              "content": "Well done. I am so sorry you are having to deal with this. Awful for your dear wife and innocent children.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 39,
      "content": "NTA\n\nYou adopted him, so he is your child. You responded to your parents behaviour in a brilliant way, IMO. I’m not sure I could have let them remain in my house. Your brother saying what he did too, was absolutely out of line.\n\nYou have done what you have due to their behaviour. Your conditions for allowing them to have contact again seem perfectly reasonable to me.",
      "id": 84,
      "comments": [],
      "relation": "Support"
    }
  ]
}