{
  "post content": "Me and my GF were together for 3.5 years until I found her fucking my brother. After that, I didn't talk to either of them for a year. Our parents have been trying to get us to reconcile and invited us both for dinner at their place. I'm doing much better than I was a year ago, I have a great GF and I've found a very high paying job. I figured that I could maybe salvage a relationship with my brother. My GF didn't come to dinner because she had an emergency at work, so it was just my, my brother, Ex GF, and my Mom. It was going OK until my brother asked if I was seeing anyone. I told him about by GF and he asked why she wasn't here. Here's where I think I may have been the A hole. I said, I didn't want to bring her considering the stat line. He asked me what I meant and I told him that the last time I introduced him to a GF of mine, he fucked her. As it stands, I'm 0 for 1. He got angry immediately and left with Ex GF. My mom scolded me for ruining the attempt at reconciliation. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 16914,
      "content": "Personally..... HAHAHAHAHAHAHAHA. If I’d have been an uninvolved sibling at that table, I would have choked on something and surely died from laughing. \n\nNTA... He had that coming. Was it reasonable in the situation, no. This man and your ex completely disrespected your relationship, and I personally would never tolerate sitting down to dinner with them... BUTTTTTTT.... If you want to have a relationship with your brother, you prolly shouldn’t say things like that. Having said that, I have zero issue with public shaming for shameful actions, and he should have taken that slap with apologetic grace, because what he did to you was unforgivable imho... Getting angry and storming off (because you spoke the truth about your feelings)  instead of owning his mistake and giving you the public apology that you DESERVED, just goes to show you that he’s not sorry for his actions. If your parents want to give you hell for it, share this paragraph with them. They should understand that your brother did a vile thing to family that crossed some very serious ethical lines. \n\nNTA, and mooooooost excellent come-back!\n\nEdit: My first award! Thank you guys!",
      "id": 2,
      "comments": [
        {
          "score": 3327,
          "content": "Dude fuck a relationship with his brother (not literally ofc). A good brother wouldn’t have done such a shitty thing in the first place to OP!",
          "id": 3,
          "comments": [
            {
              "score": 937,
              "content": "Exactly, I could never even do this to even a semi-friend, much less my actual brother.",
              "id": 4,
              "comments": [
                {
                  "score": 531,
                  "content": "Honestly I couldn’t even do this to a stranger, I would have to really hate someone to sleep this there gf of 3+ yrs.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 203,
                      "content": "Exactly. his brother is a poor excuse for a brother. I feel for OP, hope he's alright.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 182,
                      "content": "Yeah that's really insane, I have no idea how I'd be able to go to family holidays and see my sister there holding hands with my ex of three/four years. Even if I had broken up with that ex before they got together I don't know if I could forgive her doing that to me, OP has amazing maturity for even agreeing to this dinner at all. The parents should have been smart and not had the ex girlfriend there at the table, the two brothers need to be able to communicate freely and work things out between the two of them first (if at all..)",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "Makes you wonder how long they were carrying on this affair behind OPs back.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 416,
              "content": "Good parents would not have been ok having the ex girlfriend to their house for dinner with OP.",
              "id": 9,
              "comments": [
                {
                  "score": 200,
                  "content": "NTA.  Honestly, whether you forgive your brother or not, I'd never let him live it down.  Half the world is other women, and he had to fuck your girl?  I'd fuck with him the rest of his miserable life.\n\nWhy did your parents even allow your skanky ex through their door?  Where is her shame?",
                  "id": 10,
                  "comments": [
                    {
                      "score": 124,
                      "content": "Her shame? She has none. She feels powerful because she was wanted SO MUCH by his brother that she broke up a family. She has no shame. She’s freaking proud of herself. Gross.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "RIGHT!!! that’s what I’m saying, definitely NTA, I couldn’t believe what I was reading when OP said the brother AND the Ex were there! I definitely would’ve said the same thing maybe a little more lol",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 66,
                  "content": "If any of the siblings in my family slept with/ stole another's spouse my parents would probably disown them not expect a civil dinner",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 65,
                  "content": "When reading the ex was there I actually stopped reading and said slowly, \"What the f---!?!?\"\n\nTalk about a foul. The OP showed character and poise up until that point. But once the brother decided to throw out the trigger question, (95/5 was an obvious shot) the gloves are off.",
                  "id": 14,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "I have two boys and if one did this to the other, they would have to do some serious sucking of their brother's balls (metaphorically) before they could be allowed back in my house.\n\nIf the skanky ex-gf has the audacity to also show up, I would yeet her into orbit.  \n\nUnless there's more to this that we don't know about, OP\"s parents have totally failed on this one.",
                  "id": 15,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "This. So this.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 107,
              "content": "And if they did, they'd be unrelenting remorseful and apologetic. Storming off like a brat, as the previous poster said, clearly shows he is not. Any reconciliation in this situation would have to involve the wrong doing side accepting full blame and responsibility. This kid isn't ready for that.",
              "id": 17,
              "comments": [
                {
                  "score": 143,
                  "content": "Fr and why is OP in trouble? I wouldve been like \"so he can fuck my gf and its fine but i make a joke and I'm the AH? Nah fam you got it twisted",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "I think everyone is glossing over the fact the ex that cheated on him was at the table. If I was looking for reconciliation the last person I would bring to dinner was her. That just felt so tacky and rude. Initially it should have been just the family and eased their way into a relationship if OP felt like his brother was truly sorry, which he obviously doesn’t seem to be.",
              "id": 19,
              "comments": [
                {
                  "score": 10,
                  "content": "Yeah it seems more like the mom’s attempt and a reconciliation.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": ">Dude fuck a relationship with his brother (not literally ofc).\n\nI mean knowing the brother it's prob too late he likely already fucked it",
              "id": 21,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "I’ve been in a similar situation in the past. And yeah I agree, OP is NTA.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "My friend's sister slept with my friends fiance. And they're still practically best friends somehow. My friend says it saved her from marrying an asshole, which it did, but I don't think I'd be able to get past it myself.",
              "id": 23,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Good thing you specifically mentioned not to literally fuck it, his brother might have tried.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 266,
          "content": "Any apologies his brother makes is basically just a formality considering he is dating the exgf, like he clearly doesn't care about ruining the relationship and just expects his brother to be ok with him dating the girl he dated for 3.5 years before he got cheated on.",
          "id": 25,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 163,
          "content": "[removed]",
          "id": 26,
          "comments": [
            {
              "score": 90,
              "content": "They walked into that one so hard, you can't help but laugh.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 157,
          "content": "Brother won't regret having her as his beloved until she screws some other guy, so apologizing for all this probably isn't in the cards until then.",
          "id": 28,
          "comments": [
            {
              "score": 89,
              "content": "OP needs to warn his cousins",
              "id": 29,
              "comments": [
                {
                  "score": 52,
                  "content": "Nawp... let the brother learn the lesson the hard way.",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 107,
          "content": "If brother never apologized and never tried to make things right (I’m not sure what that would even look like) then these comments are completely justified and he has every right to keep them coming until brother repairs the damage.",
          "id": 31,
          "comments": [
            {
              "score": 60,
              "content": "I feel like the only way to make things right would be to break up with her and then try to make amends. How can he expect to bring the person who was such a serious gf that she was basically a SIL to all their family holidays in the future? This is almost as bad as dating your mom's ex husband and then expecting everyone to welcome them at thanksgiving. There are a lot of people out there to date, he can move on and find a new partner just like OP did.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Agreed. I feel like OP is a bit of an AH, but I see their point.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I agree completely, I worry though what does that mean for the current gf? I almost feel like it would make her relationship with the op secondary (no one likes to feel second choice). Though I don't disagree about comments and what not.",
              "id": 34,
              "comments": [
                {
                  "score": 9,
                  "content": "First and foremost OP would have to consider girlfriends feelings so that may mean not making comments when she’s around that would make her uncomfortable. Or it might mean making comments towards girlfriend when brother is around that is a compliment for her but insult to him.   \nThanksgiving- I am thankful for (girlfriend’s name) and our solid relationship that has shown me not to give up on trusting people. Love you babe.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 97,
          "content": "I see it more like the brother having to work towards being in his life and not the other way around.\n\nI’d make uncomfortable jokes for life. Can’t take it? Don’t be a dickhead in the first place.",
          "id": 36,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "First of all, op is NTA and secondly he is my hero at the moment. Bravo! You couldn’t have it better. \n\nI honestly can’t imagine my brother doing that to me, mostly because we have wildly different taste in women, but if he did I don’t believe I would consider him my brother after that. You make choices in life and have to live with the consequences. I don’t believe “but they’re family” is a good excuse for most things, and this certainly doesn’t fall in that catagory.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I want to piggy back on this comment, mostly cause I agree with every word! \n\nIf they really wanted yall to meet up and make up, why is the shady ex even involved in the dinner? Obviously she couldn't leave your brother alone when you were dating her but damn. How are you supposed to not say some stuff when she is in your face? She couldn't stay home.. just once? It had to be a bit awkward.",
          "id": 38,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I 100% would have snarfed my drink.",
          "id": 39,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I don’t get why the bro felt he had any right to get mad and leave. He deserved it; he should’ve stayed and taken it.",
          "id": 40,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4658,
      "content": "NTA. \n\nFor you to reconcile it is necessary to \"normalize\" what happened. If you act like it didn't, it will blow up in your faces. \n\nAlso, did your brother ever tried to apologize to you?",
      "id": 41,
      "comments": [
        {
          "score": 3565,
          "content": "He did but it was more of a \"Sorry it happened like this\" and wouldn't take responsibility for what he did. He pretty much acted like it was out of his control.",
          "id": 42,
          "comments": [
            {
              "score": 1630,
              "content": "That’s not an apology, what he said was a vague imitation of an apology most likely said to appear contrite.  It’s bs, is what it is.",
              "id": 43,
              "comments": [
                {
                  "score": 445,
                  "content": "That and \"I'm sorry you feel that way\" are the worst non apologies",
                  "id": 44,
                  "comments": [
                    {
                      "score": 194,
                      "content": "\"I'm sorry you feel that way\" is a great retail apology though. The customer gets the 'sorry' they want yet the employee never actually admits fault.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "In defense of \"I'm sorry you feel that way,\" when it is said sincerely at least it acknowledges that the person making the apology understands you are upset about even if they do not regret that course of action. Admittedly it is rarely said with sincerity.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "That's about 1 level below \"I am sorry if you're offended\"",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I've done the I'm sorry you feel that way a lot. But I'm not sorry for most of the bullshit people want me to apologize for. Sometimes, it is used because the person demanding an apology is being ridiculous.  \n\n\nbut here, it's ridiculous the brother is acting as if he's owed something after what he did. And furthermore, how the mother allows him to bring the 2.5-years-left-gf over.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "\"I'm sorry you feel that way\" isn't meant to be an apology. It's basically a \"polite\" way of telling the person that they're the one in the wrong and to fuck off",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "\"I'm sorry you feel that way\" is a godsend in my relationship with my mentally impaired FIL. If I tell him when lunch is, he'll respond \"I know nobody likes me!\" \n\n\"I'm sorry you feel that way\" acknowledges his feelings without getting into the weeds about his alternate reality and allows us to move forward.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 436,
              "content": "Out of his control?? it’s not like he accidentally fell into her then out and then back in again.",
              "id": 51,
              "comments": [
                {
                  "score": 1006,
                  "content": "He said \"I didn't mean to hurt you\" and I was like, \"so you planned to come to my apartment when I was at work, fucked my GF in my bed, and then was like, oh shit, my brother might not like this.\"",
                  "id": 52,
                  "comments": [
                    {
                      "score": 186,
                      "content": "I'm sorry that shit happened to you man, but the silver lining is that you're a funny as hell storyteller.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 62,
                      "content": "Wow dude. Yeah, I'm out on reconciliation knowing those details. This was premediated and the guy clearly doesn't give a fuck about you. You don't owe someone a relationship just because you came out of the same vagina.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 47,
                      "content": "While the location of the fucking technically is a minor issue compared to the fucking itself, the fact that he came TO YOUR HOUSE and fucked YOUR GF in YOUR BED is just the shittiest icing on this \"your brother is an asshole and a terrible person in general\" cake",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "If he didnt mean to hurt you he and your ex should have approached you together, explained they wanna start a relationship and given you the opportunity and grace to come to terms with it. \n\nInstead he snuck into your house and fucked your woman in your bed. \n\nThats as close to intentionally trying ro hurt you as you can get.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "That is so dark, I really can’t understand pushing for a reconciliation without a proper apology from your brother.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "He had sex with your girlfriend in your home in your bed?\n\nI’d never talk to either one of them again.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "You're better off without the family drama, enjoy your life",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": ">Our parents have been trying to get us to reconcile and invited us both for dinner at their place.  \n\nWait. He hasn't even apologized, has shown ZERO remorse, has taken ZERO responsibility for the hurt he's caused, and made NO attempts at making amends in any meaningful fashion.\n\nWhy exactly do your parents think that YOU should be trying to make any effort at reconciliation? He should be bending over backwards begging your forgiveness with an actual apology that actually take full responsibility for his disgusting behavior.\n\nYou're NTA - and kudos for thinking quick on your feet with a masterful comeback. \n\nYour parents seem like HUGE AH for being so willing to just let your brother off the hook. While they MAY be parroting phrases like \"we're not taking sides\" and \"you and your brother need to work it out,\" they are, in fact, taking sides - his side. They don't have to cast him out of the family, but what, if any repercussions were there for him? \n\nAs far as it goes, it sounds like everything has worked out fine for him. His parents accept his disgusting behavior. They welcome your ex-gf with open arms into the family as his new gf. \n\nOf course he hasn't apologized. Everything is coming up roses for him...",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "\"I didn't mean to hit you in the face with this 2x4 either, but here we are.\"",
                      "id": 61,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "My fucking sides lol",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Scrubs reference?",
                  "id": 63,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Oh yes",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 85,
              "content": "That's not an apology, it's trying to sooth his own guilt for stabbing you in the back.",
              "id": 65,
              "comments": [
                {
                  "score": 12,
                  "content": "I think you mean \"for stabbing your girlfriend in the...\"",
                  "id": 66,
                  "comments": [
                    {
                      "score": 5,
                      "content": "*grin* That too.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 60,
              "content": "Right because he was forced to sleep with your ex. 🙄",
              "id": 68,
              "comments": [
                {
                  "score": 66,
                  "content": "She tripped and fell in his dick apparently, in OP's bed, while OP was at work",
                  "id": 69,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Repeatedly.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 41,
              "content": "“Sorry it happened like that” like it was completely out of his control lmao",
              "id": 71,
              "comments": [
                {
                  "score": 54,
                  "content": "I accidentally came to your home when I knew you would not be home, got naked, slipped and my dick fell into your GF---and that is how you found us.  And in the year since, it keeps happening- I don't know how. /s",
                  "id": 72,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "That always blows me that people think \"it was out of their control\". No a fucking tornado is out of your control. Falling onto a dick or into a vagina is not out of control, shit there is coordination there!!! So its very deliberate.",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "That's a load of BS.  \n\n\nIt's not something that happens by accident. There's a conscious choice in it.",
              "id": 74,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "So....what he tripped and fell into your ex???? Yeeeeeah right NTA\n\nKeep the digs commin!",
              "id": 75,
              "comments": [
                {
                  "score": 2,
                  "content": "She got naked, tripped him and got his clothes off, got him hard and got under him on the way down. She's real fast!",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "That's not an apology\n\nHe might as well just have said 'Sorry you found out'\n\nNTA",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Well you know, he was walking around with his pants down in your apt, when he just happened to trip onto your bed, and then your ex also tripped onto him when she went in to check on him, and she also happened to have her pants down too.\n\nIt happens. Ask the Saudis.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 30,
          "content": "[deleted]",
          "id": 79,
          "comments": [
            {
              "score": 67,
              "content": "That's true, but brother didn't even apologize! It's hard to forgive or move on when the other person hasn't given you much of a reason to.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "I think this was more seeing if he could get mom to shut it about things.  He was NOT ready.  And that is ok- mom needs to back off- her one child is a raging asshole, and she is enabling it, making her one too.  The non-asshole kid gets to decide when and IF he can get past it- she has no say. But I do think he was more trying to please mom and just could not, vs actually being ready.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "NTA. the brother and ex need to own their crap first and make a sincere apology each to OP, that's were mom, bro and ex have gotten it all wrong. mom should know better.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I think if the brother wants to reconcile, he needs to own his fault, and that includes accepting the joke at his expense at the reconciliation dinner. What brother should have said: \"I deserved that.\" Followed by a change of subject, and letting the reconciliation (and the dinner) stay on track.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2415,
      "content": "NTA. I rate this a 10/10 for wit and a 10/10 for your delivery. He had it coming.",
      "id": 84,
      "comments": [
        {
          "score": 506,
          "content": "Absolutely. If I had been the father, I would have taken the brother by the scruff, dragged him to the table and told him \"Nope, you f*cked his girlfriend, the last thing you can do is to endure a couple of jokes\".",
          "id": 85,
          "comments": [
            {
              "score": 110,
              "content": "As sibling ribbing goes, that's extremely tame. The brother needs to grow a pair.",
              "id": 86,
              "comments": [
                {
                  "score": 23,
                  "content": "Yeah, my sister and I have said much worse over much less and nobody has run from the table over it",
                  "id": 87,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I'm guessing he already had a nice pair considering the first girlfriend...",
                  "id": 88,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 187,
          "content": "Agreed - he fucked his brothers girlfriend; it's been ONE YEAR; a pretty  mild joke about it is *entirely* in bounds.",
          "id": 89,
          "comments": [
            {
              "score": 39,
              "content": "Especially as it was funny NTA",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "He had it coming. He had it coming. He had only himself to blame.",
          "id": 91,
          "comments": [
            {
              "score": 27,
              "content": "If you’d have been there. If you’d have seen it. I betcha you would have done the same.",
              "id": 92,
              "comments": [
                {
                  "score": 10,
                  "content": "r/UnexpectedChicago",
                  "id": 93,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I wish I had points to give you an award for this comment. Seriously he had it coming. Personally I wouldn't even consider reconciling with him unless he was no longer with ex-gf. Clearly he gives no f\\*\\*\\*s about what he did to his brother so why bother trying to reconcile with him.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1599,
      "content": "NTA that’s hilarious honestly. Have either of them even apologised?",
      "id": 95,
      "comments": [
        {
          "score": 1321,
          "content": "My brother kind of apologized. It was more of a \"I'm sorry it happened like this\" instead of really taking responsibility of what he did to me. Ex GF has made no attempt at an apology",
          "id": 96,
          "comments": [
            {
              "score": 601,
              "content": "Goddamn, the audacity. I’m glad you’re in a better place in your life, but salvaging this won’t come unless he owns what he did face first. Good luck.",
              "id": 97,
              "comments": [
                {
                  "score": 186,
                  "content": "And as long as he's with the girl. Someone needs to tell brother that if she cheated with him, she'll cheat on him.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 157,
                      "content": "Let him find out for himself. Maybe they have a 3rd brother? Maybe theirs a sister and the cheating ex is bi? Families are complicated",
                      "id": 99,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 109,
              "content": "Screw them and your mom shouldn’t even allow that woman into her home least of all expect you to sit and have dinner with them.\nYou did the right thing",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "When she inevitably does the same thing to your brother and he wants to commiserate with you, just laugh and shut the door in is face.",
              "id": 101,
              "comments": [
                {
                  "score": 16,
                  "content": "Yep, it’s going to happen. She’s not loyal. Brother thinks he “won” because the Ex is with him now, but he’s with someone capable of betraying her SO in such a disgusting way with a *sibling* so best friends, coworkers, roommates are not off limits..\n\nIf they cheat *with* you, they will cheat *on* you! And it will be, “Sorry you got hurt OP’s brother!”",
                  "id": 102,
                  "comments": [
                    {
                      "score": 2,
                      "content": "She might try for the brother's boss.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "In your post when you said you caught your brother fucking your gf I thought that was the end of it. \n\nI did not think she *was still dating him* what the fuck?! How the fuck are your parents ok with that?! What in the actual flying fuck kind of family do you have?!",
              "id": 104,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "Omg, you're even less NTA. You're a goddamn saint IMO.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yeah there's got to be a real apology if there's going to be any reconciliation. Your mom absolutely should not have invited you ex to that dinner, it was inappropriate. Your brother was prying to see if you were \"over it\" and they need to own up to what they did if they actually want a relationship with you. At this point, just be vaguely polite to them at larger family events",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "A) NTA. B) If it makes you feel any better, chances are she's not going to be there forever. If she doesn't think she did anything wrong, there is literally nothing stopping her from screwing over your brother when it suits her. (pun intended.) Of course, when that happens, you'll have to decide whether to rub it in his face or be the bigger man and try to move on, not a decision I envy you needing to make. :D",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 949,
      "content": "Nta your mom is definitely playing favorites I know I’m not an adult yet but if my son messed around with my other sons gf while they are in a relationship I would cut him out so fast because he disrespected someone else’s relationship. You need to show your parents this post after it unanimously gets voted nta",
      "id": 108,
      "comments": [
        {
          "score": 322,
          "content": "Right??? Even the fact that mother had the ex over for the 1st reconciliation attempt. It should have just been the brothers.",
          "id": 109,
          "comments": [
            {
              "score": 136,
              "content": "I have 1 sister (I'm f too). If one of us had done this to the other, mum would be angry, disgusted etc... with the one who'd hurt the other sister and wouldn't speak to her for a long time. But the ex/new bf would NEVER get in her house again.",
              "id": 110,
              "comments": [
                {
                  "score": 10,
                  "content": "Oh definitely. I have 2 daughters, and if heaven forbid something like this were to happen the mama bear in me would come out with claws. I mean hopefully it never will because I am doing my best to raise little humans with morals. But...",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Agree. The fact that it’s somehow acceptable to her that brother is still with ex GF is mindboggling enough, but to actually invite her to be there. And for basically the first time they’re speaking in a year as well. \n\nAnd it suddenly sunk in as well: OPs current girlfriend was intended to be there as well. I can only imagine the levels of awkward for her in that situation 😬. I mean, meeting your partner’s ex for a lovely home-cooked dinner at MIL already doesn’t sound like the most appealing prospect normally. When it’s partner’s cheating ex who’s currently fucking his brother... yikes!",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "If this would have happend between my brother and me my parents would never accept it, it it were to happen to my daugther and futer child it would never be accepted.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "That's where I'm stuck. Why was the exgf even there?!?!",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "YES! The fact that she allowed such a skanky tramp at her dinner table for a familial reconciliation just chaps...",
              "id": 115,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "You don’t have to be an adult to see the parents are blatantly playing favourites and trying to sweep everything under the rug.",
          "id": 116,
          "comments": [
            {
              "score": 3,
              "content": "Yeah I know right",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "THIS. My parents would fucking disown someone",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I thought the same thing and I am an adult with a toddler child. I really want to know why the parents are so chill with Ex GF suddenly dating their other son.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Have you considered the possibility that if it was OP that did it, rather then his brother, she would have acted the same way?",
          "id": 120,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 581,
      "content": "Oh my gosh. \n\n“It was going OK until my brother asked if I was seeing anyone.” \n\nWhy on earth did he ask that on your first dinner together?! Considering what happened?! Considering he’s there and so’s your ex and you’re there alone? Either it would bring up bad memories or it’d be salt in the wound - or just, the gall?!\n\n“I told him about by GF and he asked why she wasn't here.” \n\nWhy didn’t he drop it?! Why wouldn’t he just let it be, say congrats, he’s happy you’ve managed to move on, and that he’s sorry? Why on earth would a neutral third party want to be there anyway?\n\n\n“I said, I didn't want to bring her considering the stat line.”\n\nNot the a-hole in my book. 😂Even without prodding, I feel like a (verbal) punch at him, considering everything would have been reasonable. I don’t even think what you said was that bad? \n\n“He asked me what I meant.” \n\nIs he dense? I don’t know what the stat line is, but I still know what you said. \n\nNTA, lol, but yeah, maybe keep relationship talk off the table if you have another dinner.",
      "id": 121,
      "comments": [
        {
          "score": 139,
          "content": "Right, I never heard the phrase before but using my context clues I laughed",
          "id": 122,
          "comments": [
            {
              "score": 35,
              "content": "It's the statistics of a basketball player after a game. Brother's stat line is, Other Family Members' Girlfriends Screwed, 1.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 98,
          "content": "Based on what we know of the situation, I'm sure ex-bro was trying to make a dig at OP. The fact that he doubled down on it proves that he's an unrepentant asshole, and clearly not interested in salvaging any relationship with OP (also clear by the fact that he's still with OP's ex).",
          "id": 124,
          "comments": [
            {
              "score": 92,
              "content": "This is what I think, too. The brother was being a huge jerk by asking why the girlfriend wasn’t there, *implying that he doesn’t think the girl exists* so he can feel like a real badass. Stole his brother’s girlfriend and ruined him so bad that he has to lie about about being in a relationship. He left then because he was so thoroughly roasted that he couldn’t come back with any other sly remarks. \n\nI applaud you, OP! NTA!",
              "id": 125,
              "comments": [
                {
                  "score": 23,
                  "content": "More like he asked why she wasn't there to imply his brother is now afraid to bring girls around such a \"ladies man\". What a douche. Karma from fucking your brother's long term girlfriend must be something scary.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Nah, he just wanted to try and fuck this one too.",
                  "id": 127,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "That was my first thought... why tf would the brother ask that",
          "id": 128,
          "comments": [
            {
              "score": 24,
              "content": "To make himself feel better about hurting his brother. If OP started talking about his new girlfriend then the brother can just tell himself “See? No big deal, it’s all in the past.” \n\nFuck that",
              "id": 129,
              "comments": [
                {
                  "score": 2,
                  "content": "But what if he didn’t have a new gf, then it would be like rubbing it in",
                  "id": 130,
                  "comments": [
                    {
                      "score": 5,
                      "content": "He probably knew so that is why he asked. Now he looks like a “good guy” in front of Mom",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "His brother probably asked that because id OP has anew girlfriend he can act like past bad behavior is irrelevant now.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Seriously. Guy had all the opportunities in the world to try and relate to his brother man to man, then chooses to walk face first into something he knew would cause the past to come up and cause hurt feelings.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 340,
      "content": "NTA, HAHAH that's a good one, love the audacity ur mum has for trying to fix a  relationship between ur brother and then allowing the girl that cheated with him to come too, like it's like she jsut accepted their relationship, did either of them face any consequences?",
      "id": 134,
      "comments": [
        {
          "score": 120,
          "content": "Mom want OP to just suck it up on all fronts to  make things easier for her, without bro and gf doing any work. I'm glad OP took the opportunity bro presented to him. NTA.",
          "id": 135,
          "comments": [
            {
              "score": 37,
              "content": "So true loving the fact that mum wants to make her life easier by essentially disregarding hw the other son is feeling",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 339,
      "content": "NTA - You're allowed to feel betrayed by them, they don't have the right to demand that you be civil.",
      "id": 137,
      "comments": [
        {
          "score": 75,
          "content": "I think he was civil, considering the circumstances...\n\nNTA, OP",
          "id": 138,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 247,
      "content": "Wait they cheated and still stayed together...idk why but hearing that always just makes my blood boil. Idc if “that’s your soulmate” or “true love” just no the fact your brother can be like “oh we met by my brother, they were together but we fell in love and forced them to break up :)” NTA",
      "id": 139,
      "comments": [
        {
          "score": 104,
          "content": "I’m more baffled the mom has a relationship with the cheating ex girlfriend. WTF?! She clearly has no respect for OP.",
          "id": 140,
          "comments": [
            {
              "score": 48,
              "content": "That's what I don't get. Someone cheats on one of my kids, they are no longer welcome in my house.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "The whole family wants OP to be a cuckold.  Fucking weird, but probably the ultimate dream of some cuckolds out there.",
              "id": 142,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "Seriously! What happens if they were to have kids and the kid asks how they meant? “Well mommy was uncles girlfriend first.”",
          "id": 143,
          "comments": [
            {
              "score": 10,
              "content": "I had friends growing up who’s mom was married to their dad’s brother first. Their half sister is also their cousin.",
              "id": 144,
              "comments": [
                {
                  "score": 5,
                  "content": "I know someone who's dad married her mother's mother (so his MIL). It meant that her nan was also her step -mother. Her half-sister was also her aunt or something.",
                  "id": 145,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "How did they feel about it?",
                  "id": 146,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I don’t think they cared. Their sister/cousin was much older, when we were in high school, she was already married with a kid. I think the consensus was that the first husband/uncle was a jerk, but it was so long ago, I don’t remember all the details.",
                      "id": 147,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "I prefer it, when they at least stay together and it wasn’t „just“ for sex. Also cheaters deserve each other and shouldn’t be with other people to hurt them",
          "id": 148,
          "comments": [
            {
              "score": 6,
              "content": "That's what I was thinking as well. At least the cheating wasn't meaningless",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Like... Yall couldnt have sat a man down and explained yourself? He had to find you two together IN HIS BED?!?!?!?\n\nId never speak to him or anyone else who accepted him again.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Isn’t kind of better that they are still together? Like maybe there was more to it then a quickie? I’m not saying it’s right I’m just saying perhaps there was more too it!",
          "id": 151,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 169,
      "content": "NTA- if HE wanted reconciliation, then why the hell did he stay with the girlfriend who cheated on  you with him?  In my faith, we have a concept called weirgild or man-price.  It basically comes down to forgiveness is impossible without compensation.",
      "id": 152,
      "comments": [
        {
          "score": 37,
          "content": "That’s the mom that wanted it the most at least that’s what it sounds like",
          "id": 153,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "what faith is that?",
          "id": 154,
          "comments": [
            {
              "score": 13,
              "content": "Weirgild is anglo saxon linguistically so ill go on a limb and assume their pagan and further probably some form of norse pagan.",
              "id": 155,
              "comments": [
                {
                  "score": 5,
                  "content": "thanks",
                  "id": 156,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "As a norse pagan id guess hes in that neighborhood- we have similar concepts",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Asatru",
              "id": 158,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}