{
  "post content": "Hi r/AmITheAsshole. Longtime listener,  first time caller here. \n\nLong story short. My girlfriend and i currently rent a 3 bedroom house in a pretty expensive city in my state. Both of us make okay money but we would not be able to afford our house without roommates. Well one of our roommates left suddenly to take care of her dad who is in bad health. No big deal, we found another roommate who was willing to pay 100 more a month than the previous roommate, lowering mine, my girlfriend's and our second roommates rent. However our new roommate has kids. Now i work a lot, I'm in sales so i normally work a 40 hour a week job plus quite a bit of overtime so i wasn't really too involved in the search for a roommate. My girlfriend gets off arround 2-3pm and i get off arround 7 most days. Needless to say,  i really didn't get a say in who moved in. Not a huge fan of kids but my girlfriend let our new roommate move in due to some personal issues she was having that required her to move immediately and since they know each other from highschool, she let her move in without consulting me much on it but i did ultimately give her the go ahead to do so. I don't have a problem with helping someone in need who would otherwise be homeless. Been in that position before and it sucks. \n\nEarlier today,  I was cleaning the trash out and got excited because i found an extra box and was like \" fuck yeah! This box is gonna make things so much more convenient!\" ( I get excited easily, part of my ADHD I guess ) anyways, i said this in front of her kids ( i think ones 11 months and the others about 3 years old?) The mother didn't seem to care but my girlfriend whispered to me that need to watch my mouth now that there is a kid in the house. Now i normally swear like a sailor in casual conversation. My dad was a biker and a factory worker so i was very much raised with \"Fuck, shit and ass\" in my vocabulary and i see no problem with using those words in normal conversation. (Obviously not at work or around certain people)\nSo i dont see my language as a big deal, and it definitely seems like the mother doesn't care and until she comes forward and says something, I really don't care either. \n\n\nWould I be the ass hole if i had a conversation with my girlfriend later and tell her while i get where she is coming from, im not going to censor myself in my own home?",
  "id": 1,
  "comments": [
    {
      "score": 30,
      "content": "NAH for now but I'm guessing the mother \"seems like she doesn't care\" because she's escaping an abusive relationship and probably doesn't want to rock the boat even if she does have an issue with it. I think it would be the kind thing to do to be more mindful of your language - I get where you're coming from, but it's really not that much of a burden to modify a little so you're not constantly streaming obscenities.",
      "id": 2,
      "comments": [
        {
          "score": 3,
          "content": "It was more that she was getting kicked out of her current place than abusive i believe. Not that it changes the situation really",
          "id": 3,
          "comments": [
            {
              "score": 8,
              "content": "The previous time you posted this it stated that she was escaping an abusive situation.",
              "id": 4,
              "comments": [
                {
                  "score": 2,
                  "content": "Apparently i was mistaken after asking the girlfriend about it",
                  "id": 5,
                  "comments": [
                    {
                      "score": 15,
                      "content": "So you spoke to your girlfriend about it in the last hour and she told you it wasn't an abusive relationship? Why didn't you speak to her about the language at the same time?",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 17,
      "content": "Yta. You state that you get that you can’t swear that way at work or in front of certain people. Guess what? Kids would fall under your “certain people” umbrella. It’s ridiculous that someone has to point this out to you.",
      "id": 7,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 10,
      "content": "YTA You really shouldn't be swearing in front of kids. They are the \"certain people\" who you should not use those words in front of.",
      "id": 8,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "Swearing is in your vocabulary but “not at work or around certain types of people”.  Who are those types of people if not young children? \n\n\nTechnically NTA until you explicitly ignore a request from the mother but it would be courteous of you to take cues her.  If she swears, go for it.  If she doesn’t, then refrain in front of the children.  And perhaps your gf may expect this of you if one day the two of you have children?",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "Currently NAH. Nobody has said it's an issue who should be dictating what the kids hear.\n\nIf the mom comes forward and asks and you still dont wanna change it changes things. Small children are verbal silly putty and will repeat near everything they hear and especially if they see it gets a reaction out of adults.",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "NTA. \n\nI think people get a little too upset about cursewords and I wouldn’t stop saying cursewords in my own home either.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA. If the mother didn’t care, it’s not your job to parent her children. Not everybody has the same values as everyone else, some people don’t care about censoring.",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "I'm not sure why your GF is trying to step in on behalf of the new roommate when the roomie made no indication that she was bothered. If the new roomie has an issue with something, she'll need to say so and discuss it with you. Your GF is stepping in unnecessarily. Don't create extra work for yourselves.\n\nNTA.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA Unless the mother asks you to then it doesn’t really matter",
      "id": 14,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA - fuck em. It’s your house.",
      "id": 15,
      "comments": [],
      "relation": "Support"
    }
  ]
}