{
  "post content": "We are doing some house renovations and so workers are in the house. Today two guys were putting up drywall in the living room while our babysitter is playing with our daughter in the family room while I’m working in my downstairs office. \n\nI hear the drywall guy asking personal questions to my babysitter until her answers started getting short and her tone changes. \nIE: \nGuy: So where do you live ? \nHer: North of here\nGuy: Yeah but where?\nHer: It’s kind of a weird spot\n\nThat’s when I finally walked upstairs and told him, “What is this? The census? She’s watching my kid. Let her be. “ I thought I did it in a joking manner but I guess it came off harsher than I intended. My wife promptly informed me I was an asshole to the guy and the babysitter had it under control. \n\nI get that white knighting is a thing and that I may be out of touch with where I should be putting my foot down so I leave the verdict all of you. \n\nAm I the A-hole?\n\n\nUpdate: We spoke about the situation at just before she left. I apologized to her for the weirdo and let her know he won’t be back. To quote her, “The thirsty ones never get the hint.”\n\nThe most eye opening take away from this  was when she told my wife and I, “If you think that was bad you should check out my DM’s”. Her instagram messages are from people who should be put on the sex offender registry. Guys offering her $700 a week to hold them, guys she has never met offering to buy her plane tickets, and straight up dick pics. How are dick pic people not out on the sex offender registry? It’s just street flashing with less effort. It’s insane and it’s apparently just a norm with the way she brushed it off. \n\nMy wife is deflecting from whether I’m still the a-hole but I’ll take what I can get. In her defense, even the babysitter noted that while my comment was funny, my tone was actually straight up yelling at the guy. It’s a give and take like anything in this world. \n\nAnyway, thank you all for your input and here is to hoping the “thirsty” ones get a job which has them work from home and off social media.",
  "id": 1,
  "comments": [
    {
      "score": 40300,
      "content": "NTA and big blessings to you. Your babysitter probably felt obligated to remain polite while working. You the real MVP.",
      "id": 2,
      "comments": [
        {
          "score": 15288,
          "content": "Absolutely. I didn’t take it as white knighting and ESPECIALLY if your babysitter is a teenager/younger woman it was likely appreciated. Teenage-me certainly wasn’t confident enough to shut down creepy dudes and I would’ve felt relieved knowing someone who employs me had my back in that kind of way.\n\nDon’t doubt yourself for a second, OP",
          "id": 3,
          "comments": [
            {
              "score": 4684,
              "content": "Yes! Hell I'm in my twenties and wouldn't be comfortable shutting him down",
              "id": 4,
              "comments": [
                {
                  "score": 4238,
                  "content": "You are going to love your thirties.  Not even a twinge of guilt about sending someone on their way.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2396,
                      "content": "Can confirm. Early 30s and my fucks all went away in my 20s.  Its glorious.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 102,
                      "content": "37 and I can't even remember what my fucks looked like.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 96,
                      "content": "It took my turning 50 to understand what my MIL told me about how great 50 was for lack of giving a shit about other people’s opinions. My field of fucks is fallow, but my field of “fuck you’s” is burgeoning.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "I am 37 and still have all of my fucks. I'm hoping to lose them when I turn 40.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "My wife says, \"But yeah, in your 40s, you kind of miss it.\"\n\n\nEDIT:  She's kidding by the way!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "27 here and finally okay with it.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "I think it’s more of fear and anxiety than guilt. I have absolutely had guys get aggressive when I’ve shut them down as softly as possible. NTA",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Oh gosh I can only dream!!! I'd actually like to get there while I'm still in my twenties, but I'm still quite shy haha",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "AGREE! I spent my early and mid 20s being a pushover and struggling with shutting people down (both romantically or just platonic people asking too much). The closer I got to 30 I slowly got a spine and do not tolerate that shit. It's so freeing!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "The most real thing I've had older women say to me, the greatest liberator for women is age.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 97,
                  "content": "Totally. NOW I’d be all “you’re never going there, so don’t worry about it and get back to work” 😂",
                  "id": 16,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Hell yes. Getting older has been freeing for exactly this reason. \n\nI ran out of shits last decade.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "Once I started asking myself if I would be comfortable asking questions that made me feel uncomfortable the switch flipped and I would turn it around on them times two.  Sometimes my more polite response would be, “We just met, I don’t feel comfortable answering personal questions.” Or get snarky and say, “Why would I tell someone I just met the answers to those questions?”  If they are just rude and it is obvious they are crossing a line I confirm their rudeness and tell them to go get bent. “How rude!  Get bent!”  Or whatever the vernacular was at the time was.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I found that once I started no longer accepting people's bullshit I actually became a genuinely nicer person. I spent all of my twenties striving to be nicer to get people to like me and then in my mid 30s I decided to be kind to myself rather than being nice to others. I decided that instead of being nice to others I would be fair.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Forsooth knave!",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Dude, I am a married woman who is nearly 30 and I have a house. But when I was home alone and a plumber came who was nearly a foot taller and 100lbs heavier than me came to work and his eyes flitted down to my body for a millisecond, I was frightened. \n\nLike, I don't think he meant to do that, I didn't act threatened, but I did realize the position I was in and how I was so vulnerable that day.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Too much benefit of the doubt.\n\nThey mean to do it. Those who don’t, don’t do it.\n\nCalling it out is the best way to handle it, but in your situation it’s not something you may be able to safely do.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I am 46 and would gladly welcome anyone who wants to white knight on my behalf.  Even if I have the situation under control, I am never going to be sad to know that someone else is paying attention and has my back. OP, you sir, are not just NTA, but whatever the polar opposite of that is.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I'm so sorry it feels this way. In my twenties, I was also harassed by an asshole who trained me at his last week at work. I told myself I only had to endure it for a week. I was uncomfortable to be alone in the store room with him. It was terrible.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Some kid cashier at McDonald's asked if I lived around there (and that was like the only thing he said to me besides \"can I take your order\" or whatever) and he said it so creepily I just said no and refused to look at him after that even though I could like feel him staring at me. I was like 25 at the time.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Especially when you’re on the job. If the guy was a big enough prick (already sounds like he is) he would make a big show out of her shutting him down and possibly complain to one of her bosses saying she was rude or something",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I've found my forties absolutely glorious.  no fucks to give, at all.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Also confirming. I was a late bloomer. I have my last fuck around 33.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 238,
              "content": "Yes, very surprised OP's wife would chastise him for interrupting some inappropriate questioning by a contractor in his home to the young woman who is their babysitter.",
              "id": 29,
              "comments": [
                {
                  "score": 41,
                  "content": "Could it be considered Workplace sexual harrasment, since both individuals are employed by OP?",
                  "id": 30,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Not likely; they’re basically both contractors to him, or at least the plumber is. That wouldn’t be subject to the same rules and regs as a regular workplace, would be my guess.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 234,
              "content": "Seriously. Even reading the guys questions made my stomach knot a little bit, thank you for intervening!",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 211,
              "content": "NTA OP. \nI think of “white knighting” as more of when the guy comes to the recuse of any and all women, whether or not they know the woman, whether or not the woman needs help.  \nFor OP, coming to assist his babysitter, in his home, that’s not White Knighting. That is just being a good person.",
              "id": 33,
              "comments": [
                {
                  "score": 50,
                  "content": "Yeah, white knighting would have been the drywall guy asking something like, \"Got plans for the 4th of July\" or \"Got any good shows to recommend? I'm out of Netflix\" and running in to tell him to leave him alone while she's working. Not this.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Exactly. Both of these people are AT WORK FOR OP IN HIS/HER HOME.  Not white knighting in the slightest.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 154,
              "content": "NTA at all. Asking a stranger personal questions, especially about where they live, is super creepy and potentially dangerous. You were protecting a person under your employment. That's not really white knighting.",
              "id": 36,
              "comments": [
                {
                  "score": 6,
                  "content": "You heard the inquisition and you stepped in when the babysitters tone changed. Good job, you. Your wife was wrong.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 134,
              "content": ">ESPECIALLY if your babysitter is a teenager/younger woman\n\nYep - another comment says she's college-aged.\n\nBy the way, is it just me, or are we getting a rash of posts without gender and age specified where gender and/or age is very, very relevant?  Like the post about someone's accusations of harassment really being about homophobia, since both the OP and the accuser there were male?  I get that sometimes ages/genders aren't necessary, can bias judgments\\*, and might reveal identity, but when top comments regard ages/genders not revealed in the posts, that's a giveaway that they *should* have been specified.\n\n\\* >!For example, I'd totally get a 32-year-old marrying a 22-year-old omitting ages.  Yes, it's probably relevant, but if you've read AITA long enough, you'll know the comments about the older person only dating people young enough to control will come out of the woodwork, whether or not they're relevant to the discussion.  Here I'm talking about people omitting ages/genders without any particular intent.!<",
              "id": 38,
              "comments": [
                {
                  "score": 14,
                  "content": "Actually with harassment, I don't think gender or age (unless dealing with a minor) really comes into play at all. Either way, is harassment. Correct?",
                  "id": 39,
                  "comments": [
                    {
                      "score": 19,
                      "content": "I think it's harassment either way, but the babysitter's age is probably relevant to whether or not OP was an asshole or not for intervenening on the babysitters behalf.  It's a completely different dynamic if she's 19 vs 30.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "The post doesn't say whether or not we're dealing with a minor.  We don't know from the post whether she's 14 or 40, and, though OP's in the clear either way, one paints a very different picture from the other - and would even in a jurisdiction where 14 were the age of consent.  That's why age is important here.",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 99,
              "content": "Yeah, and if it was obvious that OP heard this interaction and didn’t stop it, it would signal to the babysitter and the creep that this behavior is ok. I’m still kind of resentful of the times I’ve been bullied or harassed at work, and my boss did nothing.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "Grown women can be presumed to handle themselves sure, but a teenage girl or a younger woman might or might not have the confidence to overcome conditioning to be polite and non confrontational when someone is hassling them.",
              "id": 43,
              "comments": [
                {
                  "score": 13,
                  "content": "Either way, feeling safe and having support is good. Especially in the workplace.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Absolutely. He also acted as a good employer making sure his employee was not harassed at work.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Also- she might not feel like her normal means of shooting away creepy men are appropriate in front of her boss and boss’ child.  She certainly cannot leave the situation, as she needs to continue to work.  She probably shouldn’t call him a, “limp-dick creeper” in front of a small child (although, I would give her a raise for doing so!).  She was trying to find a professional way to tell him off.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "That isn't white-knighting. That's allyship. When you hear a woman giving answers like that, she's in a tight space trying to get out.\n\nNTA, OP. Thank you, on behalf of myself and every woman who's ever had to fake an imaginary boyfriend.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Its not white nighting. Hes her employer and it's his responsibility to make sure she's not harrassed and that she feels comfortable at work.",
              "id": 48,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 967,
          "content": "I'm a nanny and this kind of stuff has happened multiple times while i was working. Random repair men with no sense of professionalism asking me personal questions that made me extremely uncomfortable. Parents were at work so my only choice was to be polite without giving away too much information. Because what if I pissed him off? Its just me and the toddlers in the house. I have to make sure they are safe and I don't know how this man would react if I were to shut him down. I wish I had someone there to tell him to cut it out. So I played nice and then when they left I made sure all doors were locked and I was extra vigilant the rest of the day.  OP is absolutely NTA. We need more men calling out other men for their behavior. Sure the babysitter could have handled it but she shouldn't have to in her place of work. OP is her employer and should act like head of HR as well.",
          "id": 49,
          "comments": [
            {
              "score": 275,
              "content": "I’m also a nanny and, yeah. One time one of the kids I was nannying & her little BFF basically decided to set me up with the friend’s dad when he came to pick her up from a play date. I was the only adult at home, so no one to throw me a life raft. It do be your own people sometimes.",
              "id": 50,
              "comments": [
                {
                  "score": 118,
                  "content": "I used to be a live-in nanny.  We had a guy that came for a regular service--probably every other month or so--and he made me SO uncomfortable, but I was never sure how to appropriately distance since what he was doing needed my direct interaction.  It wasn't anything overt, but the constant semi-prying questions.  And my kids were school-aged so I didn't even have the excuse of \"I need to watch this toddler.\" because they weren't even THERE for it.  I would certainly have felt comfortable telling someone to stuff it if I got approached outside of work, but it was a weird when it was occurring as part of my job, but we weren't exactly co-workers, and he was essentially his own boss so I didn't have anyone that I could report anything to.  I used to try to make sure that I scheduled him on a day of the week that the housekeeper would be there with me and then I'd ask her to stay in the room (without being too obvious about it) when I was directly dealing with him.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Oh how awkward. I'm sorry that happened to you! Wow.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 157,
              "content": "I was a nanny for a year and there was a month period where the roof was being repaired. One of the contractors came in occasionally to use the washroom and he made me SO uncomfortable and I always had to make excuses to leave the room. I eventually mentioned it to my employer and he was very angry and sent a nasty email to the roofing company.",
              "id": 53,
              "comments": [
                {
                  "score": 49,
                  "content": "I'm glad he had your back.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "So much this! The having to be polite because you don’t know if a rejection is going to make them violent! And yes! I love you comparing the parents to HR. That is perfect!",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": ">We need more men calling out other men for their behavior\n\nBecause unfortunately, men like this will only respect other men. \n\nOP is super NTA and I would love to have had bosses like him.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 602,
          "content": "This. Absolutely NTA you weren’t “white knighting” (Idk what that is but I assume it’s negative) you were calling the dude out for bugging the sitter. The cold hard fact is that even in 2020, men often respect the presence/warning of another man more than the autonomy of a woman saying no, especially when she’s trying to be polite and turn down their attention subtly rather than assertively. I think you did the right thing",
          "id": 57,
          "comments": [
            {
              "score": 323,
              "content": "White knighting is intervening in a situation where it's not necessary to make yourself look good more or less. \n\nI agree, this was appropriate for the OP to get involved.",
              "id": 58,
              "comments": [
                {
                  "score": 124,
                  "content": "Yeah definitely not white knighting in this case.  It was in his house involving someone he is paying to provide a service to his family.  It’s an obligation to intervene in a situation like that.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Yes. Exactly. Great definition!",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I agree. This guy was in his employ. So was the babysitter. If this was a corporate office it would 100% be considered appropriate for the employer to put a stop to this. So he was doing his duty to tell someone doing a job for him to stfu and focus on work.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 113,
              "content": "[deleted]",
              "id": 62,
              "comments": [
                {
                  "score": 58,
                  "content": "In my experience, \"white knighting\" also gets thrown around by guys (or women) who can't conceive of a man actually wanting to be decent and speak on behalf of women, and just assume they're doing it to look good or kiss ass. It's sometimes used to shut down men's efforts to push back against misogyny and keep them in line with the status quo.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Yeah, it basically has several meanings depending on who's saying it. In addition to the ones mentioned here, I've seen it used in a \"you trying to help means that you think that women can't take care of themselves and need a man to take care of them\" sense.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Fucking *thank you*, I now know how to put into words exactly why this misuse of the term bothers me so much.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Yup, that's been my primary experience as well.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Same with calling men simps 😩",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "It's not to 'get in their pants'.  It's an insult to white knight a woman because it is making the assumption that a woman is incapable of handling herself and ignores whether the woman actually wanted the assistance.  The act of just jumping in to \"defend\" the woman infantilizes a woman and treats her as inferior to the man and perpetuates the attitude that a woman has to have a man to take care of her because she is not equal to a man.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Yes!",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 397,
          "content": "I’m confused why OP’s wife got upset about this. Dude was being a creep.\n\nNTA 100%",
          "id": 70,
          "comments": [
            {
              "score": 233,
              "content": "She's more worried about the quality of the drywall job than the comfort of her employee.\n\nWhich... This is a thing with many women.  If they had to suffer, they assume the generations after will too.  Some of my worst professional abuse came from women in positions of power and authority over me.",
              "id": 71,
              "comments": [
                {
                  "score": 119,
                  "content": "I mean no offense meant to anyone who does drywall, but that’s more replaceable than a good, solid babysitter.\n\nMeaning, OP was right to step in and cut that nonsense out",
                  "id": 72,
                  "comments": [
                    {
                      "score": 55,
                      "content": "As someone who has done drywall before, it’s super fucking simple. Good babysitter > drywall guys any day.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 124,
              "content": "I think she may thought it implied the sitter wasn’t capable of handling it herself. \nLike the dad was implying “Hey hey there little lady, let a man handle this for you ! “\n\nIn this case the dad/family guy is paying the worker so justified to tell him to shut up.",
              "id": 74,
              "comments": [
                {
                  "score": 85,
                  "content": "I mean, the babysitter was doing the best she could while being professional, but the drywall guy was still being creepy",
                  "id": 75,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Right, but right or wrong, some people still think like that. Since she \"promptly informed me I was an asshole to the guy and **the babysitter had it under control**\", I'm confident that's exactly what was going trough her mind.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I'm not just confused, I'm *actively worried* about it. Just hoping the OP and wife don't have little girls. This woman has some messed up ideas about women and men... HOW is letting the guys know they need to stop harassing the girl 'being the TA?' yikes! that's crazy",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 336,
          "content": "Yeah. She is your employee and in your home. You have a responsibility to make sure she has a safe, comfortable working environment.",
          "id": 78,
          "comments": [
            {
              "score": 23,
              "content": "And OP is paying repairman to fix shit not hit on anybody.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "This wouldn't be a question (I would hope) in a professional working environment. As an employer, OP has a responsibility to curb harassing behavior when it comes to his attention. I don't see a large difference here.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 128,
          "content": "Yes! I full go with that.",
          "id": 81,
          "comments": [
            {
              "score": 82,
              "content": "[removed]",
              "id": 82,
              "comments": [
                {
                  "score": 25,
                  "content": "We are in the same boat. Have a good day.",
                  "id": 83,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 90,
          "content": "Not only that, these are OPs employees. He is paying them for certain tasks. Not to be distracted by flirting. Drywall guy was inappropriate and got put in his place.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "NTA- You were definitely not white-knighting. He was being inappropriate and you stopped him.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "Not to mention, you’re employing both people - while it may seem ‘strict’ to interrupt a personal conversation - you’re entirely within your right to do so and not be accused of ‘white knighting’ (plus I’m pretty sure the Babysitter was thrilled).",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "[deleted]",
          "id": 87,
          "comments": [
            {
              "score": 5,
              "content": "This is exactly right.",
              "id": 88,
              "comments": [
                {
                  "score": 4,
                  "content": "The drywaller was clearly a trifler.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "SSDGM?",
              "id": 90,
              "comments": [
                {
                  "score": 6,
                  "content": "> SSDGM\n\nStay Sexy, Don't Get Murdered",
                  "id": 91,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Ah! I haven't heard that one before. Thanks.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Murderinos everywhere ❤",
              "id": 93,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 11074,
      "content": "NTA. This was the exact right thing to do.",
      "id": 94,
      "comments": [
        {
          "score": 5603,
          "content": "Agreed. If she was giving off the vibe that she did not want that attention and she was in your house, you were absolutely justified in telling them off. \n\nWhoever is in your house is under your protection.",
          "id": 95,
          "comments": [
            {
              "score": 5137,
              "content": "I like that. Under my house and under my protection. Has a “come and partake in Salt and bread” vibe. I’m going to steal that from you.",
              "id": 96,
              "comments": [
                {
                  "score": 3794,
                  "content": "In your house and *under your employment*. This is like a cashier being harassed by a customer (for personal information, for a date, etc) and their manager walks up and puts an end to it because the employee cannot fully express their discontent without jeopardizing their role by being 'rude' to said customer (read: declining the attention they're getting).",
                  "id": 97,
                  "comments": [
                    {
                      "score": 123,
                      "content": "Not just the babysitter. The drywallers are also working in his home. They are being paid to work, not hit on babysitters.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "Agreed.\n\n\nThe way I see it, OP was talking directly to a contracted employee about staying on task and allowing another employee to focus on the work they hired her to do. That’s fully within their rights completely aside from the harassment.\n\nWonder if it’s occurred to the wife at all that she’s the one presuming to speak on the nanny’s behalf without actually asking her perspective.\n\nAnyway, OP is NTA.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Thank you! I keep getting weird comments from older guys at work and I always appreciate when my manager or a coworker save me from them by asking me to “fix something in the back”",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 529,
                  "content": "You are the head of HR in her place of employment. It is your job to make sure she isn't being harassed.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 252,
                      "content": "Yep. Your house is her place of work, and you are her employer. It's your responsibility to provide a safe work environment.\n\n*Good Job*\n\nResounding NTA",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 120,
                  "content": "You have all the good Dad Energy 🐣",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 73,
                  "content": "What you did is very important, because men who harass or abuse rely on the validation from other men, and you just took that away from him. \n\nIt doesn't matter how or how much we (women) shut creeps down... Ironically, being told off by another man is the only thing that *actually* stops them in their tracks and makes them feel uncomfortable enough to rethink their actions, or at least cut it out at the moment.\n\nI know how uncomfortable the babysitter must have felt, uncomfortable because of the personal and potentially dangerous questions, and powerless because \"just talking\" it's \"not enough\" to \"be rude\" and tell him to fuck off. The fact that you could notice she was upset, and actually helped speaks very well about you.\n\nTo me, white-knighting refers more to a man that unnecessarily helps women, to the point of becoming a hindrance, and often seeks some kind of retribution, like a date or sex, and you definitely weren't doing that.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 8,
                      "content": "> I know how uncomfortable the babysitter must have felt, uncomfortable because of the personal and potentially dangerous questions, and powerless because \"just talking\" it's \"not enough\" to \"be rude\" and tell him to fuck off.\n\nIt really is a slippery slope.  People who get assaulted often get victim blamed for not standing up for themselves, letting it happen and not getting out of the situation or whatever.  But every step of the way is a risk to yourself and people will get on you for being 'rude' and 'overreacting '  until it's too late and even then you're in the wrong for not telling them to fuck off.\n\nThis article immediately comes to mind . It's about the escalation and how it is hard to predict how things are going to go.  \n\n\nhttp://pervocracy.blogspot.com/2011/01/do-you-scream.html?m=1",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "If I was her and you didn’t stand up for me I don’t know if I would feel comfortable enough working for you anymore. You did the right thing. Did you talk to her about what happened afterwards when the guy left?",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "The unspoken Rules of Hospitality.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "She may have felt especially obligated to be polite as the drywaller was hired by you as well. She may have had the thought that being rude/perceived as rude to him could've gotten her in trouble. You did a good job.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Just to add in case someone hasn't mentioned it, it's actually kind of threatening for strange men to ask me where I live. Why do you need to know that? Are you going to follow me?\n\nThat's *not* the same thing as asking what city I live in or where I'm from, to be clear. You did the right thing by stepping in. \n\nYou could always ask the babysitter what she would have preferred. Do it in a way that makes it clear you will accept any answer as the \"correct\" one, as you are her employer and you do have power over her.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Very correct!",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Precisely. And even if she did have it under control, it's good for her to know that you are:\n\n* Not ok with sexual harassment.\n\n* Observant and on point with your 'HR duties'.\n\n* Behind her judgement of the situation as becoming sketchy and uncomfortable. She'll know that she can say no more forcefully, and you will back her up. Let's hope she didn't feel the need this time, and never will - but good job making sure!\n\nNTA.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7590,
      "content": "NTA.\n\nThat's creepy. Likely better to have said \"Please don't interrupt my babysitter, she has her hands full with her work and needs to be fully focused on my child.\" But, what you said is fine.\n\nAnd it's certainly NOT appropriate to have the babysitter fend for herself. If she is working in your home, it is your job is ensure other folks also working in your home respect her and don't act creepy.",
      "id": 112,
      "comments": [
        {
          "score": 2889,
          "content": "I like that wording. Thank you for your input.",
          "id": 113,
          "comments": [
            {
              "score": 1214,
              "content": "I actually like the way you said it, it’s funny. Also NTA, the guy is there to do a job, not chat up the babysitter!",
              "id": 114,
              "comments": [
                {
                  "score": 435,
                  "content": "Agreed I think saying please don’t bother her she has her hands full might also imply that she isn’t focusing on her work and she should. I work with kids and without a follow up conversation I would’ve felt like my boss thought I wasn’t doing my job rather than that he was trying to get me out of an uncomfortable situation. The joke allowed her to also know that you’re on her side, I like it and would really appreciate it if I were her",
                  "id": 115,
                  "comments": [
                    {
                      "score": 170,
                      "content": "I agree.  You weren't overly aggressive, but you weren't passive either. This way the drywall guy understands that you heard him being a creep and called him out on it. Some people don't get it unless you're assertive.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "Yeah I figure he’d more respect you being sort of a wise guy than saying it super formally.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "The census line is great!! Definitely deserves a laugh",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Agreed. Not only can it send mixed signals to the babysitter (she could wind up thinking she’s damned either way, rather than reading the subtext in that moment that he’s trying to keep her safe)- it also follows really great etiquette; shutting down discomfort in a way that allows everyone to save face. This guy doesn’t deserve to be saving face but the humor gave him an “out” to laugh it off and redirect, and not have to explain his actions. Drywaller definitely knew the subtext, and knew he was being told to quit being a creep, but OP allowed him deniability, regardless of whether he deserved it.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Agreed. _What is this? The census?_ Hilarious and gets the point across!",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 229,
              "content": "NTA Let me tell you a story... Back when I was maybe 11 or 12 and my sister was 18 my parents had the bathrooms tiled. The guy who did it was an old friend of my dad. Both parents worked full days so I was home alone with him. He was friendly enough but started going extra. He would hover when I made lunch and ask about it. I didn't like it but whatever. I mentioned it to my sister who was married right out of high school and pregnant and due soon. She made an effort to hang out when she could. He latched on to her immediately. He stayed after he was done for the day, waiting for her to come by, made comments about being there for the birth etc. It was awful. We were only told by our dad to be nice and he's a harmless old man etc. My sister finally snapped and told him to back off. Our father was horrified and still to this day brings up how embarrassed he is that she was rude to that guy.\n\nIt took us both years to learn to stand up for ourselves. You did something for that babysitter and hopefully that was a lesson she learned. You can tell an adult to mind their business and be rude about it if they are making you uncomfortable. If they really didn't mean to, they will stop. Good on ya!",
              "id": 121,
              "comments": [
                {
                  "score": 69,
                  "content": "I still have a hard time being assertive when I feel creeped out by men.  Being polite and having good manners was always taught in my house.  It’s hard to tell someone to back off or leave you alone.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 48,
                      "content": "It really is! I took a self defense class and that was 90% of the message. Listen to your gut and don't worry about being polite. Your life could literally be the consequence of erring on the side of ignoring your discomfort.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Fuck politeness! - MFM",
                      "id": 124,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Oh, ugh. That angers me and makes me hurt for you and your sister. How *dare* you want to feel safe, and in your own home! And that poor man and his *feelings*?? Barf.\n\nI’m sorry that happened you both.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 194,
              "content": "You are the HR department your home.",
              "id": 126,
              "comments": [
                {
                  "score": 31,
                  "content": "The horror, the horror",
                  "id": 127,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "In that case, I'd like to speak with the manager.",
                  "id": 128,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 156,
              "content": "I like your wording because it's hilarious BUT it also draws attention to the fact that he was asking a bunch of personal questions she clearly didn't want to answer. Maybe he can consider how one sided that type of interaction is for the future.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 123,
              "content": "Meh I like your call out better. He needs to be told that the behavior is creepy and inappropriate, yours got that across a lot better vs this one which seems kind of more just \"it's a bad time\". She clearly didnt want to answer and he needs to learn that continuing to push is inappropriate regardless of the setting",
              "id": 130,
              "comments": [
                {
                  "score": 28,
                  "content": "Yeah. I think OP's version actually called out the dude being creepy, whereas to me this implies the dude can keep creeping, just not while she's working.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 77,
              "content": "Anybody else get the feeling that OP is going to read each of these responses triumphantly to his wife? NTA, btw.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "You could always follow up with the babysitter, tell her you picked up that it could have been uncomfortable, and did you react in a way that she felt was appropriate, or would she have preferred you let it be?",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I think the way you said it was important actually, because you pushed back against them being inappropriate rather than pushing back against them slacking. One of those was more important and I'm sure made the babysitter feel a lot safer. Plus, that was funny. 😂",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I like the way you said it too, because I have been in babysitting-while-creeped-on situations myself, and personally I would’ve felt like I was also in the wrong for interacting with the dude if it was said that way instead of fully calling out the creep like you did. I am an overly sensitive person, though lol.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "As a babysitter and nanny, I would be soooooo incredibly grateful for you in this situation. If I’m in a client’s house, I would rarely speak up to someone else like that",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 205,
          "content": "Right? It’s not like she can leave if she’s uncomfortable.\n\nThey’re both your employees and you have the responsibility to makes sure that one employee isn’t harassing the other.",
          "id": 137,
          "comments": [
            {
              "score": 33,
              "content": "As long as you aren't using an army voice, theres nothing wrong with stepping in. \n\nYou are also allowed to not feel comfortable with something like this going on in your own home as well.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Yes Sir.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "She was upstairs, they were working down stairs on the living room. That worker went out of his way to be creepy",
          "id": 140,
          "comments": [
            {
              "score": 10,
              "content": "I'm pretty sure she was on the same level as the workmen. Family room and living room are typically both on the main floor. OP was working in the basement.\n\nBut worker was still creepy and OP is NTA!!",
              "id": 141,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "Not to mention the drywall guys should be focused on what they’re doing too! Not doing a half ass job while hitting on the babysitter lol. OP is definitely NTA for putting an end to that unprofessional behavior.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Nah, drywall dude was making everyone uncomfortable.  No need to be all pleasant and formal.  I don’t think doing so will get across to him.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "People are too worried about calling out creepy behaviour. What he was doing was completely in appropriate and he deserved to be shamed.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "As a 20 yr old male babysitter I would also definitely appreciate the parents helping me out in an uncomfortable situation. They had some people doing yard work and I was taking the kid for a walk. Came back and they were looking at me funny and talking to each other in Spanish saying things like \"he doesn't look like a babysitter\" \"why wouldn't they hire a female babysitter\" stuff like that. Kind of annoyed me and I just ignored them and took the kid to the other side of the house to play and read. Thankfully they weren't being creepy but the way I see it, the kid is under my protection, and I'm in the parents' house so I am sort of under their protection as a different comment also said. Even though I can protect myself I don't really have the confidence to tell them off if it comes down to it. I love that family to pieces though and just glad those workers are done now.\n\nYou're words are definitely well put, and I'd be happy to have someone like you speaking up for me if ever needed",
          "id": 145,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4101,
      "content": "NTA. You hired this guy to work, not spend time chatting up your babysitter. You were not in any way out of line for intervening and giving your baby-sitter an out for a conversation that was becoming uncomfortable for her. I'm sure the baby-sitter could have handled it, but that's not the point: it was not her job to manage his behavior, it was yours. And you did.",
      "id": 146,
      "comments": [
        {
          "score": 2399,
          "content": "“It was not her job to manage his behavior “. That is well said. Thank you for your input.",
          "id": 147,
          "comments": [
            {
              "score": 534,
              "content": "NTA, adding that while your wife might have had good intentions as well so far as “let her speak for herself”, I really feel like you did the right thing here. I’m sure you’ve heard it before but being a woman at work, it’s very hard to establish boundaries with men that can’t take a hint. The pressure/expectation to be friendly and kind can be overwhelming and telling a guy to nicely move on can be dangerous even in work situations. This is exactly what being an ally, and a good boss, is. You’re her boss and his boss, that wouldn’t have been tolerated in any work place setting. It doesn’t matter if they’re both working in your home.",
              "id": 148,
              "comments": [
                {
                  "score": 233,
                  "content": "[deleted]",
                  "id": 149,
                  "comments": [
                    {
                      "score": 40,
                      "content": "I think that's where I draw the line at OP's mention of \"white knighting\".  He is responsible for creating a safe work environment for the people that he employs.  And frankly,  the safety of the person he employs to watch his kid is of the utmost importance in this instance.",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 72,
                  "content": "100%. It’s really irritating when a man steps in to answer for you before you even have a chance to assert yourself. But sometimes you get in situations where you have asserted yourself and a man just keeps pushing his advantage and you can tell the only person he will listen to is another man. It sucks, but it’s the way it is sometimes.",
                  "id": 151,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Ps why are they in a construction area? Not safe.",
              "id": 152,
              "comments": [
                {
                  "score": 6,
                  "content": "OP actually said the babysitter and kid were in a separate area, which makes this even creepier cause that means drywall guy actively went to the babysitter rather than chatting and making small talk in the same area.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 157,
          "content": "Sadly many younger women don’t feel confident handling harassment assertively, and will give out their info because they are afraid of being impolite. Just read r/creepyencounters. It’s not “white knighting” if the girl is uncomfortable and having a hard time advocating for herself against an actual creep.",
          "id": 154,
          "comments": [
            {
              "score": 29,
              "content": "Agree. OP might also consider following up with the babysitter to make sure the guy didn't make any more advances out of earshot, and to make sure she feels safe and not that he overstepped at all (I'm sure she is beyond grateful, but it never hurts to see what her comfort level is). As a young woman, I'd say great job OP. NTA",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I called the police to make a report for an 18 year old female employee who was being stalked at her work by a man in his 40s who was writing her creepy letters that he was \"fantasizing about her\", \"knew what her car was\" and \"would wait after work to talk to her\". The two managers above me said I overreacted and the 18 year old should have told him she wasn't interested. I replied no. I did the right thing. She deserves to feel safe and not be bothered at work. Men are bigger and stronger than women (typically) and you can't predict a stranger's reaction to public rejection. My managers dropped the issue.",
              "id": 156,
              "comments": [
                {
                  "score": 6,
                  "content": "Thats a relief you stepped up. Men don’t even need a knife or a gun to physically overpower and rape or strangle the average woman.",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "YUP. I've had guys ask me where I live before, and even as a much more confident grown woman, it's terrifying. I immediately start plotting how to dip out, and pray the guy doesn't try to follow me home. OP was right to shut him down.",
              "id": 158,
              "comments": [
                {
                  "score": 3,
                  "content": "I've had men ask me questions like this while I'm at work too--I think it's because of the whole \"sexy nurse\" thing in porn and pop culture. It's happened so often that I've got a stock routine for it, and it goes like this:\n\nCreepy dude: Hey, so where do you live?\nMe: At my house.\nCreepy dude: Yeah, haha, but where's your house?\nMe: It's in my yard.\nCreepy dude: Okay, but where is your yard then?\nMe: Around my house.\n(continue unto infinity)\n\nEven the most persistent creep gets the point pretty quickly that he won't be getting any specifics. This kind of forced cluelessness works for all sorts of intrusive questions: what car do you drive? the one I bought; what's your last name? it's the one after my middle name; and so on.  And like so many other women said on this post, I'm in my 40s and well out of fucks to give, so that helps!\n\nAlso, just on an unrelated note? Nothing about being a nurse is sexy, I have no freaking clue how the hell that trope ever got started!",
                  "id": 159,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "I share this point with you.",
          "id": 160,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Especially if that dudes by the hour, he’s practically being paid to chat it up. Screw that",
          "id": 161,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1805,
      "content": "NTA at all. As a woman I applaud you doing that. Women can and should speak up when creepy guys are bugging them, but in my experience, sometimes it's just not that easy when you've been raised to be a people-pleaser who doesn't hurt other's feelings or say 'no.'",
      "id": 162,
      "comments": [
        {
          "score": 574,
          "content": "I can see how it would be difficult to speak up in this situation, though. She was at work. The drywall guy was also hired by her employer. She had no idea how he’d react if she called him out on being creepy. What if he started yelling? What if he started cursing at her, in front of the kid? Of course, in those situations, the guy would be in the wrong, but I can understand her being afraid of “causing a scene” at work in someone else’s home.",
          "id": 163,
          "comments": [
            {
              "score": 255,
              "content": "Exactly. That's why it was good for OP to speak up and I don't find it 'white knighting' at all.",
              "id": 164,
              "comments": [
                {
                  "score": 138,
                  "content": "White knighting means something fairly specific, but it’s often used as a criticism of men doing anything for women. I agree this isn’t white knighting either!",
                  "id": 165,
                  "comments": [
                    {
                      "score": 128,
                      "content": "Yeah white knighting would be if babysitter and drywall guy were having a pleasant chat, or even flirting a bit and OP decided to inject himself into it (leaving aside the whole \"on the clock\" part)\n\nDrywall guy was not being friendly, or even throwing down some pleasant easy flirtation. He's asking where a girl he just met lives, and not just in a general sense but trying to like nail down a specific spot. That's weird as fuck. \n\nWhite knighting is when a girl is talking to a guy at a party, smiling, laughing, twirling her hair, and Sir Knight walks up and says \"Hey Sarah, is this guy bothering you?\"",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "This! I’ve almost exclusively heard “white knighting” in the context of men criticizing other men for treating women with common respect and speaking up in situations where they see inappropriate behavior. I can understand the criticism being valid if a man was being showy, manspain-y, and only doing so for the purpose of sex or romantic interest but it is almost NEVER used in that context. It’s just another barrier for both men and women to hurdle over and it’s frustrating.",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "And, because the wife was right there and didn't say anything, she probably was worried about how her employer would react as well. If she stands up for herself, will it get her fired? Even if the guy doesn't react badly, will the wife?",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yes! I mentioned in an earlier comment that that kind of behavior wouldn’t be tolerated in “conventional” work settings either. I work in an office and I know 100% if my boss had overheard something like that he’d be obligated to say something, it’s not appropriate. He did his job as far as I’m concerned, even beyond the very good points you mentioned as well. Women have learned to be delicate while rejecting men because it can be dangerous, regardless of the setting. We also usually feel obligated to speak carefully because of the expectation of being kind and nice and polite to a degree that isn’t expected of men.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 86,
          "content": "Agreed, and if anything I'm weirded out that OP's wife was against it? Obviously we're not a monolith and have our own experiences and opinions, but I instinctively want to look out for other ladies getting subtly annoyed/pestered/harassed (we tend to catch the signs), and am surprised wife thought \"she could handle it\".",
          "id": 170,
          "comments": [
            {
              "score": 19,
              "content": "I've been looking for this comment. I can't believe no one else is disturbed by this. I can't imagine any woman that exists in the world didn't have this exact same experience at some point. I wish I could order a pocket version of OP to carry around so that he could tell creeps to fuck off on my behalf.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yeah, I find it weird also but could be that she is an extreme people pleaser and didn't want to risk upsetting the drywall guys (even at the expense of the babysitter), or maybe she didn't hear the whole exchange, etc",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "I agree. I wonder if the “white knighting” term came from wife’s mouth or husbands. Most women would appreciate this, so it makes me wonder if wifey was a little jealous of her husband being protective of another woman. I can’t otherwise understand why she’d have a problem with him diffusing that awkward situation. I’m in my 30s and it’s still hard for me to speak up sometimes when I feel like men are pushing my boundaries. I would have been grateful if I was the babysitter, and understanding if I was the wife.",
          "id": 173,
          "comments": [
            {
              "score": 30,
              "content": "That's a good point! I didn't understand why the wife was so bothered either. I know I would SO appreciate something like this. I consider myself a strong feminist but in the moment it can be very hard to establish boundaries with a guy hitting on you, so having someone else diffuse the situation can be better and even safer for us sometimes.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Also to add to your point, in many cases saying no can even escalate the situation. \n\nEx.: \"I'm just trying to be nice. You don't have to be such a bi***.\" \n\nOP definitely made the right choice. Worker was way out of line asking where the babysitter lives.",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "THIS. Exactly what I was going to say. Especially while working it is very uncomfortable to know how to react to situations like that.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 808,
      "content": "NTA - in fact this is an new suit area for employers covered by Employer's Liability Insurance, an add-on to an employer's General Liability policy to cover failure to protect your employees from harassment from other employees, or VENDORS of the company.  (Ex: delivery guy harassing a CSR at the front desk).  Crazy to think this could be the employer's fault, but there have been cases.    \n  \nSo, technically, you could be held liable for his actions and did exactly the right thing, if not also possibly asking him to get off your property.",
      "id": 177,
      "comments": [
        {
          "score": 333,
          "content": "That is fascinating. I appreciate you sharing this.",
          "id": 178,
          "comments": [
            {
              "score": 162,
              "content": "[deleted]",
              "id": 179,
              "comments": [
                {
                  "score": 109,
                  "content": "To add on to this. The man who kidnapped elizabeth smart at 14 was a man who her parents contracted to do work in and around their home.",
                  "id": 180,
                  "comments": [
                    {
                      "score": 37,
                      "content": "[deleted]",
                      "id": 181,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 33,
                  "content": "Ugh, this just gave me a full body shiver.",
                  "id": 182,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "Yikes! That sounds like that guy who was a tree trimmer (I think this happened in the 80s) who assaulted and murdered a girl he’d been watching while he worked on their street. Glad you’re okay!",
                  "id": 183,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "It makes sense to me. The employer is responsible for the employee’s behavior. When there’s an outside contractor, there’s a power issue - using your example, the front desk employee doesn’t have the normal means to address harassment from the delivery guy. He doesn’t work for the company, HR can’t discipline him, fire him, etc. If another employee of the same company was harassing her, allowing it to continue would make the company responsible for the harassment. It’s good that outside employees are starting to fall under that umbrella.",
          "id": 184,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Dude, as a receptionist, I totally could have used this information. I got hit on non stop by vendors and when I complained to my boss about these crusty old guys demanding attention and flirting when I was trying to work, she called me whiney. I was told by my coworker not to go to hr about it because when she went to hr about her own harassment, the hr manager (who’s chummy with the rest of upper management) ended up telling the person she filed a complaint about.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 788,
      "content": "NTA who the fuck thinks they deserve to know where someone lives?",
      "id": 186,
      "comments": [
        {
          "score": 494,
          "content": "Rapists and murders.",
          "id": 187,
          "comments": [
            {
              "score": 246,
              "content": "Which is why there is so much of a push to instill \"Fuck Politeness.\" Women were/are told to ignore those little feelings of 'not right' for politeness' sake. As if being polite to a guy who's going to stalk/rape/murder you is going to matter to anyone else. If something is uncomfortable, act on your instincts. If your gut lied to you, you can always say \"Sorry, not sorry\" at a later date.\n\nNTA, OP. Stay sexy, Don't get murdered,",
              "id": 188,
              "comments": [
                {
                  "score": 57,
                  "content": "And if you're in a cult, call your dad.",
                  "id": 189,
                  "comments": [
                    {
                      "score": 31,
                      "content": "And stay out of the forest.",
                      "id": 190,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "SSDGM. Listening to yesterday’s minisode as I’m reading this.",
                  "id": 191,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "SSDGM!",
                  "id": 192,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 105,
          "content": "And pressing the issue when the person gives an intentionally vague answer.  I can't believe the wife would give you grief over the way you handled it.  I'd have done the same thing; who cares if the drywaller gets butthurt that you shut down his small talk.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "It is infuriating how many times a man has asked me where I live. It instantly makes me equally terrified for my safety, and pissed off because who the fuck has the audacity to put me in that situation?",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Right! That is such a weird place to start. I’d be instantly creeped the fuck out no matter who asked me that",
          "id": 195,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 539,
      "content": "NTA - you're paying that guy to do a job and bothering the babysitter AIN'T IT.",
      "id": 196,
      "comments": [
        {
          "score": 39,
          "content": "Yes! Correct.",
          "id": 197,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 520,
      "content": "NTA. As a former 16 year old girl who was routinely hit on by men older than my father, I can almost guarantee you that this babysitter was extremely uncomfortable and didnt know a safe way to diffuse the situation especially as she was in charge of kids at the time. Young women especially are socially conditioned to brush off men's comments so as to not make a fuss, and in doing so totally normalize predatory behavior. I wish someone like you had been looking out for me when I was her age.",
      "id": 198,
      "comments": [
        {
          "score": 271,
          "content": "That is awful! I would never want my daughter to feel the need to show courtesy with a creep. I’m so sorry that ever happened to you. \n\nAs a side, if you have any tips or book recommendations to make sure my daughter doesn’t become socially conditioned to brush off harassment then I would greatly appreciate it.",
          "id": 199,
          "comments": [
            {
              "score": 175,
              "content": "I dont have book recommendations but honestly you dont need them. Keep showing her the example of calling out the behavior and not tolerating it. That's the most powerful thing you can do. It's when everyone else in the room would rather move on than deal with problematic behavior that your daughter gets the message that she should just grin and bear it. As soon as one person calls it out everyone else normally falls in line, and more importantly your daughter will see that you're willing to sacrifice social comfort to stand up for her. That's how she'll learn that it's ok to stand up for herself and her friends when you're not around. You're doing great as a dad it sounds like on this front already, and I really appreciate your kind words to me.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Honestly, most children's books about famous feminist heros have moments in them where said woman was told she can't do something and she stood up for herself. Or she just  generally went against the societal norms. There are a lot of children's books that have strong female protagonists weather they are based off of famous people or not. Most of them teach lessons about standing up for what's right and for your beliefs. You obviously can teach these things without books but I would highly recommend having some anyways just so she can grow up reading about strong women.",
              "id": 201,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "It kind of seems like your wife is conditioned to brush off harassment too so you're gonna need a conversation with her as well since her behaviors also has  an impact on your children.",
              "id": 202,
              "comments": [
                {
                  "score": 5,
                  "content": "So much this! My family is filled with women and I'm the one breaking the cycle and it's been so hard to even get them to understand that it's not OK to let these things go. It's way easier when you're a kid and you have parents who teach you how to stand up for yourself instead of passively take the abuse. It has taken me years. If OP is committed to breaking the cycle and his wife can learn to rock the damn boat because it's the right thing to do, they're setting their child on the right path. Don't be like my family, do better!",
                  "id": 203,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I've never read it myself, but I've heard The Gift of Fear is really great, probably for when she's older",
              "id": 204,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "My odd advice to raise your daughter to stand up for herself: let her talk back to you. Avoid saying things like “Because I/we/they said so,” especially without explaining why you want her to do something. That trains kids to feel they must blindly obey authority figures and can’t speak up for themselves. Yes, as my mother often reminds me, it may make her harder to “control.” But do you want to raise a woman people can control?\n\nParents forget that they are their child’s first exposure to someone who holds power or rank over them. If you give her the confidence and empowerment to stand up to you, she’ll find it easier to stand up to anyone. \n\n* Also, IMO White knighting is sending the message “I’m overstepping cuz making you look weak makes me look strong.” The message you sent your sitter was “I’m stepping in because I’ve got your back.” That’s the difference.\n\nEDIT: 2 grammatical mistakes. Hate posting on my phone.",
              "id": 205,
              "comments": [
                {
                  "score": 7,
                  "content": "Re: white knighting, I can't help but feel like a lot of the times when someone accused someone else of white knighting, the point is to reinforce the culture of men allowing other men to pull some shit.",
                  "id": 206,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Thank you for this. I totally allow my daughter to 'talk back*' to me for exactly this reason. I'm damn near 40 and still feel weird standing up for myself. I don't want her to feel like this ever\n\n*I'll hear her out in any situation. She's very sweet and respectful, so it's not aggressive or anything",
                  "id": 207,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "You can also just talk to your kid about it in an age appropriate way - which means you will talk to your kid about it repeatedly as they grow up.",
              "id": 208,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "The same thing that happened to the babysitter happened to me frequently from hired hands on the farm and other random events my parents helped out with in town. I would say to always check in with your daughter especially if she starts acting different. Teaching her to come to you and your wife is great, but in my experience, I was too scared to go and tell them especially when one of them touched me inappropriately. They found out because I was avoiding him and came to ask me what happened. While I wouldn't now, as a child I was afraid that I would get in trouble for not being nice to a man that grabbed me and rubbed my body on his crouch. (I jumped down and ran away when I felt his penis because it scared me) I told them after and they took care of it. I was like 7-9? Idk exactly. \n\nI didn't like giving hugs to some people and sometimes I was forced to sit on relatives laps. I just thought as a kid I had to do what adults wanted me to do because I didn't have choice on other things. I figured it was the same at that age, but I felt very uncomfortable.\n\nMaybe a good tip would be not making her give hugs or sit on laps unless she wants. It really confused me when I was little.",
              "id": 209,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "As someone else suggested, \"The Gift of Fear\" is a really great book that's regularly recommended, but probably read it for yourself then gauge what age would be appropriate to give to her.  Unfortunately, there are a lot of men who love to prey on pre-pubescent girls (happened to me multiple times), even worse when they're 14-20yrs, so it may sadly be younger than you think :/",
              "id": 210,
              "comments": [
                {
                  "score": 3,
                  "content": "Seconded, I read The Gift If Fear and wish I had read it back in high school. In retrospect I had been in a lot of situations with predatory men that I could have spotted/escaped sooner.",
                  "id": 211,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I babysat for a single father of twins and he would hit on me, I was a 17 year old girl and needed the money. But eventually it got worse, so I had to quit. I applaud you for what you did for this girl.",
              "id": 212,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Honestly, seeing you do things like this, and hearing you say that women and girls shouldn't put up with this kind of thing, will do a lot to teach your daughter this. Also I highly recommend self defense classes. For one thing, obviously she would learn how to defend herself which is never a bad thing, but also knowing that you CAN defend yourself is a huge confidence boost. I took taekwondo for 3 years when I was in high school and just knowing how to throw a proper punch and get out of some common holds was such a good thing for me as a shy and anxious teenager. It's not a cure-all, and she's almost certainly still going to have situations with creepers  that are extremely uncomfortable, but it absolutely helps.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": "THIS! 👆I had a job at 16 bussing tables at a place my dad’s friend owned. I quit because his gross brother (also a friend of dad) kept making sexual comments about me whenever I was in the kitchen.  I was a loud mouthy teenager but when that happened, I just shut down. I didn’t tell my parents because I didn’t think they’d believe me and for years my dad said I was lazy for quitting. I’m 37 and only told them after the #metoo stuff why I actually quit. It shouldn’t be on a teenager to control a grown man. \n\n Also, I’m extremely disappointed in your wife.\n\nEdited to say NTA but you need to firmly state to the workers in your home that they are not to harass your babysitter (or anyone for that matter)",
          "id": 214,
          "comments": [
            {
              "score": 32,
              "content": "During a summer job while I was in college, I had a much older co-worker harass me, and at one point tickle my leg. The next summer, Co-worker was gone. For some reason my boss and I were talking about him and I told my boss what had happened the previous summer. He told me that he had wished he had known, because he would have put a stop to that behavior.",
              "id": 215,
              "comments": [
                {
                  "score": 6,
                  "content": "Tickling your leg? How gross. I’m sorry you had to deal with that.",
                  "id": 216,
                  "comments": [
                    {
                      "score": 4,
                      "content": "It was really gross, and I had no clue how to react. I tend to be a little deer in the headlights in unexpected situations, which has not always served me all that well.\n\nI've had a couple of other situations where bosses were disturbed when they found out co-workers or clients did things way after the fact. The reality is I just freeze and don't always think to tell anyone. Fortunately, nothing truly traumatizing has happened, and I am older and less prone to freezing.",
                      "id": 217,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 402,
      "content": "NTA. \n\nIf this was an entirely social occasion, perhaps I'd think differently, but both people were working. And maybe in a social setting your babysitter would've felt free to be more blunt herself, but felt differently since she was at work. \n\nIt's important to note too that the guy wasn't just asking those two questions you mentioned in your post - if I understand it right, it sounds like he asked her several questions prior to that and she was deflecting up to a point. \n\nThat said, the only one here who can really judge if you overstepped is the babysitter. I definitely wouldn't bring it up to her directly, but if she happens to say something to your wife about it, go from there in deciding how to handle it. My guess is that she was probably glad you said something.",
      "id": 218,
      "comments": [
        {
          "score": 316,
          "content": "Thank you for your input. I was going to offer moving the TV and my daughters toys up into the nursery so she wouldn’t have to deal with the people coming in and out. Hopefully it will be a polite work around without directly mentioning the awkwardness of it all.",
          "id": 219,
          "comments": [
            {
              "score": 621,
              "content": "I'd suggest you DO approach her directly about this. \"Hi, I wanted to check in with you about what happened earlier. Are you okay with the way I stepped in? Would you like me to do something differently next time?\" \n \nAt the end of that conversation, ask if she'd like her location to be adjusted while the workers are in the house, or any other different accommodations. I'd also give her full permission to tell the guy off.\n \nIf you were ready to REALLY step up, talk to the guy who was asking her all the questions. Pressuring for exact details about where someone lives, while ignoring their reluctance to share details, is a big red flag. Either the guy is a creeper seeing how far he can push, or (less likely) some guy who doesn't understand how stalker-y that was. Both need to be talked to, and you're in the power position to do that. Lay it out as unacceptable behavior, check for understanding, and outline consequences if it happens again. Mention it to the guy's supervisor too, as this would have a negative impact on the business and it gives them a chance to document the behaviour.",
              "id": 220,
              "comments": [
                {
                  "score": 411,
                  "content": "I like the cut of your jib. I’ll do that at lunch but I am going to check in with my wife before hand because she is the one I have to live with after this. Thank you for the input.",
                  "id": 221,
                  "comments": [
                    {
                      "score": 160,
                      "content": "Show your wife this thread if necessary. She is wrong in this instance and many have pointed out valid reasons why it was great you stepped in.\n\nNTA",
                      "id": 222,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 79,
                      "content": "I’m actually a little bit concerned about your wife’s comments about you white-knighting—it’s usually a term for men who defend women who do not need it in the hopes of gaining her sexual favor or having her “owe” him. It’s basically another way of saying “Nice Guy”. Is there a chance that your wife is feeling even the slightest bit jealous of the babysitter who is a college-aged and (presumably) reasonably attractive woman, and that’s why she perceived you rightfully defending the babysitter from a older creepy contractor as you attempting to (I hate even having to suggest it) “win her favor” ugh. If there is a chance of this, I’d just reiterate to her that the babysitter is your employee and it’s your legal and moral duty to protect her from your other employees, and that (holy shit) no you were not “white knighting” and you would have done the same for ANY person in that situation where it’s your responsibility to say something. If she IS jealous (even subconsciously) deep down, she may see your further attempts to rightfully handle the situation (I absolutely agree with XtacyG you should follow up with both the babysitter and the creepy worker) as more “white knighting.” Hopefully she didn’t know the full definition of the word—I prefer that explanation.",
                      "id": 223,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I would consider what you already did \"technically enough\". Going any further or directly addressing it after the fact I'd make sure you and your wife are on the same page first. \n\nShe might not have liked you stepping in but she may be perfectly fine (and I'd hop so) that you check with your sitter to make sure she is comfortable. \n\nAfter all, contractors are temporary and you don't want to run off a good babysitter because of some random creep.",
                      "id": 224,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Did you chat with the sitter and your wife about it?",
                      "id": 225,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "Are you a life coach? From this answer, I would pay you to coach my life.",
                  "id": 226,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I think that's really fair and a good solution.",
              "id": 227,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}