{
  "post content": "I (32m, white) am potentially in trouble at work, but I don't really think I deserve it.\n\nMy coworker, \"Anna\" (23-ish f, asian), is new at our office and she brings her own lunch on days we don't have a food truck. On Thursday (yesterday), she brought in a homemade stir fry and used our shared microwave in the break room to do it. I was in the room when she took it out of the microwave, and it smelled heavenly. I asked her about the recipe and she told me it was just a bunch of ingredients and spices thrown together as to not waste any veggies that might go bad soon. \n\nWhen I was telling her how good it smelled, I also mentioned that some other people at the office might think it would be too smelly or ethnic (as in, racist people tend to look down on \"ethnic\" things). I have read those kind of stories on here about microagressions when it comes to people of color and the food they bring in, and I wanted to warn her that she might not want to bring it in anymore so it doesn't happen to her. I emphasized that it smelled good to me personally, though.\n\nI guess a couple of the other co-workers in the room overheard our conversation, because after Anna left the room, some of them sort of quietly told me how it was inappropriate for me to have said that. I told them that it's true, that ethnic food gets ridiculed for smelling too strong and that I disagreed with that senitment, but I also think she would face less harassment if she didn't bring in that food anymore. One of my other coworkers then said that \"I was the only one harassing her\" and making insinuations that her food is problematic, plus the fact that she hasn't even been bringing in her own food that often since she just started last week, so there couldn't have been an opportunity to have had this hypothetical harassment happen to her. I just wanted people, yes, even the assholes, at the office to make her feel welcomed.\n\nI left work that day not thinking anything of it, until the following morning where I hear from a different coworker that Anna talked to our HR department about the conversation and how she was \"hurt\". I'm a bit frustrated as to why she didn't talk to me about it first since it was just a misunderstanding and that I'm looking out for her. I did notice that today she was trying to dodge me, which is unusual and a bit heartbreaking. I just want to work things out. I wanted to be a friend to her and help her out since this is one of her first jobs out of undergrad, but this has been blown of out proportion. Now my coworkers think I'm racist, but I really try my best to be an ally, but then again what do I know?\n\nSo, am I the asshole for telling her that her food might be a bit too much for other potentitally racist people in the office to handle?\n\nEDIT: Some people have said to edit this post to add this: yes, I get it, I'm the asshole. What I said was really stupid. If it means anything to you guys, I remember entering the workforce as a young man shadowing assholes and I didn't know how to express how shitty I was treated since I thought it was normal to be treated a certain way or overhear certain things. I just thought she was a sweet girl who didn't deserve to see the nasty side of corporate life so quick, but I guess I ended up being like the guys that made my earlier career so god awful. \n\nAnyway I want to apologize to her in the most HR-friendly way this Tuesday. Hopefully she doesn't quit, but I also don't want to be the one that gets fired. Fingers crossed. Thank you for opening my eyes and I hope to do my due diligence to be a real ally.",
  "id": 1,
  "comments": [
    {
      "score": 45198,
      "content": "YTA.\n\nYou are the mircoagressor\n\nEdit: Whoa!!! Thank you everyone for the awards.  And yes, to everyone who said Macroaggressor but a special round of applause for the person who said “Mircowave-aggressor.”",
      "id": 2,
      "comments": [
        {
          "score": 18673,
          "content": "OP: \"I've read some stuff about micro-aggressions\"\n\nAlso-OP: \"some un-named people might think your food is too ethnic and smelly\".\n\nFFS.",
          "id": 3,
          "comments": [
            {
              "score": 7080,
              "content": "\"I've read some stuff about microaggressions\"\nclearly not enough! read more!",
              "id": 4,
              "comments": [
                {
                  "score": 4646,
                  "content": "He got through the \"how to\" chapter.  Skipped \"Just Don't.\"",
                  "id": 5,
                  "comments": [
                    {
                      "score": 903,
                      "content": "He did read the \"Just Don't\" chapter. He just missed the \"Don't\" part.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 308,
                      "content": "probably just read the title of the article\n\nETHNIC FOOD MICROAGGRESSIONS IN THE OFFICE",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 21,
                      "content": "😂🤣😂 All hat, no cattle? 🤙🏽",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2078,
                  "content": "OP YTA I think the saying is when you do not know how the racist in the room is, its probably you.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 987,
                      "content": "Right??? Also, am I the only one looking at the ages/genders and thinking he could have been trying to buddy up to her because he “just happens to prefer Asian women”?\n\nOP, YTA. She shouldn’t have to dodge you.\n(Edited in the name of civility)",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "“When it smells like shit everywhere you go, check the bottom of your shoe because it’s probably you.”",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 520,
                  "content": "All he read was 'How to be a microagressor for Dummies ' 🤣",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 160,
                  "content": "I’d say he’s got the hang of it already.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "\"I'm a bit frustrated that she didn't talk to me about it first\"\n\nSo now you're demanding that the person you harassed and aggressed confronts you about it instead of handling it in a way that felt safe and comfortable for them?\n\nTHE ABSOLUTE CLUELESSNESS AND ENTITLEMENT.",
                  "id": 14,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "He read enough... Just thought it was an instructional manual.",
                  "id": 15,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "😂",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2198,
              "content": "Reads as white savior complex. OP’s version of help was infantilizing and presumptive. She was right to go to HR. I can’t believe how OP doesn’t see he created a hostile work environment which emphasizes that she is different and doesn’t belong. Secondarily infantilizing and presumptive against the rest of his coworkers when he assumed they wouldn’t like her food. All around YTA.",
              "id": 17,
              "comments": [
                {
                  "score": 572,
                  "content": "Exactly! Of course she went to HR! After that incident, I can't imagine she'd feel comfortable to approach OP to inform him how his remarks were hurtful, especially as she's also new and this was the limited experience she had with OP. Then OP is confused she's now avoiding him, too. Again, of course she would! She's not going to put herself in another situation she might have to endure OP saying even more inappropriate things to her and she'd have to go to HR again. 🤦🏻‍♀️",
                  "id": 18,
                  "comments": [
                    {
                      "score": 577,
                      "content": "Extra suspish that he flipped the script into victim mode by expressing his confusion for her not coming to him to talk about it. There’s a lot going on with OP.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 104,
                      "content": "Plus he doesn’t seem open to considering how he was in the wrong here.  She’s avoiding him and went to hr and their coworkers had to speak up and intervene. Most people would realize from that they messed up and an apology was in order.  Without that level of awareness on OP’s part a direct conversation is unlikely to be productive. So it’s understandable Anna went to HR",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "The fact that he even expects that she should have approached him after that is pure entitlement.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Exactly. He basically said fit in or you will suffer 🙈",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 534,
                  "content": ">white savior complex\n\n\"I'm going to save you from something that hasn't happened to you here yet!\"\n\n... until now.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 415,
                      "content": "Also what a great way to paint everyone in the else in the office as a lurking racist while only he is safe as a Fantastic Ally 😒 definitely a legitimate way to make your new much younger female colleague feel welcomed in the workplace.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 178,
                      "content": "It's so paternalistic and trying to get her to assimilate to white culture. Ugh.",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 50,
                      "content": "Nope, more like \" I am going to create the problem I think you need saving from.\"",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 24,
                      "content": "It reeks of I'm putting you back into your place so the racist don't have to.",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 21,
                      "content": "He's looking out for her by telling her people might, somewhere at some point, not like her food..........\n\nPretty sure she already knows that. \n\nDude mansplained racism.",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "\"I don't know if youve heard of racism, but I read that...\" I'm sure she has not only read about it, and heard it, but has experinced it herself. Why would she need to be manspained about it as an adult. so strange. I wonder if he also hinted she should make him a stir fry, away from the office, since he enjoyed the aroma.",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "And assume she's *never* experienced this before, so there's absolutely *noooooo* way she could have *pooosibly* known this was a potential problem she might face. 🙄🙄🙄",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 150,
                  "content": "Exactly. What stood out to me is how infantilizig OP was to Anna. I mean, why does he assume she needs to be told that? Doesn't he think she is an adult who realizes that there is such a thing as prejudice against other cultures in the world?\n\nPlus, he was the only one bringing up racism. Why not deal with it if / when it shows up?\n\nAlso, why does he think that, if/when someone is racist because of her cooking, the best solution is to stop bringing her food to the workplace? He allegedly read a lot about microaggressions, and his takeaway is that people should avoid doing anything that could invite microaggressions so as to be welcomed?\n\nHow does he think he was protecting or helping her in any way with these comments?\n\nAnd, as you mentioned, OP insulted their coworkers as well.\n\nThere are just too many layers of AH-ry to unpack here.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 90,
                  "content": "Outstanding comment! I only wish the recipient of this assholery could read our comments. I’m so proud of her for going to HR! Dodging him, or even trying to be nice and be friendly to him sounds like me at my first truly great job using my degree. And it didn’t end well. He (my direct supervisor) became such a creeper that I dreaded work and ended up leaving the company. Only found out that it wasn’t me who the other researchers didn’t like after I formally resigned. I was told by a former coworker that an established senior PhD- who seemed like she was always leaving the lab when I came in- did so because she was disgusted by his behavior and comments to me. After I left, she went to HR and filed a complaint against him. When he was called in, he chuckled and said “Let me guess, this is about (insert my name).” \n\nSensitivity training for him, I still feel safe saying nightmares for his future underlings, and an extended job hunt for me. Winners all around. /s\n\nYTA OP. Thanks for making someone’s first “real” job an uncomfortable and scary situation.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "New girl starts office job. Guy approaches her and says, \"Just so you know, because you're Asian. There are some racists in this office. Not saying who, but yeah.\"\n\nNow new girl is paranoid.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Not to mention the fact that she clearly knows how to handle harassment in the workplace.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Not to mention his advice: \"Just don't bring in anymore of that ethnic stuff and you'll be fine, 'mkay?\" Awesome.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 8,
                      "content": "The “ethnic food” is so out-of-date. “Yep just don’t bring any more of that stinky food you have been eating your whole life and you’ll settle in just fine around the office, mkay. Welcome aboard and be careful of the ‘other racists’…but I’m not racist.“",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 21,
                  "content": "Not to mention the sheer ignorance in the idea that the coworker didn’t know how to navigate a world where racism exists. 🙄",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I was thinking White Knight Complex personally,  \"Fear not, fair young damsel!  I will protect you from all the evils of this kingdom!  I ask for nothing but your affection in return for I am such a Nice Guy.\"\n\nNow imagine someone actually does privately speak up about hating the smell of her food.  Anna is going to immediately assume it was OP and I wouldn't blame her one bit.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Exactly he rode in on his white steed to tell her that her “ethnic food” is stinky. Thank you sooo much sir knight. I feel so much better being singled out…I’ll be sure to comply to the norm to save myself in the future.\n\nOh man the self-appointed “nice guy.” The nice guy isn’t so nice when he presses upon you his identity of a “nice guy.”",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I have rarely read a more disingenuous screed lacking in self awareness.\n\nAll his pearl clutching about misunderstandings and just looking after her and \"I thought I was being an ally, what do I know\"\n\nWhat a scunner.",
                  "id": 40,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 734,
              "content": "But I reassured her it’s not me I like the smell",
              "id": 41,
              "comments": [
                {
                  "score": 560,
                  "content": "Some people might think your shampoo is too floral, but not me, I like the scent.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 797,
                      "content": "Some people might say you’re ugly, but let me reassure you, you don’t make me gag",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 250,
                      "content": "But I highly suggest you switch to something less floral because *some people* (but totally not me) won’t like it. \n\nBut I like it. It’s not me. I’m not some people.",
                      "id": 44,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 189,
                      "content": "In fact would you mind if I just occasionally stand right behind you and smell your hair while saying nothing? Oh btw there might be some ppl here who would sexually harass you, but not me, I just wanna smell your hair sometimes.",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "Gah. creepy!",
                      "id": 46,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 294,
                  "content": "You should have targeted anyone makings comments about the food, not her for eating her lunch. YTA",
                  "id": 47,
                  "comments": [
                    {
                      "score": 25,
                      "content": "At the very least, say that IF someone makes negative comments about her food, she can count on him to stand up for her. But idk why he even brought this up if it hasn't even happened 🤦‍♀️\n\nIn the future, just tell a person that their food smells delicious and stop there ffs.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "THIS",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 293,
                  "content": "Makes me wonder is he is one of those that says, but I can’t be racist because I have ______ friends.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 181,
                      "content": "OP *tries to be* an ally",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 165,
                      "content": "OP: I can’t be racist, I work with Anna",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "My sister always says \"my bf isn't racist, he has friends that aren't white, and would never hurt them\", even though he has said countless racist things, talks the way people did when being racist towards Asian people, and even talks the way people do when making fun of the mentally impaired",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "Reminds me of like the stereotypical mean girl passive aggressive type of language. \"Some may say your dress looks like a trash bag. Not me. I think you're daring\"",
                  "id": 54,
                  "comments": [
                    {
                      "score": 17,
                      "content": "You’re so brave to leave the house like that, I wish I had your self confidence.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "\"You look gorgeous in this outfit but yeah, you might want to change before going out, because someone might SA you\"\nYTA",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "He is the type that will also say, \"Some people would never sleep with someone outside their race, but I would have sex with you if you let me.\"",
                  "id": 57,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 688,
              "content": "Yeah, the fact he couldn't name anyone and that it hasn't happened before makes me think the workplace might be relatively racist-free. And yet, here comes OP to stir up trouble anyway! \n\nYTA, OP. Do you really think she isn't aware of how microaggressions work and needed you to explain them to her?",
              "id": 58,
              "comments": [
                {
                  "score": 1211,
                  "content": "\"I, a white man, am telling you, an Asian woman, that you should definitely change the way you exist to prevent anyone from doing a racist at you.\"",
                  "id": 59,
                  "comments": [
                    {
                      "score": 565,
                      "content": "“As a white male I advise you to comply and assimilate with the masses of this office to prevent racism…”",
                      "id": 60,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 56,
                      "content": "i was assuming he was just wanting to eat her food and wanted to hurt her feelings by being a racist asshole so she’d give it to him out of embarrassment but this makes way more sense to me 😂",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "And if you don’t change and get harassed, you’re at fault because “I told you so”.",
                      "id": 62,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "“I will also protect you from the other racists.  Ya know, like a savior.  You can thank me by coming to my place at 8p for dinner. I’ll be making rohypnol. Old family recipe.”",
                      "id": 63,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "He’s white knighting! White white knighting?",
                      "id": 64,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "That got me too. XD\n\n\"I am a white man, I have never witnessed racism at this place, but let met tell you there might be racism!\"\n\nI can imagine her standing there and thinking. \"No shit sherlock.\"",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Right? Like someone who has most likely experienced this more than once (read too many times to count) needs a white guy, who read something about it once,  to explain it to her.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 550,
              "content": "I thought he was going to say that there were people in the office that complain about food smells, but then he said that he has only READ about that happening. Lordt.\n\nEdit: thought OP was female.",
              "id": 67,
              "comments": [
                {
                  "score": 190,
                  "content": "I thought OP was a woman as well. That they're a man adds a whole new frame of context.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 168,
                      "content": "I assumed OP was a man. Not sure why.",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 109,
                  "content": "Can we all at least agree that there is a special place in hell for those people that put fish in the office microwave?",
                  "id": 70,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yeah,  my hubby cooked some amazing fish and asked if I wanted the leftovers for lunch.  It is very obvious he works outside and not in an open plan office with a kitchenette (read microwave and kettle in the corner of an office).",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "That’s where I thought this story was going at first so I was thinking I might be on his side. Then I realized it was just…veggies???? Then I realized that he’s just a “nice guy” that clearly wants to fuck her but is too socially inept to flirt so he said this dumb shit in an attempt to become her white knight. Truly embarrassing.",
                      "id": 72,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 183,
              "content": "And it’s a stir fry ffs. A meal most people of all ethnicities are familiar with cooking and eating. It’s not like she was cutting a durian.",
              "id": 73,
              "comments": [
                {
                  "score": 22,
                  "content": "I thought it was going to be fish smelling up the microwave, not something they all probably already order for lunch anyway.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Reheated fish in the break room is the worst!!",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "If she was cutting a durian, I would have no problem asking her not to bring it to work 😂 that’s like the no fish in the microwave rule. \n\nBut yeah I really thought it would be pigs feet or something (still wouldn’t be okay to do that OP did) but stir fry????????",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I'm thinking of how I could make the world's smelliest stir fry and short of using expired ingredients, I'm coming up pretty empty.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "My thought too. “Stir-fry” is in every 5 minute cook book these days.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 146,
              "content": "I had a boss who would do exactly this kind of thing - proclaim to all and sundry how much she cared, etc and then would make the most offensive, boneheaded comments.",
              "id": 79,
              "comments": [
                {
                  "score": 86,
                  "content": "Very Michael Scott lol",
                  "id": 80,
                  "comments": [
                    {
                      "score": 9,
                      "content": "“Oh wow, you are so exotic looking. Was your dad a GI?”",
                      "id": 81,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 85,
              "content": "Yep - I could see it if it were a case of “X and Y have been known to make comments about food smells so just be aware of that” but this was just OP being racist.",
              "id": 82,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 31,
              "content": "This has to be fake wtf",
              "id": 83,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Ten bucks says it was literally just sesame oil",
              "id": 84,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1567,
          "content": "OP thinks he's the white knight as if we dont live every day knowing about the potential racism in the work place, especially with our food (lmao)!\n\nEdit: YTA op",
          "id": 85,
          "comments": [
            {
              "score": 778,
              "content": "“Just  in case you, who has suffered from racism your whole life, didn’t know, people can be racist.”",
              "id": 86,
              "comments": [
                {
                  "score": 518,
                  "content": "Someone needs to mansplain racism to a woman of color. Otherwise, how would she know about it? /s",
                  "id": 87,
                  "comments": [
                    {
                      "score": 291,
                      "content": "This is one of the most egregious cases of mansplaining I’ve ever come across. Breathtaking amounts of audacity.",
                      "id": 88,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 86,
                  "content": "Haha! Right? Jeez, I hope she’s never in the car w her …”I think you drive wonderfully, but …”",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "OP is so woke /s",
                  "id": 90,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 313,
              "content": "I did laugh at this because REALLY. How much you want to bet he softened this encounter telling it on Reddit to make his armor real shiny? LMAO!\n\nCapital A Capital H.",
              "id": 91,
              "comments": [
                {
                  "score": 89,
                  "content": "And still made himself sound awful lmao",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "😆 I hadn't even thought that far but I'm so sure you're right... Oh wow. This poor ridiculous dude I feel bad for him.. but moreso every single person that has to be around him.....",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 183,
              "content": "It’s like mansplaining but make it racist. \n\nI didn’t know what to expect when I started this but wowee. YTA OP",
              "id": 94,
              "comments": [
                {
                  "score": 8,
                  "content": "OP and Y’all should watch demon 79, last episode of the latest black mirror season. This played out the plot to a tee",
                  "id": 95,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 57,
              "content": "He is the white knight - protecting the racists' feelings.",
              "id": 96,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1201,
          "content": "For real!!!\n\nI wish \"allies\" would understand that telling people to edit themselves so racists won't target them is akin to telling a woman not to wear a skirt to avoid rape.\n\nMan. This person is a total AH",
          "id": 97,
          "comments": [
            {
              "score": 164,
              "content": "YES, this is the absolute best explanation to OP. You should make this a reply to OP.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "Next time just bring your own stinky-ass lunch the next day and eat alongside them.",
              "id": 99,
              "comments": [
                {
                  "score": 15,
                  "content": "This!!!   But let's not call it stinky-ass.  My fried rice smells amazing, not stinky.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Behold, tuna casserole, the food of my people. Where's that microwave?",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "He may have been saving THAT talk until her second week. But now he won’t get to bc she’s wearing skirts and dodging him. Which is a little bit heartbreaking I mean he’s just looking out for her!",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Some people might say Op is an ignorant racist but I personally like his micro aggressions and white savior complex. I’ve read about this kind of behavior offending some people so it’s probably best to just not be an asshat at the office.",
              "id": 103,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 732,
          "content": "The call is coming from inside the house.\n\nYTA OP.",
          "id": 104,
          "comments": [
            {
              "score": 70,
              "content": "Even in this context that phrase freaks me out.  But it's accurate here.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "I SCREAMed at this comment.",
              "id": 106,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 414,
          "content": "OP: \"Hey, your food stinks\".\n\nAlso OP: \"Welcome! Is everyone making you feel welcome? Everyone, gather around the Asian lady and welcome her! Ok, now let's clap at her\".",
          "id": 107,
          "comments": [
            {
              "score": 113,
              "content": "You say this jokingly but I once witnessed almost the exact scenario at a job of mine. . A room full of white people clapping at a black woman. (And metaphorically patting themselves on the back for being *~*~*~allies~*~*~*.) 🤢 She was obviously super uncomfortable but the clapping and shrill white baby voices seemed to go on forever. The way everyone treated her was super racist, condescending and infantilizing. I cringe from secondhand shame every time I think about it.\n\nEdit: and yes, OP is giving Michael Scott vibes.",
              "id": 108,
              "comments": [
                {
                  "score": 12,
                  "content": "Several years ago, my last company hired a man (\"D\") in early January for what I naively assumed was him being qualified for the job and eager to learn more about the trade. I am our field trainer and was tasked with taking him on as an apprentice.  The guy was awesome. Always early, had a great attitude even when jobs were difficult, and was just a generally great person to work with. On the 30th of January, the office called me and told me, \"We are starting to do a monthly employee highlight and want D to be the first one. Please take some pictures of him and send them over. \" \nI told D every detail of the call. \nD sighed and said, \"I know what they are doing, but it is okay.\"\nThe first week of February rolls around, and our company social media page posts a picture of D saying bullshit about black history month and how glad they are that D works for them. \nThey distilled every good thing about a great employee away in order to make him the token black guy on social media. And he predicted what they were doing. \nThat company sucked.\n\nOh, and OP: YTA",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 48,
              "content": "This made me laugh out loud.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I'm surprised he didn't ask her \"Where are you from? No, where are you REALLY from?\" 🥲🥲",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 384,
          "content": "It wasn't even that micro!",
          "id": 112,
          "comments": [
            {
              "score": 339,
              "content": "Agreed. This was unfortunately aggression disguised as \"just trying to help\". OP became the problem he thought he was \"helping\" to avoid. :/",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 238,
          "content": "OP is the reason the rest of us have to attend sensitivity training. Ally my WASP ass.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 184,
          "content": "OP like: “I know some people will be racist to you therefore you should act more white so they won’t”",
          "id": 115,
          "comments": [
            {
              "score": 11,
              "content": "That was the message. I just want her veggie stir fry .",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Perfectly summed up. This person is a massive dipshit",
              "id": 117,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 179,
          "content": "Unless it’s fish being heated in the microwave, this person made a borderline racist comment. Also maybe not so borderline.",
          "id": 118,
          "comments": [
            {
              "score": 124,
              "content": "I came to say this. Fish(of any ethnic group) is totally offensive reheated in a microwave.",
              "id": 119,
              "comments": [
                {
                  "score": 35,
                  "content": "Hey, fish have a difficult enough time being out of water without us being racist to them too.\n\n/J (obviously, but you never know)",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "My mother-in-law was genuinely outraged her boss was picking on smelly, poor people \"Southern\" food when she told her to stop microwaving fish.  🤦‍♀️ \n\nAnyway I'm not sensitive to smells and don't think it's wrong regardless, but I'd personally never heat up something that could intrude on someone's space. I'm definitely the type that adapts to others and consider that the ideal (and I ironically wonder how much of that is from having an asian mother, lol.)",
                  "id": 121,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 78,
              "content": "Yeah. I was expecting it to be fish or eel or something truly smelly, not stir-fry. OP = Racist AH.",
              "id": 122,
              "comments": [
                {
                  "score": 7,
                  "content": "Yeah, I’ve never seen a stir-fry smell strongly after being microwaved. OP’s story makes no sense.",
                  "id": 123,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 60,
          "content": "I was just about to type this word for word. OP is the type to get offended for a poc, it’s funny/ridiculous. It just makes me wary of them",
          "id": 124,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 19928,
      "content": "YTA. Your coworker is a grown woman who's been Asian her entire life. Do you genuinely think she's unaware that racism exists? All you did was put her on edge around coworkers who may not even be racist! Congratulations, you're the one who created the microagression.",
      "id": 125,
      "comments": [
        {
          "score": 4550,
          "content": "Exactly. She's going to be well-aware and if she isn't somehow, maybe your workplace won't be full of AHs. The OP went out of his way to make her self-conscious and create a problem that doesn't exist.\n\nYTA. Also, OP,  you should also be aware that plenty of people who claim to be allies pull stuff like this. \"Kindness\" that is condescending at best or at worse, a cover for their bigoted opinions by deflecting the blame onto others. I don't blame her for going to HR.",
          "id": 126,
          "comments": [
            {
              "score": 432,
              "content": "It’s giving ‘high school mean girl,’ vibes.",
              "id": 127,
              "comments": [
                {
                  "score": 30,
                  "content": "OP is so not fetch",
                  "id": 128,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Stop trying to make *fetch* happen. It’s NOT going to happen!",
                      "id": 129,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "\"I\" dont think your food is smelly but \"SOMEONE\" around here might. Absolutely OP YTA.",
                  "id": 130,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "nah it's giving mansplaining white savior vibes to me",
                  "id": 131,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "> maybe your workplace won't be full of AHs\n\nWell, other than him.",
              "id": 132,
              "comments": [
                {
                  "score": 7,
                  "content": "While one bad apple can spoil the whole bunch, it seems like the rest of the workplace is okay if coworkers called him in and HR seems to be doing something.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Dude really pulled a \"just want you to know that personally I don't have a problem with you being here\" and is confused why the girl is creeped out lmao",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Exactly.  I have been hurt by those people who feel the need to tell me something \"for my own good\".",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yeah it sounded to me like he was trying to white wash her when no one had a problem",
              "id": 136,
              "comments": [
                {
                  "score": 10,
                  "content": "Also, if he didn’t have a problem with it, why not, if he HAS to say anything, tell her if anyone gives her trouble about heating up food that he’ll back her up because it smells delicious? What he said was “hey there, you asian you. Now *i* don’t have a problem with your *gestures flippantly* butttttttt racists gonna racist so instead of fixing the racism and standing up to it, you should just do exactly what the hypothetical racists want so the racists don’t get upset about it in the first place, silly goose. I mean, yeah it’s wrong but why stand up against it when you can just not do anything to upset them? Good talk, sport!”",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2873,
          "content": "White people “teaching” POC about racism (sigh",
          "id": 138,
          "comments": [
            {
              "score": 1885,
              "content": "and the whole \"*why didn't she come to me first!\"* bs. Uhm, because you were the one who made the racist interaction in the first place and she knows exactly what it would be like to try and explain to a White coworker how hurtful, upsetting and racist it was.  I mean the whole tone of the post is all \"but that wasn't my intention\" so I'm guessing OP probably has no concept about emotional labor and what that entails as a minority woman.",
              "id": 139,
              "comments": [
                {
                  "score": 216,
                  "content": "If we post enough about it here, do you think he might read about it?",
                  "id": 140,
                  "comments": [
                    {
                      "score": 13,
                      "content": "He may read it but will he remember it...? 😬",
                      "id": 141,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "He'll read it, but he and his toxic activism are rescuing her from all the \"real\" racists of the world so obviously it doesn't apply to him. \n/s",
                      "id": 142,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "🎯 nailed it!",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Lol the tone of the post is “please vindicate me and give me some useful phrases I can use in the disciplinary meeting I’ll be in tomorrow morning.”",
                  "id": 144,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "yup yup.  if that asian american speaks to him 1 to 1.  \n\nOP should :  “why you people so sensitive, i am, a white knight, trying to save you weak asian women from being affected by racism here. i am a white knight, you should thank me by cooking that wonderfully asian dinner for me “",
                  "id": 145,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "So many people do not understand this concept. It is not minorities' job to teach other people how not to be racist. Or rather, try to teach because so many of them don't really seem to want to learn. That's not to say that someone who is a minority will not occasionally do this. But it should be their choice. Not their responsibility.",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Mhmm. She's probably had to deal with racists before and knew that it's not worth it. A lot of times you take it up with them and *they'll* go to HR about *you*. It doesn't stop the comments or behavior either.",
                  "id": 147,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Op 100% has zero concept of that. Probably lives under a rock too",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "But see, if she just acted white and ate chicken nuggets with mayo, then the racist people in the office will be a bit less racist towards her personally! She's eating vegetables?! Come on. How is that not asking for trouble?\n\nWtf",
                  "id": 149,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "\"But it wasn't my intention! \" as said by Sarah Boone.",
                  "id": 150,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 116,
              "content": "I encountered this recently. Haven’t laughed that hard in ages tbh.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 112,
              "content": "Ya’ll remember that one teacher from “Everybody Hates Chris” that would say the most outta pocket stuff thinking she’s helping?",
              "id": 152,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Always gets a chuckle out of me. I’m Latino. Once had an in-class interaction with a white girl in college who was adamant that I should be insulted by the word “Mexican,” as though my origin itself was a slur. \n\nI told her she should really check her own prejudice if my country of origin was insulting to her. I’ve been called actually worse things and “Mexican” is a term I wear with honor.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 577,
          "content": "OP also specifically did a racism by singling her out for being different and making her feel self-conscious about her food being too ethnic. OP IS the racist coworker. Framing racism as benevolence or concern, even if OP was sincere on both those fronts, doesn't make it any less racist to essentially tell her Asian coworker that maybe she should be less Asian.",
          "id": 154,
          "comments": [
            {
              "score": 60,
              "content": "He even said that she would probably be harassed less if she didn’t bring it to the work place as often. Kind of glossed over it but he wrote it",
              "id": 155,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "The workplace lunchtime context reminds me of hostility towards fat people disguised as concern for their health. It's not really about their wellbeing and it's not saving them from harassment, it *is* harassment and it *is* negatively affecting their wellbeing. You're literally singling someone out and treating them differently. Intention is irrelevant as you're still treating them differently. Just... shush.\n\nOP sounds like the type of person who would escalate because they've been 'nothing but kind' and they'd rather double down self-righteously than face the shame they're projecting onto folks who just want to eat lunch in peace.",
              "id": 156,
              "comments": [
                {
                  "score": 9,
                  "content": ">Intention is irrelevant as you're still treating them differently.\n\n100%",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 565,
          "content": "“I’m sorry to be the one to break it to you. But there are racists. Not me of course.”",
          "id": 158,
          "comments": [
            {
              "score": 90,
              "content": "“So you should be a little bit more worried about bringing your stinky ass food into the office”",
              "id": 159,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "“i’m not judging you but i’m just saying people who i will not be naming are gonna and i’m gonna prolong this weird and awfully inappropriate conversation by assuring you i personally don’t mind”",
              "id": 160,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "*\"I have read somewhere that racists exist, did you know that? I didn't until I read about it, who would've guessed\"*",
              "id": 161,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 272,
          "content": "‘You may not have noticed (all your life) but you’re being Asian in a safe white space (America)’",
          "id": 162,
          "comments": [
            {
              "score": 21,
              "content": "And his entire narrative that Asian Americans are ethnic is so white centric.",
              "id": 163,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "B-but he read about it! So he has just as much experience as her!\n\n/s",
          "id": 164,
          "comments": [
            {
              "score": 10,
              "content": "**but I was trying to help her!!**\n\n*cries hard in white saviour*",
              "id": 165,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 37,
          "content": "This part! Anna knows what she is.",
          "id": 166,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I know, right? Instead of speaking out when others are being racist, OP is choosing to patrol on their behalf. This is some prime \"good cop\" bullying.",
          "id": 167,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Also a litmus test: I (34f, white) regularly bring spicy stir frys, legume curries, fragrant soups etc to the office to heat in the microwave. Would OP have had a conversation with me about the fact my food smells \"too ethnic\", and might be upsetting to others in the workplace?\n\nYTA",
          "id": 168,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "But... but... he's just looking out for his Asian co-worker! He wanted to show her how cool he  is with people of colour by repeatedly saying how heavenly her ethnic food smells!",
          "id": 169,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15516,
      "content": "Anna is Asian and she brought a *stir fry*, a dish that is so Westernized, it has its own English name (as opposed to sushi or pad thai), so you felt the need to let her know that potentially racists might target her food based on race. Would you have done the same for a white person eating a stir fry at work?\n\n* Ana is Asian and you treated her differently because of her race. That's racism. \n* You were on the look out for her, protecting her against a situation that didn't arise. Ever heard of the \"White Saviour Complex\"?\n* Instead of thinking \"if the racists arise, I will tell them off\", you thought \"She should erase herself, so the racists get no ammunition\". That's not how you help people from minority group. You don't ask them to code-switch so the sensitivities of the bigoted can be protected. \n* The hell is \"ethnic\"? \"Not white\"?\n* Why do you say that she was \"hurt\" with quote marks? Who are you to decide that her feelings are not valid?\n\nIf someone approached you to tell you \"Other people might maybe think [you're a potential mass shooter]/[you can't dance]/[the spiciest condiment you can handle is mayo]/[you will start mansplain everything], but they're being racist and/or sexist, **I** for one think you're swell! :D\", unprompted, wouldn't you feel at least a little bit annoyed with their unneeded intervention?\n\nYTA. Go apologize.",
      "id": 170,
      "comments": [
        {
          "score": 6721,
          "content": "*\"I think your outfit is cute but some other people might think it's slutty. You might want to dress more modestly so you don't encourage sexual harassment.\"*\n\nThis is the energy OP is giving.",
          "id": 171,
          "comments": [
            {
              "score": 631,
              "content": "Thanks for reuniting me with purity culture memories 😜",
              "id": 172,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 231,
              "content": "I was gonnaaa say. Giving “dont dress like that if you don’t want trouble”",
              "id": 173,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 92,
              "content": "So when I was in law school, there was a hypothetical in my evidence class asking if it was admissible in a sexual harassment case for a man who harassed a woman at a factory job to have admitted as evidence that this woman was also a stripper. \n\nA guy in my class said yes, it is relevant. \n\nI chewed him the fuck out, and I’m generally a quiet person. \n\nI find it odd that these situations often seem to come up with white men. It reeks of entitlement and lack of perspective.",
              "id": 174,
              "comments": [
                {
                  "score": 22,
                  "content": "oh man, I bet someone could do (and probably has done) an entire PhD level dissertation on  that scenario. And you know they understand the concept because if you asked that same guy about \"this man was murdered by being bludgeoned to death does it matter that he was a professional boxer\" he would easily say \"oh no that's not relevant!\".",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Let's hope that fool learned from the situation... but sadly, he probably didn't.\n\nEveryone else in class did though.",
                  "id": 176,
                  "comments": [
                    {
                      "score": 6,
                      "content": "He was also an idiot because it isn’t admissible based on the rules of evidence. But also he’s an asshole.",
                      "id": 177,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Exactly this. “I don’t think it smells bad but others might”\n\nYTA and a huge one at that",
              "id": 178,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "He’s giving off strong “look, I would have voted for Obama a third time if I could, but…” vibes right about now as well.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Exactly the situation it reminded me\nLike don't go after people wearing short skirts, go after the rapists\nSame with don't go after the Asian community, go after the racists",
              "id": 180,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "“I think it’s great you’re comfortable going to the bar alone for a drink, but some guys might see you as vulnerable and try to take advantage.” *shudders*",
              "id": 181,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Somebody, not me of course, but somebody in the office might have a problem with how you dress.\n\nNarrator: it was indeed them who had a problem with it\n\nThat’s the vibe OP was giving off even if he didn’t mean it that way. On top of mansplaining the racism she’s experienced her whole life and acting like stir fry was so exotic the white coworkers could be so unfamiliar with it they might find it off putting.\n\nLike she was cutting durian in the office then microwaving it.",
              "id": 182,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "This is a great parallel, and I hope OP sees it.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "\"Not me though, I only find how you dress flattering\"\n\nAlso OP,",
              "id": 184,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 812,
          "content": "Very good points.  I would also like to know what \"that food\" is that Anna shouldn't bring in anymore... vegetables?  Spices? Things that are stir-fried?  Just generally the food that Anna eats to live?  Can she keep making stir fry, but OP thinks she shouldn't use so many spices?  \n\nWhen I started reading this, I assumed OP was going to say that Anna was reheating fish in the microwave, or something.  But I can assure OP that white people (I'm going on the assumption that this took place in the US or UK) are familiar with both stir fried vegetables AND spices.",
          "id": 185,
          "comments": [
            {
              "score": 377,
              "content": "He also didn’t have any examples of people in his office who have objected to this type of food/spices. Just that he read about some here. So he’s protecting her from the hypothetical?",
              "id": 186,
              "comments": [
                {
                  "score": 224,
                  "content": "Right?  And I love that the coworkers that overheard OP's comments to Anna called him out on it. They could have kept quiet, seething at what the heard, but they spoke up to let OP the comments were not appropriate.",
                  "id": 187,
                  "comments": [
                    {
                      "score": 20,
                      "content": "I would’ve struggled not to go off at him whilst Anna was still in the room but I definitely think they did the right thing waiting as it could’ve made Anna feel even more uncomfortable.",
                      "id": 188,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Honestly I hope they went to HR too. His comments were wildly inappropriate and it shouldn't be up to just Anna to get HR to make him stop.",
                      "id": 189,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Her other coworkers actually sound great and I feel like she will probably have a fine experience with them.",
                  "id": 190,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "What examples? She was there for a week at best and this guy was harassing her. He can’t even say every Wednesday she does xyz…. Because she hasn’t been there long enough. This guy is a piece of work. Literally attacking her out of the gate.",
                  "id": 191,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "I’d be curious as to which sub he “read about” people not liking the smell of “ethnic foods.”",
                  "id": 192,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 101,
              "content": "Yea, I was thinking maybe a durian but instead it's just a racist OP.",
              "id": 193,
              "comments": [
                {
                  "score": 12,
                  "content": "Really? Asians might eat different foods but we're not completely stupid to bring durian to a workplace.",
                  "id": 194,
                  "comments": [
                    {
                      "score": 12,
                      "content": "OP deserves to have a Durian prepared in his office space though 😂.",
                      "id": 195,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "You mean it wasn’t a fish ‘n’ durian stir fry?🙄",
                      "id": 196,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "I'm also completely creeped out by the fact that *he knows her lunch habits after a week!!* Dude, there's not enough words in the English language to explain to you how terrifyingly creepy that is to a young woman. You probably terrified her.",
              "id": 197,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "No more high-heat cooking of veggies for Anna. She’s only allowed to eat things that are deep fried and were given Christian names before butchering, like a **real** American. /s\n\nWhy would stir-fry even necessarily stink? Sure, if its curry-involved, that  lingers, but OP didn’t even specify what was so offensive about it besides “that wasn’t sweet potato hot-dish, it’s probably spicy and sinful”. \n\nThe worst offender in my office was an old white dude who would open a can of sardines, microwave them on a paper towel (so fish juice in the microwave, yum) and then eat the warm, slimy things on toast. Toast that he would burn half of the goddamn time. \n\nThat dude got fired, and even though we don’t know the actual reason why, we joke that it was probably his terrifying food choices.",
              "id": 198,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": ">But I can assure OP that white people (I'm going on the assumption that this took place in the US or UK) are familiar with both stir fried vegetables AND spices.\n\nWant to bet that if a white coworker brought in leftover stir fry from last night's dinner at a Chinese restaurant OP would not have made a peep about? Not even to mention how it smells good.",
              "id": 199,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I'm korean if I worked w the OP I'd bring kimchi soup every day lol",
              "id": 200,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "That the stupidest thing though. Stirfrys are an excellent way to use up any extra veggies you may have. It works the same way as if I'm making Victorian Poor Man Soup.  I'm as white as the Alps, yet I will try cooking anything once. Ethic food I find to be cheap, resourceful and tasty all at once.",
              "id": 201,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I had a boss who wouldn't just reheat her fish, but she would leave it out all day. I wanted to skin her.\n\nStir fry never smells bad.",
              "id": 202,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "OP's acting like she brought a fish in and ate it like Gollum or something, with a side of strong kimchi, durian, and pail of brussels sprouts heated with broccoli l.",
              "id": 203,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 461,
          "content": "Can we also add on that OP basically mansplained racism ??? 🫠🤦‍♀️",
          "id": 204,
          "comments": [
            {
              "score": 258,
              "content": "In that case, it's \"whitesplain\" :P",
              "id": 205,
              "comments": [
                {
                  "score": 192,
                  "content": "Whitemansplain?",
                  "id": 206,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Is that somewhere in South Dakota?",
                      "id": 207,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 389,
          "content": "Truly excellent post.",
          "id": 208,
          "comments": [
            {
              "score": 84,
              "content": "Agreed. I’m going to have to remember some of these examples lol",
              "id": 209,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 333,
          "content": "Listen, man, I just came here to have a good read, and I'm feeling so attacked right now.\n\nThe Cotton Eye Joe dance is a completely valid dance, and I don't appreciate being  called out like that about my condiments. I occasionally include mustard. Sometimes. :P",
          "id": 210,
          "comments": [
            {
              "score": 124,
              "content": "Mix the mustard into the mayo, makes it less ‘fiery’",
              "id": 211,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "okay, but where did you come from, and where did you go??",
              "id": 212,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 247,
          "content": "ALL OF THIS.\n\nI’m Asian. I am hyper-aware every single time I walk into a space and I’m the only POC. I’ve innately understood the “perpetual foreigner” bullshit placed on the AAPI community since I was 4 years old. Without a doubt, Anna is aware of racism against AAPI.\n\nYTA, OP.\n\nBut I genuinely hope that you read through these comments and you work to educate yourself more on what it means to be an ally. When you know better, you can do better.",
          "id": 213,
          "comments": [
            {
              "score": 7,
              "content": "I love this comment! As a white woman who grew up in a white community I had to learn a LOT. The people I was around weren't overtly racist. We had 3 black people in my school. 2 were wildly popular, the 3 had deformities and was poor so they were bullied because of that but not race \"facepalm\". \nI was raised to treat everyone the same, color didn't matter. \n\nThen I moved to the deep south for school. It was awful. \n\nThe hardest and most frustrating part of trying to over come racism is getting through to people that don't think they are racist. \n\nWhat I didn't see and had to learn was everything I knew and was taught never once took into the account of the experiences of others. It's one thing to say \"I'm not racists\" when the only experience I had was a couple people with darker skin than mine that grew up in the same place with the same experience.  Wr didn't see them as different because they weren't. Culturally we were exactly the same. So it's easy to be offended that anyone would treat them different because they were one of us. \n\nBoy did I get a badly needed education! \nI get it now....as much as a white girl from the sticks can anyways...I learned to shut my mouth and listen. I learned my opinion doesn't matter.  I'll say it again for the cheap seats in the back...my thoughts and feelings on racism didn't matter..it's not for me to say \"it's not racist because I see everyone the same\". No\n Just no. I am not the gauge of what racism is. Those who are the ones feeling the hurt of it are the ones to decide if it's racist or not. \n\nThere is such an attitude of \"I'm not racist so anyone who says otherwise is just being dramatic and making a big deal out of nothing and need to get over it\" and I have found that us the hardest and most infuriating attitude to break. It totally discounts the experience of others and that is racism at its core. \"Everyone should think like me\"  uhg. \n\nAnyone who wants to be an ally needs to constantly check their own ideas/thought/behavior and be ready and willing to evolve and follow the lead of someone who knows first had. If someone gets upset, like Anna going to HR and the coworkers...the true allies...then clearly there is a problem and guess what op? It's you!",
              "id": 214,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 241,
          "content": "Lmao if I, a whitey, show up with some leftover Chinese food, would he call my lunch “ethnic”??",
          "id": 215,
          "comments": [
            {
              "score": 137,
              "content": "I’m guessing you’d get a speech about cultural appropriation.",
              "id": 216,
              "comments": [
                {
                  "score": 18,
                  "content": "At least if the cute new girl was standing within hearing distance. Gotta be an ally! 🫣",
                  "id": 217,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Panda Express was never the same…",
                  "id": 218,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "(23 f also white) My 60 year old sourhern white boss told me that my Sesame chicken stir fry smells so good, and when I told him what it was he said 'can't go wrong with stir fry'\n\nLike, who's gonna hate on the most basic Asian food? When I brought in sushi, I got a lot of 'nah, I don't eat that stuff' for comparison. Everyone eats stir fry.",
              "id": 219,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "I kid you not, my husband and I stopped at a diner in a tiny Michigan town two years ago and their menu had an “Ethnic Foods” section.\n\nThe first item in that section was spaghetti.",
              "id": 220,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 204,
          "content": "As a girl of Portuguese descent who gets confused for everything from Caribbean to Indian to Native American… \n\nYes. “Ethnic” is just how people with poor vocabularies say “not white” 😆",
          "id": 221,
          "comments": [
            {
              "score": 117,
              "content": "Wait until they call you \"urban\", \"exotic\" or *shudders* \"diverse\" 🤣🤣",
              "id": 222,
              "comments": [
                {
                  "score": 70,
                  "content": "Love “exotic” /s 🙄 I must’ve escaped from the zoo",
                  "id": 223,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "THEY DO! Portuguese person here. When I first met British people, they were shocked that I looked \"mixed\" and thought my pale ass was half Black, they said I was \"exotic\" 😭 I JUST HAVE WAVY BROWN HAIR",
                  "id": 224,
                  "comments": [
                    {
                      "score": 4,
                      "content": "You should be so white you're bordering blue and your hair should be orange (a.k.a red). Anything else is exotic and will be sexualized.",
                      "id": 225,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "My father uses \"ethnic\" as a noun to refer to non-white people. I see him maybe twice a year because that shit brings the red mist down.",
              "id": 226,
              "comments": [
                {
                  "score": 10,
                  "content": "He would call that mist ethnic.",
                  "id": 227,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 98,
          "content": "i agree, except that since anna is dodging op i feel op should leave her alone. don’t apologize, don’t socialize, op’s done enough damage. yta.",
          "id": 228,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "You put into words everything I wanted to say. And then some 🤣 I've always told this story, and it definitely fits here. I grew up in Colorado and started middle school in 2000. Obviously, Columbine was still heavily on everyone's minds. I was being a little metal head and drawing pentagram and shit on my backpack with whiteout markers. One day, I get called down to the principals office where I am informed that they're keeping an eye on me for fear that I will shoot up the school. Was never a thought in my mind, but if it had been, that probably would have been the last straw.",
          "id": 229,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4414,
      "content": "YTA\n\nSo your coworker was peacefully enjoying her lunch, and you goosestepped over there like the microwave police to tell her that Some People would find her food too' ethnic'.... but Not you because you're one of the good white people 🙄🤦 but then you go \"no but actually the racists are right you are asking for racism by bringing Asian food in\" \n\nYTA \n\nstop being racist to your coworker she was just trying to eat her leftovers ffs\nGet out of your white fragility shield and recognise your own awful hurtful behaviour and learn from it and the feedback you're getting please",
      "id": 230,
      "comments": [
        {
          "score": 456,
          "content": "He 100% sees a negative post about white people and she has to hop in there with \"not all white people, I...\"\n\nEdit to fix OPs gender",
          "id": 231,
          "comments": [
            {
              "score": 115,
              "content": "OP is a he",
              "id": 232,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 40,
              "content": "OP is male",
              "id": 233,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 143,
          "content": "Incredible use of goosestep",
          "id": 234,
          "comments": [
            {
              "score": 70,
              "content": "I like the duality of Nazis and bein a silly goose that this phrasing suggested.",
              "id": 235,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "What is a goose step",
              "id": 236,
              "comments": [
                {
                  "score": 46,
                  "content": "It’s how the nazi soldiers marched",
                  "id": 237,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Ok gotcha thanks for explaining",
                      "id": 238,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Which is weird cause I never seen a goose walk like that.",
                      "id": 239,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I laughed at microwave police",
              "id": 240,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Goosestepped 😂\n\nIt wasn’t even fish or something else nobody puts in the microwave at work unless they hate everyone.",
          "id": 241,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Microwave SS",
          "id": 242,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Goosestepped omg I love you 🤣",
          "id": 243,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I wonder if he would warn me(mid 30s white man) about bringing \"ethnic\" food to work if I went and grabbed takeout at the Indian restaurant across the street from my office.",
          "id": 244,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I just imagined him walking over to her like a goose. Staring menacingly and slapping his orange feet on the ground.",
          "id": 245,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2475,
      "content": "YTA -- you are not protecting her from racists, you yourself are being racist. if you're trying to convince us/her/yourself that you're an ally, you might be more than a bit delusional. \n\nalso stop trying to hang around your young coworker lmao",
      "id": 246,
      "comments": [
        {
          "score": 756,
          "content": "[deleted]",
          "id": 247,
          "comments": [
            {
              "score": 177,
              "content": "Tought the same immediately when reading the ages. Racist negging",
              "id": 248,
              "comments": [
                {
                  "score": 15,
                  "content": "In this context I think you meant negging.",
                  "id": 249,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yes, sorry corrected it. English is not my first language",
                      "id": 250,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "exactly i think he saw her as a “pure innocent little asain girl” who needs to be “protected” by an older wiser white man (him). I cant see this being motivated by anything other then stereotyping and fetishizing her for her age and race",
                  "id": 251,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "\"how can I be racist towards Asians? I watch Asian porn!",
              "id": 252,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "This… also, why is he watching her eating habits so closely that he know what days she does and doesn’t bring her own lunch? I wouldn’t notice that for the life of me.",
              "id": 253,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "I do not miss being young and dealing with the self appointed mentor guys who acted really weird, had no good advice, and kept making comments about how pretty I looked or how lucky my husband was after I got married.\n\nThe older guys in my office were helpful, treated me like a sister or daughter without being unprofessional, (We were in the construction industry, and I was the operator for a manufacturer order center. The clients could be very misogynistic or throw tantrums), and made him behave. They were real allies.",
              "id": 254,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 166,
          "content": "I think he fancies her and this was his hamfisted, patronizing way of ingratiating himself to her. At least he thought it would.",
          "id": 255,
          "comments": [
            {
              "score": 24,
              "content": "100% Absolute gobshitery.",
              "id": 256,
              "comments": [
                {
                  "score": 19,
                  "content": "I'm American and I've never heard this wonderful word before.\n\nAnd being true to my culture, I am now stealing it and calling it mine. Thanks!!",
                  "id": 257,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I think OP wants to date ana, but started the wrong way 😂",
          "id": 258,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2034,
      "content": "So you told a new coworker \"in order to avoid harrassment about your food, you shouldn't bring in your food!\"\n\nDo you realize that you just harrassed her?\n\nYTA\n\nI suspect this is bait, but the judgment is the same if it is true or fake.",
      "id": 259,
      "comments": [
        {
          "score": 323,
          "content": ">I suspect this is bait, but the judgment is the same if it is true or fake.\n\nagreed.   No one can be this stupid.   People can be this racist, sure.  But not this stupid to post on here.",
          "id": 260,
          "comments": [
            {
              "score": 241,
              "content": "As someone with a career in HR, never underestimate the level of stupidity people are capable of when they think they're right about something. They really do think \"but I didn't mean it that way!\" magically absolves them and other people will understand and agree.",
              "id": 261,
              "comments": [
                {
                  "score": 19,
                  "content": "hard agree as an asian person who experiences micro aggressions",
                  "id": 262,
                  "comments": [
                    {
                      "score": 14,
                      "content": "My gf is Korean and I'm a white farmer. We joke on each other about race, but we also discuss these concepts seriously at times too. \n\nI cringe to think of her meeting me when I was in my twenties. I totally could have done something similar to the OP at that age (god id hope not this bad, but maybe?). It blows my mind that twenty years later that these concepts aren't just common sense now.\n\nThen again I've also asked her to hold my feet to the fire if she believes I'm demeaning anyone, especially her, because of race, sex, etc. She asked the same of me with her. We like to believe we're both very introspective and self accountable but sometimes we all need an embarrassing smack upside the head to see our own faults from a loved one whom we trust to have our best interests at heart.",
                      "id": 263,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 125,
              "content": "It’s the internet, the bar for intelligence is quite low.",
              "id": 264,
              "comments": [
                {
                  "score": 12,
                  "content": "The bar is in Hell and yet some people bring a shovel.",
                  "id": 265,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "I thought post was gonna be about eggs or fish in microwave. But shit, fried rice is practically American at this point.",
              "id": 266,
              "comments": [
                {
                  "score": 12,
                  "content": "Same. Microwaved fish is the worst.",
                  "id": 267,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "There are people that want so bad to be ally heroes they don't realize they are bigots. Did you read about the one where the girlfriend assumed the Latina women was poor and tried to \"help.\"",
              "id": 268,
              "comments": [
                {
                  "score": 8,
                  "content": "Oh geez, I remember that one. “Please accept my charitable donation of food since you’re probably poor based on statistics!”",
                  "id": 269,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1373,
      "content": "[removed]",
      "id": 270,
      "comments": [
        {
          "score": 415,
          "content": "It sounds like OP is also assuming Anna raised the issue to HR. I may well have been the coworkers who overheard. Then HR asked Anna about it. What a shitty start to a new job. \n\nYTA, at each and every point of this story.",
          "id": 271,
          "comments": [
            {
              "score": 135,
              "content": "If I had been in that room I would have had words for OP and you bet your ass I would have ran my behind to HR. Deservedly so. I wouldn't be surprised if Anna was too mortified to say anything.",
              "id": 272,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 114,
              "content": "If someone went to hr for every micro aggression faced they'd never have a job. It's more likely the people in the room reported it. People of colour rarely do.",
              "id": 273,
              "comments": [
                {
                  "score": 69,
                  "content": "That is actually a good way to be an ally. Use your privilege to stick up for others. Like men who go to HR about sexual harassment they witness so the woman isn’t the only one complaining and potentially risking her job and/or career. Or white employees going to HR to report racial discrimination like this. Having other employees go on record corroborating the complaint can make it more likely that HR and the company will take the accusations seriously.\n\nThere’s been a lot of companies who didn’t do anything about sexual or racial discrimination until other employees got involved and didn’t let the company keep ignoring the problem.",
                  "id": 274,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "My bet's on this absolutely not being the first time his co-workers have had to go to HR about him.  Vibes like:\n\n\"I think it's so cool and empowering that you kept your maiden name, but maybe you should wear your wedding ring to work so single guys will know not to flirt with you.  Not me, I'm just friendly, but you know how some guys are.  Have you considered hyphenating?\"\n\n\"Haaay! You rock that rainbow bracelet GURL!  Are you going to a gay bar later or something? I only ask because, yanno \"workplace attire\" right?  Some people, not me of course, are super homophobic and like their workplace to just be about work - not politics, you know?  Anyway, *werk sistah!*\"",
              "id": 275,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Watching this shit would have made ME uncomfortable, and I’m also white, I would have definitely stepped into HR later (after trying and failing to process this interaction as anything other than a racist who’s pretending he’s woke) to ask someone “hey am I crazy or was this really messed up?” (Admittedly, Idk how to actually interact with HR, I’ve never worked in an office)",
              "id": 276,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 148,
          "content": "What I find funny is that this post sounds like OP was hoping this would get him a foot in the door to sleeping with her. The whole vibe is off and gross.",
          "id": 277,
          "comments": [
            {
              "score": 60,
              "content": "Thank you!!! I just posted another comment that talked about how creepy some of the things he said were!",
              "id": 278,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "It was just heavenly .. 🙄 sure Jan",
          "id": 279,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 718,
      "content": "YTA.\n\nYou came off like this: \"SOME people might say that your food is smelly. Not me though. But SOME PEOPLE.\"\n\nAnd then you proceeded to call her food Ethnic. You might as well have worn a shirt that said SOME PEOPLE on it with an arrow pointing to your face.\n\nDoesn't sound like you were ill intentioned, but sometimes you just have to give a complement and let it be.",
      "id": 280,
      "comments": [
        {
          "score": 408,
          "content": "I am half Chinese and half Caucasian. When my parent announced their engagement my white grandparents begged my mother not to have children because people would be mean. My grandparents were absolutely right as they were the people that were mean. \n\nThey were telling on themselves just like OP.",
          "id": 281,
          "comments": [
            {
              "score": 59,
              "content": "I'm so sorry that it went down like that. I wish they had been better.",
              "id": 282,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "The last time I talked to my father was when he asked if I was sure I was serious about my Japanese American (now) fiancé because “What if you had kids, they’d be targets of racism.”\n\nFucking wild.",
              "id": 283,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "This is literally the plot of Guess Who's Coming to Dinner. It takes two hours to get to Spencer Tracy giving a monologue about \"So I realized I was being racist, and you the all-white audience should also not be racist.\"",
              "id": 284,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "Kinda like saying, I can’t be racist because I have a black friend.  \n\nThe OP should have kept his mouth shut",
          "id": 285,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 688,
      "content": "YTA   If your white coworker brought in egg salad and and tuna fish sandwiches would you tell them that might smell offensive to your Asian coworker?",
      "id": 286,
      "comments": [
        {
          "score": 227,
          "content": "You're right, but also lol because that really is the epitome of white people food 🤣😭",
          "id": 287,
          "comments": [
            {
              "score": 72,
              "content": "Am white person. Can confirm.",
              "id": 288,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "It is. My mom loved tuna sandwiches with her hard boiled eggs. 🤢 but she would never torture anyone outside the house with the stench. We just suffered from it lol.",
              "id": 289,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "I've had coworkers stink up the place with tuna fish. TUNA FISH IS BANNED IN THE INDOORS.",
          "id": 290,
          "comments": [
            {
              "score": 13,
              "content": "When this post started I expected this to go the way of coworker was microwaving fish. Cause yeah, we have some unwritten rules about microwaving fish at work. \n\nBut a veggie stir fry? 🤦‍♀️",
              "id": 291,
              "comments": [
                {
                  "score": 6,
                  "content": "We have unwritten rules about microwaving fish at work but canned tuna is fine so long as you don't put it in the microwave. So are eggs and stir fries, curries etc. The lunch that bothered me most was plain ground beef reheated in the microwave, for something so bland it really smelled bad and the smell lingered almost as long as fish does.",
                  "id": 292,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 579,
      "content": "I think what you are missing is...\n\nShe didn't make ethnic food. I make rice and leftover veggies and random spices, I'm white. \n\nYou saw Asian lady and presumed ethnic food. Then you got on your big dense white horse and tried to make a show of fighting off imaginary racists.\n\nThat's what you turned this poor woman's lunch into.\n\nYTA if you're real.",
      "id": 293,
      "comments": [
        {
          "score": 146,
          "content": "Right? It was a fucking stir fry of all things. “Wow, your lunch looks/smells great!” is the only thing I don’t mind hearing re: my food at work. Leave me alone to eat otherwise. My Asian ass knows what foods are workplace appropriate.",
          "id": 294,
          "comments": [
            {
              "score": 96,
              "content": "Right and let’s be clear, it’s rarely spiced “””ethnic””” (wtf) food that is committing microwave and lunchroom crimes at work- it’s always Brad’s tuna pasta he decides to nuke within an inch of its miserable life and then eat at his desk to make sure the entire floor is ensconced in his fish-roma.",
              "id": 295,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Right???? I was expecting it to be one of those super smelly fish dishes some cultures have. (I vaguely remember a Scandinavian one that is supposed to be just the worst food on the planet.)\n\nBut no, he’s talking about stir fry. There is a recipe for stir fry in my white GRANDMOTHER’S cookbook that uses garlic salt because minced garlic was too fancy for her (or maybe hard to get: not sure). Of all the things to go “warning” her about, this has to be the stupidest.",
          "id": 296,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}