{
  "post content": "I am married (18 yrs) to my husband and we have three kids. The older kids have special needs (neurodivergent) and the youngest is a preschooler. I have been a stay-at-home mom until a year and a half ago when I went back to university to get my Masters degree. My husband got his before we had kids. \n\nDuring the workweek, he leaves in the morning right as the kids are getting ready for school. Typically, he gets home after they are in bed. He has every other Friday off, in addition to every weekend. I am a full-time student, and am doing my internship at an agency about 20 hours a week or so. The kids get home by 2pm and I am with them. So all of my stuff needs to be done when they are in school. In addition to almost all the things I did as a SAHM. My husband now does his and the kids laundry and sometimes the dishes or the like. \n\nThis Saturday (like most) I am holed up in my office, working on a very difficult class. The class is online, and the due dates are Saturdays and Sundays. I can't study when the kids are at home, at all. And I can't study when I am doing internship.\n\nSo, with all that backstory, here is my problem: Two weeks ago I went to a matinee movie with my best friend (A Man Called Otto, it's so good!). Today, my husband says that it's not fair because he doesn't have any friends (he's not social) and he wants to go see a movie today. This is the first time he's mentioned it. I said that I need to study. He feels that he's held to a different standard, since he can't go out. I am totally open to him going to a movie, but not this afternoon because I need to work. He feels that he never gets a break, but I did. I said that he has the whole weekend where he doesn't have to work. He said that he has to be with the kids, so it doesn't count. I feel like this is unfair, but I can't articulate why and I am wondering if I am totally wrong. Our kids are pretty challenging, but I feel that they are easier on the weekend, when they aren't stressed out by school.",
  "id": 1,
  "comments": [
    {
      "score": 19,
      "content": "NAH - he needs a break from work and kids.  The weekend with the kids is not a break.  He needs to not hold it against you that you have a friend and he doesn't.   While I hate scheduling time, you need to schedule time for each of you away from the kids ahead of time and work so he feels he has time off.  And have your school work built in.",
      "id": 2,
      "comments": [
        {
          "score": 18,
          "content": "But she said he's off every other Friday. He can go to the movies on those days when the kids are in school.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 13,
      "content": "Nta, when u were a stay at home mom you didn't get a break from the kids either, so he's getting more of a taste of what you did for years. \n\nHe deserves some time off too tho, maybe u can make a schedule and both plan your off time in advance.",
      "id": 4,
      "comments": [
        {
          "score": 6,
          "content": "Who said op didn't get time off?  Sounds like she is able to get together with a.friend alone on the weekend?  He shouldn't hold that she has a friend against her, but he probably could use time off work and kids too.  But he has every other Friday before the kids are in school so.i.dont get the no time off.",
          "id": 5,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "I like this idea.",
          "id": 6,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "INFO: does your husband have any chance to get a break from the kids on his Fridays or weekends off? If he wanted to go see a movie, would he be able to while you watch the kids? Or do you expect him to be fully present for the kids when he's not working?",
      "id": 7,
      "comments": [
        {
          "score": 3,
          "content": "His off-Fridays give him freedom before the kids get home from school. He doesn't go out much, his preference is to play video games at home. He can and does do this when the kids are home on the weekend. I take the kids to church on Sunday mornings, and sometimes he choses to stay home and work out.",
          "id": 8,
          "comments": [
            {
              "score": 4,
              "content": "Suggest he goes to a movie on Friday- the early showings should be ending as the kids get out of school. Bam, ready for the weekend",
              "id": 9,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "To further clarify, we don't really go out on the weekends, we primarily stay at home and hang out.",
          "id": 10,
          "comments": [
            {
              "score": 7,
              "content": "It sounds like your husband may need a break once in a while. Offer him the day, or even an afternoon, to himself. You were able to go and see a movie without him and the kids. He deserves the same opportunity, even if it's just for a few hours.",
              "id": 11,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am married (18 yrs) to my husband and we have three kids. The older kids have special needs (neurodivergent) and the youngest is a preschooler. I have been a stay-at-home mom until a year and a half ago when I went back to university to get my Masters degree. My husband got his before we had kids. \n\nDuring the workweek, he leaves in the morning right as the kids are getting ready for school. Typically, he gets home after they are in bed. He has every other Friday off, in addition to every weekend. I am a full-time student, and am doing my internship at an agency about 20 hours a week or so. The kids get home by 2pm and I am with them. So all of my stuff needs to be done when they are in school. In addition to almost all the things I did as a SAHM. My husband now does his and the kids laundry and sometimes the dishes or the like. \n\nThis Saturday (like most) I am holed up in my office, working on a very difficult class. The class is online, and the due dates are Saturdays and Sundays. I can't study when the kids are at home, at all. And I can't study when I am doing internship.\n\nSo, with all that backstory, here is my problem: Two weeks ago I went to a matinee movie with my best friend (A Man Called Otto, it's so good!). Today, my husband says that it's not fair because he doesn't have any friends (he's not social) and he wants to go see a movie today. This is the first time he's mentioned it. I said that I need to study. He feels that he's held to a different standard, since he can't go out. I am totally open to him going to a movie, but not this afternoon because I need to work. He feels that he never gets a break, but I did. I said that he has the whole weekend where he doesn't have to work. He said that he has to be with the kids, so it doesn't count. I feel like this is unfair, but I can't articulate why and I am wondering if I am totally wrong. Our kids are pretty challenging, but I feel that they are easier on the weekend, when they aren't stressed out by school.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA! How are ppl missing that he gets every single week night off from the kids?! He doesn’t get home until they are asleep. Why not just see a movie on one of those many many nights he has free??? Guy is coasting along do practically no family work and has ppl saying OP who is working her Whole as$ off is T A. Don’t listen to them, OP. You deserved that one movie, and so much more! Keep kicking butt and I’m proud of you.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "Yta - essentially you're both working and parenting. If you get free time to see a movie, so does he. Apologize and let him go out Friday.",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the a-hole because I am holding my husband to a double standard and not giving him \"off\" time like I recently had. He thinks he does more than his fair share of household/parenting/work. I am in my fourth and final semester of grad school. He works full-time. I work part-time and am unpaid intern. I don't actively parent on Saturdays and sometimes Sunday afternoons.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 15,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "I’m guessing your husband is the ND one.  I’m the same and have no friends. I go to movies alone. Your husband can do the same. But you have to give him a day off to do so.",
      "id": 16,
      "comments": [
        {
          "score": 2,
          "content": "He has every other Friday off - ample opportunity",
          "id": 17,
          "comments": [
            {
              "score": 2,
              "content": "What is he doing on those days off? Is he doing all of the house work and SAHM stuff?",
              "id": 18,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NAH",
      "id": 19,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 0,
      "content": "He could plan ahead and then seek a sitter.  NTA",
      "id": 20,
      "comments": [],
      "relation": "Support"
    }
  ]
}