{
  "post content": "Background: My wife rarely goes out with friends (~6 times/year) and has never been very social and prefers spending time with me. I am more social, but that has declined as we have focused on our family (we have a 2 year old daughter), and I spend time with the same 3 friends once/week for games night (sometimes in person, sometimes online). I have another 3 friends that I see only once every 2 months, also for games night. If I go out my wife will tend to our daughter (I often still help with dinner/bed time, but sometimes leave earlier than this). Our daughter's bed time is 7:30pm, and she often sleeps through the night without fuss (wakes up fussing maybe 5% of the time). I always offer for my wife sleep in the next day, or something similar in exchange for me going out so that It's not a one-sided thing.\n\nScenario: My wife made plans to spend an evening this weekend out with friends, she would be out from 6pm until late. After she made those plans, I was invited to my friends birthday thing with my \"second\" friend group, if I went I would be gone from 5pm until late. Last time I saw them was exactly one month ago. I brought this plan up with my wife as I wanted to make arrangements for a family member to take our daughter for the evening. She was irritated by this, and argued that I should stay home. I have since spoken with a family member who is happy to take our daughter at 5pm and have her stay the night and I have communicated this to my wife.\n\nI made it clear that this will not affect her plans at all, I will be responsible for dropoff and pickup of our daughter, and will not ask anything of my wife because I understand that it is rare for her to have a night out like this and so I don't want her to change her plans at all. She still thinks that I should stay home.\n\nHer arguments:\n\n- She says that since she always covers for me that I should also cover for her\n- She doesn't want to ask this family member to have our daughter for the night because she thinks we ask too much of them\n\nMy arguments:\n\n- I am covering for her as she does not have to change her plans and doesn't have to do anything for our daughter\n- This family member loves watching our daughter, and my wife is often quick to agree to leave our daughter there for sleepovers plenty of other evenings out of convenience (eg: we will be there for dinner and put our daughter to sleep there so we can visit longer, then we will leave her there for the night) so I don't see why this time its too much to ask\n\nI feel like she wants me to stay home as a form of punishment for going out more frequently than she would prefer. \"Punishment\" feels too strong of a word, I don't think there is any major resentment behind this or anything, I just don't know how else to describe the feeling.\n\nSo, AITA here for making plans to go out the same night my wife also already had plans to go out, even though I am covering all arrangements for our daughter for the evening?\n\nEdits:\n\n- Not sure why everyone thinks I'm planning on getting drunk, but I would not be drinking if I went to the birthday.\n- I would also be the \"on-call\" parent and would tend to our daughter in case of any emergency\n- I used the word \"cover\" to describe solo-parenting as that is the word my wife used when we spoke. Neither of us are the type of people to call parenting \"babysitting\" when it is solo.\n- The \"punishment\" I am referring to is about missing out on celebrating with a friend, it is NOT referring to spending time with my daughter\n- Just because my wife only goes out 6 times a year does not mean that is her only free time. We have 5 evenings free every week where she can either do her own thing or we can spend it together. We share the evening \"on-duty\" time equally\n- The vast majority (like 90% or more) of my time out is spent after my daughter is asleep, the normal routine is for both of us to do dinner/bath/bed routine, and then for me to leave afterwards\n- The family member I am referring to is on my wife's side, however we are very close with them and it is normal for me to talk to them directly, they feel just as much my family at this point as they are hers\n- The family member is also very experienced putting our daughter to bed without us being there\n- My daughter has her own room at this family members house, as well as another's. This is because they care for our daughter on the 3 days a week where both my wife and I work so that we don't have to pay for daycare. We are extremely lucky to have such helpful family, and the reason she has her own room/bed at these places isn't because we \"pawn her off\" there frequently, it is because she naps at these places 3 days a week, and on occasional evenings. Both family members are empty nesters who admittedly love caring for our daughter, and other young family members. We try to compensate them but they often refuse, and they even go so far as to ask to have our daughter over.",
  "id": 1,
  "comments": [
    {
      "score": 18551,
      "content": "YTA.\n\nNot a big one, but this is more about the emotional load than logical reasoning.\n\nYour wife is likely not going to be enjoying herself the same way she would if you had stayed at home. She isn’t necessarily going to worry all night, but she will be aware that your daughter is out of the house. She’s going to mentally check in - now they are driving over, now she’s likely settling down, now you are picking her up, time for bed again. \n\nEvery time she mentally check in she exerts a little effort. Maybe she glances out the window to check the weather is good for driving. Maybe she checks her watch or phone to see if you called. However, even the energy of simply having a thought adds up.\n\nIf your wife is like many parents I know, especially the main caregivers, she is always alert. She’s always on. \n\nYou being home with your daughter doesn’t turn that off but it does lesson the amount that it happens. The mental load of knowing your child is as safe as possible with their other parent is different from knowing they are driving around and at another house.\n\nIt doesn’t matter how safe it is - travel needs more attention than staying home.\n\nYou get to go out. You get mental breaks from parenthood. She doesn’t get the same breaks. She’s asking for one now.\n\nYou need to decide - does it really matter who’s right here? Your wife is unhappy. This is rare occurrence for her that means a lot and you see your friends all the time. Even if you think my reasoning is completely irrelevant, is this birthday party *really* worth it?\n\nETA: When posts get this big I like to channel that energy as much as possible towards doing some good in the real world, especially when at the moment, for me, being able to comment at all on something small and innocuous like an Internet stranger deciding whether to use a babysitter currently feels like a luxury. I don’t take it for granted.\n\nwww.NAMI.org is the National Alliance on Mental Illness. They accept donations and have one hotline available for everyone and one specifically for teens and young adults. \n\nwww.2020Mom.org is The Policy Center for Maternal Mental Health, aka 2020 Mom. They advocate for policies in America that support the mental health of pregnant women and all parents.\n\nFor those who are focused on wanting to help those affected by bigger issues like war, conflict, and natural disasters due to recent and not so recent events, https://www.charitywatch.org has articles and lists of reliable charities for helping those in specific war zones and other dire situations.\n\nDonations are obviously not the only way to do good. Things as small as being mindful to be patient and kind makes everything a little bit better.\n\nWishing everyone both strong Internet and real world communities and support systems.",
      "id": 2,
      "comments": [
        {
          "score": 5680,
          "content": "And don't forget the hustle with getting everything ready with child staying out of the house. So she will have two mental loads at once, getting herself ready for night out (that's a big deal for introverts and takes lots of energy to prepare for socialising) and getting daughter ready for night out, that's big. Sometimes I decline offered babysitting if it includes kids going to babysitter's house, especially over night because it is much more effort than staying in and I woud be exhausted to enjoy my outings fully.",
          "id": 3,
          "comments": [
            {
              "score": 1690,
              "content": "But he already said he will get the daughter ready, drop her off etc.",
              "id": 4,
              "comments": [
                {
                  "score": 4642,
                  "content": "But is he going to stay sober in case something happens in the night and the daughter needs to be picked up?   Doubtful, in which case his wife now can't relax because she'll end up being the emergency call if something happens.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 773,
                      "content": "Boom",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 368,
                      "content": "When do we stop making assumptions about the husband? He might be sober. He said he’s picking the daughter up, middle of the night seems like it falls under that category. Is the family you left the kid with so incompetent they can’t handle the situation? If so, why are you leaving a kid with them?",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 318,
                      "content": "How much alcohol are you consuming that you assume everyone gets drunk/tipsy at every social gathering they go to? OP even says he doesn't drink much.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 287,
                      "content": "I honestly don't know how this applies. You could make the same argument if they were having a night away together, that one must stay sober and responsible instead of enjoying their time, just in case something happens back home. I don't think anyone would do that.\n\nI really feel like if a woman was telling this same story about her husband, people would be calling the husband the jerk for being controlling when she'd arranged for a sitter so they could both go have fun.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 190,
                      "content": "Why is this doubtful? Because I am a man and so therefore I'm also a drunk?",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 100,
                      "content": "[deleted]",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 97,
                      "content": "Yes he said he will stay sober.  This thread is weird with everyone assuming he’s going to get drunk and get in an accident.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 37,
                      "content": "He said in the edit that he’s doesn’t plan on drinking so yes he will be able to",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Shit, he could be shooting up if we're just going to assume he's going to do things he hasn't said. Or maybe all bases are covered and wife is just being nervous they're asking too much of this one person who seems to love the daughter.",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "Is the wife going to stay sober? \n\nLike what a goofy thing to ask about only one of the two people going out",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "He already said he was handling all of that",
              "id": 16,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Why are we assuming he will not or cannot do it?",
              "id": 17,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "It is a family member and the child has stayed there many many times before.\n\n&#x200B;\n\nNTA",
              "id": 18,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1181,
          "content": "Fun to see that OPs wife is pregnant too. Which makes this even harder.\n\nThe more I think about this post the angrier I get. I have a two year old and a newborn. I would leave my husband if he treated me this way. Really. Game nights with friends every week? Are these game nights after quality time with wife and when kid is in bed? \n\nMy husband and I finally have a nice routine, we both game once both kids are asleep. But this is normally after 8pm. And then he knows if toddler wakes up, he has to settle her again because if baby wakes up I settle him again. I cannot fathom him leaving the house to go game while I’m alone with both kids after a full day of working, chores and kids.\n\nETA: you’re all acting like I’m my husband’s keeper. He can do whatever he wants with whomever he pleases. Of course he can go out with his friends and enjoy his hobbies. However, in THIS season we’re currently at hé understands that we both need to be present and what little time we have together to nurture our marriage. So our hobbies are mostly things we can do at home. He likes spending time with me, he chooses us over going out with other people. \n\nI find Op to be inconsiderate and that to me seems like his nuclear family isn’t his first priority. He is his own first priority.",
          "id": 19,
          "comments": [
            {
              "score": 1020,
              "content": "Didn't see that!\n\nYTA, Op. You best get this *very* lopsided amount of \"free time\" between you and your wife sorted before it does irreparable damage to your marriage. Your first kid is still super young and you have another on the way- I guarantee you resentment is building in your wife. How could it not tbh? You carve out hours of every week for \"game night\" with your friends? With work, a wife and a small child?? *Every week?* How do you not see the issue with you accepting a birthday party invitation on the RARE night she's actually going out when you already have so much \"friend time\" every single week?",
              "id": 20,
              "comments": [
                {
                  "score": 261,
                  "content": ">You carve out hours of every week for \"game night\" with your friends? With work, a wife and a small child?? Every week? \n\nGood. I cannot emphasize how extraordinarily good this very concept is. This is exactly what you are supposed to do as a parent. This is what she should be doing as well. \n\nThe evidence is really clear on this - children are happier and healthier if parents have time away from the children. Time away should be part of the parenting plan. Being away an evening should be part of the wife's parenting plan.\n\nI'm a full-time single parent to two small children. I don't have a moment to myself. If someone ever took the kids for a night I would be overjoyed. I cannot believe the entitlement of knocking a child care arrangement like this.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 218,
                      "content": "I have 3 kids, ages 2-7. For 4 years my husband goes out (almost) every Thursday with the guys after work. Usually home by 7 but I never assume he will be. Sometimes they come here instead but it’s still generally a “guys night”. I don’t have a regular thing, but I attend as many concerts as I can, averaging 1 a month, which are obviously full afternoon events. He will skip a Thursday (or move the day, etc) if I have a concert as he understands they’re harder to plan around, and we make this work. I went away for a weekend in July, told him I fully plan on doing it every year, and if he wants to go on any solo vacations or with a friend just to let me know so that I can make my schedule work around it.\n\nSince we’ve both put in the effort into maintaining our individual identities, we’ve been so much happier. I was so lost in motherhood (and then being a healthcare worker during covid) that I completely lost who I was, and picking up the pieces has dramatically changed me. A lot of my concerts I go to alone, and learning to accept and enjoy being alone is something else that’s hard to describe but it’s so freeing.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Thank you. These parents commenting and acting like it’s so outrageous to have a social life while parenting make me sad.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I agree that this is good.  However, he needs to make sure his wife gets a similar amount of time ‘off.’  Maybe he takes their daughter out to the library once a week, or signs her up for a toddler gymnastics class, or something else so mom can have some introvert recharge time to herself at home?  Or sets her up with a craft room or quiet space where she can retreat and he does _not_ bother her while she’s in there?\n\nBecause I think that’s the underlying issue. He gets to recharge his way, she doesn’t get to recharge her way - he needs to step up and be the solo parent once a week for his wife to be able to recharge, too.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I think they're knocking the uneven nature of that arrangement. Namely that he is out away from the kid far more than she is. Sounds like because she prefers to stay home, he takes it to mean \" she prefers looking after the kid while OP goes out\". That's not fair. If he's out once a week at least with friends, she gets once a week in, with no child care duties - staying home with the kid is not the same.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 124,
                  "content": "y'all are wild. once a week is not crazy. you have no idea how much quality time they spend together.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Once a week, sometimes in person, sometimes online. People here are crazy if they think that’s excessive. I don’t get all the assumptions that his wife doesn’t have free time or that she wants to have scheduled friend time just as often as he does. Maybe she just wants the equivalent amount of time to chill and read a book and she gets it, we have no idea. But in this specific situation I don’t see the big deal in having a trusted family member watch the kid for a night.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "This is an absolutely insane take. Parents can have social lives. If the wife is more introverted and doesn’t want to go out that doesn’t change what the other partner wants. As long as he is making sure there is a fair and balanced way to take care of the children he is allowed to have a hobby. If he was going to a cooking class every week would you be saying the same thing? People are allowed free time away from their kids as long as they have a responsible plan to watch over them, and OP does. You say every week like that’s some sort of judgement…wtf??? You are projecting hard with shit from your own life most likely.",
                  "id": 28,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "Holy shit, seek help. If you legitimately think that carving out a few hours of personal time every week makes someone a bad parent and partner, you genuinely need to talk to someone. This is EXACTLY what parents should be doing. They are supposed to find ways to maintain their own identity while also being a parent. If anything the wife should find ways to carve out more and ask OP to cover those. She doesn't even have to go out if that's not her thing, maybe it's a few hours to read or pursue some other hobby uninterrupted. And it doesn't sound like OP would have a problem with that from what he's said in this thread. If you truly believe what you said and it's how you're approaching your parenting situation, you are going to make yourself, your kids, and any partner you have miserable.",
                  "id": 29,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "All the following comments outlining the importance of parents having hobbies and then immediately admitting the men have weekly time and the women don't - whoosh.",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 493,
              "content": "This totally makes sense why the wife wouldn’t want to use the family member. I wouldn’t want to ask someone to help me out when I can avoid it knowing that I will need a lot of help in the future. With a baby coming I’m sure they’re going to need more help from family",
              "id": 31,
              "comments": [
                {
                  "score": 242,
                  "content": "Yep those are like tokens. You only get so many.  If it were my husband I would be annoyed he didn't arrange babysitting to take me out instead of skipping out on his responsibility.. especially if I were pregnant.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 19,
                      "content": "And it could be a very real likelihood that said family member will find two young children overwhelming and only want to take the older one. That’s actually fairly common, especially with older family members who often don’t have the energy to keep up with more than one small child. Also, wife’s time to go out for a good long while is fast coming to an end. Going out postpartum, especially if you’re nursing is a chore and a half just to prep yourself and if you’re nursing on demand means baby goes everywhere with you. OP mentions on other comments she’s pregnant so she knows her days of going anywhere without a very young and very needy young child are numbered for the foreseeable future.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "yeah he kinda buried the lede about his wife being pregnant there lol. That changes things a bit. No doubt she thinks they ask enough of this family member as it is",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 128,
              "content": "Wait what",
              "id": 35,
              "comments": [
                {
                  "score": 389,
                  "content": "It’s mentioned in one of OP’s comments. Someone said that the wife might not feel like she can drink because she would be worried about her daughter and he responded that she wouldn’t be drinking anyway because she’s pregnant",
                  "id": 36,
                  "comments": [
                    {
                      "score": 447,
                      "content": "Yeah I ended up seeing that. It's almost like he thinks that justifies his behaviour but it actually makes it worse. They have a baby on the way and he won't even spend one night with the kid he already has.",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "I'm sorry to say I disagree with this. What exactly has been done\nSo bad enough for you to leave your husband for? \n\nMy little boy is 19 months old and I actively encourage my wife to go out once a week to see friends. Looking after a kid is hard as of course you know and getting away for a few hours once a week is not such a big deal. If I'm available in the evening which I am most of time I'll look after my son, if not my parents are more than happy to see him.\n\nIf you trust these people and they're happy to do it, so long as husband doesn't make it a regular habit what's the big issue?",
              "id": 38,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Your level of anger does not makes any sense. It is not like the wife would be affected. And I am saying it as a woman with 2 kids.",
              "id": 39,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Going go slightly push back, its good to have time with friends outside the house. For both parents. My wife and i have 2 young kids and our goal is for each of us to find a hobby that gets us out of the house weekly or biweekly while the other parent watches the kids. It can be quite depressing to watch your social life explode because of kids. Its not going to be what it was but once a week is not a huge time commitment. Its not wrong to go out with friends. In this specific case though his wife doesnt do it a lot so he needs to prioritize her feelings and try to get her to go out more often.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "You are that co dependant on your husband that you can't even fathom the idea of him spending time with friends? Embarrassing",
              "id": 41,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "As someone who has adult kids now, please rethink this attitude about game night! It's so SO hard to make friends after you have kids, if he has multiple friends who still want to spend time together that is absolutely priceless as the years go by. I promise, you don't want a man at home who has no friends in town and relies on you for all his social and entertainment needs. And you don't want to be the same, relying only or mostly on him for social interaction.\n\nSend him off to game night with no resentments and have him stay home while you go out on different nights, or switch off every other week, or have him host game night at your house. It's so much healthier over the long run.\n\nOnce the other friends also have kids/change jobs/move away it will be less and less anyway. And if the worst happens, one of you won't be left behind completely adrift with no friends to help you through your loss - I'm not being melodramatic, once you're older you will see this happen more than once unfortunately.\n\nEdit to add that I am not typing this in defense of OP, who is the AH in this situation for all the reasons others have elaborated so well. I just wanted to put in a small defense of game night, separate from any issues about unequal mental or parenting load.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 771,
          "content": "Jumping on the top comment to say that this has been a super interesting discussion, because I am literally reading this after having put my toddler to bed while my partner is out for his weekly game night (MTG, as a matter of fact, like what OP plays apparently). \n\nI am also the more introverted one, who rarely goes out while my partner has his weekly game nights & enjoys more frequent nights out. The only difference between our situation & OP’s is that we are not as lucky, in that we don’t have a reliable babysitter. If I were to go out, my partner would definitely have to stay home. But if we did have a babysitting resource like OP, I can see this situation coming up & my partner asking the same question as OP.\n\n& I would react the same as his wife. & I actually would wonder if I were the asshole & it’s almost gratifying to see many people here coming down on the wife’s side, because I wouldn’t have been able to argue that OP’s logic is pretty sound. Yet I, like his wife, would want my partner to stay home & would be upset if he still wanted to go out. & seeing so many people explain why she’s justified to want OP to stay home is reassuring to me.\n\n- The mental load of preparing for the kid’s overnight stay: OP could argue that he’d do all this prep, but I don’t think I’d be able to turn my brain off & not think about the logistics of having my kid stay the night at someone else’s house — BTW has she done this before? Actually stay overnight at this babysitter’s house without either parents? As a parent, I’d have separation anxiety about it, especially since the kid is only 2.\n\n- The mental load of being on call: OP mentioned wife is pregnant, which means wife will not be drinking during her night out — will she not then be the default emergency parent to be called if something urgent happened? I don’t think OP even considered not drinking completely on his night out (he mentioned having only a few drinks, but not nothing). If I were his wife, I’d be annoyed with the assumption that since I won’t be drinking, OP then can still drink, knowing that if there is an emergency call from babysitter, one parent (the pregnant one) would definitely be sober.\n\n- The mental load of having to be the bad guy by going against OP’s flawless logic that both of them can still go out. Like I said, OP’s logic is techincally sound, so the burden of having to go against that logic will be on the wife & I wonder if she’d be feeling guilty about saying no from an emotional place, because it makes her out to be the bad guy (the party pooper) for OP?\n\n- The mental load of relying on this babysitter too much (using the favour for separate nights out instead of date nights, which should be more important to OP than his friend’s bday) & also for the perception that OP prefers to go out than taking care of daughter?\n\nAnyway, I don’t think OP’s an outright asshole, even if I am also on the side of his wife. I appreciate him bringing this up for discussion if nothing else.",
          "id": 43,
          "comments": [
            {
              "score": 393,
              "content": "You know what, the more I think about it, YTA. But not because he wants to go out. But because of the following:\n\n- OP, you love your wife, yeah? You want her to have a great night out without any worries or stress, because she knows that her child is safe at home with you. That’s what she deserves, no, on her rare night out?\n\n- Well she would’ve had that, had you not throw a curveball in the middle of the week & proposing to change the plan.\n\n- Instead now you’re putting her in a position where she has to counter your arguments & convinces you to stay at home, despite your sound logic. & yes, I agree with you that you have logic on your side.\n\n- But relationships are not strictly about tit-for-tat cold logic, right? Sometimes you do something you don’t like, sacrifice your fun, even when it doesn’t seem entirely logical or fair to you, for the person you love.\n\n- & the biggest reason you are YTA? You are putting this on reddit whereby you are putting her in the judgement of strangers, some of whom see your cold logic & are calling her an asshole for wanting you to stay at home (the N T A votes), who are speculating on her reasons & asking her to justify & explain her reasonings.\n\nTldr: Your wife just wanted a night out, a rare occurrence, as you said! YTA because don’t you think she deserves that without extra complications of arguing her case for you to stay home & bringing reddit into this?",
              "id": 44,
              "comments": [
                {
                  "score": 109,
                  "content": "THIS. Why wouldn't one *want* to give their wife this opportunity? If they rarely go out and are now pregnant then this is one evening one should be more than willing to pick up the slack oneself.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "I absolutely love the vibe of this comment. It feels like me every I make a well reasoned argument, walk out of the room, then pop back in to say, \"ya know, one other thing...\" \n\nReally here for it 😀 (to clarify, not sarcasm, I am legitimately amused)",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I'm actually really grateful for your comment because I felt the same as you and also questioned why since OP isn't an outright AH and has decent logic and reasoning...but you put everything I feel about this really eloquently",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 555,
          "content": "Agree with this ,,Plus Op ,, your wife has allready expressed that she feels like you allready get more then enough help from family member & she would rather you be home ,giving family member a break .\n\nYta ,not a huge one but still ,your wife has expressed to you she'd feel alot more comfortable going out & having you stay home rather then relying on family to again fill in the gap so an enjoyable night can be had .\nConsidering she doesnt go out often & you go out regularly. ,I think its fair to take 1 for the team so your wife doesnt have to stress or feel guilty in any way ..",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 546,
          "content": "As a mother of 3 Thankyou for putting this into words. I had my second girls night out in 10years 3months ago and both times my hubby has been great and even went as far as to tell his mates do not call and no gaming tonight because he knows how much it meant to me. OP needs to put learn how to put others first\n\n Yes I did text him a few times during the night, but it was to keep him posted on OUR shenanigans and NOT to check in on the kids because I knew they were safe with him. \n\nWhen our kids are being babysat I am constantly checking my phone to make sure I have service and haven't missed any calls. It is so hard to switch off parent mode as the primary parent but knowing they are with their dad does make it easier.",
          "id": 49,
          "comments": [
            {
              "score": 25,
              "content": "Yes! I didn't even realize I did this until this thread. My child is 10 and I still do the same thing. Constantly checking for service and missed calls/texts when she's not with me.\n\nMy brain is tired.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 386,
          "content": "I’m also wondering if he goes through all the work of shipping their daughter off so he can go party, but does nothing for the two of them.",
          "id": 51,
          "comments": [
            {
              "score": 137,
              "content": "Yes! No mention of date nights",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 111,
              "content": "\"But my gaming!\"",
              "id": 53,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 370,
          "content": "> You get to go out. You get mental breaks from parenthood. She doesn’t get the same breaks. She’s asking for one now.\n\nI think that that's what this is about:\n> She doesn't want to ask this family member to have our daughter for the night because she thinks we ask too much of them... ....my wife is often quick to agree to leave our daughter there for sleepovers plenty of other evenings out of convenience\n\nIt seems this family member is currently helping OP's wife get those mental breaks without OP acknowledging that that's what's happening.\n\nMental breaks are so important for overall wellbeing and health. If this family member is even more important for securing this for OP's wife, I understand why she would be hesitant to ask this family member in this situation as well.\n\nIt wasn't mentioned, but I sure hope OP takes care of looking after their daughter the evenings OP isn't out with friends to make sure his wife gets some mental free time even when they are both home.",
          "id": 54,
          "comments": [
            {
              "score": 318,
              "content": ">my wife is often quick to agree to leave our daughter there for sleepovers plenty of other evenings out of convenience\n\nHe later on mentions that this happens when they are all staying over for diner, and they put their child to bed at that house WHILE they are there too. And often they'll leave her there when she's asleep, to pick her up in the morning. Not the same thing as just bringing the child over without the parents staying while the child is settling in.",
              "id": 55,
              "comments": [
                {
                  "score": 39,
                  "content": "Yeah, context for this one is pretty important. Having their daughter stay over when they were already there visiting and daughter fell asleep is a kindness, but it’s much less of a commitment than an independent sleepover. The family member may also be happy to watch their daughter, but wife is concerned that that’s not a free ticket to watch their daughter for whatever reason. Lots of people are OK with watching their family members children for date nights or mutual events that both parents are going to in order to give the parents a full break. They may not be as comfortable with getting the daughter dumped on them whenever mom has plans, so dad wants to go ahead and make plans too rather than be responsible for his child. Wife may be concerned that if they start this once, this will become a precedent.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 17,
                      "content": "If this is the first time Daughter is knowingly going to bed without mom and dad around, it could also be a Big Deal to her, even if she gets on well with the relative. And in that case, *who* is going to be the parent expected to respond to the \"your kid is inconsolable and IDK what to do\" call? I think OP really needs to step up here and confirm beyond a doubt to wife that he's going to be the on-call parent and the one monitoring his phone/checking in and if he's not willing to do that, just stay home.\n\nLike, my niblings LOVE me (not to sound conceited lol). But no joke, they just took to me when they were babies and I'm the first adult they go to greet after Grandma. The very first time I babysat through bedtime, Nibling 1 (5) went right to bed after his routine (bathroom, tuck in, story). Nibling 2 (3) ... somehow only just then realized Auntie wasn't Mommy and it became A PROBLEM. He was distraught. I'd get him settled, he'd almost be asleep, and then he'd look at me and just start crying and calling for mom. And this was in his own home, in his own room, surrounded by his bedding and his plushies with his white noise machine and his big brother down the hall. He finally exhausted himself ... 10 minutes before his parents got home and woke up right away.\n\nIf Daughter has never fallen asleep in a new place without Mom and Dad, it may be rough and I can see OP's wife being worried that 1) it might be too much for the relative and 2) she'll be the one expected to end her night early to go over and pick up Daughter. That's a legitimate concern and one I feel OP isn't taking into account.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "He may be abusing his \"they want to spend time with her\" card.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 196,
              "content": "The wife gets mental breaks from the family member (probably her mom) and not from her husband. She resents her husband for this and is afraid the family member may have \"the talk\" that they feel they can't watch the child as much. The wife can't rely on her husband to watch their child without relying on this family member. It's a no-brainer.",
              "id": 59,
              "comments": [
                {
                  "score": 152,
                  "content": "Kind of like when I worked retail. On days when I had to close, my ex would pick the kids up at daycare and either drop them off at his mom's, my friend's or another babysitter's (that we had to pay) so he could do whatever he wanted instead of just going home and taking care of the kids, getting them fed, bathed, ready for bed, you know, like I would do. Even though he made other arrangements and didn't just leave them home alone or drag them along to do whatever he was doing, it still pissed me off because why couldn't he ever just be an equal parent?",
                  "id": 60,
                  "comments": [
                    {
                      "score": 85,
                      "content": "This would eat at me, too. Like doesn't he WANT to spend time with his kid? Why isn't he jumping at the chance for this one on one time?",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I had some serious lingering resentment towards my partner over this kind of thing. He started work at 7:30 and I started at 8;15, so the whole “get the kid out the door and to daycare” naturally fell to me. But he finished work at 3:30 compared to me at 4:30, and in that first year I could count on my hands the number of times he’d pick our kid up and go home and just get supper started etc. He almost always took that hour shop or go for a pint with a friend or whatever and I was the one who ended up picking up the kid and then getting supper going etc.\n\nAnd he’d always say that all I needed to do was tell him and he’d pick her up and I could have an hour to myself after work some days, but who can enjoy an hour like that if I know all of the parenting and night chores are waiting for me at home?\n\nI wanted an equal partner. I wanted him to Jair want to parent.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Yeah I think part of it is the feeling of reciprocity. Yes, she is still getting her break, but by tapping a favor, not by her partner doing the same thing she regularly does for him. It gives the vibe that he’s not willing to inconvenience himself for her in a way that she does all the time.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 317,
          "content": "This is the best answer.",
          "id": 64,
          "comments": [
            {
              "score": 161,
              "content": "It really is a great answer. It’s sums up exactly how I felt when we had little kids. Well done.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 194,
          "content": "Plus the wife may not want to use up the other sitter’s good will or willingness to babysit. Maybe she’s thinking it might be better to ask them when they can both go out for a date night?",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 107,
          "content": "This, but also she might feel guilty/anxiety about asking someone to watch the daughter.  I'm sure she trusts them but I find some of my parent friends have an internal conflict about it.  If your wife is the same she doesn't want to have to take that on board to have a time out.  It doesn't matter if she or the husband organized it, the feeling will still exist.  Also the opp really really should have discussed it before organizing it.  Communication often creates a pathway for solutions that otherwise would set and be impassable.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8485,
      "content": "YTA, she barely goes out. You go out all the time! Why can’t you give your wife this one night and spend time with your toddler???",
      "id": 68,
      "comments": [
        {
          "score": 4644,
          "content": "This is what was really weird… he admits he goes out every week plus some. Compared to her 6 times…. Like does he know how many weeks there are in a year?",
          "id": 69,
          "comments": [
            {
              "score": 2098,
              "content": "He admits going out 108 nights a year to her 6 times a year, and that doesn't seem to cover special event like birthdays, celebrations, just regular hang outs/game nights. His offer of sleeping in is insulting. \n\nJust for that he's the TA!",
              "id": 70,
              "comments": [
                {
                  "score": 760,
                  "content": "Wait, what? I agree with everyone that he's being an asshole, but how does 1x per week + 1x per one-two months = 108? What a weird number, unless he said that verbatim somewhere I didn't see.\n\n52 weeks in a year = 52. Add 6-12 for the secondary friend group = 58-64. Even if he saw both groups weekly, which is not what he said, that would be 104, not 108.\n\nI find it a little hard to believe that he is admitting to going out more than twice a week year round. Just confused how you came up with 108.\n\nAgain, he's being, at the very least, a bit selfish and tonedeaf to his wife's very reasonable needs.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 269,
                      "content": "Even if he goes out once a week that’s 52 times to her 6.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 450,
                  "content": "This person doesn't know how to do math for once a week for a year and there's 260 people who just upped it without fact checking.\n\nEdit: 480 people now\n\nThis is indeed the representation of reddit itself.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Some people are able to approve of the point while realizing the math is off.",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 163,
                  "content": "He has fun, time to socialise, relax, and switch off from responsibilities, and in return he \"lets\" her have a basic human need.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "So because he has a more active social life, he’s an AH? Wow. \n\nAnd not all of those are going out, he says he stays in for online too.",
                  "id": 76,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "Just gonna point that you, purposely?, omitted that is not always in person so he's  probably going out half or less the nights you said.",
                  "id": 77,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "she's free to go out more as well... she just chooses not to. Why the fuck would it make him an asshole for having a live?",
                  "id": 78,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Can you please share how you got 108 with the rest of the class?",
                  "id": 79,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Lol over a thousand ppl upvoted your dogshit math",
                  "id": 80,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Math is not your forte",
                  "id": 81,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "He specifically says he’s not out all the time and that he always makes sure to help and compromise around it.",
              "id": 82,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 177,
          "content": "She can go out. But nothing is stopping him from also going out",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 131,
          "content": "But .. she is going out?",
          "id": 84,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 40,
          "content": "He is giving her a night out. He’s getting childcare covered so she doesn’t have to worry. She seems to not go out by choice. I’m sure if she wanted to, he would stay home most often and watch the kids. It’s not like he’s our every weekend.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "My wife goes out once a week line dancing because it helps her mental health and physical health. Is She TA? No. Self-care is also family care. A lot of y’all need couples or family counseling and it shows.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "He's not stopping her from going out, so why does he have to stay home? He found a sitter that the kid goes to often, and the wife is OK with it normally. It's just now that he has something to do and not stay home like she does that it became a problem. It sounds like she wants him to be bored and home and not go have fun because that's what she normally does. That sounds vindictive.",
          "id": 87,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7791,
      "content": "I was on the fence until you said that parenting your kid was 'punishment'\n\nDude. So much the AH",
      "id": 88,
      "comments": [
        {
          "score": 1226,
          "content": "To be fair he didn't call it a punishment but rather it felt like his wife was trying to punish him by making him miss this birthday party when he had another alternative which was win win. They've left their daughter overnight there before, he said he's not drinking so in an emergency he would be able respond. Logically there's no reason for her to want him to miss the event *except* as punishment due to some harbored resentment. The fact that it would be to watch their daughter isn't the punishment, it just facilitates the punishment.",
          "id": 89,
          "comments": [
            {
              "score": 868,
              "content": "I think the real issue is that one of the rare times she decides to go out, after these plans are already made he suddenly decides he has to go out too. He can't stay home with his kid for one night? I dont think its really the party, or even the family member watching the kid, its the growing resentment of not having an equal partner. He doesnt do his fair share of raising their child and she is quickly losing her patience with being a married single mother.",
              "id": 90,
              "comments": [
                {
                  "score": 306,
                  "content": "He didn't suddenly decide, he was invited to a birthday party.  \n  \nAs far as the share in parenting responsibilities there is a better argument there.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 291,
                      "content": "It was sudden.  He could’ve immediately said to friend who invited him last minute that he’s staying with his kid tonight so it wasn’t an option!  He knew she made these plans already and her explanation as to why it made her uncomfortable should’ve been enough for him having married her knowing how hard it is for her to go out. The ease of mind knowing your baby is safe at home with the partner/parent is way more reassuring to her than being afraid they are taking advantage of a person they do rely on for her to take breaks!",
                      "id": 92,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Except she offered a perfectly logical reason… that they are overburdening their family member (and thus risk the family member not wanting to do ANY babysitting in the future.) OP days elsewhere in the comments the family member is already watching the daughter twice a week and sometimes overnight. I cannot stress enough what a RARE asset that is for a parent; she doesn’t want to mess it up.\nSo getting this family member to watch their daughter again for a purely social reason on his part is why he’s YTA. \nHonestly if he had gotten a different trusted sitter I think he’d have a better argument (still not great but acceptable.) But this is putting the burden of childcare of his child on someone else over and over again… just cause.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1008,
          "content": "I couldn’t put my finger on it…but as a parent of a 2 yo it’s this right here.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "The phrase that got me was \"I am covering for her\".  It's your kid for goodness sakes - you're not \"covering\" for anyone.",
          "id": 95,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5983,
      "content": ">I am covering for her\n\nNo, you're not. Someone else is. Get that straight. And you're missing out on some great memories with your kid that you can never replace.",
      "id": 96,
      "comments": [
        {
          "score": 1766,
          "content": "No they're not.\n\nSomeone else is covering for HIM.",
          "id": 97,
          "comments": [
            {
              "score": 321,
              "content": "It's fine, that's how it's always been /s",
              "id": 98,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 31,
              "content": "Since he isn’t specifying that this is his sibling/cousin/etc. he is asking, it sure seems as though he may also be using up one of HER favors with her sister etc. for HIS night. Family favor exchange can be a delicate balance, and if this is her family of origin, she may still be the one who repays it. \n\nAND: Maybe she also doesn’t want to push people to the max of what feels comfy and easy to do right before they have a second child and they will need more support. \n\nAND AND: It’s just different to all be hanging out together and to put the child to bed in that context, vs. asking for a babysitting favor. \n\nSheesh. At first I thought this dude was reasonable but now I think he is just really pushy. I mean it’s ok he brought it up as an idea, but now he’s arguing it as an issue of what’s reasonable even after she’s made it clear what she needs and wants for a rare night out. It is giving major “teenager trying to wear down a parent” vibes.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "So, it turns out the person covering for him is his wife’s family member which means he is calling in her social credits to go a birthday party.",
              "id": 100,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 923,
          "content": "There is also some level of optics here.\n\nFrom the wife's perspective, the moment the OP is asked to handle childcare alone so she can go out, he offloads the responsibility on a family member. Whereas everytime/pretty much everytime he goes out, she handles childcare herself. \n\nNow if the wife had a bigger sample size to work from, maybe this wouldn't be an issue. But this is how it stands now.",
          "id": 101,
          "comments": [
            {
              "score": 81,
              "content": "This should be higher up.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "My daughters dad used to do this all the time when she was little (we were not together, just co-parenting). Every time I would drop her off with him, he would go out with friends and leave her with the grandparents. They were delighted to watch her, but it always upset me. Just fucking stay home one night with your kid, bruh.",
              "id": 103,
              "comments": [
                {
                  "score": 7,
                  "content": "Don’t you just LOVE guys who “babysit” their kids, versus “parenting” them?! Ugh. I pity my straight girlfriends who live this horrible hetero truth",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Eh, I don't know if it's that I hate asking people for favors or if it's a mom guilt thing (I rarely experience mom guilt) but I HATE asking people to watch my child and try to limit it as much as possible to the times it's absolutely necessary. Depending on the dynamics of the sleepovers, that might be the carer asking for the kids to stay over instead of the parents asking them to watch. It is different. My husband never seems to have this issue. I actually got really frustrated at him the other day, because I had a medical procedure that he needed to drive me to, daycare was closed, and he was desperately trying to find someone to watch our son. In my view, it was not a big deal to watch our child at the doctor's office (I would have done it if the situation was reversed). In his view, he absolutely wanted me to have someone watch our son during his medical procedure so I wouldn't have to watch him. We just view the whole situation differently. It's far more stressful for me to find a sitter than watch and entertain him in public. It's far more stressful for him to watch and entertain our child in public than it is to find a sitter (that might sound bad, but I also get it, kid's little and he gets into things and gets loud).",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "This is the best argument in the wife's favor that I've seen so far.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": ">he offloads the responsibility on a family member\n\nOn HER family member. Who probably feels they can't say no or their beloved \\*pregnant\\* non-social family member will have to give up on socializing until the not-yet-born one is a teenager. \n\nAnd this is all because Hubby Dearest can't possibly miss a birthday party for his...um....not very close friends he doesn't actually see all that often.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Hadn’t thought of that. Good point.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "To one of *her* family members no less",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 596,
          "content": "In the event that the scenario was similar (i.e. every time OP goes out, his wife asks the person mentioned in the post to watch their daughter, so him doing the same wouldn't be different), then I would say that OP would have a point.\n\nInstead, this guy is being purposefully obtuse. He is trying to equate calling upon a *babysitter* to him being responsible for watching his daughter.",
          "id": 110,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 351,
          "content": "But these are his \"second\" group of online gamer friends that he only sees maybe every two months.  How do you expect him to replace those memories?  /S",
          "id": 111,
          "comments": [
            {
              "score": 122,
              "content": "In the post too he clarified it wasn't even two months, it was just a month ago lol",
              "id": 112,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "Bingo. I'm surprised this hasn't been brought up, but I have this little inkling, he doesn't spend a ton of one on one time with his daughter and his wife is seeing this. Like between work and going out, how much time is he spending with his daughter? Does he bring his daughter with him? She's 2, but still - I LOVED taking my daughter out with me all the time. She is so fun and we have a very strong bond. Yes, she says she hates me some days when I say no, but at the end of the day when I tuck her in, she tells me she loves me. Or out of the blue she'll run up and hug me and tell me she loves me. Or she'll ask about my day. \n\nOP NEEDS TO SPEND MORE TIME WITH HIS DAUGHTER THAN GOING OUT.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "That is exactly how I think OP’s wife is hearing it. I don’t think he’s being an AH intentionally, but refusing to stay in with his kid is communicating to his wife that watching their child is her job or someone else’s, but never his.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "His statement is already wrong. His wife is his partner and his child is also his responsibility. He shouldn't think of it as \"covering\" for her as it is part of his responsibility as a parent. He sounds like a part time dad. One who thinks that doing one thing is enough.",
          "id": 115,
          "comments": [
            {
              "score": 16,
              "content": "I'm sure if he didn't go, he'd tell his friends, \"I can't make it, I gotta babysit my kid.\"",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "I love that “covering “ statement. It’s just called being a dad and watching your kid. I’m guessing it’s normally her job to be the parent.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Cats in the cradle and a silver spoon…",
          "id": 118,
          "comments": [
            {
              "score": 9,
              "content": "Exactly.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Also what does he mean that he's 'covering' for her It's his child too therefore also his responsibility.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4105,
      "content": "Look, YTA either way but what I haven’t seen anyone mention is that you said you would be responsible for pick up and drop off. Sir, your daughter is two years old, picking her up after her bedtime is disruptive to her schedule and quite frankly (as a mother to three toddlers) this will make her cranky and want her mother. Not only that, I’m guessing your daughter wakes up fairly early so, are you planning to get up with her in the morning? \nLet’s be real, you said your wife rarely goes out. Give her this. Stay home with your daughter and get up with her in the morning.",
      "id": 121,
      "comments": [
        {
          "score": 290,
          "content": "He said the kid would be sleeping over though. Why are all these comments getting the facts wrong or making random assumptions?\n\n>I have since spoken with a family member who is happy to take our daughter at 5pm and **have her stay the night** and I have communicated this to my wife.\n\n>I made it clear that this will not affect her plans at all, **I will be responsible for dropoff and pickup of our daughter**, and will not ask anything of my wife because I understand that it is rare for her to have a night out like this and so I don't want her to change her plans at all.",
          "id": 122,
          "comments": [
            {
              "score": 191,
              "content": "yeah, like this is insane. If the relative really doesn't mind, then it IS just a win win for both parties.",
              "id": 123,
              "comments": [
                {
                  "score": 35,
                  "content": "Exactly. OP isn't an asshole if they both get to do what they want. I don't see where anyone's logic is here.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "This comment section straight up is insane. It's a bunch of weird sad people who think if you have a kid you can't have a social life. And because of that, they just blatantly misrepresent every thing he says and every detail he mentions",
              "id": 125,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "This OP is getting the weirdest Y T A verdicts. My husband usually plays volleyball once a week which I would equate to this OPs 1x a week gaming night  - it's a hobby, it's with friends,  he misses bedtime and I am fully on duty for the evening with my 2 year old son.\n\nIf I had an event, and then he was invited to a separate event, and took all the initiative to contact our trusted family member to take our son for the night, I'd have ZERO issue with this! Literally WHAT is the problem?? Win-win, plus now we both get to sleep in after our respective late nights!",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2864,
      "content": "YTA - Really inconsiderate here. Parenting your daughter isn’t a punishment, it’s what happens when you decide to have a child with your wife. You go out much more often than she does. Your wife understandably wants you to take care of her for one night, & i totally understand not trusting even family with her, if that’s the issue. Most CSA comes from family.. disregarding any of that, you’re her FATHER and she’s your DAUGHTER. Why is it so hard for you to watch her? Shirking the responsibility onto someone else instead of watching her for one night is wrong. Your friends should understand you have a child and can’t go out whenever. Grow up, she’s your child too.",
      "id": 127,
      "comments": [
        {
          "score": 671,
          "content": "Seriously! When my wife had \"Girls Night\" meetups with a small group of friends and our daughter was little, I turned those into \"Daddy Daughter Dates\" and we would make those as special memories. I used to even just take her to the mall and walk around with her and maybe have dinner at the food court. When she was closer to three, we added playing at the little toddler play area to the mix.  \nI cherish those nights of just the two of us as she's heading off to college next year, so Koch more than I would have a hang out night with my buddies.",
          "id": 128,
          "comments": [
            {
              "score": 303,
              "content": "I'm going to tell you right now, your daughter cherishes those memories too. Your perspective was genuinely lovely to read and your wife and daughter were fortunate to have a responsible and caring partner and father.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "My dad use to take me on Sundays out since he didn’t get as much time during the week since he worked a lot and it let my mom decompress. He died five years ago now and those memories are some of the most important ones now. In the future that time for your daughter will bring comfort!",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I love seeing other dads with this type of mindset. Keep crushing it!",
              "id": 131,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "This is too sweet ♥",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I didn't get a lot of alone time with my father growing up. But on the rare occasion we did get to do a Daddy Daughter Night because mom was busy it always felt like the most special time. I still remember each movie we saw together and where we went to eat after- I'm 36 now and those things mean the world to me. Your daughter will remember too :)",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "My wife and eldest daughter have girl scouts twice a month (wife is a troop leader). Those nights, my youngest and I do fun stuff just the two of us, it's an absolute blast and some of my favorite memories.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "We do the same. Anytime one of us is away when we usually would both be there we turn it into a Daddy time or Mommy time thing and do something special. Even if it's just going out for ice cream.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "He said it felt like the wife was trying to punish him by making him miss his friends bday, nkt that taking care of the kid was punishment. \n\nFurther, if it's just this one time, it's not hard to be along with his kid and it's just a fluke in schedules which a sitter can help with.  If it's a constant thing where he gets a sitter when he's solo with the kid, THEN it's an issue, but that's not mentioned in the post. \n\nNTA, unless this happens whenever she goes out and not just once/rarely.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "[removed]",
          "id": 137,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "He is not saying taking care of his daughter is a punishment, but his wife is trying to use it as one.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2756,
      "content": "Your wife goes out six times a year. That’s six nights that you are required to be the Dad and it’s too much for you?YTA and your wife may be questioning your commitment level.",
      "id": 139,
      "comments": [
        {
          "score": 39,
          "content": "This. His priority is saying \"yes\" to a birthday party instead of saying \"yes\" to his daughter.\n\nDude had plans: be with his daughter.\n\nA better offer came up: birthday party with a friend.\n\nCancels on daughter to attend birthday party.\n\nHis social life and friend circle is more important, clearly.  \n\nYTA,my dude. Stop canceling on your family. Your wife will remember this.",
          "id": 140,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 34,
          "content": "This is exactly what I was looking for in the comments. I wonder how many times OP has stayed home to be the sole caregiver for his own kid. Sounds like his wife does it all the time but a birthday is more important than being a dad and spending some quality time at home.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2125,
      "content": "This is definitely not going the way OP planned. He genuinely thought there would be an echo chamber here",
      "id": 142,
      "comments": [
        {
          "score": 972,
          "content": "I will agree I am somewhat surprised at the number of Y T A responses. But I did not come here looking for an echo chamber. I value the input from unbiased parties. It gives me a different perspective and something to reflect on. I am being argumentative where I genuinely think people are jumping to conclusions or making assumptions about things that are not included in my post.",
          "id": 143,
          "comments": [
            {
              "score": 1851,
              "content": "Look, of course you can both enjoy a night out, but dude you see your friends every month. You can miss one night. \n\n\"But it's a birthday party\", are you twelve? Who cares? Birthdays are not that special. YTA. You are fighting everyone who thinks so, which makes you an even bigger one because even though you have about 100 people telling you why this is important for your wife, you are choosing not to listen because you're selfish. \n\nDo this for your wife. Stay the f home.\n\nEdit: ugh everyone in these comments giving me grieve about my statement on birthdays grow tf up. Birthdays are fun, it doesn’t mean they’re important. It also shouldn’t matter that OP misses the birthday party of a friend he sees often because a birthday party isn’t the only way for them to celebrate. You’re all acting like birthdays are the equivalent of Christmas or even a national holiday. Chill. It’s not that serious.",
              "id": 144,
              "comments": [
                {
                  "score": 281,
                  "content": "It's a birthday party for someone he literally saw a month ago. Did they mention the birthday party then? If so, why didn't OP discuss it with his wife before she made her own plans? If they didn't, then it's a last minute invite when OP and his wife already had plans (her to go out, him to look after his kid), in which case social etiquette is to decline.\n\nAdd in the fact that his wife is also currently pregnant with their second child, OP is absolutely YTA, and a majorly selfish and inconsiderate one at that.",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 239,
                  "content": "Exactly!!! He needs to do it for his wife.",
                  "id": 146,
                  "comments": [
                    {
                      "score": 281,
                      "content": "And for his daughter.  Why does she have to be farmed out to a family member? She should be home in her own bed. Her dad can stay with her one night while mom does something for a change.",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "To me it was the articulation of it being exactly a month ago — as if that’s soooo long omg it’s been 30 days since I’ve hung with these friends and my social brain is atrophying. DUDE it’s 30 days. 60 days isn’t long when you chose to have something that depends on you.  I have to be available for my elderly ill parents, one with cancer and immobile. Im 40, no kids. I’ve had one night away since 2019. \n\nOp needs to act like an adult, not a 23 year old who isn’t used to not living with his buddies. This infuriates me. Such an AH, OP. Grow up.",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Something tells me his wife is annoyed of all the “hang outs” in general and this was her exact gateway to complain about it. He needs to stay the fuck home.",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "If it was such an important birthday he would have known about it or planned to be out way ahead of time not last minute like this. And as you said we are grown ups now, sometimes you miss a birthday even for a close friend.",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "LOL I laughed so hard - “are you twelve?” The amount of energy and narcissism surrounding adult birthdays makes me wanna vomit. I’ve never understood “it’s my birthday WEEK”.\n\nShove your birthday crown where the sun don’t shine I have more important things to worry about than adult humans aging.",
                  "id": 151,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 607,
              "content": "You’re very stuck on the details around the care of your child and are missing the big picture: your wife’s comfort.  No matter what you believe you’ve squared off, she’s not on the same page and it will impact her night. Perception is reality and you need to address her concerns. Again, you’ve checked off your list of covering everything, except alleviating something causing stress to your wife during a time where she is supposed to enjoy herself. Doesn’t not seem like the right call to dismiss her concerns when the cost is so little for you.",
              "id": 152,
              "comments": [
                {
                  "score": 99,
                  "content": "Agreed.  OP seems hung up on the fact that the \"end result\" is the same, but the wife is concerned more about how that result is achieved (which makes sense in the context of parenting).  Its like if I say to my wife \"hey lets order in chinese tonight,\" she agrees, but then when I get home from work she says \"oh I made us plans with 10 people to eat out, but its chinese so its fine!\"  Yea, we are still eating chinese, but what I wanted/planned for was me and you eating it at home, not going out and being social.  Same result, but much different scenario, and much different mental \"load.\"  A night out while your husband watches your daughter at home is much different than a night out while your daughter sleeps over a family members house with the husband off somewhere.  Much different level of comfort.  And the fact that this change in level of comfort is necessitated not by emergency, but because the husband, who always goes out, just wants to go to a bday party, only makes it worse.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 7,
                      "content": "This is ever good way of describing it.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "Seriously. I feel like people are also just skipping over the part where she said \"I don't want to have to ask a family member to watch her\" and then he went and did so anyway, and is still mad that she isn't accepting his solution. Why would you go around your wife on this? That's just disrespectful. Argue it out with her before you go grasping for someone else to bail you out.",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 232,
              "content": "YTA \nYou need to grow up and stop being selfish and self centered. Stop dodging spending time with your daughter. Don’t ship her to a relative...stay home with her and take great care of her so that your wife can enjoy herself in peace.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 219,
              "content": "you're arguing with every single person replying with yta LMAO you definitely wanted an echo chamber",
              "id": 157,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 117,
              "content": "Friends birthday or your kid?\n\nFriends birthday... or your kid...?\n\nWho takes more importance in your life? Your family or a friend? Who carried your child and made you a father? I'm assuming not your friend. So sit your ass down and watch YOUR child so your wife can have a girl's night.\n\nAlso your \"sleeping in\" shit is insulting. Be an active parent dude. Stop pushing your kid off on your wife and a family member.",
              "id": 158,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 74,
              "content": "Maybe you are only seeing things from your perspective.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Tbf based on what you’ve shared, you may have read things the right way. Your wife may be pinning you down and wants you to stay home this one time. \n\nIt’s worth talking to her and getting to the heart of WHY though. It’s a problem in your relationship if she thinks you go out too much, or that you’re relying on that family member too much for child care. \n\nThat is the issue you should be digging into, not whether you have to miss this one bday party, when it seems you’re able to be much more social than both your wife and most other parents of toddlers.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "OP you do realise that there will also be a big knock on effect with how you're viewed from this behavior, right? Both to your wife and her social circle.\n\nAt some point in that girls-out night the conversation is going to be on the person who rarely joins them and the first two things she's going to be asked about are 1. Baby and 2. You and I can almost guarantee something like this will happen -\n\"Oh [ops wife's name] we're so glad you got to join us tonight! So, how does it feel, leaving baby with op for a whole night while you come out and party!?\"\n\"Ah well actually he decided to get a sitter so he could party...\"\n*Everyone's eyebrows raise* \nThe conversation turns to you and all the gal pals tell your wife everything all these redditors have been saying, confirming her feelings towards the situation were completely justified. \nMaybe some name calling.\n\nSigned - a 34 year old female with friends with kids, who only come out once in a while for gal pal night x",
              "id": 161,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "I think the part that would make me the most mad as a wife is because your wife said she wasn't ok with the daughter being babysat overnight and you went ahead and arranged it anyway. She didn't ask you to make accommodations for your daughter, she asked you to stay with her. Most things with parenting is 2 yes 1 no. So if one parent isn't ok with a situation, it doesn't happen. This isn't a friend flying in from out of state you haven't seen in 5 years, it's your friends you see all the time. The level of awareness and concern you have for your child being at home with their parent vs someone else is vastly different. I don't have to worry about my kids when they are with my husband, I can't stop myself from being concerned and feeling the need to check in when they are with someone else.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "YTA bc you made plans to spend time with your daughter and now a party came up so you want to ditch her. Not just for the evening but overnight. \n\nDude, you are a father now. You have one child, one on the way, it’s time to choose them over your little gaming friends.",
              "id": 163,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "I’m a mom of two kids and I’m surprised. I think it’s really weird all these people saying they can’t relax when their kid is with a sitter, and I don’t know sounded like a great solution to me.",
          "id": 164,
          "comments": [
            {
              "score": 8,
              "content": "Yeah that was my thought, too, but I'm seeing a lot of good arguments as to why it isn't as good a solution as I initially thought.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I think it's less to do with not being able to relax with a sitter and more about not being able to relax knowing she has a selfish partner.\n\nIt's the same feeling when you finally get to take a vacation from work and they call you because there's an emergency. Yea, having someone else handle the problem is a good solution but it doesn't stop you from thinking \"I finally to relax and now I'll have to deal with this when I get back...\".",
              "id": 166,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "It's kind of interesting to me as well, I originally thought NTA so it's interesting and a bit weird seeing my being on the wrong side of one of these. (I feel usually I'm with the main thought on these posts).",
          "id": 167,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1605,
      "content": "i think you're getting a lot of unfair flack OP, but my judgement is a very, very soft YTA. like, here's the thing — your description and explanation of everything is extremely logical. i read your post and spent so much time scrolling through all the comments completely unable to understand why everyone was attacking you and making assumptions. i genuinely could not comprehend how you could be in the wrong, given that neither of you would have to give up your night out and your daughter would be well taken care of. and if i were in your position, id absolutely want to go out and be completely stumped as to why so many thought i couldn't. but then i thought some more, and another commenter mentioned something about how this is about emotions, not logic, which was what helped me realize why you should stay home. lemme explain: \n\nyour wife doesn't just want to go out with her friends, she wants you to stay home with your daughter when she does. not as punishment, because you're always going out and she's always staying home with her. she wants you to stay home with her for three reasons, as far as i can tell: first, the one she told you about how this family member already does so much for you guys. i know that you asked them and they said they'd be happy to, i know you have a routine set up where you do this all the time, and i know that because of this it seems ridiculous to assume that you'd be putting this family member out by asking for their help one more night. but here's the thing: she was probably already worried that you guys rely on this family member too much, and now here's a situation where you don't *have* to rely on them, so to her it probably feels that much more egregious and entitled to *choose* to take advantage of their kindness just so that you can have a night out. so to her, this is not an isolated event that can be looked at in a vacuum, it's the straw that breaks the camels back. or rather, it's the iron pipe that you throw on top of all the straws. so, regardless of whether or not your family member is happy to take care of your daughter that night, it will still stress your wife out that you're asking them to, and she won't be able to enjoy her night out. that alone is enough of a reason for me to think you should stay home, but there's two more.\n\nthe second reason is that she wants YOU to stay home with your daughter. i know in other comments you said you spend a lot of time with her, i know you said you'd only have dinner and bedtime with her even if you did stay home, but i want you to look at it from your wife's perspective. she stays home alone with your daughter a lot more than you do. i'm sure that those nights alone with her entail the same dinner and bedtime, so not a whole lot of time on any given night. however, these nights add up. your daughter is spending more time with your wife than you, and as a result they are building a deeper connection/relationship. does your wife PERCEIVE herself to be the primary caregiver? emphasis on the perceive -- it's not about whether she *is* based off a logical breakdown of time/chores, it's about whether she *thinks* she is. and if she does -- why? further -- who does your DAUGHTER perceive to be her \"main parent\"? who does she go to when she's hurt, or has a question, or has a nightmare, or needs something? is it possible that the time/chores/stuff you do for your daughter/household is more practical and less emotional, and therefore does not build as deep of a bond with your daughter as the work your wife does? basically, i think your wife wants you to take this chance when you're alone with your daughter to build the same relationship with her that your wife has. she wants you and your daughter to have a closer relationship, for your daughter to know and rely on you as much as she does your wife. it's also possible she's tired of being the primary/main, and wants you to be equal parents. this night is just step one in that direction. \n\n(side note/observation: your wife might be looking at things in the long term/trends, while you seem to be looking at things in an isolated, individual way. keep that in mind for future disagreements).\n\nthe last reason, and imo the most important one, is that *she wants you to stay home.* it honestly doesn't really matter if it's logical, it doesn't really matter if you don't *need* to, it doesn't really matter if someone else can watch her and you can both have your night out. she's asking you to stay home, staying home would make her happy, you should do it. it's a small ask, and doesn't put you out too much. yeah it sucks you won't get to see your friends and celebrate their birthday, but if they mean that much to you then you should organize another night out for you to spend with them to make up for it. i know that just on principle it seems unreasonable, and you still might not Get It, and maybe you're even worried about slippery slopes and not wanting to entertain crazy demands just to make the wife happy. but ask yourself — does she always make unreasonable demands? is this a running theme? or is it that every so often she asks for something that you can't understand why, but it wouldn't be the hardest thing for you to do? because there are times where we can't really understand the reason why someone does something, but we can accept that they *do* and respond accordingly. your choice here is to use logic to deny your wife's feelings, or to accept that she feels the way she does and do what you can to make her happy. \n\nthat's why my judgment is YTA and not NAH. it's because while logically you *may* be right (and that's only if the first two reasons i offered were wrong), your wife is having emotions and the kind thing to do would be to acknowledge that and do what you can to help, even if it involves a bit of sacrifice. \n\n[this tiktok](https://www.tiktok.com/t/ZT8rWTj8o/) about logic, emotions, and empathy is some good food for thought and informed a lot of my perspective. hope it helps :)",
      "id": 168,
      "comments": [
        {
          "score": 367,
          "content": "This was incredibly helpful and insightful. And as much as I hate TikTok, that was also very helpful lol.",
          "id": 169,
          "comments": [
            {
              "score": 199,
              "content": "OP, I think the above comment explains the situation amazingly (it was next level insightful, so impressive!).  While logically you are right, you are missing the emotional element that your wife is experiencing. That's at the heart of the situation. The more you try to justify your perspective in the comments the more people will tear apart your answers (though I totally I get why you feel the need to explain yourself). The only thing that matters is that you have a conversation with your wife and maybe just try to appease her in this instance. Wish you well!",
              "id": 170,
              "comments": [
                {
                  "score": 126,
                  "content": "The key point people so often miss is that a full logical accounting of a situation INCLUDES EMOTIONS. They're part of reality. \n\nIf your logic doesn't account for them, your logic is missing inputs and you can't trust the output.",
                  "id": 171,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Well said, and very true!",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 159,
              "content": "Adding to this: if you’re gonna arrange childcare for the night like this, do it for a date night and not for a night when both you and your wife are off doing separate things. As parents, the majority of your free time is spent on your kids, so getting time together as a couple is so important. As is time with friends or hobbies, don’t get me wrong, but your wife is your partner, coparent, and teammate, so spending quality time with her should be a slightly greater priority.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 105,
              "content": "As helpful as the emotional discussion is, I'm going to piggyback and go further on the parent comment's first point:\n\nAbsolutely do not take your babysitter for granted. Even if they genuinely enjoy babysitting now, that will almost certainly change at some point. Don't push your luck, instead save their extremely generous services for occasions when you and your wife want to do something together.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "I would add ( I was coming here to say much the same)I think you need to really think about your lifestyle as a part of this scenario. Have you always gone out so often? Does your wife STILL only want to go out about 6x/yr? Now that you have a young child has it never occurred to you that being out of the house that many nights a week has become a problem for your wife? And then, on one of the infrequent times she has a night out, you STILL couldn’t modify your desires to take care of your child. It doesn’t matter that you made the arrangements you did. It’s the fact that you have no desire to voluntarily spend time CARING (not covering) for your daughter on your own while your wife enjoys a night out- something you do all the time. I mean if you really go out 3x a week that means you spend 156 evenings a year out with your friends. And if your wife only goes out 6x/year that means she’s with your daughter 359 nights out of the year to your 209. (Excluding sleepovers and if we’re just talking your availability to your family during regular days) Does this seem fair to you? And then, on one night where she wants to be able to go out, you still refuse to care for your daughter and arrange a sleepover instead. No wonder she’s upset. And let’s be clear- taking care of your child as its parent should never feel like you are being punished. If it does that is an indication that your priorities are not straight and you should look into that. Now that you’re a father, your focus should be on your family not gaming. And I’m not saying you shouldn’t go out. But you might need to rethink the frequency.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Ya this is an emotion vs logic problem.  \nYour wife trusts you to watch your daughter. She has faith in you. It's not punishment, it's that you're her partner in life, and she emotionally needs you to step up this day and put logic aside.  \nAccept that she loves and trusts you more than anyone else in the world, and stay home.",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Bro, it's a shame this reply is so far down, because the original reply is a gentle and reasonable take and your response is grateful and humble.  Kudos to you both, best wishes to you and your family.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "So what you finna do? Stay home or go out?",
              "id": 178,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 360,
          "content": "This is one of the best responses to a AITA thread I've read. Well done. \n\nSometimes doing the right thing is to make sacrifices to appease the ones we love even while logically there's a solution where everyone wins. \n\nIt's something I struggle with and this is a wonderful reminder that it's better to be kind than to be right.",
          "id": 179,
          "comments": [
            {
              "score": 70,
              "content": "Yes, exactly. I couldn’t understand why YTA until I wrote out my own comment and realized that this disagreement is just another version of the same ones I see all the time and dealt with in my own previous relationship - the winning solution isn’t finding a way where OP and his wife can both go out. It’s a way where OP and his wife are both happy and feel like things are fair. The fact that she isn’t comfortable with this solution means it’s not actually a solution for her problem. \n\nMost conflicts on here are met with extremely self-focused responses: “leave him/her,” “go NC,” “you’re in the right, tell them to fuck off.” But like…if I love someone, I want us both to be happy. Unless you really don’t care about someone, why act selfishly at their expense?",
              "id": 180,
              "comments": [
                {
                  "score": 37,
                  "content": "The reason I'm YTA is that they aren't actually using a solution where everyone wins. Yes, both parents get to go out, but the wife is clearly not comfortable with asking the aunt to pick up more child care hours. Aunt already gives a lot of time to watch the kids (and I take OP at their word that aunt enjoys this time, and was happy to watch their daughter this time as well), but baby #2 is on the way. \n\nThe aunt is soon going to transition from watching one kid for a few hours thrice a week (and a kid that seems well behaved based on OP's confidence that she sleeps through the night and that once bedtime happens the night is over) to watching 2 kids. 2 kids vs one is usually more than doubling the amount of energy required, and there's a real risk that the baby will be significantly more hands on than current daughter.\n\nThis arrangement needs to last for *years*. Aunt watches kids when neither parent can due to work, and that's not likely to change. So this aunt is a massively important resource that will enable their life style for probably the next 4-5 years at a minimum.  If the aunt ever winds up not wanting to spend her time watching kids, it's going to take significant sacrifices to replace her. \n\nThe wife clearly feels bothered about asking the aunt to do more. We don't know why that is, could be she's worried aunt will change their mind down the line, could be she doesn't think the aunt enjoys it as much as she professes, it could be she's completely misreading the situation and the aunt is happy to watch now and forever and that source of familial good will will never be overtapped. \n\nRegardless, the wife clearly has concerns over how much the aunt is helping, and a solution that doesn't address those concerns isn't a solution where everyone wins. It's possible the wife's concerns are unfounded and she's asking OP to stay home when it wouldn't be a problem that he goes out, but it's also possible the concerns have basis and they risk losing a critical resource of their current life style, or at least souring the wife's relationship with somebody OP described as \"like her second mom\". The wife's concerns over how much they're asking of their aunt need to be addressed before the solution is actually one where everybody wins.",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "loved the way you phrased it -- \"the fact that she isn't comfortable with this solution means it's not actually a solution for her problems.\" that's perfect!",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "This is the best response and something I couldn't be bothered to write myself.  Good on you.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 105,
          "content": "This is wonderfully written. To add given the comment about the pregnancy, wife is likely also viewing this as a limited amount of time with only ONE child. You are making a choice to focus on your daughter when, in the future, you will be making a choice to spend it with your daughter because mom must spend it with the new baby. Prioritizing verses sharing.",
          "id": 184,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "So well written. Great job getting into the emotional components here.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "It took far too long to get to a comment that showed the proper amount of empathy for both sides, given all the details we were given. \n\nAnd we were given so many because OP graciously kept wrestling with people whose only goal was to not just call him an asshole but make him feel like an asshole. \n\nThis poor man has been called an alcoholic even though he stated on multiple occasions he doesn't really drink. \n\nThis poor man has been called a selfish deadbeat even though he stated on multiple occasions that he regularly takes his wife on dates and his daughter to the park amid other fatherly duties. \n\nI am convinced his wife herself could confirm he's a good father/husband complete with video evidence she is, in fact, his wife and it would get downvoted. \n\nHe stated multiple times the likely outcome would be him staying home, and yet he was repeatedly told he had already made up his mind. Why are you even here OP, they questioned. \n\nHe was here for this comment. Someone who could empathize with his feelings while shedding light on why he may not completely be empathizing with his wife's. \n\nSimply put this is one of those situations you can be \"right\" or you can be happy. He got a tad bit caught up in being right that he forgot to take into account he should do this simply because it'll make the woman he loves happy. There's no bigger reason than that when the request is reasonable, and her request is more than reasonable. \n\nAnd even then he seemed like he would have erred on the side of her happiness. \n\nI've never seen people make something so innocuous seem so nefarious at every turn. Literally, any response he typed viewed with sinister intent. \n\nBecause like him -- but to a far larger degree -- people in this thread forgot to lead with empathy. \n\nIf your still reading OP, blessings to you and your family and your baby on the way. I hope you stay home and your wife has a wonderful time. \n\nNot because you don't deserve a night out.\n\nNot because you've had too many nights out.\n\nNot because you finally need to pull your weight. \n\nNone of that was ever true. \n\nBut because your wife deserves it on her terms and that's okay because you love her and she loves you. 🙂",
          "id": 186,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "All of this. I miss awards.\n\nThis isn't about logic, it's about listening. You should be excited to spend a night with your daughter, and give your wife a much needed break, not view it as a punishment. Relationships are give and take, not black and white, 50/50. You can do her, yourself, your daughter, and this relative all a kindness if you view it that way rather than complaining you can't go to a birthday party. Soon there will be another baby in the mix, so why can't you give her this one night without extra worries?",
          "id": 187,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "This should be the top comment, very thoughtfully written and sums up nicely why he's TA with kindness and understanding. 👌",
          "id": 188,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "This comment is one of the most genuine, kind, and helpful comments I’ve ever read. Thank you for posting and helping to enlighten others on a more-complicated-than-it-looks situation.",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Finally someone not assuming and projecting their issues, and actually giving great advice. This was well written!",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "This is a fantastic answer, but I would also add that to me, knowing my baby’s parent is looking after her would enable me to relax more than thinking about a family member taking care of her because as mentioned in other comments, family member might default to me for questions or an emergency, it will be on my mind she is staying the night in a completely different environment she may not be used to, so it could impair her sleep, trigger fears of abandonment, etc. It’s a comfort thing for the daughter and also an ease thing for the wife. If I only went out 6 times a year (crazy to me and likely a contributing factor for some of the anxiety around daughter’s comfort and possible perceived parental inequity feelings), then I’d want to be able to do so with the ability to feel relaxed and present for my friends, without having my mind back on my daughter every other second because rather than being comfortably at home with a parent, she is in a less familiar environment overnight and other parent might be indisposed or inhibited and therefore I must stay clear-headed and responsible.",
          "id": 191,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1482,
      "content": "YTA. You see your friends *far* more frequently than your wife sees hers. You’re long overdue to take more turns staying home. \n\nWhen’s the last time you and your wife went out together? You should save your babysitting credits with your family members for date nights, not just nights where you go hang out with your friends by yourself like usual. \n\nThe fact that you think it’s a punishment to stay at home with your own child while your wife has an extremely rare night out is really telling. Stay home with the kid, apologize to your wife, and plan a date night soon where the family member can babysit.",
      "id": 192,
      "comments": [
        {
          "score": 237,
          "content": "100% this, when our kids were younger any babysitting was only organised so we could do something together as a couple",
          "id": 193,
          "comments": [
            {
              "score": 33,
              "content": "Our daughter is 3 and this is still how we do things. The only time my MIL watches her is if we go out together on a date night. This guy is a major AH",
              "id": 194,
              "comments": [
                {
                  "score": 23,
                  "content": "Also, dad needs to spend more time one-on-one with his kid. There's a different level of care when you're the only parent home for an extended period of time. I'd wager than since their kid is used to mom being around constantly, when dad is left solo parenting, it's confusing and difficult for the kid. The only way to fix that is for dad to solo parent more often, and not drop the kid off with someone else when his wife goes out.",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "This is what is bothering me about the post! My sister regularly watches my son, including overnight. Hell, they just had him for a full week so we could take our honeymoon (he is almost 2). But if it’s EVER a night or some situation where only one of us is going somewhere, the other parent stays home. If there’s a short time lapse where one of us is still at work, we call my in-laws to take him for an hour or so MAX. There is no calling a babysitter so we can see our friends weekly, or so I can attend a party while my husband sees friends. It’s one of us *sacrificing* for the other.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I’m wondering how the family is related to him. If the family member is related to his wife then he’s calling in *her* social credits so that *he* can have a night out.",
          "id": 197,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}