{
  "post content": "So my situation is a little difficult so I thought I would confide in the good professional people of reddit. Couple days ago me and my brother we’re hanging out late night doing regular guy things drinking, watching sports, etc. We haven’t seen each other in maybe 5-6 years so naturally we started talking about life and what’s been going on the past few years. Towards the end of our conversation we started to get to the “secrets” I mentioned something along the lines that I smoked weed for the first time and did various other substances (This was hard for me to tell because my whole life I was pretty much anti-drugs and such.) We both laughed about it saying “Just don’t let mom find out” The joke died out after a little bit and then he just blurted out “I cheated on my wife...” At first it didn’t register until I saw his face and he was dead serious. I for one hate cheaters, but I try to do my best not to judge anyone for their actions. He begins explaining this was something that happened about 4 years ago when his wife was always busy with work. She would travel a lot and be away for weeks at a time. He told me they were going through a tough time back then lots of arguing, not communicating, and that he felt really lonely. During this same time my brother met a girl at his local gym, started off as friends, slowly kept bonding and you guessed they did the sex. He told me this occasion only happened once and pretty much cut her off after that night because he started to feel guilty for a short while. Few months later his relationship turned for the better for him and his wife. Pretty much after his wife’s travels slowed down his whole relationship has been great. They’ve both gotten promotions, bought a house, more family vacations. (They have a kid) \nHe told me life has been good to him now and he’s just thankful things have finally worked out. \n\nAs stated before I hate cheaters and I’ve always felt that the person being cheated on always has the right know. I know for sure this would probably destroy their marriage and there would be a fight for the kid. My heart tells me I have to tell her because it’s the right thing to do, especially because I’ve known my brother to cheat one other time on an ex-girlfriend couple years before his current wife. My brain tells me it’s none of my business and I should keep my mouth shut. I don’t want to see their kid go throughout that kind pain either. On one hand I betray my brother if I say something on the other hand I betray our close family friend because I know this secret and I don’t say anything. I wish he never told me, ignorance is truly bliss. So there it is, WIBTA if I said something?\n\nTLDR: Brother Cheated on his wife years ago because he was depressed, now everything is better and he told me about it, but now I feel obligated to tell his wife because she’s a close friend. WIBTA?\n\nEdit: I’m referring SIL as close family friend because my family and her family have known each since elementary school days and thus are Very close lol. I thought this iteration would make the relationship sound stronger than just SIL, but it looks like I was wrong.\n\nSecond Edit: Wow this is on the front page, I never intended nor expected this blow up as it did! I’m sorry I can’t reply to everyone, but there will be some kind of update.",
  "id": 1,
  "comments": [
    {
      "score": 29537,
      "content": "Upvoted for real conflict.\n\nYTA if you tell her now. I am usually on the side of \"the cheated partner absolutely deserves to know\". But here it seems to be a thing in the past, your brother has genuinely regretted it and improved his marriage. So it's better if you don't stir the pot now.",
      "id": 2,
      "comments": [
        {
          "score": 5576,
          "content": "Not sure if I agree but I also don't disagree I think this is a very tough decision either way.\n\nI think OP if doesn't tell wife needs to have another talk with his brother about how this can never happen again even if they become distant or whatever as there is no excuse.\n\nBut yes it was years ago and they've moved on had a kid e.t.c. so ruining that is not ideal so would understand him not telling and wouldn't say he'd be TA for not telling.",
          "id": 3,
          "comments": [
            {
              "score": 2615,
              "content": "Telling the wife - results in potentially splitting up the family. If they dont split then they may stay together just for the kid and the general relationship turns bitter and resentful. Or the chance the wife forgives and all is ok. Yet the relationship with the brother is ruined in either case. \n\nNot telling the wife - results in family life continuing to get better, kid doesnt see their parents split, which is never easy. Brother relationship is also intact.\nYet the brother has some moral issue with something that really isn't their business. \n\nAre we expecting the other brother to tell his brothers employer that hes been taking illegal drugs? \n\nI dont like it when both parties are involved in a sort of secrets exchange. Yet one person decides they will take the moral high ground, ignoring the fact that they have also admitted to some bad shit. Yet feel that they can trust their brother not to snitch, while snitching themselves. \n\nGet off your high horse. Holding your brother to something he did 4 years ago, that he also admitted was wrong. Is just crappy in my opinion.\n\nThis doesnt feel like a completely logical response. Are you jealous of your brother? Have you had some bad experiences people cheating on you? If so, dont reflect your bad experiences onto your brother.",
              "id": 4,
              "comments": [
                {
                  "score": 2269,
                  "content": "And OP could potentially say \"I'm keeping your secret, brother, since we shared in confidence.  But know that if it happens again I can't promise to do that same again.\"\n\nEdit: Hey hey!  Silver!  Thank you nice person!\n\nAnd a Gold. Woo hoo!\n\nJust puttin' in a plug for Dan Savage and his Lovecast where I've learned 99% of the relationship advice I ever pass on.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 188,
                      "content": "Exactly this.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "I like this response. The cheating is over and ended, his relationship has evolved. It’s going to bring up a lot of turmoil in the marriage. Giving your brother a pass, while saying you don’t support what he did and that if there is ever a next time you’ll tell, makes a lot of sense.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "^^^^ this absolutely. This is the only option I can think of.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "[removed]",
                  "id": 9,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "Since when has smoking weed ever been on the same level as cheating on your partner? Don’t equate the two.",
                  "id": 10,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "This guy *cheats*.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Doing drugs isn't immoral. Cheating on your partner is immoral.",
                  "id": 12,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "She has the right to know. Whatever you choose, you're not the asshole. It is not comparable to taking drugs and an employer. Her entire life is a lie.",
                  "id": 13,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Him doing illegal drugs does not affect his employer in a personal/emotional way. Awful comparison.",
                  "id": 14,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "It became her business when he told her. \n\nAn employer isn't the same as a life partner.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Illegal drugs don’t really harm anyone except yourself. Cheating directly involves another person.",
                  "id": 16,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Don’t tell someone that you cheated if you don’t want the person you cheated on to know. It’s not fair to put the burden of your betrayal onto someone else. Oh, OP’s brother is eaten away by the guilt of cheating, and just had to get it off his chest to someone? Boohoo, poor thing. Just because he feels guilty or has changed for the better or whatever since then doesn’t suddenly make what he did okay. He can tell her or not tell her, that’s his own decision, but don’t bring someone else into it.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 583,
              "content": "> if they become distant or whatever as there is no excuse\n\nThey hadn't seen each other for 5-6 years. I think they are already distant.\n\nEdit: stop upvoting me I misinterpreted what /veggiebuilder meant.",
              "id": 18,
              "comments": [
                {
                  "score": 277,
                  "content": "I interpreted that part as if the brother and his wife become distant again, like they were when brother cheated (wife was away for work and they weren't communicating), not the brother and OP. Not sure if that's the right interpretation though.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 100,
                      "content": "No yeah. My bad.  I lacked comprehension on that one.",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Upvoting you for owning your mistake",
                  "id": 21,
                  "comments": [
                    {
                      "score": 4,
                      "content": "lol I felt like deleting it.  But I thought it might also be a teaching moment.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "[deleted]",
                  "id": 23,
                  "comments": [
                    {
                      "score": 10,
                      "content": "They're talking about the husband and OP",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 89,
              "content": "She doesn’t know she how can she have moved on?",
              "id": 25,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 28,
              "content": "Correction * HE moved on. She never had the chance to know. She is building a life with a man that cheated on her. She has never had an actual say in this dilemma because no one has told her. Just because it's been X amount of years, doesn't mean she doesn't deserve to know that information. No one wants to be the bad guy and feel like they'll ruin a \"good\" life by telling the spouse. But then again are they the person who actually messed up and cheated? It was damaged the day he decided to commit adultery. This woman has a right to know so that she can have a voice. These two people, OP and his brother are making that decision for her.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "He's done it in the past, did it again with this woman, how do we know he won't do it again when things go boo-hoo again?",
              "id": 27,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "I would say if OP found out 4 years ago the shop for telling SIL has sailed. but since OP just found out I think it really depends on relationships with SIL if they don't keep secrets and tell each other everything (as in if the roles were reversed SIL would forsure tell her) then I say SIL should know as OP just found it. Also for all OP knows maybe her brother did already talk to SIL about it.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 393,
          "content": "To me it doesn't seem he regrets it he was pissy he wasn't getting laid due to his wife's work commitments then when those commitments eased life is now good. What if work takes her away on trips again  or their is a lull in their sex life will be blame her again? He certainly blamed her the first time in my opinion he is a shitty human being and the wife has a right to know",
          "id": 29,
          "comments": [
            {
              "score": 641,
              "content": "I agree that he seems to be blaming his mistakes partly on his wife's work trips. That is no excuse and however much they argue, it does not mean cheating is ok.\n\n>He told me this occasion only happened once and pretty much cut her off after that night because he started to feel guilty\n\nI think he has learned from his mistake though and OP laundering the matter will not help anybody. A better idea would be for OP to talk to the brother privately, express their anguish at his choices and just talk to him. If OP can get past his shitty behaviour, that is.",
              "id": 30,
              "comments": [
                {
                  "score": 234,
                  "content": ">I think he has learned from his mistake though\n\nAre we really going to count sleeping with a girl (that he was friends with) and then cutting contact with her afterwards as learning from his mistake?  Really?",
                  "id": 31,
                  "comments": [
                    {
                      "score": 349,
                      "content": "I don't think the guy deserves a medal or anything, what he did was awful no matter what his justifications are. But on the other hand there are people engaging in full blown affairs for years. There's even a subreddit for adultery (don't look at it unless you want to feel pure rage/sick to your stomach lol). Feeling guilty and stopping before it got worse is better than a lot of people do, but I'm not sure if I would call it \"learning from his mistake\" either.",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 92,
                      "content": "I mean, guilt and remorse are kind of the key ingredients.   The only way you learn is if you admit it was a mistake in the first place.  I think the question is whether he should be punished for the mistake he did make; I don't think any rehabilitation would factor into the decision to tell this dude's wife.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Yeah, I guess the ol' pump-&-dump is fine if it's part of a dude's personal redemption arc. 🙄",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "I think he is a shitty person. I don't think anything can be gained from blowing up his marriage with this information now.",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "It's also completely fucking irrelevant. It is truly great that he has learned from his mistake, but it is not relevant whether or not he has, because the wife deserves the opportunity to render her own judgment, and decide to what degree she wants to factor in his \"learning from his mistake\". The 3rd party observer doesn't know what's going on in a relationship and it doesn't really matter if we think \"but they seem happy and made up, and he did the right thing after\". \n\n&#x200B;\n\nOK, cool, great, but the only person who's assessment matters at all is the spouse.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Right? He smashed and dashed.\n\nBy dashing, he's in the clear?\n\nIdk about that",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 157,
                  "content": "> I think he has learned from his mistake though and OP laundering the matter will not help anybody.\n\nIt’d help his wife make an informed decision about whether or not she wants to stay in a long term relationship with someone who’s cheated on her. I’d want to know in her situation, I’m pretty sure most people would.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 448,
                      "content": "I wouldn’t. If my partner was a serial cheater yes I’d want to know because I’d leave him. But if it was a one off and he felt terribly guilty about it, then I’d rather it be his burden to live with not mine. We have kids so I probably wouldn’t leave for one offence, but it would make everything terrible between us for ages, perhaps irrevocably,",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 159,
                      "content": "I didnt want to know... it was a one off and she felt so guilty she came clean years later. It tore us apart and my life has never been the same. I am not happier for knowing...",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 72,
                      "content": "OP seems certain that it would destroy his marriage. Perhaps he isn't a good judge of that but it is what we have to go on. If the marriage is otherwise healthy then it deserves a chance and so does OP's brother, and so do The children that would otherwise live in a broken family. If things are better then no need to ruin things for the sake of OP feelings.\n\nYTA If you put your judgement ahead of the family.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I wouldn't. I said this in an earlier comment, but yeah if it was ongoing or happened very recently, absolutely. If it was one time 4 years ago, I would not want to know. I would feel obligated to act and file for divorce, even though it is not what I want to do. I would be hurt and devastated, and for what?? What purpose does it serve now??",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "In my case wish I had known sooner. Unfortunately the person in the know also became someone my spouse cheated on me with.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 256,
              "content": "[deleted]",
              "id": 44,
              "comments": [
                {
                  "score": 14,
                  "content": "Caveman no get sex. Caveman need sex. \n\nI cringed when I read the comment, my wife and I have had rocky times when I've been travelling for work and she's been cranking the overtime. It doesn't feel like we are in a relationship when that happens sometimes. I'd never cheat but to boil down a shitty situation like that to \"lol he just wanted to get his dick wet\" is just sad.",
                  "id": 45,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 98,
              "content": "If he was pissy he was getting laid, he wouldn't have cut it off after the first time.",
              "id": 46,
              "comments": [
                {
                  "score": 16,
                  "content": "There are many lines that have to be crossed before one ends up screwing someone outside their marriage. He didn't trip and slam his dick in her. He made one decision after another that led to him finally sleeping with her. That doesn't count as cutting it off immediately. That's like saying \"It's okay, I shut the game down after sliding into home at the bottom of the ninth.\"",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 73,
              "content": "How did you jump to this conclusion? The literal text is because they were distant, he felt lonely, and that they were arguing a lot.",
              "id": 48,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 66,
              "content": "op also mentioned this is not the first time his brother has cheated on a partner, to me it sounds like if he finds another excuse he would do the same again",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 61,
              "content": "It goes way beyond \"pissy for not getting laid\". He was not having someone there while the wife was away and someone stumbled in and filled the need over time. He wasnt at a bar or on tinder trying to get laid.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Exactly. “Don’t rock the boat” is what shitty people say to excuse bad behavior.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Same. Trying to figure out where it says OP's brother was \"depressed\". And even if he was, that's no excuse at all. He was just lonely and a douchebag.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "It’s also unfair that he’s burdening his sibling with this information. He cheated and lied and now is bringing in another person to deceive his wife. \n\nIt’s a tough place to be in. The brother is definitely the biggest AH in this situation, but if I was the wife and found out one of my closest friends knew and kept it from me, I’d be really hurt.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Took the words out of my mouth. It is kind of a moral dilemma, but this is true. She deserves to know.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 361,
          "content": "[deleted]",
          "id": 55,
          "comments": [
            {
              "score": 700,
              "content": "I've been married for almost 10 years. If my husband cheated on me once, years ago, and instantly regretted it then no, I would \\*not\\* want to know now. Back then, yes. Now? No. It's in the past now, it's not relevant anymore.",
              "id": 56,
              "comments": [
                {
                  "score": 306,
                  "content": "[deleted]",
                  "id": 57,
                  "comments": [
                    {
                      "score": 118,
                      "content": "Because your marriage probably won’t always be good, and I’d want to know if my partner jumps into someone else’s bed when we hit a rocky patch. You do you but personally I’d want to know if I can actually trust my partner and I could never trust someone who cheated on me.",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "I want to know. I'd wanna know that the person who supposedly loves me was hiding something huge and lying to my face without any sort of remorse like a sociopath for *years*.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I'd want to know because to me the \"good marriage\" would be a lie.",
                      "id": 60,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "If it causes you pain and stress then it clearly still matters. You're arguing the ignorance is bliss stance which is fine if that's your opinion but it doesn't make any sense to say that it's all in the past if it would still hurt you now if you found out.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 198,
                  "content": "[deleted]",
                  "id": 62,
                  "comments": [
                    {
                      "score": 113,
                      "content": "Exactly. A series of choices put you in a bed with someone you shouldn’t be while you’re married. Just because you’re sowwy now, it doesn’t mean it’s okay. She needs to be given the chance to make an informed decision.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Exactly. People don’t want to know because it would cause issues??? What kind of logic is that. Of course it would cause issues, they broke your trust and you had to comfort them and be all happy when they can face you knowing what they did. The husband is not remorseful or respectful . You can’t be sorry if you haven’t apologized? You can’t be sorry if you decided you get to be rewarded despite misbehaving. This lady deserves the truth regardless of how sorry this guy is. All I will say, if you want them to work it out. You can not be the one to tell her. He needs to own up to it.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 86,
                  "content": "Exactly. All it would do is cause pain. For what reason? They did it once and never again? I don’t need to know. If I found out at the time, yeah that’s different, but years later and we have no problems? Nah, I’m good in my ignorant bliss.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "100% the same. I would not want to know, and I would be super pissed at the busybody who decided for themselves that I should know.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "People always say they \"want to know\" but once they do (for cases where it's long in the past) they almost always wish they didn't.\n\n&#x200B;\n\nWhy? Situations like this. For whatever reason things were rough in the past, they cheat, regret it. Maybe the marriage is better and stronger and this information will ONLY harm it. Nevermind people dont understand how painful it is to learn of an affair until they do. No serious, it's in the top 3 shittiest feelings.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I’m at 10 years as well, the damage it would do is irreversible.  I wouldn’t want to know if everything is good now and it is the past.  All that will do is cause pain.  Let him live with it and spend his life making up for it and being a better husband because of it.  Now if he was currently cheating them yes, tell the spouse.  Don’t break up a happy family for someone else’s need to be honest.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "That's your choice.  It's nice that you get to make one.  The brother's wife didn't.\n\nAlso, in your scenario, it means that your husband has been continually lying to you for years.  That's not something that I'd want to base my own marriage off of but, hey, to each their own right?",
                  "id": 69,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "I've been thinking about this and I agree with you, if my wife did something lie that once in the past and the relationship had been in a good place ever since I'd probably not want to know either. It would just hurt everyone in the situation irreparably.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 365,
              "content": "I'm not sure I would want to know if it was truly a one-time thing, in the past and we were happy at present and had been for some time. Like this is one of those situations where OP could easily be viewed by all parties involved as stealing their happiness and forever changing that kids life.\n\nI don't think the brother should have burdened her with this information but I'm not confident she should blab it either.",
              "id": 71,
              "comments": [
                {
                  "score": 43,
                  "content": "OP also said that the brother cheated in the past though.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 7,
                      "content": "hmmm...I had missed the previous incident of cheating with a different girlfriend...idk now.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 217,
              "content": "It's HER brother. Talk it out with him,don't bring it up with her. It's not a free pass, he feels guilty. Think of the consequences here, fuck up this marriage, her nephew's stability, 4 years after the fact, just because she can't handle a confidence. It's their relationship. If it was an active cheating situation, totally different. It's not. It's over. It's done. Let it lie.",
              "id": 74,
              "comments": [
                {
                  "score": 76,
                  "content": "Him being her brother makes this difficult, that's true. However I don't think that it being a one-time-thing makes it okay. If it happened yesterday it would've been bad, but keeping this secret for 4 years makes it better? Sorry, I just have a different mindset.\nI think that HIS WIFE should make a decision about the situation and not the husband alone. If she still wants to divorce him after '4 happy years' then it is a big dealbreaker for her and he should've known better. \nOP wouldn't fuck up the marriage or her nephew's stability, her brother did this by himself.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 124,
                      "content": "This can’t do anything but hurt everyone. There’s literally nothing to gain from this situation. The husband made his mistake 4 years ago. It’s done, it’s old, the guilt has probably inflicted enough mental pain on him during that time. Does the wife deserve to know? Probably. Is it worth destroying her happiness and everyone else’s? Definitely not. Sometimes the right thing to do is the thing that ends with the most lives happy and intact. You are mad at the husband and that’s fine. But the wife and the child did nothing wrong and you would rather they be destroyed by this than let it lie. That’s fucked up.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "This. The fact that OP’s brother kept this a secret for 4 years (4!) says a lot about his character. His reasoning is bullshit and he shouldn’t get a pass because he feels guilty. You don’t cheat on your spouse because you’re going through a rough patch. It shouldn’t take cheating for you to realize you love them. OP should talk to his brother and try to convince him he should come clean on his own. If he won’t then OP should tell her.  Personally, I could myself forgiving my own husband if he did something similar and then told me himself, but to hear it from someone else? I’m not so sure. It should be the wife’s choice here, either way. NTA",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Wait, who is the HER you're referring to? I thought OP was a male\n\n&#x200B;\n\n>  \n>  \n> me and my brother we’re hanging out late night doing regular guy things drinking, watching sports, etc.",
                  "id": 78,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 60,
              "content": "I would want to know, but from my spouse, not from someone else. I would want my spouse to be an adult and talk to me about it, regardless of the consequences. Hearing it from a third party, especially my spouses sibling, just makes it worse. If that was the option, I'd rather not know at all.",
              "id": 79,
              "comments": [
                {
                  "score": 6,
                  "content": "Absolutely. Telling the wife breaks the trust with the brother, because OP immediately came clean to the wife. Not telling her at all isn't a good option either. The brother needs to step it up and talk with her about it. OP needs to convince him to confess. I couldn't imagine having to hear about this from my spouse's sibling! The more the brother sneaks around with this, the worse it'll be when the wife finds out, especially if the info comes from someone else.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 45,
              "content": "The problem is that the question is whether *the wife* would want to know. Every time groups of people are asked this question, there is always a real range of answers, in terms of who would rather know or not know and in what circumstances. So it's not all that helpful to assume that what you'd want in that situation is necessarily what someone else would want, because there are no absolutes.",
              "id": 81,
              "comments": [
                {
                  "score": 7,
                  "content": "Yes that's a good point and I already wrote it in another comment. OP said that she's a close friend so I guess she can tell if the wife is a person who'd like to know or not and then act based on this.\nI can only give my voting in terms of my own thoughts and values :)",
                  "id": 82,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "I have been with my husband for 12+ years since high school and I absolutely would want to to know if he cheated at any point. They maybe happy today, but what about when they aren't and he does it again?",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 235,
          "content": "[deleted]",
          "id": 84,
          "comments": [
            {
              "score": 14,
              "content": "But there's people like me. I found out after the fact and would rather not have. I almost didnt survive the anger and depression afterwards (loaded gun in my hands a few times).\n\n&#x200B;\n\nI would only want to know if it was on going.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I'd definitely want to know, if I don't have a kid.  If I had a kid, I wouldn't want to know if it's a scenario like OP described.",
              "id": 86,
              "comments": [
                {
                  "score": 17,
                  "content": "I would want to know regardless. If my partner could cheat and not come clean right away, then they aren't who I thought they were and they probably aren't someone I want to waste my life with no matter what good qualities they have. Trust is not negotiable. Kids would not change that.\n\nBesides, just because their marriage got better and he didn't feel like cheating anymore, doesn't mean he'd never go there if things go south again. He opened that door, and more than once (in his past relationship as well, so we know he didn't learn the first time.)  Marriage is never smooth sailing all the way. If I can only count on someone to have my back and stay honest when things are peachy, then I can't count on them at all.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Was your SO the one who told you?\nIf so, do you think you would have reacted differently if you had found out from a 3rd party and not directly from your SO?",
              "id": 88,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 227,
          "content": " If he really regretted it he would've told his wife when she came home from her trip. He blames his cheating on her too. \"Oh she was gone for so long for work and we had just fought.\" \n\nNTA",
          "id": 89,
          "comments": [
            {
              "score": 158,
              "content": "I mean thats generally how most marriages crumble. Lack of a sex life and feelings of being lonely are how most woman who cheat cheat (most people in general dont chrst, but when tjey do its not a clear cut story).\n\nI dont condone cheating in general, but he didnt blame it on his wife. He simply said what haplened and how it made him feel. He clearly said that it was wrong and he shouldnt have done it.\n\nWhether OP should tell or not is debatable imo. If should carefully consider the consequeences of not telling (what it will do to him emotionally), and the consequences of telling (destroying a family and being the person who instigated the destroying). Hard choice he has either way",
              "id": 90,
              "comments": [
                {
                  "score": 15,
                  "content": "How is it fair to consider what it would do to him emotionally when he cheated on her and neglected to tell her?\n\nIt would be fair for the wife to know (though I do think he needs to tell her and not the sibling) to be able to make the decision if she wants to stay with him or not. \n\nRegardless if it happened 4 years ago or yesterday, he took away her right to determine if this is something that she wants to continue.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 3,
                      "content": ">\tshould carefully consider the consequeences of not telling (what it will do to him emotionally)\n\nI think this is referring to the consequences on OP if he doesn’t tell (having to deal with the knowledge, pretending to SIL that nothing ever happened, etc etc). Not the consequences on the husband.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "It happens. Life is long as shit. Did he ever communicate with his wife or did he keep it bottled up? What if she gets sick and can't have sex for a couple months? More than 75% of men will leave their wife, if she gets sick or disabled.\n\nEdit : I misremembered. Men are seven times more likely to divorce their wives if she gets sick.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Is that a real statistic?",
                      "id": 94,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 126,
              "content": "I think if you truly regret it and never want to repeat your mistake, not telling your partner is the right thing to do.  The only reason people tell their partner is to alleviate their own guilt and then give the “decision” about the relationship to the cheated on partner.  It’s like “I did this, I fucked up really bad, I don’t want to feel guilty about it anymore so I’m going to hurt you really badly AND force you to decide the fate of our relationship”.  If he was a serial cheater then by all means let his wife know.  But I think this is hardcore not OPs business and it’s not his call to decide if he learned and grew from that mistake or not.  \n\nI also think that saying he “blamed” his wife is misrepresenting him.  You don’t know because we only have an explanation through OP, but there is a huge difference between saying “she was always gone and we fought, what do you expect?” Versus explaining the emotional and mental state he was in that led him to cheat: “she was always gone, I was so lonely, we barely talked except to fight, I felt totally depressed and worthless and I just wanted to feel alive and I let a friendship go too far.”  Those two attitudes are completely different, I just think it’s jumping to a really big conclusion to frame the info we have as him “blaming” his wife.",
              "id": 95,
              "comments": [
                {
                  "score": 21,
                  "content": "> I think if you truly regret it and never want to repeat your mistake, not telling your partner is the right thing to do.  The only reason people tell their partner is to alleviate their own guilt and then give the “decision” about the relationship to the cheated on partner.\n\nHave to strongly disagree with that, you seem to think giving the “decision” to their partner is some sort of selfish act but it’s really not. People have a right to make an informed decision about whether they want to stay in a relationship and whether you’ve been cheated on is clearly relevant information. Failing to give people that ability is not some great noble act, it comes purely from self interest.\n\n> his call to decide if he learned and grew from that mistake or not.\n\nYou’re right, it’s not OP’s call and it’s not the cheaters call, it’s their spouses. \n\nAnd the guy is a serial cheat, he’s cheated on a previous girlfriend FYI, not that that actually changes things really.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "The person who was cheated on ALWAYS deserves to make the decision. Telling the partner you cheated might be from guilt, but it’s not always from just guilt to pass on the blame for the relationship ending (ie yes I did this but you chose for it to end). It can be guilt and a way to show you’re sorry by being honest with the person in your life who deserves it the most. Not giving them the choice is selfish AF.\n\nI don’t know what the OP should do, but I do think the OP’s brother should still tell her. If they’re in a good place now, it might work out, but the person cheated on always deserves to be given that info and decision to make.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 96,
          "content": "Agree with YTA, brother made one mistake one time. Not as if he continued and it was a long term thing. To raise it now would not only make him pay dearly (not talking about money) for it, but also his wife and kid. I would give serious thought to the impact on people’s lives. No one is perfect (though many profess to be). Could there be some envy with a sibling having a good life?",
          "id": 98,
          "comments": [
            {
              "score": 43,
              "content": "Also agree and just to point out his brother probably told him this because he thought he was one of the few people he could trust to get this off his chest. I don't agree with cheating, but if he goes his whole life without telling her then that is his cross to bear in my opinion.\n\nFrom the perspective of what will happen if he does tell him I see more consequences for OP than he probably realizes. If he tells her and it blows up, the SIL will be out of his life. He may see her every now and then but for the most part she will distance herself from any connection to her ex. At least she might. You can't change who your family is but you can certainly do something to make your brother hate you and that is likely here.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "It's not one mistake. \n\nIt's a series of weak willed decisions that led to him cheating. Then lying & hiding it for years pretending that he did nothing wrong.\n\nDude's a scumbag.",
              "id": 100,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Seems more like ESH, the OP wasn't the one who cheated, nor does it seem like OP asked their brother to confess this. It's shitty that the brother chose to unburden himself onto OP about something most people feel pretty strongly about. It was the brother's screw up and he wanted to feel better at the expense of throwing OP into a moral dilemma. But given that OP doesnt seem super close to this family/has been distant a while I dont know that it's right for them to tell this secret not knowing what sort of fallout might occur.",
              "id": 101,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 73,
          "content": ">But here it seems to be a thing in the past, your brother has genuinely regretted it and improved his marriage.\n\nDid he though?  Sounds like one of the biggest issues was his wife was traveling too much and that issue solved itself.\n\nAnyway I generally disagree with your opinion, regret doesn't mean you get to decide for yourself whether you're forgiven.",
          "id": 102,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "He kept it to himself and faced literally zero consequences for betraying this woman and making her live a lie for years. Bet he's reaaaaaal regretful.\n\nApparently cheating is absolutely fine as long as you don't get found out. Great message to send to all relationships out there.",
          "id": 103,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "I’m going to respectfully disagree and say NTA. Your brother’s wife isn’t a family friend, she is FAMILY. If he didn’t want this upsetting his marriage, he shouldn’t have done it. Imho, it doesn’t matter if this has eaten the brother alive, his wife was cheated on and he never told her, and she deserves to know who she’s with and his shitty justification. He could have changed since his cheating days with ex-girlfriends and his incident while married, but he might not have, and he deserves to know who she’s in a relationship with. They need marriage counseling if they’re going to go forward.  \n\nPeople can call OP TA all they want for “betraying” his brother because he was confided in. However, doing so is making OP an accessory, which OP is not comfortable with at all. What happens if she finds out and they stay together? OP will just be known to the wife as the asshole that enabled her cheatin’ ass husband.",
          "id": 104,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "No she deserved to know her marriage is based on a lie, she’s going to find out sooner or later. He NEEDS to tell her, she needs to know. Cheaters don’t get special treatment I don’t care if you were lonely or “it’s better now” they still cheated and op needs to do the right thing",
          "id": 105,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14514,
      "content": "YTA - If you did this you would be doing it solely for your own sense of self-righteousness. Follow your brain. \n\nHe told you in confidence, he knows it was a mistake, and he is your brother\n\nYou may think she has a right to know, but she might not want to know - you just don’t know and sometimes ignorance really is bliss. Don’t turn her life upside down for your own purposes.",
      "id": 106,
      "comments": [
        {
          "score": 2900,
          "content": ">  and he is your brother\n\nAs much as I agree with everything you said the \"he is your brother\" part stings me. Being a family member doesn't make a difference in my opinion.",
          "id": 107,
          "comments": [
            {
              "score": 2095,
              "content": "Yes, it does. You’d destroy your relationship with your brother and potentially not see your niece/nephew as much anymore, over something that happened 1460 days ago?\n\nedit: ignorance is bliss?",
              "id": 108,
              "comments": [
                {
                  "score": 1084,
                  "content": "> over something that happened 1460 days ago?\n\nI personally don't believe cheating has a cool down.",
                  "id": 109,
                  "comments": [
                    {
                      "score": 1520,
                      "content": "No, time doesn’t make it okay—nothing does.\nBut time does show that he is not a serial cheater, that he did regret and feel guilty for what he did, and that they rebuilt the closeness in their marriage. That’s the bigger thing.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 149,
                      "content": "Even crimes have statutes of limitations",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "If my wife banged some random dude years ago I wouldn’t want to know as it would ruin the nice life we have together now. Not his circus, not his monkeys, leave them be.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "she WILL lose that child from her life.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "If my sibling cheated on their spouse, know what? \n\nThey didn't cheat on me. \n\nGetting irate over it is just being offended by proxy. Looking for something to feel self-righteous about. /u/nowaternoflower is spot on: It's the self-righteousness that makes you act, not the honor of *your brother's spouse*.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "u/throwdowntown69 throws down over no cool down.",
                      "id": 115,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "Thats because you're an absolutist without perspective.  Shit happens.  Stop pretending relationships are perfect.",
                      "id": 116,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "It does if you dont do it again. 4 years without cheating is better than 6 months without cheating. It shows that you really do have awareness that you did something wrong.\n\nI hate cheating and think partners should know. But life is complicated, and moral decisions arent always cut and dried. In most cases I would say tell her. In this one, I would say that it would be reopening a relationship conflict which is currently pretty much resolved if OP told SIL. It was literally a one-time cheat (if bro is telling the truth, but we have no reason to assume he isn't). Bro could have hidden it forever but chose to disclose to OP. I think he displays genuine remorse. He isn't likely to cheat again. Why destroy a family over something that seems to be resolved?",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "> I personally don't believe cheating has a cool down\n\nYou also dont speak for all people. Most people just move on with their lives. I hate this idea that cheating is the worst thing that can happen to somebody. \n\nIt's a sign your relationship sucks and you should break up, or fix it. Not the end of the fucking world that you can never mentally recover from.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "[removed]",
                      "id": 119,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "They hadn't seen each other in 6 years.  I don't think they were all that close to begin with.",
                  "id": 120,
                  "comments": [
                    {
                      "score": 7,
                      "content": "So clearly they are working in rebuilding. Why go back to zero. OP can build a relationship with the brother and then convince the brother to tell the wife",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 38,
                  "content": "[deleted]",
                  "id": 122,
                  "comments": [
                    {
                      "score": 105,
                      "content": "Taking this and running with it. He hasn't seen his brother in 5 - 6 years.. so it's probably none of his business meddling in his brothers marriage.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": ">You’d destroy your relationship with your brother\n\nYou pretend to know their relationship? My brother's a piece of shit, and he would be the last person who I would consider in a situation like this.",
                  "id": 124,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 139,
              "content": "Um, really? She's not supporting him in an ongoing cheat, he fucked up, he recognizes that, and it's over. And family is and should be a big factor. Give him holy hell, make him know it's not okay, but you're his sister first.",
              "id": 125,
              "comments": [
                {
                  "score": 63,
                  "content": "He is also a husband and family to his wife. Not only that but he chose his wife he wanted her and no one else than her to go with him through the rest of his life. \n\nFamily on the other hand is not a choice it's a random coincidence that has the positive side effects of having a higher tolerance against negative things and lower entry level for asking someone for help.\n\nIf family is and should be a big factor then marriage should be as well, maybe even more so because that's where your responsibilityand honesty has a longer sustaining impact.",
                  "id": 126,
                  "comments": [
                    {
                      "score": 55,
                      "content": ">If family is and should be a big factor then marriage should be as well, maybe even more so because that's where your responsibilityand honesty has a longer sustaining impact.\n\nTherefore OP should nuke the brother's family bonds.",
                      "id": 127,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "> Not only that but he chose his wife he wanted her and no one else than her to go with him through the rest of his life \n\n&#x200B;\n\nbut not really tho",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 52,
                  "content": ">Couple days ago me and my brother we’re hanging out late night doing regular guy things drinking, watching sports, etc.\n\nOP is a guy.",
                  "id": 129,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Why does family matter?",
                  "id": 130,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Except it does. Choosing to ruin your relationship with a sibling is leagues different than betraying or otherwise alienating yourself from a casual friend. Talk about potential lifelong consequences.",
              "id": 131,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "It really does. While I know its sometimes important to dump family, you are causing way more of a rift in family than if it was just some friend.\n\nIf a college buddy cheated on his wife and you want to cut him out, go ahead, because if you so choose you never have to see him again. This isn't possible with your brother, you will see him at family events and get togethers the rest of your life. To truly cut him out of yoru life you would have to have your entire family make a choice between you, which is a shitty position to put them in.\n\nI don't how people can possibly say its no different... it clearly is.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "How does family not matter?  Do you not have family?  What if your mom went out of her way to tell your friend something you confided in her about them?  Does it not matter that she is your mom?  Did you not put more trust in her because she’s family?",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 376,
          "content": "> If you did this you would be doing it solely for your own sense of self-righteousness \n\nTHIS so much.",
          "id": 134,
          "comments": [
            {
              "score": 39,
              "content": "[deleted]",
              "id": 135,
              "comments": [
                {
                  "score": 14,
                  "content": "To me, If it's currently happening then the person should be told immediately. However if it's a mistake that long ago in the past I still think they have a right to know but it shouldn't come from OP or anyone else but directly from OP's brother as an honest confession. The most OP should do is try to convince the brother to confess to his wife otherwise, he'd just be adding more pain to everyone for an issue that has no currently existing negative impact. \n\nI think cheating that's currently happening needs to be headed off because telling allows the partner being cheated on to brace themselves for conflict and pain rather than facing it all at once if they find out for themselves once the situation blows up.\n\nPast cheating on the other hand, no longer has that potential. Pain and conflict can only come from the people who know about it. There's no longer a timer running other than their own mortality and if they've been living their lives happily for the past few years since it happened, there's no reason to put a stop to that because of a past mistake. It's up to OP's brother to figure out when would be the best time to confess where it causes the least harm and maybe that won't be for a while or maybe or will never come. Whatever the brother decides, OP telling the wife is the worst way for her to find out.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I don't know if you're married with children or not. People shouldn't interfere with other people's marriages. If the brother were cheating regularly that would be very different. This would definitely ruin the relationship between the brothers & their immediate family. Very likely destroy the marriage for a one time affair which took place years ago.  The brother obviously thought he could trust his brother as someone to confide in which was wrong. He needs to forget about this & focus on his own relationships.",
                  "id": 137,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Exactly... It’s a lot of single people giving marriage advice on here.\n\nWhat got me was his statement talking about how he would feel bad for the kids if his decisions tore their family apart..... uhhhh, mind your fucking business and that won’t be a problem. That’s s sure way to ruin your relationship with everyone involved.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I guess my main argument is, I'd like to know. In my case it wouldn't necessarily destroy marriage, that would be a big leap to make from just my partner cheating years ago.\n\nI'm absolutely not suggesting they break their brothers trust and go behind their back and tell the wife. Talk with the brother, give him time. It would definitely be hard.\n\nThe brother clearly regrets it and after all these years is still thinking about it. He seems like a good person who made a mistake years ago.\n\nTreat others like you'd like to be treated. I'm not trying to act like a saint, but I would like someone to tell me if my partner cheated. Likewise, believe it or not, I think my partner deserves to know if I cheated on them. From me or someone else if I didn't have the courage to do it.",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "The brother put that on him. Idk where I stand on this but he doesn't deserve to live with the guilt just bc his bro is an ass hole. If he found out accidentally, like heard him on the phone telling the side girl that it was one time and it was a mistake and not to contact him bc he loves his wife etc... that's one thing and should be kept secret. But he intentionally unburdened himself on his brother at his expense and I really wouldn't blame him for burning him on that. Really selfish behavior, points towards future cheating/ manipulating.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 158,
          "content": ">he knows it was a mistake\n\nPart of make a mistake is not only acknowledge it, is to take responsibility for it and to not make it again, take responsibility would be talk to his wife about it, he just hid it under the rug for his own selfishness.",
          "id": 141,
          "comments": [
            {
              "score": 65,
              "content": "Do you think it's purely selfish?\n\nWould it be in the kid's best interest if the marriage blew up?",
              "id": 142,
              "comments": [
                {
                  "score": 84,
                  "content": "It seems he did not have a kid the moment he cheated on his wife, the reason he did no told her the truth after cheat on her was for his own safety.   \nYou can say \"telling her that would her hurt her\" yes, but using her feelings as an excuse after betrayed her trust is ridiculous,",
                  "id": 143,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I think to unburden yourself on your spouse clears your conscience but then places all the burden on them. I personally believe you should live with your guilt so not to do it again. You should suffer, that’s part of the deal.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 122,
          "content": "Agreed, OP wants to tell the wife because of his own belief that cheating is wrong, not because he's trying to help her. \n\nOP doesn't want this knowledge weighing on his conscience, and I don't blame him. Now he's burdened with this secret, and will have to think about it every time he's with his couple. But that doesn't mean he has to burden the wife with it either, just to make himself feel better. He needs to get his brother to fix this and not get involved in their marriage. Perhaps if his brother agreed to go to marriage counseling, or private therapy to work out why he cheated?\n\nIf OP tells this secret, YTA",
          "id": 145,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "Why do you assume she wouldn't want to know?",
          "id": 146,
          "comments": [
            {
              "score": 158,
              "content": "[deleted]",
              "id": 147,
              "comments": [
                {
                  "score": 77,
                  "content": "I’m there with you. Normally, in almost all circumstances, I’d want to know. But in this case, I wouldn’t want to know. It would absolutely ruin all trust, and given the strength of the marriage at that point, I would want to work it out. It would just make things unnecessarily more difficult, since it’s something he’s already moved on from.",
                  "id": 148,
                  "comments": [
                    {
                      "score": 13,
                      "content": "It's easy to move on from shitty actions when you hide them from the person.",
                      "id": 149,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 49,
          "content": "I disagree. Its not like he knew from the beginning and only wants to tell her because of an argument or something. He wanted to tell her from the MOMENT he knew.\n\nAnd you cant make the assumption that the wife doesnt want to know because no one asked her opinion. Ignorance may be bliss, but in this context it's an 'out' for people with something to hide. Ignorance is only bliss if the person CHOOSES to be ignorant, she didnt make that choice. OP and his brother made it for her.",
          "id": 150,
          "comments": [
            {
              "score": 11,
              "content": ">  Ignorance is only bliss if the person CHOOSES to be ignorant\n\nWrong. If you know something, you're no longer ignorant to it, you can no longer be blissfully unaware. \n\nIF it isn't a big deal to you, then yeah you can somewhat choose to ignore it.\nBut if it is a big deal for you, you don't get to choose to ignore it. If you try ignore something that is a big deal for you, it will come back to haunt you eventually. You also don't choose whether that something is a big deal for you, it just is, or is not.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "If I were in the wife's situation, I honestly don't think I would want to know. It's been years. If we spent all that time rebuilding our relationship, I would just want to stay ignorant. The only exception would be if OP were to find out it happened multiple times or that he has cheated since they fixed their relationship.\n\nIt really depends on the wife, though. Some women would want to know regardless of how long it has been.",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "YTA. Not your marriage, not your business. You really wanna mess up a family just so you can feel better? \nIf you need to confess and get it off your chest, maybe confide in a priest, therapist or such like?",
          "id": 153,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I think you’re right and if it was an active thing then of course blow the lid off but I feel like it’s out of his place to say anything now especially being it’s not active. We all have done stuff we regret and wish we could take back and as long as the lesson was learned no need to cause pain and grief although it’s shitty for that brother to lay that on you when it’s his cross to bear.",
          "id": 154,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8742,
      "content": "YTA - no no no - drop this and back as far away as possible - they have a kid now, you’d risk destroying their marriage for their child for something that happened 4 years ago and is clearly over.  No. Do not do this.\n\nEdit: thank you for the gold! I’m sincere when I say that I would really think twice about messing up a child’s life, thank you to whoever agreed with me!",
      "id": 155,
      "comments": [
        {
          "score": 1811,
          "content": "For real. Leave this alone.",
          "id": 156,
          "comments": [
            {
              "score": 381,
              "content": "I can't believe people are debating this in the threads above. \n\nYour brother told you a huge secret in strict confidence. You are not justified in breaking that confidence, and potentially ruining a family, just because your feathers got ruffled. Break off contact if you want, or give your brother all kinds of shit about it, but telling the wife would 100% be an asshole move. \n\nI mean - yes, the real asshole here is the brother. But OP is not some victim seeking to right wrongs. There's a time when it is ok to butt into someone else's marriage but this is not that time.",
              "id": 157,
              "comments": [
                {
                  "score": 24,
                  "content": "Even though I agree that it would definitely ruin their lives and be a huge asshole move, your arguments are just stupid.\n\nBreaking confidence? What about when the guy cheated on his wife? Is that not breaking her confidence? Ignorance is a bliss but at the end of the day some people prefer to know rather than to be lied to for the rest of their life.\n\nIf the brother didn't do shit, then there wouldn't be shit to tell about. It would be an asshole move but the bigger asshole will always be the cheater. He is the one that ruined it all, not the snitch. YTA for the question in the thread but the brother is and always will be the bigger asshole regardless if OP says anything. I'd never advise fucking up that shit and causing pain to the innocdnt kid but let's not pretend the brother is ok because it's been 4 years and he hasn't cheated yet. The proper thing would be if he cheats again then tell her, at that point he would have proven that he is a serial cheater and there would be enough of a reason for the wifr to know.",
                  "id": 158,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": ">I can't believe people are debating this in the threads above.\n\nreddit is absurdly self righteous at times, especially in this sub. sees things in black and white with no context or subtlety. some of the people on here, i wonder how they exist/live in the real world.\n\nobviously not defending fucking cheating on your spouse, ridiculous that i even have to say that. just come on people, there is more to this situation than \"bad man cheat\"",
                  "id": 159,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Would you report a murderer to the police if they murdered someone 4 years ago but then said they regretted it? Or would you say it's \"none of your business\"? Fuck you all.",
                  "id": 160,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "[deleted]",
                  "id": 161,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 976,
          "content": "And on top of that he hasn't seen his brother in 5-6 years, he has no business stirring up hurt unless he just wants to, which it kinda reads like that.\n\nEdit:. And get this!  He tried drugs and doesn't want his mom to find out.  What a hypocrite!",
          "id": 162,
          "comments": [
            {
              "score": 469,
              "content": "I had the same thought. OP calls the sister in law a close friend but hasn't spoken to the brother in 6 years? How close could they possibly be in this situation.",
              "id": 163,
              "comments": [
                {
                  "score": 105,
                  "content": "I took close family friend to mean that SIL is one of his childhood friends. You can consider someone you've been friends with long enough to be close even if you haven't met them in a long time.",
                  "id": 164,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Exactly.  Huge asshole.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 248,
          "content": "This a million times. The huge asshole part for me is around the fact that a kid is involved. Coming clean could break up the home for this kid just so OP can clear his conscience. It happened once 4 years ago and his brother isn’t planning to cheat more. Leave it alone. What an asshole thing to do. \n\nYTA.",
          "id": 166,
          "comments": [
            {
              "score": 17,
              "content": "Yeah that's what sticks out the most to me. You want to stick your nose into somewhere it doesn't belong for your own satisfaction even though a kid is involved. You are about to fuck that kids life up by opening your mouth. Seriously, keep it shut and move on.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Disagree this exact thing happened to me and I found out after years and a kid together. I would be furious if someone new my so had cheated on me \"just once\" and allowed me to make a uninformed decision to have a kid with him and stay. I'll be gone in a  year and she deserves a chance to decided if she will to.",
              "id": 168,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4551,
      "content": "ESH- not your place to say in this situation. Urge him to come clean but as it happened four years ago sticking your nose in would be detrimental. Families are complicated and it seems like you have a good relationship, try to keep it that way",
      "id": 169,
      "comments": [
        {
          "score": 823,
          "content": " I don't think it's his place to tell his sister in law either. I think the brother sucks for cheating and now it sucks that OP knows this truth, but I don't think it's his place to say something at this point. I agree that he should encourage his brother to confess to his wife, but without giving him a \"you do it or I will\" ultimatum. Really tough situation and I feel sad for OP and his sister in law. :(",
          "id": 170,
          "comments": [
            {
              "score": 306,
              "content": "Honest question, should OP’s brother confess? I feel like he would be doing so purely to clear his own conscience. If he’s truly committed to being faithful going forward, he is only going to cause his family pain by confessing. In my mind, his punishment for cheating should be living the rest of his life with the knowledge that he betrayed his life partner. And never having the catharsis of confessing, hashing it out with her and potentially getting her forgiveness.",
              "id": 171,
              "comments": [
                {
                  "score": 200,
                  "content": "[deleted]",
                  "id": 172,
                  "comments": [
                    {
                      "score": 100,
                      "content": "From who's perspective though? There are plenty of people who'd view unknowingly being cheated on as worse than finding out the truth and actually being able to make a decision with the facts about what they wanted. Who's to say that he won't cheat again, or that the wife won't eventually find out and immediately leave him having wasted even more time in this relationship?",
                      "id": 173,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 60,
                  "content": "Honestly, I don't know if he should or not. I'm on the fence about it.",
                  "id": 174,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "> Honest question, should OP’s brother confess? \n\n\nThere's not really a right or wrong answer.\n\nOne of the things that makes looking at other peoples' relationships so hard is that there's no absolute right or wrong thing. This isn't just someone copying off a test in 4th grade. These are majorly complicated situations with too many circumstances for anyone on the outside to judge.\n\nHe might need to confess just to stop feeling guilty, and like everyone else is saying, he risks destroying his entire family just so he can feel better about himself and sleep at night.\n\nBut on the flip side... maybe the wife would be understanding if she knew. Most Redditors' first response to any type of cheating is to launch a scorched earth campaign where the victim needs to start a new life under a new name, but a lot of people work through it no differently than a drug habit or gambling problems or some other major fuck up. \n\nAnd on the other flip side of that... maybe the wife cheated once while doing all that traveling too and she's keeping it to herself. \n\nNone of us are really in any position to judge whether the brother does or doesn't confess. But we can pretty much all agree that OP needs to keep his nose out of this. Telling the SIL about this does nothing but appease his own sense of self-righteousness.",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "No. If he is not cheating anymore the only benefit of confessing is to clear his conscience, like you said. That's a selfish reason to confess and it would inflict pain on the woman he loves. My wife and I agreed at the start that if we ever made a bad decision like that we just wouldn't say anything to spare the other person the pain. Ongoing cheating probably points to an unresolved problem in the marriage, but a one-time affair could be for any reason and ultimately doesn't matter.",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This 100%. If I knew someone in a similar position as OPs brother, I’d tell them to never speak of it again and take it to his grave",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Lol he/she hasn't talked to his/her brother in 5-6 years when do you think the last time was they talked to his wife? They admit they were anti-drug most of their life and coming clean was hard so they clearly have a strict moral code. The only reason they want to tell her is because it's burdening OP and they want to get it off their chest. \n\n It has nothing to do with concern for the SIL.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "I like this answer best, he should talk to his bro and explain why it’s not a good idea to never come clean, sure she deserves to know but such a long time has passed OP would just be an accomplice in keeping secrets, if she were to learn the truth like hell she would believe the brother just learned this",
          "id": 179,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I agree with this. It would be an ideal situation if OP talked with the brother and encouraged him to come clean himself. That would go over better than being “caught.”",
          "id": 180,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2910,
      "content": "ESH - your brother is an arsehole for cheating but it is none of your business.  \n\nI might have a different view if he had an ongoing and current affair.",
      "id": 181,
      "comments": [
        {
          "score": 909,
          "content": ">I might have a different view if he had an ongoing and current affair.\n\nThis seems to be the part that everyone is missing.  It happened once, and hasn't happened again in 4 years.  I hate cheating (it happened to me), and I despise lying, but  let 4 year old sleeping dogs lie.  ESH, and stay out of his business OP.\n\nI have to say though this seems like a weird troll post to me.  From the title (\"close family friend\", isn't this your SIL?) to the \"I try not to judge people on their actions\"(what else do you judge people on?) bit, it all reads oddly.",
          "id": 182,
          "comments": [
            {
              "score": 199,
              "content": "So, how long does it take until we let cheaters get away with it? 6 months? 2 weeks? Its bizarre that people will let cheaters keep their secret if they managed to do it for a certain period of time.",
              "id": 183,
              "comments": [
                {
                  "score": 142,
                  "content": ">Its bizarre that people will let cheaters keep their secret if they managed to do it for a certain period of time.\n\nBecause you need to take into account if it does \\*anything\\* for the spouse.  In this, highly fishy story, it sounds like this would do absolutely nothing but ruin a marriage if the OP himself tells her.  On the other hand if the husband tells the wife it would probably be beneficial, but that isn't the question.  The question is about the OP telling, which really will not help anyone.",
                  "id": 184,
                  "comments": [
                    {
                      "score": 25,
                      "content": "I would argue that the wife is entitled to the truth. Otherwise even on a 1 day ago cheat you could be arguing that ignorance is a bliss, which I don't think is a fair position.",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 69,
                  "content": "It's about how long they didn't do it, if they are reformed then punishing them serves no purpose besides '''justice'''",
                  "id": 186,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "I’ve been cheated on and no one told me, found out on my own eventually and divorced him. I’m just putting out there, if I ever get cheated on again, I’d want to know regardless of how much time has passed. Staying with a cheater is my choice to make.",
                  "id": 187,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 48,
              "content": "He did the same thing to a previous GF...",
              "id": 188,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "To be fair he had sex with her once, but he was carrying on an affair for longer than that. You don’t go from honest-to-god friends to banging a married man at the drop of a hat.",
              "id": 189,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "OP said he has cheated on others in the past. So it's not a one time thing, he's a serial cheater.",
              "id": 190,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Agreed! Could easily be a troll tbh",
              "id": 191,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "The phrase \"did the sex\" suggests to me that OP is not old enough for any of this to have actually happened.",
              "id": 192,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1877,
      "content": "WTF is up with this title? Your brother’s wife *is family*. Not a close family friend. She’s your sister-in-law.\n\n>I know for sure this would probably destroy their marriage and there would be a fight for the kid.\n\nTheir kid. Your niece and nephew.\n\nThere’s a lot of distancing in your language, but the conflict you feel is palpable. Go back to your brother and tell him you don’t feel comfortable keeping his secret. Urge him to tell his wife.\n\nThat said, the truth is some people may not want to know and if it comes out you pushed for him to tell her the blowback may be your sister-in-law blames you for ruining the facade.\n\nINFO\n\nDo you know her feelings on cheating? Would she prefer “ignorance is bliss” over “I’d definitely want to know”?",
      "id": 193,
      "comments": [
        {
          "score": 599,
          "content": "I think it's odd he referred to her as a \"close family friend\" instead of her actual role as SIL. That says something about OP and I have an idea of what it means, but I'm gonna let someone else put it out there in the open.",
          "id": 194,
          "comments": [
            {
              "score": 372,
              "content": "That OP may have some feelings for his SIL and is hoping to swoop in and be her saviour when shit hits the fan? Did I miss anything?",
              "id": 195,
              "comments": [
                {
                  "score": 230,
                  "content": "Re-reading it in this context totally fits. I really hope it's actually that he's just estranged from his family instead.\n\nEdit: I've been thinking a bit. What if SIL was his friend who he had a crush on and he resents his brother because she fell for him instead?",
                  "id": 196,
                  "comments": [
                    {
                      "score": 100,
                      "content": "[deleted]",
                      "id": 197,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "The leaps in logic here is astonishing.",
                      "id": 198,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "I read it as he was just friends with her and she happened to marry his brother. He probably knew her as a family friend before she was his SIL.",
                      "id": 199,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 105,
                  "content": "LOL nope you got it. I just thought it was weird how he described her as a close friend vs a SIL and that was my first thought on why it struck me as odd.",
                  "id": 200,
                  "comments": [
                    {
                      "score": 132,
                      "content": "[deleted]",
                      "id": 201,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "Daaaaaaaaaamn, I didn’t even catch that",
                      "id": 202,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I don’t think that’s why. I think it’s because he’s not close with his brother and so sees his SIL more in the context of how he knew her growing up. He says he hadn’t seen his brother in many years and is considering ratting him out to his own wife, so clearly they are not close at all.",
                      "id": 203,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "The plot thickens",
                  "id": 204,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Ohhhhh shoot, this makes so much sense. All the more reason for him to stay out of it.",
                  "id": 205,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "100% on the button here.",
                  "id": 206,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "goddamn imagine what a clusterfuck that would be if that was the case.",
                  "id": 207,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 61,
              "content": "Also how close if he hasn't seen his brother in 5-6 years?",
              "id": 208,
              "comments": [
                {
                  "score": 60,
                  "content": "Exactly. He puts her into a different category. He doesn't put her into the SIL category, but he hasn't seen his brother in years. Why would he call his SIL a close friend?",
                  "id": 209,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Thats a bingo",
                  "id": 210,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "Well now I just want you to put it out in the open and hear your theory",
              "id": 211,
              "comments": [
                {
                  "score": 5,
                  "content": "It's in the replies to him now.",
                  "id": 212,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I think saying \"did the sex\" says a lot about op as well",
              "id": 213,
              "comments": [
                {
                  "score": 4,
                  "content": "Agreed.",
                  "id": 214,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "am stupid, please clarify what you mean",
              "id": 215,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Wait now I want to know what the theory is!?",
              "id": 216,
              "comments": [
                {
                  "score": 6,
                  "content": "I think it's within this reply. Seems like he might have the feels for SIL",
                  "id": 217,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "That this is all bs made up nonsense?",
              "id": 218,
              "comments": [
                {
                  "score": 8,
                  "content": "Oh, no... I mean, it could be since it sometimes seems like people make crap up and that does sound conflicting to me, but I was leaning more toward OP feels like he has a better connection to SIL than he really does. Maybe he has some unrequited feelings that are surfacing...",
                  "id": 219,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "It's even weirder that OP call his SIL  close family friend, while he haven't talk to his brother in 5-6 years, from what I understand",
              "id": 220,
              "comments": [
                {
                  "score": 3,
                  "content": "He posted a reason as to why he said it in his OP. I would find it odd that someone I don't talk to or see often came out and told me my spouse cheated 4 years ago. It would build a lot of mistrust in my relationship, but come from such an almost insignificant place.",
                  "id": 221,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "op's edit -  \n\nEdit: I’m referring SIL as close family friend because my family and her family have known each since elementary school days and thus are Very close lol. I thought this iteration would make the relationship sound stronger than just SIL, but it looks like I was wrong.",
              "id": 222,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "It's also weird that he refers to her as a \"close friend\" but he hasn't even seen his brother in almost 6 years...",
              "id": 223,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Well this is also the first time he's seen his brother in 5-6 years. I couldn't even imagine. I see my siblings multiple times a week and have a group chat we talk in daily. A weird dynamic going on there",
          "id": 224,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Not sure if you saw the new edit. He reffers to her as close family friend because their families are close for a long time, and OP thinks that speaks more than calling her just SIL.",
          "id": 225,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Yeah honestly I read his phrasing here and think OP has some feelings for his SIL that may be driving this impulse.",
          "id": 226,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Yea I was confused as fuck reading through the post because of the language used. It’s incredibly obvious OP has some kind of attraction to his brothers wife that is driving this. Big yikes.",
          "id": 227,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1189,
      "content": "Would be YTA. stay the hell out of this, no good can come from it.",
      "id": 228,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1149,
      "content": "Ywbta - not your marriage, not your business.\n\nYou have no right to potentially destroy a marriage, regardless of how you feel.\nPlus... Its your Brother. You don't do that to family.\n\nEdit: Thankyou for the platinum kind sir/madam.",
      "id": 229,
      "comments": [
        {
          "score": 395,
          "content": "Exactly. I'm surprised by the number of folks that are ok with nuking someone else's family for their own self-righteousness. This is not the OPs place, stay in your lane.",
          "id": 230,
          "comments": [
            {
              "score": 85,
              "content": ">nuking someone else's family \n\nCheating nukes familes, not sharing of the truth.",
              "id": 231,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "The guy risked nuking his own family the second he cheated dude",
              "id": 232,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 123,
          "content": "The only reason it would be destroyed is because the brother cheated and lied for 4 years.",
          "id": 233,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 100,
          "content": "‘It’s your brother. You don’t do that to family.’ I hate this reasoning. This is why family of police members will get off the hook so easily or why nepotism exists. They don’t get special privileges just because they are related to you. If you would tell a friend’s wife, you should tell your brother’s wife.",
          "id": 234,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 59,
          "content": "He destroyed his own family. That’s his wife, you don’t cheat on your wife. She’s family too and deserves to know",
          "id": 235,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "So then no one should tell you if your partner has cheated on you?",
          "id": 236,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "The husband destroyed the marriage by cheating.",
          "id": 237,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1032,
      "content": "It’s amazing the difference in tone around here when a man cheats vs a woman.  Reddit you never fail.",
      "id": 238,
      "comments": [
        {
          "score": 673,
          "content": "Yeah, I'd love to see the responses to a post where a lady confesses to her sister she fucked her gym buddy a few years ago because her husband was working too much and she was lonely but now they have a kid and are happy so nbd.",
          "id": 239,
          "comments": [
            {
              "score": 429,
              "content": "This thread makes a little more sense now.",
              "id": 240,
              "comments": [
                {
                  "score": 39,
                  "content": "True",
                  "id": 241,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Holy fuck.",
                  "id": 242,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 52,
              "content": "Not quite the same, but [this post](https://reddit.com/r/AmItheAsshole/comments/chb37s/aita_for_kicking_out_my_brother_who_our_parents/) should serve as an example.  I am just dumbfounded by a lot people in that post.",
              "id": 243,
              "comments": [
                {
                  "score": 29,
                  "content": "I don't think they are in anyway similar. The op there cheated once, before he was even with his ex-fiance.",
                  "id": 244,
                  "comments": [
                    {
                      "score": 42,
                      "content": "It's not supposed to be similar. It's what a judgment looks like against a female who cheated on someone who isn't even in the picture vs a male who cheated on his own wife. The extreme difference in relationship and judgment is what's supposed to be  displayed here. \n\nEdit, context",
                      "id": 245,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "They cheated while in a diff relationship while here they cheated while in the same relationship. In that post the brother didnt come out with a secret that no one knew.",
                  "id": 246,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "How? It was a previous relationship and not on the current one. That has literally no similarities other than someone cheated in both...",
                  "id": 247,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Fuck. You are right.  I miss read it.  I actually feel like an idiot now because it was with a different person.  The comments make a lot more sense now.  Not sure how I missed that detail.  I was on the conclusion it was her current bo.  I believe everyone deserves a second chance.",
                      "id": 248,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 29,
              "content": "There was a post in this sub not long ago about a very similar situation with all genders reversed. Little brother let it slip that big sister had cheated on a DIFFERENT person in a PREVIOUS, pretty sure high school, relationship years ago - assuming brother in law knew. Brother in law didn't know, and broke things off. \n\nEveryone was telling the brother it's not his fault that his sister withheld this information...",
              "id": 249,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 427,
          "content": "Wow, that explains it. I was shocked by the top YTA posts.",
          "id": 250,
          "comments": [
            {
              "score": 320,
              "content": "I would never forgive someone who knew my partner had cheated on me and saw fit not to tell me--good intentions or not.",
              "id": 251,
              "comments": [
                {
                  "score": 105,
                  "content": "Yeah one of my worst regrets is not telling a friend I had heard a rumor his girlfriend cheated, I confronted her, told her to talk to him, I thought she did and all was well, but turns out she didn't and I was mistaken.  They had talked about other things, but not the cheating. \n\nWe had a good convo about it and I'm grateful we're still friends. I cut her out of my life completely.\n\nGoing forward I will always tell.",
                  "id": 252,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "Agreed. These 10k redditors who want to help hide cheating are assholes.",
                  "id": 253,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "THANK YOU",
                  "id": 254,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "Right? Like not even an everyone sucks? OPs brother is completely absolved of all fault, just because it's been 4 years since it happened? That's horse shit.",
              "id": 255,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "bloody same. cheating is cheating, whether it was an hour ago or four years ago. she deserves to know in all cases.",
              "id": 256,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Reddit fucking hates cheaters (I mean everyone does but still). I assumed that the top comments would be calling for the execution of the brother",
              "id": 257,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 372,
          "content": "Remember the post where a woman cheated on her ex 9 years ago and everyone said her current bf had a right to know? I'm totally surprised by this thread but I guess I shouldn't be.",
          "id": 258,
          "comments": [
            {
              "score": 241,
              "content": "[deleted]",
              "id": 259,
              "comments": [
                {
                  "score": 52,
                  "content": "[deleted]",
                  "id": 260,
                  "comments": [
                    {
                      "score": 23,
                      "content": "[deleted]",
                      "id": 261,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 34,
              "content": "There was also that post where the guy got a lap dance at a bachelor party after promising his fiancé that he wouldn’t, and everyone was saying he was the best fiancé ever because he was brave enough to admit it to her.",
              "id": 262,
              "comments": [
                {
                  "score": 22,
                  "content": "That bar couldn't be any lower",
                  "id": 263,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 33,
              "content": "Yeah it's upsetting, but sadly not surprising.",
              "id": 264,
              "comments": [
                {
                  "score": 15,
                  "content": "It's not just reddit unfortunately, it's most of the world in my experience.",
                  "id": 265,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Very true.",
                      "id": 266,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Right? There was a post a while back where all these reddit dudes were backing up some agro male that wanted to prevent his wife from attending a funeral of a good friend that she had fucked like a decade ago. So messed up. I don't think it is OPs place to get involved in this at all, but the advice on here is so slanted depending on whether it comes from a man vs women.",
              "id": 267,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 241,
          "content": "No shit. The fucking mental gymnastics people do here to justify men cheating. Imagine if it was a woman who cheated and a child was involved. Guarantee every response would be NTA because \"what if the kid isn't his\". But because it just involves a lowly woman, fuck her.",
          "id": 268,
          "comments": [
            {
              "score": 39,
              "content": "I know, right? Let us count the ways:\n\n* \"Telling the truth = wrecking the marriage\" as if cheating doesn't wreck marriages\n\n* \"Not your business\" as if reporting abuse can only be done by the perpetrator of abuse\n\n* \"He's penitent\" as if they think this SERIAL cheater is going to be mr. good guy all of a sudden\n\n* \"It's in the past\" as if abuse doesn't matter if it happened X years ago.\n\nAll the EXACT same excuses used to excuse the pedophiles in the catholic church.",
              "id": 269,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 169,
          "content": "Don’t forget all the very young jaded men that cruise through this sub. I saw something similar on a different thread last night and somebody straight up called a girl a whore. I look at their profile and surprise- he graduated high school in 2018 and his girlfriend of two years will be living abroad for the next three years.",
          "id": 270,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 157,
          "content": "Everyone on Reddit wants a quick excuse to call a woman a whore or bitch and get karma for it because of the entire reddit population. The bar is very low. Mgtow is everywhere",
          "id": 271,
          "comments": [
            {
              "score": 22,
              "content": "It's more that they should be calling him these names too. The forgiveness is what's messed up, cheaters suck and should be insulted.",
              "id": 272,
              "comments": [
                {
                  "score": 7,
                  "content": "[deleted]",
                  "id": 273,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 105,
          "content": " If a woman cheated she'd be painted out as much worse than this guy.\n\n Here these comments are essentially telling this woman to love someone blindly, and waste more years of her life loving someone without knowing this horrible truth about her marriage.\n\n \"The lady's gotta suck it up! Think about the kid.\"",
          "id": 274,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 90,
          "content": "I can not believe the amount of people saying it’s okay because it was in the past. Holy fucking shit. If my friends were like this, I’d be fucking pissed. Cheating is cheating and should always be made aware of.\n\nIf I’ve been cheated on 20 years ago, I don’t care the situation, I deserve to know. \n\nThis is sickening to me.",
          "id": 275,
          "comments": [
            {
              "score": 23,
              "content": "[deleted]",
              "id": 276,
              "comments": [
                {
                  "score": 16,
                  "content": "\"people can change, he made a mistake.\"\n\nPeople actually we're defending Brock Turner with that here, so tbh you're not far off at all.",
                  "id": 277,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 79,
          "content": "Fucking thank you! Reddit is the only place I've heard \"once a cheater always a cheater\", and yet look at all the responses.",
          "id": 278,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": "I thought I was taking fucking crazy pills with these responses. Now it all makes sense.",
          "id": 279,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 796,
      "content": "This is why this sub exists\n\nLet's break this down a bit on one hand you have\n\nNot telling his wife which might end with a happy marriage and no divorce or he might just do it again because he knows he got away with it once but the way you said it makes it look like he was super guilty about it which I think is not very likely to happen again.\n\nOn the other hand\n\nYou tell his wife they get divorced you ruined your brothers marriage(on the surface) and your relationship with him and possibly the kids childhood and future but his wife would escape a cheating liar\n\nIn my opinion YTA because it's been 4 years it's mostly in the past and your brother trusts you a lot\nWhat you should do is encourage him to tell her the truth and sprint away from this problem",
      "id": 280,
      "comments": [
        {
          "score": 150,
          "content": "I agree. His wife deserves to know, but at this point the situation is far too messy and complicated and OP doesn't need to get in the middle. Also, the brother is certainly TA for placing this burden of knowledge on OP. \n\nOP should urge their brother to come clean, or at least to see a therapist about this (ideally couples counseling). Aside from that, they shouldn't get involved any further.",
          "id": 281,
          "comments": [
            {
              "score": 20,
              "content": "So she doesn't deserve to know then?",
              "id": 282,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Op didn't ruin anything. That's like saying reporting a robbery is ruining the robber's life. The robber commited the crime and you have a responsibility to report it. \n\nIf the marriage ends it's the husband's fault he cheated not the person that told his wife for telling her.",
          "id": 283,
          "comments": [
            {
              "score": 9,
              "content": "Exactly. Reddit is so weird",
              "id": 284,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Your picture of both scenarios is not fair. For all you know the wife may decide to stay.\n\nYour argument is that it's been four year so it should be left alone. Isn't it for the wife to decide ? If she agrees great if not, well...",
          "id": 285,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Omg yta for not using punctuation",
          "id": 286,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}