{
  "post content": "My daughter (28f) is marrying a woman (28f) and my husband and I have been trying to be as involved as we can be without violating our conscience or who we are and what we believe. Ever since our daughter opened up to us about her relationship, we've been staying open-minded, praying, communicating with her about it, asking questions, researching, welcoming the girlfriend into our home and getting to know her, attending online therapy with a LGBT counselor that our daughter paid for, and just overall trying to be a loving presence in our daughter's life. It's a process and my husband and I have come a long way from where we were, but sometimes we still come across these, what our therapist calls, \"blocks of resistance\" that hold us back from supporting our daughter in the way that she may want us to, in that moment.\n\nAnd what I really appreciate about this counselor is that she takes our situation into account as well and is willing to speak up for my husband and I. A few years ago, when our daughter wanted us to attend a gay parade with her, we were hesitant and our counselor stood by us by telling our daughter that it was \"too soon\".\n\nBut other than the gay parade, things have been pretty smooth up until now. My husband has drawn a hard line about attending the wedding. I was sort of on the fence about attending, but I decided to stick with my husband. Our daughter is pissed. At our last therapy session together, a week ago, our daughter said that if we didnt come to the wedding, all the work and progress that we had made would mean nothing to her, and that she would not want us to be a part of her life.\n\nAgain the counselor spoke up for us and told our daughter that everyone had their hard boundaries (boundaries that they would absolutely not cross) and that instead of making ultimatums, it would be better to consider the overall picture rather than letting one moment be the deciding factor of the relationship. [I'm paraphrasing, she said it much better, but I think I got the main point].\n\nThe counselor talked to me privately afterward and told me how her parents hadn't came to her wedding, and they eventually made up thirty years down the line, but that was thirty years of memories that they both had missed out on. Yet, when she talked to her parents about it recently, they said that even as much as it had hurt them not to go, they would have made the same choice because it was just something that they strongly disapproved of. She ended by telling me that she wasn't going to tell me to go or not to go, but to really consider all the pros and cons.",
  "id": 1,
  "comments": [
    {
      "score": 39167,
      "content": "YTA. This is simple, textbook homophobia. There are no mitigating factors or circumstances. You and your husband have been given a choice between supporting your daughter or embracing bigotry, and you’ve decided that your bigotry is more important. This makes you an asshole.",
      "id": 2,
      "comments": [
        {
          "score": 16838,
          "content": "The sheer the fact that they have to all see a therapist together just for them to accept their daughter for her she is, makes me sick. \n\nYTA op. You either love her as she is, or get the fuck out of her life. She doesn’t need parents who morally oppose her basic existence. I think she needs to go NC with both of you. If after years and years you can’t seem to get over your draconian hang up then it’s time she removes you from her life completely.",
          "id": 3,
          "comments": [
            {
              "score": 6369,
              "content": "And the daughter is PAYING for it!!!",
              "id": 4,
              "comments": [
                {
                  "score": 4379,
                  "content": "Daughter should save that money and take a nice vacation away from the homophobes.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1108,
                      "content": "Daughter should take a life’s worth of vacation from the homophobes. That’s what I eventually had to do after years of hoping my parents would love me & my big gay self for who I am. Eventually it just becomes toxic to your psyche to be around folks that think you & your existence is wrong/ a sin/ something to be ashamed of/ a “choice” my mother thought I shouldn’t make. \n\nMy kid is also lgbt so now it’s not just my parents’ relationship w me that’s been  affected by their bigotry masked in gOdLiNeSs. They also no longer have a relationship w their only grandson bc they‘d rather cozy up to their homophobic bigotry than accept & love their kid/grandkid for who they are. \n\nOP, YTA, obviously.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1525,
                  "content": "The daughter is a MUUUUUCH better person than me.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 1844,
                      "content": "It does NOT take years to accept that your child is gay. It should take a minute or two or less. You are religious bigots and you have chosen your religion and your pride over your daughter. Your daughter has been more than patient and you have rewarded her nothing.\n\nIf you can’t celebrate the happiest day of her life with her you deserve to be cut off. \n\nI am probably close to you in age and have two daughters. They both identify as lgbtq. I love them both very much and would never treat them the way that you treat your daughter. You act like a victim but it’s all your fault. \n\nYTA",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 696,
                      "content": "The daughter is a saint. She’s been paying for and attending YEARS of therapy with OP. OP talks about having hard boundaries. Well this is the daughters boundary. Another boundary will be when OP isn’t allowed anywhere near her grandkids. Even the Pope thinks you’re wrong Op: \n\nhttps://www.reuters.com/world/support-your-children-if-they-are-gay-pope-tells-parents-2022-01-26/",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 584,
                      "content": "Seriously. I would never spend my hard earned money trying to convince my bigoted parents to accept me for who I am. OP's daughter seems to be coming to the realization that her life will be better without her homophobic parents in it.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 481,
                      "content": "I'd adopt Daughter and her wife in a heartbeat.\n\nOP is throwing away something precious as a sacrifice to bigotry. Burning her daughter on the pyre of dogma.\n\nHow archaic.\n\nHEY OP. We get one life. We are all in the process of dying. Time is short. Often much shorter than we expected. Don't you want to spend your limited time with the people you love? Your daughter clearly adores you, or she wouldn't be trying so hard. \n\nWhy throw away a single precious moment, just because you can't understand why your daughter loves who she loves? It's okay to not understand. Nobody understands someone else 100%. You just have to accept that their choices are as valid as yours, and that you love them and want to be with them in this life. That's all. \n\nTHAT'S ALL\n\nWe will all be dead soon and quibbling over how you think your choices are the best is so first-day-of-first-grade.\n\nGrow the fuck up and realize that you're supposed to be more gracious and mature than your child because she's amazing and the person she loves must be, too.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "For real!! The fact that the daughter hasn't gone no contact already blows my mind. She'll be so much happier and healthier without these pathetic excuses for Christians as parents.\n\nOp, YTA regardless of what you do.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "That’s what really gets me. She loves her parents and wants to be accepted THAT BADLY, like all children do. I hate parents who dont love their children unconditionally for who they really are. Why even have a kid if you can’t accept that they will be their own person with their own hopes and dreams that may not always match what you expected? \n\nIm dealing with infertility (just had my second egg retrieval today so I might be hormonal right now) and all I want is to grow our family with a kid or two who we will love no matter who they love or what gender they identity with. It makes me mad that we’re struggling so hard when assholes can have babies no problem and then abandon them when they aren’t who they expected. \n\nSorry for the vent, this just pisses me off. \n\nI wish OPs daughter a lifetime of happiness and I hope she can make her own family without the homophobes in her life",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "The daughter had better not be paying for their nursing home when the time comes, these ‘parents’ deserve nothing from her.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Yeah and it's wasted money, because the counselor is clearly tiptoeing around the parents",
                  "id": 15,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "Daughter has obviously tried so hard to get her parents to accept her.  It's crushingly sad.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "for YEARS! The daughter has been putting up with and enabling their homophobic neediness for YEARS and now they still won't go to her wedding. \n\nYTA YTA  YTA alllllll the day long. Get over yourselves, you and your husband.",
                  "id": 17,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Imagine allowing your own child to pay for *your* therapy to learn how to be more accepting of her and her bride-to-be only to tell her that you won't be attending her same-sex wedding.",
                  "id": 18,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "And the parents are PRAYING on it!! SMH",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Hey she did what she could, seems like she LOVES HER PARENTS REGARDLESS, OP!",
                  "id": 20,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Too bad they don't return her love.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3782,
              "content": "Yeah, imagine being the kind of parents where your daughter has to pay for therapy for you just so that you can love her.",
              "id": 22,
              "comments": [
                {
                  "score": 1054,
                  "content": "And then it turns out that her money is going to you listening to the parts where your counselor says you don't actually have to do the actions showing you support her and ignoring the rest.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 468,
                  "content": "I think thats the most heartbreaking part of this whole thing. She's tried quite literally everything she could, including spending money out of her own pockets, just so her parents can love her. But her parents have their heads so far up their own behinds that they'd rather stay there in their own shit and bigotry then love their daughter without question just because she's gay. She deserves so much better than these jerks.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "😓",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 379,
              "content": "I’m honestly shocked at what the therapist said to the daughter. Supporting their daughter vs never seeing her again is a valid ultimatum and shouldn’t be a hard choice. They’re the ones letting something small be the deciding factor in their relationship.",
              "id": 26,
              "comments": [
                {
                  "score": 305,
                  "content": "I really don't like how the parents have \"hard boundaries\" but the daughter is issuing an \"ultimatum\". I think there's some intensely selective hearing going on there.",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 119,
                  "content": "I was concerned by the fact that the therapist gave them hope of reconciliation …30 years later…and they grabbed on to that.  She should have told them the more likely outcome..no contact with their daughters life, ever.   UGT I doubt even that would wake them up.  Can’t even imagine giving up your daughter because of your religious beliefs. YTA big time. But your loss.  Hope,your daughter saves herself and her wife from you.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 26,
                      "content": "I think the therapist was trying to be relatable to them in a gentle manner. 30 years should have been a shock. Just my take.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 32,
                  "content": "Like…it’s not even an ultimatum, it’s an impasse. Daughter needs parents who support her enough to come to her wedding, and (bigot) parents don’t feel they can provide that. It’s totally ok to be like “ok, I have this need and if it’s not filled, then we obviously aren’t working together, and imma head out and handle my life as best I can.“ It’s not even a punishment it’s a consequence of doing something horrible.  \nI can’t imagine anything my child could do or be that would make me unwilling to love him enough to go to his wedding. I hate people, I’m not fond of crowds, I’m socially anxious, etc. and I will still go to his wedding with a smile on my face and suck it all up. Because I love my child and accept him unconditionally. Period.   \nBe real here: OP will likely continue their bigotry. They have to decide if they love their bigotry or their child more, and then act accordingly. Then, the daughter is free to act accordingly in her turn, which will probably be “you chose hatred over me so I’m out”. May the daughter find surrogate parents to love her as she should be loved.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I think the therapist knows how much it will hurt the daughter if she goes through with this ultimatum. She’s showing her that she has a choice. \n\nLikely the therapist is remembering how much pain it caused her when she was separated from her parents.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 151,
              "content": "Part of me wants to give them some credit for really trying to break the cycle and be better parents/humans. But apparently it's all for nothing at the end of the day, and they've not grown at all.",
              "id": 32,
              "comments": [
                {
                  "score": 213,
                  "content": "Honestly, it sounds to me like they were hoping therapy would change their daughter's mind about her orientation and have her come back to religion. That's the only explanation I can see for the fact that they clearly have not made any progress in truly accepting her for who she is and seem to latch onto the bits where the counselor allows them the option to hunker down in their bigotry (to be clear I'm not blaming the counselor, she's doing her job in trying to hear both parties and be gentle with the parents so that they don't completely ignore everything she says).",
                  "id": 33,
                  "comments": [
                    {
                      "score": 63,
                      "content": "Yes agreed. I don't think the counselor was taking sides. The counselor IS right, everyone does have boundaries and these people just don't want to be better parents and cross those boundaries. I think even the final piece WAS the counselor trying to help the mom see the light.\n\nThese people are infuriating.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "I think you nailed it!! If after all this time they are still not accepting then it 💯 was to convert her back to church and “make her straight”. And ya, this wedding should be the proof that all this therapy worked to help them accept. Like the culmination of it all. Instead it’s proving the opposite. Very sad for OP’s daughter. If they can’t accept it at this point it’s done.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "If they haven't made progress after several months, it's a therapist's duty to say so and suggest another way forward. \n\nOP is talking about several years worth of therapy and no meaningful progress. It's obvious that the therapist ran out of tools a long time ago. \n\nI side eye the therapist for continuing to pick up that check and wasting everyone's time.",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "just a couple more weeks of praying and she'll find a man",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "This. Daughter is wasting her time, money, and efforts on shitty people undeserving to be called parents. Yea, op you ain't no parent, don't kid yourself. No real parent would throw away their child just because they don't agree with their beliefs. And yes, you threw her away. Do everyone a favor and just disown your 'daughter' so she can finally live freely without AHs like you who think they're saints/pure/whatevertf, because of your precious religion. I hope God spits you and your AH husband outta heaven right into the bowels of HELL. I will pray to a god I don't believe in that AHs like you WILL NEVER ENTER HEAVEN. Yta.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Also, I love how the therapist says it’s ok for the Op and their husband to have boundaries, but it’s not fair for the daughter to throw down an ultimatum. Totally ignoring the daughters boundaries, and that not attending the wedding is crossing a boundary.",
              "id": 39,
              "comments": [
                {
                  "score": 23,
                  "content": "I mistrust the OP's interpretation of the therapist.",
                  "id": 40,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "Yeah that therapist either sucks or op is twisting things.",
                  "id": 41,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "OPs poor daughter is begging for her parents to love her unconditionally to the point of paying for a therapist to work on the parent's mental illness that makes them struggle to accept relationships they're not in.  And here comes OP stilk thinking it's a good idea to reject her child on her wedding day.   SMH.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Agree with the comments above. \n\nYTA and a MONUMENT one. \n\nFFS you need therapy paid by your daughter because you are huge homophobes and toxic parents. \n\nYou don’t deserve your daughter. Hope she goes NC for her own mental health.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Honestly, that they're willing to go to therapy to work on it is something I view positive.\n\nThat they're still not done with therapy when it's time for the wedding - which I assume took a year or more to get to - less so.\n\nThere's a lot of issues that rightfully need years of therapy to get over. Your child being gay isn't one of them.",
              "id": 44,
              "comments": [
                {
                  "score": 14,
                  "content": "She asked them to go to a pride parade \"a few years ago\" and the therapist gave them permission not to. Looks like it's been significantly more than a year. They're obviously not putting good faith effort into the therapy if a few years isn't enough to get them to their daughter's wedding.",
                  "id": 45,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "My son is 28 and I've always wanted a daughter. OP, I'm happy to be your daughter's mom now, if you're too uncomfortable to be the mother she needs. \n\nShe'll have a cool gay aunt and even a cool, younger gay cousin!",
              "id": 46,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1252,
          "content": "Right, this is not nuanced or complicated like OP wants to convince us, it’s pretty damn simple",
          "id": 47,
          "comments": [
            {
              "score": 1221,
              "content": "OP’s tone is honestly making my blood boil. They are acting like it’s just *such* a difficult struggle they’re going through to try to accept their daughter. Like it’s soooo fucking hard to just not be flagrantly homophobic and bigoted. I have literally none of the sympathy that OP is attempting to garner with this post.",
              "id": 48,
              "comments": [
                {
                  "score": 554,
                  "content": "Right. Go to my daughter's wedding or be removed from her life permanently? This is not a difficult decision. OP should have just come out and said \"I'm homophobic\" instead of writing a 5 paragraph essay trying to justify it.",
                  "id": 49,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 197,
                  "content": "OP gets a Gold fucking medal in mental gymnastics",
                  "id": 50,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Religion is good at doing that to people though tbh. (I am assuming OP was indoctrinated severely by religion)",
                      "id": 51,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "I know. Reading this post was killing me.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 153,
                  "content": "Typical homophobes acting like it's them that are struggling because their family member is lgbt. It's so pathetic it's laughable.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 7,
                      "content": "The username says it all.  Stuck between two rocks.\n\nExcept one rock is made of polystyrene and you could move it easily, all you have to do is try.\n\nOP cares more about her \"conscience\" than about her daughter.",
                      "id": 54,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 114,
                  "content": "as a queer person, I went blind 1/3 of the way in because of the OP's tone.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I'm straight and you got further than I did with this bullshit. The patents choose their own hate over their daughter. I don't get it.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 27,
                  "content": "Especially when it doesn’t sound like there’s a single other reason given to not support the marriage. She doesn’t mention some sordid history of the fiancé or that they’re marrying too fast or too young or even just that she doesn’t like the fiancé.",
                  "id": 57,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "My grandpa was mad when my mom originally came out... I don't even think he was upset for more than a few days, or maybe a month. And this was back in like, the 70s. And this is like, a guy from the old country. He became 100% loving, accepting, and not-homophobic pretty immediately, and remained that way for the rest of his life.  \n\n\nThe fact that these parents have taken YEARS of therapy and still are holding onto their bigotry means they really don't love their daughter/don't actually want to change.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Loving my child is literally the easiest, most effortless thing I'll ever do.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "This!! I could never imagine being that sort of a mother.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Agreed. \"Oh boo hoo, it's soooo hard for us.\" - while completely oblivious to how hard they are making it for their daughter when she already has to deal with societal discrimination. OP is TA!",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "Right? OP is talking about this therapy process like her and husband are being deprogrammed after years of being in a cult…oh wait…",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "\n\nExactly. \"Blocks of resistance,\" my ass. What a cute nickname for bigotry. Whether it's religion, or your beliefs, or whatever the hell you're calling it, it's ultimately just a justification for you to continue your hateful and bigoted views.\n\nYta, op. And even more so for trying to tip toe around the elephant in the room with your little turns of phrase. You're either okay with being a bigot or not and it just seems to me that even though you're in therapy, you're still not ready to grow and accept someone else for loving whoever they love, regardless of whatever conditions you feel should be on love and/or marriage.",
              "id": 63,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1145,
          "content": "I was raised Christian and my father is also extremely homophobic just like OP. What I never understand is why your own beliefs mean you can’t support others who choose differently. Nobody is saying OP has to suddenly change beliefs or go around spreading gayness. But you should respect people’s personal choices, and continue to love them. It is in no way Christian to hurt loved ones. I mean Jesus was friends with prostitutes and all sorts of sinners! You’ve let some church skew the Bible to fit their hate. This is the biggest moment in her life, don’t show her that you won’t support her and only show love when it’s convenient and conditional.\n\nETA To clarify my position, I’m LGBT+. I’m firmly on the Left and no longer religious. However, I know there are better ways to reason with people than to scream how wrong they are till I’m blue in the face. I only hope to make people more and more accepting so that we can go on with our lives unbothered by bigots. Also, that’s a beautiful award! Thank you!",
          "id": 64,
          "comments": [
            {
              "score": 610,
              "content": "I have no idea how people can have a \"belief\" or \"value\" about something that has absolutely no applicability to their own lives. It does not actually affect OP in anyway that her daughter is gay. Imagine, if you will, a time when gay men and women married each other for cover, then each went and did their own thing. If OP's daughter married a man but went about her happy way with women, OP would be none the wiser and her daughter would still be just as gay. \n\nThe difference here is that \"the gays\" now get to declare their love and commitments out loud, but the actual (non) impact on OP remains exactly the same. It's just her reaction to it. \n\nOP, rejecting your daughter cannot truly be part of your \"beliefs\" or your \"values\" if you follow the actual teachings of Christ. Who did he ever reject, except the money lenders and those who took advantage of others? If this is really \"who you are,\" and it is an important part of your identity, then just accept that who you are is a bigot and call it a day, and quit wasting your daughter's money on therapy.",
              "id": 65,
              "comments": [
                {
                  "score": 140,
                  "content": "Anyone else think OP has never actually read the bible? Or if she has, *she missed the point*",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I hate this view of lgbtqia  people as sinners. They're just people. Religion is fiction. People need to grow up and start thinking for themselves and not what some sci-fi book  tells them to. All this coming from a former Catholic YM who hated seeing people using religion to excuse their HATRED and their UNETHICAL actions.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I was raised Christian as well, and that denomination—the Evangelical Lutheran Church in America—allows for LGBT+ clergy and performs LGBT+ marriages. If I recall correctly, the presiding bishop of the denomination is a trans woman. The ELCA is in full communion with the Episcopal Church and a few other Protestant denominations, and they’re all in accord on LGBT+ issues. People who hide behind Christianity for their homophobia have no excuse.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "The thing is, we're not a belief or an opinion. We're real people who exist. Physical, tangible people who live and breathe and are entitled to the same lives as everyone else.\n\nI do agree with what you're saying though, just thought it was important to add that bit.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 518,
          "content": "Homophobia is always grounds for a YTA award",
          "id": 70,
          "comments": [
            {
              "score": 13,
              "content": "yep. plain and simple. this entire post from the first sentence was 🤮",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Truer words have never been spoken. My fangs and claws are always so sharp and unrelenting when posts like these come through aita.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 484,
          "content": "YTA, OP. If you can only love your kids conditionally, why the heck do you bother having kids?\n\nI'm sorry for your daughter that you and your husband don't love her enough to accept her for who she is. I hope the people your daughter now surrounds herself with are more supportive and loving than her parents are. And I'm glad that this might give her the final shove she needs to cut out her toxic parents who find her existence shameful. You don't deserve a relationship with your daughter and new daughter in law. You don't deserve a relationship with any future grandchildren. I hope your bigotry and blind hatred for perfectly natural things brings you all the comfort you deserve in your old age",
          "id": 73,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 224,
          "content": "[deleted]",
          "id": 74,
          "comments": [
            {
              "score": 1875,
              "content": "mind you, she’s bragging , but she still isn’t going to the wedding because she’s “going to stand by her husband”. what do you have to brag about? being a coward? not being willing to make actual changes for your daughter? missing your daughters wedding? \n\nyou’d rather stand by your bigoted husband than your daughter? there’s no excuse for that you’re just as bad as him. you aren’t supporting your daughter by just going to the counseling sessions and reaffirming your homophobia. make a damn effort, jeez. you don’t deserve an award for being homophobic parents OP",
              "id": 75,
              "comments": [
                {
                  "score": 1005,
                  "content": "Her homophonic religion very likely also requires her to “submit” to his “leadership”, so she thinks she’s doing the right thing there.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 487,
                      "content": "Yeah, but I also get the impression that OP is trying to somehow “lessen” her own active decision to stay home, and make it more her husband’s decision and she’s just following along to support him. “I didn’t skip your wedding because *I’m* unsupportive of you and a bigot, I was just being supportive of my husband!” She’s trying to absolve herself from full blame for not going to her own daughter’s wedding. “Oh honey *I* would’ve gone if it was just me, but you know how your father is! Oh shucks!”",
                      "id": 77,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 445,
                      "content": "*blegh*",
                      "id": 78,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "I'm making some assumptions here but I assume OP doesn't have slaves or a concubine and is fine eating shellfish. So, apparently ignoring some parts of the bible are fine. YTA OP for using the bible as a weapon trying to control your child.",
                      "id": 79,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "yeah that's what it sounds like",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 230,
                  "content": "[deleted]",
                  "id": 81,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Yeah lmao OP YTA, Jesus won’t love you more just because you refuse to go to your own daughter’s wedding",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 106,
          "content": "Sometimes it’s hard to articulate why someone is or isn’t TA, but here the blatant bigotry makes it super easy! YTA",
          "id": 83,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10962,
      "content": "YTA. Would this even be an issue if she was marrying a man? It’s just homophobia. Go and be there for your daughter, be happy for her. But don’t go if you’re going to make the day miserable.",
      "id": 84,
      "comments": [
        {
          "score": 3603,
          "content": "Wow! What a waste of therapy $$$ for the OP's daughter. They'd rather miss their own kid's wedding. Holy shit! That level of assholery is amazing. YTA - Remember this moment. It's the moment you lost your daughter forever.\n\nBut look! They let a person in their house and got to know them like any normal person would do to a friend let alone their fricken daughter's partner.  Damn. This is amazing. Just because you call something a \"hard boundary\" doesn't make it okay, OP.   \n\n\nI can say it's a \"hard boundary\" to not return money I stole, but to be really sorry about it. It's not right.",
          "id": 85,
          "comments": [
            {
              "score": 1361,
              "content": "The fact daughter is footing the bill to try and have her parents get over their nonsense is ridiculous too. If OP and her husband actually wanted to support their daughter they would have refused to let her pay and paid for it themselves. \n\nThe fact daughter is paying as opposed to cutting her bigoted family out also speaks to how much she wants a relationship with them, if them not coming to the wedding is finally enough for her to give up on them she's been a lot more tolerant of their intolerance than most would be.",
              "id": 86,
              "comments": [
                {
                  "score": 527,
                  "content": "The daughter has been far more gracious and loving through this than I would have been. She has tried everything to help this situation. I feel so badly for her.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 40,
                      "content": "Same my heart is breaking for their poor daughter. She is trying so hard and in the end nothing will change. I hope the daughter is able to find peace in future surrounded by people whose love for her is unconditional",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Ironically enough, the daughter is being more Christ-like than OP.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Me too. The parents perspectives is warped by their perception of reality And in that small reality they lost humanity. The daughter is the hero in this story. And OP is just a ignorant AH YTA",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "She’s literally paying to try and earn her parents love. How gross.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Worse, paying to lessen her parent's disdain.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "I agree. I personally wouldn't do any of that.    \n\nI didn't have the best childhood with my parents. I never tried to win their love because they just weren't good people. I came out last June (FTM/ trans man) on Facebook. I got thumbs up and hearts. That's it. I saw them the end of June for a family reunion, they said nothing, and I flew back home. I then received some kooky email from them about how they love me. They proceeded to misgender me...etc. I ended up ignoring it.   \n\nI don't mess with people who can't accept me. I've lived 3.4 decades for everyone else. And I'm just done.    \n\nI truly hope OP's daughter can reach the point where I am at. Move on from her toxic parents and live her happiest life.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "It is just heartbreaking.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 357,
              "content": "I wouldn’t call it a waste. The payment for therapy makes it easier for her to now cut these bigots out of her life.",
              "id": 95,
              "comments": [
                {
                  "score": 72,
                  "content": "That was my thought too. I have a distant relationship with my family and it helped me to set boundaries to know I did EVERYTHING I possibly could.",
                  "id": 96,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I recently cut my toxic ass parents out of my life. my super religious older sister kept texting me telling me I \"needed to forgive and forget because I only have one mother and father and they are getting up there in age and they could be gone in an instant and I would have this guilt for the rest of my life\". The only way I was able to get her to stop trying to guilt trip me was to tell her my therapist told me to cut the toxic people out my my life. She finally backed off. my mental health sky rocketed up and i felt so much better. \n\n&#x200B;\n\ni fully support the Daughter cutting OP out of her life after this bullshit and I wish her and her new wife the best and happiest of marriages with out the toxic homophobic parents ruining their life",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "That is true. When she walks away, she'll know that she gave them every opportunity without regret. She'll truly know they're unsalvageable humans.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Literally, their therapist has made so little progress in years of therapy, it’s astonishing",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "It's like saying I am not racist because the guy that makes my coffee is black. While in the meantime using the N word.",
              "id": 100,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 199,
          "content": "I saw a red flag as soon as praying was mentioned lol",
          "id": 101,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 119,
          "content": "Also, how many daughters does OP have? And how many weddings will the daughter have? Go to the damn wedding and SUPPORT YOUR CHILD.",
          "id": 102,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 65,
          "content": "Can we go in place of OP and her husband to the wedding? Sounds like daughter needs a replacement family who will accept, love, and support her for who she is!",
          "id": 103,
          "comments": [
            {
              "score": 18,
              "content": "Oh how I wish we could! We could make sure she is surrounded by love and positivity for the day.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Omg this! Let’s hope she finds this and invites us.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Right! And what does she want her to do, pretend that she’s straight and marry a man which would be betraying him? How would she feel if the roles were reversed and some gay man, who was trying to fit into some box his parents set, married her. Only to leave her and maybe their kids later because he didn’t want to live a lie. I’ve seen this happen. It’s very hurtful. She wouldn’t be too happy with her daughter’s husband would she?￼",
          "id": 106,
          "comments": [
            {
              "score": 8,
              "content": "I know a man that did this.  It did not turn out well and hurt so many people, especially the wife and children.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Yes, a wedding is to celebrate the love there is between partners with all their lives ones. And isn't love more important than if someone has a d\"\"\" in their pants or a vag? If you love your daughter you love her unconditionally. That means, no matter what she does, wears, no matter how she acts and no matter who she loves.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10764,
      "content": "If you're more invested in hating gay people than in loving your daughter, then yes, YTA.",
      "id": 109,
      "comments": [
        {
          "score": 1547,
          "content": "So succinctly stated. I will never understand a religion that holds itself as superior while worshiping a deity that is a carbon copy of the ones doing the worshiping. It is the height of egoism.",
          "id": 110,
          "comments": [
            {
              "score": 641,
              "content": "I love how they take thier 'word of God' and skew it too. The Bible says to love EVERYONE,  and judge nobody, because only God can judge them.",
              "id": 111,
              "comments": [
                {
                  "score": 431,
                  "content": "The Bible says anything you want it to say, loving or hateful alike, if you just flip to the next page until you find what supports your narrative.\n\nIt's a hodgepodge mess of hundreds/thousands of years of oral traditions passed down through generations and other mixed mythologies that have been written down, rearranged, edited, translated, etc. by hundreds of different people with their own agendas over the course of hundreds of years.\n\nThere is no consistent messaging to be found in it as a whole.",
                  "id": 112,
                  "comments": [
                    {
                      "score": 44,
                      "content": "Oh for sure the whole thing is garbage. It's not even complete. If you ask a church goer what version of the Bible they read, they get upset. If you tell them there are more chapters their version is missing, they really lose it.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 330,
          "content": "[deleted]",
          "id": 114,
          "comments": [
            {
              "score": 198,
              "content": "Chefs kiss? Or does french kiss have a new meaning that idk about lol",
              "id": 115,
              "comments": [
                {
                  "score": 131,
                  "content": "[deleted]",
                  "id": 116,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Aw you’re not stupid. I was just making sure I wasn’t out of the loop. I teach teenagers so I gotta stay hip lol",
                      "id": 117,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Nah french kiss works too ;)",
                      "id": 118,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "It absolutely delighted me",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 31,
              "content": "Chef's kiss might be *little* more fitting than french kiss (way less tongue) lol",
              "id": 120,
              "comments": [
                {
                  "score": 20,
                  "content": "[deleted]",
                  "id": 121,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Maybe..",
                      "id": 122,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 87,
          "content": "It’s also complete BS to use religion as an excuse to take this stance. Jesus preached that only he who is free from sin may cast the first stone — it is NOT your place to judge or punish your daughter for what you perceive are her sins, OP. Your job as a Christian, and more importantly, as a parent, is to love, accept, and support your daughter. In a world so full of hate and greed and sickness and cruelty, why would you waste any time and energy disapproving of the way your daughter chooses to love, or who she shares that love with? She would like to share her love with you, too. Aren’t there more important moral stands to take, that don’t come at the expense of a loved one’s peace and happiness? Get the hell over yourself and go be there for your daughter on one of the most important and memorable days of her life. You will never forgive yourself if you don’t, and she will carry the hurt you have caused her with her for the rest of her life. Don’t cast a pall on what should be a happy day full of love and community. YWBTA, of course, and it would be a terrible shame. This is not a choice you’ll have a second chance to make. Don’t fuck it up.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "OP literally had to go and ask /r/AskAChristian if Jesus would go to a gay wedding just to get some fellow bigots to support her side of it. I think that says everything we need to know.\n\n(Not saying all Christians are bigots, just a lot of the people who replied to that thread definitely are.)",
          "id": 124,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Proved with;\n\n>Ever since our daughter opened up to us about her relationship, we've been staying open-minded, **praying**, communicating with her about it, asking questions, **researching**, welcoming the girlfriend into our home and getting to know her, attending online therapy with a LGBT counselor that our daughter paid for, and just overall trying to be a loving presence in our daughter's life.\n\nI take it the praying was not asking God to help them to accept their kid.\n\nAlso the \"research\", I'm taking is reading stuff from VERY religious and/or anti-LGBT people.\n\n>I'm paraphrasing, she said it much better, but I think I got the main point].\n\nSo to translate, \" I only listened to the parts that I wanted to and ignored everything else \".",
          "id": 125,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Couldn't have said it better myself.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8267,
      "content": "[removed]",
      "id": 127,
      "comments": [
        {
          "score": 15589,
          "content": "Agreed. OP is interpreting this therapist as being on her side, but reading between the strong professional lines she's drawn, I hear a strong message of \"My parents missed out on years of my life and it hurt *SO MUCH*, and while we've tried to repair the damage in recent years, it still hurts that my parents weren't there, and it really, *really* hurts that they said they'd be fine with hurting me again.\"\n\n(Edited to add: YTA, OP. The therapist's job is to keep you guys talking, because nothing is irrevocable until you stop trying to keep the relationship going. But not going to your daughter's wedding is you deciding to stop trying not to hurt your daughter any more. So please, change your mind. Don't be like the therapist's parents. Leave your daughter's relationship with God to be a private matter between her and God. Choose love.)",
          "id": 128,
          "comments": [
            {
              "score": 2538,
              "content": "I think it's that or the therapist has some internalized homophobia as a result of their relationship with their parents and internalized homophobia.\n\nBased on them not talking for 30 years, their therapist is likely at least in their 50s themselves and may view losing contact  with family as a normal part of coming out",
              "id": 129,
              "comments": [
                {
                  "score": 1674,
                  "content": "I think the therapist might be looking at how they’ve responded in the past “I don’t want to do that” and realized that a little time might get them to change their minds. But a parade is different than a wedding. There’s a parade every year, but only one wedding. Maybe she’s planting the seed of “maybe it’s not worth the strife” idea, and will expand on it in future sessions.",
                  "id": 130,
                  "comments": [
                    {
                      "score": 2047,
                      "content": "[deleted]",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 553,
                  "content": "No, therapist are required to work in their clients best interests. Like a lawyer.  They have to work to help bring their clients interests “to life”. She legit couldn’t just straight up say “you’re making a huge mistake - get over yourself and go the the friggen wedding”. She may have internalized some things but she clearly is trying to sway them as much as she can. \n\nShe’s just reaaally limited in her ability to do so.",
                  "id": 132,
                  "comments": [
                    {
                      "score": 485,
                      "content": "yeah, it’s really unfortunate that therapists can’t just say \n\n“you are being a dumb. stop being a dumb.”\n\nbut people tend not to like being told they’re being stupid, even when they are. they have to realize it on their own\n\nedit: thank you so much for the wholesome and silver award!!❤️",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 804,
              "content": "OP is focusing on “the therapist is giving us time to figure it out in our way” and thinks that means the therapist understand and is on her side. \n\nshe isn’t. vehemently. but she knows they’re idiots and that they need time to figure out that they’re idiots in a mentally and emotionally healthy way. no good therapist is going to rush your progress. you can take all the time you need in her office. \n\nOPs daughter on the other hand, isn’t a therapist, so she shouldn’t have to and isn’t going to wait however long they wanna drag out no longer being homophobes, and their therapist is trying to communicate that with OP, in a professional way. \n\n30 years is a long time to risk not speaking just cuz you don’t like rainbows. i hope the daughter follows through and cuts them off if they don’t come to the wedding",
              "id": 134,
              "comments": [
                {
                  "score": 369,
                  "content": "At the end of the day, it doesn’t matter whose side the therapist is on.  Because if you don’t go to the wedding and your daughter cuts you out of her life, you’re losing the therapist too (that your daughter is paying for.). So you and your husband can content yourself with the ”moral high ground” while you miss out on all of your daughter’s milestones (including grandchildren) while your therapist moves on to the next family of homophobes.",
                  "id": 135,
                  "comments": [
                    {
                      "score": 221,
                      "content": "There’s something about the way OP speaks about the therapist and the things she tells them that makes me think that OP takes the therapist not telling them they are outright wrong to be tacit permission to not go to this wedding. You’re right that it doesn’t matter whose “side” the therapist is on, if any, but OP gives me the impression that she thinks the therapist is giving them the green light to not go to the wedding and that is informing her decision to stay home because “Well the therapist didn’t say we were *wrong* for not going!”",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 124,
                      "content": "Right, because it will be the daughter's \"choice\" to remove them from her life while they were *trying soooo hard* to be accepting.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 303,
              "content": "[deleted]",
              "id": 138,
              "comments": [
                {
                  "score": 128,
                  "content": "Right? That's my big takeaway here. \"I didn't talk to my parents for 30 years when they did this\"\n\n\"Oh well, but it's still ok if I don't go right?\"\n\nLike, wtf?\n\nYeah sure, if you want to maybe not talk to your daughter for 30 years, don't go to her wedding. Have fun.",
                  "id": 139,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "THIS IS THE PART I CANNOT BELIEVE!",
                  "id": 140,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 110,
              "content": "Not to mention how HURT OPs daughter is going to be looking back through pics of her wedding and not seeing her parents there.  \n\nEvery.single.time.\n\nEven if the relationship is repaired she is going to be reminded of how you abandoned her on the most special day of her life for ignorant, misguided, old-fashioned beliefs, every time she wants to relive her wedding.  \n\nOP - YTA and I hope you and your husband really think about the long term consequences of your actions and make the right decision.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Also say her parents had her (the therapist) in their 20s and she got married at 30. The parents would’ve been in their 50s, so 30 years before reconnecting and sharing a low contact, strained relationship would potentially put her parents in their 80s. It’s more likely that the parents were sick and reconnecting only occurred because of it being closer to their lives coming to an end.\n\nGuess this is OP’s hill to die on though, literally. She and her husband are willing to go the rest of their lives with no contact, that means their daughter is right, none of their “efforts” mean anything and were just for show.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I appreciate you spelling this out in such a clear and concise way.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "OP the thing is, whether you go to the wedding or not won't change who your daughter is or who she loves. \n\n\nThis wedding is happening and she wants you there. That should be enough. \n\n\nPut yourself in her shoes if you don't go. Everyone will be wondering why you both aren't there. She won't have a parent to walk her down the isle. Instead of focusing on her union she will be thinking about why you refuse to be there for her. If you need to, compromise and go for the ceremony at least. \n\n\nDon't ruin the most important relationship in your life for a moral high ground.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Damn i really wished i saw the top comment before it was removed smh",
              "id": 145,
              "comments": [
                {
                  "score": 31,
                  "content": "It said:\n\n> I'm a Christian, and a therapist. Because I'm not your therapist, I can do exactly what your therapist wants to do but ethically can't, which is to say that you and your husband are bigoted idiots and you are going to destroy your relationship with your daughter for absolutely no reason other than your misguided and wrong beliefs about what it means to be a Christian.\n\n[Archive link](https://www.reveddit.com/v/AmItheAsshole/comments/sfjcal/wibta_if_i_chose_to_stay_home_with_my_husband/huq5jbp/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3&ps_after=1643468885)",
                  "id": 146,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Thanks for adding this. I was also wondering what the top comment said.",
                      "id": 147,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Think of it this way, OP: if you don’t go to the wedding you’re telling your daughter that you not only don’t support her happiness, you also don’t support her wife being equal to your daughter. You’re basically telling her that you don’t think she deserves to have a relationship with her wife that’s equal to the relationship you have with your husband.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "she post the same question (basically) on r/AskAChristian/ and still isn't getting the positive responses she feels she deserves.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1049,
          "content": "OP, I'm a devout Christian as well. I'm also bisexual. I can tell you that your daughter is drawing a line in the sand, and just because your therapist forgave her parents doesn't mean you will receive that forgiveness.",
          "id": 150,
          "comments": [
            {
              "score": 455,
              "content": "I’ve been a Christian for over thirty years. \n\nGod forbid I react to my child’s possible coming out with anything other than “I love you, I support you and always will, and you’ll always be my child.”",
              "id": 151,
              "comments": [
                {
                  "score": 789,
                  "content": "My 90 something year old, very Catholic, grandpa was supportive of gay marriage, both voting for it in our state at the time and attending some for loved ones. In his words \"I don't really understand it, but I don't have to understand it. My God tells me to love and so that's what I'm going to do. I don't need to understand it to act with love\".",
                  "id": 152,
                  "comments": [
                    {
                      "score": 203,
                      "content": "Yup! My grandparents' first date was going to Mass and they were besties with a couple drag queens in the 60s so honestly OP is wild",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Imagine what a force of good the Christian churches of the world could be if all their members were like this.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Yep my Nonna is very devout catholic goes to church every day. Traditional Italy (immigrated here 50 years ago but very much maintains traditional Italian values). She was livid when my mum sat her down to tell her I was gay. She was insulted that we thought she would care or treat me any different cause of my sexual orientation. My family are nothing but supportive and the fact I’m gay never gets bought you it gets treated like my straight siblings. I’m just dating people who cares about their sex.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "well, I didn't expect to cry with joy reading this post, but that's an absolutely beautiful thing for him to say and so truly precious that his actions preceded his words. Now that is a true Christian, imo.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 138,
                  "content": "Exactly. My parents (mom is Catholic, dad is non-denominational) were nothing but kind and loving. I think OP skipped some verses in favor of clobber passages tbh",
                  "id": 157,
                  "comments": [
                    {
                      "score": 163,
                      "content": "I wouldn’t want to meet these people’s version of God in a dark alley. And that’s partially why I tend to vote for politicians who don’t make their religious beliefs public knowledge. \n\nTo paraphrase Ghandi: “I like your Christ. I do not like your Christians. They are so unlike your Christ.”",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "My dads boss is literally an Archbishop. My dad has come to pride with me. He loves my wife and would have walked me down the aisle if not for covid. He loves God and goes to church 2x a week. Using religion as an excuse to hate something that’s uncomfortable is tired. \n\nMy dad is also pro choice. He’s a beauty of a Catholic, I love him.",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 85,
                  "content": "Yeah and I don’t think it says “abandon your gay children on their wedding day” in the Bible",
                  "id": 160,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I don't believe the word homosexual (a German word) showed up in the English bible until the 1940's.\n\nTo many people blindly follow a book that has been translated thousands of times without ever learning its history.\n\nYTA",
                      "id": 161,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 895,
          "content": "This.  Just wanted to add, OP is projecting their own issues on to their daughter.\n\nYou are literally abusing your daughter by making your love conditional.  You are showing her that who she is is not enough for tou.  That you don’t love her, for who she is, unless she changes herself.\n\nMy heart breaks for the abuse she must have suffered for having you as parents.\n\nYou know how they say victims of abuse can spot the signs?  Danger danger will Robinson.  How many batsigns need to appear in the night sky before you notice you are the problem.\n\nHopefully my anger on your daughters behalf reaches you.",
          "id": 162,
          "comments": [
            {
              "score": 193,
              "content": "THIS! \nLorien6 said this very well. \n\nOP is showing her daughter that her love is conditional. It's not 100% pure love. That if her daughter makes a different choice, stays from OPs belief, that she (daughter) is not enough or worthy of OPs love or presence. \n\nIll say it again, OP is showing that her daughter is not worthy of her presence. That her daughter is not important. \n\nIt's truly sad.",
              "id": 163,
              "comments": [
                {
                  "score": 72,
                  "content": "Thank you for your insights.  You are appreciated.\n\nI would go even further and say OP has taught her daughter to feel worthless, that without love, she had no worth.  Her self talk and image is probably demolished.\n\nCourageously for her, she is standing up to her abuser(s), and is going to soon be rebuilding her self image how SHE wants to see herself, not how her parents used love to manipulate and control her.\n\nI am both happy that I can see the path daughter is on (because she’s going to have such a beautiful life), and sad that she had to absorb so much suffering, pain, trauma, and damage for her to feel like she had worth.\n\nNot loving your child unconditionally is neglect and abuse.",
                  "id": 164,
                  "comments": [
                    {
                      "score": 8,
                      "content": "OP is massively the AH here and I agree with a lot of the sentiments here.  Not loving their child enough to set their pride aside for a day because they're bigots is unacceptable.\n\nBut I think it's extremely dangerous to categorize \\*any\\* love as having to be unconditional.  Some people are toxic for their own reasons and the refrain that love needs to be unconditional is extremely damaging.\n\nThere are AHs who will try to use that to justify their particular flavor of conditional love, sure.  But reaching those people through reasoning often isn't going to work anyway.\n\nSorry, just my $0.02.",
                      "id": 165,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This. My parents are not and will not ever be a part of my life. I will celebrate the day they die because of their hatred and refusal to accept who I am, the traumas they inflicted through religion, and the general horrible bigoted petite they are. \n\nEven though I married cis men and I'm a queer woman they weren't at my first wedding that they were invited to because they didn't like him. My second wedding they weren't invited to and had no part in my life by then. \n\nThink hard about what you're doing op. Bring lonely and old sucks.",
              "id": 166,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 636,
          "content": "Yeah, like OP, whether or not internet stranger think you're an AH for not going to your daughter's wedding simply because she's gay (which, most of us do, btw) is irrelevant. \n\nIf you put it across as \"having boundaries\", yeah sure lol no one can be called an asshole for \"having boundaries\" and you're not \"obligated\" to go to anyone's wedding- but actions (and \"boundaries\", as you put it) have consequences. \n\nYou're \"allowed\" to not to go to the wedding, just as your daughter is *\"allowed\" to cut yall of/go No Contact with y'all for not coming to her wedding*. And rightfully so. I would've done the same in her place. Hope the comfort of keeping your bigoted beliefs is worth losing (contact with) your daughter. \n\nAlso, yeah, YTA for being homophobic and causing your child pain and stress because of your homphobia. I'll say this as a queer child myself, don't have kids if you're unwilling to accept that they may be queer. You don't deserve them, and your kids don't deserve all the stress they get from having to deal with bigoted parents.\n\nEdit: Just to add, while I think it's good that y'all are *at the very least* willing to try and get past your bigotry, I'm sorry but I don't think you deserve any applause for doing the bare minimum. You're not some hero for going to therapy and \"accepting\" your gay daughter, that was already a given if y'all are even half decent human beings. Your kid is not responsible for changing or dealing with harmful beliefs y'all didn't question till now. As adults with free agency, it's *your* problem and responsibility to question irrational beliefs that harm and hurt others. I don't think people (even with awful beliefs) are \"beyond redemption\", but you don't get a cookie for simply trying to correct where you went wrong. You have all my encouragement for overcoming your bigotry, but not my sympathies. I just hope you manage to do right by your daughter ultimately.",
          "id": 167,
          "comments": [
            {
              "score": 154,
              "content": "This. 100%. You can make whatever choices and set whatever “boundaries” for yourself however SO CAN YOUR DAUGHTER based on those decisions. You’ll have to live with the fact that because you didn’t go to the wedding, your relationship is ruined and she MAY choose to never forgive you. Therapist is giving perspective and helping client see the big picture so that they can make their own decisions. I just... all this effort into therapy and trying to understand your daughter, and you’re not going to the wedding? Sounds like all that therapy and whatever else will be a waste of time .... you’re likely going to lose your daughter if you don’t go to the wedding. It’s one night. It’s a meaningful night. And it states whether or not you support her and her marriage. It says a LOT MORE than just simply not attending an event due to your beliefs. Your daughter will see it as not loving her ...not accepting her... so much that you won’t even swallow your pride to go to the one night that means so much to her. Put yourself in her shoes.... maybe not exactly, but when you were growing up, did your parents make you feel Unaccepted and unloved or conditional love? It’s a terrible feeling and you wouldn’t want your daughter to feel that, I hope. She won’t forget that and she may never forgive it either.",
              "id": 168,
              "comments": [
                {
                  "score": 9,
                  "content": "Not to mention that the *daughter* is paying for the therapy!",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 209,
          "content": "This makes me so angry. She hates gay people more than she loves her daughter.",
          "id": 170,
          "comments": [
            {
              "score": 26,
              "content": "You hit the nail on the head here. Her hatred is stronger than her love- love for her own *child*, too. That tells me everything I need to know about OP and her husband.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "OP, read this until you understand",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 185,
          "content": "Well said. YTA OP, support your daughter FULLY",
          "id": 173,
          "comments": [
            {
              "score": 8,
              "content": "This and I can already imagine if the daughter and her wife have a baby, that OP and the dad will try to only see the babies and not have anything to do with the wife. YTA",
              "id": 174,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 151,
          "content": "Blocks of resistance seems like a very fancy way of saying YTA.",
          "id": 175,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 52,
          "content": "Couldn’t agree more, misguided Christian beliefs are gonna lead to no family around you.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Soooo… I’m just going to say ditto here. This person put it very well. YTA. Also, please look up Luke 6:37.",
          "id": 177,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I'm not a Christian, but I don't see how anyone can claim study the teachings of Jesus Christ and come away thinking that bigotry of any kind is Christ-like behavior.  OP's daughter is showing far more compassion than her parents - giving the time and paying for the tools for them to learn how to be better people.  If I were her, this is the moment I would write them off and go no contact.",
          "id": 178,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5429,
      "content": "Without “violating” your conscience? Holy fuck. YWBTA. I don’t have kids so what do I know but my understanding is that you are supposed to love, support and encourage them to live their best lives. Maybe an actual parent can correct me on this. \n\nI haven’t spoken to my family in years because of their bullshit. I can honestly say my life only got better once I was free of their expectations and small mindedness.\n\nETA I have an amazing life and it’s my family who are missing out. I almost never think about them except to be grateful I don’t have to deal with it anymore. I hope your daughter stops dancing for scraps and frees herself like I did.",
      "id": 179,
      "comments": [
        {
          "score": 1427,
          "content": "Actual parent here, and you are absolutely correct. OP is a total A H for prioritizing some made up rule about sexuality over their living, breathing child.",
          "id": 180,
          "comments": [
            {
              "score": 1073,
              "content": "Actual CATHOLIC parent here. \n\nAnd I fully agree! My kids are too young for any type of sexuality right now (2 and 3 years old) but I already read them books about all the different types of families there are. These include (among other things) gay couples, single parents, combined families, handicapped people, people of different colors and nationalities, people with different religions.  \n\nI want to teach my kids to always come from a place of love and not of hate like op does. If one of my daughters brings home a girlfriend,  I just hope they are happy together, just like I would when she would bring home a boyfriend.",
              "id": 181,
              "comments": [
                {
                  "score": 392,
                  "content": "Parent here, too, and you are right. One kid is pansexual and has dated males and females. We want kid to be happy in their skin. We don't check plumbing to validate a relationship. Instead, we value anyone who treats kiddo as a valuable human being. These parents are all about judging. It breaks my heart to see so many people judged harshly for loving another person who loves them back. When two people make each other better, that should be celebrated.",
                  "id": 182,
                  "comments": [
                    {
                      "score": 23,
                      "content": "> We don't check plumbing to validate a relationship.\n\nI love this, it's perfect. Also a parent of a pansexual (adult) child, I'm definitely using this!",
                      "id": 183,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 160,
                  "content": "My catholic mother is the same. After an abusive relationship, my sister had a little while where she felt she was lesbian. I honestly dont know how to put it, so I hope that doesnt sound offensive or homophobic. But, my mother was absolutely supportive. So was my catholic father. When she came out the first thing they did was hug her and told her they love her no matter what and they will always support her. That her happiness is all that matters. THIS is what real Christians do.",
                  "id": 184,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "Gay child of a VERY CATHOLIC Mother here \n\nKudos to you for letting your child know early that whoever they are is OK. I can't tell you the internal struggle and pain you are saving them from.\n\nOP, I'm going to try and be as empathetic as possible in my response as I can. My Mom had a hard time and while it was rough for a 15 year old kid, after reading this, I want to call and tell her how much I love her and how proud of her I am.\n\nYou see, you don't get credit for trying to \"be a loving presence\" in your child's life. That should be a given. As hard of a time as my Mom may have had SHE took it upon herself to do the work. She knew it was HER issue. I didn't pay for her to go to therapy (a therapist who BTW seems to be coddling you). Your daughter hasn't done anything wrong. She's just being. It's on YOU to come to terms with the fact that antiquated beliefs are causing you to struggle with loving your kid for who they are and adjust those views. If you can't, you need to remove yourself from her life because every single time you don't accept WHO SHE IS you cause her pain. \n\nMy Mom went from \"Marriage is between a man and a woman\" to standing up as best person at a gay wedding (not my own). You can get there. You're just looking for any excuse not to. Own that if you won't change it and stop trying to get kudos for doing the bare minimum and balking when asked to do anything more.\n\nYou can not go to her wedding. In fact you shouldn't if you can't be supportive. However, know that this is probably where your relationship with her ends at least in any meaningful way. You won't get a second chance. She'll never forget her parents didn't love her enough to get over themselves, even if she does speak to you again.",
                  "id": 185,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "This is completely off topic but could you name a few of those books? I'm reading a lot to my son (2 years old), but mainly about vehicles, dinosaurs and cats and would love to incorporate other themes too!",
                  "id": 186,
                  "comments": [
                    {
                      "score": 23,
                      "content": "I honestly dont really have titles, for 2 reasons: \n\n1 we borrow them from our local library and I just walk around looking at the pictures to see if I agree with the message the book sends (we are in a mixed area between some very conservative Christians, some very liberal Christians and a load of non religious people/people of other religions, so some of the books are a bit too conservative for my taste) \n\n2: we don't live in an English speaking country and English is not our mother tongue (although my kids fully understand English and are able to speak it a little) so most of the books we read are in our mother tongue.\n\nI can recommend doc mcstuffins on disney plus though, I'm pretty sure that's internationally available. It's a show about an African American family, where mom is a doctor, dad is a stay at home dad, then there is doc and she has a little brother, they get an adopted sibling later in the show.\n\nThe main character is a little girl, Doc,  who is a toy doctor. She heals toys with all types of problems that also include situations that kids can face irl. Like one episode the toys get \"the glitters\" which is similar to having lice and its explained how to prevent it, but also not to exclude the person who gave you lice.\n\n Another episode there was a sort of earthquake in the toy village and doc needs to reunite the doll family. Which is a family with 2 moms who are also different colors. And the awesome part is it's not mentioned as something special. They are just the doll family and they need to be reunited after the earthquake. \n\nOne of my other favorite characters is a male action figure. He is super badass, goes on all these adventures, and he's in a wheelchair. There is more but it's just a really awesome, wholesome and inclusive show. \n\nI hope this helps.",
                      "id": 187,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "What Makes A Baby is an excellent book that explains how babies are made but does so in a way that is inclusive to all types of families. It's OK To Be Different is another good one. Todd Parr in general is great. I know you said you have a son but the Mighty Girls website has excellent book lists to cover pretty much everything.",
                      "id": 188,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "I'm Irish and my grandparents are Catholic, my grandad was 90/91 when we had our referendum to legalise marriage equality. He voted yes, \"because it's the Catholic thing to do\" to allow people get married if they love each other. OP and her husband need to get over themselves. Their poor daughter! Imagine your parents choosing not to come to your wedding...",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "You are the Catholic my folks strive to be! I am gay and was raised Catholic as well, and it took them some time but they're coming around and have always been supportive of my girlfriends. And they will definitely be coming to our future wedding. \n\nEmpathy and love is what Christianity is supposed to be about. Even if you're doing the whole 'hate the sin love the sinner's bs, they should still suck it up and go to the wedding.",
                  "id": 190,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 165,
          "content": ">you are supposed to love, support and encourage them to live their best lives. Maybe an actual parent can correct me on this. \n\nParent here as well. You are absolutely right. OP is a bigot who cares more about some bullshit belief than her actual daughter that she created.",
          "id": 191,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "Parent here and you are entirely correct. Also I'm sorry that you didn't get the family you deserved, and I'm glad that you know that they are the ones who are lacking, not you.",
          "id": 192,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "Parent here: I love my kids for who they are and support them completely. You're spot on. \n\nI've also not spoken to my mother in years. She didn't come to my wedding (different circumstances) and it was just one more thing in a long line of her showing me I wasn't important. So now we're happy without her.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Parent here. I can't fathom how anyone can embrace their child for years and then turn their backs because of who their child is.  \n\nI'm glad you are free and feel the love you deserve.",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "A parent here - you are correct, you love and support your children to be happy and content",
          "id": 195,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "“Dancing for scraps” OP DID YOU READ THAT???\n\nBecause you should.",
          "id": 196,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "My only child is gay and I can say this, I would be over the moon if he found someone he wants to marry and spend the rest of his life with. I've only ever wanted him to be happy because, you know, I'm his mom and I love him with all my heart. OP's way of thinking is abhorrent.  I will never understand anyone who treats others differently based on their sexual preferences or gender identity.",
          "id": 197,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Actual parent of a gay daughter here. I am murderously angry at OP right now, and saying what I’m thinking would get me banned. So I’m going to go hug my daughter instead.",
          "id": 198,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Raised Catholic. My entire extended family of devout Catholics attended my wedding, and my priest cousin gave us a blessing.",
          "id": 199,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3845,
      "content": "YTA. Your daughter is setting her own hard boundary, which is that people who don't love and support ALL of her will not have a role in her life. If that's the hill you want to die on, so be it, but it will be a self-inflicted wound.",
      "id": 200,
      "comments": [
        {
          "score": 926,
          "content": "LGBT people have learned that this kind of ultimatum is the best way of dealing with homophobic parents, both practically, and for the emotional wellbeing and mental health of the LGBT child. OP's daughter clearly loves her parents and did her best to educate them and help them balance their religious beliefs with their love for her. Ultimately, that effort failed. The hard boundary OP and her husband have is damaging and hurtful.\n\nAnd let's be clear. There aren't two truths here. There aren't two reasonably arguable sides. Homosexuality is objectively morally neutral. The Enlightenment happened, and after a few centuries of applying its philosophical tenets to the human condition, aided by actual science, we know better than outdated arbitrary theological directives allegedly handed to tribal peoples in ancient history magically and cryptically from unknowable and unseeable deities. And using such traditions to actively hurt others, especially those we \"love\" is not just wrong, but malicious. People are free to self-impose any eating, conduct, or sexual purity code on themselves that they wish, but good people don't apply them to hurt others. Ethics are objective and reasonable.\n\nYTA, OP.\n\nEdit: Thanks for the awards, kind redditors!",
          "id": 201,
          "comments": [
            {
              "score": 69,
              "content": "We are long overdue for a second Enlightenment",
              "id": 202,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Really beautifully stated.",
              "id": 203,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Well said. Commenting for the algorithm. Already gave away my free award...",
              "id": 204,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 113,
          "content": "This right here!  I hope your daughter finds a new family of her choosing that love and support here as she is.  YTA!!!",
          "id": 205,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "THIS! OP sees HER boundary as valid, but her child's as \"an ultimatum.\" It shows how much OP still fails to realize her child is an adult who can, and will, make her own choices. That choice may well be to cut OP and husband outta her life and SHE'S ALLOWED THAT! Just as much as OP is allowed to miss the wedding and neglect her child (which is abuse BTW.)  \n\n\nAdditionally; OP is so worried about respecting her husband, yet does she not see how she's being DISRESPECTFUL AF to her child's future spouse? Why is OP's husband more worthy of respect then her child's fiancé?   \n\n\nSuch hypocrisy in this OP, and all of it buried under \"her conscious.\" As if it's more ethical to emotionally neglect your child and reject her marriage then it is to accept a queer couple. One of these causes real harm, the other does NOT, no matter what the church may shove at you. YTA",
          "id": 206,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2354,
      "content": "An LGBTQIA+ Christian weighing in here. \n\nIt is quite clear that your views are prejudiced, and whilst I appreciate you have been trying to work with your daughter on this I do believe you are undoing all of that progress by not going. She wants you to be there for a moment when she makes a wonderful life long commitment to someone she loves. Because that is what it is. Love is love regardless of gender. God would never step in the way of what I hope will blossom into a beautiful marriage. How can you be against one of the most wonderful aspects of human nature? \n\nPlease go. She wants you to be there. She wants you to accept her and accept the person she loves. If you don't, then she will see that you'll never accept her for who she is and it will cause years of pain, especially on her part.",
      "id": 207,
      "comments": [
        {
          "score": 398,
          "content": "Yup. Err on the side of love.",
          "id": 208,
          "comments": [
            {
              "score": 132,
              "content": "Honestly, a great rule in all situations.",
              "id": 209,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Adding to this. Isn’t that what Christianity/ Catholicism is supposed to be about? Love? Doesn’t matter who you love. You support who others love too",
              "id": 210,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Tagging onto your comment in hopes it gets seen by other Christians either looking for resources for themselves, or folks looking for LGBTQIA+ supportive literature for Christian loved ones: [Walking the Bridgeless Canyon](https://smile.amazon.com/dp/B00OBXN80G/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1) by Kathy Baldock, a faithful Christian and follower of Christ, and also a tireless researcher and passionate educator seeking to undo the constant harm done to LGBTQIA folks by organized Christianity.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Honestly, she shouldn't go. Sounds like her and her husband will just ruin it with their views and prejudices. Daughter needed to walk away from them years ago, but I give her all the credit in the world. She exhausted all resources to facilitate a relationship them.",
          "id": 212,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "The question is, have they REALLY done any progress? Like this is too little for me to call progress. They are attending therapy for years now. I am so sorry for this poor girl.",
          "id": 213,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Not to mention there is significant theological evidence that supports that Jesus didn’t give a flying fuck about whether people were gay or not - translation errors are a bitch.",
          "id": 214,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2146,
      "content": "YTA. you and your husbands beliefs unfortunately are stronger than your relationship with your own daughter. when you stripe away all the BS of life(including religion) you might finally understand that your family means more than anything else. i hope you change you mind. \n\nAlso why do wives constantly support dumbass decisions by their husbands?",
      "id": 215,
      "comments": [
        {
          "score": 422,
          "content": "I’d scrap the family bit in favour of authentic human connection in general. Be it family, friend, your neighbour, hell, even the lady at the corner store who you buy milk from. We’re a unique species, us humans, and we’re squandering this potential for real connections we can make and experience as humans over such petty tripe like simple disagreements of the irrelevant turned into extreme tribalism (us vs. them/my side vs. your side).",
          "id": 216,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "They support their husbands because it’s engrained in them in their religion. The man runs the home. The man owns you. The man, the man. It’s wild how badly women want to be oppressed in religion.",
          "id": 217,
          "comments": [
            {
              "score": 21,
              "content": "I’d say it’s partly this, but also partly to shift some of the blame away from herself. Husband continuing to be bigoted makes her continuing to be a bigot a little easier.",
              "id": 218,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "I think OP likes to use the 'im supporting my husband' to make it feel less shitty that she is actively rejecting her own daughter by not going to the wedding... Its a cowards move rather than actually supporting husband, she uses that to not have to say her own homophobic opinion",
          "id": 219,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "It's part of OPs religion that she is lesser than her husband and to fear him. That is why she doesn't love her child. He husband has told her not to.",
          "id": 220,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "So agree!!",
          "id": 221,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Patriarchy/internalized patriarchy",
          "id": 222,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1741,
      "content": "I mean, you're a bigot, so yes, of \\*course\\* YTA. People like you stood against interracial marriage decades ago, for much the same reasons. What do they look like now? That's what you look like to us, and what you'll look like to pretty much everyone in a few decades time.",
      "id": 223,
      "comments": [
        {
          "score": 466,
          "content": "And that’s exactly what she’ll look like to the grandchildren she’ll never meet.",
          "id": 224,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 99,
          "content": "I'd have thought if there is a god they would have 'love your children' at the top of the 'good things to do' list? certainly above hating people for random fairly arbitrary reasons.\n\nI never got that with these religions nuts. why are you happy to have a god who just randomly hates people? doesnt that mean you're only 1 'wrong' personality trait or decision or attribute away from being hated also? wouldnt you want a god who is actually, like, loving?",
          "id": 225,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1260,
      "content": "YTA.   I love that you're trying therapy, but your daughter is right.  Your acting like there's some middle ground here.  The cold hard truth is you either accept her as she is, as her creator made her, or you don't.  If you don't, why bother?  If you do, than this is how you show it. \n\nThe middle ground exists in the not joining the parade, or not putting a pride flag on your house.  It is not \"I love my daughter, but it's weird and gross, and against my beliefs, so she gets a pass in theory, not in public.  I'll continue rejecting other Lesbians politely, and that's fine.  I won't change my church, habits, thoughts, actions that shows my constant rejection of who my daughter is, but that's ok because 'faith'.\".  \n\n\nUltimately you will have to choose if you accept this or not.   That is your choice to make.  Do you actually accept her, or not?  That is where she's expecting therapy to lead to.  That is the point of this.  Give the relationship every possible hope of succeeding.  Do you see yourself reaching acceptance of her as she is?  When?",
      "id": 226,
      "comments": [
        {
          "score": 220,
          "content": "What's funny is OP and her husband ARE her creator...\n\nShe is as she is due to the genetics they gave her...",
          "id": 227,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "It's sad because OP is not accepting of her daughter's life over something banal that she has been taught in church. I know christians love to spout, 'but homosexuality is a sin, therefore I don't want my loved one going to hell'. It's one line taken out of the Bible that these people use to not accept someone who was born differently than they were. The Bible has hundreds of things that are 'not acceptable', like wearing mixed materials, or not being a virgin on your wedding night, yet this one thing they cherry picked to use as an excuse for not being a tolerant and accepting human being of someone who isn't like them.",
          "id": 228,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}