{
  "post content": "I pack my husbands lunch every morning before he goes to work. I’ve been doing it for almost 30 years. I usually try and mix it up so he doesn’t get tired of the same stuff. \n\n\nWell I tried experimenting with some particularly healthier things. I sliced him apples, and made special apple dip (which is admittedly not very healthy but he loves it) to go with it. Cut up pineapple, watermelon, and cantaloupe, with unhealthy syrup, strawberries, and grapes to make a fruit salad. But I guess I forgot the fork. \n\n\nAnd he must’ve had a bad day - cause he let me have it when he got home. He gets upset sometimes. But not like that. \n\n\nAlthough he seemed genuinely upset. Apparently the syrup made his hands sticky and he had to use his hands cause of no fork. And he just yelled about how I was to incompetent to properly pack his lunch.\n\n\nSo I told myself I’d quit waking up early to make him breakfast, pack his lunch, and kiss him goodbye. Also since I’m so incompetent I  decided to just make microwaveable TV dinners from now on. I’m also to “forgetful” so I figured I’d just forget to clean up after my 50 year old husband. Who’s spent the past 30 years letting me do it.\n\n\nBut i basically became someone who just laid around. And although he yelled at me and belittled me in front out family. Me holding onto it seems immature. It lasted about 2 weeks. Before he finally admitted that he takes me for granted. I’m happy. But also feel kind of like an a hole since i intentionally made his life miserable.\n\n\nI’m 48, and he’s 50. We’ve been together for 30 years, and married for 28. \n\n\n**We both work full time**\n\n\n**I’d like to say that I appreciate everyone who took the time to reply to me. I Hope you guys have a great rest of your day. And thanks for not just ignoring it. It means a lot to me. So thanks.**",
  "id": 1,
  "comments": [
    {
      "score": 9632,
      "content": "NTA\nHonestly, your husband sounds borderline abusive in this post...\nFirst, he went off on you because you forgot a fork ONE time! \nThen he yelled and belittled you in front of family? 🚩🚩🚩\n\nGood for you that you showed him just how much he relies on you, but is it going to change anything? Will he be more respectful towards you now? \nBecause I honestly feel that is the big issue here.\n\nThe fact you are left feeling like TA after being yelled at and belittled for standing up for yourself is very telling.",
      "id": 2,
      "comments": [
        {
          "score": 1773,
          "content": "And there are so many things that you can use as an fork. And for little fruit slices it mustn't even be sturdy, so probably even a bended paper-clip can work. He just wanted a reason to go mad at OP. If it wasn't the fork, it would have be something else. He is an asshole with no anger control. \n\nNTA",
          "id": 3,
          "comments": [
            {
              "score": 893,
              "content": "I mean, if they are fruit slices… why didn’t he just use his fingers to dip the fruit in the apple sauce?! Like how you would dip fries into ketchup. How did he manage to get syrup on his hands unless he eats like a toddler?",
              "id": 4,
              "comments": [
                {
                  "score": 1527,
                  "content": "And,  I  don't know. Maybe WASH HIS HANDS afterwards? Is he a baby? Is he completely incapable of cleaning himself up???",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1177,
                      "content": "you didn't pack wipes and a PACIFIER??!!",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 200,
                      "content": "Even a splash of water from a bottle or drinking fountain would do in a pinch. I’ve even used condensation from a soft drink or an ice cube with the cola licked off when really desperate.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 88,
                      "content": "Clearly he is.\n\nOP, you're NTA. You're rather brilliant for going on strike. You unionized yourself. 💪💪💪",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "I wanted to recommend this really cool thing where I am! It’s hard to describe - kinda .. what’s the word? Liquid?? Like .. it’ll come to me.. gimme a minute.\n\nOh yeah!!\n\nWATER!!\n\nHas your husband heard of it? It’s miraculous! You .. pour over your hands, and they’re not sticky anymore?? Kinda like magic!!!",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "For the past 30 or so years... Yes.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 183,
                  "content": "Excluding the apples, I believe the fruits were mixed with the syrup (similar to how a potato salad is mixed with the dressing) so I can understand how he got syrup on his fingers if he had absolutely no options for an eating utensil. Not that it excuses his attitude or means that he couldn’t just wash his hands and continue with his day.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 152,
                      "content": "You’re correct about the apples being separate from his fruit salad.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 44,
                      "content": "Even then, use the two fingertip method like an adult. What, was he feeding himself by the fistful like my 2 year olds?",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 34,
                      "content": "[deleted]",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "\\> he couldn’t just wash his hands and continue with his day.\n\nBecause, in that case, he wouldn't have had an opportunity to scream at you. This was never about the sticky fingers, this was about having an opportunity to have power over you.\n\nI'm sorry to say this, but if you're in a relation where your partner treats you incredibly harshly for things that can be easily resolved on their side: we call that an abusive relationship.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Or, even, don't eat the fruit salad, and get something not sticky to eat.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 105,
                  "content": "“Guess I’ve gotta put my whole hand in this caramel dip, it’s the only solution”",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "OP said she cut up a lot of other fruit and made a syrup for it....",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "That and if you're really hard up you can drink apple sauce rather than use your hands.\n\nNTA",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 157,
              "content": "Oh my god the fact that a 50 year old man couldn’t solve a “forgot the fork” problem is so…\n\nI am just picturing a full ass adult sitting there with a cup of caramel dip and no fork looking around the room helplessly before sticking his fingers into the dip cup because he can’t figure out another solution.\n\nCan you imagine? Can you IMAGINE?\n\nI keep thinking of Filliam H Muffman in Pleasantville standing there “where’s my dinner?”",
              "id": 20,
              "comments": [
                {
                  "score": 51,
                  "content": "But he called out ‘honey I’m home!’ And then dinner didn’t appear. ‘‘Twas most irregular",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "YESSSSSS",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 140,
              "content": ">And there are so many things that you can use as an fork.\n\nProbably the sensible thing to do would've been to say, \"Oops, looks like lunch got fucked up today.  No biggie.\"  And then just buy lunch that one day.",
              "id": 23,
              "comments": [
                {
                  "score": 139,
                  "content": "Or go into the break room junk drawer and grab a utensil…go to a deli nearby or a cvs…\n\nI can’t imagine a situation where he couldn’t acquire a fork that would also allow for someone with such poor problem solving skills.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 21,
                      "content": "This is exactly my thought. If there are no forks in the husband's workplace, either go to the nearest grocery store and buy a cheap package of plastic ones or go to McDonalds or Dunkin Donuts (or whatever is nearby)  and grab one.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 38,
                  "content": "Unless he works in an environment like I do. You bring lunch or you don't eat. There is no place to buy lunch. There are no eating utensils. It is a warehouse that is surrounded by other warehouses.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 217,
                      "content": "You still can act like an adult and use critical thinking skills and common sense to solve the problem.",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 91,
                      "content": "It may not be polite, neat, or even efficient, but any food can be eaten without utensils. If it can’t be picked up, it can still be scooped or poured.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 80,
                      "content": "Or he could do the adult thing and keep extra utensils and wet wipes at his work station or locker. Not scream at his wife because she doesn’t micromanage his entire domestic situation for him.",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 24,
                      "content": "No one in your warehouse has a spare plastic takeout fork in their desk or locker?",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "Even if there were no options to get food anywhere (which I highly doubt), then he would not have eaten one part of his food. It's not like OP only sends him with a fruit salad, so he had whatever else there was still.",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 0,
                      "content": "No food delivery?",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 69,
              "content": "He is gainfully employed, and I am positive he is a different person at work (or he'd have been fired yonks ago) so he totally has control over his anger - he just lashes out at OP when he wants to throw a tanty like a kid.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I’ve never worked in a place where there aren’t at least plastic take out forks chilling in the break room for emergency use. He didn’t find a solution because he’d rather yell at his wife. Abusive ingrate.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "~~OP said this is a first for him so this comment just seems silly to me~~ \n \n \nMy comment was a shitty take and completely inaccurate.",
              "id": 35,
              "comments": [
                {
                  "score": 98,
                  "content": "She also seemed quick to brush off his attitude as a bad day in the office.\n\nYou don't do that if it's the first time in 30 years.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 18,
                      "content": "My husband and I have been together for 20 years, married for 16, and I’d be making him an appointment with a neurologist if he did this. Not assuming it was a bad day at the office.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 45,
                  "content": "Actually she said this is the second time he’s gotten mad over lunch but also that he gets mad at her over a lot of things…",
                  "id": 38,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Oh I have really bad comprehensive reading skills and tend to just skim and hope for the best. Sorry, your point makes perfect sense now that I have more context.",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "She's way too used to it",
                  "id": 40,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Most adults can also figure out where to get a fork if needed. His workplace doesn't have a cafeteria or a pantry with a stock of them? If not, he doesn't know where the nearest fast food restaurant or grocery store is to go in and get a plastic one? \n\nNTA. He can pack his own lunch from now on.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -11,
              "content": "Using random shit as a fork doesn't sound very hygienic",
              "id": 42,
              "comments": [
                {
                  "score": 23,
                  "content": "Well then the solution is he packs his own lunch.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Neither does using your hands but here we are!",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "You can wash this \"random shit\" as you should wash your hands before using them to eat with them. And who didn't put a pen or something something else un-/conscious in their mouth?",
                  "id": 45,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Well I presume if he had access to a sink his hand getting sticky wouldn't have been an issue",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 134,
          "content": "If the worst thing that happened to him all day is that the person who packed his lunch, SO HE DIDN’T HAVE TO, forgot a FORK, he had a better day than at least a couple billion other people. \n\nHe needs perspective and a sense of gratitude. And anger management. \n\nNTA.",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 78,
          "content": "Also now that i think of it. Do they not have a break room with spoons and forks cause mine does. He should know if he works he still needs to provide for himself. NTA",
          "id": 48,
          "comments": [
            {
              "score": 61,
              "content": "My work does not provide forks or spoons.  I keep a supply in my desk drawer so I am not caught without because I am an adult and take responsibility for myself.",
              "id": 49,
              "comments": [
                {
                  "score": 19,
                  "content": "Yeah I was about to say I keep a set of my own utensils in my cabinet. My break room may not have utensils for all of us but it does have a sink. Seems like an easy fix instead of bitching your wife out who made a genuine mistake.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Ive never thought about that sorry : ( i always thought break rooms had utensils",
                  "id": 51,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Ours closed during Covid so no use of company dishes now. \n\nThat being said, unless they are out in the middle of nowhere he could probably figure out finding a utensil and honestly maybe keep a few forks in the truck if this is such an issue. Buy a pack of disposable ones from the grocery store and leave it in the glove box.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "My office doesn't have a break room. We have cutlery in a tub on the filing cabinet and a tiny kitchen that two people can stand in but you have to sort of sashay around each other.",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I do this too.  I'm a teacher and don't always make it to the staff room (where there are utensils) on the other side, so I have some in a cabinet, because sometimes my husband - who kindly packs my lunch - forgets my fork.  I tell him when he does, so he knows to send an extra for my cabinet.  I wouldn't otherwise, because he freaking PACKS MY LUNCH EVERYDAY!",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Not all jobs have break rooms. Sounds like he was some place that didnt even have hand washing facilities. He could work outdoors.",
              "id": 55,
              "comments": [
                {
                  "score": 2,
                  "content": "Even so, he should keep a packet of hand sanitizing wipes to clean his hands after he eats.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "The worst part is almost that it took him TWO ENTIRE weeks to notice he screwed up. And that was not because he really meant it, I highly doubt that, but because he had to take care of shit himself. \n\nIt'd be bad enough if he had an emotional outburst at OP for shit not related to her, but realized he did wrong after calming down and proceeded accordingly, but taking this much tim to budge a tiny bit just so OP continues her maid duties..? Ugh. \n\nI'm enraged for OP, honestly.",
          "id": 57,
          "comments": [
            {
              "score": 19,
              "content": "I seriously hope OP is reading the comments seriously, she may think her current situation is great but her marriage just sounds sad.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "Now that you have both learned that he doesn’t appreciate everything you do for him, it’s time to implement some big changes. He makes his own lunches, makes meals half the time, cleans up after himself, etc.",
          "id": 59,
          "comments": [
            {
              "score": 13,
              "content": "Half the time? Fuck that. He makes all his own food now.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "I am 63, and lots of my friends were raised to believe it was THEIR JOB to wait on men.  Even if both husband and wife worked outside the home.  My husband's grandma and mom definitely felt like that, and it caused a lot of tension and resentment on my part, because I don't buy it.  What's the point of a spoiled husband and a burnt-out wife?\n\nIf you work outside the home, your husband has to share household duties.  But the real issue here is that he's spoiled and demanding, with a bad temper.  You absolutely did the right thing to \"go on strike.\"",
          "id": 61,
          "comments": [
            {
              "score": -12,
              "content": "I am 15 years younger than you. But I was also raised to, *find a good husband*. Basically to protect my husbands ego and reputation at all costs. I don’t fully believe it. But I realize that I subconsciously do everything my mom and grandma did for their husbands. I play the role player to his superstar.",
              "id": 62,
              "comments": [
                {
                  "score": 27,
                  "content": "I'm not going to mince words here.\n\nWith the way he treats you, I'd say you're closer to a lowly towel boy servicing the angry, lazy, self-appointed team captain.",
                  "id": 63,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": ">But I was also raised to, *find a good husband*. \n\nObviously not, or you didn't pay enough attention to how a good husband should be. \n\n>Basically to protect my husbands ego and reputation at all costs. \n\nNope, that's not how the wife's job description sounds... \n\n>I play the role player to his superstar.\n\nThis is just wrong and sad on so many levels... When do you get to be the superstar? Why would you have to live your life in someone else's shadow? Instead of living by their side as an equal?\n\nPlease listen to CrochetBeth's comment above yours!",
                  "id": 64,
                  "comments": [
                    {
                      "score": -17,
                      "content": "I don’t mind playing role player to his super star. Think, *good woman behind the great man*. Seeing him succeed truly brings me joy. I don’t expect anyone to understand. But I genuinely see him as my other half.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "A.  Is he really a \"good husband if he gets angry as much as you said he does\"?\nB.  I was raised mormon but I changed and got better.  \"I was raised X type of way\" doesn't really mean anything.",
                  "id": 66,
                  "comments": [
                    {
                      "score": -5,
                      "content": "A. It isn’t THAT much. B. That may be true. But I have no issue doing everything, just didn’t appreciate getting berated over a fork.  I don’t see an issue with traditional gender roles honestly. For most of our relationship my husband was the paycheck and I was the stay at home mom.",
                      "id": 67,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "For real. Similar experience here but smaller level about a couple of years ago (pre-pandemic). Got home from a busy day and my live-in-bf (who was home all day), complained at me for not leaving him a sandwich in the fridge for lunch before I left.\n\nGranted it wasn't in front of my family, but at the same time I was thinking 'Seriously? It's not like we were out of bread and  sandwich filler options a plenty. You couldn't put stuff together between two slices of bread?'\n\nHe's now an ex bf, and OP is NTA",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "👀 my husband never gets a fork or spoon with any lunch I pack. He can grab it himself",
          "id": 69,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 0,
          "content": "This isn't a couple with a couple months under their belt.... they have decades. \n\nSometimes things boil over,  she seems to have a good handle on dealing with it and putting him back in his place.  If this was abusive,  she wouldn't be doing what she said in response to his behavior.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -9,
          "content": "Hahaha, always the way in this sub. :O, he lost his temper on one or potentially two occassions??!?! ABUSE ABUSE RED FLAG DIVROCE REEEEEEEEE",
          "id": 71,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3396,
      "content": "[deleted]",
      "id": 72,
      "comments": [
        {
          "score": 563,
          "content": "Vacation is a good word for it.\n\nAlso, sounds like there's a story behind that username. Currently have a ball of fluff flopped on my lap who's curious.",
          "id": 73,
          "comments": [
            {
              "score": 70,
              "content": "[deleted]",
              "id": 74,
              "comments": [
                {
                  "score": 14,
                  "content": "😂 I'm sure half my upvotes were because of that more than anything.",
                  "id": 75,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 316,
          "content": "This. I felt so bad for OP. \n\nShe works full time, and went out of her way to make her husband lunch for 3 decades. The one day he cannot adult enough to figure out how to get his own fork, he instantly resorts to insulting, yelling at, and trying to publicly shame OP. \n\nThis man sounds lazy, ungrateful, and has taken his attentive and caring wife for granted. I mean, sounds like he never had to clean up after himself or cook for himself since OP has been doing it since they were in their late teens.",
          "id": 76,
          "comments": [
            {
              "score": 135,
              "content": "His mommy did it and then he married a new mommy. If anything happened to her he would be shit out of luck and might starve.",
              "id": 77,
              "comments": [
                {
                  "score": 14,
                  "content": "Nah he'd just replace her, probably with a younger model, in a year or so. We've all seen this movie.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 2,
                      "content": "True true.  Someone younger who had a shitty childhood and thinks they are being taken care of when really they are being manipulated and abused.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I have no idea why a woman who also works full-time packs her husband's lunch like he's a 5-year-old. Or why she would do that for thirty fucking years.",
              "id": 80,
              "comments": [
                {
                  "score": 1,
                  "content": "Maybe because she loves him? My mom is happy packing my dads lunch and hers. She is a waitress and he is a chef at two different restaurants lol, they both work full time, and he doesn’t get mad if she doesn’t want to one day/too tired to. It’s just how some peoples relationships work.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "Also curious about the username lol",
          "id": 82,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1169,
      "content": "Wait what? You feel like an a hole? He called you incompetent for 'not packing his lunch right' he's a grown ass man. He can pack his own lunches if all the effort you make for him isn't sufficient. He does know that sticky fingers can just be washed away with water and soap right?\nYou are definitely NTA here.",
      "id": 83,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 938,
      "content": "NTA\n\nSomeone who can't figure out how to get a fork because he has had everything done for him for 30 years needs a wake up call.  You didn't make his life miserable, he did that.  One really can't go through life being that incompetent that he can't walk down to the cafeteria and get a plastic fork.  Thing is that if someone went off on me like that, for something that trivial, they would be packing their lunch for the next 30 years.",
      "id": 84,
      "comments": [
        {
          "score": 158,
          "content": "Seriously, how complicated is it to have a set of fork and knife at work ? Ooh but then he probably would need to clean them which I am sure he never does.",
          "id": 85,
          "comments": [
            {
              "score": 180,
              "content": "Or just wash his hands afterwards?\n\nI just can imagine this guy spending a whole day angry because his hands were sticky, getting more and more mad every time he touched something.",
              "id": 86,
              "comments": [
                {
                  "score": 90,
                  "content": "I mean, does he not wash his hands after he goes to the bathroom? If he does why not just do it for sticky fingers? If he doesn't that's just fuckin gross.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 91,
                      "content": "I get, that's why he was so mad!\n\nHis hands got stuck to his dick and he had to walk around holding it all day at work.\n\nLuckily it was raining or he'd never have been able to drive home.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "A lot of guys don’t wash their hands after the bathroom",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "Sitting at his computer with his hands sticky and holding them up like a surgeon after scrubbing  in… shrieking impotently ”MY PROBLEMS ARE INSURMOUNTABLE!!!!”",
                  "id": 90,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "It's not hard to find a fork but when then, he could have just washed his hands if they were sticky.",
          "id": 91,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 496,
      "content": "My mum used to wake up early and iron my dad's shirts for work.\nOne time he didn't like the job she did and got mad about it.\nMy dad ironed his own shirts from then on.\nMy mum's a boss. Be like my mum.",
      "id": 92,
      "comments": [
        {
          "score": 317,
          "content": "Yeah, I USED to cut my husband’s hair. One time he examined the result, told me I missed a spot, so I went back to try and fix it. Well, he wasn’t satisfied with my fix, got upset and grabbed the razor saying he’d do it. He shaved the spot bald and flipped out at me. I walked away and told him I’d never cut his hair again.\n\nThat was four years ago, and even though he apologized and asked me many times to cut his hair, I’ve held firm.",
          "id": 93,
          "comments": [
            {
              "score": 21,
              "content": "Well done! One time of this is more than enough! 😆👍",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "I think everyone needs to be like your mom.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "This.  OP should stop making his lunches, permanently.  If they are both working full-time, why is he the only one to have his lunches made for him?  Who is making her lunch?  I don't understand why he is deserving of extra special treatment that he clearly isn't even grateful for, when she is getting nothing in return.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "My Dad irons his own shirts too for this exact same reason.",
          "id": 97,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 353,
      "content": "NTA\n\nHes an adult, not a baby. It’s not as if you did an atrocious thing, you forgot A FORK, one time. It happens. He went off on you probably because he had other frustration which is also beyond wrong.\n\nI’m all up for these ways to show people that being a stay at home parent IS a full time job, because it’s so often dismissed and taken for granted. I’ve heard so many people say “oh, X just stays home all day” but “staying home all day” involves a lot of work that goes unseen sadly.\n\nTHAT SAID, I think now that things have calmed and he has, hopefully, see that your “help” is actually you fulfilling essential tasks in his life, I think is time to have an honest, open, and adult conversation about the real issue here. Otherwise this will just happen again.\n\nBest of luck!",
      "id": 98,
      "comments": [
        {
          "score": 331,
          "content": "Just to add: I’m not a stay at home parent anymore. I’m a secretary. Our daughter has moved out already.\n\n\nThanks. I Hope you have a good sunday.",
          "id": 99,
          "comments": [
            {
              "score": 549,
              "content": "Wait, so you do everything around the house, you also have a paying job outside the house, and he snapped at you OVER A FUCKING FORK?!?!?!!??!!?!??! \n\nI'm taking a couple of breaths typing this because honestly I want to scream at his face. So sorry that you're still taking care of a baby after your daughter moved out. \n\nWish you the best and next time, he can prepare his own stuff like a grown up adult, you have a lot on your plate.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 323,
              "content": "Would you be okay with your daughter dating someone who treated her the way your husband treats you? Would you tell her to put up with the verbal abuse?",
              "id": 101,
              "comments": [
                {
                  "score": 18,
                  "content": "Great point! 👌",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 56,
              "content": "I feel really deeply sorry for you if you think that working full time and doing everything for this man while he berates you is an acceptable future.",
              "id": 103,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": "I am so sorry you’ve had a husband like this for so long. He should have ALWAYS been doing half the household stuff, and that obviously includes making his own damn lunch.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Let him know now that when you both retire from your out-of-the-home jobs, you are retiring from your unpaid at-home job, too!",
              "id": 105,
              "comments": [
                {
                  "score": 3,
                  "content": "Fuck that, do it now. Clearly he has a LOT of catching up to do. He can do all the housework and make HER lunch every day for the NEXT 30 years.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Your husband sounds like a sucky partner. I hope your daughter recognizes that and doesn’t get stuck with an ungrateful AH for a husband for half or more of her life. I feel sad and frustrated for you.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 122,
      "content": "NTA! You weren’t really trying to making him eat healthier and him snapping at you was definitely uncalled for. Also, showing him how much he relies on you doesn’t make you an asshole in the least, I hope you continue to stand up for yourself even if he’s your spouse of 30 years",
      "id": 108,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 104,
      "content": "NTA. You’re presumably late 40s/early 50s. You’ve been with hubby for at least 30 years. By this point I have to assume that you know exactly how to communicate in a way that will make him pause next time he considers behaving in this way - some people don’t take “talking it through” to heart and action works better. Or non action in this case lol! \n\nYou did what you had to do, he’s learned his lesson. Don’t beat yourself up for 2 weeks time-out out of 30 years.",
      "id": 109,
      "comments": [
        {
          "score": -3,
          "content": "With the way they both reacted? I highly doubt they have good communication skills with each other.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 91,
      "content": "Info. \n\nHe admitted he needs you. \n\nDid he apologize? \n\nIf so was it sincere?",
      "id": 111,
      "comments": [
        {
          "score": -125,
          "content": "He didn’t technically apologize. He expressed that he would really appreciate it if I would forgive him and, “go back to the way things were”. He was having to go out of his way to buy lunch everyday and didn’t like it. \n\n\nSince he can’t cook, and didn’t seem interested in taking the time to pack his lunch. But I stopped grocery shopping so there wasn’t even any snacks for him to take anyway.He was tired of the microwaveable TV dinners, and pop tarts for breakfast, and so he just said he would really like it if I went back to the way things were. Which is his way of apologizing. \n\n\nI do feel bad for causing him the extra grief. It may seem minor. But he’s 50. And we’ve been living together since he was 20. And before that his mom did everything for him. So he’s never actually had to do anything but go to work. Literally everything else is done for him. Everything.",
          "id": 112,
          "comments": [
            {
              "score": 350,
              "content": "This is not an apology..  don't let it go back to the way things were. He didn't even have the decency to say \"I'm sorry for how I treated you\" He doesn't care how poorly he made you feel, he only cares about how it's affecting him.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 168,
              "content": "Not an apology. An apology should look something like..... \n\n**I'm sorry for XYZ, I won't do it again. **\n\nAnd then following through with the change required to make sure you don't.",
              "id": 114,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 135,
              "content": "That’s not apologizing, that’s guilting you into doing things his way. I sincerely hope that you can find a counselor or someone to help support you. It really sounds like an abuse situation. You have so much life left, don’t feel like you have to give it to him.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 77,
              "content": "Are you satisfied with his apology? \n\nIs your only issue with yourself that you perceive yourself as lazy? Is that why you’re asking if you’re an asshole? \n\nIt’s pretty clear that he is the asshole for having a tantrum over a fork. I sense a lack of respect here, you are worth more than a fork and a tidy house. \n\nI struggle to be objective with the very traditional gender roles that are in your marriage. But. My 38 year old neighbor had a similar marriage and they are happy.\n\nAre YOU happy? Outside of viewing yourself as lazy, are you happy? \n\nNTA",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "[deleted]",
              "id": 117,
              "comments": [
                {
                  "score": 33,
                  "content": ">don't settle for anything less.\n\nIt took him TWO WEEKS to get to this non apology. That's unacceptable.",
                  "id": 118,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": " \"I'm sorry that I took you for granted, and that I was rude to you. *How can I help make things easier for you in the future?*\" He needs to add that. He needs to make it clear that he's going to pull his weight and not leave everything to you.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 55,
              "content": "It seems that both of you are avoiding having a direct conversation and just trying to rugsweep. Only you can decide what you are willing to tolerate, but if he can’t conjure up the words “I’m sorry” you have bigger problems than pop tarts and microwave meals.",
              "id": 120,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 51,
              "content": "Have some fucking self respect and tell him he needs to actually apologize to receive forgiveness. Stop making excuses for him and accepting his horrible treatment of you.",
              "id": 121,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 47,
              "content": "My children are 9 and 11. They have lived with me (mom) their entire life. I do everything for them. They only have to go to school. Everyday they have the same lunch, it includes yogurt and applesauce. So they need a spoon. Sometimes I forget the spoon. I only know I have forgotten the spoon if I happen to unpack their lunch and notice it is missing. Why? Because when I forget the spoon my *young children* figure out a solution and go about their day. They don't even mention it because it's not a big deal. There is no excuse for your husband behavior.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "So instead of apologizing he said ”I really want you to be my mommy again!”\n\nLady, you are not married to an adult. Please take a step back and realize that your value lies in much *mych* more than just domestic chores. \n\nI say no more packing his lunch, he cooks dinner every other day (**cooks**! No ordering in!), and all chores are split between you. If you do laundry, he does floors (vacuum and mop), one of you take kitchen, the other the bathroom. And don’t come saying he doesn’t know how! He can learn like the rest of us did",
              "id": 123,
              "comments": [
                {
                  "score": 10,
                  "content": "Not to mention that if he can't figure something out on his own, nowadays there are YouTube tutorials for everything, so no excuse to not do something.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "He did not apologize!\n\nI'm his own way is enabling bullshit.\n\nI am sorry. I have taken everything that you do for granted. I fucked up. This is how I am going to be more appreciative in the future. Yelling at you was unacceptable and I do not want to be that person.\n\nYou didn't cause him grief! He caused himself grief by CHOOSING never to actually lift his own weight in this partnership. He has been riding your coat tails and absolutely never returned any of that favor.\n\nWhy do you think you're worth so much less than him.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 78,
      "content": "NTA. You were the victim here.",
      "id": 126,
      "comments": [],
      "relation": "Support"
    }
  ]
}