{
  "post content": "\nI (single mom of 2) hired a babysitter after I started working a new job (used to do wfh for 2 years).\n\nMy kids are 8 & 6. The babysitter is 17. she brings her laptop with her to study which is perfectly ok with me as long as she keeps an eye on the kids.\n\n\nYesterday, I came home and the babysitter showed me her laptop that got broken by my youngest. I was shocked I asked how this happened, and she said that she left the laptop in the livingroom and went to make the kids lunch but my youngest grabbed it and ran with it til he dropped it and broke the screen. I said that was horrible and apologized to her but stated it was her fault for leaving the laptop within reach of children. She said she thought my kids were old enough to know not to touch others stuff. I explained how they might have thought it belonged to us since it was in our house. She asked if I could pay for it to get fixed but I refused and insisted it was her problem not mine. She ranted about having exams soon and not having enough money to get it fixed. We argued and I had to tell her to go home after she presisted.\n\nLater on, I got a call from her dad basically blaming the whol thing on me, and demanding I pay to get the laptop fixed but I still refused. now she's refusing to come again unless I pay her for the laptop repair even though I paid her in advance to watch the kids.",
  "id": 1,
  "comments": [
    {
      "score": 46219,
      "content": "YTA. A 6 and 8 year old are absolutely old enough to know not to touch/run around with other people's electronics. Signed, Mother of a 6-year-old.",
      "id": 2,
      "comments": [
        {
          "score": 9641,
          "content": "Agreed as a mother of 5 and 8 year olds.",
          "id": 3,
          "comments": [
            {
              "score": 4402,
              "content": "Yup. I have kids the same age and they know better.",
              "id": 4,
              "comments": [
                {
                  "score": 3642,
                  "content": "I have a developmentally delayed 5 year old nephew who can be A Lot.\n\nHe knows better. He doesn't always do better. But he knows when he's being naughty. And most of the time he does do better.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 730,
                      "content": "I work with kids on the spectrum, they all know not to touch computers or iPads if they don’t have permission and half of them don’t even communicate by speaking.\n\nHell, I knew better when I was a small autistic/adhd kid who couldn’t speak. OP owes her babysitter money.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "I like how instead of “challenged” you said “delayed” because that sounds more correct",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "I have a two and four year old that know not to touch their older sister’s laptops.",
                  "id": 8,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "As a auntie to a 6, 8 and 11 year old... they all know better and would never run off with and of my electronics, even if I brought it over to their house. YTA and you need to pay for that laptop, ASAP as this poor kid has EXAMS!!",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "agreed as a 22yo guy with no kids",
              "id": 10,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "Agreed as a babysitter who's been watching kids of all ages for over a decade.",
              "id": 11,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Same, but mine are 3 and 6. \n\nOP, YTA and good luck ever getting a sitter again.",
              "id": 12,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "I'm so curious to know whether in these AITA threads where the response is overwhelmingly YTA, does the OP change their course of action? Like, after reading 1,000 people telling her she needs to pay for the laptop does OP cave and pay for it? Or does she walk away with both fingers in the air?",
              "id": 13,
              "comments": [
                {
                  "score": 16,
                  "content": ">Like, after reading 1,000 people telling her she needs to pay for the laptop does OP cave and pay for it? Or does she walk away with both fingers in the air?\n\nMost likely the second option. Assholes generally don't like being told that they're being assholes.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Would be fun to know lol",
                  "id": 15,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "My two and three year olds know better!",
              "id": 16,
              "comments": [
                {
                  "score": 12,
                  "content": "Yep, my 3 year old understands not to touch computers",
                  "id": 17,
                  "comments": [
                    {
                      "score": 10,
                      "content": "As does my 4yo",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Agreed a mother of a 2, 4 and 7 year old.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Agreed as a kindergarten teacher",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "2, 4, and 9 here. My 4 year old knows better than to take and run with things that aren't his. 2 year old - not so much.",
              "id": 21,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "As a former 5 and 8 year old, i concur. \n\nIm kind of an expert on the matter.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3510,
          "content": "My 2 & 3 year old know better as well. They have their own toy cellphones and \"tablets\" to play with. Touching a grown-up's device without permission beforehand is a strict no-no. They sometimes forget because they're so little, but they know the rule and that breaking it comes with a gentle warning or with consequences.\n\nAlso, I'm concerned that OP's excuse was \"they probably thought it was ours.\" If your kids regularly treat expensive things so casually just because they're \"theirs,\" then that's a much bigger issue. 6 & 8 are old enough to know how to treat their things with care and proper handling.",
          "id": 23,
          "comments": [
            {
              "score": 632,
              "content": "Exactly this! When I was a kid, my parents made sure I knew how to handle electronics carefully before I was allowed to touch anything expensive. If I broke something at home being reckless, the money for repairs came out of my allowance. By 6, I was responsible enough to have my own Gameboy, and kept such good care of it that I was able to sell it to a collector during college. The rule was always that they bought the device for me, not the right to have a device that always works; if I broke it, I had to wait and save up my allowance money for repairs, or ask for a replacement at the next holiday. We didn't have communal electronics in our family, to avoid this situation.",
              "id": 24,
              "comments": [
                {
                  "score": 22,
                  "content": "IKR? When I was six I walked home from school and had to stay at home for a few hours because my mother worked and there was nobody to look after me. If I broke anything, she would've crowned me. \n\nOP: YTA. Teach your kids not to destroy things. Maybe then things like this wouldn't happen. It is your fault that the laptop got broken because she rightfully thought at their age they wouldn't do something like that. \n\nPay up! I don't blame her a bit for not wanting to babysit for you again. I was a busy babysitter when I was younger (I started at age 12 but it was a different time) and I was responsible for kids all the time. I wouldn't have considered any of the kids I looked after at that age to do something like that.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Honestly, I babysat for a couple of families with kids that I would totally expect to pull this kind of nonsense, but the difference is that those families were well aware of their kids' behavioral issues, warned me about it ahead of time, and compensated me really well for the extra trouble. One family let me make a profile on their family computer just so i wouldnt need to risk my own electronics at their house. I handle 'problem children' pretty well for some reason.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "We had a similar rule. So my parents could pretty much afford anything a kid might ask for. My mom also didn't see the point of saying no arbitrarily. So there was basically only one toy we couldn't have: one she had already bought. Mom told us many times (and enforced) that if we lost or broke a toy, that was it; she always said that **objects deserve respect**. She told us openly that she didn't want us to get spoiled, that some ppl who have lots of things lose sense of their value.\n\nI don't even know what mom would have done if i broke someone *else's* things.\n\nThis paragraph is just me reflecting on and being grateful for the incredibly healthy attitude toward material things i was taught. I had the privilege not to stress about them, but the wisdom to enjoy it. sometimes ppl praise my resulting perspective for what they perceive as a lack of materialism, ppl say oh good for you realizing things aren't important. But it's actually hardcore materialism, appreciation of objects. \"New\" things aren't better than old things, a purchase isn't a high that wears off. I bought excellent boots a year ago and every time i wear them i feel happy i still own them, that they aren't lost or broken yet. Actually i like my old things best cuz there are fewer unknowns. The downsides of a new thing are responsibility for it, less flexibility (nonliquid assets), and less attention left for whatever you already own; but i rly enjoy finding something worth buying. (I also think \"money can't buy happiness\" is a lie we parrot to shift focus away from wealth disparity.)\n\nTldr i am a more content, generous, thoughtful person thanks to my mom. YTA cuz... What are you teaching your kids rn? They have disrespected objects and people.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I remember being a little kid and getting in trouble for breaking a $10 landline phone. I learned very quickly to NOT BREAK THINGS (If I could help it). \n\nI was expecting the kids to have dropped juice or something. Not run with it like it's a pair of scissors.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I’m concerned with her logic. Even if her kids amazingly didn’t know not to run around with a laptop and it was an accident you are still responsible for damages.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Yeah like if her kids had busted her laptop she would have definitely been like meh whatever. Sure.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "The only risk with leaving my ipad in reach of my 2 and 3 year old is that they will video call someone 🤣 \n\nMy 3 year old know that she cannot touch our phones or tablets. She use my old ipad for a little of Disney+ once or twice a week and knows that it’s very fragile and she have to be sitting on the couch calmly to have it. My 2 year old  will sometimes touch it, because she is still young, but she never pick it up; she is just loving to scroll the screen and change the chapter to my husband manga reader haha",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "My first thought there was “So, they’re *allowed* to run around the house with *your* electronics?”",
              "id": 32,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "I hope they don't get a pet.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 530,
          "content": "I'm pretty sure Most 4 year olds know not to touch others belongings...or at least the 4 year olds I know, know not to anyone",
          "id": 34,
          "comments": [
            {
              "score": 34,
              "content": "4-year-olds know, they just don't always have the self control to actually follow through yet. 6-year-olds, generally, are in kindergarten or first grade so they are well versed in such rules and should absolutely be expected to not touch other people's belongings.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "ADHD/atypical kids know they shouldn't, but that old lack of impulse control frequently gets involved....\n\nEdit: But their parents should pay for anything they damage. (They should also have lunches prepared so the sitter doesn't have to leave them alone any longer than possible.)",
              "id": 36,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": ">they might have thought it belonged to us since it was in our house\n\nNot to mention this bs excuse! OP hasn’t taught her kids to respect their own belongings, let alone anyone else’s belongings",
          "id": 37,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "And even if they AREN'T old enough to know that, the parents are still responsible.",
          "id": 38,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Agreed as the Momma of an 8,6,and 2 year old. Even my toddler knows not to run with  other peoples’ things 🙄. Give her the $ to fix it and find a new sitter. Let new sitter know that your kids are disrespectful with other peoples’ things🤷🏻‍♀️",
          "id": 39,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I have a kid who just turned 5 and my switch, surface pro, xbox controllers, and Wii U (lol) have all been in her reach as long as she could walk, and she's never even come close to damaging them. A 6 and 8 year old should absolutely know better, and even if they don't, it was an intentional act by OP's kid and that's your responsibility to pay.\n\nYeah, my kid has an old iPad and sometimes if she gets mad at it she'll throw it on the ground, but that's why it's in a super sturdy case.",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "As a mother of a 13, 10 & 7 year old that also has a 9, 7, & 3 yr old that spend 4 days a week with us and a coach for 3-18yr olds, your 6 & 8 yr old 100% should absolutely know not to touch other people's shit and especially don't run with it at their age.  If they don't,  then that is your fault making you 100% responsible for the cost of the repairs and/or replacement.",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Agreed as I have a six year old. But I don’t care if my 3 day old baby broke it. I pay for it.",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Also old enough to be able to identify whether a device belongs to your family or not, plus they must have seen her using it.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 29156,
      "content": "YTA. You pay for what your kids destroy. That’s part of being a parent. End of story.",
      "id": 44,
      "comments": [
        {
          "score": 11231,
          "content": "This.  YTA.  It happened in your home and was done by your child.  Pay up.  Or maybe she can sue you and get it off your home insurance in small claims court.",
          "id": 45,
          "comments": [
            {
              "score": 1925,
              "content": "Kind of hope they do so her insurance bills go up. While I hate the insurance industry maybe this time it will play in favor of karma.",
              "id": 46,
              "comments": [
                {
                  "score": 502,
                  "content": "I hope babysitter sees this post so she can file an insurance claim on OP's homeowner's insurance and that deductible is a high deductible with rates going up afterwards so OP can have an expensive lesson on responsibility for her kids actions.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 34,
                      "content": "I am on this post because I saw the baby sitters post and someone mentioned this one. The small claims court has been brought up to her, so hopefully she goes that route.",
                      "id": 48,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 300,
              "content": "The babysitters dad is totally pissed and I would be pissed too. That's what insurance is for. Also if OP handled it differently her dad wouldn't be as aggro about it. Super asshole move.",
              "id": 49,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 44,
              "content": "YTA  Yes and you'll have to give up a workday on top of it. Be a responsible person and pay up.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Even if someone breaks their leg in your house you could be found liable as far as I know. One of your children blatantly damaging someone else’s property, *in your home*? That’s a definite you problem OP. Fix her laptop and get her a gift card or something as an apology for treating her poorly, because YTA.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Definitely YTA.  Couldnt op just contact her home insurance herself and have it taken care of through them minus deductibles?  People have insurance to use it when needed...",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3287,
          "content": "Seriously, OP, what is your logic here? Did you even punish your children for what they did? Are you not at all concerned that you're raising small humans who think this is acceptable behavior? YTA.",
          "id": 53,
          "comments": [
            {
              "score": 1140,
              "content": "I think she believes adding in the single title to her mother role negates her from any responsibility.",
              "id": 54,
              "comments": [
                {
                  "score": 387,
                  "content": "Man fuck that. I’m a single parent. They damn well know not to break someone’s laptop.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 37,
                      "content": "I’m a single mom. I agree with you.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "Right! My mom was a single parent for years and I knew better! That’s not an excuse for OP not to teach her kids how to not touch other adults items.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "I was thinking the same thing when I had read that.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "Giving single mothers a bad name honestly. Society isn't responsible for your broken home. Plenty of single mothers raise their children to be respectful of others.",
                  "id": 59,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "I think a lot of people also think, well kids will be kids! Okay, but this naughty behavior doesn’t just magically stop. You need to teach your kids what is appropriate, acceptable behavior",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "She definitely tried the single mom card hoping to garner sympathy points yet never said she didn't have the funds to pay for repairs. Sheesh!",
                  "id": 61,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "When I saw her introduce herself as “single mother” I figured she would be following up with a scenario in which she was clearly at fault. I bet OP would lose her shit if her kids destroyed her own laptop and I’m sure she doesn’t carry it around the house with her everywhere she goes.",
                  "id": 62,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "As soon as I read that I already knew how this one was gonna go",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I Noticed that, as if being a single mother excuses her from doing the right thing. I mean recently I had a car accident, it was small, and my fault. Guess what, I paid to fix the guys car. It wasn’t a case of having the extra money to do it but it was what you need to do.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 42,
              "content": "\"We don't discipline Braxtyn. It might hamper his creative passion when he decides to start an Insane Clown Posse cover band.\" - OP, possibly",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "And then still expect her to come back and babysit",
              "id": 66,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "She doesn’t believe it’s their fault. I doubt they were dealt with appropriately.  This is the start of a vicious cycle that will only hurt them.  It’s sad, really.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Really 🤦🏻‍♀️ the excuse of maybe they thought it belonged in their home?! Wtf do they just normally run around with things like laptops and break them? Sounds like lack of discipline and OP definitely needs to pay to have it fixed",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 983,
          "content": "And they are old enough to know that wasn't their laptop",
          "id": 69,
          "comments": [
            {
              "score": 823,
              "content": ">She said she thought my kids were old enough to know not to touch others stuff. I explained how they might have thought it belonged to us since it was in our house. \n\nYeah I don't buy this as a rational answer from OP.",
              "id": 70,
              "comments": [
                {
                  "score": 284,
                  "content": "That logic only works when the kids are babies and toddlers. School aged kids know that houses don't spontaneously spawn objects and that people bring in stuff. Pretty sure these kids have had friends bring in toys or games to share and those things went home with said friends at the end of the day.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 42,
                      "content": "Not even toddlers, my 2yr old nephew will pick up my phone if it's sitting on the table and hand it to me because he knows it's mine.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "The kids have 100% seen the babysitter with the laptop since she uses it while babysitting.  \nUnless ofcourse the children are blind, then I shall offer apologies all around.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "this. plus since covid a lot of schools are using chromebooks/ipads for that age group and they are taught to be careful and respectful with them.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 46,
                  "content": "Exactly. That’s the dumbest excuse ever. OP you were grasping at straws for ANY reason that it’s not your responsibility to pay. No wonder your children act like this when it’s clear their mother tries to wriggle out of her problems by any means she can. I bet you’re the type who begins every conversation with “im a single mother” just to try and get sympathy/leeway for everything. Im also a single mother and look, I waited clear until the end of my comment to bring it up. 😂",
                  "id": 75,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 24,
                  "content": "Also it sounds like she's saying she's okay with her kids breaking her laptop. I mean come on, you know that's not true.",
                  "id": 76,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "I bet that if the laptop was actually theirs and the kid broke it she would be demanding the sitter to pay up.",
                  "id": 77,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "I agree.  That was nothing but a flimsy excuse made because she doesn't want to pay for the damage.  And it isn't even a good excuse, these are school aged children that would be expected to behave during class and, like, have some concept of ownership.  Like, these are their crayons and those are someone else's.  She's saying her 6 and 8 year olds can't do that? Nope.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Even if they did think it belonged to the family, a 6 year old should know not to run around with a laptop!",
                  "id": 79,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "Christopher Columbus thought the USA was his own stuff too, doesn't make him right",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Yeah, kids know electronics.  Unless you happen to have a dozen laptops in your home ( not anyone I know), kids will know it doesn't belong to the family.",
                  "id": 81,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "You mean the laptop that comes and goes with the babysitter that she exclusively uses and the kids can’t figure out it’s hers?",
                  "id": 82,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 31,
              "content": "And also that a laptop is expensive adult tech that they have to be very careful with!",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Exactly. It’s super funny that OP is pissed that babysitter won’t come back- even though she “pre-payed” her to watch the kids?\n\nSounds like she will be paying for at least *part* of the laptop repair wether she likes it or not.\n\nWhat an entitled AH OP is though- oh you pre-payed the babysitter who won’t come back?\n\nSOUNDS LIKE A *YOU* PROBLEM OP. YTA.",
              "id": 84,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 556,
          "content": "It’s like a store when they state, “you break it you buy it.” So, if this happened in a store would OP still try to blame the store when it was their child’s fault?",
          "id": 85,
          "comments": [
            {
              "score": 307,
              "content": "That’s what the store gets for leaving all those tempting breakable things in her offsprings’ reach *shrug*",
              "id": 86,
              "comments": [
                {
                  "score": 26,
                  "content": "I know you’re joking but I literally had multiple parents make this argument when I worked retail. \n\n“If you don’t want kids ripping apart the packaging on products you shouldn’t leave them on display tables”. \n\n“If you don’t want kids sucking on these soft toys you should keep them behind the counter.” \n\n“If you don’t want kids pulling books off shelves and throwing them at people you shouldn’t have bookcases with shelves that close to the ground.”\n\nSome parents will never admit their kid made a mistake. Or that they weren’t properly monitoring their kid.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Oh god. SO many times.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 355,
          "content": "And legally speaking that is also the case. So if the dad decided to prosecute you you would have to pay for the laptop. So YTA and even if your kids were underage and not know what they are doing so YTA",
          "id": 89,
          "comments": [
            {
              "score": 26,
              "content": "> if the dad decided to prosecute you you would have to pay for the laptop. \n\n... plus the cost of filing the suit.  And the cost of hiring an attorney.\n\nAll in all, it would cost the OP **more** than if she just paid up right now.",
              "id": 90,
              "comments": [
                {
                  "score": 8,
                  "content": "I doubt you need an attorney for small claims anywhere",
                  "id": 91,
                  "comments": [
                    {
                      "score": 11,
                      "content": "You don't **require** one, but it can still help.  :)\n\nAlso, some places have very low limits on Small Claims suits, and depending on the laptop involved, it's remotely possible that the expense to repair or replace it exceeds that limit.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Criminal cases are prosecuted, this is a civil matter that would be handled in civil court not by criminal prosecution.",
              "id": 93,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "This is the only answer!! I’m embarrassed for OP acting like this. Teaching her kids there are no consequences when we ruin someone else’s property. Karma will come back around and she’ll be singing a different tune I’m sure.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "THANK YOU! I was relieved to know that the majority of people thought YTA. This was not the case a couple years ago. There was a similar post by a women whos kids destroyed the sitters art supplies and art work (worth $1000, sitter was an artist on the side). Mind you that sitter was babysitting at her own home. She had this room closed off in a different part of the house. Op of that post refused to pay and majority voted NTA bc the sitter “should have known better”.",
          "id": 95,
          "comments": [
            {
              "score": 14,
              "content": ">Op of that post refused to pay and majority voted NTA bc the sitter “should have known better”.\n\nShould have known better than to what? Dare have an art room in a *closed of section* in her own fucking home when babysitter sitting kids how were old enough to know better than to go somewhere where they're not allowed?! The entitlement of some people is so off the charts it's unreal.\n\nChrist on a fucking cracker.. And people now wonder why others don't want to babysit anyone's kids anymore. People just don't respect babysitters or their property, and babysitter aren't paid enough to deal with that bullshit.",
              "id": 96,
              "comments": [
                {
                  "score": 11,
                  "content": "Sorry I made a mistake; the sitter was an actual professional artist and it was her main source of income actually. Sitting is what she did on the side. Which makes it even worse bc OP refuse to pay for the $1000 damages. The reason bc it got NTA as the majority is bc a lot ppl where saying that if it was that important to her she would have locked it or “keep the kids away from it”. That it was her problem, not OP. Which boiled my blood bc if you go to a store and your kid breaks a TV. You bet your ass they gonna make you pay weather it was you or your kid that broke it. Smh",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Replace or repair - it's your responsibility to make it right, and appropriately punish the kids. For the kids, they have to give something up since at that age are likely not full of cash.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13974,
      "content": "At what age do you think kids should learn not to touch things that don't belong to them?\n\nIt's super concerning to me that you think, as a parent of two children, that this shouldn't have been taught to your kids years ago.\n\nLike hello?\n\nYTA",
      "id": 99,
      "comments": [
        {
          "score": 2252,
          "content": "Right? Her child is 6! I thought this was going to be about a toddler.",
          "id": 100,
          "comments": [
            {
              "score": 676,
              "content": "I have friends with toddlers who have those kid-friendly tablets, and even they know not to run around with them because they may break. \n\nReading this just made me concerned with what other areas these kids are lacking in.",
              "id": 101,
              "comments": [
                {
                  "score": 49,
                  "content": "Exactly. I have a 3 year old, and she knows to be careful with her tablet, as well as not pick up dad's laptop. I don't think this should be a foreign concept for a 6 year old at ALL. YTA, OP.",
                  "id": 102,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "Yeah, I have a 6 year old and three year old twins and they absolutely know how to treat electronics. In fact, when one 3 year old was throwing a fit, she stood on a tablet and the other 3 year old and 6 year old had a conniption. The fit-thrower later apologized and lucky the tablet was face down on a carpet in a good case so it was okay but they definitely know. \n\nThis lady needs to pay. I would pay and I'm a cheapskate.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Exactly. My daughter will be 6 in March and she definitely knows not to do stuff like this. If she wanted to play with the laptop she would’ve asked first. Op YTA and should pay for the damaged laptop.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I was expecting one of them to be a two-year-old. \n\n&#x200B;\n\nBut no.",
              "id": 105,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "I first read it and thought ‘well she left it unattended’ but then realized I was thinking as a dog owner not kids. My goddaughter is 4 and would know not to grab something that didn’t belong to her, especially something like a laptop.",
              "id": 106,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "I mean even if it was a toddler as a parent you are kinda responsible for what your kids break for the most part.",
              "id": 107,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "6 year olds can certainly be tempted to play with or use things that aren't theirs, even if they \"know better\".\n\nChildren are not miniature adults. Mom = YTA\n\nIf your child breaks something that belongs to someone else, it's your responsibility to fix or replace",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 25,
          "content": "Lol I bet those kids are well known in their elementary school.",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Right?!? OP’s kids are school age. If they stole a teacher’s laptop and ran around and broke it would OP say it was the teacher’s fault?",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "It's also super concerning that the excuse is \"they probably thought it was ours\". Do these kids regularly treat their belongings like that? Dude.",
          "id": 111,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Especially to pick it up and run with it. They're running because they know they shouldn't have it.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8970,
      "content": "YTA. Your kid broke it, and not accidentally either. They're also 6 and 8, not 2 and 4. They knew it was an electronic device, and unless you literally have the exact same computer, they knew it was hers.",
      "id": 113,
      "comments": [
        {
          "score": 2878,
          "content": "\"Grab it and run\" is definitely a toddler thing to do. I had to go back and reread the ages. I agree, the parent should pay. A 6yr old should know better.",
          "id": 114,
          "comments": [
            {
              "score": 821,
              "content": ">\"Grab it and run\" is definitely a toddler thing to do.\n\nEvery once in a while older kids surprise you. I've had perfectly average 10-year-olds do things that absolutely flabbergast me with the level of stupidity. Everyone makes bad choices sometimes, adults included. But yes, YTA OP because *most of the time* at 6 children can reasonably be expected to not grab an expensive electronic and run.",
              "id": 115,
              "comments": [
                {
                  "score": 43,
                  "content": "Yeah, I can remember being somewhere around that age and sick and deciding that eating a giant spoonful of peas right from the serving spoon was a great idea (and then immediately realizing it was dumb, mouth overflowing with peas).",
                  "id": 116,
                  "comments": [
                    {
                      "score": 26,
                      "content": "I used to eat margarine right out of the container with my fingers and then smooth over my fingerprints. With my fingers. I was a lovely combination of stupid and disgusting. God I've never admitted that before.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "I was probably that age when I choked because I tried to stick an entire pretzel rod (basically a giant pretzel stick) in my mouth.\n\nSo yeah, kids sometimes do dumb stuff lmao",
                      "id": 118,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "BUT, and this is the part that killed me, she was flat out refusing to replace the laptop! My kiddos are 17, 15 and 9 now and they do dumb shit that make me stop and say, \"bro what the actual fuck possessed you to do that?!?!\" And we fix the issue. But to make it seem as though it was acceptable and part of the baby sitting gig, an occupational hazard even, and for her 6 and 8 year old to normally act that way is janky and wrong. OP is gross for that.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "The 2yo I nanny already stopped the “grab and run” phase. He knows not to touch my phone or tablet without asking, isn’t allowed to walk around while holding them, and refers to them as my belongings. If a 2yo gets it, 6 & 8 year olds should. YTA op, pay for what your kid broke",
              "id": 120,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 517,
          "content": "Even if OP has an identical computer, do they really allow their kids to run around carrying their laptop?",
          "id": 121,
          "comments": [
            {
              "score": 108,
              "content": "Exactly what I was thinking! Like, yeah, he could’ve thought that was one of your laptops but… Does that make it any better? That’d just mean that you haven’t taught your kids how to properly handle electronics… So, either she didn’t teach them boundaries or didn’t teach them how to handle electronics… Either way, she neglected to teach them something.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "Right? And you can bet if it had been OP's laptop that got broken, she'd be punishing her 6yo",
              "id": 123,
              "comments": [
                {
                  "score": 26,
                  "content": "I'll raise you: bet she'd be trying to make the babysitter pay.",
                  "id": 124,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Regardless of age.  Your kids - your responsibility.",
          "id": 125,
          "comments": [
            {
              "score": 7,
              "content": "Exactly, whether or not the kids knows better (and a 6-8yo they definitely should) is irrelevant. When you're the parent, whatever your kid breaks is your responsibility to repair/replace.\n\nIt would be like if OPs kids were in an electronic shop and her kids grabbed a laptop off the shelf then ran around with it and broke it, she'd be responsible to pay for the product the shop can no longer sell.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Even if they thought it was theirs, it turns out it wasn’t and was broken by her kids so she should replace it either way. Whether or not her kids intended to destroy something shouldn’t actually fracture in here given the outcome",
          "id": 127,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7154,
      "content": "I hope your babysitter takes you to small claims court.  YTA.",
      "id": 128,
      "comments": [
        {
          "score": 959,
          "content": "Judge Judith Sheindlin please!!! She'll put you in your place.",
          "id": 129,
          "comments": [
            {
              "score": 300,
              "content": "#I’m the boss, applesauce",
              "id": 130,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": "The people are real! The cases are real! The rulings are final!",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 721,
          "content": "YTA-and good luck getting another sitter after 5his one rightfully bad mouths you all over town. If it were me I’d do a review on every service (Care, Angie’s List etc) about babysitting for you",
          "id": 132,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 94,
          "content": "_\"I refused and insisted it was her problem not mine.\"_\n\nI do as well. This is a 17 year old kid. OP's kid broke the laptop but they don't even seem open to trying to meet the babysitter halfway. Instead, OP just shrugged, and still expected this young woman to return to babysit...",
          "id": 133,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "Or I hope she'll keep the money she was paid in advance, and invests them in fixing the laptop/ buying a new one.\n\nYTA",
          "id": 134,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Hey OP: Trebling damages (if you are in US and why do I suspect you are) YTA",
          "id": 135,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Yep and she has to buy a whole new one for the sitter....",
          "id": 136,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5675,
      "content": "YTA - and as others have noted, your children are old enough to know better.\n\nI'm amazed at your gall in insisting the sitter come back and babysit for you when you refuse to take responsibility and pay to get the laptop fixed.",
      "id": 137,
      "comments": [
        {
          "score": 855,
          "content": "I had to look way to far down to find this comment. Like really you are surprised she won't come back?",
          "id": 138,
          "comments": [
            {
              "score": 444,
              "content": "Yeah like...I would be surprised if she came back ever, even if OP coughs up to fix the laptop.",
              "id": 139,
              "comments": [
                {
                  "score": 239,
                  "content": "I was thinking the same thing. That bridge is burned.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 103,
                      "content": "Pretty much.  And if she paid her upfront to watch the kids and won't pay for the broken laptop, obviously the sitter would just use the sitter money instead of just.. not buying a new one? That's what I think most people would do.  I honestly hope the babysitting advance was more money than her laptop is worth.  I would never babysit for OP again either tf",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 110,
                  "content": "Plus if the babysitter feels really petty she would probably let everyone know what OP has done and no one would want to babysit her kids paid or not.",
                  "id": 142,
                  "comments": [
                    {
                      "score": 43,
                      "content": "I’d babysit them for desperate parent rates… let’s see how long before it would’ve been cheaper to just fix the thing",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "It would serve OP right if the sitter spread the word about OP to all of the other babysitters",
                  "id": 144,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "Yeah try to find another sitter you can trust",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "That was the first thing I thought when I read that she was surprised about the sitter quitting. I laughed and wondered how she thought this was going to play out. Entitlement literally breeds entitlement. YTA OP",
              "id": 146,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "I was thinking the same thing. I babysat a ton at that age. Even if she paid to fix it, still not going back",
          "id": 147,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "I actually laughed out loud when I got to the part about her wanting the babysitter to come back.  YTA op",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "I wonder where those lids learned the entitlement from.\n\nHMMMMM 🤔",
          "id": 149,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "It's kind of hilarious - babysitter owes op maybe a couple hundred tops, op owes babysitter a grand, but op still thinks somehow babysitter should come work for free.\n\nWhat a complete and utter asshole, and from the sounds of it OP is raising two more.",
          "id": 150,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "Oh but she pre-paid!!!\n\nGuess what OP? That money just became a deposit for the sitter to buy a new laptop.",
          "id": 151,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "before i even read to the end i was wondering how attached to this babysitter (or her new job) she was, because i sure as hell wouldn’t be showing back up there if i were the girl. even ignoring the cost of a laptop screen, why is a grown woman ‘getting into an argument’ with her 17 year old babysitter\nwho did nothing wrong except for *checks notes* make your children food? in what world would you not be the asshole OP?\n\nYTA",
          "id": 152,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "The fact that a 6-year-old did this in the first place leads me to assume that these two kids must be pretty badly behaved in general, and it wouldn't be unreasonable of the babysitter to not want to watch them anymore even if paying to get the computer fixed wasn't at issue here. My parents and all my friends' parents in high school really encouraged us that we weren't obligated to continue babysitting kids we felt like we couldn't handle.",
          "id": 153,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2827,
      "content": "YTA\n\nYour kid broke her laptop.  Pay up.",
      "id": 154,
      "comments": [
        {
          "score": 288,
          "content": "Its even more upsetting due to the babysitters situation. I couldn't imagine the stress of having my laptop smashed by some badly raised kid, when I have exams to revise for",
          "id": 155,
          "comments": [
            {
              "score": 15,
              "content": "And the entitlement of OP in the post about how it was the sitter’s problem and how the sitter “ranted” about having exams and not having enough money to pay for it. It’s as if the sitter’s problems are meaningless because OP is playing the single mother card.",
              "id": 156,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2387,
      "content": "YTA. Your kid broke it. Doesn’t matter if they thought it was theirs (and come on, they’re old enough to know that it wasn’t, they’re able to recognize by 6-8 what is and isn’t a regular fixture in their home), they still broke it. Ultimately you’re responsible for their actions as their parent. If they break something it’s your responsibility to get it fixed or replaced. It’s just part of having kids.",
      "id": 157,
      "comments": [
        {
          "score": 566,
          "content": "Yeah the kid definitely knew it was hers. From the sounds of it she’s been babysitting them for at least a few weeks and she brings her laptop with her every time. Kids aren’t that dumb, they see their babysitter bring a laptop with her every time she watches them and once mom comes home she leaves with it.",
          "id": 158,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "And framed in a different way- if a guest or visitor came over and got their laptop broken by OP’s kids I bet they would also expect OP to pay for it. It’s even shittier to then think for some reason hired help wouldn’t have the same expectation. I was a nanny for years and never had something like this happen, but I feel pretty confident my employers at the time would have offered to pay for something of mine that the kid broke.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1930,
      "content": "YTA! Welcome to being a parent. They break it, you pay for it. Get used to it for another 10 to 12 years.",
      "id": 160,
      "comments": [
        {
          "score": 332,
          "content": "Wait until they are wrecking cars in 8 years!",
          "id": 161,
          "comments": [
            {
              "score": 175,
              "content": "It’s the car owner’s fault for parking it in a public place! Of course her sweet little angels wouldn’t do that. /sarcasm",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1728,
      "content": "YTA. When your kids break something, it's your responsibility as a parent to fix or replace it. \n\n>. I explained how they might have thought it belonged to us since it was in our house\n\nYou're just making excuses here. A 6 year old is old enough to know we don't touch things that aren't ours, and since babysitter has bringing this laptop back and forth, the \"he thought it was ours\" doesn't really hold much water. He knew that wasn't a family laptop and you are trying to skate responsibility. \n\n>Now she's refusing to come again unless I pay her for the laptop repair even though I paid her in advance to watch the kids.\n\nI wouldn't come back either, and I would consider the paid advance as going towards the laptop repair. Do you really think she would want to come back after you tell her that the kids destroying her property is her problem?",
      "id": 163,
      "comments": [
        {
          "score": 595,
          "content": "It’s obvious where the children learned to behave with no respect or responsibility.",
          "id": 164,
          "comments": [
            {
              "score": 41,
              "content": "Reading reddit explains a lot about the state of the world.",
              "id": 165,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "Also to add on what you said, so what if they thought it wasn’t hers? It was, they were wrong, pay up!",
          "id": 166,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "“He thought it was ours,” is such a poor excuse too. The kids are allowed to run around holding your expensive electronic device?",
          "id": 167,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "And I truly hope that the babysitter would never go back even if OP does have to pay for the laptop (which they absolutely need to do, or else the babysitter needs to take them to small claims court). YTA, OP. Take some damn responsibility.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "If I were the babysitter's parent, I would be pretty firmly advising her not to go back there even if she wanted to and I'd be spreading the word around the high school babysitter network too. If this is how OP handles a pretty straightforward incident of property damage by their kids, I would not want my kids in the position to be blamed for any and all other damage or danger that might happen in that household during her care.",
          "id": 169,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I'm dying to know how the kids thinking it belonged to the house changes literally anything about the situation \n\nalso apparently OP just lets her sprogs run around at top speed with expensive and super fragile items. Its a fecking miracle her kids haven't lost an eye or something",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Exactly!!! Also, good luck finding a new babysitter. I hope this young girl tells all of her friends what happened so OP is screwed for child care. What a rotten thing to do. Parents who don’t take responsibility for their kids are some of the lowest people around.",
          "id": 171,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "The kid should've known at 6 that they need to ask permission at least. I'm wondering how often this behavior happens at the kids school....",
          "id": 172,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Also even if the 6 year old did genuinely think the laptop was theirs, why is OP so blasé about them breaking it? Like is this a common occurrence? Does the 6 year old break stuff all the time and OP is just like \"welp kid being a kid\"? What kind of lesson is OP teaching her kids?",
          "id": 173,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}