{
  "post content": "I am 24M and I have a friend who is 21, she is really nice and we've known each other for a year. She is my sister's acquaintance and we met at my sister's birthday party. I have a crush on her although she isn't exactly my type. Lately I feel like I've been getting vibes that she likes me back.\n\nLast week I won a raffle and have 2 tickets to see a famous singer perform next month in a nearby city. She also happens to like this singer so I asked her if she wanted to go with me as a date. I said I can book us a hotel room and we can spend the night together. She said she'd love to go, but only as friends. She says she's alright with us splitting a hotel room as long as it has two beds. She told me she doesn't feel ready to date anyone at the moment, and she doesn't do flings either, so unfortunately we can only be platonic friends. I said I'll think about it. I was quite hurt because honestly I don't have much experience with rejection, and I was annoyed that she turned me down. \n\nToday, i asked my female coworker to go with me to the concert as a date. She immediately said yes and seemed quite excited about it although she admitted that she never listened to any of their songs. Still, I'm taking her out for drinks on Friday. But just now, the friend who I asked originally asked if we were still on for the concert. I told her honestly that I already asked another woman, and she seemed disappointed but dropped the subject.\n\nWhen I told my sister about what happened, she said I'm being really douchy. She says her friend is a huge fan of the singer and I should take her instead of my coworker who doesn't even like the band but only wants to go because she likes me. I said she can't understand because she's not a dude. Because let's me honest, if I had the choice between going out with a girl who only wants to be my \"friend\" versus a girl who is super into me and wants to take things to the next level, then obviously I'm taking the second one. AITA for just being honest about what I want?\n\n**EDIT**: Because a lot of the hang up is over the hotel room thing: YES I would have been fine if the first girl agreed to go with me as a date, but wanted separate hotel beds/rooms. Nowhere do I even say that we have to share a bed...\n\nBut the part where she says she’s not ready to date anyone essentially means she is not interested in me. She likely said she’ll go with me as friends just to be nice and not hurt my feelings. So why would I make the experience awkward for the both of us when I could bring along someone who actually is interested in dating me? **EDIT OVER**",
  "id": 1,
  "comments": [
    {
      "score": 13874,
      "content": "YTA. You don't rescind an invitation because you won't get laid at the end. 'Only guys understand' is an example of toxic masculinity. Don't be surprised if you lose a friend over this.\n\nEdit- thank you for the silver! \n\nP.S. since some keep making mocking comments about toxic masculinity, I'll break it down. 'Only guys understand' implies that guys would obviously take the choice that gets them laid. He doesn't even really like the other girl, he just knows he stands a good chance at some action. That's a really gross way to view women. I hope the other girl does end your friendship, because she deserves better friends, that don't sexualize her.\n\nEdit 2. Holy crap, my inbox. Stop it. Thank you for all of the awards. To the 350 ppl in my inbox that called me a feminazi, you may think I'm full of crap, or your feelings are hurt, but 8k+ people show you're the minority and probably part of the problem.",
      "id": 2,
      "comments": [
        {
          "score": 11413,
          "content": "[deleted]",
          "id": 3,
          "comments": [
            {
              "score": 367,
              "content": "> Yes, but he explicitly asked the first girl to go \"as a date\". She refused.\n\nThis is what tips me over to NTA.  He said \"this is a date\" and she said \"no, I don't want to go on a date with you, but it would be totally great if you paid for tickets for me to see this band, and pay for everything.\" \n\nSo if she really wants to go to the concert, she can whip out her card and buy her own ticket and hotel. \n\nNow, I want to say that just because OP is paying for shit, that doesn't mean anyone owes him a god damned thing.  But if he's openly saying that he wants to date someone, and they do not reciprocate that feeling, then it's very realistic for him to say \"okay\" and move on.",
              "id": 4,
              "comments": [
                {
                  "score": 10,
                  "content": "Exactly! Same scenario, but without a concert:\n\n* Person 1: want to go on a date with me? Dinner and drinks, my treat. Maybe a movie?\n\n* Person 2: I'll go with you as a friend, but I don't want to date anyone right now.\n\nIs person 1 an asshole for not taking the second person out for dinner and drinks and whatnot? Absolutely not.",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 172,
              "content": "But it wasn’t just a date though, he booked a hotel. There was a lot of pressure",
              "id": 6,
              "comments": [
                {
                  "score": 358,
                  "content": "so she said no, and that's fine.",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 146,
                  "content": "He said he *could*  book a hotel not that he *did*  imo OP is doing nothing wrong and should be NAH",
                  "id": 8,
                  "comments": [
                    {
                      "score": 31,
                      "content": "The sister is an asshole for getting butthurt and feeling her friend is entitled to that ticket. NTA.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 26,
                  "content": "oooo, staying at a hotel instead of driving back from out of town, possibly while intoxicated, is so. much. pressure!",
                  "id": 10,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "[deleted]",
                  "id": 11,
                  "comments": [
                    {
                      "score": 14,
                      "content": "But that would require an adult level of communication, something a lot of people in the comments here seem to think is beyond a woman for some reason.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": ">There was a lot of pressure\n\nshe's 21. not 15.\n\nNo means no. She said no. He accepted that. She will survive, but it's nice you're here to protect her from... uh... whatever. ..  he didn't ask someone else to belittle her, right? She turned him down \n\n&#x200B;\n\nand he moved on with what appears to be class and dignity... and even wants to be sure he wasn't an ass about it... wow what a jerk he sounds like!!! /s",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Easily could have gotten separate rooms",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "pressure?\n\n\"hey wanna go on a date?\"\n\n\"no\"\n\n\"k cool\" *asks someone else*\n\nwhat pressure?",
                  "id": 15,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "1. He offered.\n2. She counter offered.\n3. He refused.  \n\n&#x200B;\n\nplain and simple.",
              "id": 16,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "She said she'd go as a friend. Hell, I went to a high school reunion as a \"date\" with a guy and it most certainly wasn't a *date*. He needed a date. I accepted. We were friends. Just because it's called a date doesn't always have to mean it's going to involve sexy times.",
              "id": 17,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "This, she turned down his offer and made her own, he is not obligated to still go with her, now is he TA for not taking her.",
              "id": 18,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Exactly!\n\nOp is NTA.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Correct. Who is up voting this crap? He is looking for a relationship and this girl doesn’t want one, hence it is time to cut the losses and move on to other fish in the sea.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 902,
          "content": "If she said she would go on a date with him but not sleep with him on the first date, I'd agree with you.  But I don't think he has to go to a concert with someone who rejected him.\n\nThat said, I do think he's TA in this situation from the start because of the high-pressure way he \"asked her out\" (asked for sex).  I don't think he has to take her to the concert, but I do think he has to change how he approaches women.\n\nAs for losing a friend that's a possibility any time you ask a friend out on a date, both from them rethinking their relationship with you and you not wanting to maintain a friendship after rejection.  That doesn't necessarilly make anyone an asshole.  Honestly, I expect he's already lost the friend here, whether he takes her to the concert or not (though obviously I don't know enough to say for sure).",
          "id": 21,
          "comments": [
            {
              "score": 862,
              "content": "She probably freaked out as soon as he suggested sharing a hotel room, TBH. I know I would have. That'sa pretty high pressure situation for someone who thought this guy was going with her as a friend.",
              "id": 22,
              "comments": [
                {
                  "score": 630,
                  "content": "Shit, I’d say that’s a pretty high pressure situation even if she were interested in him as a date.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 406,
                      "content": "Fully agreed. To ramp from 0 (friend) to 300 (share a hotel room) is like, good lord.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "And yet, the girl at work accepted immediately and is super excited to go with him even though she doesn’t know the band hahahahaha.  \n\nLet’s be real, if your crush (who you know and hang out with) asked you to go on this adventure you would want to go, and your response wouldn’t be “I’m not in the dating scene right now” even if you were uncomfortable with the hotel part.  You would pursue going but you’d probably set some boundaries that wouldn’t include rejecting the person.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 404,
              "content": "Agreed. If someone asks me on a date that sounds like fun, but I don't want to date them, I don't expect to still get taken out. *That* part is fine. \n\nBut at the same time, yeah, suggesting to share a room before the first date is way too aggressive.",
              "id": 26,
              "comments": [
                {
                  "score": 33,
                  "content": "For you it is too aggressive, sure. For many people. But that doesn't make him an asshole, especially because it doesn't appear he pushed the issue at all. He simply made his offer, she declined and he moved on. In fact she sounds a little disappointed but might not even care that much, its only the sister who has outright had a problem in this situation from what we can see.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I thought the same unless this concert is pretty far away....then sharing a hotel room makes more sense.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "She was fine with the room part regardless...",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": ">That said, I do think he's TA in this situation from the start because of the high-pressure way he \"asked her out\" (asked for sex).  I don't think he has to take her to the concert, but I do think he has to change how he approaches women.\n\nWhat's wrong with being upfront about wanting sex? Some people's standard for a relationship is one where they fuck from day one. I see nothing wrong with that. OP was as upfront about that as it's possible to be. It would be more of a dick move to have asked her out and *not* been clear about the sort of relationship he expects to cultivate.",
              "id": 30,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 680,
          "content": "He asked her on a date and she said no, he doesn’t owe her a concert just cause she likes the singer. It’s not about getting laid or not, she said no to a possible romantic relationship, and he got over it. Like who the fuck ask someone for date get rejected then take them out as friends. Like damn wtf is this thought process...",
          "id": 31,
          "comments": [
            {
              "score": 189,
              "content": "Maybe she was open to the idea of possibily dating OP but his offer for a shared bed at a hotel room scared her off. Cant really blame her for not wanting to go from 1-100 so quickly. OP rushed things, he could have done a better job with this whole situation. I highly doubt she would even want to stay friends with him after this.",
              "id": 32,
              "comments": [
                {
                  "score": 205,
                  "content": "Then she should’ve said she was open to dating but didn’t wanna spend the night. If she sees this as a red flag as this guy moves too quick then that’s good she doesn’t date him but it’s entirely equally possible this girl likes to bang and would be entirely comfortable with banging this dude she’s seen a couple times on the first date. Some people are ok with moving quick others aren’t. As soon as she said she wasn’t, he was disappointed but moved on like any rational adult should.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 8,
                      "content": "this, She could have said \"I want to go as a date but I am getting my own hotel room\". there problem solved.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Agree if she wanted to date him she could have countered with making her own arrangements for transportation back or a place to stay.\n\nAlso agree she may not have liked the hotel insinuation and that is also ok.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "> Maybe she was open to the idea of possibily dating OP but his offer for a shared bed at a hotel room scared her off. \n\nHypothetically, let's assume that's the case. How could OP have known that without her communicating it? She could've said she'd be happy to make it a date but that she'd prefer separate beds. But she didn't say that.\n\nOr is OP supposed to read minds?",
                  "id": 36,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": ">Maybe she was open to the idea of possibily dating OP but his offer for a shared bed at a hotel room scared her off. \n\nok, maybe?\n\nso what? doesn't make him an asshole just because you want to critique his dating game.",
                  "id": 37,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "That's on her for being a chicken shit and not communicating.\n\nShe said \"not ready to date\" and \"platonic friends only\"\n\nThat's clear cut.\n\nHe might have fumbled it and messed up his chances with her with teh offer to begin with... but he didn't do anything \"asshole-ish\" at all.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Ahah you people are so insanely dramatic, that’s Reddit for you",
                  "id": 39,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "\"The other girl just wants to go because she likes you\" - well that sums it up doesnt it.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Her desire to go to the concert takes priority over his emotions and property right? /s",
              "id": 41,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": ">Like who the fuck ask someone for date get rejected then take them out as friends\n\nMy exact thought to some of the replies. Like wtf? Let me just go to this awkward date now.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Reddit group think",
              "id": 43,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 494,
          "content": "The invitation was for a date, but she didn't want to do that. So really she refused the invitation and I didn't say I'd take her as a friend, just that I'll think about it.",
          "id": 44,
          "comments": [
            {
              "score": 1412,
              "content": "Dude, you were asking her out with sex appended at the end. You essentially informed her that there would be sex from the get-go, regardless of how the date went. That's INCREDIBLY forward, and super jumping the gun!\n\nDid you offer the same 'deal' to your coworker? Because offering them a ticket to a concert in exchange for sex is super douchey.\n\nEdit: wow okay. Thanks for the gold, stranger!",
              "id": 45,
              "comments": [
                {
                  "score": 310,
                  "content": "The reason for the hotel was that the concert was in another city and concerts often end fairly late.\n\nsharing one room may have been to save money.\n\nif  he was expecting something at the hotel he would be TA for it. but it  is not said either way so I give the guy the benefit of doubt and assume with was not \"sex implied\"",
                  "id": 46,
                  "comments": [
                    {
                      "score": 44,
                      "content": "I agree that the reason for the hotel is because it's late in another city, but I think the fact that he said she is the one that suggested a room with two beds points to him also assuming there will be sex",
                      "id": 47,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 23,
                      "content": "\"Spend the night together\" is often code for sex. I mean, if we were there, we could know better, but it seems like he was implying that.",
                      "id": 48,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "You would think that all these posters have never spent a night in a hotel without banging the people they shared it with.  All the times I've gone on trips with friends and booked hotel rooms after formals.  My dates and friends must be so disappointing that I didn't have sex with them.",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 33,
                  "content": "Well. He was honest and forthright. Some people, like his coworker, are into that. I don't think it is douchey, just not likely to lead to success.\n\nDouchey would be taking her out ambiguously and then asking her to stay the night. That would suck.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Where in the fuck are all you people getting this \"you told her there would be sex\" bullshit from? He even said if they had gone as a date but there would be separate beds, he would have been fine with it. You're makig shitty inferences that clearly are not the case.",
                  "id": 51,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "Is she an adult?\n\nIf so, she was asked and said no. He respected that.",
                  "id": 52,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "And she said no. He's not obligated to go on a date with someone who turned him down.",
                  "id": 53,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 755,
              "content": "I don’t think you were obligated to go with her, but “I’ll think about it” isn’t an answer — it sounds like you left her hanging until she followed up about it with you, and you’d already replaced her without bothering to tell her. It does send a “you’re not worth my time if you don’t want to bang me” signal. \n\nOn a separate note, getting a hotel room together isn’t exactly typical first date material. Plenty of people wouldn’t feel comfortable committing to sleeping with you before they’d even kissed you.",
              "id": 54,
              "comments": [
                {
                  "score": 207,
                  "content": "Yeah, WTF? Even if I liked the guy back, I'd be pretty flustered if a guy said, \"I have tickets to see this singer you like and want t o go with you, but only if it's a date, and I'm expecting you to share a hotel room with me at the end\"...Basically, \"I'm buying you a thing because I want to have sex with you.\" Not everyone will be comfortable with that, especially if you haven't been dating!",
                  "id": 55,
                  "comments": [
                    {
                      "score": 16,
                      "content": "[deleted]",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "No one is saying the girl is an asshole. The girl’s response is completely reasonable. The guy’s reaction to her response could be dipping into asshole territory, but I don’t think his ask was in anyway rude. Some people do think about these things more casually. Growing up, I shared rooms with girls pretty frequently on trips, and most of the time it was platonically. So in my mind saying we could share a room is fairly casual. Other people may not feel the same, but they can just bring it up if they’re uncomfortable and it’d be an easy thing to understand.\n\nPeople have different boundaries. Just make yours are known beforehand and more often than not you’ll find that people can be accepting and accommodating of them. There’s no need to freak out about it.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "If the girl wanted to date him and take things slower she would've said so. The way OP phrased it, the girl had no interested in him.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "It would be pretty awkward to go out with someone after rejecting them on a date and going as friends after. Like why would you want to do that?",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 472,
              "content": "The first girl might like you, but you probably scared her off. Asking her on a first date that ends in a hotel room? I would say no too. That’s intimidating for a huge number of women. If your first date idea with her was something more innocent, like dinner or a movie, then she probably would have said yes if she was interested. I’m a woman and if a guy asked me out (no matter how much I liked him or how long we had known each other), if he said we were going to spend the night together right after our first date I would say no too.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 143,
              "content": "Yeah you’re TA for making it be a date with a hotel room. Not exactly first date standard..\nHowever, I understand you wanting to take someone as a real date.",
              "id": 61,
              "comments": [
                {
                  "score": 16,
                  "content": "Someone isn’t an asshole for being foward. If he wasn’t pushy, he’s not an asshole. She can feel free to accept his foward advance or not.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 84,
              "content": "But you didn’t “think about it”, you knew in that moment that you didn’t want that. You should have just said no.",
              "id": 63,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "Yeah you should have clarified here with her. When she said she'd go as a friend, you've got to go 'no that doesn't work for me' or something",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Define \"date\"",
              "id": 65,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Good on you to not drink and drive by the way 🖒\n\nAlso, with the few informations I have, NTA.\n\nSome people in this thread should take a break to explore their insecurities about relationships.\n\nI hope you'll find someone good and a healthy relationship.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 435,
          "content": "[deleted]",
          "id": 67,
          "comments": [
            {
              "score": 313,
              "content": "[removed]",
              "id": 68,
              "comments": [
                {
                  "score": 309,
                  "content": "\"only guys will understand\" set off mine",
                  "id": 69,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Can't stand gatekeeping.",
                      "id": 70,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 21,
                  "content": "You think \"I don't have experience with rejection\" means \"I don't usually get rejected\".\n\nI think \"I don't have experience with rejection\" means \"I haven't asked out many/any girls yet\".\n\nSeeing as this is essentially a guy asking for dating advice, I think maybe I'm right?",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Couldn't that just translate to, \"I don't ask a lot of women out\"?",
                  "id": 72,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Only to a normal person, not to someone automatically looking for a reason to slate OP.",
                      "id": 73,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Or maybe he's never asked a girl out before?",
                  "id": 74,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 44,
              "content": "How so? You can be really attracted to someones personality. And some people have a type but will break the mold and get with someone that isn't their type. You can like someone without liking their physical appearance too much",
              "id": 75,
              "comments": [
                {
                  "score": 9,
                  "content": "It seems kind of like negging to me -- a backhanded \"compliment\" that's designed to undermine the other person's self-esteem and (in theory) make them feel like they need to seek your approval/acceptance.\n\nThat's (imo) a massively dickish thing to say about a \"friend\", much less a potential date! Makes it seems like he's doing her a favor by even considering dating her, which is patronizing and rude.",
                  "id": 76,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "[deleted]",
              "id": 77,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "JFC men aren't allowed to have preferences now either?",
              "id": 78,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "The Fox and Sour Grapes fable comes to mind haha",
              "id": 79,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 354,
          "content": "The girl wasn't really his friend if he reacted her the way he did IMO.",
          "id": 80,
          "comments": [
            {
              "score": 78,
              "content": "Yep. Lol. But better she find that out now..",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Be honest with his intentions and then make a date with someone else after getting rejected? He never promised anything.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "TIL that she’s owed free concert tickets when he wants the experience to be a date with someone.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 195,
          "content": "He specifically asked her to go as a date, tho. It doesn't make him an asshole for wanting to go on a date, getting denied by X for a date, and choosing to go on a date with Y instead of doing a platonic thing with X. He wanted a date and made that clear from the beginning.\n\nThe only thing OP really did badly was not say anything to X until she brought it up",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 143,
          "content": "Wtf? He asked her on a date she said no. Nta op",
          "id": 85,
          "comments": [
            {
              "score": 15,
              "content": "Yea I don't know what people saying YTA are even thinking lol. This sub in a nutshell I guess.",
              "id": 86,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 103,
          "content": "This is nonsense. So if he'd asked her out to a restaurant that she liked on a date and she said no but she'd like to go as friends, he'd be obligated to take her? No.\n\nThe condition was that it's a date. If she's not romantically interested, he's a gentlemen for not pressing the issue. He is then free to try and start something with someone else.",
          "id": 87,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 43,
          "content": "I completely disagree with you and am frankly shocked this is the top comment.   He asked her on a date and she rejected him.   He even says he was “quite hurt” by the rejection.   And understandably so, being rejected hurts.   And instead of simply turning him down, she first rejects going on a date with him and says instead “but let’s go as friends!”.   I have a hard time imagining anyone male or female having a particularly fun trip with someone who just rejected them.   He didn’t (as far as we know) call her names, tell her he never wanted to see her again, trash her to mutual friends or anything of the sort.  He didn’t even string her along on going to the show together, he told her the next day he was going with someone else.\n\nYou seriously think op is the asshole here?  Those were his concert tickets.  He won them in a raffle and has every right to enjoy his prize.   Would you have fun going on an overnight 2 person trip with someone who just rejected you?   I know I wouldn’t.   Why is op an asshole here?   Because he wanted to take a date to the concert not a friend?   And if he was going to take a friend to the show it doesn’t sound like this girl was a particularly close one anyway and he probably had closer friends who he would have had a better time going with.   This girl really wanted to go to the concert but was more or less neutral about spending time with op so he instead went with someone who was neutral about the concert but really wanted to spend time with him.   Seems pretty reasonable to me.",
          "id": 88,
          "comments": [
            {
              "score": 30,
              "content": "I think a lot of people giving judgements in this sub aren't very realistic about situations like this half the time. I completely agree with you that OP has every right to take someone with him who actually wants to go with him. He was forward with his intentions and got rejected  - to call that \"toxic masculinity\" is just ridiculous.",
              "id": 89,
              "comments": [
                {
                  "score": 14,
                  "content": "I think this top comment was just a justification for them to use the term \"toxic masculintiy\" as if toxicity is only a man's thing lmao",
                  "id": 90,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "> and am frankly shocked this is the top comment.\n\nI'm not. This sub hates men. OP should have kept everyones genders ambiguous if he wanted an unbiased answer.",
              "id": 91,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10544,
      "content": "YTA, but because of the way you initially asked out your friend.  I'm not saying you can't ask her out on a date, but including hotel reservations for a single room in a first date is YTA material for me.  You kind of turned these concert tickets to a band she loves into \"fuck me and you can live your dream.\"\n\nAs far as the secondary situation, she declined your offer and asked if you could go as friends.  I think you should have given her a clear yes/no to that before moving on, but I don't think that would make you an asshole in and of itself.\n\nAs for what your sister was saying, I disagree.  They are your tickets.  It would be nice if you to use them to help your friend see the band she loves, but it's not a duty.  Going to the concert with someone who wants to be there because she likes you is a valid decision.  Also the fact that she turned you down is a reason to not go with her.  That might make the concert very awkward for both of you and ruin the experience.  You are allowed to be hurt by her rejection of you and let it affect your friendship (but not allowed to retaliate against her for it or otherwise be an asshole to her because of it).\n\nLast, separate from the judgement about the specific situation, the way you write about this makes me think you are an asshole.  It doesn't sound like you care much about either woman you asked out except as people who might have sex with you.  I don't know you.  Maybe this is just an artifact of you trying to put the situation down bluntly.  I'm also not saying you can't have a relationship just about sex - I just think using concert tickets as a lever to achieve that is a pretty shitty thing to do.  You can judge for yourself whether this paragraph is on target or not.",
      "id": 92,
      "comments": [
        {
          "score": 4959,
          "content": "Also have to agree about the way he writes. “I have a crush on her although she isn’t exactly my type.” There was no reason to add that except as a way to feel better about being rejected by her. Like she isn’t as cute as the girls he normally dates but he thought he could get in her pants because she likes this band. I think she was smart to say no.\n\nEDIT: I have a feeling the overall judgement would have been different if he had offered fewer details to begin with. If it was simply a matter of one girl not wanting it to be a date, so he asked another girl who did want to date him, then I think more people would have said NAH. His feelings on being rejected, the hotel situation, and his overall tone in the original post seem to have clouded over what could have been a straightforward question. Is he an asshole in general? Possibly. But I don’t think he’s an asshole for wanting to bring a girl that is interested vs. a platonic friend.",
          "id": 93,
          "comments": [
            {
              "score": 2462,
              "content": "[deleted]",
              "id": 94,
              "comments": [
                {
                  "score": 1180,
                  "content": ">she can't understand because she's not a dude\n\nthat one did it for me",
                  "id": 95,
                  "comments": [
                    {
                      "score": 128,
                      "content": "Yep, that was the clincher for me too.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 45,
                      "content": "I hate how men think they’re the only ones who ever get rejected. I put myself out there a lot in high school as a girl. And I got rejected a lot. I’ve been turned down for dates and stood up. I know it’s tough to ask someone out after gathering all of your courage only to be rejected. I once asked a guy out to a movie only to have him not mention his girlfriend until we were there. I got stood up on New Year’s Eve.\n\nI would never ask someone out on a first date with such a high price tag. Asking someone out needs to be low pressure and not “lets share a hotel”",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 133,
                  "content": "[deleted]",
                  "id": 98,
                  "comments": [
                    {
                      "score": 544,
                      "content": "The fact that he immediately had the courage to ask someone else out instead kinda says something else\n\nEdit: My comment was a response to this:  \n>I thought it meant he didnt ask girls out that often hence him not being used to it\n\nI am not in any way saying OP was wrong to ask someone else. If he wants to go there with crush#2 after crush#1 says no (to the date at least), fine, who cares?  \nBut being able to ask people out just like that suggests that it might not be the first time for him to ask someone out. And that's all i was saying. So stop bitching around about me saying that his decision was wrong, you're literally making stuff up lol",
                      "id": 99,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 36,
                      "content": "If he is not used to asking girls out he certainly went all in with asking her to spend the night with him.  That's a lot different from suggesting a shared room with separate beds. Alternatively, this guy is very socially awkward/different and  and misses queues the rest of us take for granted.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "And therefore being annoyed about it. As opposed to hurt, or sad, or disappointed...annoyed that someone refused you just feels entitled. I agree with op of this comment chain yta not because of the tickets but because of the way you propositioned her, yikes.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Yeah the part where he said he was annoyed is what really struck me. You are not entitled to someone, and I understand feeling hurt or upset but there should not be any expectations leading to being annoyed.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "There were so many, it was really hard to choose just one.",
                  "id": 103,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "Mine was putting \"friend\" in quotes like it's a fake thing??",
                  "id": 104,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 921,
              "content": "Was going to mention the same line. I viewed OP as TA immediately after reading that, and then everything else solidified it: mentioning a hotel room on the first date, saying he’ll “think about taking her” because he can’t take rejection, and then the whole “his sister doesn’t understand because she’s not a dude.” \n\nShe doesn’t need to be a dude to see that you’re an asshole, bub.",
              "id": 105,
              "comments": [
                {
                  "score": 24,
                  "content": "Hey there. I hope you enjoy your cake day! 🍰🎁️🎊\n\nYou've been a Redditor for 7 years!\n\nFact about you: On average, your posts have very low text readability.\n\n***\n\n^^^u&#47;SavageGreek&#32;can&#32;remove&#32;this&#32;post&#32;by&#32;replying&#32;with&#32;'!delete'&#32;|&#32;View&#32;my&#32;profile&#32;for&#32;more&#32;info&#32;or&#32;to&#32;provide&#32;feedback",
                  "id": 106,
                  "comments": [
                    {
                      "score": 83,
                      "content": "Wow this bot gives insult as a cake day present. Rude.",
                      "id": 107,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Funny thing is she may have liked him but felt awkward about the hotel situation thinking he was expecting something in return. In this case she might have been onto something.",
              "id": 108,
              "comments": [
                {
                  "score": 7,
                  "content": "Arranging for a separate hotel room would have been the best thing here. Or the date pays for her own room as having an exit strategy is important too if things go south. Don't load the date with expectations. I know people will be like \"look at ms moneybags\" but I would think that accommodation is part of a concert's expenses. Edit: this applies both to the first and second woman.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Either that or he means that he doesn't really like her, but would be with her if they can bang. Which makes it even worse.",
              "id": 110,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "It's total negging behavior and I freaking hate that. I had a friend who ended up having a one nighter with a guy who did that and then she complained that he ignored her after (they worked together).",
              "id": 111,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "Yea it implies she's soooo lucky that he even gave her a chance. How dare she not want to fuck him.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I'm glad I am not the only one who got serious nice guy vibes about this guy!\n\nMy judgment would be NTA for his decision  to go with his colleague as a date, but he is an asshole for how he handled the situation and even more so because he worded it like he only asked his colleague out as a second choice. Maybe even as an attempt to get the girl he asked first to react jealously. I don't know but his way of wording it all just feels ever so slightly off.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "It's like...\n\n*Hey cutie. Lets get a hotel room.*\n\n*No.*\n\n*Well, you're fat and I never liked you.*",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "The hotel was the only real red flag for me... “not my type” (current politics aside) could mean one of many things to me- anything from what you said to body type to interests to personality.",
              "id": 115,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "I'm sorry this is insane. \"I'm developing feelings for someone who normally isn't my type\" is like the basis of all harmless rom-coms. How is he a douche for saying that? Further, if he's just saying that to \"feel better after being rejected\", how does that make him an asshole? It's bad to feel better after being rejected? He could've said so much worse shit too",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1534,
          "content": "I had to scroll down too far to find someone who could articulate how I felt. It was the hotel situation that rubbed me the wrong way more than who he chose to share his tickets with. I wonder if maybe the friend was interested in dating him, just not with the hotel room and the expectation of sex tacked on like that. You could always get a hotel room after the show if things go well, but to preplan it that way just feels a little slimy to me.",
          "id": 117,
          "comments": [
            {
              "score": 500,
              "content": "Me too. Imqgine you don't hit it off and he has already declared you have to have sex? That's way too much pressure",
              "id": 118,
              "comments": [
                {
                  "score": 243,
                  "content": "Reading his comments it sounds like the hotel was not meant as pressure to have sex but more of a convenience thing because of how far away the venue was. I think as a female that’s just immediately the assumption I make coming from a safety/defensive position. He claims that was not his intention.",
                  "id": 119,
                  "comments": [
                    {
                      "score": 340,
                      "content": "[deleted]",
                      "id": 120,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 24,
                      "content": "Exactly. If he'd framed it as - we could share a hotel room to cut costs, no pressure - that'd be somewhat reasonable, but at least how it sounds in the original post, sex is heavily implied. Even if I wasn't particularly into a guy, I might agree to give it a shot if not for that implication.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "I felt that way too! I don’t think he meant it to come off as strong as he did. But it’s not surprising the idea of traveling away with someone you only kind of know, who clearly has a crush on you, and already has plans for them to spend the night together would tweak someone out! \n\nI’m happy your coworker is working out for the better, but it’s apparent a lot of women (and men) would be hesitant about the way you presented your offer",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "It was absolutely his intention. He is just trying to look better after the fact.",
                      "id": 123,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "If that was not his intention, he should've offered two rooms.",
                      "id": 124,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "I dunno, if he actually said it was so they could \"spend the night together\" he'd have to be clueless as hell to not know what that's implying.",
                      "id": 125,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "He said \"we can spend the night together.\" That's code for sex, as the Stones song made clear decades ago.",
                      "id": 126,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 223,
              "content": "Yeah that’s the thing. No the sex isn’t implicitly stated but it is clearly what he’s hoping for and that’s a big jump from kinda sorta flirting to a romantic getaway with the implied expectation of sharing a bed, which would likely lead to sex.",
              "id": 127,
              "comments": [
                {
                  "score": 43,
                  "content": "Sorry to be a human dicktionary but you mixed up implicit with explicit \n\nHave a nice day",
                  "id": 128,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "This. Even if I was into the guy and into the concert, I would've said no to his proposal, or I would have offered to pay for the travel home instead. No way would I put myself in a situation where sex is kind of expected and as a first date I won't know if he'll accept if I don't want to, and not have an out as we're in the same room. As a female we're constantly looking for red flags with dating because of our previous experiences and hearing about others, this would have raised one for me.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Feeling a sexual pressure that is implied is a surefire way to have anyone decline the invite. You want a gal to choose you, not feel obligated to sleep with you.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Couldn't agree more. She wanted to go as friends because she was interested in spending the day with him (and not just because she likes the band), but didn't want to create an awkward situation at the end of the night. \n\nThe sad and ironic thing is, that if the above is true and she did like him, she definitely doesn't anymore.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 657,
          "content": "This is so clearly articulated!\n\n- YTA for asking a friend out in that manner and using tickets to an artist she's a fan of, transactionally\n- NAH for not taking the friend, though should have been more clear\n- YTA for having that attitude about women, where it's about gaming your way into sex",
          "id": 132,
          "comments": [
            {
              "score": 169,
              "content": "[deleted]",
              "id": 133,
              "comments": [
                {
                  "score": 112,
                  "content": "\"Think about it. She’s out in the middle of nowhere with some dude she barely knows. She looks around her, what does she see? Nothing but open ocean. 'Oh, there’s nowhere for me to run, what am I gonna do, say no?'\"",
                  "id": 134,
                  "comments": [
                    {
                      "score": 21,
                      "content": "\"It's because of the implicaton. How you not getting this? Your making out to be some sorta monster!\"",
                      "id": 135,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "the danger is implied",
                  "id": 136,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 505,
          "content": "[removed]",
          "id": 137,
          "comments": [
            {
              "score": 307,
              "content": "[removed]",
              "id": 138,
              "comments": [
                {
                  "score": 81,
                  "content": "That's the exact part that made him TA for me. I couldn't put my finger on how I just instinctually knew he was an asshole even if he didn't actually do anything objectively assholey, and that was it.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 17,
                      "content": "That, and the 'can't understand cause you're not a dude'.",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "> lead on and used\n\nYou consented. There was nothing wrong with whoever told you whatever to get you to consent.\n\nIf you didnt consent, you have option to pursue. Best of luck!",
              "id": 141,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 248,
          "content": "This is the response I was wanting to type but couldn’t find the words. The stakes are just too high op. This is a date after you’ve been going out for a while and really vibe. It’s a lot of pressure and it would make me feel very uncomfortable if we’ve only been flirting and suddenly we’re sharing a bed. \n\nNot the asshole for picking someone else and it is his ticket. In the future, I would really have just said “well I was hoping for a date so I don’t think this will be a good idea.” Or something along those lines.",
          "id": 142,
          "comments": [
            {
              "score": 19,
              "content": "I think even if it was two beds it would be a bit much for date 1.  Normal hotel rooms aren't the biggest, you can usually hear what the person is doing in the bathroom, she'd have to change in the bathroom, he'd have to change in the bathroom.  I mean, even without sex a hotel room is generally a more cramped experience that doesn't leave a lot of room for privacy.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 161,
          "content": "Yeah to me it would feel really creepy to be asked to a concert and then expected to share a hotel room as a date with someone I've never dated before.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "Was gonna comment on this post but you've summed it all up pretty well. Agree with you 100%",
          "id": 145,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "This is a very reasonable comment and I completely agree. OP definitely seems to have some very unrealistic expectations for a concert date.",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "The hotel room thing after he gives her a free ticket/takes her to a concert has... implications.",
          "id": 147,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "Totally agree like why the hotel room? That's really weird especially since you guys dont have an established relationship or anything.",
          "id": 148,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8270,
      "content": "[deleted]",
      "id": 149,
      "comments": [
        {
          "score": 2304,
          "content": "Exactly, so many people are assuming \"I'll think about it\" is accepting the counter offer",
          "id": 150,
          "comments": [
            {
              "score": 1194,
              "content": "It's pretty obvious that it means \"hell no unless I really can't find better\".",
              "id": 151,
              "comments": [
                {
                  "score": 443,
                  "content": "Which he found better, in his terms. But he probably should have communicated that to girl 1 as soon as girl 2 accepted the date offer.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 251,
                      "content": "He doesn't own girl 1 jack shit after saying \"I'll think about it\" which is \"no unless I change my mind\".",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "in his defense:\n\n> Today, i asked my female coworker to go with me to the concert as a date.  ...  But just now, the friend who I asked originally asked if we were still on for the concert. \n\nSo he told her within the day. It's not like he waited a few weeks until right before the concert to say something to her. I think it's probably reasonable that he asked girl 2 out at work, then either was thinking about how to let girl 1 down or wanted to tell her over the phone which he may not be able to do at work. Still the guy writes like a total douchebag.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Yuuuup went through this situation recently. \n\nWhy would you want to go with someone who doesn't like you.... It's not about getting laid but we are all looking for that special someone",
              "id": 155,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "That's younger female speak for \"I'll get something for free and wont have to worry about breaking up if something better comes along\"",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "So many people here never dated lol\n\nPeople asking relationship AITA here should not take the replies so seriously as most people here are fake online and or losers irl.",
              "id": 157,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Or even the person right above this one says hes TA because he included the hotel in the first date...? Like, if you're not into that then that's fine, and say no, but it's not like OP was unclear, or a jerk for being very up front with a girl about what his expectations were.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 830,
          "content": "Agreed. The top comment about his “toxic masculinity” is just absurd. He was looking for a date, she countered with going as friends. He didn’t want that. He found someone who wanted to go as a date. It’s his tickets. He can take who he wants.",
          "id": 159,
          "comments": [
            {
              "score": 332,
              "content": "Yes! I really don't understand how this is \"toxic masculinity.\" He clearly asked her out on a date and she doesn't want to date him, he's not obligated to take her just because she really likes the band. I can see how having a hotel reservation near a concert would be really ideal (if you're going to have to drive to different city for the concert, planning on drinking, and given how late some concerts go). Also, some women and men like to get laid on the first date. Yup, women too. And there's nothing wrong with that. It seems like some people are almost slut-shamming the girl who's interested in him for saying yes. He probably should have first asked if she wanted to go to the concert with him as a date, waited for an answer, and if yes then offer to reserve a hotel room. But the way he asked doesn't make him TA here. Frankly, she's TA for asking to still go with him as friends. It just seems cruel to say no to a date and then expect to go as a friend, but maybe that's just me. I know I wouldn't want to go with a guy I asked as a date and he just wanted to go as friends. I think it would have the whole experience really awkward and less enjoyable. Just because a guy asks, a woman isn't obligated to yes to a date. And in return the guy isn't obligated to still take the woman out but just as friends. \n\nNTA, hope you have fun on the date.",
              "id": 160,
              "comments": [
                {
                  "score": 118,
                  "content": "I swear these days \"toxic masculinity\" just means \"any time a guy does something I disagree with.\" Top comment in this thread is total bs.",
                  "id": 161,
                  "comments": [
                    {
                      "score": 32,
                      "content": "This is what reddit has become. A bunch of SJW buzzwords. Sometimes I wish we'd enter a post-apocalyptic world so these kids can see true \"toxic masculinity\".",
                      "id": 162,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "As soon as she said it’s toxic masculinity I laughed out loud.",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Because people who think this is toxic masculinity are entitled. \n\nIf she only wants to go as a friend and you were offering a date, she's trying to get the benefits of a date without the emotional investment. OP is clearly looking for a date and probably a lil more.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "It's \"toxic masculinity\" to people projecting their insecurities and overthinking about phrases he used.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Omg I love you guys.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "It's not because he offered a concert date, and turned her down for going as \"friends\".  That part is perfectly fine and not toxic masculinity at all.\n\nCommenting that his sister  \"can't understand because she's not a dude\" on the other hand... c'mon, do you seriously think girls are so stupid they don't understand you just want to fuck?  That girl understood just fine what he meant when he said they could share a hotel room, lol.   Making sex a condition of a first date to see a band you like is part of it.  And the way he commented that he was \"annoyed\" by the rejection comes off as much more asshole-ish than otherwise, because annoyed carries a connotation of anger.  Being angry a girl won't fuck you is definitely a hallmark of toxic masculinity.",
              "id": 167,
              "comments": [
                {
                  "score": 6,
                  "content": "A couple issues with this argument I see:\n\n1. She outright declined the date aspect. She didn’t say “yeah I’d love to go as a date, just not comfortable sharing a hotel room,” she said she did not want it to be a date in any form. If sharing a hotel room is really the concern, there’s far better ways to express it.\n\n2. Sharing a hotel room doesn’t automatically imply sex or even wanting sex. If the concert was far away, or if they were planning on drinking at the concert, a hotel might be a good option. Nothing in OPs post indicated that he specifically wanted to fuck her on the first date.\n\n3. From what it sounds like, OP has known this girl for a bit anyways. It’s not like he just met this girl yesterday and asked her to go stay in a hotel with him. He said he’s known her for a year prior, presumably hanging out with her as a friend and such. So yes it still would be a “first date” but it’s FAR less weird sounding than people are making it out as.\n\n4. I find it strange that OP is being criticized for telling her she doesn’t know what it’s like to date as a man. Women are literally *praised* for telling men “you don’t know what it’s like to go through child birth,” or “you don’t know what it’s like to be harassed as a woman,” or “you don’t know what we go through to get ready every day.” But as soon as he says “I’m a dude, I think I know what it’s like being a dude better than you,” he’s displaying toxic masculinity? Wtf is that?\n\n5. Most people would be annoyed after getting rejected. Are we really gonna pretend there’s any sizable amount of people who don’t get bothered by rejection? It sucks, and he’s rightfully upset that she didn’t want to go on a *date* with him. Nothing about his post implied that he was just pissed that she won’t fuck him. Because again - she could have easily brought up her uncomfortableness with a hotel room and still gone on a date. He even said himself that he was fine with it in the edit.",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Seriously. We went through this last week. When it was a females ticket everyone was saying the logical thing \"Her ticket so she can univite if she wants to.\" Now that the roles are switched people shouldn't be having a completely different opinions. [Here is a similar case where the top comments were completely different.](https://www.reddit.com/r/AmItheAsshole/comments/bzb29o/aita_for_publicly_calling_out_my_ex_for_not/)",
              "id": 169,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 496,
          "content": "I agree that he was under no obligation to still go with her, but he still should have told her he was rescinding the offer before he asked someone else. Not doing so was definitely an asshole move.",
          "id": 170,
          "comments": [
            {
              "score": 284,
              "content": "He didn't rescind it entirely likely because if the other girl rejected him he would have gone with her as friends. I don't think that's a difficult thing to see",
              "id": 171,
              "comments": [
                {
                  "score": 28,
                  "content": "Yup.  She relegated herself to being the backup.",
                  "id": 172,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I mean she just didn’t want to go on a date with him. There’s nothing wrong with that it just means she probably wouldn’t be his first choice to take to the concert because he wants to bring a date.",
                      "id": 173,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 94,
              "content": "What if his coworker had said no, too? Then he probably would’ve taken the first girl. It would’ve been weird to rescind the offer just to ask the coworker out, which wasn’t necessarily a sure thing, and then come back to the first girl.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Why would he need to rescind the offer?  She already rejected the offer.  She wanted a different offer he never offered.",
              "id": 175,
              "comments": [
                {
                  "score": 8,
                  "content": "Exactly, especially since he said “I’ll think about it,” and not “okay that’s fine” etc.",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "No, I was in a similar situation. There was a girl I liked and we went on a date and hit it off. We talked about seeing the new Godzilla movie together which we both really wanted to see. A week later she ended it with me because she lives 40 minutes away from me and has no intention of ever moving out of her town and didn’t expect me to either. Then she said that she still wanted to see Godzilla with me but as a friend. I told her I’d think about it, but after that we essentially stopped talking. Then a few weeks after that another girl I was close with revealed she had feelings for me and we started dating (we’re currently dating and I’m really into her) and we saw Godzilla and in haven’t even talked to the other girl and I honestly don’t feel like I owe her an explanation or anything. All I said was “I’ll think about it” and then we stopped talking.\n\nLikewise, even if OP seems kind of weirdly fast with the hotel room stuff, he doesn’t owe this girl anything.\n\nNTA",
              "id": 177,
              "comments": [
                {
                  "score": 7,
                  "content": "Frankly I think going back with an explanation would be weird. It's like you're rubbing their nose in it.\n\nIf they ask for an explanation, sure give an honest one, but don't just give one unsolicited.",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 341,
          "content": "[deleted]",
          "id": 179,
          "comments": [
            {
              "score": 147,
              "content": "It’s seems too forward to me. Like, at least test the waters. “Hey it’s far away, would you be interested in spending the night over there? We could look at hotels.” That’s way different than “wanna come with? I’ve already got a room booked!” \n\nMore of a rooky mistake than anything. Lacking social awareness, I’d say. That alone isn’t the most asshole-ish thing though",
              "id": 180,
              "comments": [
                {
                  "score": 9,
                  "content": "Edit: I clearly misunderstdood u/Toomuchmeow's response.\n\nRookie mistakes aren't asshole behavior. Has to have context that makes them so.",
                  "id": 181,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "You don't know that isn't what he said though... just because he didn't transcribe the entire conversation verbatim doesn't mean he didn't explain it smoothly enough.\n\nAnd the other girl said yes... so...",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Yeah his offer to the first girl sounded like \"Hey you can go see your favourite singer but you have to have sex with me as payment\".  \nYTA",
              "id": 183,
              "comments": [
                {
                  "score": 31,
                  "content": "Even if she was possibly interested in him at one point, I can see being taken for granted that she’d share a room as offputting.",
                  "id": 184,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 123,
          "content": "Except human interactions aren't just a page of contract law. You can't expect to go about these situations on technicalities and not hurt anyone.",
          "id": 185,
          "comments": [
            {
              "score": 18,
              "content": "\"just a page of contract law\" is a radical simplification of how much thought goes into the human interactions that resulted in that page.\n\nOffer. Guy asks girl on date. (Romance)\n\nRejection. Counter offer. Girl asks to go as friends. (Platonic)\n\nGuy says \"I'll think about it\". No acceptance. No contract has been formed.\n\nIf she made/cancelled plans around going you might have an argument for detrimental reliance but her reliance wasn't reasonable based on his response.\n\nPeople will get their feelings hurt no matter what you do. Whether their hurt feelings are reasonable in light of the circumstances is another thing entirely. Here, guy is NTA.",
              "id": 186,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Do you mean NAH (no assholes here)? It's not clear who you think the asshole is.",
          "id": 187,
          "comments": [
            {
              "score": 3,
              "content": "She would be the asshole if she expects him to still take her to the concert, which apparently she does.",
              "id": 188,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "Lots of entitled \"nice girls\" in this thread. If you reject someone he's allowed to be hurt and you're not entitled to his time or in this case free concert tickets.",
          "id": 189,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "THANK YOU! this is the right answer and I cannot believe the bloke is being labelled Toxic for his decision!",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "This 100%, and everyone wanting to believe this is anything but justified is jumping to conclusions or reading the post they want to read it. The dude wanted to go on a date, she refused and so he asked someone else. It’s irrational to be upset over it or think he’s being a douche for going with someone else who actually said yes to the date. The first girl had zero claim to the ticket once she said no to the initial offer and he said “maybe” to the counter-offer. \n\nIf I offered you a banana for $1 and you said “no but would you accept a pine cone for it instead?” And I responded with ‘maybe,’ I am well within my rights to sell my banana to someone who actually wants to take it for $1.",
          "id": 191,
          "comments": [
            {
              "score": 5,
              "content": "I'm interested in how many of the women commenting on his behaviour for leaving the offer hanging have used the exact same excuse countless times themselves.",
              "id": 192,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5672,
      "content": "NTA, people on this sub are really stupid. Don’t think about this as a concert, think about it as a date. Imagine if he had booked a reservation at a nice restaurant. He asks girl 1 out, she says no, but still wants to go to dinner. He asks girl 2, she says yes and that’s that. Sure he could just ditch the date and try to make another friend, or he could just not. LITERALLY NO ONE on this sub would freak if u had asked a girl out, and she had said no, but still wanted to go to dinner. The important thing to remember here is that he specifically asked FOR A DATE, not just if girl 1 wanted to go to the concert. He is INTENTIONALLY seeking out a date. If girl 1 is allowed to say no to a date proposition, he is allowed to say no to taking her out anyway as a friend. Ya’ll who are saying he is TA is just fucking stupid.",
      "id": 193,
      "comments": [
        {
          "score": 1505,
          "content": "This! NTA.  It’s a date, which she’s not interested in.  Obligation ends there",
          "id": 194,
          "comments": [
            {
              "score": 11,
              "content": "People seem to be hung up on the fact that it's a concert and not dinner. Because apparently attending a concert you're interested in is \"living your dream\"",
              "id": 195,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 554,
          "content": "All these metaphors don’t work for the simple reason that the hotel room was a part of the “date”. He was pressuring her into sex before they even got there. Had she not said that it wasn’t a date he would have felt entitled to sex once they got to the hotel. She was being cautious and OP basically said no tits no ticks.\n\nEdit: I saw OP’s update, and his intentions were probably not the worst, but my points still stand. \n\nAs a girl you sometimes have to be extra careful. A guy can say one thing and be totally respectful, and then turn into a total “niceguy” later. As a girl sometimes you have to expect that the guy expects sex, and act accordingly for your own safety. \n\nYes, adults are capable to maturely share a room without sex a city over, but since he wanted it to be a date, it’s not unreasonable to worry that he might change his mind and expect sex. Sometimes its hard to clearly communicate no when your basically stranded in a hotel room with a guy, you might even feel like you owe hime sex even if you don’t want to. Her saying no to the date might have just been to cover her bases that absolutely nothing would happen in the hotel. \n\nHow ever everyone is right in saying there is nothing wrong in meeting up for sex between two consenting adults. I just feel like the way he approached it and then left her hanging was kinda rude, not wrong, just rude. Assholes aren’t always wrong, just rude.",
          "id": 196,
          "comments": [
            {
              "score": 904,
              "content": "He has every right to, he didn't hide his intentions, he made them crystal clear. People sometimes want sex. End of story.",
              "id": 197,
              "comments": [
                {
                  "score": 511,
                  "content": "I am completely on board with people being crystal clear about their wants and expectations. It really helps make sure everyone knows what's going on and what to expect. I think OP did a good job communicating hid expectations and wants.",
                  "id": 198,
                  "comments": [
                    {
                      "score": 910,
                      "content": "This sub: \"Communication is important in a relationship\"\n\nAlso this sub: \"Wow, you're a total creep for communicating your intentions and moving on with no problem after she declined the offer\"\n\nI don't get it",
                      "id": 199,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "LOL people are getting their panties in a twist because of the hotel room shit. Like its 2019... people hook up through tinder all the time and have the gall to call OP the asshole for implying sex.",
                      "id": 200,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yes, but you don't treat friends like this.",
                  "id": 201,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "I think he is extremely blunt. But he isn't being deceptive or manipulative.",
                  "id": 202,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Yea wtf, it's 2019.  We should praise this man for at least being honest.  This isn't someone with power like a boss coercing her into sex.\n\nThis is one grown up telling another what he's looking for.  Not everyone wants strings attached to sex.\n\nAlso we don't even know if he was requiring sex either.  Maybe it was far away and they were going to be too drunk to drive home.",
                  "id": 203,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Just cuz he made his intentions clear doesn't mean they weren't douchey lol",
                  "id": 204,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 404,
              "content": "He wasn’t pressuring her. He suggest a hotel room. She said no.",
              "id": 205,
              "comments": [
                {
                  "score": 347,
                  "content": "Right? So much pressure being asked once. Holy shit.",
                  "id": 206,
                  "comments": [
                    {
                      "score": 47,
                      "content": "[removed]",
                      "id": 207,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "He asked once, she said no, and he accepted it.  I can't believe how much he's pressuring her.  Doesn't he know that no means no?!",
                      "id": 208,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Some people are very fragile I guess. “Hey wanna go to this concert? Also, I booked a hotel so if you come we’ll be spending the night there” EEEEEK RAPE RAPE PRESSURE PRESSURE",
                      "id": 209,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "The really sad thing here is that everyone saying he tried to \"pressure\" her are indirectly arguing from a viewpoint that infantalizes women, making it seem as if they're incapable of standing up for themselves or making adult decisions that includes them owning their sexuality.\n\nHim inviting her on a date with the implicit or explicit expectation of sex after the concert isn't \"pressuring\" her. She's an adult. She's able to decide if that's something she's up for and she made the decision to decline his offer because it turned out she wasn't and he moved on in a mature way.\n\nThat isn't pressure. The way OP handled this situation is **exactly** how it should be handled by mature adults and the gold standard for how we want men to act in the era of #MeToo.",
                  "id": 210,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 311,
              "content": "Am I the only who read that the concert is in another city nearby? I don’t know how far it is but I assumed it’s an hour or two away and I wouldn’t want to drive right back after concert and drinks. Hence the hotel room. NTA",
              "id": 211,
              "comments": [
                {
                  "score": 187,
                  "content": "If OP is in the Midwest, “another city nearby” could be up to three hours away. Pretty irresponsible to drive hours after a concert and probable drinking imo",
                  "id": 212,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Yeah, concerts end pretty late.",
                      "id": 213,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Up to? KC and STL are at least 3.5 hours, without stopping to pee.",
                      "id": 214,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Exactly, and he suggested splitting the room to save costs.",
                  "id": 215,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "You aren't the only one, but judging by the top comments, you are definitely in the minority. I guess people who live in giant cities that always have big concerts have a really difficult time understanding that not everybody can Uber to and from the concert.\n\nIf we live in San Diego and the tickets I won are for a concert it is in LA, I am not making that drive after the concert. If he didn't suggest a hotel room, her next question was going to be \"what are we going to do after the concert?\"",
                  "id": 216,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 95,
              "content": "She had the option to accept the date but not sharing a bed, she didn't go with that.",
              "id": 217,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "She flat out said she isn’t interested in dating right now, that’s not being cautious that’s being extremely clear about your position. Imagine if OP badgered her further then he’d actually be TA.",
              "id": 218,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "He was asking if she wanted to be *romantically involved*, like \"*&HOTEL L8R, 'YAM SAYIN'??*\". **Pressuring** somebody into having sex is guilting them by whining, or asking repeatedly, or downplaying the sex, or playing up how much she would 'owe'(!) him, or any shady shit that is manipulative and **NOT** upfront.\n\nNTA for sure. And he gets an award for being upfront about his intentions EVEN IF it's weird shit that would creep the average person out.\n\nAnd NO, there's no reason to think that he would feel entitled to sex! If she said \"no\" now and he BACKED OFF, then that's an in(!)di(!)ca(!)tion(!) that he *understands* boundaries!!!",
              "id": 219,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "> pressuring her into sex \n\nLMAO",
              "id": 220,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": ">OP basically said no tits no ticks. \n\nWhich is fine because he made his intentions crystal clear to the girl. Good for the girl for not getting herself into an uncomfortable situation and good for the dude for making stuff clear and acting on his needs and desires rather than agreeing to the girl's platonic date and then attempting to force himself on her like many other toxic masculine guys would have done",
              "id": 221,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Pretty big assumption that op would feel entitled to sex.",
              "id": 222,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Look at his update and don't implicate anything.",
              "id": 223,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "> NTA, people on this sub are really stupid.\n\nNo shit. The collective advice on here is on par with a 90's daytime talk show audience. If you ask someone on a date and they say \"No\", you have every right to.....not go out with them! No explanation needed.\n\nPeople be like, \"Nono. He asked first! No takebacksies! That's how real life works! He owes her a concert now, the pervert!\" If a woman decided to back out of a date for any and all reasons, Reddit would support her 100% for taking charge of her personal life and not feeling obligated to go through with something she didn't really want to do. \n\nThat is exactly what this guy did and they're calling him an asshole for it. The idea that he is required to go on a non-date date with someone who refused a date date is up there with the worst ideas I've heard on this website.",
          "id": 224,
          "comments": [
            {
              "score": 14,
              "content": "But shouldn't it be NAH then? Because I don't think the girl is TA since she didn't say anything about it",
              "id": 225,
              "comments": [
                {
                  "score": 6,
                  "content": "She isn't an asshole unless she talked to th sister about it and asked her to intercede on her behalf calling it douchey behaviour.",
                  "id": 226,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "The sister is the asshole here.",
                  "id": 227,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "I think the issue here is that he straight up told her that they would be sharing a hotel room and spending the night together. For what appears to be a first date, this is super presumptuous.",
          "id": 228,
          "comments": [
            {
              "score": 8,
              "content": "Even if the plan is 'concert and sex' how is that an issue? She could say no and suggest something else which she did. I fail to see the 'assholery' even in that scenario.",
              "id": 229,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "I feel like a lot of times on this sub, responses are flooded by people that have either been in a similar situation or are the gender of the person being screwed over or whatever.  I’m guessing most of the YTA responses are from women that think the guy is sleazy.",
          "id": 230,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "> people on this sub are really stupid.\n\nThank you so much. You have to be a real stuck-up c*** to think OP is being an asshole. He was CLEAR from the start that he wanted a date. She said no. Suuuuuuuper basic.",
          "id": 231,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "The hotel sleepover. You forgot about the first date hotel sleepover.",
          "id": 232,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3374,
      "content": "I’m gonna say NTA because you made it clear you wanted a date. And no one is owed a concert ticket.\n\nEdit: As a woman if I invited a man to something as a DATE (aka romantic) and he said he only wanted to be friends I would definitely take a guy who was romantically interested in me. Because I said DATE not friends hanging out. It’s not like the ticket was hers in the first place, nothing was taken from this girl.",
      "id": 233,
      "comments": [
        {
          "score": 282,
          "content": "Thanks for flipping the genders in your edit, it always puts thinks in perspective when people do that",
          "id": 234,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 34,
          "content": "Yes, exactly. Also if she knows that he is interested in her as a date how can she accept that offer anyway. If she really wants to go to the concert because she is a fan, she can buy her own ticket and go. I could never accept a guy paying for my ticket... especially, if I know he only does so because he likes me. It would feel like I was using him! Come on!",
          "id": 235,
          "comments": [
            {
              "score": 8,
              "content": "This! This is the comment that should be getting all the awards!",
              "id": 236,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "👍👍👍",
          "id": 237,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I wish I could upvote this twice.",
          "id": 238,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Honestly, how shitty would it have been for him to have taken her either 1) without stating his intentions or 2) still bringing her along after she stated *her* intentions and made her feel awkward for having it not be a date.",
          "id": 239,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Correct. Imagine someone proposing their girlfriend but the girlfriend is like \"nah, but can I keep this expensive ring as a friend?\". Hell no. If you're not interested romantically, just say no.",
          "id": 240,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2528,
      "content": "NTA. Can people in this sub not read? He said he asked her \"FOR A DATE\", if anything she is the ass for saying that she wanted to go but on different terms than he laid out. If she was asked on a date and refused then she has declined the offer. It ain't hard.",
      "id": 241,
      "comments": [
        {
          "score": 607,
          "content": "Totally agree. No I don’t want to go out with you but you can still take me to the concert? Really? NTA",
          "id": 242,
          "comments": [
            {
              "score": 408,
              "content": "\"Hey, do you want to go to dinner and a movie?\"\n\n\"Not with you, but you can just venmo me for the restaurant bill and movie tickets...\"",
              "id": 243,
              "comments": [
                {
                  "score": 112,
                  "content": "Basically what these YTAs expect.",
                  "id": 244,
                  "comments": [
                    {
                      "score": 83,
                      "content": "The problem is that we're extremely outvoted.  The top 2 YTAs have almost double the votes of *everything* else.  There's still about 6 hours to turn it around before a verdict is tagged to OP's post, but I just don't see it changing fast enough.",
                      "id": 245,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 79,
              "content": "This right here. The offer was a date, end of discussion!! NTA.",
              "id": 246,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 152,
          "content": "I think this is an excellent point, actually, and the fact that you're the only one I've seen who's raised it really points out the gender bias in this sub (as MANY others have already commented on in this post). It's pretty freaking entitled for someone to reject the person asking them on a date but still ask that the date activity take place.",
          "id": 247,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Why would she be an ass for not wanting to go as a date, and only platonicly?",
          "id": 248,
          "comments": [
            {
              "score": 7,
              "content": "She isn't just as he isn't for asking her to go romantically. And in return he isn't an asshole for saying no just like she isn't. Nagging his sister about it and having her intervene is an asshole move whether it was her or the sister's idea.",
              "id": 249,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 18,
          "content": "I think this is more NAH. He laid out very honestly what his intentions were, and the first woman said no but wanted to go as friends. I don’t think that’s shitty of her. He said “I’ll think about it” which is clearly neither a yes or no. He found someone willing to go as a date (note: unless OP is throwing a lie of omission he never expressly says they’re gonna fuck. Sharing a bed and banging are not the same.) \n\nFinally, the sister has every right to think OP is a douche for it, because I can absolutely see why she’d say that.",
          "id": 250,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "If it's NTA, who's the asshole?",
          "id": 251,
          "comments": [
            {
              "score": 37,
              "content": "That would be the sister for making a scene about the tickets. The first friend is absolutely, unequivocally, not entitled to his tickets.",
              "id": 252,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Definitely the sister for calling him douchy for not taking girl one. He was nta, not that douchy at all.",
              "id": 253,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "His sister for calling him \"douchey\" over this situation.",
              "id": 254,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "The sister.",
              "id": 255,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "\"Would you like to go on a date to the fancy restaurant in town?\"\n\n\"No, but I love that restaurant. Can you just take me as a friend?\"",
          "id": 256,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1542,
      "content": "For some reason when I read the title I was thinking OP gave his own ticket to another girl to go with the friend. Boy was I surprised when I read on. I think this is a combo. OP is not obligated to take the friend but just the way he talks about women kinda irks me. NAH in this situation but thinking maybe is TA in life sometimes.",
      "id": 257,
      "comments": [
        {
          "score": 466,
          "content": "Yes, he sounds like an asshole.  Regardless if he isn’t in this instance.",
          "id": 258,
          "comments": [
            {
              "score": 319,
              "content": "Yeah, that’s my gut feeling, and I’m a dude.  “Wanna go to this show together and then fuck afterwards?”   I’d wager she might be feeling like a prostitute, too.   “No fuckin’, no tickets.”    He’s the asshole.",
              "id": 259,
              "comments": [
                {
                  "score": 89,
                  "content": ">only a man could understand\n\nYeah totes no creepy vibes here.",
                  "id": 260,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "[deleted]",
                  "id": 261,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": ">\tNo fuckin’, no tickets. \n\nBasically the TL;DR of the post.",
                  "id": 262,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Can you quote that in the OP? I missed that\n\n\nOh..you're taking out your asshole lol. That's most people in this thread with your poor judgement. Haha",
                  "id": 263,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "That's the part that twists it up. If he asked her on a date and she said no, then he moved on and asked someone else on a date, that's just normal every day stuff. It's the \"and get a hotel room\" that is really off. Also the annoyed that she turned him down part too?",
                  "id": 264,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 290,
          "content": "NAH But i think the same, OP way to speak about women makes me think he's an ass with them in general.",
          "id": 265,
          "comments": [
            {
              "score": 91,
              "content": "A \"niceguy\".",
              "id": 266,
              "comments": [
                {
                  "score": 19,
                  "content": "Sounds like he has no issue getting dates and doesnt try to get laid by being a nice friend. So I don't think your description fits",
                  "id": 267,
                  "comments": [
                    {
                      "score": 17,
                      "content": "A niceguy is someone who acts nice to try and get laid, but is only being nice in a superficial, intentional sense, rather than just genuinely treating someone well. \n\nOP invited this girl to see a singer she really likes, which is nice, but made it contingent on sleeping together. He said spend the night together which is clearly asking for sex, but is intentionally left technically ambiguous so he can cover his ass if she says no and say it was all innocently about saving money on one hotel room.",
                      "id": 268,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "The issue isn't getting laid. \"Nice guy\" label isn't reserved for virgins. The issue is the perception of sex & women. Not the quantity.\n\nIt's how OP described the women and their interactions with him that set off the \"nice guy\" vibes. He can be honest about what he wants.(which he fully wasn't as he didn't turn down the friend even though he was definitely not going with her) He can take whomever he pleases as well. \n\nJust the highlights. As they still need to be part of the whole for them to make sense. \n\n>...have a crush on her although she isn't exactly my type.\n\n>...I was annoyed that she turned me down. \n\n>**But just now,** the friend who I asked originally asked if we were still on for the concert.\n\n> I said she can't understand because she's not a dude.\n\nE: Missed a quote and word",
                      "id": 269,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "False. A nice guy would take her anyways after she said she wanted to just be friends in hopes of something more happening and getting upset when nothing happens.  He wanted to take her on a DATE.  She said NO.  Why is he an asshole for wanting to take someone else on a date then?",
                  "id": 270,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I felt the same. He sounds like he's got a bit of a bro-y douchebag attitude towards women but nothing about this situation specifically seems particularly asshole-ish. He wanted a date, she didn't, he found someone who did.\n\nA lot of the people saying YTA seem to be offended that he could possibly want to have sex on the first date. He seemed pretty clear about his intentions, imo and while that's not everyone's jam, some people just want to bang.",
              "id": 271,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 269,
          "content": "Well that's just cause you're not a dude.\n\n/s",
          "id": 272,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 268,
          "content": ">I have a crush on her although she isn't exactly my type. \n\nThis line specifically made me roll my eyes. That's a line to save his pride.",
          "id": 273,
          "comments": [
            {
              "score": 31,
              "content": "Me too. Why invited a girl if she isn't his type? Denial....",
              "id": 274,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "See, my issue with some of these \"read between the lines\" things is that it often isn't meant this way.\n\nIf he had said this after mentioning the rejection, then I'd agree, but I've had crushes on girls that I wouldn't have thought I'd be interested in, and this could just be a case of his thoughts running around a bit and giving some unnecessary information.\n\nI'm not saying you're wrong, and some of the other language does seem to hint that you might be right (\"not used to getting rejected\") which makes me think it might be as you say (\"I'm normally into prettier girls\" or something similarly slimy) \n\nWe don't know enough about OP to make snap judgements, but I do agree that, once pointed out, this did make me wonder about OP.",
              "id": 275,
              "comments": [
                {
                  "score": 14,
                  "content": "But why was it a necessary detail to include if this genuinely was OP's case? Her not being his type had no bearing on the issue at hand.",
                  "id": 276,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Just because it is irrelevant doesn't mean you can impose secret intentions on it.",
                      "id": 277,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": ">If he had said this after mentioning the rejection, then I'd agree,  \n  \nAnd he did, because the rejection had already happened when writing this.",
                  "id": 278,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "No shit. After all the crushes I've had I've come to realize I don't really have a type.\n\nIf she's got a nice smile and makes me laugh I'm already half way in love.",
                  "id": 279,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 51,
          "content": "> the way he talks about women kinda irks me.\n\nThe \"I like her but she's not totally my type\" line was a huuuuuge red flag. It reads like those men who do a total 180 and say \"wow you stupid fat bitch i didn't like you anyways!!\" after their flirting gets turned down.",
          "id": 280,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 47,
          "content": "Yeah exactly. He's not the asshole for what he did in this situation specifically, which is why he came here posting to get judgement on, but from the way he's written this it doesn't mean he couldn't likely be a general asshole. He ain't wrong for what he did here but he sure does sound like a dick.",
          "id": 281,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "NAH but in life TA expresses what I've been thinking. What bugs me is men who think being friends with women is just not valuable at all. If they're not getting laid, and the person isn't related to them, then a woman has no value. What a sad way to live.",
          "id": 282,
          "comments": [
            {
              "score": 5,
              "content": "Although I agree with your sentiment it can go two ways. What if spending time with her is just hard for him right now because he has a crush? Women don't always want male friends who are harboring feelings either.",
              "id": 283,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": ">NAH in this situation but thinking maybe is TA in life sometimes.\n\nI think that about sums it up. It doesn't sound like he's even that into the second girl - he just feels that he's more likely to score with her. Their personalities or whether or not they're good company don't seem to factor into how he views them, and that skeeves me out a bit.",
          "id": 284,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "I think you nailed the way I feel about this whole thing:\n\n1) It's not an asshole move to offer a date to someone else after a rejection\n\n2) It's not an asshole move to suggest getting a hotel room after a date. Doubly so if there's an actual _reason_ for it like being in a different city for a gig.\n\n3) His general attitude towards women seems kinda assholeish.\n\nSo the *situation* is NAH. \n\nHowever, OP may potentially be an asshole, but we're working with a limited data set here of this one post.",
          "id": 285,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Your comment is too far down. I agree. For the situation described by OP, he's NAH. \n\n*HOWEVER*, at the same time, OP deserves the YTA tag. Not because of his final choice, but the way he apparently views women. Again, he can take whomever he pleases, no issues there. He can also be honest on what he wants.\n\nIt's just... Ugh...\n\n>...have a crush on her although she isn't exactly my type.\n\n>...I was annoyed that she turned me down. \n\n>**But just now,** the friend who I asked originally asked if we were still on for the concert.\n\n(Lol, no shit. You left her hanging instead of turning her down)\n\n>I said she can't understand because she's not a dude.\n\nOP shows a few red flags that he fits the \"nice guy \" jerk stereotype. Which hopefully this is a a lie and he is just fishing for karma.",
          "id": 286,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 837,
      "content": "NAH. It is alright to want to use your concert cards for a date oppertunity. She didn't want to. You found someone else who wants to. Thats a totally fine approach and you still can be friends with her.",
      "id": 287,
      "comments": [
        {
          "score": 192,
          "content": "NAH is probably the right response",
          "id": 288,
          "comments": [
            {
              "score": 120,
              "content": "sister is being the asshole, not the girl he asked out.",
              "id": 289,
              "comments": [
                {
                  "score": 26,
                  "content": "Thank you! At least someone noticed this. Sister should mind her own damn business",
                  "id": 290,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 495,
      "content": "YTA in the sense that you come off as rather scummy in regards to how you speak about the girl you had a crush on. You took it personally that she didn’t want to date you as well making the comments about how you aren’t used to rejection. \n\nYou can do what you want with concert tickets as you they are yours.",
      "id": 291,
      "comments": [
        {
          "score": 88,
          "content": "For all we know it wasn't even true that she wasn't open to dating. She was just finding a roundabout way to point out that she didn't want to go if it meant demanding sex afterwards. Sounds like he offered in a really creepy way, she immediately realized he intended to pressure sex and tried to word it in a way that said she would go but didn't want to be pressured into sex, so he immediately hoped he could bang someone else. Its telling that he only is wondering whether taking back the offer makes him an asshole, not the way he offered.",
          "id": 292,
          "comments": [
            {
              "score": 23,
              "content": "He didn’t take back the offer, she rejected it and tried to change his terms. He didn’t accept it. Which is fine. A deal requires both parties to consent and sometimes there is just no deal meant to be. He moved on. She’s not entitled to jack squat.",
              "id": 293,
              "comments": [
                {
                  "score": 29,
                  "content": "Don’t think anyone here thinks she’s owed the tickets just the OP is the asshole for offering a deal that was essentially sex for concert tickets.",
                  "id": 294,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Then she should communicate better and say so. She can say yes to the date and suggest other hotel arrangements. She said no to the date however.",
              "id": 295,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Exactly. Everyone here wanting to say he's the asshoke for doing what he did with the tickets. He wanted a date. She didn't. He moves on to ask someone else, done and simple. Whether or not sex is part of it, everyone there is an adult. \n\nHis tickets he can do what he wants with them. The way he wrote about this just sounds nasty though and I think that's where some people are reasonably getting upset with him.",
          "id": 296,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 387,
      "content": "YTA \n\n\nFirst off saying it MUST be a date, with a shared bed at the end of the night is pervy af. I wouldn’t be surprised if her side of the story is “I liked this guy, but didn’t want there to be pressure of sleeping together at the end of the night, so I said let’s go as friends. So instead he found some girl who would go off and sleep with him for a concert ticket” they are your tickets, and you can do with them as you want, but being like “if it isn’t a date we share a bed with, then no” is a huge asshole move.",
      "id": 297,
      "comments": [
        {
          "score": 226,
          "content": "Honestly what I am interpreting from this story is that he creepily asked whether she'd bang in exchange for going to a concert, she tried to soften it but said she'd still go, and he immediately ditched in he hopes of banging someone else. The entire way he worded this is creepy, and since we only have his description to go on, for all we know she didn't even say anything about not wanting to date, just not wanting to be forced to bang. He is the one telling the story, and even in his telling he doesn't look good. The reality is probably more over the top than that.",
          "id": 298,
          "comments": [
            {
              "score": 8,
              "content": ">  asked whether she'd bang in exchange for going to a concert, she tried to soften it but said she'd still go, and he immediately ditched in he hopes of banging someone else\n\nwhats wrong with any of that? He found a consenting adult after another one said no. he took no and le t it go",
              "id": 299,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "> First off saying it MUST be a date, with a shared bed at the end of the night is pervy af.\n\nRead the edit. You're wrong here. \n\n> I wouldn’t be surprised if her side of the story is “I liked this guy, but didn’t want there to be pressure of sleeping together at the end of the night, so I said let’s go as friends.\n\nThen say that? \"I'd like to go as a date but with separate hotel rooms if you don't mind\". She flat out rejected him. No wonder he doesn't want to take her anymore.",
          "id": 300,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "No, it's more like \"if this isn't a date, then no.\" He clearly wanted to use this ticket as an opportunity to take a potential girlfriend out on a date. If he wanted to go with a friend he probably wouldve chose one of his bros instead.",
          "id": 301,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Asking someone out on a date is not asshole behaviour. \n\nChanging ones mind and asking someone else after being rejected is not asshole behaviour.\n\nGetting upset at someone who changes their mind after being rejected _is_.",
          "id": 302,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "People say \"he never said shared bed\" but what stuck out to me was Girl 1 was the one who suggested separate beds, which leads me to believe his initial proposal was shared bed, so she can easily interpret the date as a \"date and sex package deal\". Maybe she never was interested but if I was interested in someone, then turns out he even implies that he wants sex on the first date in a far away hotel room, then my defense would be up and romantic interest would go down. If she was interested at all from the beginning, the whole hotel thing may have turned her off the idea of any date at all.",
          "id": 303,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Nothing wrong with making the ticket conditional on a date rather than a platonic outing.  If you don’t want to take somebody “as friends” that’s fine. \n\nMaking it conditional on sharing a hotel room...or even offering that as the default option...is pretty aggressive. Likely played a role in her rejecting the date idea.",
          "id": 304,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}