{
  "post content": "Dummy account because the relevant parties are on Reddit.\n\nI (31 F) am pregnant with a girl. My husband\n(33) has a younger brother (31) whose he's very close to. However I recently told my husband that I don't feel comfortable with the idea of his brother spending much time with my daughter\nonce she's born. It's not because of my BIL himself. We're not close but he's fine. The issue is his life choices.\n\nHe's not married, has no intention of getting married or having kids, and dates only for sexual purpose. He dates multiple women and the only thing he has in common with them is that, like him, they are extremely good looking. He's highly intelligent, yet he has no interest in meaningful relationships. I spoke to him about his choices a few years ago, and after accusing me of being\n'moralistic', he claims that he always uses protection and he never leads the women on. Which I call BS on, as I can't imagine\nany woman with an increasing ticking biological clock would willingly be in a relationship which she knows doesn't have a future. Not to mention, what woman would want to be with someone\nwho may not even remember your name in a year's time?\n\nI mentioned this to my husband, however he called me an AH, and said that it was ridiculous to limit our daughter's access with her uncle just because I don't agree with his legal dating choices.\n\nAITA?\n\n\nEDIT: I probably should have clarified that he generally goes onto apps like Tinder. Which makes it worst, as the women he dates tend to be of a certain type.",
  "id": 1,
  "comments": [
    {
      "score": 47870,
      "content": "YTA\n\nIt's 2023. It's okay for women to like sex outside of the quest to \"land\" a husband.\n\nAs long as he's being honest and safe, what's the problem?",
      "id": 2,
      "comments": [
        {
          "score": 21368,
          "content": "Yes. And not all women even want children. I do not hear my biological clock. It must be digital, because it doesn't tick.",
          "id": 3,
          "comments": [
            {
              "score": 10603,
              "content": "Mine is apparently broken because I declared at 12 I didn’t want kids. 41 now and yep, still don’t want them.",
              "id": 4,
              "comments": [
                {
                  "score": 7998,
                  "content": "Am 53, I never wanted children.\n\nIt’s fucking insane a woman’s worth is if she breeds.   Archaic on steroids.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2862,
                      "content": "As someone who wound up being infertile, can definitely fucking confirm.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 477,
                      "content": "55. Knew I didn't want them when I was as young as 8.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 454,
                      "content": "35, also absolutely no interest in children except to maybe foster at some point. There is literally nothing wrong with not having children, not wanting to have children, and only dating for sex. \n\nOP, I have had many relationships that are just about the sex. Great fucks are great fucks 🤷‍♀️ we both know what we want and have a good time and that's wonderful. Hell I'm currently dating 2 people, they both know about each other, we are consenting adults having loving relationships and fanfuckingtastic sex. You need to stop being so judgmental of other people's decisions. \n\nOP, YTA.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 195,
                      "content": "My wife (34) and I (37) recently made a somewhat permanent choice in that direction. Good thing my wife has a STEM PhD from the best university in the world, otherwise it would be harder for her to justify, I think. But, the fact that she's like super smart and has always been more concerned with learning than with social femininity really has saved her from being questioned or devalued because of it. Most women aren't as lucky as her in many ways.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 125,
                      "content": "I'm worth more than my ovaries!!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Me too, 53 and never wanted kids. Had to listen to all the bs about how I would change my mind etc.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Their poor daughter.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "As someone who HAS kids I agree with this statement.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 500,
                  "content": "I'm sorry, none of that around OP's baby! Only seeing all adults in her life in a desperate rush to mate will give baby the right foundation for a lifetime of purpose and happiness.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 185,
                      "content": "None of those women ‘of a certain type’ either.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 127,
                      "content": "I mean can you imagine her seeing childfree people? She might get ideas! And then who would give OP grandchildren?",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Only people who feel limited and trapped, then decide to breed because they are desperate for some meaning in their lives🙄.\n\nI cannot with this OP.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 122,
                  "content": "That’s also the age I told my parents I didn’t want kids. They asked what if you husband wants them, so I said he’s can have them then. \nI haven’t changed my feelings and my fiancé doesn’t want kids either.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 6,
                      "content": "\"If my husband wants kids, why did he marry me and not someone else?\" 🤷‍♀️",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I’m 53, married now, had lots of premarital sex with multiple partners, never had any intention of having kids with any of them, including my now-husband of 13 years. I knew exactly what I was doing, and there was no clock.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I was 10 when I made the declaration.  So many people said I will change my mind or I will have regrets.  My husband and I are planning to go on one of those Virgin \"Child Free\" Cruises. I guess the regret has not set in yet. :)",
                  "id": 21,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Enough is enough. If nobody is going to stand up for the children and protect them from the news that you and your husband enjoy vacationing together even though your life isn't as wonderfully fulfilling as OP's, who is absolutely NOT jealous of the fact that you're going to have fun on a cruise, then I will. \n\nIt's your obligation to act miserable at all times, otherwise kids might realize they too can enjoy life and make the decisions they prefer.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I smile internally when my teenage kids say they don't want kids. I'm fine either way, but I'm glad they don't feel having kids is just another milestone and they have a choice!  This OP is off her rocker. I did a quadruple take reading each sentence.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I was literally walking down the street laughing out loud at \"I can't imagine any woman with an increasing ticking biological clock would willingly be in a relationship which she knows doesn't have a future. Not to mention, what woman would want to be with someone who may not even remember your name in a year's time?\" \n\nLots of women, OP. Lots of women, lots of men, lots of enbys, lots of humans. You do understand that not everyone feels what you feel all the time, right? Because that's a developmental milestone we generally expect people to hit around preschool age, not in your thirties. Moralistic indeed!",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I knew at 12, too - didn’t want kids and set a minimum marriage age at 28. 55 now. Still not married, still no kids.\n\nETA YTA, OP.",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Aye that's great. I decided around the age of 14 that kids were a huge nope for me, even if that means being single for the rest of my life lol. I'm basically in my late 20s and I still feel the same. Here's hoping the feeling doesn't change for the rest of my life.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Not only do many of us not want kids, but some of us don't want the OP's definition of a 'proper' relationship either!  It took years for me to figure out that I'm not broken, I'm just aromantic.  I have zero interest in romantic relationships, but if I can find purely sexual ones, I'm in!  The problem is that it's always been the men who catch feelings and try to get me to change my mind.  The fact that the BIL is upfront with these women makes his choices A-OK to me.  The OP needs to get off her high horse.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 379,
              "content": "I had mine surgically removed last summer.\n\nYTA OP",
              "id": 28,
              "comments": [
                {
                  "score": 71,
                  "content": "Congratulations!!!",
                  "id": 29,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Thank you!!! Best decision ever",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 357,
              "content": "I was really interested in this one guy until he became *very* concerned with my biological clock. Actually said the words. I was 28.",
              "id": 31,
              "comments": [
                {
                  "score": 125,
                  "content": "I think trees can be biological clocks. Because you can tell what time it is by the position of the sun. Baby trees are scary though. Running all around, biting ankles...",
                  "id": 32,
                  "comments": [
                    {
                      "score": 21,
                      "content": "My cats are biological clocks. Tell me when it’s 3 am, 7 am and 6 pm every day",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I had a bf like that. He was FLABBERGASTED in the worst way when I (at 28) said I didn't see kids in the picture within the next 5 years. In part because I was in grad school, didn't own a house, had not much for savings, no permanent career/job, and we weren't even engaged (together 2 years at that point).\n\nAnd the guy was 2 years *younger* than me 🙃",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Eek. Glad you did not end up with him",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 122,
              "content": "I had my clocks wires shorted out at age 29 and haven't regretted it for a millisecond. I'm 61 now.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 110,
              "content": "I laughed out loud at must be digital 💀",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I took the batteries out of my clock and put them in my vibrator",
              "id": 38,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Also to add just because someone can have kids, doesn’t mean they should.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "“it must be digital because it doesn’t tick” please may i use this forever u genius",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "My clock ticked when I was in my early 20's and considered that with the number of children I wanted, how long I wanted to be in a relationship before procreating because I had a talent to land assholes (later realised that's because I was raised to be a victim and decided to stay single until therapy progressed enough to be on the safe side) and no child deserves a father like mine and that I wanted to be done with the sleepless nights well before 40 and don't have them back to back. That made me realise if I want to achieve every point of that list I should take a step back from casual dating and look for something serious. When I got chronically ill at 25 I decided to reduce the number and put the whole thing on the back burner. Good decision. My partner left me in the third year of my illness because I wasn't able to go to bars with him anymore and because when I couldn't bury the symptoms of my CPTSD in work anymore they broke free and the subsequent therapy made me stand up to him more. Well, bullet dodged. At 27 I decided I'd most likely not have any children at all. Now I'm 30 and moving in with my mother because I can't always care for myself. I'm glad there are no children I'd burden her with and whose care would wear me out beyond my strength. I don't know when that clock broke but it's been broken longer than it ever ticked",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "My biological clock only tells me it’s time for another animal. Nothing about human babies.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2063,
          "content": "It’s giving “my BIL rejected me”",
          "id": 43,
          "comments": [
            {
              "score": 1338,
              "content": "\"Like him, they are extremely good looking.\"\n\nI think you are on to something.",
              "id": 44,
              "comments": [
                {
                  "score": 858,
                  "content": "They are *certain types of women* after all",
                  "id": 45,
                  "comments": [
                    {
                      "score": 767,
                      "content": "Yeah. Hot, sexy and comfortable with their sexuality. Isn’t that what we women have been fighting for? OP is slut shaming, bitter and definitely TA.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "She wears short skirts, I wear t-shirts?",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 249,
                  "content": "Yeah.  OP wants him.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 108,
                  "content": "Or jealousy that these women are out there enjoying life at their own pace instead of settling down and having kids before their \"clocks run out\". Either way this screams of bitter jealousy.",
                  "id": 49,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 496,
              "content": "I'm thinking the same thing - she sounds like she is REALLY jealous of those women.",
              "id": 50,
              "comments": [
                {
                  "score": 216,
                  "content": "I'm wondering if she's (un)happily married and wants BIL to find a woman who is just as miserable as she sounds. \n\nA lot of my childfree friends have gotten this sort of treatment from married women for that exact reason. Hell, I went the more traditional route (married young, popped out 2 kids), and there are some married women that treat me like a pariah because I actually like my husband.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 56,
                      "content": "I know a lot of women that settled down in unhappy marriages because of the outdated belief after a certain age if you're not married with kids you've failed as a woman. The way OP speaks of these women definitely gives me those vibes from her.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "This!! I’m glad I’m not the only one. I adore my husband, and he adores me. We’ve been together for almost 6 years, known each other for almost 10. if anything, we are more in love now than we were way back when. The number of comments I get about “just wait till the honeymoon phase wears off, then your husband will annoy you too”. \nA group of women in my office would always stand around bitching about how shitty their husbands are, and I got looked at like I was an alien when I praised mine because well, he’s awesome.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "my sister doesnt want kids and has been pushed out of a lot of social groups because shes \"happy\" and just out doing her own things while they are \"stuck\" at home with kids. both mine and her response to them when they are bitchy is well you chose to have kids(even accidents are from a choice to have unprotected sex) so your the one who made yourself unhappy if you didnt want them",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Oh my gosh it is!!! I was fully prepared for BIL to have displayed some sort of behaviors towards OP that make her question the safety of the kid or something. Reading this had me caught between stunned silence and laughing my ass off.",
              "id": 55,
              "comments": [
                {
                  "score": 10,
                  "content": "Exactly, I read it twice thinking I’d missed the bit where he only dated 18 year olds or something. But it’s just good old slut shaming.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "bingo! imagine about to bring a new daughter into this world and you are worried about who her uncle is or isn't sleeping with",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Exactly.... He called him EXtremely good looking 🧐 more like she doesn't want him near herself or else",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1273,
          "content": "But he goes on TINDER. You know what “certain type” of women hang around there /s",
          "id": 59,
          "comments": [
            {
              "score": 1234,
              "content": "Only the women though. OP specifically mentions that the issue is not the BIL himself, so men using tinder is perfectly fine. WOMEN using online dating (which is actually kind of the only way for straight men to successfully use online dating in accordance with their sexuality)?!?! Call the church and get your stones ready.\n\nWhat a gross misogynist.\n\nEdit: I just double checked and OP is having a girl. Everyone wish that poor child good luck, she's going to need it.",
              "id": 60,
              "comments": [
                {
                  "score": 234,
                  "content": "Might be better for the child to have BIL around tbh",
                  "id": 61,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 127,
                  "content": "Nobody tell her about Grindr",
                  "id": 62,
                  "comments": [
                    {
                      "score": 28,
                      "content": "OP might actually have a heart attack if she finds out about Grindr.",
                      "id": 63,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Misogyny aside, it’s not like a kid will see all the partners BIL has unless he brings them around, which sounds like he doesn’t. So it would be very easy to shield this from the child. Which makes this whole thing doubly ridiculous",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 474,
              "content": "Women who {gasp} _like orgasms_",
              "id": 65,
              "comments": [
                {
                  "score": 178,
                  "content": "doubt OP knows what one is 😳",
                  "id": 66,
                  "comments": [
                    {
                      "score": 130,
                      "content": "I mean...she has a hard time believing women might be interested in sex for it's own sake. That's just a really sad self-report.",
                      "id": 67,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 136,
                  "content": "Wait...hold on...let me find them, then put them on....\n\n{Gasp}......clutches pearls.....",
                  "id": 68,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Everyone should have a set of Clutching Pearls for just these situations.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "Years ago, I had a 'bed buddy'. It was the perfect relationship - if I can even call it that. Neither of us wanted more than we were already giving. \n\nOne day, my dad says to me, \"I'm probably sticking my nose where it doesn't belong...but....I think he's using you for one thing\"\n\nI looked him dead in the eye and said, \"maybe so, but I'm using him for the exact same thing\"\n\nHe nodded and walked away. I don't think he was happy at the time - but it changed things between us - in a good way. Somehow, that conversation brought us closer than we already were. :)",
                  "id": 70,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I once heard a guy laughing at women who sleep with guys without being taken out to dinner first, given a commitment, etc. “He gets what he wants and she doesn’t get anything in return!” this guy guffawed.      \nImagine telling on yourself like that. \n\nAlso, I love the term “bed buddy”",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 384,
              "content": "I, a 40 year old who works in pharma r&d and doesn’t socialize, met my husband on (gasp) Tinder. Please don’t tell him I’m “a certain type of woman”, I’m sure he would be horrified and or delighted.\n\n\nEdit: my first award! I’m shocked and honored. Unless it came from a Tinder user, then ew.",
              "id": 72,
              "comments": [
                {
                  "score": 12,
                  "content": "I met mine while tailgating at a weekend long rock concert ten years ago.  I would like OP to please explain why this is somehow the superior way to find a partner?  I want a full itemized list of pros and cons here.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Not even close to superior, but probably one of the only options to meet people if you don’t get out much. I was on Tinder for 4 freaking years and went on close to 100 varying levels of bad dates before meeting my husband. I was HIS first Tinder date, the smug bastard.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "Found mine before Tinder caught fire, but she was waiting at the bar to go on a date with another man. He showed up late, she told him the bartender had asked her out while she waited, and when he left she slipped me her number and took me for a drink after I got off. Just passed the 10 year mark together 🤘🏼",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 221,
              "content": "They young scamp should be using Christian Mingle.  Why imagine the scandal if he were to meet one of those club type ladies, and I use that term loosely.  The family would be scandalized for a generation.  How dare the rake besmirch the escutcheon",
              "id": 76,
              "comments": [
                {
                  "score": 10,
                  "content": "Take it from a former evangelical, 75% of those Christian mingle girls will do literally ANYTHING. The other 25% will do literally nothing. 😂",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I just realized that outside of campy adventure novels or books emulating them, this is the first time I've seen this use of rake, bravo",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 164,
              "content": "I don't get how OP can be so judgemental about the 'certain type' of people on tinder and then still claim he must be leading these women on 😂",
              "id": 79,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 118,
              "content": "I have been with my tinder hookup for three years now. 😂😂",
              "id": 80,
              "comments": [
                {
                  "score": 83,
                  "content": "I'm married to mine",
                  "id": 81,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Married the guy I met on a fetish site. Child free, great sex. OP would hate me.",
                      "id": 82,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "Married to mine too. Almost 5 years.",
                      "id": 83,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Same, one year and still going!",
                  "id": 84,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "About a year now although he’s still in my contacts as ‘Jack Tinder’ for giggles.",
                  "id": 85,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "7 years with mine! 🤣",
                  "id": 86,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Me and my tinder hook up have a baby and engaged 3 yrs strong lol",
                  "id": 87,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Came here to say “what’s wrong with tinder?” 😂 my cousin met his wife on tinder and they have been together for 7 years. I’ve never seen him happier.",
                  "id": 88,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Still better than Farmers Only!",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "She’s all over the place with her judgmental attitude. \n\nAre these innocent women being led on by the BIL, or harlots who think having sex without trying to get pregnant is ok?",
              "id": 90,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 893,
          "content": "And what does any of this have to do with him spending time with his baby niece???",
          "id": 91,
          "comments": [
            {
              "score": 463,
              "content": "Maybe she thinks he'll be having sex with the women on or near the baby?",
              "id": 92,
              "comments": [
                {
                  "score": 459,
                  "content": "*“Excuse me, ma’am, I know your biological clock is ticking and all women love to have babies… so I will trade you this baby (my niece) in exchange for 1 sex.”*",
                  "id": 93,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Damn, what a great deal!",
                      "id": 94,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "💀",
                      "id": 95,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "😂☠️",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I can't stop laughing at this. It's so . . . polite.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 30,
                  "content": "Lolololol",
                  "id": 98,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "Definitely on the baby. You know these women of a certain type and how they can be.",
                  "id": 99,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 350,
              "content": "Maybe she thinks he’ll imprint on the baby like the werewolf from twilight",
              "id": 100,
              "comments": [
                {
                  "score": 55,
                  "content": "This comment is highly underrated. If I had been drinking I would have spit out my drink I laughed so hard",
                  "id": 101,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "🐀",
                  "id": 102,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Not me finding a sewer rat on Reddit 💀💀",
                      "id": 103,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "Baby might catch his morals . you know, like becoming thinking, consenting adults whose main purpose in life isn’t adhering to other peoples opinions of what their private behavior should be.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "My mind went to such dark places from the title, like, “I’ve had my suspicions but there wasn’t anything to persecute so he’s still involved in our lives” or did something gross as an 18 or 19 year old….\n\nNope. OP is just more than conservative than my reserved, 70 year old mother. Really??",
              "id": 105,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Well, he’s a bad influence after all. /s\n\nLike he’s going to be telling his little niece about the copious amount of sex he’s having. \nSheesh, if anything, it actually sounds like he is a model of safely, morally hooking up- using protection and up front about intentions.",
              "id": 106,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Yeah…maybe if he brought all his hookups over to meet his niece that would be different. But sounds like OP wants him to be a priest before he can be an involved uncle.",
              "id": 107,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 637,
          "content": "I have to highjack the top comment to say this, but I completely agree with OP. A man who’s hot, smart, uses protection, communicates, and doesn’t want kids? Disgusting. Please DM me his phone number so I can give him a piece of my mind. Or let him know I am available on Saturday for dinner so we can talk about his despicable lifestyle.",
          "id": 108,
          "comments": [
            {
              "score": 104,
              "content": "Darling, if THAT doesn't work, I am available for dinner on Sunday, and I am OLDER than him so surely I can make him see the light!",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "This guy could probably just write that second sentence for his Tinder bio and never run out of matches.",
              "id": 110,
              "comments": [
                {
                  "score": 20,
                  "content": "(shut UP i need this)",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Same!!! I would LOVE to hear all about said despicable lifestyle.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I spat out my water that I was drinking everywhere from laughing when I read this comment. Bravo and thank you.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Piece of mind or piece of ass? 😉",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 620,
          "content": "The “Ticking biological clock” narrative is disgusting and archaic. Women aren’t just incubators.",
          "id": 115,
          "comments": [
            {
              "score": 58,
              "content": "I haven't exploded yet, so you must be correct",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "[deleted]",
              "id": 117,
              "comments": [
                {
                  "score": 16,
                  "content": "I was raised in a Christian fundamentalist family in a very red leaning area. I hear this all the fucking time despite completely turning my back to the toxic community I was raised in.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 7,
                      "content": "[deleted]",
                      "id": 119,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "They are to “Christian” conservatives.",
              "id": 120,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 345,
          "content": "NOT THE APPS!!!! think of the children!!!! i mean, the only person bothered is an adult that’s not even sleeping with him, but come on, she is pregnant so she knows what’s up with him and life and his future.\n\n\n\nimagine, someone who doesn’t want her life! what a joke! it can’t be possible!!!! she is married and pregnant and therefore superior to anyone else. her child deserves sexual role models that don’t get laid or use apps, they must marry people who are sane enough and then lose their minds whenever family doesn’t comply with sexual morals of the best possible human who is clearly the epitome of morality since she got knocked up by a dude as opposed to her dirty bil dragging her unborn child down.\n\n\ni wonder what sex is like for people like this. is it obligation or responsibility for their husbands sexuality that drives this lunacy? is it amazing sex or just the concept of someone enjoying it that makes them nuts?",
          "id": 121,
          "comments": [
            {
              "score": 48,
              "content": "I don't think that Op understands that The Apps doesn't carry the stigma that it once did. True, once you get The Apps, technically you will always be positive for The Apps. Some people get over it on their own with no issues, but even if they don't; there are treatments that prevent symptoms of The Apps! Most people who have The Apps go on to live completely normal lives!",
              "id": 122,
              "comments": [
                {
                  "score": 6,
                  "content": "i’d rather be with randos on tinder than chillin with this gem of a lady, at least there is some fantasy of pleasantries/pleasure as opposed to the police of vice and virtue international \n\nwhat did she think her bil would do?! invite the baby as a wingman and then pimp her out?! how would it affect her kid beyond the fact that she already shares dna with this person so avoiding it now seems silly. does she not know about genetics?!?! also, why does abstaining from sex mean more than compassion and  acceptance to this mother for her baby to learn in her infancy?!",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "The apps are contagious!!! They will immediately infect OP’s newborn upon contact with heathen uncle.",
                  "id": 124,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Hahaha, love this. She obviously only has sex to get pregnant. Her poor husband.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 237,
          "content": "This. OP do you live under a rock?? You do realize it's 2023 right? \n\nNot everyone's gonna live the same life as you, that doesn't make them less than. You can look down and judge people from your high horse if you want, but you'll just end up hurting yourself when people realize they don't want to be around you, including your husband and daughter. Just judge him silently in your head and move on with your life, because the bottom line is- his actions do not affect you, nor do they have anything to do with you.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 135,
          "content": "40, no time bomb here either. I'll continue to enjoy my freedom and childfree life while Missy McJudgerson here resents everyone around her for having more fun than her.",
          "id": 127,
          "comments": [
            {
              "score": 6,
              "content": "I’m 31, pregnant and fully support my friends who are still living the tinder and casual sex life. Heck, I’ll drive you and pick you up from the bar if you need. OP is ridiculous.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Absolutely agree with you!",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "But but but their biological clock is tickinggggg!!!!!!",
          "id": 130,
          "comments": [
            {
              "score": 5,
              "content": "\"Tick tock, motherfucker!\"\n-OP to all BIL's lady friends",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 21246,
      "content": ">\tI can’t imagine any woman with an increasing ticking biological clock would willingly be in a relationship which she knows doesn’t have a future\n\nYTA. You think your BIL will be a bad role model for your daughter when you’re making broad generalizations like this one about the women he’s with?\n\nOnly one person comes off as being disrespectful to women in this post, and it’s not him.",
      "id": 132,
      "comments": [
        {
          "score": 4452,
          "content": "This! OP, as a woman who decided not to have kids, I am offended by your words.",
          "id": 133,
          "comments": [
            {
              "score": 2303,
              "content": "I desperately want kids and I'm still offended on behalf of women. I know more ladies who don't want kids than do, and tinder is mostly a hook up app. Absolute YTA.",
              "id": 134,
              "comments": [
                {
                  "score": 958,
                  "content": "I have kids, am also offended. I very much enjoyed my life before I was ready to \"settle down\". I don't remember the guys' names any more than they remember mine. It was a fun time, zero regrets other than being too old to have enjoyed the convenience of Tinder. We were young, hot, and hormonal. What the hell else was I supposed to do? Start knitting and watching Star Trek in the evenings at 20 instead of at age 30? Meeting my now-husband was a fluke, I certainly wasn't looking to meet my life partner at 26.",
                  "id": 135,
                  "comments": [
                    {
                      "score": 320,
                      "content": "I turned 30 today but have been knitting and watching Start Trek in the evenings for the past 6 years, I guess I've been 30 for a while.\n\nThank you for this comment it had me in stitches, now I feel even more equipped for my 30s. Lol\n\nOOP, YTA, every one chooses a different path in life. As long as they aren't hurting anyone, are being respectful and responsible it's none of your damn business what kind of relationships he has. FYI not every woman can or chooses to have children.\n\nEdit: Thank you everyone for the birthday wishes, I really appreciate it ♥️",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 246,
                  "content": "Agreed! I'm a woman with kids and I find OP incredibly judgemental. What's OP's problem with using Tinder as well? I know many women and men who have used it to hook up, and I know many who met on Tinder and are now married. OP is most definitely an arsehole as neither options are wrong, they are choices as women we have a right to make. \n\nYTA OP, and OP should look inwards at her own prejudices, misogyny and sexism.",
                  "id": 137,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "I have a flicking boat load of kids and I'm offended.",
                  "id": 138,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I am shaking my head at op, and have kids too. Great job on her part for painting with a broad brush.",
                      "id": 139,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "Same here. I love being married and my kids, but the vast majority of my close friends are childfree by choice. Not every woman wants babies, and that needs to be normalized.",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yes, that edit made it even worse, although I don’t think OP connected those dots when she wrote it - she meant to shame BIL, but in reality it just cements that the women he is meeting are going in eyes wide open and looking for the same thing as him. Completely ruins her “poor little ladies being lead on by my BIL when they are really looking to have babies” narrative.",
                  "id": 141,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I want to have kids and I'm offended. OP is being so disrespectful.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 610,
          "content": "AGREED. She's going to do far more lasting damage to her daughter with that internalized misogyny.",
          "id": 143,
          "comments": [
            {
              "score": 10,
              "content": "That’s just it. I have two young daughters. And if someone was speaking around them, as OP is, with these opinions, I would be appalled.  Don’t go projecting your insecurities and self righteousness on my kids. I want them to grow up to learn to make responsible choices for themselves - whatever those may be. NOT think their sole purpose in life is to settle down and pop out a kid before a certain age. Nor do I want them to view adult relationships in such an unhealthy and judgmental way.  This woman’s children are screwed.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 586,
          "content": "OP is definitely an AH and likely a slut shaming, judgmental, close minded person. Seems like anything outside what you like or think is right is unacceptable. \n\nI’d watch out for your own biases and treatment of others because you’re definitely going to fuck up your kid. I fear for your daughter’s future because of how critical you’ll be of her and anything she does.\n\nYour kid isn’t even born yet but look how controlling you already are. Big yikes.",
          "id": 145,
          "comments": [
            {
              "score": 92,
              "content": "She’s be better off with the uncle and dad! At least they’re open minded",
              "id": 146,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 413,
          "content": "Thank you for quoting this part it made my head spin. \n\nGod forbid these women (who OP admits are extremely attractive) would rather have fun (who says they aren’t doing the same as him? With multiple men on stand by?) with a man than shack up and do his laundry. Maybe they are working on their careers, their hobbies, investing their money in themselves instead of their relationships. Maybe they like to be wined, and dined, and eaten out, and then go home? *[pearl clutching intensifies]*\n\nNot all women daydream about being tied down, or ever having children. Not all women care about being a man’s better half. OP, if that was you, then perhaps listen to your own husband. \n\nOP is being “moralistic” as evident by her edit “he finds them on tinder” so we know what “certain type” they are. AKA ‘slutty hussies’.  Internal misogynist. Yikes that she’s having a daughter.",
          "id": 147,
          "comments": [
            {
              "score": 90,
              "content": "Tied down, you say?  \n\n\nSorry, got distracted.",
              "id": 148,
              "comments": [
                {
                  "score": 19,
                  "content": "😈 perhaps my wording was a little too on the nose for the subject at hand… lol",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Glad I'm not the only one! 🔥",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Thanks for spelling out the ‘certain type’ of women who use Tinder. Having been married for over 30 years, I am not very aware of these things. And now that I know, I say, “Bravo, all you slutty hussies! Enjoy your life. You do you!” Seriously, BIL sounds like he is not ready to settle down, and why should he? Someday maybe he will … maybe he won’t! Nothing wrong either way. And nothing wrong with the women he dates.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "*The misogyny is coming from inside the walls*",
              "id": 152,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 388,
          "content": "I’m getting strong “incel fan-fic” vibes from this post. The women BIL meets online are “a certain type”, it’s dripping with misogyny, the jealousy of good-looking people for no other reason than they are attractive… it’s almost directly out of an incel manifesto",
          "id": 153,
          "comments": [
            {
              "score": 272,
              "content": "Some women are like this, though. Internalised misogyny is a hell of a drug.\n\nThere may be jealousy because she 'had to wait for marriage' and missed out on experience, and now is stuck with mediocre to outright terrible sex herself, and there is BIL, and women BIL talks to, and they have freedom to do what they want. Can't have that.",
              "id": 154,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 144,
              "content": "Unfortunately there’s way too many real women out there that think like incels. Incels are just taking passages out of the old patriarchy traditional values playbook and many heard the words they now believe about all women come out of the mouths of their own mothers. Nobody tears down women like other women. Which is why it’s so awesome and important that women are sticking together these days.",
              "id": 155,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "The world is full of tradwives, don't be naive. Very religious women, on top of that.",
              "id": 156,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 211,
          "content": "OP’s edit makes her look even worse too. He only ends up with “a certain type of woman.” Holy God, OP, I fear for your daughter with what a judgmental mother she’s going to have. YTA.",
          "id": 157,
          "comments": [
            {
              "score": 18,
              "content": "The good-looking ones who like sex.",
              "id": 158,
              "comments": [
                {
                  "score": 12,
                  "content": "Can you even imagine",
                  "id": 159,
                  "comments": [
                    {
                      "score": 7,
                      "content": "/clutches pearls",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 107,
          "content": "She can’t imagine it? Her imagination must suck.",
          "id": 161,
          "comments": [
            {
              "score": 10,
              "content": "Also her sex life.",
              "id": 162,
              "comments": [
                {
                  "score": 8,
                  "content": "Unless your sex is heterosexual, married, monogamous, missionary, and once a week on Saturdays, you’re not allowed to be around her baby!",
                  "id": 163,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "OP sounds like she’s going to raise her daughter to believe her only self worth comes from child bearing.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Obviously has a very limited imagination. OP YTA",
          "id": 165,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "This! I’m more worried that poor kid is going to learning from her mom. YTA OP",
          "id": 166,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9148,
      "content": "YTA. Not everyone dates for marriage. Not everyone wants marriage, or long term relationships, or even short term ones. That doesn’t make them morally bankrupt. People who have life goals that don’t match yours aren’t morally bankrupt.\n\nGet off your high horse, pal.",
      "id": 167,
      "comments": [
        {
          "score": 1757,
          "content": "Yeah I thought this post would take a dark turn re his behavior, but nope. He is just living his life. YTA.",
          "id": 168,
          "comments": [
            {
              "score": 582,
              "content": "I know! I thought we were going to be introduced to some folks you really wouldn't want your kids around, but....they're just consenting adults....",
              "id": 169,
              "comments": [
                {
                  "score": 355,
                  "content": "I came in here thinking that BIL likes to date teenagers or something but no. He just enjoys casual sex. The HORROR",
                  "id": 170,
                  "comments": [
                    {
                      "score": 161,
                      "content": "From the way she acts in the first paragraph I was thinking he was going to be dating a sex offender or someone that did some time for trying to steal a baby or something.",
                      "id": 171,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 98,
                      "content": "He enjoys casual sex with *women the same age as him.* I was expecting something much worse just reading the title. But no, OP’s just a puritan.",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I think the true horror for OP is that women he has consensual sex with like it too? I do not like when people scream \"fake\" but I truly hope this is, thought I sadly know people with OP's limited view on a woman's worth.",
                      "id": 173,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 193,
              "content": "seriously...i kept waiting for the part where he and his dates are doing drugs around the baby or something. nope, OP is just a judgemental AH",
              "id": 174,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 65,
              "content": "Me too. I was waiting for the \"he only dates 12 year olds\" or something.",
              "id": 175,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Same.\n\nI kinda get how OP wouldn't want her daughter near a womanizer. Womanizers are legit predatory sexist manipulators. I wouldn't want my daughter hanging around anyone who's sexist or a sexual manipulator.\n\nBIL isn't a womanizer, though. If there is honesty and directness, then you have consent. Also, what is BIL actually going to share about his lifestyle with OP's kid? It isn't relevant at all to a child.",
              "id": 176,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 482,
          "content": "Lol at “women on a Tinder are a certain type…” she really has a lot to unpack and it doesn’t even begin with BIL. YTA.",
          "id": 177,
          "comments": [
            {
              "score": 220,
              "content": "As a 30 something year old woman on tinder I am so curious to know what type of woman I am 😂😂😂",
              "id": 178,
              "comments": [
                {
                  "score": 160,
                  "content": "Apparently the type that is BAMBOOZLED by GOOD LOOKING MEN /s \n\n🤣",
                  "id": 179,
                  "comments": [
                    {
                      "score": 9,
                      "content": "OP secretly wants the brother and is just bitter about the beautiful women that get to have him.",
                      "id": 180,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 112,
              "content": "Ya, OP: please describe the type. Is it someone who is financially independent, career-driven, has tons of hobbies, self-sufficient, has travelled the world, has amazing relationships with friends/family, emotionally stable and knows what she wants? Cuz that’s who I am and I was on Tinder after I broke up with my boyfriend of almost 4 years. Oh, and I (35F) also don’t want kids.\n\nYTA for only accepting one way of how women should act",
              "id": 181,
              "comments": [
                {
                  "score": 12,
                  "content": "Are you me?! Because that’s absolutely my life, except I’m 38!",
                  "id": 182,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "Lol, women on tinder of a certain type..  I was literally THAT woman— I was just looking for an orgasm that led to a noise complaint. And you know what? I met my husband on tinder and I wouldn’t change a single thing about the night we met. \n\nBut if I hadn’t, so? I wouldn’t be any less of a woman if I weren’t married, and instead chose promiscuity.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I found my long-term boyfriend on Tinder, we're going on three years. So, she's also just over-generalizing as to who uses the app. People of all types, looking for all different things, use Tinder.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "I don't think very many people on Tinder are looking for marriage or saving themselves from the biological clock. If he finds a partner there, both know what it's all about.\n\nDon't judge him as an uncle based on his dating preferences. Give him a chance.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5578,
      "content": "Yes, YTA. He's single not a predator. I also don't want marriage. There are a lot of us out here.",
      "id": 186,
      "comments": [
        {
          "score": 1362,
          "content": "Yup, OP's acting like all women want marriage and/or kids...",
          "id": 187,
          "comments": [
            {
              "score": 951,
              "content": "But how will you ever know you're worthy unless a man wants to marry and impregnate you?? /s",
              "id": 188,
              "comments": [
                {
                  "score": 396,
                  "content": "I shall wither away and disappear... /s",
                  "id": 189,
                  "comments": [
                    {
                      "score": 150,
                      "content": "Honestly that sounds great",
                      "id": 190,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "\"ticking biological clock\" god forbid a woman be out there not breeding",
              "id": 191,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Ah I can see it now, OPs daughter is 25, it’s Christmas, OP is sobbing because her daughter hasn’t had at least 3 children yet.",
              "id": 192,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 516,
          "content": "I was expecting OP to say that BIL was dating barely legal girls and that he had certain tendencies that might make her worry for the safety of her daughter when she's born. But just because he doesn't want to get married and he has flings instead of relationships? No, she's definitely YTA and moralistically judgmental as well, expecting brother-in-law to live by her morals and preconceptions instead of accepting that everybody has their own and should be free to live by them.\n\nIn fact, this could actually be seen as an ideal situation. Because it's not like he is in a long-term relationship or partnered with somebody who is demonstrably toxic who he would be bringing around regularly. Sounds like he would not want to bring any of the people that he hooks up with around his family, since he doesn't want to have any kind of a deep relationship with them. So OP doesn't have to worry about shielding her children from a poor choice in a long-term partner.",
          "id": 193,
          "comments": [
            {
              "score": 120,
              "content": "That was my concern too!\nJeez OP, YTA! I've been on tinder and other dating apps too. What exactly \"type\" of woman are you referring to? I'd put my morals against yours any day.",
              "id": 194,
              "comments": [
                {
                  "score": 5,
                  "content": "probably women she considers as \"sluts\" with nothing going on in their pretty little heads.",
                  "id": 195,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "That's where my first thought went, too. Actually reading OP it sounds more guy just sleeps around with consenting adult women who also like to sleep around.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I was expecting that BIL was poly or LGBT. But nope, it's good, old-fashioned misogyny instead.",
              "id": 197,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "I was thinking at worst he kept bringing a ton of girls home and OP would think it’s confusing to her kid but it’s not even that. Absolutely ridiculous",
              "id": 198,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Well, apparently we're \"certain type\" per op's edit\n\nYTA, op",
          "id": 199,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4962,
      "content": "YTA. And a judgmental, ignorant person. You do know that not everyone is interested in monogamy and children, right? That not every woman has an “increasing ticking biological clock?” Has it not occurred to you that some women have no interest in marriage or children *and that their choices are* **just as valid** *as yours?* Where the fuck do you get off talking to him about his choices? As long as all of his parters are consenting adults then he is doing nothing wrong and his choices are just as good as yours. **Though he is obviously a much better person than you if he isn’t openly judging how you live your life.**",
      "id": 200,
      "comments": [
        {
          "score": 548,
          "content": "I wish I could upvote this 100 times. It drives me mad how society still sees marriage and babies as basically the only purpose of life. \n\nThis is especially so for women, but also men are often seen as less trustworthy if they aren't married. Sometimes it's by choice, other times it's just that life hasn't worked out that way. \n\nOP needs to mind her own business and stop obsessing over what other people do with their genitals",
          "id": 201,
          "comments": [
            {
              "score": 36,
              "content": "I completely agree, but it's more than just sex. She's devaluing his morals because they don't align with hers.\n I remember being in my 20s and the constant nagging from everyone. \"You need to find a nice guy.\" Why aren't you dating/married?\"I can introduce you to someone.\" Like, I couldn't be single and happy on my own. Then \"when are you getting married?\"You should get pregnant.\"Don't you want kids?\" It's like no no and NO. I'm a woman, and I wanted marriage and kids. But I also wanted freedom and time and to be my own person. Also, all of that is so over rated like come on, we get to live so much longer now. What is the rush? Personally, I purposely told everyone, \"No, I don't want to get married or have kids.\" The faces people made or questioning looks were worth it. If I had been honest, it would have just continued with the nagging. I did get married and have a kid. But I took my time, I made choices, and I had fun. There is nothing wrong with not wanting those things until you are ready or if you never want them. Judging someone because they want something different is bs. Sleeping around or having fun relationships is no one's business but the people involved. It just sounds like OP is just jealous of her BIL's freedom and sex life. She needs to look at herself and question if she really understands her choices. Is she happy with herself, her life, her sex life, and her choices? Does she enjoy her sex life? If so, why can't her BIL? If not, doesn't that mean there's a bigger problem? Does she believe women can enjoy sex? Would she force her daughter into a loveless marriage just because she's a female? Is her daughter sex life or enjoyment of sex going to bother her? Sex is completely natural, and everyone does it. There's no shame in it. So why judge. Also, what if her daughter doesn't want kids? Would she disown her daughter for not wanting them or thinking differently?\nSorry I rambled.",
              "id": 202,
              "comments": [
                {
                  "score": 5,
                  "content": "Sheesh! I reeeally wanted to read your comment after the first sentence or two, but then I saw the giant WALL OF TEXT! But, if the rest of that wall aligns with the first 2 sentences, I wholeheartedly agree!",
                  "id": 203,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 140,
          "content": "Yep. Tell us you're a conservative Bible thumper terrified of godly punishment without telling us....",
          "id": 204,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Also is BIL going to be swiping on tinder and having sex in OPs house or around her daughter? \nNo… he is most likely not.",
          "id": 205,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "And it doesn't really have anything to do with spending time with his baby niece! He seems open-minded, social, and happy to spend time with people. It's not like he's going to have sex in front of the baby or encourage her to sleep with everyone as she grows up.",
          "id": 206,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "This woman sounds like a fundie \n\nMichelle Duggar is that you?",
          "id": 207,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "To add to that, I'm Aromantic and non monogamous. I can not fall in love in a romantic sense. I feel no need to partner with anyone, though many Aromantic people do. I'm uncomfortable with young children. (And was infertile anyway.) I adopted my kid as an adult. \n\nOP is 100% the asshole.\n\nI do have to admit bias. I've absolutely been involved with men just like her BIL.",
          "id": 208,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2793,
      "content": "YTA. His dating preferences has nothing to do with his ability to be a good uncle. So he doesn't like relationships? Since when is that a shameful thing?",
      "id": 209,
      "comments": [
        {
          "score": 330,
          "content": "That’s what I said! Not everyone has to be married and plenty of people *both* guys and girls enjoy casual consensual sex. Not everyone wants kids and we need to make that okay!",
          "id": 210,
          "comments": [
            {
              "score": 86,
              "content": "Exactly. It only becomes a problem if he's like bringing sex-workers and drug addicts he just met to family events and having them around OP's child.",
              "id": 211,
              "comments": [
                {
                  "score": 8,
                  "content": "I really thought this was the direction the post was taking. After reading i was like \"THATS IT?! hes having sex with women consenting to it and no drugs?!\"",
                  "id": 212,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Right? Better inform my fwb that despite neither of us having time to date or particularly wanting to, my biological clock is just ticking away on those kids I never wanted either!\n\nOP please. From the female perspective, it's 2023. There's a lot going on. Plenty of people, male and female, are opting for more casual \"lifestyle choices\" or whatever you want to call it. It's fine.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "from the title i though the bil had to be into teenagers or something. this is so beyond ridiculous.",
          "id": 214,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "That’s what I said! Not everyone has to be married and plenty of people *both* guys and girls enjoy casual consensual sex. Not everyone wants kids and we need to make that okay!",
          "id": 215,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "And important to OP’s point - how in the heck would his dating life affect her kids?!",
          "id": 216,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Uncle Jesse was a great uncle before he settled down with Aunt Becky.",
          "id": 217,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Exactly! Why are we cutting off people to love our children based on their dating habits? Does she anticipate him taking this child in dates with him? This has nothing to do with being a good uncle, just like it has nothing to do with being a good BIL. \n\nIt’s gross she sat him down to tell him how to live his life, when it sounds like he is a perfectly fine person that doesn’t happen to share HER goals. \n\nGasp!!! Perhaps her daughter will learn she isn’t solely made to be a baby making machine! The horror!\n\nGiven the edit, this gal clearly hates other woman, plain and simply. This will likely be take out on her daughter as well.",
          "id": 218,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2084,
      "content": "YTA. Your a major AH. Your brother-in-law was completely right. You’re projecting your moralistic standards, and your view of the role of women onto him and the people he dates.\n\nI’ve got news for you. There’s lots of women out there who aren’t pining away for Marriage or children. If your brother-in-law and these women decide to go out on dates, it’s absolutely categorically none of your business and your way out of line on this.",
      "id": 219,
      "comments": [
        {
          "score": 538,
          "content": "But their biological clocks! They need to forget about their own wishes and make someone marry them immediately! /s",
          "id": 220,
          "comments": [
            {
              "score": 97,
              "content": "😂😂 laughing but it’s so sad at the same time",
              "id": 221,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "I find it hysterical beyond words how OP is concerned with BIL's \"misogyny\" when she is the only misogynist in this situation",
              "id": 222,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 137,
          "content": "This was one of my first thoughts.  There are a lot of women in the world that are not looking for the stereotypical marriage, husband and two kids life... and there is nothing wrong with that!",
          "id": 223,
          "comments": [
            {
              "score": 99,
              "content": "Agreed. OP is living in 1950 apparently",
              "id": 224,
              "comments": [
                {
                  "score": 77,
                  "content": "Imagine when it's time to explain LGBTQIA",
                  "id": 225,
                  "comments": [
                    {
                      "score": 56,
                      "content": "You think OP wouldn’t be open minded??? What gives you that idea??😂😂😂😂😂",
                      "id": 226,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "OP's pearls would be ground to a powder she'd be clutching them so hard",
                      "id": 227,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "Exactly, YTA.\n\nWho are you to decide how/who BIL should date?\n\nDon't force your views on other people, especially if they are outdated and short sighted like yours.\n\nIf you keep acting like this it will cause a riff between you and your husband.",
          "id": 228,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1468,
      "content": "YTA. Good lord. This is one of the more judgemental things I've seen on here. Just pure slut-shaming.",
      "id": 229,
      "comments": [
        {
          "score": 484,
          "content": "I feel sorry for OPs unborn daughter.\n\nBy the age of 2 she will pick up on OPs backwards and outdated views on women and set her daughter up for a life time of believing there is only one way to be a “good woman”.\n\nShe’s also perpetuating the idea what women who are comfortable with there sexuality are “others”. \nEvery woman should feel comfortable with their body and do whatever they wish with their body.",
          "id": 230,
          "comments": [
            {
              "score": 20,
              "content": "For sure, god forbid she wants to have a career too and not aspire to be a SAHM, makes me bummed since, while I’m sure my parents wouldn’t hate a grandchild to say the least, they have no expectation and they’re incredibly supportive of me pursing not only my career, but also myself and what makes me happy",
              "id": 231,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Sounds like dad may balance OP out.  He thinks his brother is perfectly fine and isn’t going for the limiting access stuff",
              "id": 232,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "\"Of a certain type...\"",
              "id": 233,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 128,
          "content": "I agree. To me, it reads like an incel man wrote it. Obviously BIL is a \"Chad\" who hooks up with \"Stacy\" on Tinder. And all that BS about biological clocks. \n\nThis is rage fuel for misogynists and incel types.\n\nMaybe I just browse too many Redditt forums 😆 I see incels ..... everywhere.",
          "id": 234,
          "comments": [
            {
              "score": 8,
              "content": "Posted further up in here but this is exactly the same conclusion I had reading this lol. The biological clock part especially reads like an incel / republican talking point.",
              "id": 235,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1064,
      "content": "\n\n> I can't imagine any woman with an increasing ticking biological clock would willingly be in a relationship which she knows doesn't have a future. Not to mention, what woman would want to be with someone\nwho may not even remember your name in a year's time?\n\nYou’re a troll right? In the off chance you’re not, YTA. But I’m pretty certain you’re either a troll or you were raised in an extremely conservative, Christian household.",
      "id": 236,
      "comments": [
        {
          "score": 272,
          "content": "I'd hate to know what OP thinks about lesbians",
          "id": 237,
          "comments": [
            {
              "score": 210,
              "content": "***<gasssssp>*** You mean… \n\n(whispering)… the women who think they don’t even *want* a man??? \n\nNo no, it’s just they haven’t found the **right** man! For instance, my eversohandsome BIL!! *He’s* available!! And if I can’t have him, I can at least know I did my duty by correcting one of “those” women’s… *confusion*! \n\nWith my husbands’ brothers’ (reverently and hushed)… god-wand. Which will give her **babies**!!! \n\n/s x ♾️",
              "id": 238,
              "comments": [
                {
                  "score": 62,
                  "content": "God I didnt even think about it but you're so right. She DEF has a thing for the BIL",
                  "id": 239,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Probably depends on if OP knows that it is usually very, very difficult for lesbians to get each other pregnant? 😉",
              "id": 240,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "I hate to know what she thinks about pan/bisexuals. We want EVERYONE! 😂 (or so they seem to think)",
              "id": 241,
              "comments": [
                {
                  "score": 9,
                  "content": "Oh no no no doncha know? If you’re bi and you’re dating someone of the opposite gender then you were StRaIgHt AalLl AlOnG! It WAS just a phase! But if you’re dating the same gender then you’re GAY! You canT hAvE bOThHh /s.",
                  "id": 242,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 713,
      "content": "YTA, not every woman is concerned with \n\n>increasing ticking biological clock\n\nor reproduction for that matter. Some of us just want ro live for ourselves. So yeah, quit being moralistic and leave your BIL alone. Not sure how his sex life may influence your future child, lol",
      "id": 243,
      "comments": [
        {
          "score": 96,
          "content": "This more than anything is why YTA, OP. Is it so impossible for you to fathom that maybe there are women so comfortable with their own sexuality that they, too, are just looking for a fling with your BIL? Not everyone gives a shit about their “ticking biological clock” or getting involved a long-term relationship. \n\nI could see wanting to prevent access to your child if your BIL’s choices were rooted in misogyny, but that’s not what’s going on here. In fact, you’re the one being misogynistic by failing to recognize that not all women care about having a family or a relationship, even. Get off your high horse, OP.",
          "id": 244,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "It's actually insane that she's already having grandchildren expectations from her unborn child, which is what I'm 100% is certain she's afraid having BIL's influence could prevent. \"What if he makes our unborn daughter believe that she won't need a husband or babies to be happy???\" if you will.",
          "id": 245,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}