{
  "post content": "I (22/f) are getting married in December to my fiancé (26/m). He already has a son from a former relationship with his Ex (25/f). Tbh, she hates us and wants us out of the picture. She's the kind of person to think everyone in the world is against her and therefore she made my fiancé up to be the bad guy (he really isn't, he's loving and caring and just wants to be in his son's life). Their relationship has been toxic from the start and since they split up (about 2 years ago) she's trying to separate them. In December we are also going to court to fight for custody because right now my fiancé doesn't have any (he was at university back then and lived a few hours away and she tricked him into giving her sole custody for the time being but never gave him his rights back). So much for the backstory.\n\n&#x200B;\n\nSince they are separated every gift my stepson received has been sold. She just tries to make money from it and he never gets to keep the stuff. While talking to my sister about this year's Christmas presents for our children I dropped this information and she told me to just put his name on everything (like getting it printed on a blanket f.e.). I thought about it and told my fiancè about it. He's okay with it but told me it could be seen as an a\\*\\*hole move. I just want to do what's best for my stepson and want him to enjoy everything he gets. I also want to gift something small to her (like chocolate) just to be nice but WIBTA if I did this?\n\n&#x200B;\n\nEDIT: I'm in a good and healthy relationship. I know everything there is to know about the situation but I can't share all the details because I want to respect the privacy of the people involved. It's also not part of the question. I love my fiancé and we are in a good place. He didn't cheat with me, we met when they were already separated and he did have time to recover from the breakup. We know it seems a bit hasty to get married so soon but we want to because we love each other. There is no money involved except child support he's paying since day 1. I just want to know if I would be the a\\*\\*hole. I can't answer to all of you, but I'll try my best. I'm a bit overwhelmed right now.",
  "id": 1,
  "comments": [
    {
      "score": 5154,
      "content": "Nta. I would suggest maybe getting him something small/inexpensive for when he's at her home and keeping all the good gifts at your house so you know that he'll actually get to use them?",
      "id": 2,
      "comments": [
        {
          "score": 2164,
          "content": "That's what we intend to do. She asked us to gift him a box this year but showing up with an empty box is just something we won't do. I just want to put something inside for him.",
          "id": 3,
          "comments": [
            {
              "score": 864,
              "content": "Why a box? That's weird lol. Maybe get him a nice wooden box then? Or maybe your SO could make him a bank account and you could put some money in there (unless his mum could access that in that case definitely don't do that) I'm racking my brain trying to come up with something that's his mum can't sell or throw away out of spite..",
              "id": 4,
              "comments": [
                {
                  "score": 1195,
                  "content": "It's for some toys she got him. Somehow she's able to afford the toys but nothing to put them into and keep them stored away.  I thought of filling it because en empty box is nothing a kid would like at all. Something like a wallet for him with his name on it and a  blanket for him to cuddle with. It's just something small because he'll  get something bigger when he's with us. \n\nHis money is safe. To keep in that way it's not under his name because she likes spending his money.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 328,
                      "content": ">His money is safe. To keep in that way it's not under his name because she likes spending his money.\n\nI'm so glad to hear that.\n\nThe box thing is still confusing me a bit. Don't most toys come in boxes? Or does she mean a pretty gift box because she 'cant afford' wrapping paper? Either way it's a stupid request as far as I'm concerned. I think your ideas are good though as they're useful and probably won't have any re-sale value (unless she manages to find someone with the same name who need/wants those things which I find rather unlikely)",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 76,
                      "content": "It sounds like a trap, honestly.  \"YOUR FATHER ONLY GAVE YOU AN EMPTY BOX!  SEE HOW MUCH MORE I LOVE YOU?\"  Don't do this.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "That doesn’t make any sense. Why would she buy toys for her son and sell the ones you and your fiancé get for him?\n\n\nEither she is cruel and doesn’t want the child to have toys in which case she would not waste her money buying toys and would not need a toy box... Or she just doesn’t want any toys to be from dad which she could easily just re-wrap or lie about and get the credit but also not have to spend any money herself. Why would she waste her time like that? I promise you the re-sell value of toys is not high.\n\n\nIf the person you are dating makes their ex sound so unrealistically evil... 9 times out of 10 there is something you are missing. If she is really that cruel you should keep a journal with dates of everything she does so you can use it as evidence if you try to pursue custody.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Although if he's little and it's a HUGE empty box (like refrigerator size) it could very well be his fave present! lol kids are funny",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "What would a 2 year old do with a wallet?? If you’ve been gifting random age inappropriate stuff like that in the past I wouldn’t be surprised if the mum sold it for things she actually needed like diapers or clothes.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "Lowkey sounds like she’s setting you guys up to look like the bad guys. Who gifts a kid nothing but a toy box on Christmas? She got him all the fun presents and wants you guys to look like the bad guys only getting him a box.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "I like the idea of giving him the toybox,  but if out some presents in it myself.   Nice idea OP.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Make sure this toy box is engraved with his name in large letters!",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "There isn't really a physical item she can't sell or throw away out of spite. Just an experience like someone previously stated.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Sadly we won't be able to do something with him. He's only at ours for 2 1/2 hours at a time. That's just not enough time for anything and he's too young to enjoy going to a restaurant or a movie.",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Yeah I unfortunately realised that as I sat here listing different gift options to myself and couldn't come up with a single thing.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "When my kids were little they would sit inside a cardboard box with crayons and markers and color the inside of the box. They had fun for hours!!!",
                  "id": 17,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Yeah, I'm not endorsing the mom's idea *at all*, but 2yo kids *love* big, empty boxes. They're cars. They're forts. They're suits of armor. With a little marker, they're giant robots.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Not denying how much fun a simple box can be (perfect for small children and cats 😅)  but it's seems a bit of an odd request for a child birthday gift.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "A toy box.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I thought that for a split second too but further down OP mentioned that it was only supposed to be the size of a shoe box..",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Getting him a really nice toy box would be lovely and a perfect item to have his name on! My brother and I still have our personalized mini trunks - mine says “Work_Me’s Treasures” and is painted prettily.",
              "id": 22,
              "comments": [
                {
                  "score": 10,
                  "content": "That's amazing! What a great idea!",
                  "id": 23,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I agree that a shitty lil empty plastic box would be a lame gift, but a toy chest can be beautiful, cherished, and personal. And it didn’t have to be huge. My treasure chest is only a touch bigger than a shoebox I would say.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Anything nice, copy the serial number and have his name, serial number and anything else you local PD recommends engraved. If your stepson takes it to his mother's house (even good kids can make mistakes) and she sells it, report it as theft.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Give him a safe that he can keep everything in, and only he knows the code, and call it a box with a lock.",
              "id": 26,
              "comments": [
                {
                  "score": 7,
                  "content": "He's only 2 so that wouldn't be an option until he's older.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Get him a box and put pictures of all the stuff he had waiting for him at your house lol \n\nThat way he’s at least anticipating a better gift \n\nJk though. Get him a Nice wooden box and tell him this is what your mom said you needed, and here is a gift from both of us that we wanted you to have (nicer toy/gift).",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "A friend of mine had this exact problem with her husband's ex. He had a daughter with her and anything they sent the daughter the mother would turn around and sell or straight up use it for herself. It got so bad they bought her two of most things and kept the nicer version at their house and sent her home with secondhand/Good Will clothes and toys whenever she visited. They couldn't even get her a cheap phone to keep in contact with them because mom would immediately try to trade it for drugs or cash.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I’d put a bunch of things that represent experiences you are gifting him. For example an action figure of a bird and a gift certificate you would keep of taking him to indoor sky diving. Or a stuffed animal of a whale and a gift certificate of going to the aquarium. She can’t give experiences away",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Maybe you get a box like she asked, and you fill it with some small-value toys - things with no resale value. For example, hit up your local dollar tree and put in a coloring book, a ninja toy set, some balloons, a puzzle, a packet of cotton candy, etc. The value of everything in there is combined, but getting a quantity of toys as a kid is already around as impactful as a quality toy that has resale value.\n\nAlso, I like the name idea. Take away the re-sale value and make the kid feel seen at the same time. If you just do it with clothes or blankets like off of Shutterfly, the ex won’t necessarily know this is in an effort to undermine her douchery\n\nNTA",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Don't let him bring it to there house without proof you bought it and have her no right to sell it",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Oh but you can work with that request! A toy box is something that is often personalised. Even if it isn't personalised already, you could buy a wooden toy box (something like [this](https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.Dkuyxh8kpD-29qSCrUZDQQHaHa%26pid%3DApi&f=1)), then get some wooden letters ([this](https://external-content.duckduckgo.com/iu/?u=http%3A%2F%2Fcdn.decoist.com%2Fwp-content%2Fuploads%2F2016%2F04%2FCreative-paint-dipped-letters-from-The-Land-of-Nod.jpg&f=1&nofb=1)) spelling his name to glue on the front. Maybe also some decorative stuff based on things he likes (stars and planets if he's into space stuff, animal cutouts if he's into jungle animals, that kind of thing). Use superglue and there's no way she's prying them off without leaving a mark and making it unsellable.  \n\nThat way your strategy is completely deniable (after all, you got exactly what she suggested!), it's a thoughtful gift which he'll like, but she's not going to be able to sell it on and she's got no good excuse to get rid of it.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "yes to this. everything we buy my stepson doesn’t go to this mothers house for one reason: she doesn’t care how it’s taken care of and will end up broken. she has 3 other kids and can’t seem to teach the concept of don’t touch stepsons items. so we just tell him everything stays at our house, and everything she buys stays at hers. \n\nalso NTA.",
          "id": 34,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Am I missing something here? WHY does dad have to get ANYTHING for the kid to have at mom's house? \n\nI mean, she mentioned he'll have bigger stuff at dads for his birthday....why buy anything for moms house at all? Just leave it alone. If mom asks, say we have it at our place for him and he'll open it when we see him.",
          "id": 35,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 787,
      "content": "Nta I've employed similar tactics in the past. Blacked out all bar codes with sharpie (lie = it was on clearance), pre-opened and assembled gifts and put them in a new box ( lie = i wanted them to be able to use it right away without bothering anyone to put it together) , its more costly but it would be better to embroider the whole name, people will pay less that way because she's much less likely to find a John Carl Smith  then just a John ect. \n\nUsed toys work too. The kid likely won't care but the resale value goes down a lot. \n\nThey where selling/returning the gifts for drug money. So I had to get creative.",
      "id": 36,
      "comments": [
        {
          "score": 523,
          "content": "I embroidered: \n\n\"For 'name here'\n\nChristmas 2020\"\n\nI hope it's enough.",
          "id": 37,
          "comments": [
            {
              "score": 277,
              "content": "Thats the literal best you can do. So hopefully it does. :) I feel bad for the kid. :(",
              "id": 38,
              "comments": [
                {
                  "score": 226,
                  "content": "Me too. But we want to show him as much love as possible. We're going to fight for our little family.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 54,
                      "content": "Make sure to to take pics of him with the gifts if you possibly can.\n\nNTA",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "You need to keep written and recorded proof of everything. Find some way to verify that she gets rid of your gifts. Verify she tries to control your activities with him. Most courts only care about how the parents actions affect the kids, so do everything with his best interest in mind and record everything showing she is trying to alienate you two. That will be really powerful in court.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "Your husband-to-be had a chance to fight for his little family. Instead he signed over custody and enjoyed his life until you came along. Go in with your eyes open, op.",
                      "id": 42,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "If you’re worried about her selling all the gifts, what about something she can’t get her hands on? What about creating an email address and every birthday/Christmas/special event, you guys write a letter/message and attach pictures for memories. Then put some money into an account for college or whatever in addition to gifts. When he’s 18, give him the login so he can see you guys were there every year and his mom can’t manipulate him into thinking you guys never did anything for him.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "OP you should really make sure that you are keeping records of all the interactions with the ex. It sounds like she is trying to paint you guys in a bad light, and this type of behavior can have an impact on custody disputes.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I’m going to get my nephew books for Christmas I think and I’m going to put “From Aunt Friendlyreplies, Christmas 2020” inside them. I don’t think my sister will sell them, but I want him to be able to read it later and know who gave them to him and when.",
          "id": 45,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 478,
      "content": "INFO: ...she 'tricked' him into sole custody, and now that he's got a fiancée he's changed his mind? Hmm. How do you know all his stuff is getting sold? How old is this kid?",
      "id": 46,
      "comments": [
        {
          "score": 430,
          "content": "I feel like I’ve heard this story before from almost every current girlfriend of a guy who barely sees his children.",
          "id": 47,
          "comments": [
            {
              "score": 193,
              "content": "Definitely the story my daughter's dad likes to tell all the random barely legal \"wifeys\" he has.\n\nThat said, it is also a story I watched play out legitimately with one of my coworkers about 2yrs ago. She would constantly lie to people about what was going on during her \"fighting for her son.\" All my coworkers would hype her up, cover shifts for court dates, gave her gas cards and restaurant gift cards to help out a StRuGgLiNg SiNgLe MoM. Turns out, the half assed excuse my baby daddy and all the other deadbeats tell, actually happens to some decent guys. \n\nThis so-called mom asked her sons dad to give her sole guardianship, NOT CUSTODY, before he took a couple month trip to his immigrant parents home country to visit ailing grandparents. The father was born over 15yrs after they moved here, and his entire existence was built in the American Midwest, not in the small European countryside home of his ancestors, so he knew he'd be back after the visit and the mom agreed to videochat him a few times a week so he could see his sons face. But he understood that she had a legitimate need to be able to make all the important decisions in case of emergency without him. So he agreed, with the caveat that any paperwork he was willing to sign would blatantly state the arrangement could be revoked at any time just by signing something at the court house, and was immediately terminated 90days after signed. Well, this mother saw an ill willed opportunity and took it. Knowing that he was using an international number from a company there and had started a new Facebook account, when his supposed to be short term trip was extended after his grandmother passed while he was there, knowing that saying good bye was the point of the trip but thinking they had closer to 6mo left than 1mo, she filed for full custody under the pretense that he had ghosted during the time she knew he was leaving and she had since lost any way to contact him. Basically stating to the court he had abandoned his son. She effectively convinced everyone in our area, us at work, her whole family, and the court that she knew he was leaving for 6wks and he hadn't returned. When the 90day guardianship expired, she acted completely distraught about having to file for custody. She was going to court, lying under oath about her knowledge of his whereabouts and how to contact him, and talking shit about him to everyone, all while videochatting with him multiple times a week and keeping him under the impression that things were fine. Somewhere around 2mo behind schedule, when he had buried his grandmother, and gotten grandpa moved in with family and safe, he returned to  Central Illinois to find he had no legal rights to his son. The ensuing legal shit show that went down is still talked regularly around here. He brought down hell fire upon everyone involved: the involved law firm, the judge, her family, and especially this woman. I truly don't understand how planned on this working out long term for her. He obviously could easily prove he had remained in contact the entire time and she had committed perjury. Long story short, the lawyers she worked with paid all his legal fees to reverse everything on top of a settlement, the oldtimer local judge retired early, and he now in turn has full custody while she's serving time and she'll have to work through a plan to regain any of her rights.\n\nObviously the story above is not the typical situation. But OP and baby daddy could be in the less dramatic version for sure. Giving birth to a child does not immediately instill the ability to put that child's needs above your own petty desires.  And honestly, I feel the growing popularity and commonality of deadbeat dads, some legitimately great fathers are looked down upon because its so easy for crazy bio moms to gain sympathy these days.\n\n\n\n\nHang in there OP. As someone who gives her kid's dad every opportunity to be involved and watches her baby's heart break repeatedly when he blows her off, don't give up. All kids want is to know they're loved, and to put this much thought into Xmas presents shows you love that kid.",
              "id": 48,
              "comments": [
                {
                  "score": 80,
                  "content": "There’s nothing that the OP has said that makes it seem like they are the exception. OP should stand back and let the father take the lead. If he thinks it’s a bit assholish to label everything, then they should go by what he feels.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 39,
                      "content": "Dad absolutely gets final say. If he thinks is an asshole move, its not up to OP. No offense OP, but bio parents gets final call if it involves the other bio parent. (Even in my own family where my wife is 100% my child's parent regardless of blood. She is my child's mom just as much as me when it comes to parenting decisions, but when it comes to how we handle biodad, she gets input of course but I have to take lead.)\n\nI think whether OP is being niave to biodads actual level of commitment to the son or how he lost his rights originally is unrelated to this judgement. 100% possible dude didn't want actual responsibility of the son while both finishing his degree but also enjoying his last days of unbridled freedom and recklessness in university before he to legitimately had to act like a responsible adult in the real world. Also possible bio mom took advantage of his own naivety to take control before dad figured out what he wanted. Either is possible and our internet jury really can't know.\n\nNTA for marking the gifts, I figure thats the same as me labeling my child's clothes so that she comes home with the $35 jeans she arrived in and not the $3 ones on sale at Walmart. Not because cheap jeans are bad, I love clearance sales. But what I provide my child is not her other sides families property just because she's there. But if dad doesn't want to rock the boat by adding labels, you'll become the AH real quick by ignoring those wishes.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "> As someone who gives her kid's dad every opportunity to be involved and watches her baby's heart break repeatedly when he blows her off, don't give up\n\nYah, I can relate to this. I tell people, when they ask, \"trust me, this isn't crazy ex wife making up stories, I literally tried everything and sacrificed more than I should have to give him a chance to be a good dad because I want that for my kids.\" And my kids saw the sacrifice so they know the truth of what happened, I have no guilt about it. But I know there's so many like ops situation so it's heartbreaking to know so many parents are willing to let their kids feel horrible like this...",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "It could also be a bit of a mix of “bad guys.” Dude wanted to keep living up the college party life and signed away his rights and left mom to do all the initial care. Now he’s got a new girlfriend to do all the parenting he suddenly wants back in and mom is pissed he’s trying to be Disney dad by only sending gifts and doing none of the real work and she is being a bit petty by selling the gifts so he doesn’t get to be the awesome fun parent to the kid while she’s the actual caretaker.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 140,
              "content": "These two separated 2 years ago, and somehow he is already set to marry a 22 y.o. Either jumped on a relationship immediately or OP barely knows the guy. No way he was “tricked” into giving up his damn rights. OP hope you attend court because I’m sure it will be eye opening.",
              "id": 53,
              "comments": [
                {
                  "score": 89,
                  "content": "I know. It's a shame on how so many grown men are so easily tricked when it comes to their children, but they're fighting for them just as soon as the new girlfriend hires that lawyer.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yup! My ex suddenly wanted to be in our daughters life when his girlfriend (now fiancé) got pregnant, said they wanted the child to know their sister. My daughter was 2 at the time and had seen him once for about 30 minutes, then never again because he didn’t want to be involved. I honestly wish I never told him I was pregnant/had his baby because he causes so many problems. A year after that happened I filed for child support and suddenly (when faced with having to provide, instead of just play ‘fun dad’ every other weekend) he wants FULL custody. He thinks he was wronged by a biased court system because he didn’t get that.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Or the malignant narcissistic grandmother the mother separated the kid from who inherited her dead husband's money.\n\nOh that's my life the last 3 years..",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Right, and the dad quickly entering a relationship and getting married is going to be really tough for his poor son. He already lacks stability - his parents are divorced, the father is in, out and back in his life. Now he's about to have a new step mom. \n\nSlow down for his sake, it's too much. And the boyfriend should be handling his sons gifts, not OP. The boyfriend should reestablish a relationship with his son, before even thinking of introducing OP. This is a recipe made for disaster. I feel bad for the kid.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 86,
              "content": "Same. Based on another comment, sounds like he didn’t even get a lawyer until she was in the picture, and he told her to find the lawyer.",
              "id": 58,
              "comments": [
                {
                  "score": 83,
                  "content": "OP needs to back off. If nothing happens when left up to biodad then that should tell you something.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 44,
                      "content": "This. I dated a guy ages ago with a couple of little kids (he was 36, I was 22, need I say more) and it was all about how his evil ex kept the kids away from him. Except when they were over he'd be sleeping or playing his drums and I'd be making mac and cheese and playing games. Shitty men do this. Take a step back OP and see what he does. NTA for being a big hearted person.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "This is excellent advice. It sounds like she's over-involved in the situation and the responsibility should fall on the Dad. OP, please don't try to rescue this man and his son. it's not going to work and the casualty will be the son.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "[deleted]",
                  "id": 62,
                  "comments": [
                    {
                      "score": 7,
                      "content": "No wonder he’s fighting for custody. He’s got someone to do all the work for him now, and then he wouldn’t have to pay child support.",
                      "id": 63,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "For real, I work in child support and I swear a solid 90% of the people I'm trying to track down for nonpayment have some shit on their fb page about their kids being their life and \"it takes a real man/woman to be a parent.\" Like, sure fam, your ex asked for custody and you didn't even show up to court, but go off. I have custodial parents that are legitimate nightmares who absolutely want to be the victim, but for every one of those, there are 20 parents who can't be bothered to do more than the bare minimum, if that.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Exactly my thought. For every my ex is evil there is a post by the other side saying the same.\n\nMy stepsons father wasn't for in his life when I met his mom, gone for 6 years. He had no established rights, he had never sought a lawyer or tried. Yet he blames my wife for keeping him away. \n\nOf course it's false, he could have filed himself without a lawyer and received at least visitation with the boy. We won the case he finally filed and all the appeals, and the judge is not a fan of his.\n\nThe point is his wife I'm sure agrees with him and thinks my wife is an evil woman and her husband is an angel.\n\nShe's wrong, objectively so but could easily make a post like this one.\n\nI always think about that anytime I see a stepparent post.",
              "id": 65,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "I've known people this shady... It, unfortunately, happens.",
              "id": 66,
              "comments": [
                {
                  "score": 13,
                  "content": "Yes it happens, but all of OP’s responses make it sound like new girlfriend is more interested than he was in the beginning.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -15,
              "content": "Well, I don't know what to tell you. I'm just trying to support my fiancé. He really is trying to be a good dad. Sometimes he feels so down if we can't see the boy. Is there something else you want to know?",
              "id": 68,
              "comments": [
                {
                  "score": 58,
                  "content": "Was he fighting for his child before you came into the picture or after? \n\nSupport him, but you shouldn’t be taking the lead on anything with his child. That’s his responsibility. He needs to get the gifts and determine if he wants to write the name all over everything. You need to step back. It’s his child and his ex. He’s responsible for setting the tone on all of it. You should only be support.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yes, he already was. I just encouraged him to go on. \n\nHe's the one deciding everything. I just make some proposals. Sometimes he wants me to do something but it's always his decision. I'd never take that from him. I'm just more outspoken.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 48,
          "content": "Yes this comment right here.\n\nVery interesting that this 20 something year old girl with no children seems to know just enough about the legal system from the would-be victim and doesn’t feel the need to look in to it further. \n\nDoes super dad pay child support? We need a lot more info.",
          "id": 71,
          "comments": [
            {
              "score": 11,
              "content": "My ex pays child support. It’s garnished out of his wages. Paying child support is the least someone can do. And it’s normally because they get threatened by the courts if they don’t.",
              "id": 72,
              "comments": [
                {
                  "score": 6,
                  "content": "Agreed. My ex pays $93 a month and he gets to say “I pay child support.” It is not the trump card people think it is.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "Tbh I was going to ask this as well. A friend of mine got into a similar situation only to find out he never actually wanted to spend time with the kid. And he turned out to be abusive post marriage.\n\nLater on when she divorced him, she finally talked to the kids mom to only find out mom had been desperately trying to keep the dad in the child's life.\n\nI'm not saying it's impossible, cuz people can be incredibly manipulative to get their way with child custody... It's just hard to tell cuz it really can go both ways in this scenario.\n\nHopefully her fiancee is being truthful.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "I’m more concerned that the fiancé knew the ex was abusive...so he gave her custody of his child and then cut contact? I can understand being overwhelmed, but that’s one heck of a fuck up.\n\nAnd let’s be real, if fiancé was a) in college with no income, b) hours away and c) not in contact with the child, then yeah, a judge would award more custody to the ex. But it’s statistically more likely he just came to an agreement with the ex before they even went before a judge, and is now trying to get custody back.\n\nThat doesn’t make OP the asshole though. Just makes the fiancé look quite dumb *at best*.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "The kid is 2. \n\nMy fiancè was still at uni when he was born and after a few months, they separated. My fiancè gave her sole custody because she told him, she couldn't go to the doctors or make important decisions without him if he was involved like that. She made him believe that he was living too far away to be there in an emergency. \n\nAfter the separation, he stopped contacting her for a few weeks because he needed to move and get his life back on track. After that, he started to fight to be back in the life of his son. He did mediations for about a year until recently when we decided to go to a lawyer. I met him while he was already trying to get legal rights to his kid. \n\nWe know that the stuff is getting sold because she told some mutual friends.",
          "id": 76,
          "comments": [
            {
              "score": 144,
              "content": "I mean, your fiance was 24 at the time not 4. There’s no way a 24 y.o who really wanted to be there would just blindly believe some obvious lies, or would give up his rights without even talking to a lawyer first. But yeah he wanted to be in his son’s life so badly that he gave up his rights, cut all contact for a year and conveniently got a lawyer only after you got in the picture.\n\nAnd tip, you don’t do “mediations” after you reached an agreement and certainly not without a lawyer.",
              "id": 77,
              "comments": [
                {
                  "score": 85,
                  "content": "Also the luxury of taking a few weeks off after the birth of his child to “get things back on track”. What about mom? She didn’t get to walk away for a few weeks because she was caring for a newborn.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "[deleted]",
                  "id": 79,
                  "comments": [
                    {
                      "score": 43,
                      "content": "I’ve never needed permission from my children’s father for anything medical ...??",
                      "id": 80,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "How would the doctors know the parents legal situation unless told...\n\nShe could have made decisions, he could have filed a case if he disagreed and she didn't seek his opinion.\n\nThe fact is though that medical providers have no clue who has what rights over a child",
                      "id": 81,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "My parents divorced when I was a baby and dad bumped off to a whole other country so my mom didn't bother with going to court for any sort of custody agreement or termination of his rights, no she made made all medical and educational decisions for me without any legal trouble. \n\nShe didn't even go after him for child support so there was no paper trail there that he was involved that way either. The only thing she couldn't do without my father's permission was take me out of the country. She took me all over and we even moved states with no problem because he never actually came back to court here and contest it.",
                      "id": 82,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "That’s not true.  I’m divorced and have been divorced for 12 years.  Never once did I need my ex-husbands permission for our daughter to receive any medical or dental treatment.",
                      "id": 83,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": -1,
                  "content": "He didn't know any better. His family wasn't supportive and he was still in uni. He was compleatly overwhelmed. I don't just believe him blindly. I read all the messages and talked to his family and friends. I do know what happened. I do not just blindly trust people. \nAnd he didn't just cut contact. He came out of an abusive relationship. He just didn't wan't to have contact with her. \nStill, that's not what I came here to ask for. I just wanted to know about this idea and what you guys think about it. I have a lot of family helping me and looking out for me. We also aren't alone in this. It's not just him or just us.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 44,
                      "content": "Hold up. He left his newborn child with his abusive ex? And that doesn’t disturb you?",
                      "id": 85,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Yes of course and the right course of action then was absolutely to abandon a newborn with an abuser and only think to fight for said baby after two years and only after the new gf started the process of finding a lawyer. Sure, that makes him seem so much better now!",
                      "id": 86,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Idk about \"tricked\" but I know of a former couple (not married) who, while still together, made the decision to assign sole custody to the mother (I think for some kind of financial reasons or whatever, idk, I don't have kids, no idea how it works). They're now not together anymore but as far as I know still co-parent normally and he continues to be in his child's life. But if his ex wanted she could totally restrict this due to having sole custody. So that is always a risk with those kind of arrangements, especially if the breakup is not amicable. I would never agree to something like that.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 161,
      "content": "NTA. Any chance you could gift him an experience with his dad (like going to a show or amusement park - whenever we can do that stuff again - or even a meal or something) so she can’t take it?",
      "id": 88,
      "comments": [
        {
          "score": 93,
          "content": "Not right now. We really want to do that but his mom only lets us see him for 2 1/2 hours every Friday and every other saturday.",
          "id": 89,
          "comments": [
            {
              "score": 46,
              "content": "Ugh I’m sorry about that and that you guys are dealing with this and I’m sorry that he’s not able to be with y’all. Sending you positivity.",
              "id": 90,
              "comments": [
                {
                  "score": 35,
                  "content": "Thank's a lot! That's actually really helpful. Sometimes I struggle a lot because I want to support my fiancè and don't have time be find support myself.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 34,
                      "content": "You shouldn’t be supporting you fiancé in this way. This is his son. You are not married. You legally have no claim or responsibility to this child or ability to make any decisions. Your constant answers with we, we, we is concerning. “We pay child support.” “We are going for custody.” There is no “we”, at least there shouldn’t be. Not right now. You’ve barely been together 2 years and you are not married. You need to let your fiancé handle custody, finding presents for his child, everything. This is not on you. Your job is to be the loving, fun stepparent and that is it. Any and all major decisions or actions need to be completed by your fiancé not you. You are doing more damage than you realize assuming all of the responsibilities. You’re a supportive character not the main character. If he’s not able to step up and parent his child like he should without your help you should consider that a huge red flag.",
                      "id": 92,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 24,
                      "content": "You're 22! Your adult life is barely getting started! You should be figuring out who you are, not with someone who needs so much support that you don't have any for yourself. \n\nPartners should support each other and be there for each other through tough times, but it's really concerning that you're still in the honeymoon stage of the relationship and already struggling because you're pouring so much time and energy into solving your fiance's problems that you don't have enough left over to take care of yourself. If he is a decent man, he shouldn't be letting you take on so many of his burdens.",
                      "id": 93,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "How about little kid games?  Candy land, and  well there has to be more but I'm old and so is my kid. lol\n\nStart a love of board games young and you can sit around for hours with family, eating junk, in your comfy pajama's, drinking hot chocolate.  Great Christmas.  That's the one my son and I had last year.  He kicked my butt at the new Fortnight Monopoly game.  I had a great time.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "what about having the sons gifts to be at your house? and the personalised ones he can take with him to mums house?",
              "id": 95,
              "comments": [
                {
                  "score": 7,
                  "content": "That's exactly the plan.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Sounds like that won't work until they get custody. :(",
          "id": 97,
          "comments": [
            {
              "score": 18,
              "content": "Exactly. That's why we got a lawyer. If everything works out we'll have shared custody by February.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 141,
      "content": "NTA but from reading your other post maybe you need to step back and let your fiance handle this stuff. He seems really standoffish about getting his kid back if he's having you do most of the legal work. I doubt if y'all weren't together he'd have a problem with the agreement since he doesn't seem to be the one pushing to change the custody agreement as much as you are.",
      "id": 99,
      "comments": [
        {
          "score": -38,
          "content": "I'm not doing the legal work. He's the one deciding everything. I'm just helping him. For example when he decided he wanted to get a lawyer he asked me if I could look for some to get an idea. I'm just helping and he's really involved in getting his son back. He just needs to be more careful because whatever he does will be used against him. That's why I'm the one talking. It just \"doesn't count as much\".",
          "id": 100,
          "comments": [
            {
              "score": 147,
              "content": "I’m not trying to be hard on you or anything, but you’re sounding pretty young and naive and giving every single excuse I’ve heard from other women in your position. Stop doing the leg work. Don’t look for the lawyers. Don’t decide on the gifts. It is not your role in this dynamic to do any of this. Be the support without being the one to do the work. If it’s important to him, he will do it. If it’s not, perhaps that should serve as a warning sign.",
              "id": 101,
              "comments": [
                {
                  "score": 91,
                  "content": "I mean yeah he wants his kid back so badly he can’t even be bothered to look for lawyers two years in the “fight” for visitation. Because apparently trying ti find a lawyer may be used against him and he needs to be very careful?",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -20,
                  "content": "But it is important to him. That's why he wants a second opinion. That's why he's asking me. How should I help it not like this? Do you have any advice on that because I don't know what else to do?",
                  "id": 103,
                  "comments": [
                    {
                      "score": 83,
                      "content": "He isn't asking you for second opinion tho is he? You are doing all the work, he is just giving you permission.\n\nPoor helpless man \"tricked\" into giving up his child is a tale as old as time. Even if it is true a quick Google search would have shown him she was lying. This is his son let him take up the fight and when he has things in order by all means he can ask for your opinion.\n\nAlso how do you know she is selling everything? Do you have first hand knowledge of her toxic behaviour?",
                      "id": 104,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 44,
                      "content": "Step back and let him take the lead on it all. I think if you truly looked at it, you’re the one search for everything and he says yes or no. You’re putting in all the emotional work and he’s the one stamping it ok. Just stop. Let him put forth the effort.\n\nETA the point is that you shouldn’t do anything. He should. I mean, if you weren’t in the picture, wouldn’t it all be on him anyway or would he just let it all go?",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "It’s only important to him now because it is a golden ticket for sympathy from young, naive you. And he has your unwavering support to do all this stuff for him. \n\nHim making decisions and leaving the brunt of the work to you is not fair.  \n\nReally be honest with yourself. He could have done this 2 years ago. \n\nLook up narcissism and narcissistic behaviours.",
                      "id": 106,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "[removed]",
              "id": 107,
              "comments": [
                {
                  "score": 1,
                  "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
                  "id": 108,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -7,
                  "content": "That's not the case. He's still deciding everything and he's the one fighting. I'm just helping him. I know you won't believe me but that's the case. We are also not alone. Our families are helping as well and supporting us.",
                  "id": 109,
                  "comments": [
                    {
                      "score": 65,
                      "content": "In your other post you literally say you pay the lawyer fees, organize the boy’s room, write letters to the lawyers...you’re literally doing everything of substance.  You SHOULD NOT be involved AT ALL, let alone be the one doing the legwork.  Trust me, as someone who was once a naive 22yo girl, in a few years you will realize how truly fucked up this situation is.",
                      "id": 110,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "[removed]",
                      "id": 111,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 127,
      "content": "INFO why are you deciding this and not your fiancé? Shouldn’t it be left up to him?\n\nAs much as it sucks, she gets to decide what she has in her own house. If you want him to have something, keep it at your own place where she can’t get rid of it.",
      "id": 112,
      "comments": [
        {
          "score": -12,
          "content": "I just give him some options and he's the one deciding. He's not very creative when it comes to gifting something and wants me to propose some ideas for him to choose. This was the one he liked the most but I wanted to check with someone from an outside perspective. \n\nHe has a room at our place as well and will get some toys to keep there.",
          "id": 113,
          "comments": [
            {
              "score": 113,
              "content": "He should be the one coming up with the options. He’s sounding extremely passive when it comes to this child. First his ex told him what to do and now you are. Step back and let him take an active role.",
              "id": 114,
              "comments": [
                {
                  "score": -16,
                  "content": "Some people are bad at gift giving. My brother leaves the creative part to me and just transfers me the money. \n\nIf the Dad is one of these people it makes sense for OP to come up with some ideas to ensure the best possible outcome.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 28,
                      "content": "This isn’t the only thing she’s taken on. She’s also done the searching for the lawyer. \n\nI know everyone is wanting to give them the benefit of the doubt, but the more information we get, the more it sounds like he’s just passively letting the women in his life handle his kid.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 63,
              "content": "If you're doing all the work and he's just throwing out the occasional opinion or signing off on your ideas, you're not being supportive, you're doing it all for him and he's the one supporting your work to get his son. \n\nYou're 22 and weeks away from marrying into this drama with a guy you've known for... what, a few months? Maybe a year and some change? What reasons do you have for getting married so quickly? I'm 23 and getting married soon, so it's not a blanket judgment on young brides, its a specific concern given the way you've presented your situation.",
              "id": 117,
              "comments": [
                {
                  "score": -16,
                  "content": "You are putting way too many thoughts into my situation. We are doing well and we want to get married because of love. We live together, have 2 cats, a big flat and we are both doing our fair share of chores and earning money. We respect each other, nearly never fight and I don't want to be without him anymore. We are doing amazing and we are in a healthy and loving relationship. I just wanted to know if it was a good idea for a present.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 66,
                      "content": "I know its not the question you asked, but there's a reason I'm not the only commenter concerned with your situation. You're very young and you're jumping into marriage very quickly. And while I'm sure your relationship has all those great qualities you're describing, it also has unhealthy qualities that you've described in this thread. Just because you're happy doesn't mean you're doing what's best for yourself.",
                      "id": 119,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 32,
                      "content": "Love is not enough for a marriage. That’s something I didn’t understand until after my first marriage went up in flames. I hope you don’t have to learn in the same manner that I did and that you two can grow together. \n\nHow long has this relationship gone on? And what’s the harm in waiting?",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "His son should be his most important thought. Even more important than you. To be so flippant about it shows great immaturity on your part. That child is a whole ass person, not a fucking cat and some chores.",
                      "id": 121,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "So what's the rush? You can still be involved in this guy and his son's life without immediately getting married. Allow yourself to spend some more time to get to know each other.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "So he's not actually your stepson yet?",
                      "id": 123,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 124,
      "content": "Your eventual verdict here is going to be N T A likely but a huge chunk of people are telling you to back way up. I have to agree.\n\n1) you are not a stepmom yet. You are his dad’s girlfriend.\n\n2) Stepmom does not equal mom.\n\n3) he already has two parents.\n\n4) you only know your fiancé’s side of the story. You acknowledge they do not get along. It takes two to tango, missy. Your fiancé probably does have some culpability here, even if it’s lesser.\n\n5) It’s interesting that while he expressed to you he may have wanted custody of his child prior to meeting you, he seems to have only started working at it when you got into the picture. The timing is suspish.\n\n6) why does she dislike you? I can probably guess. (Edit: this is not to suggest you are unlikable or a bad person, just that I can see why she doesn’t want to be nice to you.) You are marrying the father of her child, whom she was with only two years ago. The child is two. That means they broke up around when he was born. He went off to uni, took a break, got to have a life and career, and she had to be a single mother to an infant. Do you know what the average new mother goes through mentally and physically the first year of a child’s life? And then he turns up with a new young girlfriend wanting custody? And then the new girlfriend plays mommy and tries to communicate with her about stuff that is between her and the ex? And apparently the ex shit talks her constantly to the new girlfriend.\n\nCome on, OP, put yourself in her shoes. Seriously. Why on earth would she want to play nice with you?? \n\nI’m not saying your heart isn’t in the right place but you are interfering with what should be between your fiancé and his ex. That is the mother of his child. They are tied together for the rest of their lives through this little boy. You should be encouraging him to do all of this on his own and cultivate a better relationship with her, not be an intermediary. Most custody agreements won’t even allow separated parents to introduce new partners to their children for a certain time period, like a year. That should tell you how uninvolved you really should be-you’re not even a major player in this fight. \n\nWhether or not your fiancé “wanted” to be there or “meant” to be there, he apparently didn’t work very hard to be there. A father, anxiety or not, should be moving heaven and earth to be with their child, not wishing on a star until he gets a girlfriend who will do all this stuff for him.\n\nI really hope you take into consideration what a good 50% of people are telling you. It’s not an indictment on your relationship. It’s just sound advice for the good of you and your fiancé and the baby.\n\nEdit-\n\nMy final verdict after reading all comments is ESH .\n\nNGL, I read your other post in the helpme subreddit and I think you may be romanticizing this situation. Like the humblebragging about how your fiancé needs you, you build his confidence, how awful his ex is, alllll the stuff you’re doing for him like writing the letters for court, etc. You’re “suing” his ex, you say. Your other post makes it sound like you’re ready for some big emotional cinematic custody trial in a melodrama. Idk if it’s your age or what, but that is not a realistic view of what is happening here. \n\nAlso, you say you are “suing” your fiancé’s ex??? Idk if you’re using mistaken terminology or if you actually are suing her-in which case, no *wonder* why she doesn’t want to be civil with you. You *are* acting like you want to take him away from her. You can’t say all that shit about his ex, accuse her of what you are accusing her of, take her to court, blame her for allll the custody problems, and expect her to not think you want to take him away from her! If he called a government agency (as you said in your comment) to get custody from her, you actually put her in real danger of losing her child! \n\nLike she knows what you are saying about her if you are suing her and reporting her-it’s on the record. Think about that for like a minute in your brain. If someone was doing this to you, would you want to play happy families with this person??? \n\nNtm, do not give a present to your fiancé’s ex. It is not generous. Do not give chocolates to someone you are suing, ffs. It doesn’t make you look like the bigger person. It’s an action designed to make you look like you are playing nice and she is not. That gift would play off like a trap, if it were given to me in that situation.\n\nThere is also zero proof she is selling his possessions for profit. The ex buys her child toys, you said in another comment. You actually passive aggressively judged her for buying her child gifts in that comment. All you know is that they “disappear.” Btw, one wonders why your ex only has 2 hours a week with his kid? Like that’s just his shitty luck? \n\nI also find it interesting that your fiancé gets a pass for being young and dumb when it came to “accidentally” giving up custody but his ex is actually *a year younger than he is* and she does not get any passes from you for being young-your fiancé was “manipulated” because he was young but you think his ex was able to\nManipulate him even though she was younger than he was? Give me the mental gymnastics on that one. \n\nTLDR: Your fiancé’s ex might suck (because we don’t know the whole story,) your fiancé’s sucks (because wifing up a 22-year-old and weaponizing her against his ex instead of being a dad and doing the legwork, and acting like he was tricked, is sucky behavior) and you suck for not recognizing that you are overstepping this way.",
      "id": 124,
      "comments": [
        {
          "score": 22,
          "content": "This was so good to read!",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Perfect summary of what trickled out in the comments. OP is giving off the vibe of fixer and romanticizing playing house with this poor confused baby. So many excuses made for the dad. She has a reason for everything. I hope she wakes up soon and realizes that he’s not some wonderful father who was manipulated into being uninvolved with his child and couldn’t even hire a lawyer to fight for something he supposedly wants.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I think I love you",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -12,
          "content": "While I think it’s definitely really easy for a parent’s new partner to over step their boundaries (even with good intentions) I think it’s also really weird that nobody in the comments seems to touch on the fact that mom is *selling* all the toys/gifts that he does get from them. \n\nI mean, is it *possible* that they were things that were totally not to his taste/age range/etc? I guess, but that seems unlikely that *every single one* was so useless that mom sold them for the cash. \n\nLike it’s down right vindictive to take the toys given to your child by the other parental unit and sell them. I mean, at the very least, it’s fucking weird\n\nEdit: lol I like the downvote for simply pointing out the one thing in OP’s story that I think, *if true*, is just strange behavior \n\nThis entire fucking sub is on the basis that the internet sometimes hosts false stories. If that’s offensive, then the internet really isn’t the place to be for you. \n\nAs far as I’m concerned, there’s no reason for me to spend too much time worrying about whether or not a story is real. If it’s not real, it doesn’t fucking matter to me. If it is real, we’re discussing it.",
          "id": 128,
          "comments": [
            {
              "score": 13,
              "content": "Except we do not even know that it’s true. I read her comments. The ex buys her son gifts herself. OP said (rather judgmentally) that somehow the Ex has money to buy gifts. If the ex was selling the toys and clothes from OP and fiancé, why would she spend money on toys herself for her son? Also, what kind of money or how easily could the ex sell the toys and clothes? He is two years old. How “lucrative” could this be or where is she selling it? Does she take it back to the store? If so, why? Are the toys inappropriate? Does he lose the toys? Do the clothes not fit? Does he outgrow the clothes quickly? There is so much here we aren’t told. We only know OP’s incredibly one-sided view on the Ex. They only see this kid 2 hours a week. How tf do they know what is going on at all?\n\nWe know Ex does not abuse or neglect the child. We know she buys toys herself for the child (and OP doesn’t approve of this.) We know something happens to the stuff OP and fiancé get him. The ex wanted some organizational containers for the child to put his toys and yet, this is considered weird. We know OP said “he’s not neglected but he’s not well taken care of either.” I mean? It just smacks of someone who thinks she can be a better mommy than the Ex. You’re telling me OP’s fiancé somehow forces the Ex into therapy without her compliance? We do know that OP and fiancé are suing the Ex also.\n\nEdit- OP’s fiancé apparently called some German equivalent of CPS on the ex as well. I mean, I only see one vindictive person here and it’s not the Ex. It kind of seems to be OP’s fiancé.",
              "id": 129,
              "comments": [
                {
                  "score": -7,
                  "content": "Well... \n\nI’m no professional post history sleuth \n\nBut I will say that it’s possible to read anything two ways. \n\nIf they want custody then of course there’s a court case. \n\nIdk. \n\nThe only comment I saw was where OP said they had heard about it because the ex told mutual friends. \n\nAlso, I think you severely underestimate the price of things for children under 4–toys, clothes, silverware, anything and everything. Most of it can get pretty pricey depending on the kind you get.",
                  "id": 130,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I think you’re severely overestimating how much you get for resold children’s stuff. The ex isn’t making anything off of it. She’s probably just getting rid of clutter from her home. I mean, how long is she supposed to keep things? Babies grow quickly.",
                      "id": 131,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "I have nieces and nephews. I absolutely understand how pricey these things can be. And I also know how cheap they can be. I also know how much things get used before you get rid of them and how quickly children outgrow clothes, and how packed a house can get with toys before it might be time to get rid of some of the less played with toys. Literally, we just sold a bunch of my niece’s toys on FB because my sister’s apartment was so crammed with toys after her birthday and Christmas that she couldn’t keep all the stuff.\n\nI still don’t understand the intention because how much stuff could OP and her fiancé possibly be giving to the kid that the ex can sell them for “extra money.” They’re not sending hundreds of dollars or German equivalent in items to this child every week. Where is she selling these items? Like she’s putting all her kid’s stuff on Facebook marketplace and making extra money? \n\nAnd if it is true, how do we know it’s for cash? Or selfish reasons? And if the ex wants cash for herself, why continue to purchase toys for her child? All OP has is that a mutual friend told her this. \n\nIf they want custody, there is mediation and a case. It’s not a trial of the century. We know that OP’s fiancé called a government agency for custody even though the child was not neglected, abused or in danger. That is some vindictive shit.\n\nAlso, OP only has two posts in her history-didn’t take much of a sleuth.",
                      "id": 132,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 122,
      "content": "YTA. He is not your stepson you have no say, it's between the parents. They split 2 years ago and she \"tricked\" him into sole custody and he lived hours away. What did he give that she sold in the last 2 years ? Babies and toddlers grow out of things pretty quickly . You ask what the child need and were told a toy box . Whats wrong with that ? I got my kid a football toy box and he loved more than anything inside.  This seems to be more about YOU than anyone else .",
      "id": 133,
      "comments": [
        {
          "score": -8,
          "content": "Your comment literally says he is not your stepson not child.",
          "id": 134,
          "comments": [
            {
              "score": 22,
              "content": "right now he is NOT her step son, she is engaged to his father. After they marry he will be her stepson but that does not make him \"her child\" .",
              "id": 135,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -9,
          "content": "I said he WILL be",
          "id": 136,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -10,
          "content": "Your comment literally says he is not your stepson not child.",
          "id": 137,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -10,
          "content": "I said he WILL be",
          "id": 138,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -12,
          "content": "It will be their child pretty soon",
          "id": 139,
          "comments": [
            {
              "score": 19,
              "content": "No, he may become her stepson but he is not her child.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -16,
          "content": "He'll get a toybox as well. I just don't want him to have an empty box. That just wouldn't be right. Also my fiancé gave him a lot. Everytime he asked her what to get she just told him she doesn't need his help. So he did get whatever he thought was right for the boy. We just want to fill the box with something he might like as well. Just gifting en empty box seems so wrong.",
          "id": 141,
          "comments": [
            {
              "score": 66,
              "content": "Its still all about you , what you want him to have, what you think is right . This is not your child.",
              "id": 142,
              "comments": [
                {
                  "score": 5,
                  "content": "Right now I can't talk for my fiancé and I won't. I can only show you my perspective. I want the best for the child. That doesn't mean I'll decide on my own or take the responsibility from my future husband.",
                  "id": 143,
                  "comments": [
                    {
                      "score": 56,
                      "content": "Your entire narrative is one-sided with big chunks of context missing. It would greatly behoove you to learn the ex’s perspective on why she makes those claims before dismissing them and taking your fiancé’s side. If you don’t, you may come to regret it in the future when he starts throwing those same accusations at you.",
                      "id": 144,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -13,
                  "content": "Yes. Future stepmom wants future stepson to get a nice gift. The horror! \n\nAt least she is trying! How many evil-stepparent stories are posted on site each day? \n\nShe just want her gifts to not be thrown out. That is basic curtesy and the bio-mom is TA for selling the gifts her son recieved.",
                  "id": 145,
                  "comments": [
                    {
                      "score": 19,
                      "content": "She asked the mom, who the child lives with what they need, was told a toy box and that's no good. I did ask what kind of things the mom sold because infants/toddlers grow out of stuff really quickly and that could be why she got rid of stuff. The kid is 2 ..OP wants a wallet and blanket for the kid..he will be thrilled for sure with those. The father should take more of an interest than the future step mom, this is all about what she wants, feels. How many stories are posted about step parents WAY overstepping and making things worse instead of letting the child's parents figure things out.",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -16,
          "content": "Pretty sure you’re TA here. I mean how dare this woman try to ensure that her SO’s son receives, and gets to keep the presents they give him. Oh the horror, how will this child cope with having a loving father and future stepmom.\n\nYou asked what’s wrong with giving an empty box, and I’ll ask what’s wrong with filling that, practical, box with additional presents?",
          "id": 147,
          "comments": [
            {
              "score": 12,
              "content": "The woman is overstepping, it is not her kid, she doesnt get to make the rules. The kid is 2 and has stuff, she is doing it for herself, the child could care less.",
              "id": 148,
              "comments": [
                {
                  "score": -6,
                  "content": "Please explain to me how this is overstepping. Because if I’m not mistaken the child has 2 parents, OP has stated that they are getting the child the gift that the mother told them, and all OP is really asking is “would it be an asshole move to put [the child’s] name on the gift” so that the Mother doesn’t return/sell the gift and keep the money. If you wanna say that OP trying to fill the box with additional presents is overstepping boundaries, then I gotta ask: Who hurt you? Why are you so opposed to children being showered with gifts? I don’t see how this is over stepping any boundaries",
                  "id": 149,
                  "comments": [
                    {
                      "score": 2,
                      "content": "If the mother is getting rid of the gifts perhaps there is a problem unless the mother is crazy and if so the father should have no problem getting more visitation or custody. OP says a lot of things , like the father didnt think it was a good idea. The child is two, after 1 or 2 presents they are mostly more interested in the boxes, so who is the showering of gifts for if not the child ?\nThey asked the mother what to get, she didnt like the answer of toy box. Why did they even ask  ? \n\n I knew someone who walked away from his girlfriend and child, very little visitation with the child because he didn't care to. The mom got on with raising the child and about 7 years later the dad remarries and his new wife and her family thought it was horrible and that he should have split custody, even though he didnt really want it, because he ignored the child up until he felt the pressure from his new family . So the child gets drug through the whole, yes daddy's back, and here is your new family..he couldnt understand why the kid wasn't thrilled with his presence, then new wife and dad had another baby , the new wife wasn't as excited for his first son anymore, and when she stopped pushing the dad went back to not bothering..leaving the child broken hearted yet again.",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 50,
      "content": "INFO.  There's clearly more going on here.  I can't grasp how OP can be so...clueless.  Why are you even asking the ex what to get the boy for Christmas?  You say she said to get him a box, you never clarified with her?  If you and your boyfriend spend time with the boy, you should know what he's into and toys he'd like- so why even ask the ex?  I'm not sure why you'd even think to send all the things you get him to her house.  \n\nTo me, it seems like you're trying to push being one big happy family and that's happening too soon for the ex.  You are not her friend.  Not sure why you'd even think to get her a gift from you/and her ex.  I can see getting a gift for your step-son to give her from him, but not a gift from you guys.  I think what it is is that dad seems to have not cared at first, off doing his thing at university while she dealt with a baby and then all of a sudden he appears and wants custody.  But we're only hearing the new fiancee's side of things.",
      "id": 151,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 42,
      "content": "I’ve read through some comments and see this child is 2. A 2 year old doesn’t want any personalized stuff. What is he going to use a wallet for? Come on. \n\nYTA. \n\nMom has told you what would be pratical, so buy the box as a gift for her house and then buy some gifts for him to open on your time that will stay in your home.",
      "id": 152,
      "comments": [
        {
          "score": 0,
          "content": "In Germany, kids have wallets as well. They are for Kindergarten. \nWe also got something for him to have here. We just don't want him to get an empty box.",
          "id": 153,
          "comments": [
            {
              "score": 18,
              "content": "How old are children in kindergarten in Germany? I assume that two-year-olds all over the world are not great at managing a wallet. My nephew is two and his greatest passions are balloons and running in a circle around the room.",
              "id": 154,
              "comments": [
                {
                  "score": 2,
                  "content": "From 1-5. It's just for the parents and Teachers but they need to have a name on them to be recognizable.",
                  "id": 155,
                  "comments": [
                    {
                      "score": 6,
                      "content": "So he’s *been* in kindergarten. What is he using now for a wallet? Edit: rephrasing-Has he no wallet right now for school or are you replacing his current wallet?",
                      "id": 156,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Does wallet mean something different? What does he use a wallet for currently?",
                      "id": 157,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}