{
  "post content": "My 18 yr old daughter, Meg, is in college. She moved in with her boyfriend a few months ago, which left her old bedroom empty. \n\nHer bedroom used to be right next to our tiny living room. To make our tiny living room into a normal sized living room, we knocked out my daughter's room's wall, refloored the space and fixed the walls. Now it looks like the bedroom was never there and we have a spacious living room.\n\nWhen my daughter came home to visit and saw that her room is gone, she made a huge deal about it. She got all emotional and said if we never wanted to let her move back, we should've just said so instead of completely demolishing her room.\n\nI told her that if anything happens and she needs to move back, we will welcome her and she could sleep on the couch as long as she wants. But she accused us of wanting to get rid of her forever and for her to never visit us since we got rid of her room so fast, only a few months after she moved out and we should've waited longer.\n\nAITA for not waiting longer with the renovation?",
  "id": 1,
  "comments": [
    {
      "score": 58792,
      "content": "YTA. Is it that hard to talk with your own kid before doing something drastic? Not even a warning? That's cold.\n\nEdit: this sub isn't \"do I legally have the right?\" Obviously (s)he has the legal right as the owner. It's AITA. Yes, OP is an asshole.",
      "id": 2,
      "comments": [
        {
          "score": 21618,
          "content": "Yeah, moving out for college is a major life change that is really hard to adjust to, and taking away her one space of familiarity without at least talking to her first was wrong. And no, the couch is not an adequate replacement for her room being gone in case that needed clarifying.",
          "id": 3,
          "comments": [
            {
              "score": 10739,
              "content": "They probably didn’t approve of her moving into her bf’s at 18 so had to punish her somehow. Or maybe they just suck at communication.",
              "id": 4,
              "comments": [
                {
                  "score": 70,
                  "content": "You don’t know a damn thing about these people. Why pull something like this out of your ass?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 50,
                      "content": "Ur on r/aita dude u gotta expect it",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "That's what happens on this sub. People agree OP is the AH, and then they all make up a bunch of stuff to add to the story to make OP even worse. They see one situation, and think their fan fiction writing skills are missing",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 61,
                  "content": "Assuming this is punishment is projecting, at best.\n\nNothing in the post indicates the parents didn’t approve of her living with her boyfriend.\n\nIf it was me, I would have told my child what my plans were. However, I wouldn’t want my child to think I was doing this to push them to move back.\n\nAdditionally, If we are making assumptions, you could always assume OP thought the daughter would try and guilt her into keeping the room as it is. \n\nSo if I felt my child would take it this way, I would probably find a way of telling them the renovations were happening no matter what.\n\nIt is not fair to expect the parents to live in a tiny space just in case the daughter breaks up with her boyfriend some day and wants to move back. \n\nUltimately, NTA.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I had a place to go home during college, no projecting here pal. Just offered a possible motive.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "They're not living in a tiny space. Their living room is small. Obviously the house was big enough for three people to live in for however long they've been there. A small living room isn't the end of the world.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "The fact that she used “demolished” in her explanation?? Shows her communication skills.",
                  "id": 11,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Oh I can't imagine why the daughter would want to move out.  I only know them through this post and I want to move away from them.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 305,
              "content": "As someone who dropped out and re-started college multiple times and moved in and out of my parents multiple times in my late teens/early 20's yeah it's pretty cold and sends a clear \"you don't live here anymore\" message.",
              "id": 13,
              "comments": [
                {
                  "score": 209,
                  "content": "The fact that it happened the second she moved out sends an interesting message too. Like the parents couldn’t wait for her to be gone.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Yeah that's the shitty part of this. On the other hand - we have no idea of the other makeup of the house. Perhaps there are 3 other bedrooms. The \"Sleep yo ass on the couch for as long as you want\" sends the message though - \"You aren't living here for an extended period of time ever again so understand the couch is your option.\"\n\nThat's the real hard truth. My son will always have a place to stay. When I moved out of my moms and got divorced, I moved back in with her temporarily. She converted my bedroom into a day room, but there was a bed in there and she knew my schedule was sporadic and I would be home or not at best.\n\nOP is sending the clear signal that his daughter is on her own and can come home as a last option.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "As someone who had to move back home in my early 20s  after getting out of an horrific relationship, one of the few things that made me feel better was that I was *home*. I can't imagine if I'd had to move into a couch in my parents lounge.\n\nMy parents always, always made it clear that if we ever needed to come home, we would be welcomed and there would always be a space for us. I've always been grateful to know that. \nObviously it is a privilege not everyone has, but to not even communicate to your 18 year old that you're literally demolishing her room is pretty rough.\nOP is definitely TA.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Not to mention it puts daughter in a situation where she is more like to stay with boyfriend because she has no other options, even if the relationship goes sour.",
              "id": 17,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "> which left her old bedroom empty.\n\nI'm also wondering \\*how\\* empty her bedroom was. Did she take her furniture and all over her possessions leaving a legitimately empty room (indicating that she was moving out permanently and didn't expect to move back) or did she take most of her current clothes and daily use items but left her stuffed animals, her posters on the wall, some changes of clothes etc (indicating that she still thought she would continue to have access to the room). \n\nShe deserved warning either way that this was happening, but if her room still looked like \\*her room\\* when she left it's even worse.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "\"Here, let me pull the rug out from under your sense of security while you test your independence.\" \n\nChrist on a mini-bike.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "My dad always promised me a bed and a door, even in my mid-20s. Even after my room was converted into an office, there was always a guest room. What if OP's daughter wants to stay for holidays? What if she needs a place between semesters? What if her relationship with her bf crashes and burns or she needs a break?\n\nI understand wanting a larger living room and that it's OP's house, but that *was* his daughter's room and her safe, familiar space in her ever changing world. A courtesy call would have been nice at the very least.\n\nOne time my dad renovated the kitchen and I literally walked into a wall that had never been there. It's not the daughter's house, but it is still very much her home.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "when i read this post, it just made me think of all the times i'd drive home in the middle of the night just to feel \"home.\" college was just a whole new world that sometimes, i just wanted to sleep in my bed and be in my own safe space. a few times, i've climbed into my parents' bed LOL.",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Especially since most kids today aren't capable of achieving financial independence until their mid to late 20s. The parent's home is very much still a safety net that young adults require.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Yeah, Kid is only 18. She probably had a sense of security in knowing that home was still there in case things don't work out with her boyfriend (and let's face it, she's 18. They probably won't) or with college.. Without even a warning, she got slapped in the face with 'you can never go home again'. Brutal. I hope you weren't planning on her visiting often, because you just sent a strong message that you don't want her to and no amount of words is going to send a different message.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Also, kids come back in the summers and often live with their parents after graduating. It doesn’t matter what OP’s daughter’s living situation is right now, they don’t expect she won’t live with them at all for months and months on end at some point (or multiple points) in the future? Who wants to sleep on a couch with zero privacy all summer?\n\nYTA",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1072,
          "content": "When my kids moved out,  I first asked if they were coming back and then asked if I could use their room. If OP didn't do that first,  then of course her daughter is going to feel like she's been kicked out! She's only 18, and OP just removed her safety net. \n\nYTA",
          "id": 25,
          "comments": [
            {
              "score": 692,
              "content": "It's one thing to use someone's room and another to take away the room. If my mom had converted my room into a guest room/office space or whatever, that would have been fine. At least I could have used my bed when I was home.\n\nBut knocking out a wall and telling your daughter to sleep on a couch is a different problem entirely.",
              "id": 26,
              "comments": [
                {
                  "score": 230,
                  "content": "Exactly. When I moved out, my mum used my room as an office and guest room but there was always a bed for me, and I knew that if I needed to move back home, there was a place for me\n\nI'm 27 and I've just had to move back home for a bit. It's been a hard move but I know I will always have a bed here",
                  "id": 27,
                  "comments": [
                    {
                      "score": 127,
                      "content": "Same. I got caught in a loop at around 27 where I couldn't get a good job (bad labor market for jobs with my skillset, and I was \"overqualified\" for all the jobs that were available), so I kept taking shittier and shittier jobs and getting abused more and more by employers. I got really depressed and gave serious consideration to ending my life. If I hadn't met my husband at around that time, I don't know where I would be now. When I asked my mother for help, she would say, \"I just don't know what you expect me to do about it.\" The answer was, let me crash at your place and not pay rent for a few months so I can have the leisure of finding a job that will pay me instead of turning my resume into trash working shit jobs where people abuse me. My golden child sister was living with her rent free at the time while working full time and spending her money on whatever she wanted.\n\nMy kids will always have a place to go. I will never do to them what my mom did to me.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I had to move back with my mom at 28 for like a year. She had moved a few times since I’d moved out but she still made sure to have a guest bedroom for her kids if we ever needed it. I was beyond grateful to have a safe place to go and get back on my feet.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "> But knocking out a wall and telling your daughter to sleep on a couch is a different problem entirely.\n\nFOR REAL. That is a very clear \"I don't know where you live but it SURE AIN'T HERE anymore!\" statement. Poor kid.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Right! OP offered the couch to his daughter, meaning she didn’t have a bed to sleep in at her own parents house! She’s 18!!",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Once my (older) sister and I were out of college, my parents gradually started converting our old rooms to other usable spaces, but they ended up keeping beds in both rooms, just so they could host us/relatives when visiting.  I'm 42 years old, and my mom still calls it \"my room,\" even though she uses it as a sewing room now.    \n\n\nThey didn't have to, but each time they made changes to the rooms, they at least ran the changes by my sister and I (even though we repeatedly told them \"thanks, but it's your space to use as you like\").  I appreciated the gesture, as it kind of said \"even though we bought the house, you \"owned\" this space long enough that we think you should have a say in what happens to it.\"\n\n&#x200B;\n\nOP clearly looks at things differently, and is an AH about it, IMO.",
                  "id": 32,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 603,
          "content": "My dad and stepmom did this to me in college. Literally the day I left, the room was converted to a guest room without warning. Took it as my sign to leave as soon as college was done. Now they wonder why I don’t call often. \n\nYTA.",
          "id": 33,
          "comments": [
            {
              "score": 51,
              "content": "My dad and his wife did the same. He came to visit at Christmas and was like “here is $20 we sold your stuff at a yard sale”…and he is shocked we haven’t spoken in almost 20 years.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 354,
          "content": "It's totally cold. How did OP get renovations done without telling her? I tell my family if I get a new plant or change where I've put a picture, demolishing a whole wall with no mention to daughter is weird.",
          "id": 35,
          "comments": [
            {
              "score": 96,
              "content": "New plants are going in the family group chat.",
              "id": 36,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 274,
          "content": "My kid is a junior in college, and while they are home on spring break, I gave them the heads-up that we will be giving their room to their sibling... after they graduate and find permanent lodging elsewhere.  In the summer of 2024.  We have our two younger kids sharing a large room, while my oldest is at college and uses this room, at best, 3 weeks out of the year.  The older of the two youngest is turning 14, and even though they don't seem to mind too much about sharing with their 11-year-old sibling, I can see that it's time to allow them their own space.\n\nCase in point: Even I know that removing a child's \"safe\" space at home requires a tender touch.  You're not a bad parent for wanting to do a home remodel, YTA for not realizing that your child still considers their old bedroom as a safe space, a place of refuge if things go wrong and they want to come home.  You just erased their existence with no notice. \n\nThe minimum that OP should have done was discuss their plans so their daughter had time to adjust to the idea, while knowing that even without a bedroom, they are always welcome home.",
          "id": 37,
          "comments": [
            {
              "score": 140,
              "content": "Wait you have two kids sharing a room and another room that has sat mostly empty for 3 years? I don't know your situation, so I'm curious-- why? Do the younger siblings prefer to share?",
              "id": 38,
              "comments": [
                {
                  "score": 127,
                  "content": "Right.  To me, that is taking this to the extreme.  I'd be pissed if one room was sitting empty for 85% of the time, and I still had to share.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Seriously can’t believe this. I am so angry on behalf of the two siblings forced to share a room together during what is probably their most wanting of privacy teenage years while there is another bedroom *empty* like *97% of the time.* Unbelievable",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Yeah I made my oldest swap rooms with my youngest when the oldest left for college. If there are gender issues that make it more challenging for the oldest to share with one of the others when home, is still move one of the sharing kids into the mostly empty bedroom in the condition that they temporarily go back to sharing when their older sibling is home for breaks.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 34,
                  "content": "Right????? What the actual fuck, I wish this was the AITA question because the answer would be a resounding YES.\n\nImagine being forced to continue to share a room with one of your siblings while your other sibling doesn’t even live at home anymore, might come home for a few days every couple of months, and yet your parents force you to still share a room with your other sibling instead of letting one of you move into this completely empty room!",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Yeah, wtf. If I was their other kids, I'd be so annoyed.",
                  "id": 43,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 36,
              "content": "Hold on, you have two kids still in the house and they are sharing a room while another bedroom stays *empty* 49 weeks out of the year????\n\nI’m sorry, but that’s ridiculous. The normal order of operations is for the younger kid(s) to move into the bigger rooms that the older kids move out of, especially if two of them are *sharing a single room!* That is nothing like completely demolishing your kids room a few weeks after they go to college; I can’t believe you think that’s comparable?!\n\nLet these two kids have their *own* rooms - when the oldest kid comes home and stays for a few days, they can either stay in their previous old room with the younger sibling that now stays in there, or that younger sibling can go back to their old room with the other younger sibling while the college kids stays in what used to be their room.\n\nThis is crazy, is the older kid the golden child?! My brother moved into my room the day after I went to college because my room was twice the size of the room he had been living in, and not for one second I think that was unfair?? It would’ve been incredibly unfair to keep that massive room empty for like a 97% of the year in case I wanted to sleep there for a couple of days! \n\nUnbelievable, let your younger kids have their own rooms! I can’t believe you’re making them share a room still well one room just stays empty almost all the time.",
              "id": 44,
              "comments": [
                {
                  "score": 20,
                  "content": "Don't worry- they only have to do it for another *year and a half* until the oldest kid graduates- for some reason",
                  "id": 45,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Or gets married according to some posters.",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": ">  We have our two younger kids sharing a large room, while my oldest is at college and uses this room, at best, 3 weeks out of the year. \n\nYTA for not giving your two children who live with you privacy and their own space when you have a room that sits unused over 90% of the year.",
              "id": 47,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Yes. Beautiful.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 129,
          "content": "> Edit: this sub isn't \"do I legally have the right?\" Obviously he has the legal right as the owner. It's AITA. Yes, OP is an asshole.\n\nHonestly man, the fact that so many people think law=morality is one of the scariest things about this sub.  :coughOlsenTwinCountdownTo18cough:",
          "id": 49,
          "comments": [
            {
              "score": 29,
              "content": "Feels like a ton of them don't have good relationships with people so we end up with real \"every man for themselves\" vibes (including OP). Like they have no idea about how to have healthy relationships or empathy or how to talk things through with loved ones.",
              "id": 50,
              "comments": [
                {
                  "score": 13,
                  "content": "Lots of them are also in their teens and 20s. So there's an overwhelming \"I Do What I Want\" sentiment because they're just experiencing independence, without yet realizing they live in a society and in community with others.\n\nAnd this is the same group that would take an argument between a married couple and start saying divorce is the right answer or casually going No Contact with a family member over a dust-up - not really understanding the magnitude of either of those actions.  So yeah, healthy relationships are in short supply, too.\n\nCulturally, we have taught an entire group of people that any kind of disagreement is \"toxic\" and others aren't entitled to basic communication \"You don't OWE anyone anything\" So, yeah. Communication isn't a strong suit either, because it's really kind of being discouraged. \"Cut out 'toxic' people. You don't owe anyone any explanations about anything because it's your life, etc.\"",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I’m a 19 y/o female and Millie Bobby Brown’s birthday is literally a week or so before mine, so watching the internet having her countdown made me physically ill 🙃",
              "id": 52,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 107,
          "content": "This! It usually takes several years for your center of gravity to shift from your childhood home to whatever life you are building for yourself. Even in the best of circumstances, eliminating her “home base” of her childhood bedroom would be emotional. To have it happen as a complete surprise is cruel.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 99,
          "content": "The lack of a heads up or conversation about the demolition is what gets me too. Plus, most colloid kids return home even if they have an apartment—some are for school year only. \n\nYTA. Not necessarily for remodeling, but for doing it behind your daughter’s back and letting her be blindsided by it.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "Yep. All that was needed here was a warning. Without a warning it would seem pretty harsh.",
          "id": 55,
          "comments": [
            {
              "score": 7,
              "content": "Or even a “hey, is there anything from your room you want us to KEEP?”",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Co-Signing the YTA & I’m piggiebacking here because of all the “legally have the right” nonsense.  \n\nI saw this happen with a life-long friend.  Went to college, and by the time she came for the 1st thanksgiving break, her mom had knock the wall out between her walk-in closet and the bedroom to turn her bedroom into a massive dressing/sitting room.  Obviously without talking to her.  And it’s not “permission” thing - it’s taking someone’s personal space and discounting it means anything.   All my friend wanted was a head’s up & give her a chance to pack things.  \n\nAnd on that note, here’s what U/artisticconfidence22 didn’t address - How did you handle all her personal belongings and memories?  Since you didn’t even talk to her, what did you do with everything?  Did you take the time to actually carefully box up her memories?  Or is everything just tossed in boxes randomly?  What did you  with what clothes were left?  Did you take it upon yourself to decide what to keep and what to throw out? \n\nEssentially you said, “Screw you and your belongings - I pay the mortgage.  You might be family, but you don’t live here, so you don’t matter.”  This is the sort of behavior that people mean when they say, “I’ll never do that to my kids - it was horrible to go through.”",
          "id": 57,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 22483,
      "content": ">AITA for not waiting longer with the renovation?\n\nNo. But YTA for poor communication skills because you never seemed to have told her until she visited you and she got blindsided by the room where she grew up in no longer existing and every trace of it ever being there removed.",
      "id": 58,
      "comments": [
        {
          "score": 3140,
          "content": "[deleted]",
          "id": 59,
          "comments": [
            {
              "score": 1493,
              "content": "“Your sibling needs the room” and “we wanted to expand our already-functional living room” are in entirely different zip codes lol.\n\nI agree that communication was the core issue here, but trying to equate OP’s reasoning with needing to move someone else into the space feels a bit off.",
              "id": 60,
              "comments": [
                {
                  "score": 252,
                  "content": "[deleted]",
                  "id": 61,
                  "comments": [
                    {
                      "score": 209,
                      "content": "Yeah, my Mom turned my old room into her Office and I'm totally fine with that. I sleep in the guest bedroom when I visit (my little sisters former room). We're both adult woman who don't need our old kid's rooms. That being said, it was communicated with us and we knew this would happen.",
                      "id": 62,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 32,
                  "content": "[deleted]",
                  "id": 63,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Yeah, that's the part that's really strange to me. Do they not ever talk to their daughter on the phone because I can't reasonably see how this wouldn't come up in conversation!?",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 551,
          "content": "Yeah I’m just surprised how this never came up in conversation, assuming she had been communicating with her daughter about college, moving in with the boyfriend, life updates, etc. it appears OP purposely didn’t bring it up at all and literally waiting until she came home to visit. That’s harsh. I would be upset as well.",
          "id": 65,
          "comments": [
            {
              "score": 101,
              "content": "Agreed. But I also find it surprising when you take into account this should have been a months-long project, not an overnight DIY project. There's fdemo, framing, electrical, lighting, drywall, texturing, painting, flooring, finishing, and that's all after it's planned out. That's... Not a two day project for a bedroom to combine with a living room. How was this so well kept secret? She bounced at 18 to live with her boyfriend and never came back to visit?",
              "id": 66,
              "comments": [
                {
                  "score": 76,
                  "content": "She went to college, my parents told me I wasn’t allowed back for the first month of college. \n\nMaybe the college was out of state, too many factors to blame the daughter for not visiting",
                  "id": 67,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "The common for kids not to visit back home for one if not a couple months. I know at the college I went to it was custom not to visit until it was Thanksgiving !!!!",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "It's a couple of walls. You can easily do something like this in a couple of weekends...",
                  "id": 69,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 465,
          "content": "He is also TA for blasting over her room in her FIRST YEAR of college. Things can change very rapidly at this life stage. Converting it to an office or guest room that could be reverted to a bedroom if needed for at least a couple years would have been far kinder and had less permanent repercussions.",
          "id": 70,
          "comments": [
            {
              "score": 108,
              "content": "As someone who basically had what you suggest happen to them, it also sucks. All your stuff thrown out or boxed away in the garage, room painted neutral colours for guests etc. Doesn’t feel like home anymore, especially when you don’t know it’s happening and approve of it.",
              "id": 71,
              "comments": [
                {
                  "score": 34,
                  "content": "Yes, the communication part is very very important. Unilaterally blasting over your kid's space without so much as a head's up is a big slap in the face and can easily make them feel unwanted, totally get it.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 142,
          "content": "This! OP isn't the AH for the renovation but lack of communication. People miss part where not only did the daughter move out but moved out to live with her boyfriend. That typically means the daughter isn't moving back in, but OP is failing to realize her daughter is 18. There is a chance that daughter may move back in if it does not work out with the boyfriend. In either case the OP should have communicated with the daughter that her room was being torn down before it actually was. So, slightly YTA.",
          "id": 73,
          "comments": [
            {
              "score": 15,
              "content": "100% THIS!\n\nIt's not about the renovation but the way OP went about it all. It was handled very poorly on their part and to be blunt, very coldly.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "I think most college kids would feel \"disowned\" by this honestly. The vast majority of college students still live at their parents home between semesters early on and I get she's living with her bf rn but still she's only 18 and her entire life is changing already. Now her parents essentially told her she doesn't have a place in their home anymore.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "At least give her a chance to come say bye to her room. When I came home for Christmas freshman year, my mom told me she was going to repaint my room and put some furniture there to use it as a craft/sewing room. I didn’t throw a fit or get mad, just said thanks for warning me. So I had the entire break to pack my stuff up into the closets, reminisce, and get some closure on the room that I spent my entire formative years living in.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Also what did they do with her stuff? There's no way she would have removed everything out of the room.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Exactly this. The renovation of your living room space is not the issue here. \n\nHave some damn respect and compassion & COMMUNICATE\n\nYou let the girl just walk in and be shocked - screw you OP - This is one that hit me in the feels - and I'm a callous middle-aged dude that usually tells people to get over it and grow up",
          "id": 78,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Imagine telling your bf about your room at home and going to show them it and it’s just not there lmfao",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I 💯agree. My parents changed my bedroom into an office pretty much the day after I moved out - so they didn’t have to use the living/dining room as an office. I never thought twice about it - but they told me about it before they even did it and didn’t blindside me with it when I came to visit.",
          "id": 80,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 14721,
      "content": "YTA. Is it your house? Sure. But when college kids say they’re going to visit their parents, they say they’re going HOME. And you took a part of that - her safe space that she grew up in - without so much as a heads up. Just because you CAN, doesn’t mean you’re not an AH if you do.",
      "id": 81,
      "comments": [
        {
          "score": 572,
          "content": "Yeah I’m not sure about her plan, but pretty much every college student I knew went home for the summer and for the holidays — is she just supposed to sleep on the couch for weeks on end, with no privacy? This will definitely make her visit less.",
          "id": 82,
          "comments": [
            {
              "score": 93,
              "content": "Even if there's a guest room, it's still the guest room and will make her feel like she's a guest/stranger in her own home. If they'd given her a head's up she could have at least prepped for the shock of room destruction.",
              "id": 83,
              "comments": [
                {
                  "score": 90,
                  "content": "There's no way OP has a guest room with a bed and shit, hell even an inflatable mattress, and think that mentioning just a couch as a solution. I mean, I guess, but I find it hard to believe someone would be *that* callous.",
                  "id": 84,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "I get the feeling it’s a very small house with no guest room, which is why OP said she’s allowed to sleep on the sofa when she visits.",
                  "id": 85,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 104,
          "content": "It's \"my house my rules\" when it's convenient for the parents but \"this is your house, you need to do xyz\" when it's convenient too. This is OP doing the \"my house my rules\" while ignoring the fact that this is also their daughter's house, and has been for years. Maybe their daughter doesn't get to control rent and stuff, but it's still her home too and OP is ignoring that fact for their own convenience without stopping to consider her feelings.",
          "id": 86,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 42,
          "content": "This is so true. Growing up my mom always emphasized that my childhood house was her house, everything was her stuff because she paid for it. I never felt like my childhood house was my home so when it's holidays and what not I always say I'm going to my mom's house instead of home and I never stay long because I never feel welcome.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "100%. Also, most people I know went HOME for the summer in college! At least after freshman year. Usually you're not allowed to stay in the dorms after the spring semester is over unless you're doing some summer classes or something. So what is she supposed to do, sleep on the couch and have no privacy from her parents for 3 months?",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I have long been somewhat confused by others who refer to their parents' house as HOME.  I moved out (this was decades ago) with just my clothing and a bed after my parents demanded rent once I landed my first full-time job (I was still going to college) and haven't spent a night in THEIR house since.  They wasted no time in doing whatever they wanted with the room I stayed in but that was in no way shocking to me.\n\nAfter thinking about this over the years and now that I have kids of my own, on the one hand I feel proud to have been able to make a clean break and not look back.  On the other hand it's clear that many others have a warm feeling about their parents' house and their old room and I can't share that.  There's a lesson here somewhere.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yeah your college kids bedroom is the only permanent private space they have. They probably don't have a private room when they're in college because they probably save money by having a roommate. In addition to that, they may change where they live from one semester to the next.\n\nThe only consistent private space they have throughout the college experience is the bedroom at home. I understand some families are really big and maybe they didn't have a private bedroom before, but that doesn't seem to be the case in this situation.",
          "id": 90,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10886,
      "content": "Why do I feel this is punishment for moving in w the bf at 18?",
      "id": 91,
      "comments": [
        {
          "score": 3974,
          "content": ">Why do I feel this is punishment for moving in w the bf at 18?\n\nHonestly? Same.",
          "id": 92,
          "comments": [
            {
              "score": 1736,
              "content": "Well, it's only gonna drive her further away so great parenting! A+",
              "id": 93,
              "comments": [
                {
                  "score": 602,
                  "content": "OP took away the daughter's expected safety net right out from under her. I would not be surprised in the least if that just destroyed the daughter's trust.\n\nThis isn't something OP can just fix unless he's willing to build a wall back in the house. This is basically a permanent loss of that trust.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 276,
                      "content": "And if I’m coming home to my childhood home I’d want to have a room. I don’t want to be sleeping on the couch because my room got yeeted into nothingness without even so much as a text to inform me. \n\nYour house, your rules. But damn, that room had sentimental value for the daughter ffs.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 120,
                      "content": "This is what stuck out to me. Moving in with bf at 18 is a recipe for disaster, and I would want my child to know she has a place to come home to if something goes wrong.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "re:safety net, if OP's daughter stops feeling comfortable living with her bf for any reason, this will make her more hesitant to leave.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Even if they fixed it back up, it still wouldn't feel the same, at least in my opinion.\n\nIt's like someone stole a piece of cake you were looking forward to, and then made a new cake for you. Like yeah, I still get cake, but it's not the same.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "Right? Better hope her partner/relationship doesn’t become toxic because she’s stuck now. She has no other home to come back to/flee to in case the worst happens.\n\nMy in laws waited till my fiancé was in his mid to late 20’s and hadn’t lived at home for about 7 years, and even then they have him a heads up and they just converted it into a guest room… of which they’ve made him aware he is free to crash in whenever/if ever he needs.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "And studies have been done on this — housing and financial insecurity prolongs unhealthy relationships. Now when she’s looking at the pros and cons of staying with that boyfriend, there is now a huge new ‘pro’ of “I have somewhere to live.”",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I mean, if OP is punishing her for this, she's probably also done other shitty stuff to her daughter. If this drives her daughter further away, that could be a good thing.",
                  "id": 101,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 186,
              "content": "Thank God I'm not the only one getting that vibe.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I feel like *moving in* with bf is just part of it. But for sure there's more to the story.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "First thing I thought as well. Reeks of resentment for some reason.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1359,
          "content": "i think what's very prominent is the fact op says, \"she can sleep *on the couch* as long as she likes.\"\n\nnot a bed, not a guest room, not an area for privacy, *the couch.* op made it very clear that op regards the daughter as a temporary guest, one not even worthy of a proper sleeping arrangement.",
          "id": 105,
          "comments": [
            {
              "score": 173,
              "content": "Generally, I find that guest rooms are a luxury.\n\nIf OP wanted to expand the living room so much and had a room sitting unused for the majority of the time, then they could have done that years ago, and put guests on the couch.\n\nI assume daughter gets the couch now because there are no other beds in the house.",
              "id": 106,
              "comments": [
                {
                  "score": 403,
                  "content": "That’s because they threw her bed away at the first opportunity to “stop” being a parent, since at 18 you’re magically all set for life.",
                  "id": 107,
                  "comments": [
                    {
                      "score": 95,
                      "content": "OP said in a comment that she took her bed when she moved out?",
                      "id": 108,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 103,
                  "content": "that's true, there might be no extra space for a proper bed or sleeping arrangements.\n\nop is still YTA cause they could have at least said something. you dont suddenly tear down a wall, refurbished the floor, and do other very expensive work on your house without saying something, without planning, without talking to many people. im sure the daughter would have noticed something was up\n\nunless op did all of this as a spur of a moment, they made *efforts* to keep this under wraps until the daughter was gone and continued to say nothing until she came back.",
                  "id": 109,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "What are you talking about? The house sounds really small. The couch is now the option for guests. You think everyone just has a guest room ready to go?",
              "id": 110,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Did it ever occur that maybe they didn’t have those options?",
              "id": 111,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "OP stated their house is tiny. What guest room????",
              "id": 112,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 481,
          "content": "It is exactly what it is.\n\nPro-Tip to OP: Treating your 18 year old like they are no longer part of the family and a guest in their childhood house is one of the many reasons young folks in abusive relationships stay with their abusers.",
          "id": 113,
          "comments": [
            {
              "score": 177,
              "content": "Yep, god forbid this 18 year old is in an abusive situation, now she has nowhere to go",
              "id": 114,
              "comments": [
                {
                  "score": 35,
                  "content": "My thoughts exactly, and that she'll end up just staying in the bad relationship because she doesn't feel like there's a place for her to go to. \n\nThis was me at 18 basically. But the \"wall\" was built in between my mother and I, where she made it clear I was not welcome back after \"living in sin\". I stayed in a horribly abusive relationship up until the point he almost killed me, just because I didn't feel like I had anywhere safe to go to.",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 129,
              "content": "I can't even imagine the life I'd have now if the jerk I was dating at 18 became my only option for living. Having my parents to get me out and bring me home saved my future",
              "id": 116,
              "comments": [
                {
                  "score": 13,
                  "content": "Saaame. And it was hard enough to get out with a safe and secure hone where I knew I was welcome.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "This, 18 is pretty young to live with a SO and there's a chance even without abuse it'll end and she'll need somewhere to go.",
              "id": 118,
              "comments": [
                {
                  "score": 7,
                  "content": "She went off to college and sharing dorm room with boyfriend and expected to go home for summer and holidays like most students now they got rid of her things and if she has to visit stay on couch",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "That's an excellent point. OP probably doesn't know much about the daughter's situation and is just fine that way, imo.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 433,
          "content": "That'll show her if she won't do things our way she's not welcome here.\n\nHmm strange she isn't coming back...  Guess we'll have to be even meaner till she does.",
          "id": 121,
          "comments": [
            {
              "score": 98,
              "content": "the beatings will continue until morale improves",
              "id": 122,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 51,
          "content": "because that's exactly what it is and OP is a terrible parent.",
          "id": 123,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "I dont really get that vibe at all from any of the other comments. I think she pointed out that she moved in with her boyfriend to show that it wasn't a temporary or seasonal location like a dorm or academic rental, but a permanent one.",
          "id": 124,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "Because you're projecting and assuming like every redditor with \"shitty\" parents.",
          "id": 125,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "I for one think that OP was glad to get rid of their daughter.. they jumped on the opportunity to make their living room “normal size” as soon as they got the chance.",
          "id": 126,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Yeah I think OP isn't being entirely honest. A major reason why this sub is a problem you only get one side. And even in the rosey picture OP posted she doesn't sound great. Like did you not think for even moment that your daughter might like a place to sleep when they came to visit? \n\n\nI would honestly have the same reaction as the daughter. Every sign of pointing to OP essentially saying \"and stay out!\"",
          "id": 127,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6961,
      "content": "YTA, why wouldn't you at least warn her? If I came home one day and my room was straight up demolished and I wasn't even expecting it I'd be a bit crushed and feel unwanted too",
      "id": 128,
      "comments": [
        {
          "score": 1928,
          "content": "This is so bizarre to me. A renovation like this doesn't happen overnight. How did (s)he never mention it to the daughter? I would imagine that the daughter didn't clear out everything she's ever owned when she moved out. What happened to her stuff? Why wasn't there a conversation about where to store her belongings or what to do with them? Sounds like they probably got tossed out unceremoniously, contributing to the daughter's feeling that she's been discarded. Obviously, OP, YTA.",
          "id": 129,
          "comments": [
            {
              "score": 94,
              "content": "I took all my stuff when I moved out at 21… there were some remnants mixed in with holiday decor and bookshelves left behind that my mom eventually found and got to me, but my bedroom was entirely empty when I left. I wanted my stuff lol. Is that uncommon? Do most people leave stuff behind on purpose?\n\nI still think it’s cold of OP to do this, I’m just surprised at all the comments assuming there was stuff left the room.\n\nEDIT: I did not expect so many responses! Lol thanks all, I’ve enjoyed reading everyone’s different experiences. \nI’m also aware dorms are small and temporary and don’t see that as “moving out”, I would hope OP wouldn’t do this to a daughter who is just in a dorm!",
              "id": 130,
              "comments": [
                {
                  "score": 302,
                  "content": "When I moved out I took all the things I usually use, yeah. But don’t you have any things from your childhood you want to save even if you don’t use them every single day? My parents have a lot more storage space than me, makes sense to leave some things behind.",
                  "id": 131,
                  "comments": [
                    {
                      "score": 30,
                      "content": "One time my mom gave me a box of memorabilia from when I was a baby. I lived in a tiny 1 bedroom with my husband and my parents are still in their big 4 bedroom house with no kids, plenty of storage, and she never goes upstairs. I snuck that sucker back into the house and I'm pretty sure she still doesn't know",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "It kinda made me wonder too, but I was thinking more along the lines of sentimental reasons.  I mean, it was her room for a while.  I'm sure the walls were painted a certain way, maybe a height chart or something that was marked to her growth over the years.  The most important part was it being a place of permanence. You feel grounded and safe knowing there's a place to go should you somehow fail to fly in life.  \n\nAfter 20 years on my own, I'm back in my childhood room.  It started out as a bad divorce, but then my mom started having problems so I stayed to take care of her.  \n\nI don't know what I'd feel like if I came back to my old room being torn down when I was 18.  First off, my younger sister would certainly have a fit since she took that room for herself.  Lol. \n\n I'm just trying to puzzle out what kind of house this is that tearing down a bedroom makes a better living room? That place must be tiny.",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I knew if I left anything behind it wasn’t as safe as it was in my possession. So yeah, I was the weird freshman with a closet full of boxes of photos and stuff from my childhood.",
                      "id": 134,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 150,
                  "content": "Sure, when I left for college I left behind photo albums/yearbooks, toys I still had with sentimental value, awards I'd won in school/sports, books, clothes I wouldn't regularly need, things I collected (like coins), bedding since dorm beds have non-standard proportions, etc., etc. My dorm was tiny and I had to move at the end of each school year. I brought as little as I could with me.\n\n\nIf my parents had wanted to repurpose my room, I'd have understood, but I'd figure there'd have been a conversation. Ultimately my parents down-sized before I was out of college, but they didn't just trash all my stuff in the meantime - they asked me to go through my stuff and keep what mattered, which either went into storage with some of their stuff, or to their new place.",
                  "id": 135,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 77,
                  "content": "When first moving out, its common to leave some things with your parents. When I moved out to my first apt it was a tiny off-campus one bedroom that altogether was about the size my current (still rather small) living room. I barely had room for nessesities, let alone my keepsakes and such. For all we know the daughter was in a similar situation, but we're not told that.\n\nI also wanted my stuff, I just didn't have any choice but to leave some of it with my parents for safekeeping or throw it away until I moved to a larger apt.",
                  "id": 136,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "When I went to college, I had half a small dorm room and a wardrobe sized closet. There was no way I could take with me all my belongings from home.",
                  "id": 137,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "I mean, there’s a huge difference between 100% moving out at 21 and just starting school at 18. A lot of people still semi live at home during school like during breaks and only take certain stuff for their dorm and still have a lot of stuff at home. Based on what op says she hasn’t even been living with the boyfriend for the whole school year, they only moved in together a few months ago and we don’t even know if this is a place they got together or if it’s his, I wouldn’t be surprised if she had a lot of stuff still at home because she’s been expecting to come home for the summer, especially since she thought they were changing her room to a guest room, not entirely removing its existence",
                  "id": 138,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "1) Moving stuff is hard or inefficient. Especially if you’re moving far, it’s much better to thrift shop furniture or go without certain pieces of furniture than it is to lug your furniture from home across the country, or to a different country, or across an ocean. I went years after college where the only pieces of furniture I had were a mattress and a computer desk (both of which I bought locally). I had a friend who crossed an ocean, and went their first year with nothing but a futon and a wooden chair. They used a cardboard box as a computer desk.\n\n2) My parents bought their house ages ago, when it was actually affordable, and in a lower cost-of-living region too. They just have more space. I literally wouldn’t have room to move all of my old furniture to the tiny apartment I’m living in now.\n\n3) We’re talking about starting college age in the post. Generally, college students don’t *completely* move out, and expect to be able to go home for the summers or holidays. Even if they *do* “completely” move out, parents should still treat their children’s situation as temporary, *especially* with something as volatile as moving in with an SO.",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "When I moved out permanently, it was across the country, so there was a lot of stuff I had to leave behind. My mother didn't immediately clear the shelves and rip down the wall to expand the kitchen, though. I never needed to move back, and my stuff eventually got packed up and slowly mailed out to me over the years, but sometimes you really don't have a choice. I took everything I could fit in three suitcases.",
                  "id": 140,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I never got to officially move out because when my mother inherited stuff after my grandmother died, all my remaining things were trapped in the closet because my old room turned into a hoarding situation and the closet became unaccessible, until my mom had to move 20 ish yeats later. \n\nMost of my stuff was at college with me, yes, but there were spme things that got left in the closet with the expectation I'd get it at some point.",
                  "id": 141,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": ">I’m just surprised at all the comments assuming there was stuff left the room.\n\nI'm 40, married, have my own child & still have a few things at my parents house. Besides a few books I never got around to taking with me, I've always kept some clothes there in case I'm over & decide to stay the night instead of going home, my wife has added to that pile of clothes & then there's a bunch of children's toys etc. for my little one who loves to visit them regularly. \n\nThere's never been a time in my life that I've not kept stuff at my mum & dad's house, it's every bit my home as the one I own in my own name. Perhaps moreso, as I spent a larger part of my life at their house than in my current place.",
                  "id": 142,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 82,
              "content": "She didn't mention it because she WANTED to blindside her kid with it, to punish her for moving out and in with her bf.",
              "id": 143,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 55,
              "content": "I’m almost 40 and still have a wardrobe of my stuff at my parents - books from college, dresses I’ll never fit into again that my mom can’t part with, old artwork, a few pairs of shoes. Idk my parents have a creaky old 5 bedroom house and my youngest brother still lives at home.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Yeah, this means one of two things--either they talk regularly, and her parents deliberately didn't mention the very extensive renovation project they were doing, or they've had very little/no contact since daughter moved out. Either way, there's something pretty major missing from this story.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I knew my mom was moving out of my childhood home so I packed up my stuff. But she never told me when it was happening. I expected to get a call saying \"Hey I'm moving out on X day!\" but instead I got a call saying \"Oh btw I moved out last week.\"\n\nI never got to say \"goodbye\" to the house or see it one last time.\n\nShe later did the same exact thing when re-homing our parrot. I knew it was happening, but the day came and passed without her letting me know. So one day I went home and asked \"Where is Sweetie?\" after not seeing her cage. Then she said \"She was taken away two weeks ago.\"\n\nAnyway...long story aside: Some parents just don't clue their kids on anything of importance. I've tried to wrap my head around it and the only explanation I've come to is that they think we'll be sad if we know...so they just wait until after it happens...but they don't realize that makes it even worse. Idk if that's even the case...but yeah.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 239,
          "content": "When my college student moved out, I asked how she’d feel if I’d PAINT her old room but still leave it as a bedroom for her (guest/hobby room the rest of the time) for when she came home. For this exact reason: I didn’t want her to feel unwanted or unwelcome. I can’t imagine tearing it down without telling her.",
          "id": 147,
          "comments": [
            {
              "score": 24,
              "content": "this is the way",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Yeah like I'd want to say goodbye to my childhood room maybe take pictures. Maybe silly but I'm sentimental.",
          "id": 149,
          "comments": [
            {
              "score": 3,
              "content": "Right? And she was expecting it to be turned into a guest room, that would feel so out of left field for me to just walk in and see it gone",
              "id": 150,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I'm 35, have owned my own home for 7 years, and I STILL cried when my dad sold our childhood/family home recently.",
          "id": 151,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "It wouldnt even have to be my room, if my parents did any big renovations without telling me i would be so sad. Not because they need my permission but because damn this big thing is happening to your (MY parents) House and you didnt even feel like sharing it with me? Like are we not close, why wouldnt you tell me you are doing that? Id be so sad they didnt share it with me",
          "id": 152,
          "comments": [
            {
              "score": 3,
              "content": "For real, all these people acting like she's being an asshole for being upset have been driving me crazy",
              "id": 153,
              "comments": [
                {
                  "score": 3,
                  "content": "Same! Like sure op can do it and doesnt need permission but tell her??? If she dropped out of college or moved into a new different apartment and didnt tell op, wouldnt op be upset too???",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Not to mention that I HAD to go home while living in dorms during breaks. This doesn’t sound like her situation but if the BF doesn’t last or her housing or schooling situation changes, being offered to sleep on the couch is a real kick in the pants. Plus, you never have guests? I’d be happier with a smaller living room because it generally just needs a couch, maybe a chair, and a TV these days. You may also have reduced your value on your home. My dad threatened to make my room the “parrot” room for birds he’s always wanted but my mother would murder him for, but in general YTA",
          "id": 155,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4330,
      "content": "Info: what was going on in those few months that you never mentioned major renovation to your kid?",
      "id": 156,
      "comments": [
        {
          "score": 2832,
          "content": "she moved in with her BF and her parents are passive aggressive.",
          "id": 157,
          "comments": [
            {
              "score": 394,
              "content": "Were they passive aggressive? When I went to college my mom turned my room into a guest bedroom, and I didn't care. On the flip side, if one my kids moved in with a bf/gf at 18 I wouldn't flip their room because I would be expecting them back within a year.",
              "id": 158,
              "comments": [
                {
                  "score": 845,
                  "content": "they didn't tell her they were doing it and they didn't convert it to a guest bedroom.  they demolished it and made it so she doesn't have a room in the house.",
                  "id": 159,
                  "comments": [
                    {
                      "score": 258,
                      "content": "But she can sleep in the couch! /s",
                      "id": 160,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 450,
                  "content": "That was my first thought. An 18 yr old moving in with a partner is NOT a permanent thing lol. She will need a place to come back to very soon.",
                  "id": 161,
                  "comments": [
                    {
                      "score": 126,
                      "content": "I think the daughter's reaction says a lot. She may be already see the relationship isn't forever, and if so, now she will stay in it longer than she wants.",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "Exactly. They should have been ready for her to learn her lessons and come home. That's what people do at 18 - make dumb choices. And then she'll be hurt, and need support from her family. But that's clearly out of the question. This is such a shitty message to send to their daughter. So hurtful :(",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Maybe it's just that my parents are not the greatest people, but once I moved out, if I returned, I was a guest in their house.",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 258,
                  "content": "My parents made my bedroom into a game room, but they *told* me they were going to do that.  I didn't just go home to visit and find my bedroom was gone.  \n\nHow is it OP did all this planning and had all this work done and never once thought to mention it in a phone call or an e-mail?  That can only be passive-aggressive.  They wanted to send her a message that she's not part of the family anymore, and they did exactly that.",
                  "id": 165,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 234,
                  "content": "\"This is your room/ the guest room\" is super different than \"You have no room or bed, you can sleep on the couch.\"\n\nOne is acknowledging that your place there is intermittent, the other is telling her that she has no place there.",
                  "id": 166,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Yep. My parents moved while I was in undergrad and they let me know that the room reserved for me would also double as a guest room. They let me help with decorating it, but had me keep the fact that it wasn't *just* for me, just *mainly* for me, in mind. I was a little irked cuz my younger brother, who was going into undergrad that year, got his own room, but it made sense since moving out was going to be brand new for him.\n\nBut you know, my parents actually like and support us enough to like having us around lol.",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 98,
                  "content": "flipping a room is a lot different than completely erasing it and only offering the couch as sleeping spot",
                  "id": 168,
                  "comments": [
                    {
                      "score": 15,
                      "content": "This was my sticking point.  They've ensured that there's no way for her to be comfortable in what was her home for more than (or even) a single night.  This isn't a \"your room is now the guest room\" or \"your sibling has moved into your old room and you'll have to use the guest room\" or even \"it's now the office but you can use the murphy/day bed when you're here\".  Just full on \"no room at the inn\".\n\nIt's also odd to me that OP & spouse would rather not have space to host visitors and also that they'd want to reduce their home's value by removing a second bedroom.  I get that they were doing it from the perspective of what they value, but that in and of itself says a lot, because the only thing the renovation improves is a larger living room for themselves and any guests who might come for a short visit.",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 80,
                  "content": "You could still stay in the guest room right? So that's different from removing the room completely which tells her there's no place for her.",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Demolishing the room is a small piece of the puzzle. The fact that there was no conversation about it is a major piece. It’s like they wanted her to be blindsided so they could make a big point about how she doesn’t live there anymore so why should she care? \n\nThey have every right to renovate their home but how hard is it to say “hey honey, we’re going to convert your old room to make a larger living space. Is there anything you want to keep?” Not mentioning something THAT major has to be intentional. That’s where the passive aggressiveness comes in.",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "A guest bedroom is still a safe place to come back to with privacy if she ever needs to break up with her boyfriend. And at 18 relationships aren't likely to last forever.",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 44,
              "content": "Probably into a shared campus dorm as she's in college...",
              "id": 173,
              "comments": [
                {
                  "score": 24,
                  "content": "exactly.  either her parents are mad about that or they  honestly don't care about her.  either way this entire thing is extremely fucked up.  I would legit not talk to my parents for a long time after that happened.",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Ahhh the ol’ Reddit projection",
              "id": 175,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 410,
          "content": "My parents redid their living room once and I got nearly daily texts from my mom about the curtain choices, rug styles, paint color, etc. It was all they talked about for months! They even repeated the same information so I got to hear about it twice and had to act interested 😂",
          "id": 176,
          "comments": [
            {
              "score": 67,
              "content": "Right? My in-laws are redoing their kitchen and they're sending lots of progress photos all excited about it",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "My dad renovated my childhood bedroom while I was living out of state, and he let me choose the color scheme! (Millennial gray 🩶 lol)",
              "id": 178,
              "comments": [
                {
                  "score": 5,
                  "content": "there is something so soothing about grey walls\n\nreplacing builders beige with warm light grey was one of the best decisions our generation has made 😌",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "My parents got a new shed and I got emails beforehand about it, multiple videos of it being installed as well as FaceTiming as the truck backed it in. I haven’t lived at their house in 11 years.",
              "id": 180,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2003,
      "content": "YTA. I haven't visited my family in almost 2 years, but if I went back and they've demolished my room, I'd be heartbroken. she's right, it does make it feel like you just don't want her to move back in ever. You should have at least asked her about it.",
      "id": 181,
      "comments": [
        {
          "score": 308,
          "content": "My parents would never demolish my room (even though I wouldn’t be angry if they did). They’ve started using it for light storage now but in my folks’ mind it represents that I’ll always keep coming back to visit from time to time and that it’s still a home for me / my siblings.\n\nIt’s funny cause as a result mine and my siblings’ rooms are all half completely as we left them, and then half whatever the rents want to semi use it for now. So none of our stuff is touched, but they’ve put some of their other stuff there. Like one has some of their exercise stuff and then my one of my sister’s has become a bit of a craft room etc. \n\nThey aren’t big rooms or anything, and they could certainly renovate all the rooms so they had more space for themselves, but they just don’t want to. I appreciate that it’s their way of saying they’re always there for us.",
          "id": 182,
          "comments": [
            {
              "score": 25,
              "content": "This is how my old room at my mom’s house is. She’s added things, taken over the closet, and changed the bedding theme, but my keepsakes and random things are still there. And at this point, I wouldn’t even question her finding a new use for it! I haven’t lived there in 6 years and moved across the country a year ago. But it makes my heart happy to know that when I visit, there’s a place for me.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 227,
          "content": "Did all of you grow up with rich parents and your own rooms? When I moved out, my parents took the bedroom I shared with my sister and my siblings finally each got their own. They took some space from my bedroom and made the bathroom bigger so it was finally larger than a closet. When I'm going home to see my family, I'm not thinking about the relic of 2010 that it used to be, I'm thinking of seeing my mom, dad, and siblings, and it makes me happy that they're living in a way that's much more comfortable than when I was in the house as well. It was cramped before, and now it's much more spacious.",
          "id": 184,
          "comments": [
            {
              "score": 270,
              "content": "Sifting people around is different from completely demolishing a room without notice. I assume you slept in that bedroom when you came back from college or maybe even now when you visit, but OP doesn’t really have a bedroom to sleep in anymore. This is on top of a major life transition so it probably just sucks for her.",
              "id": 185,
              "comments": [
                {
                  "score": 67,
                  "content": "Why would she sleep in that bedroom?  It became her parents bedroom.  When she goes home to visit, they will still be there, and sleeping in their bedroom.\n\nI also grew up in a house with far fewer bedrooms than kids, and was one of the first to leave.  As soon as I moved out another sibling took my old room.  When I came back to visit & stayed overnight, I slept in the living room...because my old room wasn't my room anymore.\n\nI'd have thought my parents were nuts if they kept an empty room around just in case I came back to visit at some point.",
                  "id": 186,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Yeah I'm surprised so many people think leaving their bedroom as is for an unspecified number of years just in case they ever need to move back in is a reasonable expectation. We had one tiny bedroom, one large bedroom and 3 kids. I never really had a room again after I went to college because everyone shifted around. I was only around for a few weeks at a time, at most one summer, so I slept wherever there was space because that made the most sense for the people living there full time who had already claimed my space. No one warned me, but like, it's unreasonable for me to expect everyone else to stall their lives for my benefit",
                      "id": 187,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "There’s a massive difference between having to shift about who’s in which room and getting rid of the room entirely.\n\nHer parents communicated to her having a ‘luxurious living room’ mattered more than ensuring she had a place to stay during a time in her life where needing that place to stay is incredibly likely.",
                      "id": 188,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Are your parents never expected to make changes to the home they pay for just to appease your weird emotional inability to detach yourself from a simple room you don’t even use anymore? Like cmon, grow tf up.",
                  "id": 189,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 249,
              "content": "Yeah, most of the people in here are assholes in a state of arrested development and apparently unfamiliar with how a lot of people live. When I went to college, my sister immediately moved in to my room so that my two tween brothers didn't have to share a 10x10 room anymore. People in here like \"I'm married with my own house and I haven't visited my parents for two years but I'd be pissed if they got rid of my room.\" Get the fuck outta here.",
              "id": 190,
              "comments": [
                {
                  "score": 270,
                  "content": "I feel like the practicality of your siblings who live there 100% makes more sense than the living room being cramped. A bedroom being taken over is different from it being demolished. And college students experience housing insecurity at higher rates than other adults so if it can be mitigated, keeping a place for them to stay for that 25% of the year is good. OP should have talked to her daughter",
                  "id": 191,
                  "comments": [
                    {
                      "score": 95,
                      "content": "The parents’ cramped living room is a room that the actual current residents (and owners) of the house use daily, versus a vacant *former* bedroom of a non-resident. Y’all are on some privileged shit if you think adults should live daily in a cramped space to keep some sort of unnecessary and unwanted shrine to their living adult daughter. Yes it sounds like she needed to be talked through the emotional transition more, but OP is NTA for the daughter acting irrational and immature.",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "It’s THEIR house that she doesn’t live in anymore. If they don’t want a cramped living room then by god they don’t have to have one. I agree they should have given her a heads up, but folks saying they should leave the room as is like a shrine or some shit for decades is just bizarre.",
                      "id": 193,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Seriously. We have 7!!!! People in a 4 bedroom house, you better believe that I’d be repurposing rooms etc. if I had any empty bedrooms.\n\nPeople are wild. This isn’t the movies where you parents keep your childhood bedroom intact like a shrine for the rest of your life in the offchance you turn back into a child and need a child’s bedroom.",
                  "id": 194,
                  "comments": [
                    {
                      "score": 4,
                      "content": ">movies \n\nSEVEN??? Just this morning I was thinking about how much work our one kid takes and how it would be a little rough to have another. Best wishes to you.",
                      "id": 195,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Not visiting for two years but expecting everything to be the same is crazy to me. I can't relate to a lot of these comments because my parents straight up moved 4 months after I went to school. I drove back 'home' to an entirely new city and house. I didn't even pack up my childhood bedroom, but you know what? That's perfectly fine. I go home to see my family not to reminisce in a small bedroom.\n\nAnd when I finished school and needed a place to stay while I got a job, my parents let me stay with them. Which is more than I could ask for",
                  "id": 196,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Thank you! So many redditors that clearly have very little responsibilities in their life weighing in on topics above their paygrade. The fuck do you think you have ownership over some thing that you literally do not own and you haven’t seen in years? Come on.",
                  "id": 197,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "100%! Not everyone has space to keep rooms unused/never repurpose them.\n\nMy old room became an office when I moved out, it meant my mum had more space to work. I didn't even bat an eyelid (it's a room ffs)",
                  "id": 198,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I'm an only child and my parents took over my room when I moved out with my boyfriend. Mom keeps her plants in there and my dad takes naps. They painted it immediately and cut my bed into a twin size. \n\nI legit do not care and I don't think they ever 'asked permission' because they didn't need it. We're extremely close. I don't get all this backlash.",
                  "id": 199,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I don't have perfect relationships with my parents, especially my dad, but I think a lot of people's families are \\*so\\* malformed that every little thing can be seen -and actually could be- an attack. As humans we love the status quo and we love our memories, and maybe if you don't see your parents as individuals with needs of their own, it's easy to see them as sentinels of the empty space where your memories formed.",
                      "id": 200,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "But I assume you knew that was happening when you moved out? Because obviously with more kids than bedrooms, one of them isn’t going to remain empty. The issue here is not warning OP and giving her a chance to say bye. My parents warned me before renovating my room, so I had a chance to get my stuff and get closure on my room, which was very important part of my childhood.",
                  "id": 201,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Yes, I knew what was happening with the room swaps. But then also later, when I was just a couple years older than the girl in question, I didn't get \"closure\" by getting to visit my childhood house (trailer) before my parents \\*replaced the entire house\\*. And you know what I did? I spent like 10 minutes processing it and moved on with my life.",
                      "id": 202,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Yeah, I’m reading this and wondering if these people have any clue how very privileged their lives have been.",
                  "id": 203,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Why privileged? It's just a bedroom lmao. Are you homeless?",
                      "id": 204,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "When my sister went to college I moved into the bedroom from the living room nook where I had been sleeping on a loveseat. I was thankful for private space that wasn't full of nasty cigarette smoke.",
                  "id": 205,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "I'm not getting the amount of people who are bent out of shape about this either. She moved out. She's an adult living her own life now, so there's no need for her parents to maintain her room like some kind of shrine. It's not like they told her to fuck off and never come back, they just changed the layout of the house. Seeing as how she doesn't live there any more, and they do, I don't see what's unreasonable about that. She can still visit and stay with her parents, or even move back in if she wants, there just isn't a bedroom that no one lives in taking up space in the house any more.",
                  "id": 206,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Some people are talking about housing insecurity as if the daughter's only option is to live under a bridge or something. She'd still have shelter if she needed to move back in, it would just be less comfortable and also only relevant *if* she needed to move back in, which she very well may not",
                      "id": 207,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 81,
              "content": "'rich parents' they say while talking about major renovations...",
              "id": 208,
              "comments": [
                {
                  "score": 13,
                  "content": "Well maybe they did it themselves? That can save a lot of money",
                  "id": 209,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Exactly. I do all my renovations myself and am a guru of cheap renovations that look great. Because I don’t have a lot of money.",
                      "id": 210,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Yes, fun fact, you can just go to a dump and claim unused building materials. Plus, habitat for humanity store for anything you can't get at the dump. They spent $200 and learned how to frame out a bathroom and move plumbing through youtube videos.",
                  "id": 211,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "It's not an addition, hardly a \"major\" renovation.",
                  "id": 212,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 62,
              "content": "I grew up poor, and I agree with one exception - the parents certainly don’t need her permission to complete the demolition, but I think a heads up would have been considerate here. I do wonder if this was a passive aggressive move in response to her moving in with BF at 18. It’s an incredibly challenging age to begin with and I think a conversation and some reassurance that she will always have a safe home to come back to would have gone a long way here. It’s what my parents would have done.",
              "id": 213,
              "comments": [
                {
                  "score": 6,
                  "content": "Exactly, I think that’s the biggest thing here. A heads up, a talk would be at least fair, when it’s a space you grew up in. It’s not like they shouldn’t renovate their living space at all.",
                  "id": 214,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I think it VERY unrealistic to think the BF situation is permanent.  Hence, remodeling seems inappropriate.  Also, they have forced her into eventually remaining in a relationship she doesn't want because she has nowhere.  If she is still in school, and needs to study, the couch option doesn't work.  Have to wonder if they spent as much time on encouraging her to finish school before moving in with the boyfriend as they did remodeling.",
                  "id": 215,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "People don’t have to be rich for kids to have their own rooms. Sure, if there’s 5 kids, that’s one thing, but most people have fewer kids than that. I certainly didn’t grow up rich, but my sister and I had our own rooms. The only kid(s) I knew growing up who didn’t were my friend’s younger brothers, who were twins and also 5 at the time. I’m pretty sure they got their own rooms later as well.",
              "id": 216,
              "comments": [
                {
                  "score": 4,
                  "content": "Yeah, so you grew up rich in comparison to many people in this country and most people on this planet. You also grew up in an affluent area if you didn’t know people where kids had to share bedrooms.\n\nJust because you didn’t feel rich doesn’t mean you were not rich in comparison to other people.",
                  "id": 217,
                  "comments": [
                    {
                      "score": 5,
                      "content": "No, I grew up in a very poor area, but it was rural. Large homes aren’t expensive here, and many of the homes date from the early to mid 20th century, when not only was housing even cheaper, but families were larger. Not all poverty is the same.",
                      "id": 218,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Don‘t generalize and assume people’s living situation.\n\nSharing a room is not an indicator of wealth, because living situations differ from country to country, even western countries. I know many people who were more than fine but changing living space was not on the table because flats/houses are expensive in the country.  It was easier to not change anything and have 2 kids in the same room. \n\nPeople with literal house had a tiny room for their 2 daughters (and I mean tiny). I have friends who lived in a huge house (in a bad condition) with their own rooms, even though their parents work for minimal wage.\n\nAlso, if you can use this logic infinitely. However, if we are talking western world as Reddit is very USA based, most people are middle class.",
                      "id": 219,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "I grew up in apartments so no childhood home to go back to but my (single) mom was eventually able to buy a home and I was always welcome.",
              "id": 220,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Honestly, though. And my family isn't even poor and we all had our own rooms. My room was demolished in a situation just like OPs daughter, and I'm just impressed the living room looks so nice now. My parents do love to renovate.\n\nI have visited other older people's houses, and I have seen time capsule rooms. Their kids are 30+ with their own children, but their old room is still living in 2007. That was always bizarre to me, even when I was a high schooler myself.\n\nIdk what it is with everyone so outraged. But nonetheless, it sounds like the daughter is heartbroken about the situation.",
              "id": 221,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "You have not visited for 2 years but expect your room to still be there? TF is this selfish shit.",
          "id": 222,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "So you care more about your old room than actually seeing your family?",
          "id": 223,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "It’s such a Reddit thing to expect your parents to just let part of their house sit unused for 2 years.",
          "id": 224,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "But you do realize your parents lives still go on even when you’re not living with them? \nI understand if you have a large house with extra space, sure keep the shrine of your adult kids childhood. Not everyone has that luxury.",
          "id": 225,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "You haven’t visited Home in two years but you would also still be heartbroken if they made changes to your old space? Do you really get to lay claim over spaces that you haven’t set foot in in years, do not pay for?",
          "id": 226,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Idk, my parents did the exact same thing when I was 19 and in college. My room was next to the tiny living room, so they tore it down. They didn't ask. The living room looks much nicer now, I forget my room was ever there when I visit now (I'm 26, so a few years have passed). \n\nI gave them some grief for the sake of giving them grief when It first happened, but nothing serious.\n\nAnd I always wanted to leave my parents' house anyway. I just saw the room demo as a \"no going back\" thing and ran with it. \n\nSo overall, I never took it as them wanting me to leave. My mom has always been a \"if it isn't being used, get it the fuck out\" type of person. And she had been talking about using my room for other shit when I was still in high school.\n\nBut the difference is that there was another room for me to use. Sure, my furniture was given to my brother, and my old stuff has been thrown away, with some still remaining in a closet. And it's just the guest room, though, not my own room. But I really don't care. \n\nI also know my parents would let me move back  in a heartbeat.\n\nSo I really can't relate to OPs daughter. I would say n t a, based on my experience. But this isn't my experience. It sounds like she doesn't even have a room to stay at when she visits, which sucks. And she seems to genuinely care about the room and having a place in your house. She loves you guys. So YTA.",
          "id": 227,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "How many years have you been out of the house? \n\nMy parents finally changed my room into something they can use when I was like 32. Took them long enough!\n\nI also only live 15 minutes away from them so it’s not like there’s an actual reason I’d need to stay there (the last time I stayed over was an exception though, because my grandma had died and it felt better to be together)",
          "id": 228,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "But surely all parents don't want their kids to move back in. If they're desperate they'll help them out for a while, but you grow up, move out and start taking care of yourself.",
          "id": 229,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1686,
      "content": "YTA. That's cold, man. You didn't think she might wanna come back and stay some times? Just leave forever? Would it have killed you to give her a heads up, prioritizing your kid's feelings above your living room?",
      "id": 230,
      "comments": [
        {
          "score": 623,
          "content": "And I love when parents are 'they can sleep on the couch!'  That's literally considered homeless in NYS.",
          "id": 231,
          "comments": [
            {
              "score": 128,
              "content": "Yeah my parents pulled the \"you can sleep on the couch\" but like it's a super uncomfortable couch that is now like 20ish years old.",
              "id": 232,
              "comments": [
                {
                  "score": 33,
                  "content": "[deleted]",
                  "id": 233,
                  "comments": [
                    {
                      "score": 3,
                      "content": "That's shitty. My mum couldn't afford much when she bought after she and dad divorced, but she got a 2br townhouse. After her now-husband moved in, one room became the study. They still have a place for people to crash in a sofa bed. Sure, it's not great, but it's still better than a mattress on the kitchen floor.",
                      "id": 234,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "what is NYS? (genuine question)",
              "id": 235,
              "comments": [
                {
                  "score": 11,
                  "content": "Np, it's New York State.  I specify because New York City (NYC) will sometimes have different law and legal definitions.  Like, in the city, minimum wage is higher than the rest of the state.",
                  "id": 236,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 205,
          "content": "Or maybe consider that an 18 year old might not be with her boyfriend in say... a month.",
          "id": 237,
          "comments": [
            {
              "score": 63,
              "content": "That was my immediate thought. Along with if the relationship turns out to be abusive she may be less likely to reach out to her parents now.",
              "id": 238,
              "comments": [
                {
                  "score": 24,
                  "content": "Yeah that's sorta a worst case scenario. \n\nImagine if she visited home to tell her parents about an abusive relationship and to ask to move back, only to discover the room was obliterated. That would be a shock, might break a person.",
                  "id": 239,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Yeah like. I'm 19, currently studying. When you are a student your situation is chaotic. You never know if you might not have a job for summer, if you'll have an issue and won't be able to pay rent, if you'll fail classes or realize this isn't what you wanna study/do ... There's a lot of maybe that makes your situation unstable. Destroying her room right after she moved out is also awful if she needs to go back for a few months. Like, yay, 0 privacy. She's 18. She barely finished high school. She's not an adult, she still needs a safety net in case she falls.",
              "id": 240,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1624,
      "content": "INFO: Is this the first time she has ever lived away from home?\n\n\nHow far away did she move? (Like can a visit happen without needing an overnight stay)\n\n\nDo you not have a guest room she could use if she visited?\n\n\nEdit: YTA. I'd be devastated if my parents destroyed my room without even saying anything or having a plan for me to come home again. She is 18!! What if this boyfriend doesn't work out?",
      "id": 241,
      "comments": [
        {
          "score": 317,
          "content": "These were my questions too. Are there other bedrooms that she could stay in? Also I get her moving in with her bf but what if they break up? She doesn’t have the safety net of her parents house to go back to. Also what about holidays? What if she wants to stay there on a holiday to wake up with the family?\n\nI don’t think OP’s an ah for renovating the house but I do think it was too soon and it should have been communicated. So YTA for not telling her what the plan was and doing it the moment she was gone. It really does send the message that you were bidding your time till she left.",
          "id": 242,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1075,
      "content": "YTA. 18 is still very young and the chances of things not working out with your daughter's boyfriend are probably pretty high. There is a good chance she will need to leave him and move back home with you. \n\nBy so quickly disappearing her room, especially without any discussion with her, it DOES send the message that you are done with her and don't ever want her to come back. No wonder she is upset. \n\nIt would have been better to wait until she was graduating from college and moving out more permanently.",
      "id": 243,
      "comments": [
        {
          "score": 170,
          "content": "seconded. I've had to move back in with my parents (due to heaps of shitty circumstances outside of my control) three separate times now. YTA, op.",
          "id": 244,
          "comments": [
            {
              "score": 39,
              "content": "Most young adults do. Especially now. Not sure of the actual statistics off hand, but it’s very common to move back home at some point. I lived with my parents for a few years in college and actually lived with my in-laws (plus husband, our baby, and two dogs) for a while right after my husband got out of the military.   \n  \nI haven’t lived with my mom in 15 years and I live 13 hours away now. She sold my childhood home after my dad died and moved into an apartment. She *still* made sure to get a 2 bedroom so there’s always a room for me when I visit.",
              "id": 245,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 81,
          "content": "Exactly this. The parents either have no foresight at all, or they literally do not want the daughter moving back in regardless of her circumstances. YTA OP",
          "id": 246,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "And by demolishing it if she is in a bad situation with the boyfriend she might choose to stay rather than leave him because where else can she go other than sleep in her car? But hey Mom and Dad have a bigger living room now!",
          "id": 247,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "I can't believe I had to scroll so far to find this. An 18-year-old moving in with her boyfriend is out of the house permanently forever? Never gonna break up with him and have to figure out how to make ends meet on one salary in this housing economy?\n\nOP is an AH.",
          "id": 248,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I think this is the best response. Children moving out and parents changing their room (in this case a very permanent change, but a change nonetheless) is a tale as old as time. \n\nBut their child is 18 and the chances that they’ll have to come back home is EXTREMELY high. Them not considering that factor is TA move. YTA!",
          "id": 249,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "This is what I was thinking too. Everyone else in these comments are talking about this as if their daughter was 25 and moved out of state or something.",
          "id": 250,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I agree. OP is YTA what if his daughter and her boyfriend break up and she wants to move back home? I feel so bad for her.",
          "id": 251,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}