{
  "post content": "Final Edit: I’ve apologised to my GF and she’s apologised back - we’re talking about the situation right now and it seems like everything’s okay now.\n\nTL;DR: Reached to my GF for support after my parents split up, she dismissed it and told me that lots of families have to go through something similar - I responded with “f*ck you” and we haven’t spoken since. AITA?\n\nSo today my mother and stepdad split up after being together for 7/8 years. They have a daughter (my (half) sister) which made this harder. My stepdad was basically caught out to have cheated in late 2017 and my family is absolutely ruined.\n\nI told my girlfriend everything that happened and at first she was just sort of brushing everything off, but it was when she said “lots of family have to go through the same thing” that I lost it. I told her “f*ck you” and we haven’t spoken since. I said it out of hurt since I felt as if she was basically telling me to suck it up as lots of people go through the same.\n\nEither way, I do feel bad for saying it &amp; I personally think I could’ve handled the situation better - but my main question really is whether she’s an asshole for what she said or not. AITA?\n\nEdit: Not that it’ll make a difference but me and my GF have a good relationship, we are very close and situations like this don’t usually occur which is why it was such a shock to me when she said it.\n\nAnother Edit: Thanks for so many responses already, I’m going to talk to her when she gets home. I’m going to apologise for what I said.",
  "id": 1,
  "comments": [
    {
      "score": 14,
      "content": "NTA - while not the most mature response, I don't think it makes you an asshole. She should have some sympathy.",
      "id": 2,
      "comments": [
        {
          "score": 1,
          "content": "Thank you",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 13,
      "content": "ESH - Her response is very non sympathetic and not helpful. But you acted like a dick.",
      "id": 4,
      "comments": [
        {
          "score": 1,
          "content": "I agree I should’ve handled it better, thank you for your reply",
          "id": 5,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "ESH. You girlfriend should have been more considerate to your situation but there was no real need to tell her fuck you lol. You could have dealt with that more maturely but divorce can really mess with people mentally so it sucks that your girlfriend cant seem to think that far ahead.",
      "id": 6,
      "comments": [
        {
          "score": 2,
          "content": "I agree I will apologise for what I said, thank you for your reply",
          "id": 7,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "YTA. I can see an application for what she said “lots of families go through this and it will be ok.” There’s nothing wrong with that, per say. I guess it comes down to tone. You should have given her the benefit of the doubt.\n\nYour reaction was extreme. I’m sorry you are going through this, but there’s no excuse for that level of disrespect. If my BF said F You to me we would have a major problem.\n\nEdit: misinterpreted the mode of conversation, thought it was a text, but I still feel the same.",
      "id": 8,
      "comments": [
        {
          "score": 2,
          "content": "Thank you, I agree my reaction was disrespectful and I’ll apologise for it. She didn’t say “it will be ok”, it seemed as if she was implying that I should just deal with it like other families do",
          "id": 9,
          "comments": [
            {
              "score": 1,
              "content": "I would change this to ESH then. I can see that maybe she was trying to make you feel better by implying you’re not alone in this and that other families have dealt with divorce and been fine - and you will, too. But, maybe it wasn’t the most tactful approach.\n\nStill, she’s you GF. You say you have a great relationship otherwise. I’d give her the benefit of the doubt. At least let her explain where she was coming from because I doubt she intended to be hurtful.",
              "id": 10,
              "comments": [
                {
                  "score": 2,
                  "content": "I appreciate your time to reply again, I will apologise to her & discuss the situation",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "INFO - was she rude and dismissive or just dismissive? Was it out of character for her to say that?",
      "id": 12,
      "comments": [
        {
          "score": 3,
          "content": "For example, I was talking about it & she changed the subject suddenly to tv shows without asking if I was okay. This was about an hour after it had happened. And yeah, she’s been with me for 2 years and I’ve never heard anything like this from her.",
          "id": 13,
          "comments": [
            {
              "score": 1,
              "content": "Then I would say NTA. Maybe she just didn’t know how to respond to what happened with your mom and stepdad but she could have at least had some sympathy",
              "id": 14,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA. My parents marriage is falling apart and I dont give a shit but that's JUST ME. This stuff affects people differently and she should have been more sensitive to what you're going through.",
      "id": 15,
      "comments": [
        {
          "score": 1,
          "content": "Thank you i appreciate this",
          "id": 16,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "[deleted]",
      "id": 17,
      "comments": [
        {
          "score": 2,
          "content": "I can’t rly remember but it was in response to me saying something about my family, something like “I can’t believe this happens to my family” then she said (word for word) “it happens to a lot of other families, you know?”",
          "id": 18,
          "comments": [
            {
              "score": 2,
              "content": "That’s not even dismissive. It’s just her letting you know it’ll be fine. Man, I didn’t know before but with this bit of context, FIRMLY YTA.",
              "id": 19,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "Esh, she should have been more supportive and I can see why you'd say that to her, but it's still asshole-ish. \n\nI'm sorry for what you're going through.",
      "id": 20,
      "comments": [
        {
          "score": 1,
          "content": "Thx, was kinda expecting a response like this & I appreciate the kind words",
          "id": 21,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "ESH. I'd say her more than you. It's a nasty thing to say, but then your girlfriend appears to be pretty uncaring about the fact that you're upset over your family stuff. That's cold.",
      "id": 22,
      "comments": [
        {
          "score": 1,
          "content": "Thank you, I will apologise for what I said but I am still hurt by how she treated the situation, it was so weird as well - she’s always been so caring",
          "id": 23,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA. She should of been more supportive. You needed her to lean on and she shut you down. She needs to put herself in your shoes. She should have been there for you better.",
      "id": 24,
      "comments": [
        {
          "score": 1,
          "content": "I do feel as if I was too harsh but I was hoping she’d be more supportive yeah, thanks for your reply",
          "id": 25,
          "comments": [
            {
              "score": 1,
              "content": "You're welcome. You weren't to harsh she should have been more supportive.",
              "id": 26,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}