{
  "post content": "Background: My husband (let’s call him Will) is in the Navy, and he works on nuclear reactors on submarines. We’ve been together for 4 years, married for 2.\n\nWe were at a small house party with a few friends of mine from college and we were discussing books we’ve all read, when at one point one of my friends (let’s call him Steve) asks Will, “So Will, what’s your favorite book?” and my husband responds, “Oh, I really like To Kill A Mockingbird.” Then Steve gives him a quizzical look and asks him, “Have you read any books outside of high school?” and Will hesitates a bit and says, “Outside of manuals at work, I guess I haven’t.” So then I try to explain to Steve, “Oh yeah, he’s not well educated, so he’s never had a reason to be well read.” We all had a good laugh, but then Will didn’t really contribute a whole lot to the conversation the rest of the night. \n\nOn the car ride back, Will was pretty quiet. I ask if he’s fine and all he says in a sarcastic tone is, “Peachy.” I ask him if I did anything to upset him and he responds back with, “I don’t know. I don’t think I’m educated enough to properly explain myself.” I tell him I didn’t tell my friends that he was unintelligent, just that he wasn’t college educated. He accused me of minimizing how hard his Navy schooling was, but I explained that military education and college education are simply not the same. We continued to fight until we got home. I texted my sister about what happened and she called me a huge asshole and that I need to apologize and now I’m having second thoughts about how I handled this. AITA Reddit?",
  "id": 1,
  "comments": [
    {
      "score": 25699,
      "content": "YTA let's put aside your husband's incredibly difficult job for a moment, on what planet does anything think calling their partner \"uneducated\" is ok? That is never ok. EVER!!!\n\nLet's circle back to the job... do understand what it takes to get onto a nuke sub??? These folks go through extensive testing to be even considered. Then they go through even more extensive training and education. These people are super smart. Their job is insanely stressful. \n\nI know two guys who were on nuclear subs. Two of the smartest people I know.  \n\nNot reading fiction doesn't equal being \"uneducated.\" Not everyone likes fiction. Also, maybe he read that book in high school and it really stuck with him. There is a book I read in high school which, many decades later, remains one of my absolute favorite books....I read a LOT of books. \n\nIt was so incredibly rude of your friend to make fun of your husband about his book choice. You and your friends sound like insufferable snobs",
      "id": 2,
      "comments": [
        {
          "score": 6404,
          "content": "OP should have made Steve the butt of the joke for making that stupid comment to begin with.",
          "id": 3,
          "comments": [
            {
              "score": 5104,
              "content": "So, Steve, what do you do for a living...  oh, ok, tell me about radiation, aside from the sun burn you got from the beach, STEVE.",
              "id": 4,
              "comments": [
                {
                  "score": 2653,
                  "content": "Can't upvote this enough.  Steve's a raging pretentious dick and may or may not have feelings for OP.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 4049,
                      "content": "Steve's a pretentious dick but OP is worse. Instead of supporting their partner OP said a man who works on a fucking nuclear submarine is uneducated \n\nI'm a college educated engineer who is a safety manager on NYC high rise construction sites who happens to be a voracious reader and I'm amazed by the people who are willing to work with nuclear power on a fucking submarine. I mean, underwater with no place to escape on a nuclear vessel? No Thank You \n\nOP-no one gives a fuck that a person's favorite book is the latest Ken Follett or Stephen King book on the best seller list. You should be proud that your husband is smart, honorable, brave and comes home to you every day.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 47,
                      "content": "[removed]",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "steve reminds me of the dude rachel mcadams is friends w/ in Midnight in Paris. owen wilson calls him a pseudo-intellectual and it’s spot on there and this post lol.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "The worst part is that she sided with an insecure college dweeb guy that was trying to belittle her badass husband.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 452,
                  "content": "🤦🤦🤦nuclear reactor, submarine is not remotely near uneducated.🤦🤦🤦People with college degrees would kill to work on a N-Sub",
                  "id": 10,
                  "comments": [
                    {
                      "score": 128,
                      "content": "My husband was a recruiter for the Army. There were sooo…many people that had college degrees and even advanced degrees who couldn’t pass the ASVAB to even qualify for the most basic military job.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Yeah, not to mention that she completely glossed over all the manuals that he DOES read. Realistically, he may not like reading for fun, but to do the work he does, he's probably read A LOT and it's all reading that I'm sure would go right over the heads of her and all her friends. Next time they go to a social function with those friends, her husband should bring one of his manuals, hand it to Steve and tell him \"Here, since you're so well read you should have no problem making sense of this, right?\" and watch Steve's head go pop.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Reminds me of a doctor I worked for:  he was driving cross country to open his new practice and got a flat tire on the highway.  While awaiting AAA, a cop pulled up behind him and after seeing what was up chuckled and said ‘you don’t know how to change your own tire????’, doc replied after a pause ‘nope… but if you need your appendix out, I’m your man.’\n\nCop took the comment graciously, and changed the tire while doc cancelled the AAA call out.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 679,
              "content": "This is the Way. What does reading books have to do with being smart and educated.\n\nAsk Steve does he know what to do when something goes wrong with a nuclear reactor.\n\nShe's a prude and she is going to learn quickly that she royally screwed up. She has messed with how he thinks she thinks of him. Things won't be the same moving forward.",
              "id": 14,
              "comments": [
                {
                  "score": 875,
                  "content": "This can't be over stressed.  She needs to start working very hard to correct this very quickly.  This isn't a \"I'm mad at you\" moment that will be fixed in a few days.  She could have radically changed the way he feels viewed and consequently how he views the relationship.  Stuff like this has been the catalyst to end more relationships than you can imagine.  \n\nIt is way worse than making him the butt of some joke.  In his eyes, you don't respect him.  This isn't just a YTA, moment.  This could be the moment you killed the relationship.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 323,
                      "content": "Right, I would seriously be contemplating divorce if I found out this was what my spouse really thought about me.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 187,
                      "content": ">Stuff like this has been the catalyst to end more relationships than you can imagine. \n\nThis.1000%. \n\nI have a second cousin who works as a marriage counselor and she says contempt and resentment stemming from disrespect is very hard to bounce back from. In 90% of cases she's seen it has ultimately led to divorce, often a nasty one.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 181,
                      "content": "I wish we still had awards so I could highlight this for OP. She’s a snob to her own husband. There are plenty of people who respect the hell out of people who work on a nuclear submarine. Only certain highly qualified people get those jobs.\n\nPersonally, I think she may had made a marriage ending mistake.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 110,
                      "content": "Wish I could like this a thousand times. Yes, it’s about respect.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 83,
                      "content": "Absolutely!! I mean WOW! I think if my husband/partner said that about me.. my heart would explode.. I don’t know if I could ever forgive or forget such an insulting thing.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "You said this so well. \n\nI can't see how he could ever look at her the same way again.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Yeah if I were him, this would have given me the immediate ick. Would rather get a quick divorce than be with someone who obviously doesn't respect me.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 389,
                  "content": "I guarantee you those manuals Will is reading for work are way tougher, denser, and more informative than the romance books I've been reading about witches this month!",
                  "id": 23,
                  "comments": [
                    {
                      "score": 153,
                      "content": "For real! I devour books, but like... I'm reading about a house on chicken legs and the people who live in it. At least what he's reading has real world applications lol.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "What are the titles to these romance witches?? I just got off a kick of werewolf “romance” novels lol",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "The thing is, one of the best things we can learn from reading fiction is how to understand and empathize with other people (which, ideally, is something people could learn from this sub--I know, call me crazy). She and her friends have no capacity for that. All they learned in college was how to name drop book titles.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Can confirm as prior navy, those manuals are completely dry and a slog to read through",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 351,
                  "content": "Right? I have a PhD in chemistry and I rarely read books for fun. I read enough journal articles, app notes, emails...I just don't like to read anymore. Maybe one book a year at best. I'd rather use my limited free time on other things. Or maybe I'm just uneducated in disguise according to OP?",
                  "id": 28,
                  "comments": [
                    {
                      "score": 166,
                      "content": "She's not counting all the technical reading that's getting done for you and her husband.  You both read an incredible amount. It's just not English class literature.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I'm getting a PhD in physics and if I'm taking time to do something outside of research it's usually going to be some kind of physical activity in a desperate attempt to undo the pain of sitting at a computer for hours on end, so nope, I don't read. Guess I'm uneducated 🤷🏻",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "SAME.  I said in my comment, but in the 13 months since I finished my PhD I have read 3 books for fun.  All of them audiobooks.  I have, however, read a shit ton of articles, scholarly books, and am writing my own papers now.\n\nBut, well... the limited number of novels means I'm clearer dumber than rocks.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 162,
                  "content": "“She has messed with how he thinks she thinks of him” Exactly. You and Steve are the AH, OP",
                  "id": 32,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 141,
                  "content": "Right? How, as a spouse or significant other, can a person move past not just being considered \"uneducated\" but because of that considered \"less than\" your SO and their friends?\n\nThe only appropriate response to Steve should have been, \"yeah he hasn't had tons of time for reading while he's staying up to date on keeping a whole ass nuclear reactor in working order while hundreds of feet under the ocean\"",
                  "id": 33,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Or “Steve, why are you asking dumb questions?” before Will even had to answer.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Or \"The stuff my husband reads and does makes a huge difference to technology and science and the world. More than any book we studied in high school.\"\n\nI get triggered whenever anyone asks my husband how he feels to have a wife much smarter than him, just because I have a doctorate and he has a Master's. I just point out that (1) A higher degree does not absolutely make you smarter all around and (2) In my field a doctorate is necessary to get a good job (Academia) but not in his field (Software Engineering). \nInterestingly I've had several female friends of his who I swear were asking leading questions trying to goad me into saying what OP did about my husband. They proceeded to spread rumours that I called my husband 'retarded' even though everyone who knows me knows I hate that word with a passion and refuse to ever use it ever, let alone on my husband.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": ">while hundreds of miles under the ocean\"\n\nWhile hundreds of feet.....\n\nFTFY",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 136,
                  "content": "OP is one of those who think they are \"special\" and smarter than most people since she went to college. What she doesn't want to recognize is that there are different types of intelligence. \n\nIMO...her husband was a lot \"smarter\" (not to mention very brave) to enter the military and have his education paid for while defending his country.\n\nNow that he knows how OP feels, and knows that she is super embarrassed by him in front of her friends I can't see this relationship ever being the same.    OP, YTA!",
                  "id": 37,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Sadly there are way way too many of these types out there riding their high horses",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "My husband was a nuclear reactor operator on a submarine, he was smart enough to CLEP test out of most required college courses and got his degree while in the Navy.  Navy Nukes are smart AF, they have to be to get into the program and pass, it has something like a 90% failure rate.  30 years ago the estimated cost of training that went into a Nuke was 1 million per sailor.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 94,
                  "content": "I used to read voraciously as a kid but now I don’t read as much. I didn’t lose the smarts I already had just because I read less. We’re always learning in life and the way people learn might look different for each person and that’s okay. OP is rude and probably mad because her husband is smarter than her.",
                  "id": 40,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 71,
                  "content": "This is so true.\n\nI'm a bookworm, have over 300 books at home that I've read and I wouldn't call myself smart or \"well-read\" just because I've read them all. I can pretty much guarantee that her husband is smarter than me.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Exactly. I've read over 100 books this year so far... but at least half of them are monster fucking romance novels. I'd rather never read again than subject myself to Charles Dickens again or whatever fucking classics are \"necessary\" ever again. Meanwhile, my husband (who incidentally didn't finish college) is out in the garage teaching himself biochemistry and developing plant health promoters that grew us over 500 pounds of watermelon this year.  \n\n\nWe're both smart, and we're both educated. Just in different ways and about different things.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I was an avid reader and read a book a day, but never consider myself \"well-read\". The more you read, the more you see that you could never be enough well-read.\nOnly pretentious people, who probably read at most a book every couple of months would be such stuck ups.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I don’t think my brother has ever read a work of fiction that wasn’t assigned by a teacher; he just doesn’t care for reading. He’s also a brilliant mechanical engineer who made ridiculous money on government contracts barely out of college. Meanwhile, my bookworm self didn’t even finish college.",
                  "id": 44,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "At some point we as a society decided that reading equals smart. And that is NOT true. How many adults with degrees and all do not read. How many of them are dumb? A lot is the answer. The OP seems like one of those snobbish people, bc she went to college and judge those who didn't.",
                  "id": 45,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 281,
              "content": "I honestly thought that this is where op was going. \"Oh, he is so uneducated. He only works on nuclear reactors. No brains here/s\"\nAnd pointing out that reading a lot of books doesn't actually mean that you are a smart person.\n\nInstead op had to completely demean anything her husband ever accomplished. Just because he didn't go to college",
              "id": 46,
              "comments": [
                {
                  "score": 114,
                  "content": "I mean, just kick him in the nuts next time. Damn.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 11,
                      "content": "And yes, YTA.",
                      "id": 48,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Honestly, while a kick in the nuts would be more immediately painful, what OP has done is going to hurt for a lot longer, and cause more lasting damage to husband.  \n\nHow would your self esteem, and confidence recover from a hit like that.  You'd almost certainly have a lingering doubt that would come back and get at you, even when you thought you'd gotten over it.\n\nP.S. (As a ND, I accept I might have misunderstood the point of your comment, btw!)",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "I would be shocked to learn OP and Steve are not screwing around while hubby is deployed.",
                  "id": 50,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "I work in a construction adjacent job and interact with many people who didn’t go to college.  A lot of these people are business owners who are brilliant but went straight into the work force after high school.   It’s not as simple as college = smart, no college = dumb.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 143,
              "content": "Indeed.  Steve was already trying to make OP's husband feel inferior, which is incredibly rude and uncalled for.",
              "id": 52,
              "comments": [
                {
                  "score": 126,
                  "content": "And OP allowed it. To be stabbed in the back by your own partner, ouch.\nCheating is Not the only betrayal. \nThe Respect and Trust in this relationship just got torpedoed.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I thought the SAME thing. That man has lost all respect and trust in his wife. For Pete's sake, even if she DID think he was uneducated, WHY would you publicly humiliate your partner like that? And then laugh about it! Just terrible.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I'm starting to wonder how long she's been seeing Steve on the side.",
                  "id": 55,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 132,
              "content": "Right? What the hell is wrong with him. Asshole",
              "id": 56,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 97,
              "content": "Absolutely. I'm a voracious reader but if I try to have a conversation about books and someone says they're not really a reader, I just ask them what they're into. Everyone has interests. Find out what they are, ffs.",
              "id": 57,
              "comments": [
                {
                  "score": 7,
                  "content": "I too am a big reader of books however if I had someone at my dinner table who worked on a sub… especially a nuclear sub… I would definitely be more interested in asking him questions about that.  Feels like the snobs were more interested in themselves.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "She would’ve had to disagree with Steve to do that though.",
              "id": 59,
              "comments": [
                {
                  "score": 132,
                  "content": "This 👆🏾. FFS! I guess being college educated means you don’t have to have any sort of emotional intelligence or awareness in this case. WTF op? Huge YTA!",
                  "id": 60,
                  "comments": [
                    {
                      "score": 9,
                      "content": ">I guess being college educated means you don’t have to have any sort of emotional intelligence or awareness in this case.\n\nI work with Uni students and professors 5 days a week, 9 hours a day and nothing could be closer to the truth! Some of the smartest professors I've ever had the pleasure of meeting are just as dumb and subtle as a bag of hammers outside of their very specialized field.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "It’s crazy that she’s isn’t sure if she’s the AH here. So let me understand- you and another man are getting a groups of your friends to laugh at your husbands life work. Wtf? Lady If he put pictures up of women who were more fit and better looking than you and then laughed at you with his friends (and a beautiful, fit female friend) as needing to work harder at the gym it would probably be close to how you made him feel.",
                  "id": 62,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Yep....🤔. OP open the door to lack of trust with her disrespect. Planted a seed by Back burner Steve....",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "No. OP Lshould divorce her husband. She obviously thinks she's too good for him, to the point of proudly telling her sister what happened and then trying to humiliate him here on Reddit. You are a major f******* asshole.",
              "id": 64,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Abso-fucking-lutely. I am a lifelong high school English teacher with a master's degree in English. I love reading and have read tons of books for my job and for pleasure. Steve and OP are AHs. \n\nOn the other hand, my brother, whose formal education ended with a high school diploma, works as an industrial engineer for a Fortune 50 company and repairs very specialized equipment worth millions of dollars. His company regularly sends him all over the world. He makes more money in a month than I ever made in a year. \n\nHis favorite book is \"Flowers for Algernon,\"  which he read in eighth grade. That's probably the last time he had time to read for pleasure. We are BOTH smart, just in very different ways.\n\nOP, you are a snob and an elitist. You don't deserve your husband.",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1154,
          "content": "Also what the fuck is wrong with someone’s favorite book being To Kill A Mockingbird?? It’s a good book. What a dick to be like “have you read any books outside high school?” OP and friends massively YTA. Snobby dicks with zero class looking down their noses at everyone else.",
          "id": 66,
          "comments": [
            {
              "score": 454,
              "content": "TKAM is a literary *classic* and a lot of people's favorite book, no matter how many they've read! It's such a weird leap from \"loves TKAM\" to \"doesn't read much\", it makes me wonder if OP has made some comments in the past to these friends about her husband's \"lack of education\" 🙄",
              "id": 67,
              "comments": [
                {
                  "score": 128,
                  "content": "Right? I’m what many people call over-educated and I’ve read probably thousands of books - that is still one of my top 5.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 141,
                      "content": "Same. I read **a lot** of books. I used to get in trouble for reading so much in school, I have a library with over 1500 books, all of which I've read, and I read at least 100 books a year on my Kindle. TKAM is definitely in my top five, as is Fahrenheit 451, both standard \"high school curriculum\" books.\n\nMaybe they're considered literary classics because they're just *that fucking good*.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I actually reread TKAMB in a college literature class. I know like every HS kid reads it, but they're by no means the only people who have read it ffs.\n\nEven so, one of my favorite books of all time, which I've reread *several* times as an adult, is A Wrinkle in Time (and its sequels). I don't care how educated I am - that will never not be one of my favorites.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "My undergrad degree is in Classics.  It’s like the snobbiest, most literary, book-laden major possible.  It’s like being a foreign language major, but in a language no one speaks, so you can’t hear it, and like being and English major, where you are writing tons and tons of composition, but on works that were written thousands of years ago, sometimes with large portions missing.  And my favorite book isn’t a “Brief History of Time” nor is it “Infinite Jest” (Although I suggest a person read both if they have the time and try to forget what their authors were going through when they wrote them. Sometimes it makes the work more beautiful and awe-inspiring, and sometimes it makes them very sad.) And although I love the Aeneid, my favorite work in my second language is the poetry of Catullus, sprinkled with a bit of St Augustine so we can see the transition  libertine become the hermit/Saint all because of the love for and of his Mom. (That’s a drastic oversimplification.) But my favorite book was one I read in *kindergarten* with the help of my own very patient “Marmee,” “Little Women” by Louisa May Alcott.  That doesn’t mean I lack intellectual curiosity or am uneducated.  It just means I love that book.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 212,
              "content": "I studied literature in grad school and I wouldn't even *dream* of asking someone that if they said it was their favorite book. How snobbish do you have to be for your mind to go there? It's such a classic, why *wouldn't* someone love that book?\n\nOP and her friends are pretty gross.\n\nI say this as a fucking snob; one of my favorite books is Moby Dick. But I firmly support everyone reading what they want, enjoying what they enjoy, and not everyone likes fiction anyway.",
              "id": 72,
              "comments": [
                {
                  "score": 140,
                  "content": "Right? I have an English degree & I'd just be like \"Cool, I love that book, too\" & then I'd be blown away by all his knowledge about NUCLEAR REACTOR STUFF",
                  "id": 73,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Yes! Honestly, I wouldn't even get to asking him about books, I'd be too busy going *tell me more about your fascinating job*.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 754,
          "content": "Or, because he’s reading so much for work, he doesn’t have a lot of time for recreational reading.  I find that myself.  I read all day in between cases and patients, but it’s all for research or continuing education for work.  Her comment was demeaning and out of bounds. YTA op.",
          "id": 75,
          "comments": [
            {
              "score": 442,
              "content": "My favorite part is that the convo was probably light hearted and he shrugged off the No novels since HS as a funny thing when you say it out loud, then OP says “I tried to explain to Steve” like someone needs to explain why they don’t read novels after high school. My god what a crappy group of people.",
              "id": 76,
              "comments": [
                {
                  "score": 115,
                  "content": "Seriously, so much this. I actually love to read and have read a ton since high school. My favorite book has remained a book that I read in 4th grade. Also I love Harry Potter. I think most people I know, their favorite books are ones they read as teens when everything is angsty and books can hold so much power over who we become.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 145,
                      "content": "My favorite book ever? *Frog and Toad Are Friends.* Have I read other books? Yes.  Many. But that's still my favorite, and I was an English major. And both that and *To Kill a Mockingbird* are probably, hands down, better than any \"educated\" garbage that Steve-hole considers his favorite.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Super fucking elitist.  The worst kind of people, imo.  They won't be nasty about you doing a blue collar job *to your face*, but will be judgy and make snide comments about it away from you.",
                  "id": 79,
                  "comments": [
                    {
                      "score": 7,
                      "content": "What a great comeback in the car on the way home though heh? “Not educated enough to explain” 😂😂😂 nailed it",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 189,
              "content": "You know, my sister is a physician and one of the US’s busiest and most trauma-filled ERs Between her time reading about things like the newest techniques to save victims of gunshot wounds to the head and saving victims of the actual head traumas, she doesn’t have time to do a whole lot of recreational reading either.  Guess OP thinks she’s a total dumbass.  But I hope they never run across each other, because my sister tends to be a little feisty and a little sensitive when people insult her intelligence.",
              "id": 81,
              "comments": [
                {
                  "score": 20,
                  "content": "First, thank your sister for me.. it takes A LOT to get where she is in a MALE dominant profession.. and thankfully she does NOT read for pleasure, if she missed ONE book or article or whatever, that could save ONE person...  Thank your sister for her commitment (I know, there is a financial reward too) which while playing off school stuff etc etc.. her job is stressful..  she is in a field that is shrinking every day.  Love to her.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 131,
              "content": "OR he reads soooo much at work, that he has NO care to read out side of work...  (I agree 10000% percent)...  she just might as well said he has a small dick too.. jesus.",
              "id": 83,
              "comments": [
                {
                  "score": 44,
                  "content": "Plus I'm guessing the \"library\" on a sub is pretty limited. Sure, he could download books to kindle or some other app, but that takes pre-planning and would take away from his time out of a sub. I'm guessing if I've spent weeks in a sub, I would just want to be outside in fresh air as much as possible, not spending hours trying to find my next read. And, even if he doesn't like to read - who cares - he's a successful human being who is contributing greatly to our country's safety. Give me a man who can protect me over a man who can quote a popular author any day,",
                  "id": 84,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I know a lot of Navy people..  older vets, younger vets and newly out vets.  There are times the LAST thing they want to do is read.  You are 10000% correct.. Outside and fresh air.  From flat tops or subs or everything in between.  There are older and younger vets who don't travel.. they've seen it all and would rather stay home.  I also know a vet with over 700 books at home and hasn't cracked one in 10 years.",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "Same here. I’m a lawyer and all I do all day is read and write. Sometimes I just don’t feel like reading more after that.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "During law school the only non-assigned books I could stomach was like YA fiction.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 313,
          "content": "I read the OP.\n\nThen I thought about what I'd say because I have Autism.\n\nAnd I still wouldn't say what OP did.\n\nProbably more along the lines of \"my spouse does not have time to read fiction novels when he's constantly busy getting his education in Nuclear functions.\"\n\nI have dyslexia and don't read as many novels as I used to because it requires a lot of brain power that I need to put elsewhere.  I occasionally will read a novel but read in 1-2 sittings as I get engrossed in them (on top of needing a bookmark to stay on correct line ..or I keep rereading it - the dyslexia...which can slow me down).  And even then?  I prefer classical literature.  I read modern authors less often then classical authors.  Doesn't mean I dislike or hate modern... it's just preference.\n\nI do read smaller things like articles and fanfiction.\n\nAnd manuals...and text in video games that have extensive lore.\n\nThis isn't even getting that if this person is from US like me? Most people don't have above a 6th grade reading level.  I'm not sure if stat is the same in other countries.\n\nBasically means most people can't read in depth into a science paper, but can read simplified versions of it.\n\nEx.  A research paper talking about the intricacies of nuclear fusion with jargon will need to be brought down to \"we hit two nucleus together to make energy\".\n\nThis isn't a bad thing - but I'm pretty positive Ops spouse, being educated in nuclear functions, might actually have a higher reading level then Op considering all the jargon used in science.\n\n\nOP YTA.",
          "id": 88,
          "comments": [
            {
              "score": 10,
              "content": "Well said.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 263,
          "content": "That's not good enough though. A nuclear sub? Oh how beneath them. 🙄",
          "id": 90,
          "comments": [
            {
              "score": 184,
              "content": "It's too deep for them.\n\nI can't understand why they think OP's husband is so shallow.\n\nI imagine the pressure husband is under must be crushing.\n\nI guess husband was running silent the rest of the night.\n\n&#x200B;\n\nI'm here all week folks, try the veal!",
              "id": 91,
              "comments": [
                {
                  "score": 19,
                  "content": "Not bad, but I improved it with my superior  comedic skills. ' I'm here all week, try the spicy sub, the sauce on that is nuclear!'",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 211,
          "content": "[deleted]",
          "id": 93,
          "comments": [
            {
              "score": 115,
              "content": "I would wager they are pretentious arts \"degrees\".  The amount of education and training required to be on a nuc sub is extensive.  \n  \nTo earn the right to wear \"fish\" or \"dolphins\" (badges/pins), prospective submariners complete an extensive qualification process that lasts one to two years (for both enlisted and officers, though the two programs differ significantly) and covers ALL of the submarine's systems.\n  \nIf you are a Nuclear Engineer aboard a sub, that is a much longer and much more difficult career path.  You must earn a bachelor's degree in nuclear science or related field on top of completing one year of calculus and one year of calculus-based physics.\n  \nThe husband is probably VERY well read, in his field.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "OP hasn't replied to a single comment. Makes me wonder why?",
              "id": 95,
              "comments": [
                {
                  "score": 17,
                  "content": "Cause she's an AH? I expect OP will end up deleting this post. This is one of the few times where everyone unanimously agrees, YTA.\n\nDoing this to anyone, especially a spouse, huge AH belittling people.",
                  "id": 96,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 67,
          "content": "According to my Kindle I read just over 750 books last year. (I’m hyperlexic.) \n\nThe Grapes of Wrath, Frankenstein, The Scarlet Letter, Withering Heights, etc that I read in high school are still some of my favorite books ever. I reread them all the time. \n\nI’ve still never read To Kill A Mockingbird, tho.",
          "id": 97,
          "comments": [
            {
              "score": 14,
              "content": "It is one of my favorite books and like you I read a lot; some classics. Mostly trashy grandma books.",
              "id": 98,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Wait, you read 2 books a day last year? Are you a librarian  in an abandoned library?",
              "id": 99,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "This exactly. I read a lot, or did before the pandemic. My favorite book remains, \"I know why the caged bird sings\" by Maya Angelou. I've since read all her works, but I was originally introduced to her through my high school English teacher.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Ya def YTA along w your friend who asks about reading books out of high school",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Absolutely this. And I have reread To Kill a Mockingbird several times. And I am educated and love reading fiction. OP sounds awful",
          "id": 102,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10124,
      "content": "YTA\n\nOmg…I think we have found the biggest AH of the day right here…WOW\n\n“Oh he’s not well educated…”\n\nYour husband works on nuclear reactors for goodness sake!!!! He is incredibly intelligent and your college degree would be useless in his field of work. Please take your elitist attitudes elsewhere and remember that practical skills are JUST as valuable as intellectual ones.",
      "id": 103,
      "comments": [
        {
          "score": 1231,
          "content": "This was my first thought. \nThey don't exactly just let anyone work on stuff like that. \n\nIntelligence isn't equal to big education. \nYou can go through a specialised field. Let's say math. Have a high degree in it. But be dumb as a door with anything else and not know what is up or down on a lid. \nOr barely scrambled through the education and just hit a bit over minimum scores to pass. It doesn't make you the new Einstein because there's a fancy name on the diploma. (Commented at people who feel like they are now indeed Einstein because of it and look down on others. Not people who struggled with school and achieved their goal) \n\nI know plenty who didn't take a big education, but love books. \nThis elitist view on the world is really annoying.",
          "id": 104,
          "comments": [
            {
              "score": 638,
              "content": "Has OP never heard the phrase “Ds get degrees”?\n\nJust because someone paid for schooling doesn’t mean they’re educated. I know plenty of dumb people that have a diploma.",
              "id": 105,
              "comments": [
                {
                  "score": 251,
                  "content": "The nuclear program in the navy at least when my Father did it had one of the highest fail rates. My dad hasn’t gone to college and is a a butt; when he wants to he can figure out most problems. Smart man.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 119,
                      "content": "I come from a navy family, and my older sister went nuke, I decided to pass on it for an easier job, but yea, about 2 years of intensive schooling so stressful they have one of the highest death rates of all the schools. And I am INSANELY proud of my smart AF sister <3",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 146,
                  "content": "I work in dentistry, “what do you call a D-average dental student? Doctor.”\n\n$50 says OP was a D/C-average color student and now thinks they’re better than everyone else. While living on their husband’s salary. Notice how OP didn’t mention which fancy degree they have or what high-power position they hold. Very telling.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 135,
                      "content": "Their username is Navy wife, so going by stereotypes, she probably stays at home and socializes with the other wives. \n\nMy mom never did like the other Navy wives…",
                      "id": 109,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "Seriously. I’ll use myself as an example. I went and got a masters degree. Summa cum laude. I’m a very “educated” person. \n\nMy wife got her undergrad. She did just fine, but nothing to write home about on the education front. But, she’s motivated and very smart, but doesn’t have degrees hanging all over our walls.\n\nGuess what? She makes triple what I do and is on the fast track for being a VP at one of the wealthiest companies in the US. And she’s less “educated” than I am. \n\nOP sounds like a piece of work and is TA . The dude has an amazing trade and seems to be good at it. You don’t need to read novels to be educated.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Yup. I didn’t go to college because I have a BIG issue with imposter syndrome and grappling with whether I’m smart enough for advanced education. (I was “unschooled” and thus self-educated as a child. I’ve had to do a lot of independent remedial work to get where I am today.)\n\nBut then, I look at some of the dummies in my field who flex their Master’s degrees and I have to wonder why I often feel like I can’t do the same or better. 😂",
                  "id": 111,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I'm sorry you are struggling with imposter syndrome :( I am struggling with it too. Different scenario, but I understand your struggle.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Yep.  The OP and her friends meet that description.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I have a Master's and I still feel like an idiot even in my field sometimes.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "> Has OP never heard the phrase “Ds get degrees”?\n\nAdditionally, I **highly doubt** D's get you on a nuclear submarine working on nuclear reactors.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I was a nuke until I got booted for being a sleepwalker (HUGE no no around heavily classified areas!) and let me tell you, that series of schools is HARD. It's an absurd workload, they compress what should be years of schooling down as far as they can. The fail out rate is astronomical, and so are the grade standards. People kill themselves over the extreme stress on such a routine basis that we even had a name for it- the Skipjack Diving Team. Skipjack was the tallest barracks on the base in Goose Creek SC.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This!!! This post is so incredibly triggering to me. I am in academia. My husband is a watchmaker, so, he is practically schooled. You will not believe how many of my (now former) acquaintances thought it was okay to point out that \"I'm dating below my level\" or \"downdating\".  I would never ever let someone insult my husband's intelligence, let alone insult it myself. OP comes across very elitist.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 871,
          "content": "She's also plain factually wrong. Navy Nuclear Sub training is worth 89 university credit hours.",
          "id": 118,
          "comments": [
            {
              "score": 556,
              "content": "Yeah this is honestly pretty crazy to me. I'm a navy vet, I have a master's degree too, and my navy training was just as challenging if not moreso than my traditional college education. It also counted for a good chunk of my college credits. And I wasn't a nuke - what they go through is much, much harder.\n\nActing elitist to your own partner is bad enough, but it's ridiculous that they're doing it to a guy with THAT job. Poor guy already does one of the most stressful jobs out there and his wife treats him like he's stupid.",
              "id": 119,
              "comments": [
                {
                  "score": 139,
                  "content": "Oh come on, you know OP's college education was much much more harder than your navy training. After all, she's  WELL EDUCATED! /s",
                  "id": 120,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "I was going to say, like sure my degree took longer to get, but everything about intel \"A\" and \"C\" school was way harder and more stressful than college, and I went to a really good college.  I had to study way harder in \"C\" school and the tests were way more information.  Anyone who makes it through intel school can absolutely get a degree, and nuke school (aside from special forces) was the only school they said was harder than ours.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Yeah, my partner was navy and has a masters and he worked hard on his masters, of course, but he did mention a few times that it didn’t feel like he was working hard enough to have earned a masters. Lol. Alternatively, I Don’t have a college degree, have a prestigious job AND I read a decent amount… so… literally having a college edeucation has nothing to do with reading books or being uneducated…. And the fact that OP says she wasn’t saying he was unintelligent just that he wasn’t college educated, that is not what you said you said he wasn’t “well educated”. That is so demeaning and disrespectful. You do not have to go to college to be educated. In fact, it feels like OP proves the opposite, you can go to college and still not be educated. Especially on things like manners and respect",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Holy crap, that's impressive",
              "id": 123,
              "comments": [
                {
                  "score": 30,
                  "content": "It's legitimately one of the hardest jobs in the military. I know a couple dudes that have done it, and others that tried and failed - at one point the Navy was offering something like a 90 thousand dollar recruiting bonus for it because it was both so hard and because you could immediately move to the civilian side after finishing your training and enlistment to make an easy six figures, so they couldn't get or keep people.",
                  "id": 124,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Way back in the 90's my wife took a military aptitude test and this role is what she was recommended for. She's smart as hell despite not getting a college degree.",
                      "id": 125,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Right? I was taken aback by the \"not well educated\" comment. Like if the rest of the people have degrees like they claim they do, they should know enough that Nuclear Sub work only takes the \"good\" ones.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Yeah, I was under the impression (I forget where I read it) that the stereotype about the folks that work on nuclear submarines was that they're all nerds who have or are getting their PhDs.",
              "id": 127,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 192,
          "content": "Seriously! Husbands has a life or death job. What does her a$$hat friend to for a living?",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 95,
          "content": "Such a huge asshole I feel like its a bait.",
          "id": 129,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "Ya probably main provider too but he’s unintelligent bc he don’t read books ya ok",
          "id": 130,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Sir we have a nuclear meltdown, what do we do?! -- Hmm let me remember what Tolstoy said about it...",
          "id": 131,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "My jaw dropped (figuratively lol) when I read that. Such a rude thing to say, to your partner no less. Just because someone doesn’t enjoy leisure reading doesn’t mean they’re uneducated.",
          "id": 132,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": ">your college degree \n\nI bet her and Steve don't have a very 'useful' degree.",
          "id": 133,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6311,
      "content": "Of course YTA. However, before I explain further I will need to see evidence of your qualifications. I fear that you may not be able to understand my comments if you are not sufficiently educated. If that proves to be the case, do not feel concerned: it's just how you are.",
      "id": 134,
      "comments": [
        {
          "score": 708,
          "content": "I love you.",
          "id": 135,
          "comments": [
            {
              "score": 43,
              "content": "I love them more.",
              "id": 136,
              "comments": [
                {
                  "score": 23,
                  "content": "yet i love them most",
                  "id": 137,
                  "comments": [
                    {
                      "score": 20,
                      "content": "nuh uh I do",
                      "id": 138,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 222,
          "content": "fr, when I showed this post to my hubby his first question was “and what does she do for a living?”\nalso craaazzzyyy how she hasn’t responded to anyone at all in the comments",
          "id": 139,
          "comments": [
            {
              "score": 78,
              "content": "Right! My comment asked what her favorite book was so we can judge it to see if she’s actually as refined as she believes…. Think I’ll get a response? 😂",
              "id": 140,
              "comments": [
                {
                  "score": 13,
                  "content": "LOL watch her say it's also To Kill A Mockingbird",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "I NEED to know. Part of me feels like she doesn't work.",
              "id": 142,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Maybe she's ashamed",
              "id": 143,
              "comments": [
                {
                  "score": 15,
                  "content": "She effing better be.",
                  "id": 144,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 183,
          "content": "I wish I could give you a thousand likes for this",
          "id": 145,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "Underrated post!",
          "id": 146,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "I had a similar thing happen, I replied with \"I guess you can consider me uneducated, but since we are on the topic, I don't consider myself pretentious do you?\" \n\nI wish I could have lended this to OPs husband.",
          "id": 147,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I'm shocked that no one is ripping on OP for talking about college as the place to have read more novels, as if life-long learning wasn't important.  I mean, no shade on OP's husband who it sounds like is hip deep in learning new things, if not reading new novels, but people who talk about what novels they love have usually been reading them recently, well after they completed their formal education.\n\nThe idea that not going to college is regarded as some kind of barrier to reading novels is ridiculous.",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I wonder what the most useless degree is that you can have?",
          "id": 149,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4293,
      "content": "YTA and so are your friends. \n\n>Then Steve gives him a quizzical look and asks him, “Have you read any books outside of high school?” \n\nSteve can eff right off too. \n\n>“Oh yeah, he’s not well educated, so he’s never had a reason to be well read.” We all had a good laugh\n\nYour pretentious group might believe itself well-read but it clearly lacks any social intelligence.",
      "id": 150,
      "comments": [
        {
          "score": 831,
          "content": "You whats funny, they think they are so smart when you can be below average intelligence and get a master in most things.",
          "id": 151,
          "comments": [
            {
              "score": 387,
              "content": "They’re so smart they still haven’t figured out that passing classes 99% of the time doesn’t mean you need to have any sort of understanding for the class!\n\nNow go try to let the Navy let you take a job being a nuke without having a high understanding of what you’re doing.",
              "id": 152,
              "comments": [
                {
                  "score": 323,
                  "content": "Former Navy Nuke here. The entire training pipeline, which is about 2 years of college level courses on math, engineering, (nuclear)physics, thermodynamics, material science, chemistry and more, consists of 40-60(+) hours a week of analog studying, ie. absolutely no phones, computers, internet, music, or electronics of any kind. Outside of lectures, it's virtually all quiet. Diving into technical manuals, performing calculations, and creating technical drawings. While you're kept busy for 40-60 hours of week by quietly studying, virtually none of that contributes to your grade. Your grade is based solely on passing closed book finals that are all free response(absolutely no multiple choice). Generally each question on the test requires a whole page worth of calculations, drawings, and technical explanations. Later in your training, assessments become almost entirely oral assessments where you're verbally questioned/grilled and have to respond and often times fill up an entire white board with drawings/calculations/explanations to support/defend what you're presenting. You absolutely are not getting through the program without understanding what you're talking about.\n\nAfter that 2 years of training is done, the hard part finally starts where you're expected to work 60+ hours most weeks in high pressure environments under continuous scrutiny. Constantly sleep deprived yet expected to perform at the highest level because a single mistake can cause an international nuclear incident. \n\nThose were the worst years of my life and during that time I didn't have the privilege of having time/energy to do reading for fun. Now I'm out and am well educated and employed in a completely different field(tech). I have yet to face anything else as academically challenging as what I dealt with in the navy. I'm now happy that I was able to expand my educational horizons beyond the deeply technical studies from my navy days. \n\nAnyone who's gone through the Navy Nuke program not only has a well-above average aptitude, but they also had to have Herculean grit to complete it.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Can confirm, being a MMN in the Navy is way fucking harder than getting most college degrees.",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I will forever remember in my advanced applied microeconomics class a student stopping the lecture to ask \"what is efficiency loss\".  I was dumbstruck by the question, not because it is a dumb question, but because to get into that class students needed to pass microeconomics 1, macroeconomic 1, calculus for economics 1, calculus for economics 2, and one other class I can't remember.  In all 5 of those classes the concept of \"efficiency loss\" was required material, to the point where I don't know how you pass one of those classes without knowing what \"efficiency loss\" is, much less all 5 classes.  I don't know how this person got into that class.  \n\n(And yes, he wasn't asking a more complicated question, at first he professor answered by explaining the formula for efficiency loss, but he kept asking \"no, what is efficiency loss\" until the professor kindly explained the base concept.)",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "As a dummy with a masters, who works with a bunch of dummies with masters…. You’re 110% correct",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "How does the quote go? \"It's genuinely amazing what the moderately intelligent consider to be a sign of genius\"",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Yup, college degrees are a show of wealth and dedication, not intelligence.",
              "id": 158,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Some of the dumbest people I’ve met, I came across in university classrooms. Earning a degree is 100% about doing the work, not intelligence. OP, Steve and friends are the perfect example",
              "id": 159,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "My dad calls it being educated beyond your intelligence.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 569,
          "content": "He should have replied, \"The last book I read was Fundamentals of Nuclear Fission. What do you know about controlled nuclear reaction?\"\nThis guy was rethinking the whole marriage after that party. She might as well just pack her shit and move out. Her sister is right.",
          "id": 161,
          "comments": [
            {
              "score": 84,
              "content": "He's a nuke, he'd probably get shit for something as low level as Fundamentals of Nuclear Fission. He's well past that level.",
              "id": 162,
              "comments": [
                {
                  "score": 40,
                  "content": "For sure. That was just the 1st thing that came to mind. There's so much physics and math just in that I'd have a terminal migraine just reading the intro. I'm a pretty smart guy, and I know I'd be over my head. OP might as well have said I want a divorce.",
                  "id": 163,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Yeah she acted like a guy that understands nuclear physics is an uneducated dumbass. She's definitely the asshole along with her shitty friends.",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 284,
          "content": "Also they’re literally talking about novels…like don’t get me wrong, I love a good novel, but my ability to read them has absolutely zero to do with my intelligence or life skills…You certainly wouldn’t want me near nuclear objects",
          "id": 165,
          "comments": [
            {
              "score": 23,
              "content": "Plus, you can read a million shitty books and gain absolutely shit...\n\n... and on the other hand you can read a page that can change your life.\n\nBooks have the magic and can work like that.",
              "id": 166,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Also from my experience it gives some inclination as to what they studied. The only friends I have that regularly read and discuss novels are all arts/humanities. I and none of my medical research friends read anything sophisticated (like books for teens is our average reading level) if you spend all day reading technical info the last thing you want is to go home and read some philosophical wankery from a genious futurist novelist about robot prostitutes...",
              "id": 167,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "When I was in my early 20s I read the first 4 or 5 Pendragon novels. Fantastic series, as far as I read. Then I lost library access and couldn't afford books for like 10 years. \n\nI'm in my late 30s now, and saw the rest of the series at the library the other day (I have a library card now) and for as much as I wanted to know how it ends,  just looking at that wad of paper made me feel... Kinda tired. I don't know if I have it in me anymore to enjoy a book. I don't know if I could sit down and shut out the world and watch a movie in my brain the way I used to. \n\nI'm just all out of spoons all the time. And even things that used to bring me joy now consume energy I just don't replenish fast enough to justify the expense.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yeah! I don't reach much any more, but I'd routinely plow through 3-4 books, many of which were in a language I'm not even a native speaker of, a week for years. I wouldn't want *anything* to do with handling *anything* nuclear, and nobody in their right mind would put me in charge of such an object anyway. Sure, I have a fair amount of practical skills and such, but nothing I have done or will likely ever do would qualify me for such a responsibility.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 234,
          "content": "[removed]",
          "id": 170,
          "comments": [
            {
              "score": 21,
              "content": "Same - all honors and AP English, never read it. In fact I still haven't gotten there yet, but since it's currently free domain, I have a giant pdf sitting on my desktop waiting for me (I work in education, and during the year that shall never be mentioned we tried to find as many books virtually as we could).",
              "id": 171,
              "comments": [
                {
                  "score": 8,
                  "content": "My boyfriend does not enjoy reading, he’s always struggled with it. But he’s still very intelligent, was always a genius when it came to math. Meanwhile (and this is not directed at you or the other commenter) I’ve known people who also took AP English and just lacked any real critical thinking skills. Like OP here.\n\nI feel like people like OP thinks reading a lot makes you smart. It doesn’t. There’s as many trashy books as there are movies and TV shows.",
                  "id": 172,
                  "comments": [
                    {
                      "score": 8,
                      "content": "The theory is that reading fiction increases your empathy. Living inside other people’s heads, appreciating other ways of living.\n\nI’d hate to see where OP started out, if that’s accurate.",
                      "id": 173,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 103,
          "content": ">Steve can eff right off too. \n\nI guess we all know where Steve fucks off too when \"hubby\" is deployed.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": ">We all had a good laugh\n\nShe thinks comments like that and laughing at her husband's expense is normal! They are literally a form of emotional abuse if it happens regularly, since she thinks it's normal behavior, I'm guessing it does. Absolute massive ah! \n\nHe works on nuclear reactors for god sake, she doesn't realise she's the unintelligent one in the relationship, but I'm hoping her husband realises it sooner rather than later.",
          "id": 175,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "I highly doubt they're actually well read. They sound like the kind of pretentious twats that read everything off the NYT best seller list religiously but then ignore everything else. And have never read nonfiction in their lives.\n\n\"Oh, I read everything Oprah tells me to and that makes me more educated than my literal NUCLEAR ENGINEER husband.\"\n\nI sincerely hope that OP's husband takes this as the wake up call he needs to realize that he can do so much better than her.\n\nEdit to add: OP and her friends sound like walking examples of the Dunning-Kruger Effect.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "If Steve asked my husband that with that attitude we would not be friends. How condescending! And then for everyone to laugh. I would have left with my husband right there.",
          "id": 177,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2651,
      "content": "Mother fucker works on goddam nuclear reactors on submarines, but \"he’s not well educated\"\n\nYTA",
      "id": 178,
      "comments": [
        {
          "score": 242,
          "content": "I think OP's knowledge of nuclear reactors starts and ends at the Simpsons.  She's holding her bachelors of who gives a shit as a laurel over her husband Homer Simpson.",
          "id": 179,
          "comments": [
            {
              "score": 26,
              "content": "That was where my mind went too! Homer got a job at the power plant by just showing up the day the plant opened. Clearly OP’s husband did the same thing! /s",
              "id": 180,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 157,
          "content": "Took the words right out of my mouth!",
          "id": 181,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Being well educated doesn’t even equate to being well read. I have a PhD in molecular genetics and haven’t read a single fucking book since high school, because I hate reading books.",
          "id": 182,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1825,
      "content": "YTA\n\nHe works with nuclear reactors! That's highly demanding work, with no margin of error.  I'll take a college education any day over that level of life-and-death responsibility for not just myself but anyone in fallout range.  He's responsible for making sure that we don't have a repeat of Chernobyl in our nuclear equipment. \n\nHeck, it puts him in the same class as Jimmy Carter, quite possibly the most ***badass*** president of the 20th century.  In his long career, not only was he president, he also worked on nuclear reactors in the navy, and, with his team, literally walked into a melting-down reactor and fixed it.  Eradicated the Guinea Worm, a really nasty parasitic disease.  Negotiated peace between Egypt and Israel.  Built houses by hand for the poor, as a retirement project. Taught Sunday School for over half a century.\n\nWith work that demanding, it isn't surprising if your husband wants his relaxation time to not involve reading, if he's having to keep up with reading (and possibly working to keep updated) the safety and operation manuals for nuclear reactors. \n\nYou owe him an apology, and it wouldn't hurt for you to learn more about the (non-classified) parts of his responsibilities, so you don't make a fool of yourself downplaying his education, intellect and level of responsibility again.",
      "id": 183,
      "comments": [
        {
          "score": 546,
          "content": "Sooo my dad was a nuke, and I've had friends who went to nuke school.... it's literally just schooling.....   like sure it's all science and math... but dam this lady knows nothing about her husband...  and looks the hell down on him for no reason.",
          "id": 184,
          "comments": [
            {
              "score": 249,
              "content": "My dad was a nuke and my BIL; one of these two has a physic degree. Both are extremely intelligent; my dad isn’t a big fiction reader never has been. That man has so much random knowledge. Reading fiction isn’t everyone’s cup of tea.",
              "id": 185,
              "comments": [
                {
                  "score": 15,
                  "content": "I know people who don't read books or novels, and fill their free time with either learning new skills, or honing their already existing skills. You know, active personal growth towards making themselves better.\n\nBut sure OP. Keep telling us about how your fiction book series about fairy sex makes you educated.",
                  "id": 186,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 171,
              "content": "Yeah, it's 24 weeks of 40 hours of classroom instruction, and up to 40 hours a week of mandatory studying if you do poorly on a test.\n\nThe phrase \"drinking from a fire hose\" is entirely appropriate, and if you pass NNPS, you can *absolutely* consider yourself \"educated\". Some colleges consider it worth up to 90 credit hours. That's 3 years of a college education, in *six months*.",
              "id": 187,
              "comments": [
                {
                  "score": 65,
                  "content": "Exactly this. I transferred around 80 credits when I got out towards a four year engineering degree. All from the Navy nuclear program. The only reason it wasn't closer to 90 was a cap on transfer credits for the school.",
                  "id": 188,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Yeah, my dad only needed one semester worth of college to finish a degree in nuclear engineering once he was getting out.",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Ok 6 months and she had the gall to call her partner uneducated wtf",
                  "id": 190,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 108,
          "content": "YTA for sure. OP hasn’t considered emotional intelligence, practical intelligence, creativity, originality of thought or problem-solving skills as expressions of intellect. I’m an avid reader, but realise fully there’s nothing particularly exceptional about reading, rehashing and reiterating the ideas of others. There’s no innovation in that. \n\nI think a bit of introspection and an apology is warranted. OP is woefully shortsighted as to what intelligence really is.",
          "id": 191,
          "comments": [
            {
              "score": 8,
              "content": "Nope, all she knows is that if someone is in the military, they must be a dense, uneducated meathead.",
              "id": 192,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Honestly she's almost willfully ignorant after being together for four years. One of the selling points for the program is the transferable college credit. When I got out of the Navy after being in the nuclear field, I transferred around 80 credits towards completion of my four year engineering degree.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1458,
      "content": "Omg.  YTA, and a huge one.  Are you sure someone as educated and well-read as you are should even be married to someone as stupid and illiterate as your NUCLEAR ENGINEER husband?? /s. \n\nUnbelievable that you are so clueless about your obvious disdain for your husband.  Let me tell you, OP - Bubbleheads (submariners) are some of the smartest and best trained people in the Navy.  They are more highly trained, more educated, and they go through rigorous screening and testing just to be considered for submarine duty.  You are married to someone who is probably smarter than YOU.  And you dare look down on him?  Shame on you.",
      "id": 194,
      "comments": [
        {
          "score": 177,
          "content": "Hell just being on a submarine is a lot more than I (and a lot of people I know) would be able to manage. Then add in all the nuclear stuff and forget about it.",
          "id": 195,
          "comments": [
            {
              "score": 93,
              "content": "Don’t forget, everybody in a sub cross trains for someone else’s job, just in case.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "That's something most people are glossing over. Not only is he a highly trained reactor tech, he's also trained on fire-fighting and cross trained on most other functions within the sub.",
              "id": 197,
              "comments": [
                {
                  "score": 9,
                  "content": "As a nuke mechanic, I loved going forward to play with the fire control tracking party when needed.",
                  "id": 198,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 108,
          "content": "From what I gather from the submariners I've talked to, working on a submarine is like working on a spaceship: Small mistakes can kill everyone, you live in a metal tube, the outside will kill you, and you need a crazy amount of training and education to even board one.",
          "id": 199,
          "comments": [
            {
              "score": 61,
              "content": "Obviously (according to OP) all those guys are dumb imbeciles because they haven't read the twilight series or Harry Potter in their downtime from working on a nuclear powered sub",
              "id": 200,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "I mean if we set aside the fact that he's extremely smart, looking down on your partner is such a huge red flag. Why are you married to him if you think he's stupid? And most importantly: why is he married to her when she's so self-absorbed and stupid?",
          "id": 201,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": ">probably\n\nLol I pretty much guarantee it. Poor dudes just trying to grapple with the fact he was insulted like that while being a fucking genius.",
          "id": 202,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 899,
      "content": "YTA, and also kind of dumb. He is educated, he went to school as part of his service. Yes, military education counts. A lot of people who go to college for something other than liberal education or the arts will also not read many fiction books. Most of my friends who are engineers, computer scientists, etc didn't read many fiction books during school.   \n\n\nA military education is a good education, he works on nuclear reactors on submarines.   \n\n\nNot everyone reads a lot of fiction, that doesn't mean they aren't well educated. He has the education of an engineer or an applied scientist, it sounds.",
      "id": 203,
      "comments": [
        {
          "score": 239,
          "content": "And not all fiction is high brow literature. I love a good James Patterson novel, but you don't need much going on upstairs to read one.",
          "id": 204,
          "comments": [
            {
              "score": 49,
              "content": "Right? I see books like movies, a way to distract myself or entertain myself. I don't need to have to think or philosophize about it.",
              "id": 205,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "*Dilbert* once had Dilbert jeering at Dogbert for watching TV and not reading, like Dilbert was. Robbery said \"I just watched a show on how they discovered DNA, and then one on Marie Antoinette and now I'm learning how to bake a cake. What are you reading?\" \"The Poodle who Killed\".",
              "id": 206,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "OP is probably one of those people who thinks they're really smart and \"nerdy\" because they read young adult fiction.  I've noticed that the people who are the most snobby about books have neve read anything past a high school level.",
              "id": 207,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I work with a lot of vets turned engineers. A lot of them never got their fancy piece of paper but brought along their experience. They are some of the smartest people I know. I have a degree, but they have experience. I'm always the one asking them for help, not the other way around.",
          "id": 208,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "The program also leaves you with ~80 transferable college credits. I transferred around 80 after the Navy to complete my four year. It could have been closer to 90, but they had a cap on transfer credits. The bulk of what I had to finish was general education, and a couple higher level math courses. It's literally one of the biggest selling points for recruiting to the nuclear program, and I have a hard time believing that after four years together, she wouldn't already be aware of that.",
          "id": 209,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 731,
      "content": "YTA- why would you need to throw out there that your husband isn't educated? That seems very belittling and unnecessary to the convo. You could have just said \"my husband enjoys doing other things besides reading\" and tried to include your husband, not separate him even more...",
      "id": 210,
      "comments": [
        {
          "score": 193,
          "content": "Or not said anything..? Doesn't sound like he needed her to explain anything for him, he clarified he hasn't really read since high school... There was no additional explanation needed. \n\nAlso I bet they didn't \"share a good laugh\" like she said, the friends were probably nervously chuckling after her comment because they felt super awkward,",
          "id": 211,
          "comments": [
            {
              "score": 49,
              "content": "Not Steve tho, I suppose",
              "id": 212,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": ">Also I bet they didn't \"share a good laugh\" like she said, the friends were probably nervously chuckling after her comment because they felt super awkward,\n\nYeah, I picture the awkward shocked laugh that comes out when someone says something so unbelievably awful you don't know how else to react.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "That's the impression I got too. That the friends likely had a nervous laugh in reaction to her rude and socially unaware comment. People tend to laugh when they don't know how else to react. I want to believe that her friends are nicer people and just didn't know how to react to the awkward situation she made with her demeaning comment.",
              "id": 214,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 144,
          "content": "It's extra weird because he clearly IS educated. It's just such an unkind thing to say. It was done to put him down in front of her friends and showed her true colors and true opinions of her husband. It just was not nice and the fact that OP doesn't realize that is even stranger.",
          "id": 215,
          "comments": [
            {
              "score": 14,
              "content": "Not only were her words unkind and condescending, the fact that she dived in to explain for him as if he couldn't answer himself. One should never, EVER speak for another adult as if he/he is a child.",
              "id": 216,
              "comments": [
                {
                  "score": 16,
                  "content": "AND she doubled down in the car explaining how military and college educations are \"different\"",
                  "id": 217,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Which they are but not for the reasons she thinks.",
                      "id": 218,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "So many layers of assholery. \"So then I try to explain to Steve\", as if not reading novels requires an explanation. Jesus, what a fucking asshole.",
                  "id": 219,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "OP doesn't realize that for the same reason she doesn't realize that her husband's job requires a HIGH degree of difficult, highly specialized education (college credits and all) - she's an uneducated, pretentious moron.",
              "id": 220,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 41,
          "content": "yes exactly. and the worst part is she said that in front of other people. it wasn’t a private convo.. she put him on blast in front of all of her friends to get a laugh out of it at the expense of her spouses emotions",
          "id": 221,
          "comments": [
            {
              "score": 15,
              "content": "fr. sounds like she already feels inadequate when comparing her work to his so she had to find any spot she could throw a jab.",
              "id": 222,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 564,
      "content": "YTA I can’t even fathom why a guy with that level of intelligence and clearance is with YOU because you seem dumber than a box of rocks. I have a military education (I went to the US Air Force Academy) and a Masters degree - you, my dear, are an ASSHAT DEPENDENT of the highest degree. The amount of training, education, and security clearance your husband has is impressive and way beyond your comprehension…obviously. You and your little band of snotty college friends need to fuck right off to the hole you crawled out of and learn some basic manners. I hope your husband loses the sea anchor he’s got chained to him right now…shaped like you.",
      "id": 223,
      "comments": [
        {
          "score": 66,
          "content": "👏👏👏👏👏",
          "id": 224,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Said it so eloquently. Milspouse myself, and I would never insult my husband's intelligence because outside of obligatory reading (IYKYK), He couldn't give a damn less about a book. Thank you for this. \\*chef kiss\\*.",
          "id": 225,
          "comments": [
            {
              "score": 12,
              "content": "The obligatory reading sucks soooo bad…it’s up there with mandatory fun. Thanks for being a cool spouse - you’re the ones I loved when I was active duty :)",
              "id": 226,
              "comments": [
                {
                  "score": 13,
                  "content": "I appreciate this! I dodge the groups like a plague, because of women like OP. Maaan. Come to the dark side. We have cookies, a crockpot going, and a bunch of puppies. <3",
                  "id": 227,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "This comment needs to be at the top.",
          "id": 228,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "I bet your Masters degree seemed like a joke compared to the AFA bachelors.",
          "id": 229,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}