{
  "post content": "Hey, so I’m 26M and my sister is 19F. She’s very autistic, like hand flaps, drooling, only talks about baby things like princesses, etc. Truth be told, I don’t enjoy being around her. Sometimes my parents ask me to watch her, but I’ll say no because of this (though I tell my parents it’s because of work because I don’t want to come off an ass.) I knew that I was having today as an off day so I couldn’t wait to stay at home and just let loose, watch movies, maybe smoke a little weed.\n\nEarlier in the week my mom called and asked me if I could watch my sister today, I said no. Yesterday they called again to which I said no again because I want to relax on my day off like any guy. I don’t think it’s bad to not want to have something to do.\n\nThis morning I got a text from mom saying she’d be back about 4:30. I thought it was for my dad or something since she hadn’t been to my house in the first place to come back to. I called dad and he said he was at work so that confused me. I looked out the window for mom’s car or something and it turns out she left my sister on the porch. I called mom and pointed this out to her, she said “oh yeah, it won’t be for long.” It was about 11 so 4:30 was easily five hours. I said I wasn’t looking after her so someone better come get her. I kept my word and didn't have her in my house at all.\n\nWell eventually my mom showed up at my house and banged on the door, chewed me out with some “how could you” speech about not looking after the sister I said I wasn’t watching. I got another earful when they went home because I guess sister defecated in her pants during the time she was on my porch, which sucks but I didn’t cause this.\n\nI’ve never seen mom that upset and it has me wondering if I was the asshole for not watching my sister when my mom presented me with her. I just wanted to enjoy my time but I wonder if I did wrong.",
  "id": 1,
  "comments": [
    {
      "score": 2443,
      "content": "ESH - can i ask why you hate your sister? the way you talk about her here is .. atrocious, not to mention you left her OUTSIDE ON YOUR PORCH until your mother 'eventually' showed up?? do you have any idea how dangerous that could have been?\n\nyour mother shouldnt have dropped her off there after you said you wouldnt watch her, but you left your VULNERABLE LITTLE SISTER OUTSIDE.\n\ni cannot imagine having this much contempt for a little sibling. its not your job to take care of and watch over her but the fact you didnt even let her in your house once she was there is.. disgusting.\n\nedited for judgement because mom is definitely an asshole too for dropping her off  \n\n\nedit 2: so people are talking about me .. sitting on a high horse and not offering any suggestions or ways for OP to deal with the situation   \n\n\nmy #1 suggestion is - he didnt want her inside, he could have sat outside on the porch with her. if ONLY to make sure nothing happened to her. he didnt even have to let her inside - literally sitting outside on his phone would do. he could have called someone, but that gets a little messy (as other commenters have pointed out)  \n\n\nalso, what i mean by \"the way he speaks about her interests\" is that the comment \"shes into baby things, like princesses\" rubs me the wrong way. there were many many ways to say \"oh, she likes princesses\" and even then i dont see why her interest in those things is relevant to the conversation - it seems like it was brought up SOLELY to make fun of her for being into such things  \n\n\nthe only person who ISNT an asshole here is the sister . mom dropped sister off even though she KNEW op wasnt going to watch her (AH move, why would you leave your impaired child alone with someone who you know wants nothing to do with her) and op is an asshole for leaving said impaired child alone on the porch for an unspecified amount of time.   \n\n\ntl:dr - i hope your sister is okay, op, because shes severely autistic, not stupid. she definitely knows when shes not wanted. you shouldnt have left her alone on your porch and your mother sucks for leaving her there in the first place. being parentified sucks and i can understand the resentment you feel towards your sister, but get therapy to handle that - your sister isnt at fault for being autistic.",
      "id": 2,
      "comments": [
        {
          "score": 1621,
          "content": "My guess is he doesn’t hate his sister, but probably the fact that he was most likely parentified before moving out and his parents expect him to be a third parent and help, even tho she is not his child or responsibility. He’s probably resentful of being put in similar positions most of his life as soon as he was old enough. \n\nESH, mostly your parents OP. you suck for leaving her on the porch for god knows how long because someone with severe autism like that could’ve gotten injured, lost, or something worse. You’re not at all obligated to take care of her, she’s not your child and you didn’t choose to have her. But try to have a little compassion and don’t leave your mentally handicapped sister unaccompanied outside.",
          "id": 3,
          "comments": [
            {
              "score": 482,
              "content": "sure, i can understand that - being parentified sucks . my older brother has autism so i was expected to look after him and my little sister for a very long time, and i came to resent my siblings for it.\n\nhowever, eventually i realized my siblings werent at fault for what my parents did, and at 26 its kind of expected that you realize sooner or later it isnt your siblings fault that your parents didnt do their jobs .\n\nhowever, i would NEVER talk about my older brother like op does about his sister. the way he talks about her interests and behaviors is just .. worse than resentment.  we all have different experiences with parentification and how we react is different, but im still shocked that op would talk about a sibling like that. he should probably consider therapy rather than taking his resentment out on his sister  \n\n\nedited for phrasing",
              "id": 4,
              "comments": [
                {
                  "score": 504,
                  "content": ">  the way he talks about her interests and behaviors is just \n\nThis is the thing that hit me. OP doesn't see her as a person.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 787,
                      "content": "What did he say that was so bad?  she flaps her hands and drools?  would \" she moves her hands back and forth like a cute lil fish, it's  so adorable\"  been better?  The mother doesn't see him as a person. This isn't the first time this has happened.  Odds are that this has been going on his whole life.  Sometimes you have to go to extremes to get your point across.\n\nThe mother knew what she was doing. She dumped her autistic daughter on a door step and drove off.  Emotional blackmail and guilt. The tools of a abusive mother. Imagine growing up in that household. The mother got exactly what she wanted a day off and all the blame going to her son. Some of you guys are players in her game.  Blame the victim so she dodges what she did. Dropped her autistic daughter off and drove away.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 66,
                      "content": "OP sees her as a child, which she mentally is. And he is supposed to take care of her because mommy left her on the porch like a stray dog? He has been more than clear that he will not watch her and yet mum pulls this bullshit. \n\nNONE of this is on OP, he mabe could've let her inside, but that would be the tiny ass crack it takes for mum to cross boundaries again and again. As long as he had an eye out he did more than he needed.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 48,
                      "content": "Came here to say this. He doesn’t see her as a person.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "This was the point that hit me aswell  he is writting it in a way that makes him seem to be disgusted be her stimming. The drooling makes me think she might be mentally set back, which is the only thing in there that really suggest her being \"very\" autistic. \nFlapping hands is a pretty normal stim even in \"well functioning\" autistics.\n\nI can understand it sucks to be treated like a third parent, and what his mother did was not ok, both of those things should be taken out on the mom not the sister, so maybe OP needs some therapy for those experiences.\n\nEdit: forgot quotes around very, and I know she could be intellectually disabled on top of being autistic. I also know the functioning levels are bogus, unfortunately many NT's still use them, which is why i put them in quotes. \nI am autistic myself, and writting things without tons of extra information around, that i do not see as hugely necessary, is not something i do.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "Not everyone deals with it as well as you and maybe his situation was worse. He clearly doesn’t want to babysit and his mother should just respect that instead of dumping the poor girl on his doorstep and driving away. What if he’d been out of town and hadn’t got that text? She could have wandered off and been hurt.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Or not have anything to do with her like he tried to. Like any other sibling he has no obligation to be friends or to know them and can decline whenever he wants. Stop projecting your own issues from being parentified onto someone else.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yeah like I was parentified since my single mum had to work to support us so I had to step up and play second parent but I never took it out on my siblings as though it was their fault\n\n(Except for when my sister sniffed and told me I wasn’t her parent when I tried to get her to do something but then I could magically give her permission to go out or do something when she needed it. But that’s just a normal kid thing 🙄)",
                  "id": 12,
                  "comments": [
                    {
                      "score": -1,
                      "content": "I probably was too. My mom and dad got divorced when i was 5. My brother is extremely autistic as well. My dad decided to move and take a job halfway across the country. Leaving my mom without another adult to help. She was currently going back to college and working 2-3 jobs to support us. I think my sister holds more resentment towards my mother than i will ever. I mostly resent my father. His choices led to the divorce, he chose to move away. \n\nBut yeah this story breaks my heart. The sister didn’t ask to be disabled and yet is being punished for it. Also even if she isn’t disabled…you should help family out if you are able to. Which he was.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I think it goes beyond \"just\" parentification. I think that when OP was seven there was a new baby, aren't you excited? Of course, you won't be getting as much attention but it's just a couple of years - except it wasn't just a couple of years, sister *stayed* a baby (she didn't, but she remained high needs), would have been having screaming meltdowns when OP was a teenager so good luck having friends over even if you're not stuck watching the kid, no social life because she needs her routines and why don't you want to spend time with your sister? So he ran.\n\nI do think OP sucks - I think leaving anyone on a porch for five hours is not okay, leaving someone who would crap their pants rather than knock and explain that they need the bathroom is *way* beyond \"not ok\". If a vulnerable person has been left in your doorstep, call somebody. APS, the cops (if that's safe), your dad - *somebody*.  Mother sucks because she is also playing \"I'm going to use this vulnerable person's actualfax needs to get my way\". Poor sister.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Actually, to me, it sounds like he has very little experience with her.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I can get that, but the way he speaks about her sounds like he's 14, not 26.  \"She likes baby things\", like, really?  I've never heard anyone above the age of 16 say it like that, and it just sounds malicious at that point.\n\nLike, dude.  At least hide your juvenile disdain for her if you don't want to look like an asshole.",
              "id": 16,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 124,
          "content": "The mother left her daughter outside. Not OP! \nShe didn’t even check if he was home.\nWhile I’m not sure that I’d personally be able to just ignore her and leave her outside, taking her in only shows the mom what she has to do to get her son to look after her daughter. \n\nBrother or not, it is not his job to look after her. If OP’s mother needs help with her daughter she should get professional help and not just dumb her responsibilities on someone else and drive off.",
          "id": 17,
          "comments": [
            {
              "score": 68,
              "content": "That’s what really got me.  Even if his car was in the driveway or something, she had no way of knowing that he was actually home.  And what if he wasn’t, and also didn’t check his phone?  Sister would have been sitting there all day?",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "They both left her there. Mom dropped her off, OP looked out and saw her there too.\n\nIf someone drops a vulnerable person off at my house without asking they’re an ass, but I’m still going to try to help the person - while calling the authorities.",
              "id": 19,
              "comments": [
                {
                  "score": 11,
                  "content": "I mean seriously, these people are basically suggesting that he made the best choice he could’ve and that his sister should’ve been forced to sit outside in her feces for hours so he can prove a point to his mom. Sorry, but no. Absolutely not. If a complete stranger drops a child at my door I’m going to call the police and make sure that they are okay, not LEAVE THEM ON THE PORCH TO SHIT THEMSELVES. Anyone defending him is kind of out of their mind. The mom is worse, but they both seem awful. I hope that girl gets the help she needs away from these people.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Yeah, this is what OP should have done, call the police or CPS. \n\nEven if OP was home, he could have been asleep, or in the shower having a bath, or his phone could be dead, or 10 more things that would have resulted in the sister being left alone outside that the mother didnt count on.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "These parents really need to look into some respite care instead of relying on a son who likely spent his entire childhood babysitting his sister.",
          "id": 22,
          "comments": [
            {
              "score": 1,
              "content": "We don’t know that they haven’t. OP gave very little insight as to what the situation is, but a lot of people are jumping to the conclusion that he must have been parentified his whole life, they must be asking him to help all the time, and that they aren’t doing enough. But we don’t know that - if anything OP seems completely indifferent to her and the only reason he doesn’t want to help out is that he doesn’t find it pleasant or entertaining and he wants to get baked at his house on his day off. Families that care for a disabled family member don’t get a lot of financial support and accessing respite care may be very expensive and thus not financially realistic depending on where this person lives. I get that it’s not his legal responsibility to care for his sister, but his parents may very well be in a caregiving position until they themselves are in need of care. A lot of parents are literally driven to the end of their rope because they don’t get sufficient support, financial or otherwise. I agree that what his mother did was shitty and dangerous, but I dunno - maybe she literally couldn’t imagine that he would leave her out there for hours without even giving her the dignity of being allowed to use the bathroom. I sure couldn’t.\n\nETA - I wonder if people would be responding the same way if OP’s sister was a child? We don’t know the legal arrangement, or the extent/nature of her disabilities, but based on what was written about her soiling herself and needing to be watched it sounds like there’s a chance she may never be able to live independently.  The amount of indifference people have towards folks with disabilities is truly depressing.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "because he was the oldest and then he got a broken baby sister and she got all the attention. but then she wasn't a real sister, she was a perpetual baby who screamed and couldn't do anything right, who shit her diapers all through school, and nobody wanted to play with him because he had a gross sister. so she ruined his life and stole his mommy. and his parents made him her keeper.",
          "id": 24,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 0,
          "content": "He didn’t leave his sister outside on a porch by herself: her mother did!",
          "id": 25,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -1,
          "content": "Do you know any 26 year old men, without kids, who are into princesses? The only correct thing to do was leave her on the porch, alone, and call the police. Otherwise she would be in family care, and they wouldn't have done anything. But like most children of people who abuse them, he probably never realized he could do that. Plus, if he'd never looked outside, she would have been out there until 4:30 and NO ONE WOULD HAVE KNOWN. It would have been WORSE. He did the right thing and told his mom to come get her. She kept refusing. She literally refused to take care of her OWN DAUGHTER. \n\n  \nWhile I completely get that sister is in the middle, she is NOT OP'S responsibility. You are trying to make him a patsy. He literally couldn't do anything for her and not be thrust into that situation again. Letting her into his house was EXACTLY what his mom wanted, and she didn't give a shit about anything past that.\n\n  \nYou are blaming him for having a sister. He had zero control in her creation, and has zero responsibility for her now. It doesn't matter if he loves her or not, lot's of people don't have good relationships with siblings. He did not do anything to hurt her. He did something to help her, called his parents. \n\nI'm sure the entire situation for everyone here sucks. He was only trying to protect himself from being abused by his mom, again. Telling him he's an asshole for not letting his mom abuse him is pretty terrible.",
          "id": 26,
          "comments": [
            {
              "score": 9,
              "content": "okay, ive stopped responding to the notifications on this post but this take.. makes me insanely angry . first of all, how dare you insinuate that im calling OP an asshole for .. \"protecting himself from being abused\" . literally nothing in the original post says hes being abused, and while i can understand inferring parentification, thats not exactly said in the original post either.  \n\n\na lot of people are making a LOT of assumptions. based SOLELY on what op himself said in the post, everyone here sucks.  \n\n\nin my comment i SPECIFICALLY STATE its not his job to take care of her and he didnt need to let her inside - again, sitting on the porch until mom came to get her wouldve been just fine . TONS of women who are nonverbal are snatched up and hurt severely. even without jumping to that conclusion, if her behavior is as op says it is, she could have hurt herself by walking out into the middle of the street.  \n\n\ni am not blaming him for having a sister. i said that its not his sisters fault that hes possibly being treated like a third parent and he shouldnt be taking it out on her.  \n\n\nand about the \"how many 26 year old men do you know who like princesses\" thing, it doesnt exactly matter, because i know plenty of 26 year old men with little sisters who dont treat it like its some sort of 'baby interest' . i know plenty of grown men who respect their little sisters interests and op is simply not doing that here. there wasnt any need to bring the sisters interests into it in the first place. it doesnt add anything to the story, it doesnt tell us what she acts like other than \"shes into princesses and i think thats an interest for baaaaaaabies\". there was no reason to bring that into play.  \n\n\nthe mother is also at fault here - i said that in my comment too. the way op talks about his sister makes it sound like he, at least to some extent, dislikes or resents her. which would make sense if op was being parentified, but again, op never says that in his post. he just says hes asked to take care of his sister sometimes and he says no because he doesnt like her.  \n\n\nmom is bad too for leaving sister on the doorstep of someone who wants nothing to do with her, but absolving op of all faults because of the inference that he was parentified and/or abused is very very odd to me. abused and parentified people can still be at fault, and its my opinion that op is partly at fault. mom essentially abandoned her disabled child at the doorstep of someone who didnt want her, which is bad, but once she was there it literally wouldnt have taken any time out of his day to call mom, sit on the porch with sister and be on his phone while looking up every once in a while to make sure shes still there",
              "id": 27,
              "comments": [
                {
                  "score": 1,
                  "content": "Well your post makes it clear you think that his sister is his responsibility. If he took any kind of responsibility for her he would be binding himself to BE responsible for her. By not accepting responsibility for her he was protecting himself from being abused from his mom. And you called him an asshole for it. \n\n*\" how dare you insinuate that im calling OP an asshole for .. \"protecting himself from being abused\"*\n\nSo yes, you called him an asshole for protecting himself from being abused by his mom. \n\n*a lot of people are making a LOT of assumptions*\n\nAs did you when you said  *can i ask why you hate your sister?*\n\nHe never said he hated his sister. He said he doesn't like her. I don't think he cares enough about her to hate her. Which seems to make sense with how his mom is treating him. \n\n*i am not blaming him for having a sister. i said that its not his sisters fault that hes possibly being treated like a third parent and he shouldnt be taking it out on her.*\n\nHe absolutely did not take it out on her. At ALL. There are people in this world, as horrible as they are, that WOULD have taken it out on her, he did not.   \n\nLet's see. Did he hit her? NO. Did he verbally abuse her? NO. Did he push her? NO. Did he throw things at her? NO. Did he harass her? NO. Did he call other people over to harass her so he could watch? NO. Did he yell at her for being there? NO.  He in NO WAY took it out on her.\n\nYou are confusing taking it out on her with not taking responsibility for her. Letting her in the house, staying outside with her, ALL are ways of taking responsibility for her. He did not do that. Because he was not going to take responsibility for her, that does NOT make him an asshole. If he had taken it out on her, punched her, screamed at her etc, THAT would have made him an asshole. All he wanted to do was STAY OUT OF IT. And he did. He EVEN was kind enough to call him mom and tell her she needed to pick him up, even though he had already told her he wasn't going to watch her days before. He didn't have to. BUT HE DID.  \n\n*TONS of women who are nonverbal are snatched up and hurt severely. even without jumping to that conclusion, if her behavior is as op says it is, she could have hurt herself by walking out into the middle of the street.*\n\nI'm sure that what you are saying is true. That is not the issue. The issue with this is that you are stating that this happening is HIS responsibility, instead of being upset that his mom set her up to have this happen to her. You should have been talking about being pissed at his mom for this INSTEAD OF HIM. Because HE had nothing to do with it.   \n\nOr is he also responsible for all women, men, etc, who might show up at his door and get snatched?  He is no more responsible for his sister than them. \n\n*but once she was there it literally wouldnt have taken any time out of his day to call mom, sit on the porch with sister and be on his phone while looking up every once in a while to make sure shes still there*\n\n5 hours. That would have pretty much been his whole day. Because he DID call his mom. And she refused to pick her right back up. Maybe you missed that part. \n\n *I called mom and pointed this out to her, she said “oh yeah, it won’t be for long.” It was about 11 so 4:30 was easily five hours.* \n\nHe had plans for his day off. And having to babysit his sister was not part of them. Which is why he said NO to begin with. \n\n*I knew that I was having today as an off day so I couldn’t wait to stay at home and just let loose, watch movies, maybe smoke a little weed.*\n\nDoes that sound like being forced to hang on the porch and listen to her while looking at his phone all day? No, no it does not. \n\nYour making a lot of assumptions for someone who is 1) pissed at other people because you *think* they are making assumptions, and 2) seems to have problems with reading comprehension. \n\nHere's what it sounds like. You had an autistic brother and think that because you were ok with it, everyone should be. Yes they can be vulnerable. But that is the responsibility of the parents, and all anger about NOT giving a shit about them should be direct that way, to the parents. \n\nSome people are excellent with siblings like that and dearly love them, some hate them and the situation they had to grow up with (read other posts) and there are so very many more that are in the spectrum in between. You just sound pissed off at the brother that he is not more interested, and loving about his sister. How he feels about his sister is not something YOU get to dictate. It is feelings HE has because of what HE had to go through. You won't know what happened to him. It's nothing he shared and none of your business.    \n\nBut let's recap shall we? He did NOTHING to hurt her. NOTHING. He cared enough about her to call his mom to tell her to pick her up. So no negatives and a positive for calling his mom. Where on earth do you get he is the asshole for this? He even let her stay on his porch. And lets not mention how all this emotional, arguing, fights and being yelled at affected HIM. Because, he doesn't count, to you. Only someone that he had no part in bringing into this world. Someone who, again is NOT his responsibility. \n\nAnd do you HONESTLY believe that if he did do anything that was taking responsibility for her, letting her in, sitting on the porch with her, etc, his mom wouldn't have turned right around and pulled this shit again? Because after what happened that day, I'm pretty sure she isn't going to try to screw over him like this anymore. \n\nHe's 26 years old, living on his own, and his parents are still trying to abuse him. That needed to stop.  \n\n Call the cops and ask them what they would have been able to do if he had let her in, taking responsibility for her in the process.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -5,
          "content": "Honestly what “she’s into baby things, like princesses” suggests to me is toxic masculinity.\n\nThere’s probably some hatred of his sister mixed in there, of course. And neither one makes him look particularly good!",
          "id": 29,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -27,
          "content": "I’d hate to see what he does to his future children if he ever has any and wind up with autism",
          "id": 30,
          "comments": [
            {
              "score": 91,
              "content": "[deleted]",
              "id": 31,
              "comments": [
                {
                  "score": 18,
                  "content": "That’s not resentment, that’s disgust.",
                  "id": 32,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "He doesn’t resent her out of being parentified. He treats her with contempt for being a “baby” and not being “normal”, as though he’s superior to her",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Nope, in this post he specifically says he hates her because of her autistic traits and special interests. That poor girl.",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "That sucks but still his sister can not help she has autism and she has done nothing wrong so for him to take his resentment out on her and leave her outside like that is bullshit to me he’s still an asshole",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 970,
      "content": "ESH. It was wrong for your mother to leave your sister outside. But for you to leave a vulnerable person alone, outside, on a front porch is dangerous and frankly, just very callous and mean. She's your sister. I think you and your family should sit down and talk this out. There are a lot of issues here...",
      "id": 36,
      "comments": [
        {
          "score": 542,
          "content": "What would have OP do? Mom deliberately set up OP as caretaker by guilt and obligation role. And the first time OP lets the sister into the house, mom knows she can do it as often as she wants. \n\nThe only other option I see is calling the police, and that will be a *shitshow*.",
          "id": 37,
          "comments": [
            {
              "score": 411,
              "content": "Like I said, his mom should not have left her there. It was also dangerous. But leaving his sister, a person, on his doorstep is just all kinds of wrong. I understand the predicament, but if she does it again, then call social services. \"I am not equipped to care for my high needs sister, my mom ding dong ditched her and I need help\" that might get his mother to respect his boundaries.",
              "id": 38,
              "comments": [
                {
                  "score": 205,
                  "content": "It’s likely some form of abandonment. Likely mom would get arrested as well. And mom is betting OP won’t go that far.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 49,
                  "content": "Agree with you but his mom forgot the ding and dong.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 310,
              "content": "Calling the police is better than fucking leaving her outside like she’s a fucking animal. The fuck is wrong with you",
              "id": 41,
              "comments": [
                {
                  "score": 91,
                  "content": "Well the options are: call the police and get mom arrested for abandonment, or force mom to return to pick up the sister by not providing care for her (because if you let the sister in the door, you are accepting that you will be providing some level of care).   \n\nPick your poison.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 210,
                      "content": "Nope, leaving a vulnerable person alone because you don’t feel like caring for them isn’t an option. Just like leaving a child alone because you don’t feel like caring for them isn’t an option. Call social services or the police, it’s that simple.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 51,
                      "content": "Just threaten to call the police? That will force mom to pick up the sister.",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 44,
                      "content": "Obviously it’s better not to leave a mentally disabled person outside to face harm regardless.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "He easily could have sat outside with her until mom showed up. She might be 19, but she's clearly not able to be by herself, much less outside where she could run off or get very hurt.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -1,
                      "content": "[Text of original comment deleted for privacy purposes.]",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Cant believe anyone doesnt see it this way. Taking out frustration on what their mom did on the younger sibling... what the fuck. absolutely heartless",
                  "id": 48,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 61,
              "content": "Thats really what he should have done though, the police or Adult Protection. Mom needs to get in the system so she can get the services she needs for her daughter.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "What would have happened if his sister wandered off the porch and got hit by a car? Then both OP and his mom would have been in trouble with the police. But it seems like neither think of her as being a person and used her in their war against each other. ESH",
              "id": 50,
              "comments": [
                {
                  "score": 8,
                  "content": "I’m seeing carer burnout.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Not leave his sister on the porch. Drive her to Dad's job and drop her off there. Leaving her on the porch? Not acceptable. She is a human being, his sister no less, who needs assistance. \n\nI have a younger brother with IDD and have worked in this field a good chunk of my life. This family needs to get it's shit together. OP is YAH, not because he doesn't want to watch his sister, but due to his contempt for, and lack of basic care for another person. She sat out there until she had a bathroom accident! And her family did this to her. \n\nDad is on the hook her too. They all suck and should be hotlined.",
              "id": 52,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 25,
              "content": "Calling the police would be better than the shit show that happened, and that would prevent it from happening again.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Should have told the mom that if she didn’t come back, he was calling the cops on her. I’ve heard that works a lot of the time when inconsiderate a-holes do this type of thing.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I don’t know where OP is located, but in the US there’s a service similar to CPS for adults who live with guardians. Calling them and reporting the abandonment after letting his sister inside would be the non asshole thing to do while making sure it doesn’t happen again. ESH.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Thats exactly what he should have done, or adult protective services. The real shit show would be if she walked in front of a car or got taken advantage of because her entire family are dicks. In what world is leaving an extremely vulnerable woman on the porch alone for hours a better option than literally doing anything",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "How is that where your mind is? \"Oh he's showing he's not a pushover.\" Seriously? That's the biggest issue here, winning a bet?",
              "id": 57,
              "comments": [
                {
                  "score": 1,
                  "content": "Retaining his autonomy.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 66,
          "content": "I'm surprised at all the NTA's on here. Like can we at least acknowledge that what he did was wrong and dangerous. Like I literally can't stand kids but if I saw an unaccompanied toddler wandering around my front yard I wouldn't just ignore it because I never signed up to take care of it, hell if I saw an unaccompanied DOG on my porch I would't ignore the poor thing. What would OP have said if his sister had gotten injured or wandered into the street and been killed or something - \"I never agreed to watch her\". Leaving a vulnerable adult alone because you don't want to take care of them is never an option.",
          "id": 59,
          "comments": [
            {
              "score": 37,
              "content": "Don’t be surprised.  This site is full of people who want nothing to do with people with autism, people with disabilities, other people’s kids.  It’s shocking sometimes how poorly many people are willing to treat vulnerable populations, but not surprising anymore.  It’s acceptable to hate on them.  It’s acceptable to leave them unattended outside in possibly dangerous situations.  So many bad things could have happened to sister in this instance, but they just shrug and say not OP’s problem.",
              "id": 60,
              "comments": [
                {
                  "score": 24,
                  "content": "Yeah it’s really fucking scary how callous people are. OPs mom is the asshole but so it OP.  The sister didn’t do anything.  He could have sat with her and honestly he should have called the child abuse/vulnerable persons abuse hotline.  They could have offered services like group homes, adult day programs, so they parents could live their lives.  Leaving her out there like that is just so so terrible.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yeah but that would result in OPs mum getting in trouble for abusing a vulnerable person. Far easier said than done, not many people want to call the police on their own parents, especially if they have no problems other than this specific situation.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "A lot of these stories leave out the other twenty years of history. Like growing up the forgotten child (or the third parent) because the other sibling *needs* all of the attention. So when they finally manage to move out and get free of the situation, they work very hard to not get sucked back into it.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 11,
                      "content": "OP isn’t wrong for not wanting to get sucked back in.  They aren’t wrong for not wanting to care for their sister on their day off.  I’m not arguing that point at all.  But the way he describes her is so mean and condescending.  She didn’t choose to be this and she can’t be anything different, but he can choose how he talks about her.  Nothing that’s happened in his life is her fault.  It’s 100% his parents fault for how they handled things.\n\nThis was my life, being the third parent, the disabled child requiring all of the attention, me being responsible for the other non disabled sibling.  I got my drivers license 2 years early because of my disabled sibling.  I absolutely understand what it feels like fighting battles for a sibling, being ignored and excluded by everyone (because being inclusive is so hard apparently), having resentments.  But I don’t talk about my disabled sibling so meanly.  But I was talking about people who have never lived it who act as though they’re being personally burdened by a disabled person daring to live in the same city or neighborhood sometimes.  People are straight up nasty about people with disabilities, as though it’s their choice or fault for being born that way.  The comments people make while we’re in public are terrible.  People constantly say she shouldn’t be allowed in public when all she’s doing is sitting in her wheelchair (wearing her mask by the way) quietly with her comfort toy in her hand.  Her very existence offends them.  There are a lot of people on these forums who believe the same way.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "It’s fucking scary. That poor girl.",
              "id": 65,
              "comments": [
                {
                  "score": 0,
                  "content": "It's more fucking scary how many sociopaths on reddit think it was perfectly reasonable for OP to leave his severely disabled sister outside like a fucking animal to teach mom a lesson. Like ESH I get behind but all these unfeeling fucks telling OP he was NTA. I can't even.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 1,
                      "content": "It’s hard to even read, honestly. I can’t imagine having that little care for someone, god forbid my own sister. The mom is clearly in the wrong for doing it in the first place, but the second he decided to leave her there all alone for hours to defecate in her pants he became an asshole. Not to mention the way he talks about his sister in the first place. What a piece of work.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "For real. And I wonder how many people saying N T A now would be saying that if this story was about a puppy instead of an autistic teen.",
              "id": 68,
              "comments": [
                {
                  "score": 3,
                  "content": "but we're not seeing the bigger picture here! OPs parents probably ran an animal shelter or raised guid dogs and all their time and energy went into the dogs and as a child he had to walk and feed them every single day so now it's perfectly reasonable not to want anything to do with them and abandoning a puppy on a porch was the only way to get his point across.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 5,
                      "content": "It’s only reasonable that he set a precedent here and now by allowing this puppy to run into traffic and get hit by a school bus.",
                      "id": 70,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "ESH.  It wasn't just wrong of the mom to leave her child there but what she did was also dangerous, callous, and mean.  What if he didn't get out of bed until hours later. His parents need to pay for a care giver.  He warned her not to do it.  If his parents didn't know, they now know not to do it again.  He could have watch her and warned them not to do it again.  But would they have listened?",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Sure she’s Op’s sister but she is the mother’s responsibility not his. She dumped/abandoned her daughter and assumed OP would just look after her on his only day off. He had already said no numerous times. It doesn’t matter what his reasons were for his “no” but is was NO. The mother ignored and she dumped the daughter. This is all on her.\n\nI am surprised the police weren’t called for the mother abandoning the daughter like that.\n\nOP is NTA. He has had to grow up with a household focussed on and about the autistic through no fault of his own. He is grown and living on his own.",
          "id": 72,
          "comments": [
            {
              "score": 25,
              "content": "The OP leaving her on the porch alone is still makes him an asshole. It's not the sister's fault her mother acted in a negligent manner. The sister could have gotten seriously hurt.\n\nHe could have at least stepped outside and kept an eye on her until mom or dad (or the cops if he wants to go that route) arrived. \n\nESH (except the sister)",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "He would have been NTA if he did call the police because at least he was acting to ensure her safety. Leaving her alone without lifting a finger to call someone makes him the asshole. If she has wandered off and gotten killed or raped it would have been his fault as much as his mothers for knowing she was at risk and knowing his mom had abandoned her and turning away. It’s the same as people who see kids being abused and do nothing because its not their business and not their responsibility.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "But he’s happy to live in a house payed for by mum and dad? He can’t have it both ways. He does owe them, and while this is not the way he wishes to repay their generosity (he would rather watch Netflix and smoke weed), he needs to offer something in return or begin living more independently and pay his own bills. Hands up who’s parents pay for your house and expect nothing in return?",
              "id": 75,
              "comments": [
                {
                  "score": 2,
                  "content": "Not arguing with you, where does it say parents are paying?",
                  "id": 76,
                  "comments": [
                    {
                      "score": 2,
                      "content": "You’re all good. It’s in the short explanation if you look at judgement bot first comment.",
                      "id": 77,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "His mom left her alone on the porch",
          "id": 78,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "Nope. OP already said no, repeatedly. I would have called the authorities in that situation. And that goes for anyone. He didn't decide to have another sibling. The parents are TA for not taking care of their kid.",
          "id": 79,
          "comments": [
            {
              "score": 27,
              "content": "OPs mom being an asshole doesn't negate the fact that he left a vulnerable child outside alone. Makes him an asshole too",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -1,
          "content": "Do you take in every homeless person you pass by? They are potentially just as vulnerable",
          "id": 81,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 688,
      "content": "ESH\n\nYour mom sucks because she just dropped off your sister after you said you were not going to watch her twice, thus disrespecting your wishes.\n\nYou suck because you left your sister out on the porch for a long amount of time where anything could've happened to her. I understand you didnt want to watch your sister because it was your day off, but to leave her outside like that is cold blooded.\n\nYall need to have a discussion as a family, because your sister doesn't deserve this.",
      "id": 82,
      "comments": [
        {
          "score": 187,
          "content": "I agree. What was OP doing? Could have called CPS or done SOMETHING...\n\nESH 100%",
          "id": 83,
          "comments": [
            {
              "score": 172,
              "content": "Totally agree but the sister is 19 so Adult Protective Services is more appropriate. Cps can’t do anything for them.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Something surely! There are multi level of crappiness here, at the centre is a girl who is in no way at fault for her family’s inability to act like adults. I get that if he had let her in his mother would have continued to pull this stunt, but the coldness of his reaction…",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "[removed]",
          "id": 86,
          "comments": [
            {
              "score": 23,
              "content": "Neither the cops nor APS will respond if OP takes Sister into his house because there is no neglect. If he is going to leave her on the porch, the cops will be a much quicker response time in most places.",
              "id": 87,
              "comments": [
                {
                  "score": 2,
                  "content": "But he didn’t make that call, so the response time is moot.",
                  "id": 88,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": -1,
                  "content": "If drug use renders him unable to care for his sister, then inside or out, surely that’s still neglect?",
                  "id": 89,
                  "comments": [
                    {
                      "score": 3,
                      "content": "OP mentioned plans to smoke that day. If he took Sister into his care, and *then* smoked, it would be he who would be on the chopping block in any neglect matter.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 406,
      "content": "ESH. I couldn't imagine how scared I'd be if my mom AND sibling did that to me.",
      "id": 91,
      "comments": [
        {
          "score": 55,
          "content": "Exactly. No wonder she shit her pants!  He’s an effing  d*ck!",
          "id": 92,
          "comments": [
            {
              "score": 2,
              "content": "His mom is way worse.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "This.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 317,
      "content": "ESH. Wtf were you doing?!? You could have called the police and let cps or whoever addresses that handle things. It's not in anyway different than leaving a very young child out there.",
      "id": 95,
      "comments": [
        {
          "score": 50,
          "content": "WTF is CPS gonna do with 19 year old",
          "id": 96,
          "comments": [
            {
              "score": 83,
              "content": "I dont believe CPS would do anything. I think most states have Adult protective services that would be able to help.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "Direct him to the appropriate people to call? \n\nYou make it sound like they’re just going to say “nope, sorry” and hang up on him.",
              "id": 98,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 263,
      "content": "Esh.\nLeaving your sister on the porch was cold.  It wasn't her fault her mom ditched her at your doorstep.  She could have run into traffic or something equally terrible.  If you didn't want to let her in the house, the least you could have done was waited on the porch with her until your mom came back.\nAlso the way you talk about her is terrible.  Your apathy towards her is heartbreaking.",
      "id": 99,
      "comments": [
        {
          "score": 50,
          "content": "Or called the police/adult version of CPS to report his mother for abandoning his sister.",
          "id": 100,
          "comments": [
            {
              "score": 5,
              "content": "What’s he going to say when the cops show up and knock on his door and when he opens it a cloud of dope smoke engulfs the attending officers?",
              "id": 101,
              "comments": [
                {
                  "score": 7,
                  "content": "1. It could very well be legal where he is. \n2. Scent is not probable cause — as long as it’s not in plain sight, they can’t do jack unless he lets them search the place.",
                  "id": 102,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Definitely don't agree with letting the sister alone on tbe porch, but come on this is reddit! OP can be honest about the feelings he has towards his sister. It's verry hard to have an sibling with an mental disorder. OP shouldn't be shamed for the way he feels about her.",
          "id": 103,
          "comments": [
            {
              "score": 17,
              "content": "He left someone severely mentally impaired on his porch alone.  Anything could have happened to her.  This is beyond it being tough to handle a sibling with a profound disability.. its blatant apathy for her well being and treating her as less than.  \nIf someone with her complex needs was dropped at my door, I would at least keep them company and out of danger until someone came to retrieve them.  I would do the same for a dog or a hamster or a pet snake.  It's called being a good person.",
              "id": 104,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "Ehhhh OP’s description of his sister doesn’t really leave me with the warm fuzzies. \n\nI can understand why he’d resent the situation, but borderline insulting her for something she can’t help is something he could use to work on. He should be shamed a bit for how he talks about her.",
              "id": 105,
              "comments": [
                {
                  "score": 8,
                  "content": ">OP’s description of his sister doesn’t really leave me with the warm fuzzies. \n\n\nIt doesn't have to. It's real life not a TV show. He is entitled to his feelings. He has every right to choose who he does and doesn't want to have a relationship platonic or otherwise. Bring blood related doesn't factor.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 9,
                      "content": "He’s got every right to have a relationship with whoever he wants. \n\nInsulting autistic people for being autistic is still skeezy.",
                      "id": 107,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "He should. Finding autistic people disgusting for their autistic traits is shameful. Sorry, since when is Reddit a judgment free zone. Fuck this guy and his mom.",
              "id": 108,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -15,
          "content": ">waited on the porch with her\n\nAnd what? Miss his entire day off?",
          "id": 109,
          "comments": [
            {
              "score": 12,
              "content": "Because his day off was more important then his sister's safety?",
              "id": 110,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Dude, I get that he wanted to enjoy his day off. But leaving your sister outside, who is much more vulnerable nonetheless, is a dick move on all levels. Yes it was wrong of his mom to just abandon her child like that, but the very least he could have done was sit outside with his sister or invited her in until either parent, or both, came to pick her up.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "It’s 2021, what about letting her watch movies on his phone, or watching his movies while he sits out with her?",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "And smoke his weed in PUBLIC? Nooooooo!",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "God forbid.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 213,
      "content": "Only person I feel sorry for is your sister because she got parents who dump her off to a relative who don’t give a shit about her either… she needs better people in her life and you left her out there… that’s your sister man… let’s hope  you don’t ever have children that turn out like her.. hate to think what you’d do then",
      "id": 115,
      "comments": [
        {
          "score": 76,
          "content": "It's not his responsibility to take care of her. He also doesn't have to be part of her life if he doesn't want to just because they're related.",
          "id": 116,
          "comments": [
            {
              "score": 76,
              "content": "Regardless of relationship or not, letting a fellow human being that you know requires special care stand on a porch for hours and doing nothing about it is enough to cast the ESH verdict here. Seriously, who does that?",
              "id": 117,
              "comments": [
                {
                  "score": 51,
                  "content": "Oh I agree with you. He shouldn't have left her out there all day.\n\nBut to everybody thinking that just because it's his sister that he somehow is responsible for her just because of that reason? Nah. Don't think so. If he doesn't want to deal with her, then he doesn't have to that's his right. But that said I don't agree with how the situation was handled.\n\nIt really sucks being forced to deal with people you don't want to be around. Surely you've been forced to have to endure someone you want no part of, and as a grown adult it is his choice who he does and does not spend his time with. \n\nIf it was me, and I didn't want to deal with her, which I totally understand him not wanting to do, I would have just brought her inside, had her sit on the couch and told her to sit tight, someone will be here to get her shortly. And then I would have called the cops.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "I mean....sure he doesn't have to be a part of any family members lives but seeing that she hasn't done a single thing wrong against him what reason does he truly have to not want her in his life other than the fact that she's Autistic...and if you're about to say being autistic is a valid reason to not want to be a part of someone's life I'm just gonna have you delete your reply and go try to learn some empathy so you can see mentally handicapped individuals as the humans they are.",
              "id": 119,
              "comments": [
                {
                  "score": 78,
                  "content": "I'm sorry that that offends you, but he's perfectly within his right to not want to deal with that. I'm not saying it was okay for him to leave his sister out on the porch, but I am saying it's perfectly acceptable for him to not want to deal with her.",
                  "id": 120,
                  "comments": [
                    {
                      "score": -8,
                      "content": "ah yeah that's why we're all hanging out on the \"am i within my rights\" sub",
                      "id": 121,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -48,
                      "content": "Lol acceptable to who exactly? He's her brother...and he obviously thinks less of her purely because of her autism...how is any of this acceptable at all? How shitty of a human do you have to be to think his actions and obvious opinions are acceptable?",
                      "id": 122,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "*\"if you're about to say being autistic is a valid reason to not want to*   \n*be a part of someone's life I'm just gonna have you delete your reply*   \n*and go try to learn some empathy so you can see mentally handicapped*   \n*individuals as the humans they are.\"*\n\nI understand the emotion involved and agree the OP should have contacted the authorities once it was clear the parents wouldn't return immediately, but this is wrong.  Outside of certain parental relationships, the freedom of association in one's personal life is absolute.  I'm not qualified to tell anyone who they must or must not associate with and absolutely NO ONE's qualified to tell me that.  It's your life; only you can choose who's in it and for what reasons.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "It was a shitty situation to be thrust into, but he should have called the Police, not let a severely autistic woman, his own sister no less, to stand outside his front door for over 5 hours until she defecated herself.\n\nI hear you in thinking that he doesn't need to maintain a relationship with anyone he doesn't want to, but there is such a thing as moral standards. You wouldn't leave an unknown baby sitting outside your porch for hours on end, would you? \n\nThe fact is that he knows exactly what this girl is suffering from, whether he wants her in his life or not, and still, he chose to do absolutely nothing. I'm sorry but that makes him the AH just as much as his Mother.",
              "id": 124,
              "comments": [
                {
                  "score": 21,
                  "content": "I agree that he shouldn't have left her on the porch. If it was me, I would have brought her inside and sat her on the couch and called the cops. But under no circumstances would I have let her in, and watched her. \n\nPeople in my family have tried to pull that type of shit on me before. I remember once about 15 years ago, when I was newly married to my first wife, I was telling them (both her family and mine at the time) how I really wasn't comfortable around babies, and I did not feel comfortable babysitting. So my ex-wife's mother's solution was to get everybody in the family to abandon me when I was taking a nap, to wake up to the (my ex wifes sisters) baby crying. No one was in the house and I was panicking. Everybody thought it was a great laugh. You know it's not a great laugh? Thrusting people into situations like that, where you be coming unwilling guardian/babysitter against your will. It's infuriating, it's insulting, and it's an injustice to is what it feels like. so I can definitely understand this person being like \"fuck you I'm not doing this\" And leaving her outside as a big fuck you to the mom. I bet leaving her out there in his mind was more of a punishment towards his mother than it was towards his sister, however she was definitely mistreated here.  Especially with them already saying they have a strained relationship with both of those family members, is it really a wonder that he doesn't care? I'm willing to bet the mom has pulled shit like this their entire life.\n\nSo yeah I don't think that she should have been left outside. She's mentally handicapped. She's literally just a victim here. OP should have treated this situation a little better in regards to her.\n\n\nBut I'm also bewildered that so many people here think that just because they're related, that he should somehow be responsible for her out of sympathy or pity or something.",
                  "id": 125,
                  "comments": [
                    {
                      "score": 5,
                      "content": "You know what? I fully hear you. I can understand how awful is it to be hurled into an uncomfortable position of having to look after someone or multiple vulnerable people, especially when you know you just can't handle it, I've been there myself and I fully appreciate the deep sense of dread and anger that comes from being taken advantage of like that.\n\nI do fully hold the Mother accountable for what she did, and she should have charges pressed against her tbh. She knew exactly how her son felt or else she wouldn't have sneakily left her very vulnerable daughter on the front porch without even explaining anything. She deserves anything that comes her way.\n\nThat being said, yeah I still can't fully forgive OP for this - as you said it's very likely he did this out of spite towards the Mother rather than the Sister, but it did lead to a very serious situation where the sister was mistreated because no one seemed to care about what would happen to her. \n\nIt didn't bother me that much that they were related, but the only reason I put weight to that fact is that through them being related, he knew exactly what her condition was, and how vulnerable she was. It's more so the fact that he knew exactly what he was doing and who he was doing it to rather than me lashing out at him purely because he's supposed to be her brother, though I imagine sympathy and pity was what his Mother was banking on when she abandoned her there in the first place.\n\nAll in all, this is an awful situation and that family has a lot to answer for.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "Yeah, and it's not my responsibility to take care of a lost toddler abandoned in a park, but I'm not just gonna walk past the baby screaming \"SUX TO BE U, KID\" and go about my day. \n\nSometimes life hands you shit you didn't sign up for. You have to learn to deal with it like a reasonable, responsible adult, even if it temporarily inconveniences you, or isn't exactly what you want to be doing this second. And being a reasonable, responsible adult is not ignoring your profoundly disabled sister your asshole mom dumped on your porch in the middle of summer.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 189,
      "content": "NTA. Everyone is busy reaming out a grown man for not wanting to babysit his sister? I won’t add to the verbal machine-gun fire he’s already suffered, but I will say that the much, much bigger AH is the mother. She has no right to manipulate her son into being “temp daddy” just because he lives close enough to be manipulated. He said no twice, as a grown man has a right to do; plus, he’s being honest about finding it difficult to take care of her (which would be true a lot of these judgmental people too, but they’re too busy polishing their halos to admit it). Mama wants a break from the daughter too and this time forces her on her own son! OK, he wasn’t a saint about it, but his sister has been used to trap him and anyone would resent that. Mom wants everyone to think he’s an AH and you’re all falling for it. You’d change your tune pretty quick if you had to take the brother’s place.\n\nBrother, move away from these people so they can’t play games with you. Visit your family only on terms everyone agrees to. Healthy relationships shouldn’t include entrapment and name-calling.",
      "id": 128,
      "comments": [
        {
          "score": 141,
          "content": "I also felt very uncomfortable reading the post - especially as it sounds like his mother expected him to change her pants and attend to her toileting.\n\nIt sounds like the family really need respite carers and they shouldn't be forcing him to care for his sister.\n\nHe's an adult and he can refuse to watch her or care for her.  It sounds like he has been parentified.\n\nI think that OP was in a no-win situation.  Ideally what he needs to do is move away from his family and go low or no contact.  \n\nYour sister is your parent's responsibility and not yours.  You said no multiple times, I suggest that you should have called your mother - told her she had 10 minutes to get there before the police were called.",
          "id": 129,
          "comments": [
            {
              "score": 42,
              "content": "He’s not going to go LC or NC because his parents are paying for the house he refuses to let his sister in (it’s in the not answer).",
              "id": 130,
              "comments": [
                {
                  "score": 30,
                  "content": "Ideally he needs to get away from that situation too.  Parents sometimes try and keep you beholden to them with financial ties - like this house.\n\nHe needs to escape this situation.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 36,
              "content": "I know people hate people who say they can't and won't deal with this stuff, but I get it. I really couldn't care for a high needs disabled person, and I say that as a person with disabilities (just nowhere near this level). I'd feel stressed, sick, exhausted and on the verge of wanting to jump out a window if forced into such a situation (granted I have pain and sensitivity issues, but I think emotional inabilities to cope are just as valid for people). I can only stand the noise and mess of my gorgeous adorable niece for a few hours at a time, and I love her greatly, and I then needs hours of rest. \n\nSome people can't cope with this stuff, although I think there's a big element of dislike and/or detachment in OPs case too. He clearly doesn't love his sister, but that doesn't necessarily make him an AH either. We don't know how things were in the family growing up, and him never developing a positive attachment to her may be understandable depending on that.\n\nI would've threaten the mother that she had to return immediately though, or the authorities would be called if she wasn't back within 30 minutes. I would've gone out to ensure sister was fine to, and waited with her at least.",
              "id": 132,
              "comments": [
                {
                  "score": 20,
                  "content": "He’s not TA for not wanting to care for her.  He is TA for how he talks about her and how he left her on the porch for an unknown length of time, unsupervised in a sitation where anything could happen to her.  Do you know how often nonverbal disabled women are assaulted?  The statstics are horrifying.  He left his defenseless sister open to so many awful things.  Horrific nightmarish things.  Put yourself in sister’s shoes for a minute.  She doesn’t understand what’s happening, and is left alone long enough to have an accident.\n\nHe didn’t call the police or APS because (somewhere in a comment he says) that his parents pay his rent or something.  I hope they stop and just cut ties with each other.  It’s hard to know for sure about dad, but OP and mom are toxic awful people.\n\nHis mom is a million times worse, I have nothing nice to say about her and the things I want to say are not civil.  She should face neglect charges at a minimum.  There should be an APS investigation because if she does this, I’m sure there are other things going on as well.",
                  "id": 133,
                  "comments": [
                    {
                      "score": 4,
                      "content": "His Dad has responsibility here as well. Take her to him.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I think you are being unfair to OP, you don't know what his journey has been.  I can imagine that a sibling like this would have resulted in a lot of things that OP couldn't do as the sister's needs were always prioritised.  He may have also had to watch his sibling on multiple occasions previously and been parentified.  I've been through phases where I have felt like he has towards some of my family members.\n\nI grew up with a couple of profoundly disabled relatives.  My brother also was disabled.  My family would have never dumped them on my doorstep.  The profoundly disabled relatives had care homes sorted out for adulthood.  I've visited them and we used to have them home for family events/weekend.  \n\nI remember once my sibling wasn't supervised by my parents and he drew all over my walls, ruined many of my clothes and my possessions.  Many normal childhood experiences were altered because he wouldn't cope or had to be removed because he was chucking a tantrum.  Many experiences were stressful and I would often have major life moments altered because my sibling's needs would trump mine.  For example I had birthday cakes wrecked before childhood parties and I was just supposed to roll with it because he was \"special\".  He'd want to interrupt and participate in things which didn't involve him and my parents would struggle to get someone to watch him.  It isn't easy growing up with a sibling like this and quite frankly I don't blame OP for feeling the way he does.  Is he supposed to accept his sibling being dumped on him forever?  What about when he has a partner? What about when he has his own children?\n\nThe experience of trying to follow a very active person around and take stuff off them or prevent them from touching or destroying stuff is not fun.  Neither are the tantrums when people are fully grown.  I am half the size of my brother and I have been assaulted by him too many times to count.  Eventually you just get sick of being punched and think I'm not subjecting my kids and family to this.  Yes disabled people are vulnerable to assault, but you don't know how destructive OP's sibling might be.  One of my female relatives had broken a carer's jaw before, so my family were always careful.  I also had the experience as a child of being \"cuddled\" by one of my cousins for 30 minutes while my family tried to convince her to let me go.    They had to wait for her to get bored of me, it was a terrifying experience.  My point is that it is not just watching, like you would do with children, it is an exhausting experience of moving things out of reach, locking things up, toileting, cleaning up after they make a mess and dealing with tantrums when they don't get what they want (think assault, property damage, mess).  \n\nHis mother created this situation, he demanded she fix it, she refused.  She is the one who left the sibling on the porch without an agreement for supervision.  His mother put her at risk of being assaulted and not properly supervised, not OP.  She ignored the requests to pick her up and didn't come for 4 hours.  If what she had to do was really important then OP's father should have taken time off work.  \n\nOP's parents need to sort out their own solution.  My advice to OP is to remove himself completely as an option for the family.  This will likely mean moving a few hundred km away or getting housemates (then you can say the home environment isn't suitable).",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Yeah all these people with y t a or e s h saying that they don’t like how he speaks about the sister or that it’s his fault that she had an accident in her trousers seem to miss the fact that it was a factual  description of her behaviour ie she stims and drools like how did they want him to describe these things other than in plain terms?  And that as the sister wasn’t able to control her bowels or indicate that she needed to use the bathroom she pooed in her underwear. This means that he would have to attend to intimate care as well as the personal care that is involved when a person is drooling. And I think most people here are lying to themselves and us if they say that if someone was dumped on their doorstep they would be more than happy to do that kind of work. Nta",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Brother can't move away. His parents pay his rent for him. Which is probably why mom felt entitled to have him watch his sister for 5 hours.",
          "id": 137,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 135,
      "content": "ESH,   \nyour mother is a shit show\n\n  \nyou left a human on your porch for hours, did you at least give sister water. did you check on her (via window), probably not   \n\n\nyour father to come get her (yes he would have had to leave work) social services or the police should have been called period you should not have been left with sister and  when she was ditched you should not have left her outside .....between weather, the possibility of her wondering off, or even getting abducted",
      "id": 138,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 121,
      "content": "NTA - If she tries this stunt again, you may have to call the police “I had a person left on my porch”",
      "id": 139,
      "comments": [
        {
          "score": 82,
          "content": "Mom is defiantly TA cause what if OP wasn't home? Even if his car was there, doesn't mean someone didn't pick him up to do something or even went for a long walk.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "Cops have a terrible track record with how they treat people with disabilities. Calling the cops could have made things so much worse for her.",
          "id": 141,
          "comments": [
            {
              "score": -14,
              "content": "The cops would've got some sort of medical or protective service involved.",
              "id": 142,
              "comments": [
                {
                  "score": 2,
                  "content": "Or shot her, or beat her up for not following orders",
                  "id": 143,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    }
  ]
}