{
  "post content": "I’m 49m and I have 2 children, Jake (23) and Nikki (17). Their mother and I are divorced. I have full custody and she sends no support. Both of my kids are good kids and good students with good grades.\n\nJake got into his dream school but didn’t get any scholarships. His undergrad school is one of the best school in our part of the country and it’s expensive. I didn’t want him to take out loans and have to carry a debt so I’m paying for his tuition and living expenses. The total cost is roughly $50,000 a year. He’s following in our family tradition and pursuing a career in dentistry (I’m not a dentist but we have about a dozen dentists and oral surgeons in our family). I will also be paying for his dentistry degree. While I know it will be costly, I view this as a good investment as he’ll have a starting salary of about $120,000 as a dentist in our area. If he decides to become an oral surgeon, his starting salary will almost double that figure.\n\nNikki is a senior in HS. Like her brother, she’s a good student and will have a good chance of getting into her dream school but she has a low chance of getting any scholarships. Her dream school is also a very good one located in the middle of a very expensive city. Tuition and living expenses will be roughly $75,000 a year. The problem is that she’s dreamt of being a teacher since she was little and have made it clear she will be an education major because she wants to be a middle school teacher. The other problem is that the salary for middle school teachers in our area is $48,000-$60,000 in our area. I fully realize that she can move and work elsewhere but I can’t imagine there are many middle school teacher in the US making 6 figures. I don’t view paying $300,000+ for a career that tops out at $60,000 as a wise investment. I told my daughter that the state school that’s 2 hours away have a good education program and her instate tuition and living expenses will only be about $20,000 a year. I view paying $80,000 for a teaching degree as a much better investment. \n\nI’ve tried discussing the matter with Nikki but she gets distraught every time I’ve brought it up. She cries and accuses me of favoring Jake and being a sexist which is not true. I told her if she picks a major with a $100,000 starting salary, I’ll gladly pay for her to go to her dream school but there’s no way I’m paying $300,000 for her to be a teacher. Now she’s got family members involved. Some are staying out of it, some agree with me, and some are telling me not to play favorites. \n\nI feel terrible so I’m beginning to doubt myself. Am I wrong?\n\nEdit to answer a recurring question:\n\nI thought I made it clear but apparently I didn’t. I’m not limiting Nikki’s education to $20,000 a year. I told her that’s the max I’m willing to pay for her education degree. I’m more than happy to pay $75,000 a year if she picks another degree that will have a better return. For a while she thought about being a doctor and fell in love with England (we have family there) so I even offered to pay for her to go to Oxford which will be double the cost of her brother’s tuition. But she’s adamant about being a middle school teacher and I’m unwilling to spend $300,000 that I worked hard for on an education degree.\n\nEdit to add: Oxford is hard to get into, I know that she won’t be able to just walk in. I meant for her to apply and if she got in, I’m willing to pay the cost of that school and the expense of living in an expensive country if her degree earning potential warrants that cost.\n\nEdit to answer a recurring question #2:\n\nWhy did I bring up the family tradition? Am I an elitist? Why does it matter?\n\nI brought it up because getting into dental schools and graduating is tough. The reason why we have so many in our family is because we help each other out. The dentists and oral surgeons in the family happily tutor and give valuable internship experiences that would otherwise not be available. People who pursued the dental career in our family have never failed because we don’t allow them to fail. Last semester my brother spent weeks tutoring our niece to prepare her for her state board exam and she passed in one try.",
  "id": 1,
  "comments": [
    {
      "score": 29899,
      "content": "YTA. This whole post reeks of favoritism. I hope the dentist switches to an art major halfway through.",
      "id": 2,
      "comments": [
        {
          "score": 8196,
          "content": "The fact that OP made this post and hadn't considered himself an AH is completely alien to me. I wouldn't like him to be my dad, that's for damn sure.",
          "id": 3,
          "comments": [
            {
              "score": 7114,
              "content": "The fact he didnt even THINK to just offer her the same money was silly. \n\nI personally agree that 300k for a teaching degree is wild, because unless youre at a prestigious school after graduation that sum would eat your salay for a half a decade, and teaching is like nursing- as long as you dont have serious violations and aren't a danger to people around you most districts will have a job for you. \n\nSo yes, a prestigious degree means significantly less outside of prestigious  circles and thats a rarity, but thats still not the point here. He could ALSO could have said that without being TA.\n\n**BUT** in the spirit of fairness he needs to offer both kid equal cuts. It just shows he doesnt think her career is worth the investment or he just favors his son unfairly, possibly both. Make it 40k a year for both of them (you can save up the difference for girl when she starts and he leaves) or whetever you can split of more or less.\n\nAnd as others have said, the return is making your kids have the best QOL not just high paying jobs- if she wants to be a teacher then let her teach.\n\n**EDIT: Yall probably gonna eat me alive, but I want to say it.**\n\nI THINK ITS YTA. HES TA. \n\n**But I also think hes right.**\n\nGrowing up my family was so destitute we had a basement apartment in the bronx (the armpit of nyc for foriegners) where I had so many rats and roaches hiding in and around my house that they would chew on my lips and tongue in my sleep to feed themselves off my dinner. I so frequently got chewed on it was nearly a daily basis, and people thought I had oral herpes because of it.\n\nI was fucking poor. I barely make 40k now and it feels like a dream not to have semi-sick, feverish sleep where i think I'm being eaten alive. 300k as a *sum* sounds comical even now, and likely would have saved my entire generation from poverty if it was **just** spend on college for everyone in my family in the same age group.\n\n300k on a teaching degree, even in New York (high cost of living for foreigners) is 6-7x the average quote you'd get from a decent college around here. Just the difference in that money that he could gift her for a downpayment on an expensive condo here or home, and she'd probably be paying well within her salary to maintain afterward.\n\n*To my eyes*, Its outlandish, wasteful, exorbitant to spend 300k on a degree with a return that low. Even veteran teachers rarely make 6 digits, and if she got a job in an environment where she could work at said prestigious schools, then it'd be worth it cost wise.\n\nBut if you got it, flaunt it. He **can afford it,** he just doesn't want to and thats the part that isn't fair. Because being realistic, she is as likely to get a position there without a networking reference as a kid would to get a scholarship to one of these schools unless shes at the very top of all her classes.\n\nThats for her to determine or for her to achieve. Beyond my judgement.\n\nHe should offer them both the same college funds and post graduate gifts and let them make their financial independence from there. Wash his hands.\n\nIf you don't want to be responsible for her going forward past college, lay the ground work now and hold your son to the same standard. College sum, graduation sum, trust fund, you're on your own after that.\n\nWhat I can't realistically see is her being the kind of person who spends 300k on a degree and suddenly be comfortable subsisting on 55-60k a year for the next decade or however long it takes for a prestigious university to take her in.\n\nI doubt she has and real scope of her lifestyle costs vs earning potential, and in reality I think thats a bigger problem than the 300k. She likely will still be dependent even with that huge cash investment in her \"independence\" and that means paying her a long time.\n\nThis is also beyond my judgement, but the likelihood im wrong is low enough I feel comfortable making the assumption.\n\nSo yes, this is a ton of money for something that doesnt need to be that expensive, and she could use it elsewhere for better purposes, but he should acquiesce and let her forge her own path to success.\n\nTLDR: I hink its a ridiculous sum to spend for what shes getting and the likelihood she will be independently capable to the lifestyle she prefers is **exceptionally low** even if YTA, but you should afford your kids the same opportunities.",
              "id": 4,
              "comments": [
                {
                  "score": 796,
                  "content": "But who cares of the degree pays for itself or not? He’s paying for it anyway.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1422,
                      "content": "I think most people without financial backing would.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1068,
                      "content": "I was wondering about that logic… is he expecting his son to return the $300,000? Why does he need a six figure income of none of it is going to dad? \n\nTo me that’s backwards. If he’s not making his kids repay it makes WAY more sense for him to pay for daughter who would struggle to pay back those loans, than for son who’ll have a career that makes paying loans back simple. \n\nThe problem OP is you’re forgetting that people and plans change. As someone above mentioned, your dentist might end up in art… your daughter might switch to a higher paying major or end up starting a business. \n\nYour generation (and mine) often got a career and stayed in it, but that’s not how things work anymore. You aren’t paying for your daughter to become a teacher whose career caps at $60,000 - you’re paying for your daughter to have the credentials that give her OPTIONS throughout her life. Options your son will naturally have because of his school and type of education and career… but your daughter won’t if you don’t pay to make it happen. \n\nStop acting like it’s YOU that gets a financial return on your investment and invest in your kids (both of them) potential and future opportunities. I imagine you and your life are nothing like you planned at 17, why are you limiting your daughter to the plans her 17 year old self has?",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 190,
                      "content": "Well, he does. He doesn’t think of his money as “free money” to be tossed about without consideration of its value.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 180,
                      "content": "Everyone should care whether or not a degree will actually have a return on investment. Not all degrees are equal. Going to college should be for specific reasons, one of which is will this result in me getting a better job that pays well?\n\nThat's why so many people make the mistake of taking enormous student loans for English literature degrees.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "He cares. It's his money. He's willing to give up a large amount of his money to allow his son to pursue a career that earns a commensurate income. \n\nYou go to school for the degree, not \"the experience\". The investment is worthwhile in the case of his son because it's a high paying degree. It's not worth it for his daughter because she is interested in a low paying degree.\n\nI don't understand how this basic concept of value for money seems to escape people in this thread. He's willing to pay for both his kids to go to school, he just wants the reward to be similar to the investment.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "It is always easy when it is someone else’s money.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "> He’s paying for it anyway.\n\nExcept he's not. Reddit is happy to spend OP's money but he's looking at it as an investment in his kids' futures. One is a good investment, the other is decidedly not.\n\n$300k is probably enough to buy his daughter a house or apartment which might be the much better option. At least that will have value unlike an elite private college degree for a middle school teacher.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "I can't even imagine thinking that's a reasonable opinion. Why should it not matter to him that the money he is spending (on his child) is well spent?\n\nIf both children wanted to buy a house, and\n\n- The first child found a wonderful house for $X; a nice, 3 bedroom colonial.\n- The second child found a cardboard box in a parking lot for the same $X\n\nClearly, it would make sense if the parent decided to help the first one out but not the second... because the second is wasting money. The fact that both children want their choice the same matters, but only to a limit.\n\nTeaching is clearly not a cardboard box. But that doesn't mean it is worthless to consider the value of the intent for the money you are giving to each child.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "A college degree is an investment. The point of an investment is to see it grow. It makes sense to put 300k into being a dentist of doctor or other higher paying field. Like lawyer. You can work in places that pay accordingly. A teacher will never make even close to 300k. And we are only talking about a bachelor degree. It’s a poor investment. \n\nI am a teacher and the field needs a lot of work. It’s just not a profession where this costly degree is even worth it price. OP said she can choose a different path and go to the dream college on him dime. Or she can keep her career choice and go to a state college also on his dime. It’s reasonable. He obviously has a little money and he wants children who will be able to support themselves. He also wants them to make wise investments choices. Daughter needs a dose of reality.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "This has all the nuance of the situation. Yes, it sounds like crummy favoritism to tell one kid you'll fund them fully and the other to put a cap because you don't respect the profession they are choosing. But it is also realistic -- I'm in the age group where were were told to go to college and major in anything because we'd be able to pay off those loans....and we can't. I know so many teachers, librarians, museum workers, etc with huge education costs they'll never pay off.   \n\n\nOP's an A H for framing all of her schooling as a \"return on investment\" but OP's daughter is also an A H for not considering the realities of money in the real world.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I'm a teacher. I think OP is an AH, but I must agree that 300k is insane. I paid 20k for my three degrees (Licentiate, MSc and PhD). As a teacher who loves her job and also had dreams of making a difference, I would say that OP's daughter should be a teacher assistant or a volunteer for a year in a school before she spends that insane amount of money. \n\nEvery day teachers leave the profession and I bet they once also had the dream of making a difference. I don't want to be pessimistic and I really hate that I wrote this because I believe people should follow their dreams. But I think the daughter should speak with other teachers or have some experience in a school before making her decision.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Offering equal money makes sense. His excuse that he doesn't want to saddle the son with debt: actually the son will have a great salary from the beginning and he can pay some debt, the amount he borrows after OP provides a substantial amount. OP, YTA",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I’m a teacher. It’s a waste to spend $300,000 to get a degree to be a teacher if you don’t have plans to teach at a college level. I went to an expensive school and paid for it myself (with scholarships). Guess what? My peers who went to state school got the same job and get paid the same amount. \n\nMaybe the OP expects their kids to pay for his retirement if he invests in their schooling. While I don’t agree with this, it is a cultural thing. At the same time o have no issue with him capping how much he will spend. It’s exorbitantly expensive and won’t help or effect how good she is at her job. The reality is he’s better off investing this money or gifting it when she graduates. Now, I’m not sure about $20k for for years for her, even as a teacher.  That may not be realistic.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 3,
                      "content": ">I’m a teacher. It’s a waste to spend $300,000 to get a degree to be a teacher if you don’t have plans to teach at a college level.\n\nDing ding.\n\nAgain outside our scope to judge but exceptionally unlikely.\n\n>Maybe the OP expects their kids to pay for his retirement if he invests in their schooling.\n\nTheir entire family save her is a surgeon. I think hes fine even if he doesnt have a retirement plan in the works. The big issue IMO is she isnt gonna be living like an upper middle class woman anymore on 60k.\n\nThat, and she will be living like an lower mid class woman the second he cuts her off, and she probably wont tolerate it without a hissy fit or cutting him off in return. \n\nTheres 0 way a trust fund kid just accepts not having access to the fsmily saving when she consciously spends like she does.\n\nHes gonna be taking care of her until shes married even with a 300k degree is the problem. She doesn't have a concept of the amount shes spending vs the usual cost, and already isn't choosing a pucrative field. Her decisions to make, but it wont float her long.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "The thing is, just because she gets a teaching degree does not mean this is where she will remain. Once you have a degree and perhaps some experience, the world is your oyster (pretty much). She could become a professor or a corporate trainer. Lots of $$ in those fields. And anyway….what about his kid just being happy?  Is there too high a price on that?",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Even being at a prestigious school doesn’t matter in terms of pay. My husband has repeatedly been offered teaching jobs at very very exclusive private schools. \n\nHe has a hard science PhD. So he’s wildly qualified. The pay is less than $50k a year. For a K-12 school that students pay roughly $50k a year to attend. They pay the teachers like shit. He laughed at the woman who offered him the job. Like why would anyone work for you ??",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "He is right. It’s all over the news all the time about how little teachers get paid. He’d end up paying for all the school plus helping her out financially when she’s out and working because she won’t make enough to live on. NTA. My family was full of teachers 🤷🏻‍♀️",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 496,
              "content": "My dad told me I couldn't get an art degree because it won't make money so I went into IT and he still wouldn't help pay for it. \n\nI went back to school in my 30s, art school, and now have a really nice career that pays really well. \n\nOP, YTA, you are playing favorites and you will lose your daughter.",
              "id": 23,
              "comments": [
                {
                  "score": 167,
                  "content": "I think that what gets me is people assume that liberal arts degrees are automatically going to be low-end. Sears hired a staff of historians and archivists and other old companies are doing similar and it is not low paying by any stretch of the imagination.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Sears is paying really low wages, as in zero....",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 139,
                  "content": "You're a massive outlier in the art degree world.  In both cases (art and edu) people should look at median outcomes, not outliers like yourself.  The dad is TA and also right.\n\nEDIT: ONE MORE ANECDOTE ABOUT PEOPLE WHO MAKE MORE.THAN THE MEDIAN OUTCOME AND I WILL LOSE MY MIND",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "My daughter went to college. She did her first two years pursuing her art degree and finished the last two years with a business degree. Her intent was to be a self-employed artist and she is. She makes way more money than I do.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Right? He’s told his daughter that her dreams aren’t worthwhile but his son’s are, and either she can settle for a school she’s not wanting to attend or pick a major she’s not wanting to go into. Meanwhile, his son is getting shit paid for beyond just a four year degree. I sincerely want to know what happens when daddy’s pwecious wittle boy can’t cut it and drops out or fails out. Is he going to have to pay back the “investment” daddy made?",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 947,
          "content": ">He’s following in our family tradition and pursuing a career in dentistry (I’m not a dentist but we have about a dozen dentists and oral surgeons in our family)\n\nWanted to piggy back off the top comment to point this out. The \"family business\" that he himself didn't go into.",
          "id": 29,
          "comments": [
            {
              "score": 334,
              "content": "Ultimately it's a bunch of irrelevant BS, since it's not a family business and there has never been any expectation of following \"tradition\". It's not a pertinent point, yet it evidently weighs on OP's mind, possibly leading to bias.",
              "id": 30,
              "comments": [
                {
                  "score": 112,
                  "content": "It’s not pertinent but the fact his son can make bank in  dentistry is a huge factor for OP. It doesn’t make any sense to pay $75k/year for a teaching degree.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 86,
                  "content": "Yeah he sees it as the family business or tradition which is odd since he didn't pursue it himself.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I don't find that too odd.  I have friends with military family traditions that didn't join because they got scholarships, didn't want to wait 6-8 years to start college, etc, but still view it as a family tradition.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Or maybe he did and washed out. That could play into his bias.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "I think people are looking at the \"family business\" comment strangely.\n\nThe way I interpret is that spending 300k on son's dental degree will be less risky BECAUSE there's a family history of dentistry, which means son will have lots of familial support when starting out.  Hell, some of them may offer for him to work/partner at their practices, potentially inherit their practices, etc.  \n\nTeaching doesn't really work that way.  A teacher doesn't \"take over the family practice.\"  Having a family member already working in a district MAY help work there, but because it's a public institution run by the government and not by private individuals, there's simply not the same opportunity for daughter to take advantage of \"home cooking\" when it comes to her preferred occupation.  \n\nIt's actually an incredibly relevant point.  Son's degree will be more expensive, but due to the family connection, he's simply going to have more direct support and opportunities as a result.  After she graduates, daughter is going to be just another brick in the wall looking for a teaching job.  She's going to start out at the same low starting-teacher pay as everyone else (since school districts generally pay based on experience and depth of credentials).",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Or that the son could possibly work with family fresh out of uni, or that it means he knows the career and salary progression of dentistry.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 468,
          "content": "THIS. Come on dad. You're explanatin doesnt make much sense. I mean why pay off son's education when he has a good shot of earning a great salary and he can pay off his debt himself? THAT's why many people go to high paying careers in the US, so they'll be able to pay off student loans. Your daughter will have a much more difficult time with this! Be fair - either pay for both kids to go to their dream college or neither of them. YTA",
          "id": 37,
          "comments": [
            {
              "score": 78,
              "content": ">either pay for both kids to go to their dream college or neither of them.\n\nJust to add : Let’s not forget how op also pays the son’s living expenses too.",
              "id": 38,
              "comments": [
                {
                  "score": 13,
                  "content": "The reason his kids can't get financial aid is because OP has more than enough money.\n\nEdit: autocorrect is me frenemy",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "*status*",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Late to the party\n\nI honestly wouldn't be surprised if one day he comes back to Reddit wondering why he's never met the person his daughter married or the children that they have together, meanwhile Nikki is out living her best life as a teacher in a state as far from her father as she can get.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 399,
          "content": "OP would rather his daughter made money than for her to do something that makes her happy. \n\nMiserable but making money is fine.\n\nTeaching the next generations is a no no.\n\n…\n\nYTA, OP.",
          "id": 42,
          "comments": [
            {
              "score": 185,
              "content": "Viewing children and their education as a ROI proposition, as opposed to supporting them and their happiness, is a surefire way to get cut out of their lives once they no longer get or no longer need that financial support.\n\nIt sounds like OP *has the money* and is simply saying that their daughter’s chosen career isn’t lucrative enough to justify tuition at a good school, rather than someone telling their child “I can’t afford it”, so it’s basically “if only you wanted to be a quant or a consultant, you’d be worth supporting, but unfortunately you have a passion for teaching and that’s worthless”.\n\nOP is absolutely TA here, and I hope some day they realize how destructive to relationships with their children this transactional, not to mention preferential, view is.",
              "id": 43,
              "comments": [
                {
                  "score": 18,
                  "content": "Honestly, more people should view education as an ROI proposition. OP is the AH for creating a disparity amongst his children, but I agree with OP. What OP should've done is had his older child go to the state school as well. In my state, the flagship state school has one of the best medical and dentistry schools in the state, and it's competitive nationally as well.  \n\n\nOr, you know, have both children take some loans... then they can do whatever major they want and deal with the loan payments if there's a cost:return imbalance.",
                  "id": 44,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Yeah, but the same degree is available for cheaper and he is willing to spend the money on the cheaper version. She will get the same return whether she gets the cheaper degree or the expensive one. I think op should offer to pay the difference towards housing or something to make it fair, but I believe he is reasonable here.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "><<so basically>>  \n>  \n>OP outright Said <<I told her if she picks a major with a $100,000 starting salary, I’ll gladly pay for her to go to her dream school >>    \nSo he doesn't give a care what she goes into as long as it's one he perceives as having enough money/status.  \n>  \n>I agree-OP should give both kids the same money.  The one who suggested, that she consider a more reasonably priced university and use some of the money to invest in rentals had a good idea--that would give her choice(and if she chooses to invest--it would provide her a supplemental income that would increase her yearly income).",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "But he's not saying she can't be a teacher, he's saying there's a cap on how much he'll pay for the teaching degree. I think the cap should be equal to what he's paying for son's school, but a cap is reasonable.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "So OP should just fund her terrible financial decision in full?",
              "id": 48,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Paying more for the same product is ridiculous because it's going to do absolutely nothing for her. How is it reasonable to pay 4x as much for the same degree with the same career and earnings opportunities? She's not getting any extra pay or access to better job options by having her father pay out the butt. I went to community College for nursing and got out debt free. My peers who went to universities, state or private, paid way more and have the exact same career opportunities and knowledge that I have.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I’d be fine with him making this limit and offering the rest of the money in a trust or a house down payment or smth, because while I have a lot of teachers in the family the reality is that it is not paid well and she’d be drowning in debt if she went to her dream school if she took out loans.\n\nIf she were funding it herself, going would be an incredibly idiotic move because of the debt taken on vs how much she makes.\n\nGoing to a prestigious school isn’t going to magically improve her odds of making good connections or something, because teaching salaries are what they are. He isn’t wrong about that.\n\nIs he still an AH? Yes, but only because he isn’t being realistic and making up the difference in a way that would be incredibly meaningful.\n\nBecause somehow I doubt a daughter that is used to or expects a $75k/year college experience is going to last long in a far more limited income bracket….",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Or just go to a reasonable school for her chosen profession. \n\nI had a teacher who went to Harvard, just to teach high school English. Like why?",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 272,
          "content": "This happened to me. My sister got a boutique college experience. My parents didn’t give me shit. I am in my 40’s now and have never forgiven them. I mean I’ve let it go but my contact with them has been extremely low ever since I moved out. You never quite forget your parents chose a sibling over you.",
          "id": 52,
          "comments": [
            {
              "score": 63,
              "content": "I've forgiven my parents for the same thing. My sibling who went to the fancy private school dropped out and basically ruined his or her own life while I'm okay. Also, therapy. Yup, therapy and schadenfreude. It's a great combo.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "My dad did the same thing to me. He bullied and badgered me out of the major I wanted, out of the schools I wanted, and into exclusively taking out loans to fund my education. I had about $12k in a savings account, but that all went toward room & board, books, and my laptop. On the other hand, he fully paid for my sister to get a degree from one of the top culinary schools in the world, and she doesn't even use it. I still have my loans and no degree, and my in-laws have been helping me through court reporting school for the past two years...",
              "id": 54,
              "comments": [
                {
                  "score": 7,
                  "content": "That’s funny— not funny haha—but my parents acted like the world was ending when I worked my way through a pastry apprenticeship and was working at one of the best bakeries in my city. It wasn’t “respectable enough,” my mom said. I said well then give me money for college. That shut her up. I worked my way through an associate’s degree paying my way and everything I have is through no help from them. I’m not still bitter but it did destroy my relationship with them. \n\nMy sister also doesn’t use her degree and hasn’t worked in 17 years while she stayed home to be with her kids.  I don’t fault anyone who can make that work but what did she need that degree for if all she was going to do was be a full time mom?",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 229,
          "content": "And misogyny cause he's doing the ol' pick the son over the daughter shtick that's been going on for centuries  \nYTA OP, huge AH!",
          "id": 56,
          "comments": [
            {
              "score": 171,
              "content": "My mom did this to me. Lol. My little brother has had literally everything handed to him from birth, and still does.  She is literally handing him a giant house she refurbished, and doesn't see how unequal it all is for her two children. She tells me that I have a house already, but one I paid for myself without a dime from family, solely because I learned at the age of 8 that I was going to be on my own from here on out when my brother was born. She wonders why I am distant with her, and why I seemed so much easier to raise than my brother. Hint: I raised myself.  She let him go out and do whatever he wanted and he had no curfew, but I certainly did.  She paid for his college, she paid for his police training, she paid for his cars, insurance, and is now handing him a house. \nLiterally nothing she has even breathed to offer me. \nThis dad will be surprised when his daughter one day isn't around, and doesn't care about his declining state, and his son has been given a full ride and doesn't know how to do anything for himself, much less care for him.",
              "id": 57,
              "comments": [
                {
                  "score": 21,
                  "content": "... of course your brother decided to be a cop, wishing you strength in the upcoming holidays.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "So, you think he'd pay 300k for a teaching degree for his son, but refuse to fund his daughter's dentistry degree? What evidence do you have to support that claim?",
              "id": 59,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "I don’t agree at all with the misogy, if daughter licked a different degree he would be happy to cover it. Even offered to send her to England, based on his edit. Honesty, I wouldn’t pay $300k for my kid to make $50k either. Would be better off investing that money for them later.",
              "id": 60,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Considering he would have paid for her to study medicine at Oxford, costing more than his son's education, that's one hell of a projected assumption on your part.",
              "id": 61,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Preposterous and unfounded take",
              "id": 62,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "There’s no clear evidence it’s misogyny and not something else.",
              "id": 63,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "The bias here is laughable",
              "id": 64,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Lmao it blows my mind how people like you can see misogyny in literally anything that doesn’t go the females way. He offered to pay for her to go TO OXFORD. He doesn’t believe there is an ROI there and is offering to pay twice as much for something else…it’s not misogyny you potato.",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 128,
          "content": "Op is willing to let one child struggle with debt in order to go to their dream school while the other one does not just because they don’t agree with their career. \nSpeaking about your child’s education like an investment gives off “I am planing for them to take care of me in my future.” \nYou should want to set both children up for success. Regardless of their chooses career path.",
          "id": 66,
          "comments": [
            {
              "score": 11,
              "content": "Traditionally, the daughters are the ones that pick up or are given the job of caring for elderly family members. There is no way this doesn’t come back to OP, unless his son has a saint of wife, willing to take on daughter duty.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "The difference is that, no matter where you go in the US, a dental degree is going to cost a bunch.  \n\nPaying 300k for an education degree is funding the \"I want to go to this university\" dream so that the child can be an alumni of that university, not because the education is going to be $200k more worthwhile than literally any other university in the US for a teaching degree.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "But she doesn’t have to get in debt. She can go to a cheaper school. It’s not like she is going to get paid more as a teacher because she went to an expensive school. Honestly, he is still being generous.",
              "id": 69,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 90,
          "content": "It reminds me of a guy I went to school with. All through high school, he talked about being an anesthesiologist. We ended up at the same university, with him going pre-med. He got so burned half way through and switched his major. He’s been a Spanish teacher for 15 years now and loves it.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "It’s also not always a guarantee that one will pass dentistry school and their boards! OP is definitely the AH. And if he’s so sure about his sons investment and making six figures then he can handle his own debt.",
          "id": 71,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 44,
          "content": "Yes I hope he changes his major to become a teacher",
          "id": 72,
          "comments": [
            {
              "score": 3,
              "content": "$100 says the dad stops paying the tuition at the fancy school if he does.",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8885,
      "content": "YTA.  To be fair, you should at least pay what you are paying for your sons education and let her take out student loans for the rest.",
      "id": 74,
      "comments": [
        {
          "score": 2266,
          "content": "Considering he is also gonna pay for dental school wuth will be over 100,000, her education sill be much cheaper and if this deal is made she wouldnt need loans.\n\nEdit: bc i suck at typing",
          "id": 75,
          "comments": [
            {
              "score": 1481,
              "content": "He's gonna end up paying about a half million dollars for his son to be a dentist.  Even more if he chooses to be an oral surgeon (source:  My BIL is a dentist).",
              "id": 76,
              "comments": [
                {
                  "score": 2252,
                  "content": "And correct me if I'm wrong, but I'm sure getting a dentist degree from a decent state school would be just as acceptable as from a dream school. And at least here, oral surgeons are so in demand, that I doubt he'd need to go to the most expensive school for that either. Dad's explanation literally makes zero sense.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 1149,
                      "content": "This is where the favoritism shows.  He doesn’t apply the same logic to his son regarding state school.",
                      "id": 78,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 185,
                      "content": "School choice undergrad  really does matter for grad school. It’s not the end all be all, but it does help. \n\nSource, went to a decent grad school. Was one of two who didn’t go to an Ivy or well respected state school. My grades and test scores were actually higher than a lot of those, but the random undergrad where I got a 75% scholarship wasn’t “equal” in the admission process.",
                      "id": 79,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 67,
                      "content": "For dental school your undergrad matters, after that not nearly as much.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 125,
                  "content": "Then here's the question: does dad expect compensation once his son graduates? His whole argument is that he won't pay for his daughter's dream school because she won't make that much money. The only logical reasoning for that line of thinking is that he expects the kids to pay him back.",
                  "id": 81,
                  "comments": [
                    {
                      "score": 36,
                      "content": "Right, he must be expecting them to pay him back and didn’t mention it, otherwise it would actually make *more* sense to help the daughter because she’ll have a harder time paying back her student loans.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "No, it is about the value for his money and likely about making his children think about the value of their investments and what one should consider when picking a college. No way in hell would I pay 75k a year for my daughter to go to some private college to be a teacher, not because I don’t value teachers or my daughter, but because there is zero return on the massively increased investment and ultimately my money would be better spent elsewhere. My daughter isn’t likely to get a better teaching job because she went to an Ivy rather than a state school. On the other hand, my daughter actually wants to be a medical researcher. I am considering paying for her to go to a fancier school because her undergrad does play into her future job prospects. Where she goes to undergrad will dictate the research opportunities she has. Those research opportunities will dictate which grad program she gets into. That grad program will dictate what job opportunities are available to her.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "[deleted]",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "I was going to say this. Son's education is going to end up being way more expensive. How he justifies this is beyond me...YTA",
              "id": 85,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "This is one of the big things that tips it over the edge for me. Why not pay for both of their undergraduate degrees instead? If he can afford it, it seems really unfair to pay for the son's two degrees and not the daughter's one.",
              "id": 86,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "A dental degree (depending on where in the US) will be a solid $400k or more. That's not even including this kid's undergrad costs. \n\nOP, if you're seeing this, YTA. You should support your daughter to the best of your ability. Stop trying to shoehorn her into something she doesn't like. Lol I have a science degree for less than what you're paying yearly for your son. It's the same stuff and I'm doing fine. This is 100% some weird favoritism/family pride stuff. \n\nAlso, teachers don't get paid a huge amount (they should!!), but we totally need them. It is a very noble profession. Stop raining on your daughter's parade.\n\nEDIT: This is in response to OP's newest edits. Dude, while I understand that you guys have a very tight-knit family that supports each other, I'm sure your family will support your daughter's decision. If they are as nice as you say, they will help her succeed in any way that they can. On a side note, everyone is saying you're an elitist because you sound like one! Let me re-frame this for you. If the world changed in overnight and now teachers get paid six-figures, you would be all for your daughter's degree. Hell, let's say it all went topsy turvy and dentists/docs didn't get six figures anymore. Would you still be so excited about your son's degree? What are you in this for, hmm? Family pride and return on investment? That's the kind of toxic stuff that causes kids to resent their parents. Stop being like this.",
              "id": 87,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 245,
          "content": "That's what I thought it was going to be, a parent unable to pay for the second child's school because it was more expensive than the first's and they could only pay the same for both.  \n\nInstead we got this AH who looks down on his daughter for not choosing a career that he thinks is lucrative enough despite the fact that society needs teachers and it is a very respectable and secure career.\n\nOP YTA, the biggest one I've read about today, and that is a high bar to beat on this sub",
          "id": 88,
          "comments": [
            {
              "score": 112,
              "content": "Treating kids like investments instead if family members us bizarre. And how is it an investment, is the son gonna pay his pension and his yacht?",
              "id": 89,
              "comments": [
                {
                  "score": 4,
                  "content": "In my country that's the hope (and sometimes spoken expectation), that children should be so grateful for being brought into the world and being given what they've been given by their parents, that they should pay it back. House, medical expenses, vacations, help for siblings, etc.",
                  "id": 90,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": ">Instead we got this AH who looks down on his daughter for not choosing a career that he thinks is lucrative enough despite the fact that society needs teachers and it is a very respectable and secure career.\n\nThe OP is not looking down on his daughter for picking this career. He is stating that picking an expensive city and an expensive school that will cost 300K to get the degree is not an economically sound choice given the salary she will eventually be getting. WTF with responses on this thread.",
              "id": 91,
              "comments": [
                {
                  "score": 26,
                  "content": "Yeah this responses are wild some of them seem like they didn’t even actually read the post. Reddits a crazy place. Nowhere did he say he wouldn’t pay for her education nowhere did he say he expects them to pay him back nowhere did he say he expects them to take care of him when he’s old no he’s not favoring one kid over the other.  I don’t understand the wild assumptions and fake scenarios these commenters keep coming up with. Why are facts so hard for people.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "It's absolutely nuts to me. You can tell how young(or irresponsible, take your pick) people are on this sub. It's either, you gave the son x amount so you have to give the exact same to be fair, or, your a misogynist because you won't pay 300k for your daughter because she's a girl. Like none of them have ever heard the term \"return on investment\". And while most things in parenting shouldn't be dictated by potential financial gains, a college education is on the short list of things that are, imo. You go to college to get a job, or improve your chances of getting one. Teaching your children to consider ROI is a lesson more people should be taught.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 3,
                      "content": "This is so weird to me. Are the children expected to pay the dad back his money are something? There is no ROI involved here. The investment is into a happy future for your kids. It’s not about money. You never know what impact someone can have on the world when they are doing what they love.",
                      "id": 94,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "It should be a respectable and secure career but it is NOT. Very few people actually respect teachers. The lack of power for unions in a lot of states and parents make teaching a hostile work environment. Most good teachers leave the profession in 2-4 years to go make twice the money in other careers. Frankly, most people can make more bartending than teaching and the customers are nicer.",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Teaching is a respectable career but it is not a respected job. Despite what everyone say to make themselves feel good, teacher are underpaid and that will not be changing any time soon. Frankly, paying $300k for a job that makes as much as people without a degree is ridiculous.\n\nThink the OP is a AH, but he is not wrong.",
              "id": 96,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 51,
          "content": "Yes, this right here. Match what you are paying for your son's, and have her take out the rest as a loan.\n\nYTA if you won't help at all, this is a great compromise.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "I second this. THAT is fair. OP yta.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "OP could've said that he is only willing to pay the same for each child's education regardless of career choice without sounding like an AH.",
          "id": 99,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "This would be a decent compromise",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Or let her choose if she wants the money now to go to her dream school or get the money later when she needs it at the start of her career, buy a house etc.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "This.\n\nMake an equal amount of money available to each child and then they are responsible for covering anything beyond that. Daughter might think twice about going to a $75,000/year school if she's going to come out with $100k in debt and a job that only pays $50k.\n\nThat financial limit can be per year or lump sum. If son wants to be a dentist, that degree is really only going to get a good RoR if he can get into dental school. Son might realize that dentistry isn't for him and switch majors.\n\nDaughter can at least get a job as a teacher with her undergrad only. Though many teachers, especially ones who went to undergrad at such a prestigious school, will go onto get master-level degrees.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Nah.  Take college out of it.\n\nWhat if both kids came to him wanted to start their own business? \n\n One has a sound business plan with solid data, proven market interest, etc. and the other has “trust me bro”.  Should OP give them both the same amount of $ for this?",
          "id": 103,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4583,
      "content": "YTA\n\nYou are clearly favouriting your son here, he’s following the family traditions and your happy to take on a load of debt for him but you won’t do the same for your daughter because her career choice is a “problem”\n\nYou’ll only take on debt for your child if they do the careers YOU want them to do. \n\nGo back to your daughter before you lose her",
      "id": 104,
      "comments": [
        {
          "score": 1443,
          "content": "He doesn’t say he’s taking on debt at all. \n\nHe’s considering return-on-investment, as everyone who’s going to college should.",
          "id": 105,
          "comments": [
            {
              "score": 2212,
              "content": "The return investment should be your child’s happiness",
              "id": 106,
              "comments": [
                {
                  "score": 2261,
                  "content": "There are a lot better ways to buy happiness than paying for an expensive college.  I remember being in high school and thinking I absolutely had to go to a prestigious university; I did, it didn't make me happy, and it didn't make a big difference to my career (as far as I can tell).  My sister who went to community college for her associate's and then transferred to a four-year school to finish her bachelor's spent a lot less money and is doing no worse than I am career-wise.\n\nI get why OP's daughter is upset but his reasoning is sound - someone who wants to be a teacher has no good reason to spend that much on an undergrad degree.  She would be better off going to a state school and also buying a house.  (Would OP financially support that plan to the same extent he's supporting his son's?)",
                  "id": 107,
                  "comments": [
                    {
                      "score": 762,
                      "content": "Yes, I agree that much money for a teaching degree is crazy. Just because dad can pay that much does not mean he should. I think the daughter is just so in love with her dream school that she is not thinking clearly. If I were dad, I would pay for her to attend the state school and subtract that amount from the total he will spend on sons education a d gift her the difference when she graduates to buy a house or her dream car or simply put into savings. I feel like paying for her dream college is just wasted money. I don't feel like he is favoring  his son over his daughter. He is just being sensible a out spending his money.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 172,
                      "content": "This applies to the son too. He could go to a public/state university and do a pre-dentistry major. Dad should tell BOTH kids to go to less expensive schools.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 82,
                      "content": "Many teachers don't remain in the classroom their whole career. They eventually go on to something else, often administration, which pays substantially more. And in that context, yes, having a more prestigious degree WILL make a difference in getting her into more prestigious graduate programs or getting taken on for professional development.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 53,
                      "content": "Unless, of course, state school is cheaper because it has a bad reputation, which narrows job prospects or puts OP's daughter in an environment she hates for four years. She's likely going to be living there too, you know. That's a long time to be miserable.\n\nThat OP isn't offering equivalent pay as her brother even, though, and asking her to take loans for the rest is where favoritism is coming in. OP doesn't have to pay, but he is not treating children equally here, and can't complain when he's being called out on it",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 48,
                      "content": "It’s hard because I agree with you but what he’s doing isn’t teaching her that. He needs her to see what it’s actually like to be a teacher vs another career. It didn’t click for me that I didn’t want to major in theatrical set design  until I actually worked at a theater and saw people in their 30s who had roommates, people in their 40s still Paying student loans, and people in their 50s still pulling all nighters before opening night. That made me realize that although it would be fun in my 20s I want a comfier job when I’m older. He needs a way to communicate this with her without making it seem like he’s just worried about his money and his “return on investment” not her future. He’s making this about him which isn’t the way to convince anyone of anything.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Well he can pay himself on the back for his sound reasoning when he loses his relationship with his daughter I guess.",
                      "id": 113,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "This is the same approach I would take. I think they both need to sit down and discuss this better. It’s insane how people have a dream school now. I took the school that provided me with the best financial aid and am so much happier post graduation knowing that I have less to pay off. I think the daughter should be respected for taking a career that is severely needed but the father is looking at a from a better approach that doesn’t involve emotion but rather finances. If I were the father, I’d do the same but help her with the saved money for a house or car",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "There are better ways to buy happiness than paying for an expensive college, but it is a double standard that the father does that for his son and not his daughter, when one can also quite easily become a dentist just by going to a state school. He has no reason to spend that amount on either of them, but he's already committed with one, so he should have been ready to do similar (not more, but similar) for the other.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 247,
                  "content": "If you need to pay out 300K for your child‘s happiness, something is seriously wrong. \n\nEither way, OP shouldn’t be playing favorites like this. Give both kids the same amount, let them attend whatever college they want and study what interests them, and let them figure out the rest themselves.",
                  "id": 116,
                  "comments": [
                    {
                      "score": 77,
                      "content": "Something is seriously wrong indeed, in a system where it costs 300k to become a teacher and you carry debt for years if you want to be motivated at work.\n\nShe always wanted to be a teacher. A career choice is super important, it's what she will be doing (hopefully) the rest of her life, daily. If she ends accepting daddy's choice she will be miserable not only her school years (with more probabilities of failing) but also every single day the alarm clock wakes her up.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I kinda of agree. Dad is an asshole because he's only basing what he's willing to spend on his kids college on what they can potentially make in the future.  That's a good way to invest in a company, not a good way to be a good parent.\n\nOp could have a set amount for kid or something like that and let them make their own choices.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 150,
                  "content": "My Dad was reluctant about my choice of major. I excelled at Math and CAD in High School but chose to do media/communications. I was happy to study what I wanted but he also had no financial stake in my education. He didn't actively try to stop me from studying that but did try to warn me about my future. It's not that I hated CAD/engineering, I found myself wanting to have a voice.\n\nTwo years after graduating I did admit to my Dad: he was right. I should have stuck to engineering. After I graduated I pretty much had to salvage my talents and go into IT because it was something I was also good at. I just had a degree at this point that indicated that I could be taught.\n\nI see where OP is coming from. The poor girl will probably burnout within 5 years of low pay and no administration support like many of my friends did. Spending that amount of money is a waste. But the daughter won't listen or believe in that reasoning anyway, like I did when I was 17. The best thing I try to convey to young people now: major in something that pays you, minor in your passion.",
                  "id": 119,
                  "comments": [
                    {
                      "score": 24,
                      "content": "I will say sometimes parent underestimate how much money a non stem major can make. I went into fashion design at an art college and was making $150k within 3-4 years. If my parents told me to chose a more lucrative career I would been both less happy and less financially successful. \n\nReally wish schools were more affordable for all as in Europe so folks didn’t have to make this kind of choice. I lucked out to come from a wealthier family, but not most do.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "If, like you, she has a real degree from a prestigious school (and I'd encourage a second major) that's going to open doors when she burns out. There are also many jobs in business that an edu degree will be an asset in. She could add these in also. One example is the client success person who helps my team get the most value out of this $$$ software we use. \n\nIt's so limiting to just think \"tuition, major, degree, job in that major, career in that job.\"\n\nConversely, your own background in multiple fields is a huge asset in your engineering career.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 130,
                  "content": "300k for \\~4y of /maybe/ happiness is a god damn steep price. I 100% agree college is an INVESTMENT towards the REST OF YOUR LIFE. If all you get out of college is 4 years of fun you've fucked it up badly.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 77,
                  "content": "I’ve never met a happy middle school teacher.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 19,
                      "content": "I've met one, but she was happy because she recently retired",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I teach high school and love my job.  I know plenty of happy middle school teachers.",
                      "id": 125,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": "Fuck. Anyone who thinks their \"child's happiness\" is an acceptable ROI for $300,000 will not and should not have any money.",
                  "id": 126,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 41,
                  "content": "lol what? It's SCHOOL. the whole point isn't to be happy, but to get educated enough to make more money. \n\nWhile the dad is an AH a little, I agree. Why would you pay 300k= for a job that will make you 50k a year. That's just a bad deal.",
                  "id": 127,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "Happiness when? For how long? \n\nOP could literally buy her a car, a down payment on a house, and a wedding with the difference in cost.  OP could pay for a masters degree with the difference.   That’s long term happiness. \n\nYou can find an endless number of posts on Reddit about how dumb it is to give kids access to student loans.  They are horrible at judging the value of money against their short term desire.  ThE pReFrOnTaL CoRtEx IsNT dEvElOpEd UnTiL 25… \n\nOP is NTA for actually being a parent here and making disciplined choices.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "And this is why people in the US have so much unnecessary college debt that they can’t pay!!!! College is about providing a path to a career not about paying excessive amounts of money to be happy for 4 years. \n\nNo way in hell would I pay 75k per year for my kid to get a teaching degree. I think teaching is a great career, but spending that much on something that is (a) only going to net a small salary and (b) is not school dependent (meaning you don’t have to have a degree from Harvard to get the job you want as a teacher; pretty much any school will do as there is a massive teacher shortage everywhere) is an incredibly poor financial decision. For that exact same kid, I would consider it if they wanted to go to medical school because getting into a good medical school is partially dependent on where you went to undergrad.",
                  "id": 129,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "He could pay for her to go to the state school, then buy her a house so she could actually live on the terrible teaching salary and she’d probably be happier in the long term.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 92,
              "content": "Is there a return if he’s not being paid back? I didn’t see in the post where the kids are required to repay his underwriting of their education.",
              "id": 131,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 73,
              "content": "Return on investment for higher education is a better educated society! \n\nThe real asshole here is the entire American for profit educational system!",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "Wheres the return? Unless hes expecting his kids to pay him back after they graduate? Thays even more shitty. Theyre his KIDS not stock options to play around with for \"return\".",
              "id": 133,
              "comments": [
                {
                  "score": 59,
                  "content": "I think in this case the \"return\" is seeing your kids have a better life - having more free time, not arguing with their partner about money, not being constantly stressed because the dryer broke or the car broke or they can't make rent.\n\nAs a parent, that's the sort of \"return\" I want. I would happily take out some debt to see that. I would not be willing to work as hard just so my kids can screw around on a 4 year vacation and then end up in that situation anyway.",
                  "id": 134,
                  "comments": [
                    {
                      "score": 13,
                      "content": "What evidence do you have from the post that she is likely to spend the length of her degree screwing around? How will she get the degree and thus the career if she treats it as a \"4 year vacation\"?",
                      "id": 135,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "But isn’t the later example exactly the situation we are talking about with the daughter? Not that she would necessarily struggle for money (although that is extremely likely as a teacher), but that OP would be paying for the educational equivalent of a 4 year vacation. Schools at every level are in desperate need of teachers. Whether the daughter goes to her dream school for 75k a year or the state school for 20k, the end result is exactly the same - she would have the exact same job for the exact same salary. So isn’t she basically just demanding that her father pay an extra 50k a year for no tangible benefit whatsoever? I mean the 75k school may have better dorms or food or social life or whatever makes it more appealing to the daughter, but that is not something I’m willing to go into debt (or skimp on my retirement or my own enjoyment of the rewards of my own hard work - whatever the trade off is for OP here) for.",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "but his argument for Jake is that he doesn't want Jake to have debt, and only starts about his return-on-investment when it's about Nikki.",
              "id": 137,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": ">He’s considering return-on-investment\n\nPaying for anyone's college is technically a terrible return on investment. Beyond that, paying for someone to go into dentistry when there are only 70 dental schools in the country is a gamble in itself. The fact that OP is willing to take that level of risk on his son and isn't even considering the risk to be worth it with his daughter makes him the asshole.",
              "id": 138,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Except he’s said nothing about the son paying him back. If anything a teacher having no student loan debt would be more important than a future dentist.",
              "id": 139,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "Considering son gets 0 financial aid, Op is rich as shit and is paying out of pocket.",
          "id": 140,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Ok but why does she need to go to an expensive out of state college for something she can learn anywhere.  Legit just throwing money away",
          "id": 141,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3269,
      "content": "You should feel bad... You're paying fully for the child who will make enough to easily pay off some loans with a great profession and shitting on your daughter who is wanting to be a teacher, which is incredibly noble and needed in this country, to burden her with loans that she will take forever to repay because she will make crap. Because we treat teachers like crap. And guess what? Apparently so do you. Yta.",
      "id": 142,
      "comments": [
        {
          "score": 567,
          "content": "Yes this is 100% what I thought. I am not saying OP shouldn't pay for his son but you have clearly outlined how easily he would be able to pay back loans compared to her.\n\nI am not a teacher but my parents were and so was my ex. Hard hard hard job and we need to value them more. \n\nYTA",
          "id": 143,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 240,
          "content": "Not to mention, there is a way to move up the ladder in education, and daughter could end up a principal, for example and also make 6 figures. He is just crapping on being an educator and favoring his son over his daughter. OP, YTA, and treading in dangerous, relationship destroying waters. Your ROI here is about to be losing your daughter. Ask yourself: what is most important to you?",
          "id": 144,
          "comments": [
            {
              "score": 77,
              "content": "This, and to add for those who claim you don't need the prestigious school degree for education but do for dentistry, this education career path would benefit from it greatly.",
              "id": 145,
              "comments": [
                {
                  "score": 35,
                  "content": "Oh, absolutely. A highly educated and highly motivated teacher is exactly what is needed.",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "She doesn’t even have to become a principal to make that much, depending on where she teaches. My sister and MIL are both middle school teachers and they make six figures.",
              "id": 147,
              "comments": [
                {
                  "score": 8,
                  "content": "I’m a middle school teacher and I make 6 figures.  It’s possible.",
                  "id": 148,
                  "comments": [
                    {
                      "score": 6,
                      "content": "It’s totally possible! There are so many higher paying districts near me, suburb of NYC. And guess what, the better the undergrad/ grad school-the easier it is to be hired at a top district.",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 53,
          "content": "Exactly this. & also, at no point did OP say that money was an issue. Unless I misunderstood, its not that OP can't afford it, it's that OP doesn't want to.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Do people not read anymore? He said he will pay for both. He's not taking on loans, *he's paying this up front.* He's just saying that he doesn't want to pay 300k for a teaching degree and I agree that's insane. Education is a financial investment and debt to income ratio should be a priority.",
          "id": 151,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "Why does she need to go to a $300k private school to do that though?  He's said he'll happily pay for the state school - he just doesn't see the value in dropping a new house worth of tuition payments on college for that career choice, especially considering going  to state U likely isn't going to impact her career prospects at all.",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "He's not burdening her with any debt. He's fully willing to pay for her tuition. He's just not willing to pay a Ferrari price on a Toyota Camry. She's mad because she wants him to pay out the butt for something that has no extra benefit. Going to a state school for a teaching degree isn't going to impact her prospects at all.",
          "id": 153,
          "comments": [
            {
              "score": 4,
              "content": "Exactly this.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Top comment here (or at least it should be)!",
          "id": 155,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Why does she need a $75K a year private school to become a teacher? Doesn't sound that noble or needed.",
          "id": 156,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "I was thinking along these lines as well. She needs the help more than the son as her income potential is severely limited. \n\nHowever, 300k to teach is bananas. And it is the dad’s money to spend as he chooses. I think the fair thing for him to do is give both kids $50,000 a year toward their education. For the same amount of years. If their school cost more than that, they will need to take out a loan. \n\nThere is a strong chance that the daughter would want a masters degree for teaching. If she does, that will cover the majority of the years the son is in school as well. But, If the son goes to school longer than the daughter, he will need to figure his own tuition out for those last 2ish years. Not too big of a deal, because he will have a dentist salary afterward",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "He’s going to pay for her school. He’s just not willing to pay $300k for her to go to school to be a teacher.",
          "id": 158,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2854,
      "content": "NTA. Former teacher here. Nikki needs to face reality sooner rather than later.",
      "id": 159,
      "comments": [
        {
          "score": 2005,
          "content": "I’m also a teacher and this a resounding NTA.  While I appreciate what folks are saying in theory, the reality is exactly as OP outlines. Given what you get paid in education, there is no reason to go to a private school for your degree. The earning potential just isn’t there. If OP’s daughter still insists on the more expensive school, she can figure out how to pay for it because it isn’t a wise investment, financially. \n\nAnd yes, I know there are many other ways of looking at this and the daughter might change course, but OP’s logic is sound.",
          "id": 160,
          "comments": [
            {
              "score": 543,
              "content": "Exactly. I have an MBA from a state school. I believe I paid around 50k total for it, but I was working at the time so I don't include things like room and board. Private schools were easily 3 times as much. But the job prospects were the same. More expensive doesn't equal a better education or more job opportunities. \n\nBut it can. A Harvard MBA is a totally different story. The network alone is worth literal millions. \n\nI fully intend to have a similar plan with my kids. I'll pay for their college no matter what. But I'm not paying for a history degree from some random private school unless they can justify the ROI. If you want a career that doesn't pay much, then get a degree that doesn't cost much. \n\nSide note, the reason I got an MBA at all is because my psychology undergrad wasn't worth the shit once I decided to move into a field with higher paying career prospects.",
              "id": 161,
              "comments": [
                {
                  "score": 151,
                  "content": "Exactly!  And I have a history degree!  Ha!  And you’re correct, as others have pointed out in this thread, that yes if you can get into an Ivy, go for it!  And there is nothing wrong with wanting your degree to make sense from a financial standpoint. It’s a massive amount of money!",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Fellow parent here, I have 5 I'm raising. I am doing a reimbursement plan. The city we live in offers high school graduates 2 years of FREE community college, after that I will do a reimbursement for classes that push towards a degree I believe my kids will benefit from. 90% for an A, 75% for a B, 50% for a C, and 0 for anything less than a C. We also live withing driving distance and three miles from the light rail, that will take them to both the community college as well as the state university. If they are going to school, working, and not disrupting the household, they can continue to live at home while going to school. \n\nIt's my money, I get to decide how to spend it. I am not required to pay for a college education, in fact, I make close to a buck fifty with just a two year degree, So I don't see value in a 4 year degree, UNLESS it required for their chosen career (no underwater basket weaving degrees).",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "It's crazy how far down I had to scroll to find anyone with the proper train of thought on this.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I really can’t believe I had to scroll down this far to start seeing the NTA folks. I agree with him, his reasoning is very logical and you folks are the ones who definitely get it",
              "id": 165,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "He could even the field in other ways such as giving her the same amount of money as his son with most of it put aside for her to buy a property with etc",
              "id": 166,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Also a teacher, also voting NTA. My MA and BA are in English, NOT in education. I can’t imagine going anywhere other than a state school for a degree in education. The ROI would be terrible. Also, we are so desperate for teachers that the prestigious school you attended does not even help get you in the door. It makes no difference. Finally, teaching sucks so much that 50% of new teachers left the field within the first 5 years PRE-PANDEMIC. It is certainly more than that now, and even veterans are flooding out. College students should study anything other that education, sub for a while, then get a credential if they still think they want to teach. OP’s daughter could do a combined master’s in Ed and credential program after finishing her undergrad in a field that gives her a plan b. They’re super cheap because every school has them.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 750,
          "content": "NTA. Can’t believe I had to scroll down this much to see NTA.",
          "id": 168,
          "comments": [
            {
              "score": 405,
              "content": "Thank you. The first few YTA comments are just people that want to be outraged just to be outraged, FaVoRiTiSm fAvOrItIsM.  \n\nNo, the guy's logic is sensible. It's a waste of money to pay that much for a degree with a low earning potential.",
              "id": 169,
              "comments": [
                {
                  "score": 12,
                  "content": "Exactly. And if he wants to balance it out maybe that extra money that would be spent on a fancy school, could be given to her in the form of a house deposit. I’m sure she would enjoy an actual home in the future rather than having gone to a ‘prestigious’ school",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 166,
              "content": "Seriously\n\nIt's a tough situation and OP probably could have offered to pay the same amount as brother (not the extra 25k/yr for *this* school) but it's completely reasonable to not pay 300k for a teaching degree\n\nI paid about 100k total for my education. I got an English degree with a business and technical writing minor. You want to know what I can do relatively easily to get a teaching degree? Just go get the cert and I still have my non-teaching degree. \n\nDaughter is focused on the wrong things. If being a teacher is most important to her, then the specific school wouldn't be. OP should probably be working more on making this a teaching moment but NTA",
              "id": 171,
              "comments": [
                {
                  "score": 32,
                  "content": "I paid 90k total for a bachelors in biochemistry and a law degree. There is ZERO reason to pay 300k for an education degree. Zero. Agreed, NTA.",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Based on the prices, it sounds like the brother is going to a state school at out-of-state rates, which can be worth it occasionally for prestige and/or the right program if you're talking a school like Michigan, UNC, UVA, Berkley, etc.\n\nThe daughter wants to go to a high dollar private school, which could mean anything from an ivy to a small liberal arts college that nobody has every heard of - they all cost around $50-60k before room and board these days.\n\nGiven that almost every state U will have a teaching program, there's really no good reason not to do it unless there is a serious culture fit problem between the daughter and school.  It's not going to help or hurt her employment prospects in any meaningful way.",
                  "id": 173,
                  "comments": [
                    {
                      "score": 9,
                      "content": "40k of my schooling cost was from a single year at a private school\n\nI learned my lesson and commuted to a state school for the rest of my education",
                      "id": 174,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 107,
              "content": "It's because the child that wants to be a teacher is female. If it was reversed, I'm sure you'd see more NTA, which is just more logical IMO. It makes absolutely 0 sense to dump that much money into a career that doesn't have the earnings potential to make it back.\n\nPeople don't realize this, they just see it as you dumping on liberal arts majors/degrees. It's sad, but gone are the days of going to college to \"broaden your horizons\". If you aren't going to college to get a degree in something with high earning potential, you're just hamstringing your future.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "It's a bunch of entitled teenagers happy to spend someone else's money.",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Riiight, Nta for sure",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I know right? He is being totally practical and reasonable",
              "id": 178,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Agreed. NTA. I can understand the POV of the daughter, because I was an 17-year-old girl once. Learning these types of lessons early in life are valuable beyond money. I agree with the father: it is not a wise investment especially when there are other, more rational options available.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 364,
          "content": "I'm not a teacher, but I can do some basic math and understand the concept of return on investment.   \n\nThe investment of $50k a year to earn $120k or more a year is good.\n\nThe investment of $75k a year to earn $35k a year is bad.  \n\nThis is not favoritism, this is reality.    Dreams are nice, and it would be amazing if the dream school made sense with the chosen career path, but it just doesn't.",
          "id": 180,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 290,
          "content": "The career advice I've heard the most from my teachers was not to become a teacher",
          "id": 181,
          "comments": [
            {
              "score": 126,
              "content": "Both of my parents were public school teachers. They told me growing up that I could do anything I wanted career-wise--except become a teacher.",
              "id": 182,
              "comments": [
                {
                  "score": 5,
                  "content": "I got the same advice and didn't listen",
                  "id": 183,
                  "comments": [
                    {
                      "score": 5,
                      "content": "How much do you dislike it?",
                      "id": 184,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Yeah, I would tell my kid to not become one. If they wanted to I would support it but I would never pay that much for a degree. I went to an expensive private school and I regret it every time I pay my student loans.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 266,
          "content": "Also former teacher.  I would NEVER pay that much for an education degree when a state school is just as good. \nGood on the daughter for choosing to teach but it's a high turnover rate and retention is less than 5 years (US).",
          "id": 186,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 187,
          "content": "Why did I have to scroll this far lol. People are not living in reality. He’s not belittling her career choice at all, but it’s insane to spend that much money to become a teacher.",
          "id": 187,
          "comments": [
            {
              "score": 14,
              "content": "This post has been kidnapped by teenagers. That's the only explanation possible.",
              "id": 188,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 168,
          "content": "There’s so many comments about “you’re making her feel neglected and emotionally scarred” and I’m just thinking that if she feels neglected right now, she definitely shouldn’t be going into this line of work.",
          "id": 189,
          "comments": [
            {
              "score": 66,
              "content": "Emotionally sensitive or anxious people tend not to be suited to teaching. It's a broken system that stomps on anyone who actually cares about their job.",
              "id": 190,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 139,
          "content": "NTA.\n\n  \nSo there are a few reasons we want to hate OP. We read this comic and want to support someone wanting to be a teacher: https://www.geeksaresexy.net/2018/01/26/teachers-make-comic/ . And the truth is while that's all high and noble, we're complete assholes to teachers and don't value their contribution to society. Because money is quite literally how we value the contribution of someone to society and that's the one thing that we're not willing to give them. Sad but all the Y T As are very happy to judge but not really do anything.\n\nIf dad is comfortable spending that much on the children's education what kind of life has she lived. Would she be able to live on a teacher's salary or would she need to live subsidized by dad? Already dad has made a decision regarding his money and she's upset. She definitely believes she has a right here to dad's money. Isn't that exactly the kind of person that you should be worried about is right now idealistic when they don't have to pay for anything but is going to give up when they face friction in real life? In which case this would be a 300k invested not in daughter's career but in daughter's hobby while she was finding herself. \n\nSome people are that kind of wealthy where they can do that. Some are the kind of wealthy where the career is a joke and they're living off their family wealth. Some would develop an understanding of an industry that would be very lucrative if they open a business with the resources the family has. Those are not something somebody should be counting on.\n\nPeople are criticizing him for the status symbol of wanting their children in high paying careers. But the daughter is asking for a status symbol too. \n\nOP hasn't said that they'd help in future endeavors. But they don't need to say that right now.",
          "id": 191,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 110,
          "content": "As a former teacher, can you tell us if there’s a difference in getting hired or pay depending on where you get your degree?\n\nI know it has nothing to do with the post but I’m very curious about it.",
          "id": 192,
          "comments": [
            {
              "score": 205,
              "content": "As a teacher's daughter, not really.\n\nIt surely looks good in a resume, however, it's how good you are that matters in the end. You can have a Harvard degree but if you can't make a class sit still/have good grades you won't get too far",
              "id": 193,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 100,
              "content": "Not really.  A more prestigious undergrad degree may get you in the door and it also may do you absolutely no good. So much hiring seems to come down to being in the right place at the right time and or knowing people and as long as you have the credentials that you need in your particular state to be a certified public school teacher, no one cares much beyond that.",
              "id": 194,
              "comments": [
                {
                  "score": 4,
                  "content": "Thank you.",
                  "id": 195,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 79,
              "content": "Teacher pay will largely be based on local cost of living, years experience, degrees/certifications, and what extracurriculars the teacher sponsors.  \n\nA middle school teacher won't make more because they attended one unversity over another.",
              "id": 196,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "No. I sat on an interview panel in the last few years when we were hiring. To be frank we didn’t even look to see where they got their degree. We made sure they had a license and that’s it. Mostly because you need a license to teach, all schools have the same requirements for edu majors in the state. \n\nWhat determines pay in my state: years of education (undergrad which is required and any credits/degrees after that bump you up) and years teaching. That’s it. I know a ton of teachers who do random online programs to get a pay bump.",
              "id": 197,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "It doesn’t matter where you get your degree. In my state, we are so short on teachers that when I got hired they didn’t bother checking my transcripts till a year later. We are constantly loosing teachers and admin is desperate to hire anyone who passes a background check.",
              "id": 198,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Most districts are so desperate for teachers, ANY 4 year degree will give you a provisional license to teach, and then you just have to study for and pass the cert tests. Pay rates are set out at a district level, unlike private business are are pretty much non negotiable, ALL first year teachers get paid the same, unless they meet specific requirements (like they pay you a little more if you have a masters over just a bachelor's and if you have certain certifications for special education stuff).",
              "id": 199,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "My daughter is just finishing up her degree at her community college that happened to add a 4 year teaching degree program right when she was finishing her associates and was looking at state schools. Community college prices, same job offers. Even her student teaching right now pays $42k with good benefits.",
              "id": 200,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 73,
          "content": "Totally agree! This is one of those hard parenting moments where reality and experience have to weigh in.\n\nPeople are confusing fair with equal.",
          "id": 201,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2237,
      "content": "I don’t understand how everyone is calling him TA here. There’s zero reason she needs to spend $75k a year for 4-5 years to become a teacher.",
      "id": 202,
      "comments": [
        {
          "score": 1076,
          "content": "People are delusional. They get into massive debt to get sociology degree and then get depressed they can't get a job. And expect to be validated.",
          "id": 203,
          "comments": [
            {
              "score": 525,
              "content": "This thread was actually very eye opening. Apparently you should pay hundreds of thousands of dollars for \"happiness\" during your education and earning potential is irrelevant.\n\nThen redditors will be like \"no fair I can't believe they let 18 year olds get into this much debt!\"",
              "id": 204,
              "comments": [
                {
                  "score": 158,
                  "content": "It’s crazy she can go to a state school and get a Ferrari and still save her father money. These people just see that he has money so should do whatever and it’s the reason they probably don’t have any money.",
                  "id": 205,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 288,
              "content": "Yes. all of the “YTA” at the top are clearly being written and upvoted by young people who don’t yet understand the realities of achieving financial independence. One day they’ll get it, one day they’ll realize that spending 300k to land a career that makes you only 50k is just not a financially savvy decision. (It’s an unfortunate reality; yea teachers DO deserve to be paid more)",
              "id": 206,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 186,
              "content": "The only valid response here",
              "id": 207,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 98,
              "content": "Thank you. I recently met an old high school friend with a masters in music working as my local barista. It is just not worth it to pursue these useless degrees.",
              "id": 208,
              "comments": [
                {
                  "score": 19,
                  "content": "It's not always the degree - it's how you use it.\n\nI also know people with fancy ass degrees who are burnt out and not doing anything with them.",
                  "id": 209,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "NTA You are being practical. Paying 300k for a degree that will take her 20 years to pay off seems silly to me.",
                  "id": 210,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": "A post like this really reveals what the age and gender trends to on this sub.",
              "id": 211,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "I don't understand why this is such a hot topic. It's FACTS",
              "id": 212,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "Those will be the same people clamoring for universal student debt relief as well. I understand that student debt is an entirely different can of worms that is linked to bloated administration costs at universities, but IME, a lot of the people calling for that are the same people who got \"worthless\" degrees with no way in hell of ever making enough to pay those loans back.",
              "id": 213,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Hey, don't shit on sociology! I have a PhD in it and actually make good $ (doing market research )",
              "id": 214,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 175,
          "content": "She can do the same degree at a cheaper place and he’ll pay for it. He isn’t telling her to choose another degree or even looking down at her choice of major. A education degree is just not worth $300k.",
          "id": 215,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "Insane because he’s still willing to pay for her school, just not one that will cost more per year than a teacher even makes.",
          "id": 216,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Exactly. Also he never said he won’t ever spend a dime on her again.",
          "id": 217,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Ask any teacher or post this in an education sub and they would be on the OPs side. Look at comments from teachers (me included). It’s insane to spend that on a teaching degree.  \n\nI don’t think people realize have a fancy degree as a teacher means diddly squat.  It won’t help with pay or hiring. A degree from a private fancy school that follows a states requirements for certification is the same as a state school degree that follows the same requirements.",
          "id": 218,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Finally, someone with sense.\n\nAs a father doing his best to pay for his kids' needs, I would make the same decision.\n\nIf you want to treat your kids with a cookie-cutter approach, that's your choice, but I'm going to give each child what they really need. And nobody needs $300K school for a career that makes $50K.\n\nThe \"YTAs\" here utterly reek of entitlement.",
          "id": 219,
          "comments": [
            {
              "score": 8,
              "content": "I do wonder if there’s a divide here between people who have more financial security and those that don’t. \n\nI come from a very working class background. My parents gave me EVERYTHING they could. My dad literally wore shoes with holes in them while helping pay for my uni books. Can you believe that? I will never not be thankful for the father I had, I was the luckiest girl in the world seriously.\n\nBut I paid for my degrees myself and also took out loans for my living expenses and I worked my bum off as a live in nanny while doing law. Because my parents obviously didn’t have a few hundred thousand bucks to throw my way. \n\nAnd because I worked so damn hard and also saw my dad sacrifice his dignity literally for me as well as his health working his own business 14+ hours a day - I understand the OP and what he’s saying. That money is huge - save it and put it towards a masters or PhD later if she wants it but… I can understand his reluctance he wants it spent where there’s value and he thinks she doesn’t have enough life experience yet to know where that value will lie.",
              "id": 220,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "You also don't need to spend 50k/year on pre-dental school.",
          "id": 221,
          "comments": [
            {
              "score": 8,
              "content": "Yes but at least the dentist son will make over twice as much per year as his college cost per year.\n\nThe daughter wants him to spend $75K per year on a career that will only pay her $50K per year when she gets a job.\n\nThe son is doing something wise, the daughter's decision is ridiculous.",
              "id": 222,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "She should go to community college to become a teacher because 1) you don't need a prestigious degree to become a teacher the way you need a prestigious medical degree to get a solid job as a dentist/doctor. She is asking him to pay more for her measly teaching degree than he is paying for his son's prestigious dental degree. \n\nAnd at least when their son graduates he will be self-sufficient immediately and probably able to afford a home within a few years of saving. On a teaching salary, dad will be lucky if his daughter moves into her own studio apartment by age 35.\n\nThe only reason I would say OP is TA is if he lets his daughter throw her education away on a dead-end degree and dead-end career. I say this as a former teacher.",
          "id": 223,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1214,
      "content": "nta. If more people thought as clearly about cost of degree/career prospects, then colleges would have to lower their prices and everyone would benefit.\n\nHow many people pay top dollar for a degree that gets them a modest job while leaving them in crippling debt? Too many!\n\nIt's a millstone around your neck. That debt delays marriage, having children, and may rule home ownership right out. You have educated yourself right out of the middle class.\n\nEducation for it's own sake is for trust fund babies. For the rest of us, your degree should lead to a job that pays a living wage and a career that offers growth and a comfortable life.\n\nWe sat our kids down and told them we would pay for college, but only for degrees that would lead to good paying jobs. No art history, no philosophy. Those are things to pursue on your own time.\n\nKnow how much more a teacher that graduates from an Ivy League makes than a teacher from a state school?\n\nNot one dime.\n\nIt may look like you are favoring your son, but your logic is sound.",
      "id": 224,
      "comments": [
        {
          "score": 541,
          "content": "I suspect that the people who think OP should pay out $300,000 because of feelings don’t have that kind of money because they make poor financial decisions.\n\nPeople like OP who can pay $300,000 have that kind of money because they think logically.",
          "id": 225,
          "comments": [
            {
              "score": 188,
              "content": "100% in agreement. \n\nWe have young kids. When they are older we hope to be able to pay for their education and avoid them being in debt. But paying an unreasonable amount of money for a low paying job is a bad financial decision. I would certainly not do it. OP has worked for this money, it's not free and can't be wasted on a college fee JUST to prove that he is not playing favorites. People are delusional. Thinking like this is exactly why there's crippling student debt in America. \n\nNTA.",
              "id": 226,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 64,
              "content": "It's awfully easy to spend other people's money.",
              "id": 227,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 174,
          "content": "Exactly. And I’m the dumbass who paid through the nose for a pricey degree to become a public school teacher. Did I have an incredible experience in college that made me a much more intelligent person?  Absolutely. Has it made me more money?  Absolutely not!  And the reality is there should be a return on your investment in terms of your college degree.",
          "id": 228,
          "comments": [
            {
              "score": 19,
              "content": "Me too! My peers make the same amount of money but I’m still paying student loans when they haven’t for years. I wish someone had talked me out of the fancy prestigious school. It was NOT worth the cost.",
              "id": 229,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 113,
          "content": "The whole \"dream school\" thing is a marketing invention.\n\nColleges have pushed it HARD for the last couple decades because it allows them to get kids (and their parents) to behave irrationally and throw insane amounts of money on the \"experience\".",
          "id": 230,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "“How many people pay top dollar for a degree that gets them a modest job while leaving them in crippling debt?” \n\nIdk the number but I am one and I would never encourage my kids to go to expensive schools for degrees that aren’t in like computer science or engineering, or highly educated health care. Nor would we agree to pay or put our names on their loans. It’s bad money management and you find out when you can’t afford to survive because your repayment takes your entire paycheck.",
          "id": 231,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "This is the correct answer. \n\nOP, if your daughter wants to go the expensive school, you should let her. On her own dime. \n\nAlso, and not to be mean here, but if your kids are smart, hard working kids, how come they can’t get a single scholarship? Like not even a small one? This does not add up to me. But then I don’t come from money, had to pay my own way.",
          "id": 232,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I knew a guy that had planned to go to some super low tier school that had some nice branding and marketing and was in a big city, and was $60k a year. When it actually came time for him to graduate and go to college, his parents were all, \"Yeah, you'll get a better education at our state's perfectly good state university, and it's like $20k with room and board.\" So, he swallowed his pride and went to the better state school.",
          "id": 233,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1152,
      "content": "Yta\n\nSo with this logic, your son is paying you back with his 6 figure salary, correct?\n\nOr, let me guess...no?  You don't expect him to do you?\n\nWhat about your daughter? Does she have to pay you back?\n\nBecause, if not, why are you doing this? It is favoritism if you are not expecting to be paid back. Period. Honestly, it's favoritism regardless. A successful career isn't all about money and your view that it is is very ancient. A successful career is one that makes you happy. And you're telling your daughter that her dreams don't count.",
      "id": 234,
      "comments": [
        {
          "score": 230,
          "content": "I completely agree. If he doesn’t expect being paid back, why does he care how much they make?",
          "id": 235,
          "comments": [
            {
              "score": 141,
              "content": "Probably bc paying 300,000$+ for an education undergrad degree is a little ridiculous",
              "id": 236,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "It is his money and he gets to decide what he spends it on.  He views an expensive education for his dentist son as worth it and necessary (need a good degree to get into dental school).  He views an expensive education for his teacher daughter as not worth the money and unnecessary (don't need a good degree as it is easy to get a teaching job and they make shit money whether they go to a good school or an average school)  NTA",
              "id": 237,
              "comments": [
                {
                  "score": 6,
                  "content": "Teachers make such shit money that she'll probably hitting OP up for money many times as an adult, while the son won't be. \n\nI know a lot of teachers in their 30s who hit their parents up to help them pay for stuff ALL THE TIME. It's a bad investment for OP to pay that much for a teaching degree because she likely won't be financial independent for a long time.",
                  "id": 238,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Because he's being a parent. Just like the government, he can choose to incentivize some choices and not incentivize others. As a parent, it is OP's job to teach how these career paths will play out and steer his children. I don't see him crossing any lines here. Unless the daughter is on a path for a PhD in education and has specific academic goals, what is a \"dream\" school anyway? She can move to whatever \"dream\" city she wants to after college and attend whatever \"dream\" parties or visit  \"dream\" architecture and villages or whatever she wants in her free time. He could even hand her $200k in cash on her way to state school and she'd be better off.",
              "id": 239,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 84,
          "content": "And take it one step further: if the son goes through all the schooling, gets his license, but decides he hates the job and moves to a completely different field after a year, are you making the son pay you back?\n\nGive them both the same amount of money and let them choose their own careers.",
          "id": 240,
          "comments": [
            {
              "score": 5,
              "content": "Investment, not a secured loan. His investment can go belly up either way. But the son's career plan is a AA grade investment and the daughter's is a BBB. \n\nAnyway, son's high expenses are rationally aimed at a goal and the daughter's high expenses are luxurious. If this were a car buying analogy, the son is buying an F250 to haul lumber; the daughter is buying a Bentley for the driving experience -- both expensive transportation vehicles but only one is justified as anything other than a luxury.",
              "id": 241,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": "I don't think it's favoritism to say \"I'll provide you with hundreds of thousands of dollars as long as it seems like it's being used wisely\".\n\nThe son's career _is_ impacted heavily by his choice of school, and there's really no path to becoming a dentist except by attending dental schools.\n\nThe daughter's career will likely _not_ be hugely impacted by her choice of school.  So trying to guilt him into paying $300,000 for her education when a state school would probably get her to the same end result?  That's a waste of money- more money than some people see in a decade.\n\nSpending more money on a 200 foot bridge than you did on the 100 foot bridge down the road isn't \"playing favorites\", it's just not wanting to waste money.",
          "id": 242,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "OP is thinking about this all wrong. She’s 17. People change careers A LOT these days. Going to a more prestigious school will give her way more flexibility in the future. If he’s rich enough to cover all eventualities why not give her the best shot…",
          "id": 243,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 740,
      "content": "Unpopular opinion, but NTA. College is an investment, not an \"experience\". Even if you were never able to pay for it, taking out a 300k school loan for a career that starts at 60k and tops out at 80-90k would be a monumentally STUPID idea.\n\nIf you want to be fair, tell her you won't pay for her school, but you'll put the same amount you paid for your son into a downpayment for her first house. It's a net better investment for her life rather then a school that expensive for being a middle school teacher. If she still wants to do it it'll be on her to take a loan, and you'll have been fair money wise.",
      "id": 244,
      "comments": [
        {
          "score": 167,
          "content": "Absolutely this!! I can't believe the amount of people on here saying Y-T-A. It's not about favoritism but realism. Neither kid is entitled to OP's money but this is the most fair answer. Definitely NTA",
          "id": 245,
          "comments": [
            {
              "score": 18,
              "content": "It's hard because if I were in her shoes and 17 again, I'd be so upset. It sucks, because it's one of those mistakes that young people are bound to make because the college dream has been sold to them so well. I don't believe OP is TA, but it's a really tough situation for him and his daughter to navigate emotionally",
              "id": 246,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "The poster child for student loan relief is a 40 something middle school teacher that somehow graduated with $200k of debt, was never able to even pay the interest in full and now owe $400k.",
          "id": 247,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "This is the solution right here. Any money you save in comparison to your son's degree, offer it to your daughter as downpayment for a house. This will automatically make it so she can't say that you're favoring your son or being unfair, because you're giving them both the same amount of money - you're just not investing it unwisely.\n\nNTA.",
          "id": 248,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "That’s a pretty good compromise!",
          "id": 249,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 611,
      "content": "NTA... I 100% agree with you OP. My wife and I will not pay for college for our future children unless it's for a degree and major that will actually benefit them. Otherwise it just an expensive 4 year party, we know what that's like.\n\nDo not lose any sleep over this. Your logic is sound and what you are doing is investing in their future and that's a poor investment",
      "id": 250,
      "comments": [],
      "relation": "Support"
    }
  ]
}