{
  "post content": "My friend and I are in a rigorous academic program. For the past year he has requested that I remind him of small deadlines constantly and it gets annoying. He will not remember when to register for classes, or when to submit tests, or when to tune into certain zoom meetings etc. I have a lot of responsibilities myself and it gets tiring having to remind him of things. Also, I will have to answer a million questions because he wont read the emails the university sends him and that further sucks up more time.\n\n&#x200B;\n\nAnyways, I usually remind him of deadlines but I didn’t remind him of this past one that was very important. It was a training for off campus online behavior and it had to be submitted and done by a certain date or you would be forced to withdrawal from the semester. It took less than 20 minutes to complete and I did it almost immediately after receiving the email informing us we needed to do it and the deadline. We subsequently got like six more emails reminding us to take the training program. So I reminded him of it on the first day we got the email, but then I didn’t remind him again. I wanted to see if he would remember on his own or if he would have the kindess to remind me to do it, because it was a very important deadline. So anyways, the deadline came and went and he didn’t complete the training.\n\n&#x200B;\n\nHe was really mad at me that I didn‘t remind him and called me an asshole. I could have reminded him, but I didn’t and now he has to drop out of school for the semester. I think I might be the asshole because I could have reminded him, but I intentionally did not.\n\n&#x200B;\n\nSo reddit, am I the asshole?\n\n&#x200B;\n\n&#x200B;\n\nEDIT: So I have told him I was sick of picking up slack for him. I did not specifically tell him on reminding him of deadlines and stuff, but for things like him forgetting his wallet. etc. Just to be very clear on this, it wasn’t for an expirement, but I have reached the end of my rope with having to constantly help him keep track of things and I have let him know that too. I just never spoke to him specifically about deadlines. I am exhausted with him and his needs to be honest, I have gotten frustrated and firmly told him that I am sick of it and I need to focus on myself and my own health and schooling",
  "id": 1,
  "comments": [
    {
      "score": 40,
      "content": "ESH. Him the most, because it's not your job to remind him of things, and there are so many ways for him to remind himself. But purposefully not reminding him when you knew how serious the consequences would be was, I think, unkind. \n\nIt would have been far better to say to him \"I'm no longer going to be reminding you of important dates.\"",
      "id": 2,
      "comments": [
        {
          "score": 7,
          "content": "What I was thinking. You can’t really expect the friend to suddenly remember when op has been handholding him the whole time. When you suddenly pull the rug out from someone without warning you can’t be surprised when they fall.",
          "id": 3,
          "comments": [
            {
              "score": -12,
              "content": "Please read my update",
              "id": 4,
              "comments": [
                {
                  "score": 11,
                  "content": "I read your update but saying you're 'tired of picking up the slack' is not the same as \"I'm now no longer reminding you of deadlines.",
                  "id": 5,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "Doesn't matter what you updated. You never sat him down beforehand. That makes you an asshole as well.",
                  "id": 6,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Yes, this!",
          "id": 7,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 24,
      "content": "NTA, you're his friend not his parent. He's going to need to learn to take responsibility for himself and learn how to keep track of deadlines, and unfortunately experiencing consequences like this will have to be a part of growing up and learning those skills.",
      "id": 8,
      "comments": [
        {
          "score": 9,
          "content": "He’s already grown up. He’s 31 years old.",
          "id": 9,
          "comments": [
            {
              "score": 2,
              "content": "What. Okay, definitely NTA. In fact, if you keep being his crutch and doing all of this for him, he's going to stay stunted and dependent. It would actually be doing him a disservice.",
              "id": 10,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 14,
      "content": "I would say soft YTA for this:\n\n> I wanted to see if he would remember on his own or if he would have the kindess to remind me to do it, because it was a very important deadline. So anyways, the deadline came and went and he didn’t complete the training.\n\n​It's totally fair to not ever want to do it again, but he asked you to, and you agreed. You should have done the adult thing and announced it to him clearly and directly you're no longer keeping track of his deadlines. But this seems an awfully steep consequence while he trusted you.\n\nAlso, I'm going to downright say it - the lack of ability to keep deadlines combined with your edit about him losing his wallet all the time sounds a lot like adult ADHD and he should get tested.",
      "id": 11,
      "comments": [
        {
          "score": -5,
          "content": "He does have adult ADHD and he uses it as a way to manipulate us.",
          "id": 12,
          "comments": [
            {
              "score": 10,
              "content": "Please define by what you mean with \"manipulate\"?",
              "id": 13,
              "comments": [
                {
                  "score": 4,
                  "content": "I asked him one day if he could take his phone calls outside of the library so we couldn’t hear him talk when we are trying to study and he made a big deal and got upset and said that it’s hard for him to refocus if he has to leave the building and come back inside and its a disability and we all need to tolerate it and then he makes you feel guilty for bringing stuff up. Things like that.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 11,
                      "content": "The fact that he would not take his call outside in a library is assholish BUT it is true it's very hard to refocus is you have to leave and come back. It sounds to me like his coping skills could be better, but the condition is severe enough to impede his daily life.\n\nI'm still quite not sure how \"making you feel guilty\" looks like in day to day life.\n\nSounds to me e has genuine issues related to adults ADHD.  And you're annoyed with accommodating for all of them (and that's also OK).\n\nBut he specifically knows he has trouble with something, asked you for help, you said yes, then deliberately let him down. You're YTA for that, OP.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "ESH, almost NTA. He shouldn’t be taking advantage of your kindness and organization, but you should’ve told him you weren’t going to remind him anymore. You don’t have to be his calendar, but as a friend just communicate that you don’t want to",
      "id": 16,
      "comments": [
        {
          "score": -3,
          "content": "I have communicated it to him, not about the deadlines. But that I was tired of picking up a lot of slack for him, such as having to pay for things because he forgets his wallet etc.",
          "id": 17,
          "comments": [
            {
              "score": 1,
              "content": "So, you did not tell him you were going to stop reminding him after you agreed to remind him? ESH, borderline YTA\n\nEdit: Nvm saw that he's 31 and you did remind once technically, so NTA but still ESH for crappy communication.",
              "id": 18,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "YTA - only because you didn't tell your friend you were no longer reminding him about deadlines.  He was still relying on you at the point he flunked out and didn't know not to.\n\nYou're not responsible for him and not responsible for keeping him to deadlines and I can understand why that was too much, but you should have had  that conversation first.  If you had done that in advance you wouldn't have been the arsehole.",
      "id": 19,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "ESH You’re not his keeper.  He needs to be an adult  and manage his own responsibilities without using someone as a personal assistant. But you’re definitely an asshole for intentionally fucking him over in the name of your experiment, especially since you knew the gravity of the consequences. Literally all you had to do was say “hey man, I’ve got too much on my plate to be keeping track of your stuff too. I’m not going to remind you of every little thing anymore.” That would have made you not the asshole. But since he was relying on you (albeit not ok) and you purposely let him down, that makes you, and him, assholes.",
      "id": 20,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "**NTA.** Your friend needs to organize his life and take care of important deadlines and such for himself. It's great that you're reminding him of such things, but your life is greatly affected by it. Also, by reminding him of literally everything he should be keeping track of, you're enabling and reinforcing him that this lifestyle is acceptable. It's not. It's his fault for not checking his own emails and being on top of his own things. Your friend is in for a rude awakening when he is out of university and holding a full-time job in the real world where this kind of shit is not tolerated or looked on kindly.",
      "id": 21,
      "comments": [
        {
          "score": 1,
          "content": "[deleted]",
          "id": 22,
          "comments": [
            {
              "score": 1,
              "content": "It’s difficult managing school, various deadlines for widely different things, and dealing with a pandemic—all of that while pregnant—and your friend’s lack of organization is taking its toll on you mentally and almost physically. You’re doing the best you can with your situation.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "Nta\n\nyou did remind him. You aren’t his admin. He put the responsibility of his life on you. He has a pc and a smart phone. W Calendar functions and reminders. He sucks. You don’t.",
      "id": 24,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. He is in college and he has to take up his own responsibility. He’s an adult and yeah, he can blame his ADHD all he wants to, but it’s not going to help him if he doesn’t actually DO something about it. He can set reminders on his phone or his laptop. He can have alerts, if he can’t take charge and have some responsibility, then he can go see a therapist or get some help to remember to do these things. He is in charge of getting his stuff done, you have your own life and things going on. You are his friend, not his mom or walking reminder.",
      "id": 25,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA\n\n  \nHe's an adult. He needs to get his shit together. He can't rely on you forever.",
      "id": 26,
      "comments": [],
      "relation": "Support"
    }
  ]
}