{
  "post content": "My husband and I have been trying for pregnancy for years now, and to cut a long story short it seems as though it will never be a possibility. It took a long time to come to terms with but we've gradually got there. Our entire family is aware of the journey we've been on and how much it meant to us. With that in mind, my husband and I came to his sister (Sarah) with a proposal.\n\nSarah is in her early 30s, unmarried, and vocally against having children of her own. Despite this we thought she might be open to the idea of a surrogate pregnancy on our behalf given she would not have to be involved in raising the child personally. My husband is extremely close to his family and the idea of the entire process of surrogacy being contained to his blood felt extremely important to him. With that closeness in mind, we did not feel it was out of order to ask this sort of question.\n\nWe invited Sarah over for dinner and at the end of it laid out our request. We told her we had been saving over the years and would be willing to pay her as much as a regular surrogate would be paid (a pretty hefty fee so she would be able to take time off from work if it was required), help her out with everything she needed, plus we had no expectations that she must help raise the child just because she carried it. We told her why it was important to us and how much it'd mean, and asked her to have an open mind about it.\n\nSarah exploded at us. She said we were both out of our minds for making such a request, extremely selfish, and that we had no respect for her disinterest in children. She actually left early. Right now she's refusing to take calls from us and even went as far as to ask my husbands parents to tell us to both not contact her until she decides to initiate it herself. My husbands parents are sympathetic to us but say that we should have kept in mind Sarah's difficulties. My parents think she is behaving awfully. Most of my friends are on my side but a few have said that it was a bit of a rude request given everyone knows how much Sarah hates kids.\n\nIt's really weighing on my mind and I honestly never expected this kind of outcome. She literally blocked us on every platform she could. Are we really the ones behaving like an asshole?",
  "id": 1,
  "comments": [
    {
      "score": 21542,
      "content": "YTA. You knew she's \"vocally against having children of her own\" but you approached her anyway without first finding out how far that extends. That you had to prep her lavishly for the ask suggests you knew you were asking for something out of bounds. Your language suggests you barely respect her. Why were you even talking about this with her and your husband's parents and with your parents? And now you've damaged her relationship with others who shouldn't be involved, namely your parents.\n\nWait until she comes to you, and when she does, apologize sincerely and  profusely for not respecting her.",
      "id": 2,
      "comments": [
        {
          "score": 10242,
          "content": "YTA.\n\nOne of the things that baffle me, here, is the \"most people are on my side\" comment.\n\nOn OP's side... how? Expecting Sarah to just pop up a baby because she was asked?\n\nWhy are OP and her husband so bent upon Sarah being the surrogate mother? Why is OP going to everyone she knows bad-mouthing Sarah?\n\nOP is a unique type of asshole.\n\nThis would be bad with someone who is not child-free, but going after someone who is vocally against having children is a special type of asshole. And then shaming Sarah to anyone who would listen. including this post, because this is an attempt at hearing more people tell OP how wrong Sarah is.",
          "id": 3,
          "comments": [
            {
              "score": 5298,
              "content": "> On OP's side... how? Expecting Sarah to just pop up a baby because she was asked?\n\nBecause OP most likely views Sarah as an incubator, nothing more. The means to an end.",
              "id": 4,
              "comments": [
                {
                  "score": 3518,
                  "content": "Which is exactly why Sarah is rightfully pissed off.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2928,
                      "content": "I'm just asking you to put yourself at risk for 9 months and possibly die during childbirth. No problem, right?",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "Don’t you love it when a woman is angry, and has every right to be, and someone talks about the angry women “behaving awfully”?",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "And like OMG Sarah is angry and respectfully put boundaries up to sort her own feelings out, how dare she practice self-care",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Sarah does not want her brother's dick no matter how many Pornhub videos say otherwise.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1898,
                  "content": "Yup. And most women who don’t want kids are against them for partially that reason.\n\nAnd pregnancy and labor is horrid, very few women who have had birth enjoy that part, why would a purposefully child free woman want to be part of that? \n\nSo disrespectful to her choices. They make it seem almost like of course she’d have a kid if only she could. Not like a real and valid life choice.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 1027,
                      "content": "[deleted]",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 521,
                      "content": "I agree. Throughout reading the post, I kept thinking if she doesn’t want to sacrifice her body to have her own children, why would she sacrifice her body to have kids for someone else 🤦🏻‍♀️",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "Not only this, but it's going to be the egg and sperm of her brother and sister in law. I don't know about any of you guys, but if I had a brother I sure as hell wouldn't want any of his sperm anywhere near me, let alone in me. \n\nYTA OP. A special, entitled, and selfish asshole.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "Definitely. \"We want you to do the miserable part, then we'll get to enjoy the good part!\"\n\nYTA for sure, OP",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1117,
                  "content": "Specifically\n\n> My husband is extremely close to his family and the idea of the entire process of surrogacy **being contained to his blood** felt extremely important to him.\n\nI'm willing to bet money that OP and her husband aren't just asking Sarah to be a surrogate, they're asking her to get pregnant with a biological child, carry and deliver said child, then just give it to them for adoption. Which is also why OP makes sure to write further down\n\n>plus we had no expectations that she must help raise the child just because she carried it\n\nTrue surrogate mothers (i.e. women carrying another woman's child) have no expectations of parental responsibility anyway, because they're legally & biologically not the child's mother. That's why they're paid such a \"hefty sum\" as OP puts it. They're literally doing a job.\n\nThe only reason for OP to stress this would be if they were asking Sarah to conceive a biological child. \n\nBecause god forbid you adopt someone else's blood right OP? It's just not the same and you'd be taking on someone else's problem, right?\n\nEdit: People further down in the comments have mentioned that Sarah would not be qualified as a surrogate anyway. Surrogates have to have had at least one successful pregnancy. This convinces me more that they're asking Sarah for a biological child. Surrogates need one successful pregnancy to qualify, but any woman over 21 can walk into a fertility clinic and be artificially inseminated (with a NON RELATED sperm donor of course, since a few mouthbreathers here seem to be confused)",
                  "id": 15,
                  "comments": [
                    {
                      "score": 386,
                      "content": "ok am i a creepy weirdo but i can't find an answer to like, uh...who's DNA is inseminating her? i just...",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 366,
                      "content": "WHAT THE ACTUAL FUCK DID I JUST READ? \n\nthis guy AND HIS WIFE just propositioned his sister...? \n\nNo wonder she blocked them on everything LMFAO.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 28,
                      "content": ">I'm willing to bet money that OP and her husband aren't just asking Sarah to be a surrogate, they're asking her to get pregnant with a biological child, carry and deliver said child, then just give it to them for adoption. Which is also why OP makes sure to write further down\n\nOh, that's absolutely what's going on here. Husband wants family genetics. Well, he can't impregnate his sister. And if they use the wife's egg with donor sperm, that's not his genetics. They want the sister to use her own eggs and have a baby for them.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Also this line \n\n>> We told her we had been saving over the years and would be willing to pay her as much as a regular surrogate would be paid\n\nUm...why *wouldn’t* they pay her just as much? Do they think they’re doing her a favor by not pulling the Friends & Family Discount card?",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "I’ll never understand the obsession with having biological kids at all costs in the first place (like OP and her husband who have been stuck on the apparently impossible notion of having kids with both their genetics), but the need to “keep it in the family” with regards to a surrogate is just extra bizarre. I think you’re right.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "In which case, OP and her husband are nothing but the biggest assholes on the block here.  I wonder if anyone else knows what they were asking her to do, rather than the \"We asked her to be a surrogate\" lie that she's spinning here",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "They would have to use either OPs Egg or a Donor egg here. While \"any woman\" can walk into an IF clinic and be inseminated, literally no reputable clinic in this country would inseminate a woman with her brother's sperm. That's incest and would result in them being shut down if anyone ever found out. \n\nThat's what makes the \"in the blood\" comment the most baffling to me. If Sarah was OPs sister, it would still be super weird to use her eggs, but it would make more sense than this scenario.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 520,
                  "content": "OP is probably one of those a-holes who likes to simper “oh but you’ll change your mind when you have one of your own!”",
                  "id": 23,
                  "comments": [
                    {
                      "score": 328,
                      "content": "She wants one so badly that she can't fathom anyone having any other opinion about it.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 266,
                      "content": "I'm gonna guess this isn't the first time OP has made some snide remark to Sarah about being childfree and this was the final straw.",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "OP is pissed that Sarah isn't using her body to produce many children and is taking it as a personal offence since OP can't have a kid. \n\nIve got working legs and don't do Ironmans. Is it offensive to people without legs?",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "Well she's in her 30s and doesn't have a husband so. What else could she possibly have to do?",
                  "id": 27,
                  "comments": [
                    {
                      "score": 11,
                      "content": "*squint*\n\n\nI sincerely cannot tell is this is a /s or not",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "YTA. My biggest problem with thinking of surrogacy at all. Why not adopt one of the thousands of homeless children left feeling unloved in foster homes or facilities? \nWomen are not incubators designed and expected for you to fulfill your selfish wishes. If you want to raise children, it shouldn't matter at all to you whether they're biologically related to you or not. \nOP, you really need to reconsider your whole point of view. How dare you shame someone  for not complying to a very difficult  biological process just so you can  have a baby that looks just like you.",
                  "id": 29,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "Can you imagine? “Hey, all the wreckage of pregnancy with trauma to your body, which will never be the same again, and no consolation prize except you gave me what I wanted!”",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "imagine discovering your brother thinks you're Offred",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1152,
              "content": "\"Most people\" AKA OP's friends and family who obviously will take her side over the SIL. I doubt OP is polling Sarah's friends.\n\nOP even minimizes her in-laws' opinions about how she should be respectful of Sarah's \"difficulties\". WTF is the difficulty? Not wanting kids? Not wanting to give up her body and a year of her life to be her brother's broodmare?",
              "id": 32,
              "comments": [
                {
                  "score": 592,
                  "content": "Yeah wtf. OP and her blood-obsessed husband are having difficulties. Sarah is having and opinion and being disrespected because of it.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 218,
                      "content": "Wait, where are they planning to get the seed from then? Like, he's this is the husband's sister. Couldn't they have used any egg, and with his sperm it's still in the family... I don't think they thought this through, because that sounds real Alabama to me.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 177,
                  "content": "OP is also giving her dumbed down version of events.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 30,
                      "content": "This is an important point.  When I first read the post, I was thinking that it didn't sound so bad.  But now that I have read a few comments I realize that the whole story isn't there.  OP may be shaving a few facts to make herself look a little less horrible.",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "Also possible that Sarah has other sh\\*t going on in her life that OP didn't mention?",
                  "id": 37,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Like being childfree and not wanting to be pregnant!",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Not to mention, they’re probably not going to tell an infertile woman, who is extremely emotional that she is the asshole. Even if it’s what they’re really thinking.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Not only give a year of her life, but literally risk her life",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I picked up on that too, how bad is that? Not wanting a baby is a disability apparently. There's something wrong with her for not spawning babies and wanting to spawn everyone else's babies. I'm sure she doesn't have a job or a life of her own. Even if she did the \"hefty sum\" OP is going to give her would more than compensate for it.\n\nI can imagine OP throwing a bag of gold coins at SIL's feet and screaming \"BREED WOMAN!\"",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Yeah, that \"difficulties\" term caught my eye too. Wanting biological children and not being able to have them is a difficulty; simply not *wanting* to have them is a choice, and it's a choice Sarah has every right to make. Plus, holy shit, she'd be carrying her own brother's kid and that's a weird ask even for someone who is open to having kids, and even without the health risks of pregnancy or the potential legal/ethical/moral issues of surrogacy.\n\nI'm guessing that Sarah's not wanting kids has been a bit of a touchy subject in the family for a while, especially with her brother and OP dealing with infertility issues (which is, of course, an absolutely awful thing for people who want to be parents to deal with; I don't want to discount that at all) and this was the last straw that finally got Sarah to snap. I honestly can't say I blame her.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 138,
              "content": "Not to mention, they'd have an impossible time finding a clinic willing to implant a woman who had never had a successful pregnancy before. There's a reason these rules exist: to protect the surrogate's health and life if there are unknown factors that might make pregnancy dangerous, and to protect the clinic from liability if something goes wrong.",
              "id": 43,
              "comments": [
                {
                  "score": 10,
                  "content": "Yep. I have offered to a surrogate for a family member (they may or not take me up on it) but the criteria are strict. I qualify, but they might mandate I get a c section based on the birth of my son. No way they are letting a childfree person go through that- they want you to have had at least one successful pregnancy.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "YES! Yta \n\nIf they’d saved enough to offer Sarah what a surrogate would typically ask, then they would have the money to seek out and hire a willing surrogate. Instead, they’re choosing to pressure a vocally child-free woman whom they know dislikes children (and presumably the idea of pregnancy) by involving other family members and offering her *the same amount of money they suspect a willing surrogate would ask* to go through such a physically and potentially psychologically traumatic experience. Frankly, I’m suspicious of their motives to approach Sarah at all. This is either some next level entitlement, or they’re just not being honest about their inability to find and pay a proper surrogate going through the correct channels, and are hoping to skip a few steps with family.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I've found that most people just side with whoever is directly in front of their faces so they can avoid confrontation and awkwardness. Someone so self-absorbed that they ask their childfree sister to be their incubator is unlikely to have the awareness to consider this a possibility, so to them it seems that they're always right.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 789,
          "content": "Yea the dinner situation tipped me over to a YTA judgment. How can you not warn her you want to talk about something heavy and then blindside her at the end of dinner with a proposal you know she won't take well? If you seriously wanted to ask her but try to respect her feeling then the whole thing should've happened much more gradually.",
          "id": 47,
          "comments": [
            {
              "score": 382,
              "content": "> a proposal you know she won't take well?\n\nAnd for that matter... If you know she won't take it well, why ask at all? I'm not sure to what extent OP knew how she would react, but if there was even a chance it could go poorly then you should have done your research before dropping that on her.\n\nPeople don't want kids for a lot of reasons. It's pretty common for people to be afraid of pregnancy/childbirth; it's not just because they don't like children. Pregnancy takes such a massive toll on the body, not to mention she'd have to put her job on hold for awhile so she could be pregnant... And when it's all over, her body is never the same.\n\nYTA OP for not doing your research on her reasons for not wanting kids before you asked. Or, if you already knew she would react poorly, YTA for asking in the first place.",
              "id": 48,
              "comments": [
                {
                  "score": 30,
                  "content": "And on top of that now they are putting her in the position that they will blame her for not agreeing to have to child. So now if they don't get their biological child she feels like they will blame her.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 9,
                      "content": "And she went and bad-mouthed Sarah to her family and ops friends. That's such an asshole move. It definitely sounds like OP is trying to pressure her or blame her to the family.",
                      "id": 50,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Pregnancy and birth are huge reasons why I will never have a child. The pain, the loss of bodily autonomy, the fact you can be ruined *forever* is a huge consequence to think of.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 11,
                      "content": "> The pain, the loss of bodily autonomy, the fact you can be ruined forever is a huge consequence to think of.\n\nGod yes on the bodily autonomy thing! That horror story about the woman in (I think?) Texas who was kept on life support despite her wishes? *shudder*\n\nAnd that's like a worst case, but there's so many other things people do when you're pregnant? Randomly walking up to you and touching your stomach, trying to give their \"helpful\" advice on what you should eat or do, etc.\n\nAll for a baby she doesn't even want (or get to keep)! Why would you put yourself through that???",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 182,
              "content": ">If you seriously wanted to ask her but try to respect her feeling then the whole thing should've happened much more gradually.\n\nI don't think it's even about how quickly or gradually you lay it on the table, more like how respectfully it's phrased.  In this particular case it was insensitive to even ask - she's vocally against children, asking her to be your baby oven seems like valuing her body's utility to you over her choices as a person.\n\nIf you've just GOT to ask because you're that desperate at least be respectful.  \"I know this is a huge request.  I wanted to ask because we are so hopeful for a child but we will respect your decision.  If you have any questions or concerns we will be completely sensitive to them.  Most important to us is your comfort and the bond we have as family.  If you definitely don't want to we will understand and respect that choice.\"   DO NOT say \"keep an open mind\" as if she owes it to you to consider having your baby.  Instead say \"I respect you and your choices\" and actually mean it.  Most people won't be upset about a politely asked favor (even a huge one) if they're able to say no with some grace and dignity.\n\nEDIT:  And it should go without saying that if you actually did respect her choice you would not be asking everyone and the internet to tell you she was wrong.",
              "id": 53,
              "comments": [
                {
                  "score": 11,
                  "content": "> If you've just GOT to ask because you're that desperate at least be respectful. \"I know this is a huge request. I wanted to ask because we are so hopeful for a child but we will respect your decision. If you have any questions or concerns we will be completely sensitive to them. Most important to us is your comfort and the bond we have as family. If you definitely don't want to we will understand and respect that choice.\"\n\nEven that, in my opinion, is still not very respectful. It puts the person on the spot in such a guilt-tripping kind of way! It makes them feel like if they don't accept they'll be horrible people denying a desperate couple their last chance at being parents.\n\nIn my opinion, the best way to approach it would have been to casually mention to the family in general that they've decided to start looking for a surrogate. That way, if that's something the sister would have ever had any interest in then she could have approached them instead. If she didn't react at all, move on and look for someone else.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "And OP is presenting the SIL leaving early like that's a totally irrational move on her part. She's feeling pressured to do something she doesn't want to do, of course she hightailed it out of there.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 649,
          "content": "YTA. Exactly this. Generally when women don’t want children (in my experience) they also don’t want to be pregnant. While I’m sorry for your struggle there are so many options for children such as adoption or fostering, outside surrogate. Give your SIL space because if you don’t you may have permanently ruined that relationship.",
          "id": 56,
          "comments": [
            {
              "score": 224,
              "content": "That’s a huge factor why I don’t want children! I don’t want my body messed up from it! How insensitive of OP. YTA",
              "id": 57,
              "comments": [
                {
                  "score": 28,
                  "content": "Exactly, two words: vaginal tearing. Pregnancy seems like it's awful.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Me too. Exactly this. My uterus is closed for business. Not just because I don't want kids, but I don't want pregnancy and child birth either. I would be FURIOUS if I was Sarah...they reduce her to a Womb-for-Rent",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Children are lovely. I wouldn't mind one. But fuck being pregnant.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "100% agree with a portion of women deciding against children is because they don't want to be pregnant. It's one of my main reasons I don't want to be pregnant, and I would hope any one of my siblings would understand the catastrophic effect a pregnancy would have on me regardless of whose child I was carrying. It's also very sketchy they are able to pay the sister the same costs as a surrogate provided through a legitimate agency, but chose to go the sister route. It makes me think that they *aren't* able to pay the same as an agency surrogate. I've read a lot of posts where a relative is asked to be a surrogate because the couple can't afford to go through an agency. OP is definitely TA, and a shady one.",
              "id": 61,
              "comments": [
                {
                  "score": 11,
                  "content": "It might just be an obsession with \"blood relationssssssss\"",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 391,
          "content": "I was having a hard time with writing this one out, but thank you for explaining this so well. I second this, YTA.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 367,
          "content": "Agree YTA. The entire thing reads like \"your aren't using your uterus so can we just have it\"\n\nA huge bonus for women who does not want children is not having to deal with the horrible side effects that can happen. op so wrongly judged the situation it is offensive.",
          "id": 64,
          "comments": [
            {
              "score": 30,
              "content": "OP sounds like an offended child. Mad that the sister isnt using her gift as a woman to breed. And should be since OP cannot and it isnt fair.",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "\"You don't want children of your own, but could you just have our child for us real quick?\"\n\nI genuinely think it didn't occur to OP that that isn't how this works.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 326,
          "content": "Thank you for putting together my thoughts in such a concise way.  Jeez, OP is such an AH. What's up with all of the \"we're willing to pay as much as a normal surrogate\", \"she definitely doesnt have to help anything with childcare\". Dude. If she wants to she can just become a surrogate for other people. DEFINITELY, surely don't have to worry about later attachment/ childcare. Definitely get that amount of money.\n\nTo be clear, I don't have a problem with OP asking. It's the way it was done and  the aftermath. OP and her husband:\n- Ambushed Sarah (at the excuse of dinner)\n- Talked as if what they're offering is above and beyond. no it's not, its a given in any normal surrogacy.\n-Talked to Sarah's parents and OP's parents about this For what? Getting more people on her side? Hoping to change Sarah's mind? \n\nUgh if I were Sarah I would feel like my brother and SIL consider me as an incubator and mothing more. Wtf YTA OP.",
          "id": 67,
          "comments": [
            {
              "score": 46,
              "content": "Sarah’s supposed to be grateful they aren’t even asking for a discount for family, I guess. Lucky Sarah!\n\nIn a twisted world where this request were in any way OK to begin with, OP should have been offering Sarah *more* than the going rate for a regular surrogate, as a brood mare “of the blood” is more valuable to the husband than an unrelated womb.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Exactly. OP wouldnt be TA if she had inquired very gently with a very, very soft ask - something like, \"I know you don't want children but am not sure exactly how far that extends, so I was wondering if there was any chance you might possibly consider surrogacy - and of course it's totally OK if not...\"\n\nBut instead they did a full on sales pitch presentation, with proposed payment terms and everything, in a setting that gave her no warning and fully blindsided her. I don't blame the sister for reacting harshly to this.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 147,
          "content": "YTA. I agree, the whole idea of having to almost bribe your sil with a nice dinner making her almost feel indebted to you is awful.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 132,
          "content": "Yeah. You could have easily talked about it with Sarah in a roundabout way to feel her out, like: “hey sis, we are researching using a surrogate, let us know if you think of anyone you know who might be interested!” And bonus because maybe Sarah actually has a friend who actually likes being pregnant and sends her your way. Plus it’s much much better to use a surrogate who has already had a healthy baby of her own.",
          "id": 71,
          "comments": [
            {
              "score": 16,
              "content": "I think the best way to phrase it is just straight to the point. “Would you ever consider being a surrogate mother?” Don’t lay it out like a fucking deal up front, don’t start talking about her job as if you’ve planned out the entire thing as if you’ve already decided she’d be the surrogate, don’t put on this big dinner and show to butter her up, don’t lay it out all at once. Just “hey can I ask you something?” Follow with the question and then take things from there. If no, move on, if maybe start talking details.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": "OP is stunningly selfish. I doubt this can or will be repaired given their obvious lack of empathy.",
          "id": 73,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 98,
          "content": "I agree wholeheartedly with this comment, well put. \nOp YTA",
          "id": 74,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10974,
      "content": "YTA ... your desire for a child does not outweigh your SIL's desire to not have children -- and it seems both are well known positions in the family. It may seem reasonable to \"keep it in the family\" and \"we're trying to create a win-win\" but really it isn't. You essentially said to her, \"Since you're not using your womb mind if we borrow it for 9 months?\" Did you ever consider why she doesn't want children of her own? It's actually beyond rude the more I consider it. Yes, I am sympathetic to your plight but have only one more word for you: ADOPTION!",
      "id": 75,
      "comments": [
        {
          "score": 3182,
          "content": "[deleted]",
          "id": 76,
          "comments": [
            {
              "score": 1686,
              "content": "Honestly though. I don't want kids, at all. But I'd be open to having to take care of a child indefinitely due to an emergency or if my SO suddenly decided he really wanted kids we'd adopt. But being pregnant and giving birth? I would actually rather die. I'm so terrified every month that I'm pregnant. Given that I have PCOS, my cycle is a bit off so sometimes it's late and my SO has to deal with me panicking and being very averse to touch for a good week or so.",
              "id": 77,
              "comments": [
                {
                  "score": 745,
                  "content": "This right here. I want to be a mom but I don't want to be pregnant.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 1465,
                      "content": "adopt, don’t pop!\n\n(get it like adopt don’t shop)\n\ni’m leaving bye\n\nedit: thank you for the silver! i love how my top comment is about popping humans out",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 424,
                      "content": "No body trauma of pregnancy and in many places additional government support AND you're giving a kid a second chance at life.\n\nUnpopular opinion, anybody who can't conceive naturally and seeks out a surrogate is selfish as fuck. In general having children over adopting is selfish, but much more understandable.",
                      "id": 80,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Same. My mom is so against me adopting, though, cuz her brother was adopted and barely speaks to the family anymore. There’s a lot more going on there, though.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 263,
                  "content": "That's the point I'm at too. If the situation conspired that my partner and I had to take care of his daughter or our nephew fulltime, I'd make that work somehow.\n\nBut god, pregnancy is pure body horror to me.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 125,
                      "content": "god I'm glad I'm not the only one. Honestly thought I was going fucking crazy for thinking this way.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I agree and I lived through one. I'm genuinely confused by people who have more than one pregnancy. Surely one full body reassembly alien crawling inside you body sliced open to remove it experience is enough to be like, well that's definitely never happening again.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Same. I don't want to raise a kid and give up my life, but I would adopt my niece/nephews in the event of an accident/ emergency. I 100000% do not want to be pregnant. I would rather die than give birth",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 773,
              "content": "30 weeks pregnant with #2 here.\n\nYour position and feelings are 100% valid. Seriously, this pregnancy has been a breeze compared to my first and it's still completely horrible, if not for the fact that I get my badly wanted baby at the end of it, I'd never want to do this.\n\nI hate when people act like pregnancy is not a serious thing, like \"Oh, you just throw up a bit, eat some extra food, deal with discomfort and then you're done! No dude. No. NO ONE who doesn't want to carry a baby should ever be forced to.",
              "id": 86,
              "comments": [
                {
                  "score": 680,
                  "content": "[deleted]",
                  "id": 87,
                  "comments": [
                    {
                      "score": 208,
                      "content": "If it helps, It's pretty common to forget a lot of it. Like l can remember a lot of it sucking but the memories aren't super clear.\n\nBut no one, no one should go through it without wanting to.",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "I agree. Being pregnant is absolutely awful!! I felt so much better after giving birth that taking care of a newborn was easy.  I actually got more sleep with a newborn than I did while I was pregnant.",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 35,
                  "content": "Absolutely, and even if you have amazing pregnancies and births, your body is never quite the same again. I have kids, but I do still secretly mourn the toned, stretch mark free body I had before. Fine for me, I wanted my kids and was well prepared to sacrifice that for the 'prize'. The thought of being left with a mum bod when you definitely don't want children... ugh... def lose-lose! OP, YTA",
                  "id": 90,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Yes! And the pregnancy is one thing - there's also the after effects. My daughter was born by emergency c-section nine months ago, and I still feel pain from my scar, and my body looks and works nothing like it did before pregnancy.\n\nThe effects of pregnancy don't necessarily end when the baby born.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 287,
              "content": "I’m 90% child free and it is *because* of pregnancy. I’m open to the idea of raising a kid, it doesn’t really interest me and I would only want to do it at a certain level of financial stability, but what I’m 100% closed to is the idea of pregnancy. I don’t want 9 months of potential misery and discomfort, followed by a painful vaginal explosion. This would literally be my worst case scenario and I would be incredibly offended to be asked as I’m very open about not wanting to birth children. Anyone who would be close enough to possibly ask should be aware of this.",
              "id": 92,
              "comments": [
                {
                  "score": 55,
                  "content": "My bf is a fence-sitter and I'm almost certain I don't want children. But if I ever do want them, I hope they've invented a way for men to carry full-term like sea horses because I'm not doing it. I have lost a lot of weight and work really hard at the body I have now, already have the tiniest but of skin at the belly, I don't want my body to get destroyed by a baby.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": ">followed by a painful vaginal explosion\n\nliterally. one thing i've learned from studying human anatomy and physiology is that childbirth is fucking horrifying.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "I'm 38 weeks in with my second planned and wanted pregnancy. My first was an absolute walk in the park but this one, despite being uncomplicated as far as pregnancies go, has knocked me for six.\n\nPre children I had definitely entertained the THOUGHT (never said it out loud) that childfree people would probably change their minds later but now if it ever comes up I validate the shit out of that as a choice. It is easily the hardest thing I have ever done being a parent.\n\nOP seems like she's in the camp of people who doesn't realise how taxing pregnancy actually is and just thought it's as simple as popping the kid out and returning to normal life. It's a definite YTA situation for completely disregarding the sister's feelings but I'm hoping it's out of ignorance and not malice.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I desperately want kids, and everything about pregnancy, birth, breast feeding, and beyond terrifies me to my core. I really cannot comprehend why anyone thinks this isn't a big deal to ask of a woman.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I was scrolling through to find this POV. I don't want children, and a not insignificant part of that decision is that pregnancy freaks me out to the extreme. I also take psychiatric medication that I would have to discontinue for the duration of the pregnancy and am at heightened risk for PPD, so I don't think it would even be safe for me to undergo pregnancy. If the sister's stance on having children is so well-known, I don't think it's unlikely that she may have voiced opinions about pregnancy in particular as well as it falls under that umbrella. I wonder if OP asked in spite of that knowledge. Either way, I think OP YTA.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "i can agree. If i ever got pregnant and couldnt get an abortion i'd kill myself immediately.",
              "id": 98,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 536,
          "content": "They also say they had enough to pay her the actual surrogate fees amount to! Why don't they get an actual surrogate? \n\nMost surrogates have children of their own already and know what pregnancy is like going into the transaction.  It almost sounds like OP expected sister to look at them asking as a gift. \"Look what we're willing to let you be part of?\"\n\nMy brother and his wife who can't have kids always expected me to have an oops baby and hand it over to them. As if that's not an insult, I dunno what it. I'm really grateful they never went so far as to ask me to carry for them though!",
          "id": 99,
          "comments": [
            {
              "score": 174,
              "content": "Hol' up.\n\nYour brother and his wife expected you to have an oops baby? Like.... Holy shit, yes that is an insult on so many fucking levels.",
              "id": 100,
              "comments": [
                {
                  "score": 43,
                  "content": "To be fair.... I've always been a bit of a wild card, irresponsible and nomadic.",
                  "id": 101,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 24,
                  "content": "That's basically what OP is asking.  The SIL doesn't qualify as a surrogate in much of the world because she hasn't had her own kid.   \n\nThey want her to have a kid and adopt it to them.",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "If they had money for a surrogate then they have money to adopt.  This whole post is an entitled persons problem because they can't force people to do things their way and think that money and wanting something bad enough is enough for everything they want in life",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "[deleted]",
              "id": 104,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Because her husband wants the blood. THE BLOODLINE MUST PREVAIL.",
              "id": 105,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 217,
          "content": "Or go to somone who is a willing surrogate. There are agencies women sign up for in order to do just this.",
          "id": 106,
          "comments": [
            {
              "score": 34,
              "content": "And they tend to be women more experienced in pregnancy and are making an informed choice. Sarah even if she was willing would be going in blind.",
              "id": 107,
              "comments": [
                {
                  "score": 10,
                  "content": "Exactly, every surrogacy service I've ever looked into pretty much requires prior pregnancy.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 206,
          "content": "Yeah, what's Sarah's \"win,\" exactly? It's not like they're buying her a house. They're offering to cover the expenses of a pregnancy, which they would anyway.",
          "id": 109,
          "comments": [
            {
              "score": 73,
              "content": "This was my thought too. OP asked Sarah to give up 9 months of her life, endure the hardships of pregnancy including any complications that may arise, endure the pain and process of childbirth including potential complications during birth. And so many risks! \n\nSo many ways this could dramatically impact Sarah, and what's offered in return? They'll pay her the going market rate for surrogates. Not having to raise the kid isn't a win for Sarah either. She's already not raising any kids.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "OP is absolutely the asshole for all the reasons you and other comments have stated-- but I will also addd that surrogacy requirements almost always stipulate that the woman previously have had, and be finished having, her own biological children. Not only is OP an asshole, she seems ill informed about the actual parameters for a surrogate.",
          "id": 111,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Not only was I going to mention adoption but also Sarah wouldn’t even be allowed to do this. I could be wrong but I really really think that in order to be a surrogate you have to have had 2 healthy full term pregnancies yourself already",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I’m child free as well. I don’t hate children, just not for me. However the thought of the damage your body goes through to have a baby is frightening. They are asking her to destroy her body for them to have a child. If someone came to me and asked me I probably wouldn’t have blown up in this what but I would have said no.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Man, if I could only physically lend my uterus out I would be all over that. Here, take it, make babies to your heart's content. No, no, keep it, I don't need it. No, pass it on to your friends!\n\nSorry, your wording just gave me a chuckle.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7857,
      "content": "YTA. The lengths people go for children when nature says over and over it’s not in the cards for them will never cease to astound me. \n\nYour sister in law was clearly anti children and you asked her to perform the most difficult phase of having children for your own child? I get that you can’t get pregnant yourself but can you at least think about the emotional toll it would be to get pregnant with your brother’s child, carry it to term, GO THROUGH BIRTH, and then no matter if your feelings change and transform the child YOU carried is then taken from you to be raised by your brother and sister in law. How can you not understand the weight of what you are asking?\n\nOh, but it means so much to your husband to have a blood relative carry it. What the actual fuck? If you have the money for a surrogate then hire a surrogate. Do you know what a surrogate is? A professional child incubator who has chosen that profession so people like you can try for a child at all costs. \n\nDespite me thinking you are incredibly selfish for trying to force a child genetically no matter that there are so many unwanted children in the world, I do believe you have a right to ask her. However that doesn’t mean she doesn’t have the right to be offended, grossed out, and angry that you would even ask. I understand that you are desperate for a child created from your and your husbands genetics and are probably blinded by your “desire” but holy shit.\n\nEdit: I’m quite fired up about this and I keep thinking of things. I hope this truly is a shit post.\n\nWhat if she miscarries? What if there’s a developmental defect and you and your husband want to abort? First of all unless you did all of this legally you could potentially be forcing her down a difficult road. You don’t know if the problem is your eggs and your husband’s sperm. How many miscarriages could she suffer? His own sister! How would you handle it if you wanted to abort? Thinking about how fired up and in shock I am and I’m a perfect stranger the more I understand the magnitude of Sarah’s reaction. Fucking insane.",
      "id": 115,
      "comments": [
        {
          "score": 1415,
          "content": "All of this is exactly why I think this must be a shitpost",
          "id": 116,
          "comments": [
            {
              "score": 1865,
              "content": "You wish... Some people aren't capable of thinking about others feelings. Just look what exactly OP wrote: **we** want children, it's difficult for **us**, important for **my husband**, so **we** thought it's okay.",
              "id": 117,
              "comments": [
                {
                  "score": 523,
                  "content": "But the level of cluelessness and entitlement oozing from the post is astonishing. I really hope that you’re wrong and it isn’t just wishful thinking that someone just decided to tick all the trigger boxes.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 320,
                      "content": "Trust me, I wish half of those posts were fake. But unfortunately I do know people who behave like that. Or worse. That's why I treat almost everything like it was the truth.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 96,
                      "content": "No, there are plenty of prospective/parents who really ARE just that self-centered & oblivious.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 52,
                      "content": "No, I have family members that 100% would do this.  This isn't that uncommon.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 186,
              "content": "[deleted]",
              "id": 122,
              "comments": [
                {
                  "score": 60,
                  "content": "This is what has me thinking this is a shit post. As an infertile couple, you want the best chance to have a child, and not just wing it with a childless SIL.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 41,
                      "content": "If it's real, it sounds like 'keeping it in the family' is more important to the husband than his sister's health.",
                      "id": 124,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "that and the super popular post the other day about the wife lying that she was a surrogate because she was cheating. these shitposts come as themes for people who think they're creative writers.",
                      "id": 125,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "I dunno, sounds like out of all the considerations, the “must be biologically related to the husband” angle is the one they’re prioritizing. Otherwise why not avoid the million complications of involving family and just hire a normal surrogate?",
                      "id": 126,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "It's not. It's this weird infertility sub-culture thing where they spend time on sites like baby centre and circle jerk until they legitmately believe they have this untouchable grief where they can behave in any way they want around babies and pregnant people and making demands from relatives and friends and doctors and are owed every trigger warning and hushed voices and everything. MANY of them are this bat-shit.   \n\n\nI ran into in quite a distressing and personal way on the trying for a baby sub which bills itself as a general trying for a baby sub, meaning that supposedly no matter what you can post to the sub. There are separate infertility, trying to concieve and infant/ baby loss subs, which aboslutely should be safe spaces. This one is supposed to be general.   \n\n\nAt the time of my post (on a different account) I'd had three live births. A 32 weeker, a 37 weeker and 36 weeker. We almost lost my 32 weeker to incompetent cervix, we'd taken a year to concieve my 36 weeker due to some pretty crazy gynacological issues (so while a year is normal, this was a particularly fraught and scary year) and I get SUPER sick while pregnant and there's a ton of medical stuff, surgeries, injections. Pregnancy is miserable for me  \n\n\nI basically laid it all out, not in a bitching way but \"Here's my journey, it's been rough.\" And then said we were excited but anxious to be trying for my 4th.   \n\n\nI got torn to shreds. It's hard to explain what they were saying without implying I'm glossing over what I said in the first place but basically the upshot was that I wasn't allowed to talk negtively about pregnancy because some people would give anything to be pregnant and I was selfish thoughtless monster.   \n\n\nWHACK A DOO. \"My baby almsot died, it was terrfiying.\" SHRILL SCREECHING \"Well she didn't, so stay in your lane!\"",
              "id": 127,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "I doubt it is. I was asked by my MILs neighbor to be a surrogate for her and her husband a week after my first child was born. I had only met her a handful of times before this.",
              "id": 128,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 706,
          "content": "I’ve always found it crazy how it’s “gods will” if a woman is raped and gets pregnant so she MUST have the baby because *religious screeching*, but if a woman can’t have a baby, suddenly it’s a-ok to play god and do whatever is necessary to get her pregnant. Makes literally no sense to me other than people honestly believe that women are incubators, nothing more, and no one actually cares about the life of the child.",
          "id": 129,
          "comments": [
            {
              "score": 38,
              "content": "In defense of religious people on this front (ugh)...IVF was also something that was fought against by the Vatican and Vatican still doesn't approve.",
              "id": 130,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "my husband mentioned that once. His mom wouldn't talk to him for months.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "People often and pick and choose what they want to preach when it comes to religion.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": ">people honestly believe that women are incubators, nothing more, and no one actually cares about the life of the child\n\nYep. That's correct.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 340,
          "content": "Not to mention she's been telling everyone who will listen about this plan and his sisters refusal. I'd be mortified enough that someone was self centered and disrespectful enough to ask me this, let alone telling all their friends and OUR family to try and get me to change my mind or look like the bad guy.",
          "id": 134,
          "comments": [
            {
              "score": 39,
              "content": "Right? OP sounds like a narcissist.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "This!! Now everyone is looking at Sarah different because of it. Her FKCN choice!!!!! Should’ve left it at that, not seek validation that the request was reasonable. It wasn’t!!!!",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 280,
          "content": "I think it is a shit post because most surrogates have to have already carried a child to qualify, because of many of the reasons you have listed among others. It is even written into the gestational surrogacy statutes in most states that surrogates must have carried a baby to term. It is too big of a gamble, both financially and emotionally.",
          "id": 137,
          "comments": [
            {
              "score": 197,
              "content": "Also they're clearly not using a surrogacy agency, and 'common sense' doesn't seem to be a relevant factor here.",
              "id": 138,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 98,
              "content": "That is only true for surrogates through professional organizations.",
              "id": 139,
              "comments": [
                {
                  "score": 15,
                  "content": "Not for gestational surrogates in many states, definitely NJ and Texas for example.",
                  "id": 140,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 39,
              "content": "I was under the impression that the rule about having a child previously only applied to professional surrogates?\n\nI don't think the rule would apply in cases like this, where everything is privately handled and the surrogate is a volunteer for the couple. Definitely preferred (since you never know what to expect when a woman hasn't been pregnant before), but not required.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "It may not be in the US.",
              "id": 142,
              "comments": [
                {
                  "score": 19,
                  "content": "That’s true! I know nothing about surrogacy on the international level.",
                  "id": 143,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 124,
          "content": "This!!!! Like op knows she doesn’t want kids, so they just ask her to sacrifice some bodily autonomy so they can have one?! And it’s basically unheard of for a surrogate to be a first time pregnancy. Clearly this was a half-baked and selfish plan on the part of op and her husband. YTA in the most aggressive sense.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 124,
          "content": "If she can afford to pay a surrogate then she can afford adoption.\n\nsource - we adopted our son at birth",
          "id": 145,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "And if it's twins (multiple egg insertion) it will affect her body even more...",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I have a feeling the sister wasn’t just pissed that they asked her but how they asked.  They asked her to keep an open mind and how wonderful it would be for them but no where does she state that they told the sister they would understand and respect her right to say no.  They asked in a completely selfish way with zero respect for the sister as a human being with feelings and now they are playing the victim because THEY didn’t get what THEY wanted.  They didn’t ask this huge monumental decision in a way that the sister would feel comfortable saying no because they didn’t want to hear no. \n\nYTA OP.  Not just for the ask but for the way you asked because in your self involved head you didn’t want to give her the option of saying no.",
          "id": 147,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3914,
      "content": "YTA Honestly, it should be expected that a woman who wants no kids would also not want her body used for the very thing she is so against. It's inappropriate and disrespectful as hell to ask that of someone who would by all means be against it.\n\nYou didn't just ask her to be a surrogate, you told her that you don't give a damn about what she wants, and that her childfree status means jack shit to you. You wanting to have kids is not above her wanting to stay childfree and keep her womb unused.\n\nEdit: Also, your lack of responding to comments this whole time makes me wonder if you made this up to rile people up. And if not, then you are either leaving something out or are straight up lying about certain shit. If she \"exploded\" then I wonder if you just kept being up her ass wanting a yes and that's why, or she said no while being a bit peeved and you decided that equaled explosive. \n\nWhat are you not telling us, OP?",
      "id": 148,
      "comments": [
        {
          "score": 1064,
          "content": "Who makes a giant gesture of asking without knowing if the other person would even be okay with it? Never even gauging the possibility with casual conversation before, like \"We were thinking of the possibility of using a surrogate because we're having so much trouble. You probably wouldn't want to do that right? Yeah just checking.\" I doubt she would have recoiled with such horror and offense in casual hypothetical conversation. But to invite her over for dinner then ambush her...\n\nOf course they didn't check about the sister's feelings, they didn't care.",
          "id": 149,
          "comments": [
            {
              "score": 541,
              "content": "OMG THIS!!! Like you couldn’t bring it up in passing or a joke to gauge her reaction? The formal dinner and shmoozing is so freaking slimy.   Why isolate and ambush someone like that! And if you can afford a surrogate, GET ONE and stop trying to making things extra emotional and complicated.\n\nEdit to add: and OP says “laid out our request” holy shit. I really wish I had a transcript of this “request” convo. I can’t even imagine what type of selfish language they used when REQUESTING to use someone else’s womb. Put SIL’s preferences about children aside, this is so offensive.",
              "id": 150,
              "comments": [
                {
                  "score": 55,
                  "content": "Husband is probably the one with fertility problems and refuses to raise \"someone else's\" child hence all the staying in the family and his blood line crap in the post.",
                  "id": 151,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I doubt it.  They have to artificially inseminate her with their combined sperm and egg.  If they could do that they could do the same thing with wife.  Probably a uterine issue.",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 136,
              "content": "The sister likely feels like they don't know her at all and don't respect her choices. I don't blame her for being so angry. If it were me I might not have yelled about it but the relationship would for sure be damaged.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "It’s funny that they have all the fucking time in the world to blab and talk shit about Sarah turning them down to family and friends yet didn’t even take 10 minutes to simply ask her if she *thought* about surrogacy. \n\n\nI find it hard to believe everyone knows Sarah is against children yet her own brother and SIL doesn’t know whether she’d even be ok with being pregnant. It’s likely something Sarah would’ve mention. Like whenever I talk about not wanting children with people, the “why” always come up and the physical act of giving birth is one of the most common subject.",
              "id": 154,
              "comments": [
                {
                  "score": 9,
                  "content": ">\tLike whenever I talk about not wanting children with people, the “why” always come up and the physical act of giving birth is one of the most common subject.\n\nYuuuupppp. I’m not necessarily averse to raising a child. Not what I want, but life happens. It’s pregnancy - specifically delivery - that makes it a hard no for me. And if by some freak I Didn’t Know I Was Pregnant accident I ended up having one, I would sure as shit want to keep it!",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "YTA - It was a sales pitch! It was like \"Just hear me out, we will pay you x, do don't have to do y, blah blah\" like they were selling her a mattress. Freaking unbelievable. Didn't even put out a feeler. Went straight to the hard sell.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Like the Jumbotron proposal of questionable favors",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "That’s the worst part! They buttered her up and treated her nicely, then boom asked to use her uterus for the next nine months. \n\nI just gave birth, and I am not sure I want to go through that process again for another child. I can’t imagine doing it for someone else’s kid.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "This! Also they asked her to keep an open mind... honestly I dunno why that part makes me so angry for this woman but it does. Being ambushed with all of that and then being asked to keep an open mind? Fuck no, like why don’t you keep an open mind about hiring a surrogate who actually signed up to do this lol",
              "id": 159,
              "comments": [
                {
                  "score": 9,
                  "content": "Because “have an open mind!” implies she hasn’t really thought about it. There’s no conceivable^lol angle they have to make her reconsider. She’s made it clear she has no interest in children of her own (without any caveat), why would she want to do the most physically taxing part (the part that’s most likely to kill you) for someone else’s benefit? And then just hand off what may very well feel like her baby to someone else. \n\nIt’s just like “you’ll change your mind someday!” but somehow so much worse. \n\nYTA, OP.",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "[deleted]",
          "id": 161,
          "comments": [
            {
              "score": 29,
              "content": "As someone who is child free I just have  to say that someone simply saying \"I don't want kids\" is NOT a selfish reason to remain child free. There is no such thing as a \"selfish reason\" when deciding NOT to have children but there are many selfish reasons to have children.",
              "id": 162,
              "comments": [
                {
                  "score": 16,
                  "content": "I have heard many selfless reasons to not have kids. I have heard zero reasons for why creating a kid can at all be selfless.",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "It amazes me that OP plainly interprets“not wanting kids” as just not wanting to *raise* kids, like pregnancy isn’t a big deal.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Thank you!!!\n\nYTA \n\nWhen I say I don’t want kids I mean I don’t want the WHOLE PROCESS. Not that I don’t want to raise one. Raising  isn’t the full issue here \n\nSome people become  incredibly selfish when they can’t have kids. While I don’t think I will ever understand her husband thought process of the surrogate being blood related. I think it’s pretty shitty to approach  someone who’s never had a kid to have your kid. Even if she DID want Kids being pregnant for the first time with someone  else’s kid is probably double as stressful. \n\nHow can you do that? Find the aunt who’s popped  out 3 before you go to the fresh meat. \n\nExcuse my emotionless language here, but Op is asking her sister in law to be a breeding cow, there are literally heffas who’s job it is to breed for those who can not and she decides to ask a dairy cow instead. You have full fucking agencies\nWhere women will WILLINGLY let you use their body for your kid. You clearly don’t care about price you’re willing to pay her just as much. It seems all around selfish. \n\nI fully expected to come in here and be like “no asking doesn’t make you an asshole” but she knew about how she felt about kids, and still did this, major asshole move. Also you’re asking a 30yr old to give up her life for your spawn. if I’m 30 and single I’d basically be giving up dating and casual sex for a year for someone else’s happiness and I guess 20k, but F that.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3100,
      "content": "> vocally against having children of her own   \n>  \n> bit of a rude request given everyone knows how much Sarah hates kids. \n\nYTA",
      "id": 166,
      "comments": [
        {
          "score": 1140,
          "content": "[deleted]",
          "id": 167,
          "comments": [
            {
              "score": 555,
              "content": "Sarah: I hate kids and am vocal about not having them\n\n\nOP: Hey do you want to have a kid for me and your brother? We’ll pay you and everything. \n\n\nSarah: No, and I can’t believe you asked that. Don’t contact me until I’m ready. \n\n\nOP: *shocked Pikachu face*",
              "id": 168,
              "comments": [
                {
                  "score": 202,
                  "content": "Don't forget \n\nOP: *asks everyone around me to give their opinion on whether I'm wrong*",
                  "id": 169,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 502,
              "content": "I love how she asks \"are we really the assholes\"  because you know, anyone that doesn't want to be pregnant with their brother's kid is clearly an asshole... Even if it's not biologically his it's still messed up.",
              "id": 170,
              "comments": [
                {
                  "score": 84,
                  "content": "> Even if it's not biologically his it's still messed up.\n\nI've read it over a couple of times now, and it seems like the child *would* be his. If the problem was with his sperm, they could use a sperm donor. It looks like this would be OP's egg and Husband's sperm. Inside his sister.\n\nPlease please please let this be a shitpost. Or let me have terrible reading comprehension.\n\nI feel physically sick, and I can't imagine how violated I'd feel in the sister's place.",
                  "id": 171,
                  "comments": [
                    {
                      "score": 71,
                      "content": "Not just that, but there is a reason why it's preferable to go to a surrogacy center/agency. OP's SIL is not a proven carrier.  They have zero fucking clue if she can carry a baby. \n\nEvery women in those agencies have carried children to terms with no or very little complications. They are in good health and already have the baby body. What do we know of the sister's anatomy? Does she have wide hips that facilitate birth? How's her bone density? OP knows nothing about what it takes naturally to carry and come out alive or unscathed. She's saying that she wants a baby more than she fucking cares for he in-laws health and life! It's not just about carrying a child. \n\nVerdict is a YTA and FU. Because that's just... wow.",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "I just saw this Episode of friends as the other night. Maybe it prompted a little free write.",
                  "id": 173,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 613,
          "content": "Sarah: I'm not doing this whole kids thing, like, ever.  Nope.  Not happening.  Never.\n\nOP: But will you do it anyway, for my sake/your brother's sake?\n\nSarah: No!  Did you not hear what I literally just said?\n\nOP: \\*shocked pikachu face\\*",
          "id": 174,
          "comments": [
            {
              "score": 108,
              "content": "Sarah: I don't want kids, at all, nope, hate 'em.\n\nOP: But would you go through the literal WORST part of having children for our sake? Pretty please with a nice dinner on top? We'll pay you! We need your uterus specifically for that special blood connection!\n\nSarah: shocked, angry and disgusted\n\nOP: *shocked pikachu face*",
              "id": 175,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 286,
          "content": "[deleted]",
          "id": 176,
          "comments": [
            {
              "score": 52,
              "content": "She tried to buy her SIL’s womb as though it were a single use, disposable commodity.",
              "id": 177,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "To add: if she had been open to surrogacy she would have offered it at some point throughout all these years.",
              "id": 178,
              "comments": [
                {
                  "score": 14,
                  "content": "Women who haven't had kids previously, generally don't qualify to be a surrogate, through most reputable agencies anyway. Because it's not known if they *can* carry to term.",
                  "id": 179,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Someone who has no interest in having their own children is extremely unlikely to want to put their body through having a kid for someone else. Like, holy fuck, it will literally change the way her body operates for the rest of her life.",
              "id": 180,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "YES to all this.\n\nAnd as I said elsewhere, it’s not just the pregnancy and surrender of the baby that stay with her her whole life. That kid is going to be around. At every family event, every holiday  celebration, every time Sarah goes to visit her parents who might be babysitting or will probably have tons of baby pictures and kid pictures lying around, it’s all a relentless neverending reminder of the one thing she never wanted.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2216,
      "content": "[deleted]",
      "id": 182,
      "comments": [
        {
          "score": 1057,
          "content": "And I don't get how it's somehow *better* to have your *sister* carry *your baby*. In my mind that makes it so much weirder!\n\nI wonder if it has to do with them wanting a level of control they know they wouldn't get with a professional surrogate.",
          "id": 183,
          "comments": [
            {
              "score": 567,
              "content": ">a level of control they know they wouldn't get with a professional surrogate.\n\nThis. The fact that the OP is already amassing family members onto \"her side\" is a harbinger of the sort of effed-up manipulation and total loss of privacy the sister would have been in for if she actually went through with this. From what she ate to which doctors she saw to her fitness routine... my skin crawls to imagine just how much OP's family would be all up in her business and all over her choices. Just yuck.",
              "id": 184,
              "comments": [
                {
                  "score": 78,
                  "content": "Everyone can downvote me or I can get banned but I’m saying it \n\nI really hope OP never gets to raise a child. No child deserves that. I came from a controlling family like that. You spend the rest of your life attempting to fix that damage, that job is never ever done.",
                  "id": 185,
                  "comments": [
                    {
                      "score": 27,
                      "content": "Yeah, I have to say... OP sounds like an absolute narcissist. I can only imagine what she'd be like to a child later down when they don't bow to her \"requests\".",
                      "id": 186,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 53,
                  "content": "Geez imagine how controlling they'd be if they did end up with a baby.",
                  "id": 187,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 139,
              "content": "It worked in Friends! And we know TV is just like real life.",
              "id": 188,
              "comments": [
                {
                  "score": 35,
                  "content": "To be fair, Frank was pretty weird from the get go.",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "I know you're making a joke, but honestly even in Friends the entire narrative around it is that it was weird and it shouldn't have worked. Phoebe even enjoys weirding people out by saying \"I had my brothers babies\" and watching them freak out. Even *she* knew it was weird. The fact that so many people like OP exist who act like it's no big deal and not weird at all blow my mind.",
                  "id": 190,
                  "comments": [
                    {
                      "score": 10,
                      "content": "The other thing is Frank and Alice asked because they couldn't afford to hire one.\n\nEdit: punctuation",
                      "id": 191,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 41,
              "content": "\"Congratulations!\"\n\n\"Thanks, it's my brother's!\"",
              "id": 192,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 38,
              "content": "It feels like incest with extra steps... It really grosses me out.",
              "id": 193,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 29,
              "content": "On top of this they want her to carry her brother's baby!",
              "id": 194,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "This right here... it is SUPER weird to ask your SISTER to carry your baby...",
              "id": 195,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 415,
          "content": "Was waiting for this one. It's not medically recommended for a woman who has never given birth to be a surrogate, right?",
          "id": 196,
          "comments": [
            {
              "score": 383,
              "content": "It's actually prohibited. The vast majority of surrogacy agencies (and all reputable ones) won't allow for a first-time mother to be a surrogate. There's a host of emotional, mental, and physical complications that make it unwise for someone who has never had children before to become a surrogate.",
              "id": 197,
              "comments": [
                {
                  "score": 29,
                  "content": "Also most countries do allow a surrogate to be named (even if the egg isn’t hers) the biological mother and allow her to go for parenting rights. Some surrogates do decide to do this, and its a larger risk for first time surrogates as there is bonding with the baby.",
                  "id": 198,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "They were just going to do it the old fashioned way. You know, since it's so important the sister carries it.",
              "id": 199,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 27,
          "content": "This is why I suspect a shitpost - anyone who has done any amount of research into surrogacy would find that rule #1 is that the surrogate must have had one child before.",
          "id": 200,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "THANK YOU!  I cant believe I had to scroll this far to find someone else absolutely creeped the fuck out by asking their sister to carry his baby.\n\nIs this Game of Thrones?\n\nNot only is this one of the biggest YTA I've ever seen. It's also the creepiest.",
          "id": 201,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2153,
      "content": "YTA. I’m trying to say that as kindly as possible but why would you think someone who is adamantly against having children would want to carry yours? If your husband is that close to his sister, I would have thought that he would know better than to make such a tone deaf request. Also, it may be unrelated, but the “important to keep this surrogacy confined to his blood” bit makes me roll my eyes so hard. Your parents are of course only going to see this from your point of view so their opinions on how your sister in law feels or reacted are unnecessary. At the end of the day, you guys should have considered your sister in law’s feelings way more than you did. You asked a massive favor of someone who has made clear they want nothing to do with children, which probably tells her you don’t care at all about her or the things she wants for her life, you just saw her as a potential womb. You’d probably do well to hold off on contacting her until she’s ready.",
      "id": 202,
      "comments": [
        {
          "score": 748,
          "content": "Why do you think ANYONE who hasn't explicitly said they want to be a surrogate would want to do this? I'm not against kids, I want my own, but I wouldn't want to spend year getting pregnant and carrying a baby for anyone else, let alone a disrespectful brother who has no sense of boundaries and his crazy wife.",
          "id": 203,
          "comments": [
            {
              "score": 262,
              "content": "this.. being pregnant is tough. a shit ton of hormones and other stuff messing with your body, if you get extra lucky you'll be vomiting for months and possibly need surgery in the end. I understand that for many women that is worth it, but it usually is because they get a fucking child in return. not some money that is basically money she could've earned easier just keeping working. i don't judge anyone who actually wants to be a surrogate but there is a reason that most of the women who do live in developing countries where for them this is the only method to make this big an amount of money.",
              "id": 204,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 139,
              "content": "Right? My god it's so entitled. I don't think just any person can surrogate, it takes a certain mindset for sure. It's not just\" loan me your womb for a year would you\".",
              "id": 205,
              "comments": [
                {
                  "score": 29,
                  "content": "Not to mention as a very small technical aside, most IVF places require surrogates to have successfully carried a previous pregnancy (last I heard anyway).",
                  "id": 206,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "I have had a baby and there is just no way I could ever be a surrogate, ever.  Pregnancy and birth is so hard, and having to give away the baby after all that would just be so hard.",
              "id": 207,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Also, I don’t want kids but I would hate the idea that if I did have a full term pregnancy, someone else would be raising my kid. Like, as child free as I am, the idea of watching someone I know raise my kid sounds fucking awful.\n\nIf at any point I get pregnant, I wouldn’t want to carry to full term and give birth regardless of if someone else is dealing with the actual child. Child free isn’t just “I don’t want to deal with kids,” it’s also “I don’t want my offspring to exist in the world.” \n\nThe idea that “Just let someone else raise your kid!!!” is thrown at child free women misses the point entirely when it comes to a lot of thr reasons some of us don’t want kids. It’s not just the child raising part that we don’t want.",
              "id": 208,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "YES! The only people I would ever even dream of asking are women who have had multiple babies and openly expressed their love of being pregnant (and even here you would have to be *very* tactful) or women who have signed up to participate in a surrogacy program. Literally anyone else would be madness to assume they’d even be open-minded about the idea.",
              "id": 209,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "Am I the only one who’s weirded out by the idea of essentially carrying my own brothers child? All other reasons considered, OP and her husband were totally out of line. Yikes",
          "id": 210,
          "comments": [
            {
              "score": 16,
              "content": "I mean this sister was only asked to be a holding cell for the baby, but yeah I know what you mean it sounds awful banjoish.",
              "id": 211,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "I'm less weirded out by the biology of it and more weirded out by the thought of seeing 'your' kid at holiday gatherings. It's not gross but it's emotionally sticky.",
              "id": 212,
              "comments": [
                {
                  "score": 19,
                  "content": "Very weirded out by that too! I see a few (not mutually exclusive) shitty possibilities: \n\n-\t**Sarah could die.** (thanks u/221B_BakerSt_ for noting this oversight)\n-\tLiterally anything that could go wrong with a pregnancy is going to be so much worse, and could be A Thing in the family for *decades*. \n-\tWomen are policed for doing just about anything while carrying their own child. I can’t imagine how that would be when it’s someone else’s child. (Someone who really, really wants a kid, too.) \n-\tSarah would be getting the pregnancy attention and fawning. She might hate that, and it could make OP very jealous. \n-\tDelivery would be an absolute minefield. Christ, what a mess. \n-\tSarah, as a result of the deluge of hormones that come with pregnancy, feels very close to the child. OP, who has been struggling to have a child of her own, does not like this. \n-\tThe child, as a result of living inside her and hearing her voice for nine months, is very close to Sarah. Babies bond with their mothers starting in the womb. Even just a perceived closeness could cause tension. \n-\tSarah feels pressured into doing it, resents her niece/nephew for consuming a year+ of her life. (Sarah is in her early 30s. That’s a very goal-oriented time for many people. Pregnancy doesn’t support any goal other than the one we know she doesn’t have.) \n\nI’m sure there’s more. This is a terrible, terrible idea. I’m not a fan of surrogacy but one of the benefits is much stronger boundaries.",
                  "id": 213,
                  "comments": [
                    {
                      "score": 13,
                      "content": "[deleted]",
                      "id": 214,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": ">why would you think someone who is adamantly against having children would want to carry yours?\n\nBecause people who want children absolutely cannot conceive of why anyone *wouldnt* want children. People think there is something wrong with those who don't want children.\n\n\"But you'll change your mind when you get older.\"\n\nPeople need to fuck off with that shit. Someone's desire or lack thereof to have children is no one's business.\n\nEDIT: lol",
          "id": 215,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1508,
      "content": ">We told her why it was important to us and how much it'd mean, and asked her to have an open mind about it.\n\nYTA. Sarah doesn't want children so asking her to give birth for you was very inappropriate. You seem very focussed on how much it will mean to you, not what it would mean to her. You are so focussed on wanting a baby that you are not being open minded about the fact that Sarah doesn't want a child and that includes the pregnancy/birthing part. \n\nIt also seems like you have then gone and had a moan to your parents for her reaction. I'm not surprised Sarah doesn't want to talk to either of you. She's a person, not an incubator.",
      "id": 216,
      "comments": [
        {
          "score": 413,
          "content": "TA: \"MOOOOOOOOOOOOM SARAH ISNT GOING TO HAVE MY BABY!\"\n\nTA's Parents: \"Well thats just rude.  Sarah you should be ashamed.\"\n\nIts like a necrotic mixture of Momzilla-wannabe & Grandmomzilla-wannabe all folded into one.",
          "id": 217,
          "comments": [
            {
              "score": 20,
              "content": "I feel awful for their future kids. Sounds like OP is willing to stoop down to any lows to get what she wants.  Not best parenting material there. And the brother? If he's inclined to go along with requesting that? Makes me wonder how much of the narcissist's koolaid has he been drinking.",
              "id": 218,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 73,
          "content": ">She's a person, not an incubator.\n\nExactly this. She is a human that does not want kids of her own. OP doesn't know what it's like to not have that desire for birth. OP is selfish af. OP YTA",
          "id": 219,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "YTA. The absolute _entitlement_ with which OP took to ask. \"Keep an open mind Sarah, but when you say no, we're going to feel like the victims so that open mind only goes one way\".",
          "id": 220,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Asking her to keep an open mind indicates you think she's closed minded. Seems like a rude thing to say to someone you love!",
          "id": 221,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 978,
      "content": "[deleted]",
      "id": 222,
      "comments": [
        {
          "score": 740,
          "content": "> If you don't want to be pregnant, it doesn't matter if it's Jesus. You don't want a fetus in your womb.\n\nI don’t ever want to be pregnant and this is spot-on. I would yeetus that fetus Jesus right out.",
          "id": 223,
          "comments": [
            {
              "score": 230,
              "content": "fetus deletus",
              "id": 224,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": "> I would yeetus that fetus Jesus right out.\n\n/r/BrandNewSentence",
              "id": 225,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "I'm dying this is hilarious",
              "id": 226,
              "comments": [
                {
                  "score": 15,
                  "content": "thank you :)",
                  "id": 227,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": ">I would yeetus that fetus Jesus right out.\n\nLouder for the people in the back!",
              "id": 228,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "And given that she \"exploded\" tells me that they've pestered her for years about having a child she doesn't want. I can hear it now...\n\n\"You'll change your mind\"\n\n\"It's different when it's yours\"\n\n\"Just have one to see if you like it or not!\"",
          "id": 229,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Yup I feel like there are details missing and that they basically ambushed Sarah with this and probably responded very negatively when that didn't work.",
          "id": 230,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 19,
          "content": ">doesn't matter if it's Jesus\n\nthat really made me laugh but you're 100% right.\n\nWhy don't they just adopt. Do they think that their genes are oh so great and valuable that they need a biological child of their own? I don't get it.",
          "id": 231,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 865,
      "content": "YTA - I'd have reacted the same way given I've told people all my adult life I have no interest in having children. Then your own family comes to you asking you to carry and birth a child you don't want and damage your body? Mine worked out well, I physically can't have kids anymore  (endometriosis and finally was told they'd do a hysterectomy) so at least I don't have anyone ever asking that question but damn. Y'all just walked all over her feelings.",
      "id": 232,
      "comments": [],
      "relation": "Support"
    }
  ]
}