{
  "post content": "I f36 have been with my boyfriend m41 for 2 years. He has 3 kids (6,12,4) while I have a 16 year old son.\n\n\n\nThe other day my 12 yo stepson fell off the stairs and injured his anckle, his dad and I had to get him to the hospital and needed someone to stay with the kids while we were there. My boyfriend told my son to skip workday and stay with and watch his stepbrothers.\n\n\nWhen we returned, My son asked my boyfriend to pay him for \"babysitting\" \"his kids\" I admit my son doesn't have the best relationship with his stepdad or stepsiblings but My boyfriend and I were shocked by this. My son explained that he had to skip a workday which cost him to lose money and asked my boyfriend to pay him for his time. My boyfriend scolded him harshly and told him that staying home with his stepbrothers isn't babysitting and he deserves no money for it. plus that skipping one day of work won't do much harm. but my son disagreed and kept arguing with my boyfriend saying his stepbrothers aren't his responsibility. My boyfriend ended up punishing him and taking away all his electronics as well as cancelling his birthday months away. My son fought back talking about how unfair this was and asked me to get involved. I sided with my boyfriend because I really did not appreciate how my son used this family emergency to his advantage and thought he'd get money out of helping family out. My son didn't like where I stood in this conflict and accused me of favoring my stepkids to stay on my boyfriend's good side while ignoring the mistreatment towards him. I cut the argument and he's become silent eversince. even refused to eat with us or sit with us.\n\n\nAITA for agreeing with my boyfriend to punish my son?",
  "id": 1,
  "comments": [
    {
      "score": 70570,
      "content": "YTA. He’s not their stepbrother. You are not married to that man. That’s your boyfriend. Your son had to miss out on a day of work, a day of pay, and you couldn’t pay him for babysitting? The 12 year olds father could have gone to the hospital with his son alone, while you stayed home with the rest of the kids. This isn’t your sons problem. It doesn’t take 2 people for a sprained or broken ankle. \n\nThat would be enough all on its own for you to be TA, but then you actually took away all of his electronics AND cancelled his birthday? He’s turning 17. A year after that, he’s going to never see or speak to you again if you keep choosing your boyfriend and pretend step kids over your own son.\n\nEdit: I have to thank everyone for the rewards! The first reward came in and it made me beam - it was my first reward on Reddit ever, and the first time I was upvoted more than about 50 times. Never would I have imagined the rewards and votes would keep flooding in!",
      "id": 2,
      "comments": [
        {
          "score": 22178,
          "content": "Yes, the child’s father should have taken his son and she should have stayed home. Most hospitals only allow one person back anyway. I don’t get how parents allow someone they are dating, to treat their child like that and they back them up. She’ll end up without her bf one day and it will be too late to build the relationship she destroyed with her son.",
          "id": 3,
          "comments": [
            {
              "score": 7523,
              "content": "Right? His mom probably stayed in the car doing absolutely nothing instead of staying with the other kids. She’s letting her boyfriend mistreat her son to stay on his good side. What an AH.",
              "id": 4,
              "comments": [
                {
                  "score": 3750,
                  "content": "Yes, I just don’t get that. I would never let a bf decide how to punish my child or disrespect my child. I don’t get how parents can’t wait, until their teen child is grown before moving in a whole other family. Mom and her bf are AH, I hope the son has a father or other loved one who he can talk to. He can’t talk to his unreasonable mom.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3218,
                      "content": "Yes, how is it that the boyfriend decided on such a huge punishment for the kid on his own, without involving the kid’s actual parent until the kid pleaded with his mother?\n\nOP sounds extremely passive and her bf is controlling. You need to do much better by your son, OP — you’re going to need him when your boyfriend’s awfulness is turned more on you.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 38,
                      "content": "Yeah especially at 16. Imagine some lad that you know for 2 years scolds you and you're not even a kid anymore  He shouldn't be scolding him what so ever, that should be the mum's job. Although I also agree that he didn't deserve any punishment at all",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "I had a parent who neglected/abused her own children in favor of numerous bf. Since we obviously didn't matter, I left home at 16. My own children are 15 yrs apart. My son was only asked to babysit his sister when: 1. I had to go somewhere I couldn't take her, 2. If he had no plans, and 3. I paid him immediately when I got home. Lastly, no bf was EVER allowed to discipline my children. It was also my firm boundary that they NEVER come between me and my children. If so, my children would win because I'm their mother. So, I look at it this way: did you follow ANY of these? No. You act like you're a wife to him (you're not) and mother to his children more than your own son. Of course he's pissed. He was forced to skip a paying job for another that was non paying, to take care of kids that aren't his, in a family that's not his, and was treated like shit for doing so. I'd permanently leave if I was him. How do you fix this: 1. Both you and bf apologize. 2. Pay him the same wages he would've gotten for going to work. 3. Set your boundaries with the bf regarding discipline with YOUR child. 4. Ffs, give him back ALL of his electronics and 5. NEVER ask him to babysit again!!! Bf needs to find his own sitter for HIS kids and pay them. Frankly, this \"man\" wouldn't last even a minute with me. You both are AH!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "I dated a dad. I sometimes made suggestions about things that could help him build his bond with his kids or but I definitely didn’t tell him how to raise them, let alone discipline them.\n\nI wouldn’t dare actually punish/discipline them myself, even if they disrespected or insulted me. That’s a job for their parents, not their parents’ partners. \n\nThe bar for being a decent stepparent is much lower than the bar for being a decent parent yet *so many people* can’t even manage to step over it.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Agreed. I never gave anyone jurisdiction over my daughter.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "> I would never let a bf decide how to punish my child\n\nExactly. Even if son deserve to be punished. This man is not his father, he isn't even a stepfather. He hasn't even been part of his life for more than 2 years. Why is he the one dictating any punishment for someone else's kid.\n\n> and accused me of favoring my stepkids to stay on my boyfriend's good side\n\nI'm gonna guess this is not the only time OP has sacrificed her own child to keep her boyfriend happy and yet 5 years down the line when her son has cut her out of her life she will be the first to play victim about her kid having no contact with her.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 674,
                  "content": "[deleted]",
                  "id": 12,
                  "comments": [
                    {
                      "score": 33,
                      "content": "All of this. I so hate seeing stuff like this. Allowing her own child to be treated like crap for her Man and his kids. Unreal. Pathetic.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Lol 😆  yes, exactly",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "You can always tell the biggest AH because they don’t update when they see comments going against them.",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 287,
                  "content": "And you gotta know that this 16 year old kid has that job so that he can move out of this abusive hellhole where his mom prioritizes a boyfriend and his kids over her own child and lets her boyfriend abuse her son while she plays house with the abuser. The boy will hit 18 and escape. She will (deservedly), never see or hear from him again.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "Probably because, like most abusive relationships, when an abuser has someone else to pick on, the usually abused remain safe for a little bit. Once that son turns 18 and bounces, mom's on her own to be at the hand of mistreatment, and since the boyfriend-not-husband has no legal ties to her, she has no recourse when he leaves her for someone else.\n\nbut mom, keep on calling this lowlife boyfriend your \"husband\" and giving him a \"dad\" title to your kid that he mistreats, and you're going to be all along with nobody to blame but yourself. Way to have your kid's back. \n\nOP- YTA. A Huge, gaping AH who lets some man who isn't even married to you mistreat your own blood.",
                  "id": 17,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "And even IF she could go inside the ER... what on earth is she gonna do? Sit next to her boyfriend and ALSO watch the 12yo get an xray?? There is literally no reason for her to go at ALL",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Unless there is more to this story? Was boyfriend drunk or was there another issue going on here? I am not trying to jump the gun, it just seems like there were multiple other solutions they could have used before that point.",
                  "id": 19,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 783,
              "content": "Can confirm stay in the car. My HUSBAND just had SURGERY in the most open state in the US and I had to kiss him in the parking lot at the surgery center and pick him up 3 hrs later. No way they let both people go in, especially if one is not a parent.",
              "id": 20,
              "comments": [
                {
                  "score": 386,
                  "content": "My minor child was in the hospital last week, and I had to take turns with my ex, since only 1 person per patient is allowed.\n\nWhat kills me is that OP already knew she was useless at the ER and still played the narcissistic AH to her son, who had  done what was asked of him.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 209,
                      "content": "And she said son was using “this family emergency to his advantage.”  He wasn’t asking for an advantage.  He literally just wanted to be compensated for his time.  Even if they paid him,  it’s still a disadvantage for him because boss might decide that he’s not reliable and schedule him to work less.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 122,
                  "content": "I am a pediatric nurse and the rule where I am is 2 adults per pediatric patient. So they may have allowed her in but her presence was still unnecessary. You don't need 2 adults to deal with a sprained ankle.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Even when there wasn’t a pandemic, I can’t imagine a time when both my parents were at the hospital at one time to deal with a sprained ankle or other relatively minor traumas. \n\nTypically my mom accompanied the sick/injured kid to the hospital because she had a medical background and my dad stayed home with the remaining kids. On the off chance my dad was working and unavailable, we’d all hang around in the ER or a relative like my grandmother or one of my aunts would come collect us. My half-brother absolutely adored us but never really watched us in these situations. Absolute worst case scenario, my dad’s ex would step in and take care of us with my brother.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 29,
                  "content": "Exactly! I was in the ICU and could only have one visitor 10 minutes, who had proof of vaccines and a negative test. It’s not like we don’t have ways to stay in touch or the mom needed to be there anyway.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "THIS.  I had an amputation last June and my wife wasn't even allowed into my hospital room afterward for several hours.  And then it was just quick visits for her alone.  She couldn't even bring my MIL (better mom than my egg donor ever was) along because of Covid restrictions.  \n\nThen when my MIL was on her literal deathbed in October she couldn't have more than one visitor at a time until her last two days on Earth.  I managed to get in for an hour about seven hours before she died.  \n\nOP was in the car screwing around while her actual flesh and blood was being forced to miss out on a day of work so he could perform unpaid labor for a complete tool.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Thank you!!!! I was just about to say this! Why did she HAVE to go as well? She wanted her \"stepkids\" watched so bad SHE should have done it. She owes her son an apology and the money he missed out on. Then she should go tell her boyfriend to get over himself and none of his \"punishments\" stand.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "You would be surprised how many \"Mothers\" choose a piece of ass over their own children.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "This is what I wonder as well. Why do these people even have kids if they are going to trash them for the next d or p?\n\nIt's not like they live in a country like mine, where romantic love is never considered and couples are expected to f on their wedding night even if that's the first time they are meeting each other and better popout a kid within a year.\n\nJust why do people, like this woman, who have a lot more autonomy CHOOSE to have kids and then basically discard them when a chance occurs?",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Thank you! Took the words right out of my mouth. My son had to be in the hospital recently and they only allowed me in there and that's because my son was having a serious issue and even like that they didn't care and said one parent only. My husband ended up staying in the car for two hours till I just told him to go home and take care of our daughter, no point it staying outside and when I was done I'd call an Uber or call my parents to pick me up.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "> I don’t get how parents allow someone they are dating, to treat their child like that \n\nThat's why my daughter lives with me full-time.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Oh yes. This is a reason I went extremely LC with my mother. Putting her boyfriend’s kids and bad decisions above her son is going to have consequences in the future. \n\nOP not only YTA, this internet stranger is proud of your son for sticking up for himself. Obviously he has to because his mother won’t.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2820,
          "content": "YTA for sure. This comment lay it out clearly. \n\nGood luck seeing your son after he turns 18. I wouldn’t blame the kid for bouncing.",
          "id": 33,
          "comments": [
            {
              "score": 871,
              "content": "Seriously. Like does she think she can do this to him when he’s 18? \n\nThe kid held it down for mom and not even step dad when required and instead of being appreciated for it he’s punished instead. Definitely a way to push your son away. I hope those step kids love you. \n\nYou’ve got some fixing to do. I’m so blessed my parents have always had my back",
              "id": 34,
              "comments": [
                {
                  "score": 750,
                  "content": "She’s too much of a coward to even reply to a single comment on top of being an AH towards her son. I know what people like her are like as I have gone NC with my mom for treating me in a similar way. OP needs to own up to her mistake and fix it now before her son ends up despising her. Then figure out a punishment for herself and her boyfriend for being a couple AH’s. Maybe they shouldn’t have any leisurely activities for the rest of the month. And cancel Valentine’s Day for themselves.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 226,
                      "content": "Seriously. Crickets here. I hope she is ashamed of herself and gets her act together.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "Chances are her son already despises her and is just counting the hours until he’s rid of her for good.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Son should get to pick the punishment. Like no electronics or sex for a month.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 553,
              "content": "Yup, as someone who was in a similar position, I was out by 16. I was on kid duty all the time, got paid for it once, and got in trouble for asking if I'd get paid the next time I was tasked. (The plan was 18, but father and stepmother pushed it forward. Thank goodness I was in a great area with excellent support for teens and a great school guidance counselor who helped me find families to live with for the last year and a half of high school.)",
              "id": 39,
              "comments": [
                {
                  "score": 508,
                  "content": "I was given the \"job\" of babysitting my younger siblings since I was about 5 (I wasn't alone in the house but it was up to me to change diapers, watch over the baby, etc). \n\nAs I got older I was tasked with making breakfast for my 3 youngers siblings and getting them off to school. After school, I did their homework with them while I was cooking for the whole family. I also did a lot of the housework. \n\nWhen I got closer to twelve, they started volunteering me as a babysitter for all the people they were partying with, to \"give the adults a break\". From that birthday onward, I never spent a holiday or weekend with my family. I was at other peoples' houses,  watching about a dozen kids while their parents' partied with mine. I never got paid for any of it, because it was a favour.   \n\n\nOn my 16th birthday, I left. \"Thanks for the cake, muthafuckers, but I gotta go\".",
                  "id": 40,
                  "comments": [
                    {
                      "score": 298,
                      "content": "Damn. You weren't a child to your parents. You were a slave. Glad you got out of there",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 52,
                      "content": "Man did they give you a sock?\n\nI’m sorry that’s a rough life",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "Oh damn, I would love to hear their reaction. And have they ever apologized after they realized how shitty they treated you? \n\nI am so orry you went through that.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "Parentification at that young an age. DAMN.\n\nI'm so very sorry.  You deserved to be a kid.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Born the oldest child and pretty much defaulted into the parental role, taking care of all of the younger siblings and all of the partiers kids. I got into it with one of the kid's moms about paying me for watching their kid, and they told me their kid pretty much watched themselves. I told her her kid could watch themselves back at her house then. And, of course, I was not backed up, I was just there as a favor. I watched 10 kids for 8+ hours every few days constantly. These same kids were also dropped off at our house early as hell in the morning for me to wake them up again after I got ready for school, to walk them all to school so the parents could leave for work and shove their responsibility onto me there, too. I was out at a young age, have done everything on my own, and have not looked back. I've even cut contact with one of my siblings because I can't live around her toxicity, constantly saying I'm the problem and I have been a problem the whole time. Every story needs a bad guy; I guess that gets to be me. I now never want to have children of my own.\nI'm sorry you had to experience that life, too.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "Yeah it's wrong when someone can pay you but wont. My brother did that to me when I was in my very early twenties. He paid me to watch his kids. And then all the sudden he stopped. Between him and his wife they made easily over 100,000. But they couldn't pay me twenty bucks to watch their kids for three or four hours on a Saturday night. This was in the late 80s to early 90s. I asked him hey why aren't you paying me anymore. I worked a job making around $5 an hour, had a car payment, car insurance, other bills, barely had any money left over, gave up Saturday nights a couple month times a month to help them out and not see my boyfriend cuz they wouldn't allow him over, and he's like oh I'll pay you back one day when you have children. Well by the time I did have kids I lived 200 miles away, so has he been helpful, no not ever.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 413,
              "content": "The son will likely end up going NC. It’s countless parents on these subs that put the person they’re dating ahead of their kids, then wonder why they don’t get invited to the wedding or have a relationship with the grandkids. She won’t feel the repercussions until years from now. OP, YTA.",
              "id": 47,
              "comments": [
                {
                  "score": 41,
                  "content": "And his mom will act all clueless and play the victim",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Mom will join one of those forums where all these parents whose kids won't talk to them sit around wondering why and bitching about how mean and disrespectful their kids are.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "So many of them are blended families too.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "OH YTA for sure!  Why did you both have to take his kid to the hospital?  Why is your bf allowed to punish YOUR son? He is not the step dad he's your current bf.  OP Please learn a lesson and show this post to your son and your bf.  Get a grip.  You did the wrong thing mom.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "In a year's time OP gonna be refreshing us with another AITA followed by a TIFU about her son going no contact over this shit",
              "id": 52,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "Yes! And why is the boyfriend doling out punishments? That’s so fucking weird. \n\nHe did not raise this boy - they’ve been together two years and it’s so gross that she’s letting him punish her son this way. At 2 years you can ask a kid to leave the room while being disrespectful or say your attitude isn’t great I won’t be taking you with me to the store after all - but you don’t get to cancel a birthday? Wtf is wrong with this mom to allow any of that?\n\nHer critical thinking skills are shit too to say:\n> thought he'd get money out of helping family out\n\nNo he’s losing money by helping family out - he’d break even if they paid him since he lost his shift.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2009,
          "content": "And then she has the audacity to say that her son was trying to take advantage by asking for money?!?! You mean the money he missed out on because he was forced to stay home?!?!",
          "id": 54,
          "comments": [
            {
              "score": 1028,
              "content": "Not to mention the repercussions son will have at work for calling out last minute.",
              "id": 55,
              "comments": [
                {
                  "score": 399,
                  "content": "This. The way OP described missing one day would mean no harm makes me think she has no respect for his job. Missing one day of work anywhere is a big deal. It’s very likely they weren’t able to get someone to cover for him and his fellow coworkers had to work extra to make up for him not being there. \n\nThe least OP could do was to compensate him for his time. Definitely YTA.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 177,
                      "content": "He’s 16, which means he most likely works retail or food service. Many of these places have strict rules regarding last-minute call outs. Too many (usually 3) can lead to being fired. And OP doesn’t care at all.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 146,
                  "content": "That's what I'm worried about for him! He's probably working this job to save up for his future (college, moving out, whatever) and that could be jeopardy now. We all know how petty (bad) managers can be.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 334,
              "content": "Also, as I said in another comment, the son sounds really mature to me.\n\nHe watched the kids, forfeiting the pay for that day from work, without argument, so that both people could take the kid to the hospital (whether or not they needed to is another story) without having to worry about the younger kids at home.  \n\nOnly when they RETURNED did he bring up money.\n\nBasically, he allowed the adults to focus on the hurt child, without quibbling, until after they knew what was up with the hurt child, then he asked for pay.  A lot of teenagers would have started arguing from the minute they were told to watch the younger ones, even if they were going to be home all night and literally stare at the walls.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 293,
              "content": "That's right. OP's boyfriend and OP essentially stole money from her son. And to take away his electronics and FUTURE birthday? That punishment is draconian, shitty, and undefensible. Your bf has no respect for your son, OP. Wait till he turns that on you. YTA",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 232,
              "content": "I know. The only person getting \"used\" in this instance is the son.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1405,
          "content": "What truly bothers me is OP is pretending childcare isn't an actual job that people get paid for and that OP clearly favors her pretend husband and stepchildren over her actual son. It's not like the other kids are 13 and don't actually need supervision. They're still at the ages where you have to actually watch and engage with them. That is a job.",
          "id": 62,
          "comments": [
            {
              "score": 810,
              "content": "I pay my daughter to watch her *blood* siblings. And she doesn't even have a job that she would have to miss out on. I don't understand OP's position for not paying *at all*, and the punishment was SO HARSH! \n\n\nHe's not your son's dad. He's maybe not even your son's step-dad, not that it matters. You're both AHs.\n\nYTA",
              "id": 63,
              "comments": [
                {
                  "score": 332,
                  "content": "I pay my oldest too, 15 bucks an hour, because that's the going rate for babysitting in our area. \n\nI find it hilarious that OP is talking about the son \"taking advantage\" of the situation, when the boyfriend is the one taking advantage of OP's son. \n\nHope this guy is worth losing your son over, OP. Though, from your description, it doesn't seem like he's any semblance of a prize.\n\nYTA",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "I had two extremely important meetings a few weeks ago and had forgotten the kids were off school for an institute day. I paid my 10 year old to watch his siblings while I locked the door to my office, with a \"only knock in emergencies\" rule. Even though it was only two hours, I'm still not going to make him an extra parent, and I asked him if it was okay, I didn't tell him he was doing it. (note: I was home the whole time, just in a different floor of the house)",
                  "id": 65,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 25,
                  "content": "Yeah exactly. I don’t understand why almost all the top comments are pointing out that they aren’t even siblings/step-siblings. It literally doesn’t matter. If they were his bio siblings and the BF was his dad, OP is still the AH and the kid should still get paid. Childcare is the parents’ job, anyone else doing it deserves to be offered a fair wage.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": ">He's not your son's dad. He's maybe not even your son's step-dad, not that it matters. You're both AHs.\n\nI think this *does*  matter. OP goes back and forth with 'boyfriend' and 'step-dad', always refers to his kids as 'step-siblings'. There is some serious cognitive dissonance going on in this dynamic. As a mom OP seems completely willing to abandon her role to her son in exchange for whatever fantasy she is living out with the bf. Gross.\n\nI feel so sad for this teen. Hope he has support outside of the toxic dynamic in his mother's house. \n\nIf you see this OP - YTA on about a billion levels.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "And \"step-dad\" saying that watching the kids doesn't count as babysitting, so he doesn't deserve money. Literally wtf else would you call watching children who are not yours?",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1135,
          "content": "Even if the kid had been in the wrong (WHICH HE ABSOLUTELY WAS NOT), the punishment is so extreme. Took all of his electronics, canceled his MONTHS AWAY bday????? The kid didn't even do anything, he just asked to be compensated for taking care of his mother's boyfriend's kids instead of going to his paying job. They're punishing him so harshly for... the crime of speaking up for himself, regardless of if they think he was wrong. This mom is such a raging AH that I wish I could adopt her kid.",
          "id": 69,
          "comments": [
            {
              "score": 549,
              "content": "the part that blows my mind is that the boyfriend got to decide the punishment? i absolutely cannot imagine how furious i would be if i was 16 and my moms bf told me \"i'm taking away your electronics/your birthday is cancelled.\" my immediate reaction would be \"who tf do you think you are to punish me? i barely know you\" followed by me doing exactly what her son did, i would go to my mom and ask her to get involved and have her boyfriend put in line. can't imagine how heartbroken i would be to have my mom respond with \"you know what, actually the guy i'm dating is right and you no longer have a birthday this year.\" it's a sure-fire way to ruin your relationship with your child",
              "id": 70,
              "comments": [
                {
                  "score": 82,
                  "content": "It makes me wonder if she would intervene if her bf got physical and assaulted her son, because I am sure thats what is next. For me, he'd be a dead man at that point. \n\nOP, YTA, a major one, and I hate to use a term from FDS, but a 'pickmesha' as well. This flag is so red its blinding.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 29,
                      "content": "If she's treating her son like this over *him doing her a huge favor*, you can bet she's been abusing him in the past even if not physically. You don't just suddenly start prioritizing yourself and your boyfriend over your kid.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "She would NOT intervene.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "OP says her son doesn't have the best best relationship with his \"stepdad\" or \"stepsiblings.\" Gee, I wonder why that could be? Possibly because they are not his stepdad or stepsiblings, and they treat him like a slave and punish him severely when he stands up for himself a tiny bit? I hope this person doesn't want to have any sort of relationship with her son as an adult, because she's throwing that opportunity away.\n\nOP, YTA but more importantly you need to stop being TA right now, apologize to your son, tell your boyfriend that he's not your son's father and has no business punishing him or making demands on him. Respect your son's time and the money that it's worth. Sort your shit out while you still have the remotest possibility of a chance to do it.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Bets he moves in with his real father after this?",
              "id": 75,
              "comments": [
                {
                  "score": 15,
                  "content": "I dearly hope that this kids' father is still in the picture so that he has that option to leave OP's house now, rather than at 18. To be punished AT ALL for asking for repayment of the wages he lost, much less this egregiously harsh punishment, is not okay. OP is clearly never going to stand up for her son against her AH boyfriend, kid needs to get out.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I cannot talk about specifics or use names but I'll say this.\n\nThe amount of child abuse by wanna be step parents is really astounding.\n\nBefore I got involved in the system I never realized how willing some people are to let their most recent bedroom partner mistreat and or abuse their actual children.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "The punishment is for standing up for himself, period. \"We can't have that in our house!\"",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 721,
          "content": "Yeah, YTA and so is your boyfriend by expecting your son to take a day off work and babysit your boyfriends kids.",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 643,
          "content": "Just adding to this as well. YTA op for all of the above but also the fact you consider asking for payment for babysitting, which absolutely is something you should be paid for btw, when you forced him to miss work (and pay) “taking advantage of a family emergency”. What advantage did he get? He lost stature at work for a short notice call out. He lost money from a days wage. He lost time from his life which he can never get back as well. And you consider asking for compensation for that taking advantage? He gained nothing. There is no advantage. \n\nYou have no business letting that man who is not his step father, just your boyfriend, treat him that way. You are his mother and you just showed him that your boyfriends opinion matters more than his security and self worth. He is going to cut you off at 18. There’s no question of it. But don’t be puzzled when he does. You’ve just shown him that he is not a priority with you. So you won’t be his. Take it from someone who made the same decision a week before I turned 18.",
          "id": 80,
          "comments": [
            {
              "score": 57,
              "content": "And not to be harsh to the kiddo who was hurt but it wasn't much of an emergency. \n\nNot one that required both adults leave the house instantly and not even try to call in someone else to babysit who didn't have work that day.\n\nI've broken a ton of bones, a few at a young age, and while breaks can have serious consequences and on occasion can cause more dangerous issues and shouldn't be ignored they had options. \n\nOP acts like it was a life or death emergency and that her son was demanding some huge amount.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "If anything OP and BF are taking advantage of the child by making him babysit. \n\nSo the child lost a days wages AND is being punished by having electronics & party cancelled. Complete AH moves on mom & bf.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "She and her boyfriend are the ones who took advantage of a family emergency by not paying the son and then punishing him for a perfectly reasonable request.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 224,
          "content": "Thank you for saying this. I was going to ask, is he the stepdad or boyfriend? Can’t be both if you aren’t married to the guy. Agreeing with everything you said, I couldn’t have said it better.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 169,
          "content": "Agreed. OP, YTA. Your son is the only one in that house acting like an adult. When he goes low contact with you in a few years, this instance will be one of the many reasons he will have for doing so. This man and his kids were brought into your son's life when he was 14. He has a duty to be civilized, and he can help out if he wants, but these people aren't his family and there should be no obligation. Even if this were his flesh and blood, he was forced to miss work and needs to be compensated. This poor young man is being really rational and yet you're taking away all his agency. I feel quite badly for him!\n\nEdited typos.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 151,
          "content": "I literally couldn't agree with this more.\nYTA, OP. Big time.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 24519,
      "content": "YTA. Your son doesn't choose for you to start dating this guy, older siblings are not automatic free babysitter, your son lost money by having to watch your bfs kids, and he was somehow punished for being upset by all of this. \n\nY'ALL AIN'T EVEN MARRIED! Those aren't his step siblings. That sure as hell isn't a step father who is being allowed to punish him. This is absolute shit parenting all around.",
      "id": 87,
      "comments": [
        {
          "score": 9057,
          "content": "For me the big issue here is that *they made him call off work then wouldn't compensate him*. \n\nI mean, I get being upset if he was home doing nothing, they asked him for help in an emergency, and he refused to help. Its not his responsibility *but* it is the basic decent thing to do to help someone *in an emergency*.\n\nBut this is different--he had *work*. Yes, they should have compensated him for *helping them out* AND been grateful. \n\nBoth are selfish AHs: \"kid has to help us out but we get to feel entitled to his time\"\n\nEdit:added \"me\" to 1st sentence",
          "id": 88,
          "comments": [
            {
              "score": 2579,
              "content": "This! And why did both adults have to go to the ER for this? OP could have stayed with the other kids while the son went to work, and father of the child took child to the ER.",
              "id": 89,
              "comments": [
                {
                  "score": 1393,
                  "content": "Right? Mom had zero reason to go to the ER because she is not said kids MOTHER. Boyfriend is the only one who should have gone and mom could've stayed behind to watch boyfriend's kids.\n\nMom, YTA. You made your son lose a day of work to watch kids that he is not related to then you refuse to compensate him and on top of that you ground him and take away all his electronics.\n\nI really hope you come to your senses and compensate your son, unground him, and give him back all of his electronics.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 305,
                      "content": "Honestly, I’ve taken kids to the ER as not-their-parent and it is likely doable that OP could have taken the kid and BF could stay home with the littles. They get consent over the phone if they need it, but the ER will see and check out the kid. There are many situations they could have done this without having the teen miss work. It’s laziness. It’s not an emergency that should make him miss work, and the gall OP had to punish the kid for asking (even if he demanded) payment for babysitting while missing work is insane.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "and offer him a serious apology by both, mom and her bf",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 376,
                  "content": "Because they don't respect him is why. \n\nSounds like they're the extra shitty \"my child is my property\" type parents.\n\nThey saw him as free labor because they don't see him as a person, they see him as literal property.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Seriously! JFC, I've taken a kid to the ER 3 times, two for things much more serious than this (one for falling headfirst off her bunk bed, one sent there from immediate care because her weekend UTI turned out to be a kidney infection with sepsis), and my husband, their actual father, stayed home with the other kids each time.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 19,
                      "content": "When I worked in the hospital, I admitted children with newly diagnosed brain tumors with only one parent present more times than I could count. People do what they gotta do, if there are other kids at home it's not always feasible for both parents to accompany a child to the ER, even when the situation is very serious. Siblings were not allowed to stay (except in rare circumstances like end of life, the sibling was over 18 or the sibling was a breast fed infant) so one parent pretty much always had to be home if there were other children in the family. In OP's scenario, she 100% should have stayed home with the younger kids. A 12 yr old doesn't need his father's girlfriend there for an ankle injury.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Some couples can't cope with doing anything alone, honestly. At the start of covid you were only allowed one person per household in supermarkets to minimise risk, and it was well publicised. One couple I know drove all over town together looking for a supermarket that would waive the rule, while another stood apart in the queue to get in pretending not to know each other. For trips to the *supermarket*. I mean get a grip. As others have pointed out, OP probably wasn't even allowed into the hospital.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "This. I've known workplaces that employ mostly teenagers to be quite unreasonable about calling off work. They automatically assume you are lieing, and treat you badly for weeks after. He could have been fired. He may have had more than a day's pay at stake. Notice how op didn't even say if he had a cool boss who totally understood it was a family emergency. \n\nSecond, those electronics she confiscated, did he buy them with his own money? Is op planning on paying him back for them or is both unpaid labor and theft both ok in their eyes?\n\nOp, YTA.",
              "id": 97,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 35,
              "content": "I bet they are also the ones requiring 16 year old to hold a job.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "I agree, but I'd say the even bigger issue is that they punished him for disagreeing with them. \n\nWhat exactly did he do wrong to merit losing all his electronics and his birthday? \n\nHe asked to be compensated for his time and then expressed an opinion that it was unfair of them not to. God forbid a 16 year old kid stand up for himself (/s).\n\nYTA, OP.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Jobs for kids that age are not notoriously forgiving for late call outs. He could easily be on probation or lose his job.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "And he has to deal with his boss and coworkers who depended on him being at work but were left short-handed. Odds are that at least one person is going to be cold or snarky about it.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Was it really an emergency though? It was a 12 year old with a broken ankle. His mom didn't have to go. He should never have been put in the situation",
              "id": 102,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 751,
          "content": "Yo also they left him in charge of a 6yo and idc whether the kids are related or not, he needs to be paid for that. It is babysitting when you are staying home looking after a kid that young",
          "id": 103,
          "comments": [
            {
              "score": 179,
              "content": "This! If the reasoning was that they didn't have the money after the hospital bill or didn't have the money that would be one thing... but if you have the money you should pay your kids for babysitting. Especially if they had to miss work for it. It is not easy to take a day off work especially at a 17yo expirience level. \n\nNow the 17 yo missed a day of work, has zero electronics, no birthday, and is grounded for asking for reimbursement for his services which he has a valid point to have.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "And a 4 year old, too!",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 659,
          "content": "Why are you allowing a Bf to punish YOUR kid. This is how abusive “step-parent” stuff starts.",
          "id": 106,
          "comments": [
            {
              "score": 209,
              "content": "Mom doesn't care about her own son...has to chase after that D.",
              "id": 107,
              "comments": [
                {
                  "score": 45,
                  "content": "Thats most likely the situation here. Shes probably afraid she wont get the D anymore if she sides with her son. I really hope he goes NC with her when hes old enough.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 275,
          "content": "The part that really gets me is they aren't just punishing him now, but also *months* from now, on his birthday of all days.",
          "id": 109,
          "comments": [
            {
              "score": 18,
              "content": "Pure, undiluted cruelty.",
              "id": 110,
              "comments": [
                {
                  "score": 27,
                  "content": "It really does come across as hateful. I don't know how you could treat your own son this way. I couldn't even treat a stranger this badly.",
                  "id": 111,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "OP needs to be punished take away the boyfriend and his kids.....and the ring she doesnt even have. YTA",
          "id": 112,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "YTA, you let your boyfriend punish your son (Not his stepson, you aren't married, he's just \"His mum's boyfriend\" to your son) for taking issue with a forced day off work.\n\nYour son lost money and wanted to be compensated, even a token amount would have done it, to force him to watch someone else's kids is punishment enough.\n\n*Then* you confiscated his stuff.\n\n*THEN* you cancelled his birthday!\n\nWhat the fuck is wrong with you? When he turns 18 he is going to move out and forget you exist, if this is how you continue to treat him. Good luck losing your only child due to your own actions.",
          "id": 113,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "I am so glad to see others agree with my position that live-ins are not step parents. If you aren’t willing to take on the responsibilities of marriage, you don’t get to claim the benefits, in this case a blended family.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I paymy 13 year old to watch her little brothers a few hours a few days a week. I asked her, she's not missing anything, especially an opportunity to make money and I give her minimum responsibility. \n\nI can't believe they punished him at all. But the punishment itself is so extreme, for ASKING to get paid. Take advantage? Boyfriend and OP are taking advantage. I really wonder hat the boyfriends kids punishments are like.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16206,
      "content": "YTA\n\n* You are not married to your boyfriend; his kids are not your son's \"stepbrothers\" unless you have officially adopted them.\n* Taking care of younger (even full) siblings is your and your boyfriend's responsibility, not your son's. It's \"parentification\" to pretend he's just as responsible for his younger siblings as you are.\n* I don't see any reason why you and your BF *both* needed to take your stepson to the hospital; you could have stayed home to take care of the little ones.\n* You made your son miss a day of work.\n* The punishment ( taking away his electronics and cancelling his birthday months away) *far* exceeds the crime of *asking* to be reimbursed for babysitting, even if he *did* argue after you told him no. It's an \"I said \"no\" and that's final; go to your room\" crime at worst.\n\nFrankly, I see your BF's attitude as a red flag; you need to protect your son, not side with your BF.",
      "id": 116,
      "comments": [
        {
          "score": 3038,
          "content": "So much this. Parentification can lead to some unpleasant behaviors for your son. People pleasing is a bitch and I know that I gleaned a lot of my people pleasing skills from having to be the parent with my parents.\n\nAnd also, this poster is correct. You probably REALLY hurt your son by siding with your boyfriend. He needed you to protect him, not hurt him worse.",
          "id": 117,
          "comments": [
            {
              "score": 512,
              "content": "I spend so much time wondering what a lot of parents expect will happen when their teenage children will do when they can’t wipe their own asses anymore. OP, get ready to spend holidays without your son and for your Medicaid nursing home.\n\nEdited for choppiness.",
              "id": 118,
              "comments": [
                {
                  "score": 47,
                  "content": "If OP's son is even still in contact with her by that point.",
                  "id": 119,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "I was forced into full time parentification at 15 had to swap to independent studies to become a full time nanny for my sister so my single mom could commute to work. It seriously affected my mental health and caused pretty bad social anxiety and later on depression due to the social anxiety getting worse and worse as years passed. \n\nIt’s been 16 years and I still struggle with both issues. Missing out on my high school experience and becoming almost agoraphobic over the years has not been a good time. I still have issues saying no to ANYONE but because those years had me people pleasing like crazy now when I do try to stand up for myself everyone says I’m being a bitch or have an attitude lol.",
              "id": 120,
              "comments": [
                {
                  "score": 26,
                  "content": "that's why parentification is considered abuse.  Because it is.  What happened to you is very extream and I wish someone had seen it and helped you.  Being naturally agoraphobic I don't wish that on anyone.  Big virtual hugs",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "I was forced to be a parent to my little sister starting around 8 years old. I don’t want kids ever because of it. I already raised a kid as a kid myself. I don’t wanna have to pay to do that again",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Honestly, I've gone through (and am still going through) the same thing. My mom died when I was 16, and I became the mother figure for my siblings (I'm the oldest). I was staying home, being late to high school to get my brother on the bus (he is nuerodivergent and has epilepsy and can't be left alone). Somehow, it just became my responsibility to watch my brother whenever. So, my dad is living like a bachelor (coming home at midnight, going out whenever he wants, fucking over my plans), and I am the one giving my brother his medication, talking to his teachers, taking him to the hospital when he has his seizures, cancelling my plans. On the rare occassion I do get out, I still have to make sure my dad gives his son his medicine, because God forbid he should set an alarm on his phone. He had 2 more kids after my mom died that come up for the summer. Guess who takes care of them? This is still happening 10 years later, I feel trapped, and I don't know that I will speak to my father when I finally escape. I'm sorry if this is coming off as a rant, I just really don't want anyone else to go through this, because it sucks.  OP is for sure pushing her son away.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 818,
          "content": "I agree with everything said here. \n\nAlso, it’s OPs attitude that is the real red flag. Boyfriend is an opportunist who wants free care for his kids, but OP thinking her boyfriend is right is the real concern here.",
          "id": 124,
          "comments": [
            {
              "score": 189,
              "content": "This right here. OP is in charge of the situation since this is her son and she is allowing the bf to treat her child like shit. This needs to be OP’s wake up call.",
              "id": 125,
              "comments": [
                {
                  "score": 21,
                  "content": "Yes! Why does the boyfriend get to hand out punishments to her 16 year old? Awful the pair of them. They will probably be wondering why he left home very soon.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 710,
          "content": "I'm guessing they both needed to take him to the hospital because they're codependent AHs who have to be together at all times, and that's why OP has no back bone to defend her kid.\n\nNot only is BF's attitude a red flag, so is OP's. This kid is going to be out of her life as soon as he can be and she will have done it to herself.",
          "id": 127,
          "comments": [
            {
              "score": 37,
              "content": "yeah seems like bf needed a babysitter for himself..",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Good observation, why did they both have to go? Totally unnecessary. This poor kid has probably put up with a lot of their bullshit and is over it. Good for him for sticking to his boundaries.",
              "id": 129,
              "comments": [
                {
                  "score": 20,
                  "content": "My snarky guess is the boyfriend called the 12yo's biological mom to fill her in and she went to meet them there at the hospital (rightfully so). OP needs to be there to babysit her boyfriend around his ex. \n\nI take issue with older siblings being forced to babysit. Not fair to the older siblings at all (not talking about a simple situation like \"can you keep an eye on your siblings while I cook dinner?\" type thing).",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Exactly. OP your actions, or rather *non actions* are abominable. What I want to say will get me banned, however your son will be justified in going non-contact w/you once he turns 18. He did nothing to be punished, and the punishment is on the level if he had stolen something & was arrested. I feel so badly for him. You want a chance at salvaging your relationship, apologize sincerely, compensate him for his lost wages, return all his possessions he never should have been deprived of, and don’t you dare cancel his birthday party. Also listen to your son when he’s telling you of his mistreatment. Protect him from your bf who is clearly a controlling %&#@\\*\\^(%!!! YTA.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 182,
          "content": "I know right. I fear this is a case of mother putting her needs above those of the children.",
          "id": 132,
          "comments": [
            {
              "score": 16,
              "content": ">I fear this is a case of mother putting her ~~needs~~ boyfriend above ~~those of~~ the children.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 111,
          "content": "Her attitude is a red flag, too. So eager to participate in the abuse the boyfriend is doling out.",
          "id": 134,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "One more thing.. If OP EVER wants her household to function like something resembling a family, then this is absolutely NOT the way to get there.\n\nNext time an emergency like this happens that kid is going to be awfully tempted to say \"screw it\" and go for the work instead. He is going to be punished anyway, he might as well go for the money, right?",
          "id": 135,
          "comments": [
            {
              "score": 17,
              "content": "If I was OP's kid and put in this scenario again, I'd call the police and say \"my mother's boyfriend abandoned his kids with me even though he knew I had to go to work. There are a 6 yr old and a 4 yr old home alone.\" Then Mom and boyfriend can pick the kids up from the police station later in the day and deal with the resulting CPS investigation.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Ops boyfriend seems like an asshole. Poor kid was in the right and was punished by an asshole on top of it. I'd be fucking pissed if I was him",
          "id": 137,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "This comment is spot on, ESPECIALLY THE LAST POINT!!!! \n\nOP: pay attention to this, please! If your son seems angrier, grades slipping, etc lately... It's a reaction to this really horrible home situation he's been forced into.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Surprised that this is the first comment that mentioned parentification, since that is very clearly what is happening here.  It's also worth pointing out that *parentification is recognized as a form of child abuse.* Granted, asking a kid to babysit once probably isn't a big deal, but it seems clear that the boyfriend thinks he is entitled to OP's son's time (and OP seems to agree), which throws up all sort of red flags for this becoming an ongoing issue for the son.\n\nOP, don't be surprised when your son turns 18 and goes no contact.  YTA.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "It also surely will not help improve his relationship with the boyfriend’s kids.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8259,
      "content": "YTA as is your bf. Why do both of you have to take the 12 yr old to the hospital? You should have stayed home with the other kids.  He missed work which means he missed earning money. You two should paid him.  Also your son is correct, his stepbrothers aren't his responsibility.   You two need to go apologize, remove the punishment and pay him!",
      "id": 141,
      "comments": [
        {
          "score": 1579,
          "content": "I totally agree with that. If there hadn't been anybody else at home to watch the kids, I could have understood the BF asking the son to watch the two others, but here, two adults went to the hospital leaving a teenager, who had other responsibilities aka work, look after the two other kids.\n\nWorst part is that the 16 year old is now being punished for having missed worked to babysit because the adults couldn't get smart enough to figure out a better solution.",
          "id": 142,
          "comments": [
            {
              "score": 421,
              "content": "But even then the Bf should have paid the son. If it was so important it be done, it’s worth paying for",
              "id": 143,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 204,
              "content": "And OP is upset that the 16-year-old is trying to \"take advantage\" of the situation, as if the parents aren't blatantly trying to take advantage of the teenager. OP and BF are huge AHs.",
              "id": 144,
              "comments": [
                {
                  "score": 14,
                  "content": "“As if the parents aren’t blatantly trying to take advantage of the teenager” LOL so true",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 675,
          "content": "YTA op. Those aren’t his step siblings, they’re your boyfriend’s kids. Your son missed work—he deserves to have those costs recouped. It doesn’t sound like he was asked: it sounds like you foisted kids on him and expected his life to stop to meet your needs. \n\nAlso why are you allowing your boyfriend to punish your son for anything, let alone merely for standing up for himself? That’s alarming.\n\nAdvocate for your child, ffs.",
          "id": 146,
          "comments": [
            {
              "score": 187,
              "content": "I’ve been a step mother for 7 years and in my SD’s life for 10. I have never once *ever* attempted to punish or make demands of my step daughter. And if some guy Id known 2 years was talking to my kid like that I’d throw them the fuck out of my house. This shit is so gross to me.",
              "id": 147,
              "comments": [
                {
                  "score": 29,
                  "content": "Agreed. I’m horrified for this kid.",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 180,
          "content": "Yeah, and this not making sense makes the 16yo look terrible to bosses: he skipped work to watch children so two adults could accompany a third kid to the ER. What boss would automatically trust the teen wasn’t playing hooky?",
          "id": 149,
          "comments": [
            {
              "score": 17,
              "content": "I’d be like: Honestly sorry, Boss! Please call my idiot mom and her asshat BF and ask them if they really asked me to do this…",
              "id": 150,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "My bet on why they both had to go? BF is broke and needed OP to be there to pay.",
          "id": 151,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "I'm going to put money on OP being the one to actually take the kid into the hospital and the boyfriend sat in his car or went down to the bar.",
          "id": 152,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6586,
      "content": "I once called in from work to look after a neighbor's kid who was home sick that day when the parental units had appointments they couldn't miss (legitimate, and my job wasn't something I couldn't make up for the next day so I was happy to do so).\n\nI like their kid and we didn't really do much all day, I made miso soup for lunch but otherwise chilled and watched fresh prince with the kiddo.\n\nWhen the first parent came home they started to write out a check and I told him it really wasn't necessary, it had been a ridiculously easy day and I ate their food. He looked at me and said \"You're an hourly employee who had to take a day off work to help us out. Of course we're going to pay you for that.\"\n\nThat's my story. Your son's story goes like this \"I helped out some guy who means nothing to me personally. And to repay me he stole a day of wages, took away my electronics, and decided I didn't deserve a birthday. And my mom was totally cool with it.\" That's the kind of kid who leaves home as soon as possible and has nothing to do with their \"family\" ever again.\n\n(Edited because your bf isn't your son's parent)",
      "id": 153,
      "comments": [
        {
          "score": 1125,
          "content": "If this doesn’t get through to her, I don’t know what will.",
          "id": 154,
          "comments": [
            {
              "score": 434,
              "content": "Thanks mate. It also kind of staggers me when someone posts something like this that by all rights should be NTA because they are the ones telling the story! They should be able to make themselves look better. The fact that they don't and don't even consider how (in this case) her son would tell the story is just mind boggling.\n\nIt's one of the things that sets off a B.S. alert for sure. But I've also met plenty of people who could have written the exact same story, so even of this particular post is fake, some kid out there might read this thread and feel vindicated that their home life isn't normal.",
              "id": 155,
              "comments": [
                {
                  "score": 112,
                  "content": "I always assume YTA posts are even worse than they said, because of COURSE they tried to make themselves look good unless they're incredibly oblivious. It's just THAT bad.\n\nAlso, love the YTA posts that they don't comment on. OP reads the comments, \"I do not like this one bit\" and abandons the post, lmao.",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "My mother would have wrote this story and been shocked that people had anything negative to say about her.",
                  "id": 157,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I'm sorry you grew up with that. I hope you're in a better place now love",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 123,
          "content": "It sounds like an abusive household when you set out like that.  And you are completely correct.",
          "id": 159,
          "comments": [
            {
              "score": 12,
              "content": "OP doesn’t seem capable and willing to acknowledge her son’s feelings. Sad.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Holy shitttt this!!!! The poor young lad has been punished for doing a favour!",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "“Your son's story goes like this \"I helped out some guy who means nothing to me personally. And to repay me he stole a day of wages, took away my electronics, and decided I didn't deserve a birthday. And my mom was totally cool with it.\"” - THIS PART EXACTLY 👏🏼 Your comment needs to be higher, hope OP sees this",
          "id": 162,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "YTA. I really hope OP reads this entry. Her son is going to leave at age 18 and never ever look back. I wish him all the best energy this universe has to offer to help him and guide him and have a successful life. OP is a terrible parent, disregarding her son.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Agreed! The son’s focus on work and wages makes me feel like he’s already working as hard as he can to be able to nope the hell out of this mess as soon as he can.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "> I helped out some guy who means nothing to me personally. And to repay me he stole a day of wages, took away my electronics, and decided I didn’t deserve a birthday. And my mom was totally cool with it. \n\nThis sums it up perfectly! I was going to say something similar. From what I understood of this story, the poor kid took off work last minute to do a favor for some guy who’s dating his mom and then got punished for it. And the punishment is absolutely ridiculous and disproportional to the perceived slight. He had every right to say “no, sorry, but I can’t miss work.” And they would still be in the wrong if they punished him for that. He’s 16 and sounds like he’s more mature than the two adults in this situation. \n\nIt absolutely blows my mind that they would think it’s okay to treat their child like free labor. And letting the boyfriend punish her son. This is just horrible parenting and I imagine her son must have felt so betrayed when he asked mom to intervene and she instead took her boyfriends side. I’m a single mom to a teen and I couldn’t imagine ever taking a partner’s side over my son or letting them punish him. I would never ask my son to miss work to take care of my partners kids unless it was totally unavoidable (which I don’t think it is in this case) and then I’d expect for my son to be paid whatever he lost in wages. He doesn’t owe them anything and they aren’t entitled to his time. \n\nIn this situation, OP could have stayed with the kids. I doubt they even let her inside. It’s been my experience in the last two years, that doctors offices only allow one parent in with the child (my son has been sick and we’ve been to many doctors offices; every single one we’ve been to has had this rule). I can’t imagine hospitals would be different. This whole thing is so ridiculous. The kid could have lost his job for calling in last minute. And the mom doesn’t even care. Seems like she cares more about pleasing her boyfriend than parenting her child. I hope she realizes that what she did was wrong and apologizes to her son for this mistreatment. Otherwise we might see her here again in a few years whining about why her son isn’t talking to her, visiting her, inviting her to his wedding, or something similar.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5506,
      "content": "YTA.  He’s not “using it to his advantage”, he lost wages at his job to babysit kids that aren’t his for your boyfriend’s convenience.",
      "id": 166,
      "comments": [
        {
          "score": 1284,
          "content": "And OP’s since she apparently needed to go along for the ride to the hospital for some reason, rather than staying home and being a parent. I bet her son deals with this kind of crap on the regular and will go LC or NC in the not too distant future. This is epically bad parenting and they’re not even married.",
          "id": 167,
          "comments": [
            {
              "score": 362,
              "content": "She went along cause I’m betting the mother was there too!! Gotta protect her man from the ex ( in case ex came looking better than OP)🤓",
              "id": 168,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 308,
          "content": "this is what got me the most. he wasn’t being opportunistic. he was planning on making money that day but instead gave away his free labor to get reprimanded for asking for money that he was anticipating!!!!! YTA off of that comment alone (& a plethora of other things)",
          "id": 169,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "This was my first thought, OP put him at a disadvantage and all he's trying to do is make up for what he lost in doing this.  \n\nYTA",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "If anything, THEY used him to their advantage and now have the nerve to punish him.\n\nYTA!",
          "id": 171,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "“His advantage”.  He was making his argument for redress… just as you would expect a motivated young man to do.",
          "id": 172,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Yeah he didn’t use anything to his advantage. The parents 100% used him to their advantage though",
          "id": 173,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Yeah, the “using it to his advantage” thing really pissed me off.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3791,
      "content": "YTA What a shitty way to parent. You make him miss work and then you can't even have the decency to make up for the lost pay? Then punish him for asking?\n\nHe asked after the emergency was over with. Not like he was being bratty and refusing to do it without pay while you were trying to deal with an emergency.",
      "id": 175,
      "comments": [
        {
          "score": 1199,
          "content": "YTA OP. He may have also gotten flack from his job for calling in short notice. Not all jobs treat teenage employees well for calling out.  My dad always sided with my stepmom and I was treated like crap.  Guess how close I am to any of them now.  You are going to end up with a LC or NC relationship with your son once he’s free from you and your stupid *boyfriend. Taking all his electronics away and canceling his birthday for asking for babysitting money that you should have offered before he even asked since he lost work and made himself look unreliable to his job!!!  You guys are awful to your son.\n Edit: *boyfriend.  I hope she doesn’t end up marrying this guy who she allows to treat her son so poorly.",
          "id": 176,
          "comments": [
            {
              "score": 317,
              "content": "This. The reputation damage the son likely suffered with his employer is being missed here by most commenters. It’s understandable given the long list of reasons why OP was in the wrong here. I read posts like this and always wonder if they’re real. Like, OP typed that out and when she read it (probably) before hitting post it still didn’t click what a bad look this is on her?",
              "id": 177,
              "comments": [
                {
                  "score": 21,
                  "content": "I wonder that all the time reading this stuff.  Like did you read what you wrote?",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I can promise it's real, or at least things like this happen all the time. My biological mom picked step dads/boyfriends sides over me constantly. Moved out when I was 12 and my dad took me in and in her head she was such a great mom I would come back, because they can never see how they were in the wrong and always insist they put their kids first. I call her by her first name and use mom for the woman my dad married years later. I see my bio mom exactly once a year on Christmas and that's only because I see that side of the family and she's there, not to see her. Reading this post and the way op hasn't engaged with comments at all I think she doesn't realize how accurate it is and imagines this is all people who don't understand she's really in the right and her son will come around to see it (something my bio mom has said for years and still yet to realize is wrong) but this is the future op has to look forward to.",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "It's not even her husband.\n\nShe threw her son to the wolf's to keep her boyfriend happy.\n\nLike notice she didn't intercede into the conflict until her son asked for help.\n\nSad part is I doubt she will stand up for her kid now.\n\nSince that would mean having a backbone and telling her bf he was out of line and then restoring stuff to her kid.\n\nSo yeah she likely will do a half hearted act later to \"apologize without apologizing\"(read letting him stay out late, or give a different reward under the radar) and pretend nothing happened to compensate for her fuck up.\n\nSo yeah pretty sure this is a pattern and her son's already lost",
              "id": 180,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "I think even if he didn’t have a job he should have given him one a $20 or something and certainly not taken his electrics or cancel his birthday plans. He was taking care of a 6 yr old as well. The dad is just her boyfriend not even husband. He can leave one day and she will not have his son anymore and most likely have NC or LC over a damn BF. Shitty parent.",
              "id": 181,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2653,
      "content": "YTA\n\nHe is completely right, you two guilt tripped him into missing work and then punished him for asking to be paid for the inconvenience you caused him. Why couldn’t you stay home and watch your bfs kids, you didn’t need to go",
      "id": 182,
      "comments": [
        {
          "score": 30,
          "content": "Free babysitter... Pay them man his money. That is how resentment happens",
          "id": 183,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Didn't even guilt trip him - straight up made him do it.\n\nI don't know what is worse if I'm being honest.\n\nYTA",
          "id": 184,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2118,
      "content": "YTA it’s not unheard of to throw him at least $20 bucks for canceling his work/other plans to do this. His step brother injured his ankle—in the grand scheme of things, it wasn’t that serious. One parent could have easily stayed home with the kids while he got an X-ray and an ankle wrap or cast, but he helped you out. That’s one issue, and it’s the more forgivable one since I don’t know your financial circumstances and maybe money is tight.\n\nBut then canceling his birthday and taking away all his electronics? SUCH overkill.",
      "id": 185,
      "comments": [
        {
          "score": 627,
          "content": "OP had better get ready for the son to move out and cut contact as soon as he’s 18. Then we’ll get posts from her years from now “my son didn’t tell me he was getting married. I just don’t know what I did wrong.”",
          "id": 186,
          "comments": [
            {
              "score": 146,
              "content": "Exactly why he’s not eager to miss work, I imagine.",
              "id": 187,
              "comments": [
                {
                  "score": 125,
                  "content": "Yes I was just thinking this. He’s working and saving up money because once he’s graduated and turn 18 she’s never going to hear from him again. If she does, it won’t be until years have past. But hey as long as she has her boyfriend she’ll be ok lol.",
                  "id": 188,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Oh the BF will probably kick him out for something stupid and mommy dearest will go along with it. \n\nThe son helped out but missed a day of wages. \n\nSo he helped but because he asked for payment, the BF took away his electronics and his birthday. \n\nWho the F does that? A BF who doesn't want that kid around the house. His punishment is so over the top...trying to make him miserable so he moves along and out of the house.",
                      "id": 189,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "AITA for going to my son's wedding uninvited?",
              "id": 190,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 25,
          "content": "I’m still stuck on the not paying him. Ostensibly he’s a 16 year with a job that he values, which is good. If I ask a friend, who is paid hourly, to do me a favor that is during hours they’d be getting paid, I’m tossing cash at them whether or not they like it. And bc I have no money, I’d either not ask or work out some way to greatly thank them for their time. They didn’t even toss dude a pizza for dinner. Instead, he was punished. Kid’s working hard to get out of that house.",
          "id": 191,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "Absolutely!",
          "id": 192,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1912,
      "content": "YTA. Wow, such an AH. I’ll look forward to your posts in a few years when your son goes no contact and you’ll just have no idea why. Your son is right- those kids aren’t his responsibility. He stepped up and took care of them for you and missed work. You should pay him for helping you. He was being reasonable and you both punished him for being rightfully assertive. Are you trying to teach him to be a pushover just because someone yells at him? If I were him, I would never help you again and you can bet I’d be saving my money to move out as soon as I can so you can play house with your boyfriend. Be a better mom.",
      "id": 193,
      "comments": [
        {
          "score": 337,
          "content": "Oh absolutely.   These parents NEVER know what the problem is.",
          "id": 194,
          "comments": [
            {
              "score": 188,
              "content": "Classic Missing Missing Reasons parents. “We have NO idea why our son never calls!!!”",
              "id": 195,
              "comments": [
                {
                  "score": 39,
                  "content": "I can attest to the \"you never call or see me!\" \n\nMy mom and i had a VERY toxic relationship growing up. She admitted to me as an adult that she never wanted kids, but my father did, so they adopted me. But she spent a great deal of time making me feel worthless and not good enough and not like my \"perfect\" cousins. My mother separated from my father when I was 5, and my father ended up with custody of me. But he had his own issues. Fast forward to. me turning 18. 2 weeks after my birthday I was moved out. I chose to not have contact with them, and only called them on Christmas. This lasted over a decade. My father passed away in 2006, and I stepped up and took care of all the arrangements INCLUDING taking him to another country where he had wanted to retire/be buried. My relationship with my mother greatly improved after this. We started having ADULT conversations and we have grown closer. But we will NEVER have the relationship she thinks we should have - one where I call everyday, etc. I left my ex of 14 years, and moved 700 miles away to another state. My mother is mad that I moved away without consulting her and giving her a chance to \"talk me out if it\" (her words!) Mind you I am in my 40's. I am planning a wedding, and she has threatened to not come if I do not invite HER cousin to my very small wedding. It's a mess. \n\nBut in short: she made her bed years ago when I was a child and she took everyone else's lies about me as truth instead of believing me. She made her bed when she verbally, emotionally and mentally abused me. She's lucky I still maintain some form of contact.",
                  "id": 196,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Stand your ground and keep your boundaries. If she doesn’t come, she doesn’t come. It’s her choice and it will be on her if she isn’t there. You get another shot at making a family when you get married (I’m not talking about kids necessarily) but making a healthy supportive dynamic.",
                      "id": 197,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "Naaah, she's 'being a better girlfriend', she's no Mum. Poor kiddo has no-one in his corner and has to pay for *months* for missing out on work, having his electronics stolen, missing his own birthday party.\n\nI'll put money down, he won't be there for his 18th. He's outta that hellhole asap.",
          "id": 198,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}