{
  "post content": "I'm a father with primary custody of a 13 year old daughter. She's had terrible trouble with ear infections and strep. The Dr recommended a tonsillectomy. It is not an emergency,  but will improve her health as she gets older.\n\nMy ex wife and I agreed to let our daughter decide. She is scared, but ultimately decided she wanted it. Called the ENT, and they gave me two dates. The first one was on a day she has an orthopedic appt, and the second 8 days later. We picked the latter. \nAfter I hung up, I remembered it was her mother's birthday. Our daughter said it was fine, they would be with her the day before anyway, and could celebrate then\n\nHer mother had a fit. She said I need to move it, because if something went wrong, it would be a bad memory on her birthday. If I don't move it, she will not pay her share, because she won't agree to it on that day. She said since it's just an elective surgery, she doesn't have to agree anymore if it's on a day she doesn't want.\n\nI'm leaving the date alone, as our daughter wants the extra week to prepare herself for being in pain for 2 weeks.\n\nSo...am I the a-hole?",
  "id": 1,
  "comments": [
    {
      "score": 11822,
      "content": "NTA. Mom is immature",
      "id": 2,
      "comments": [
        {
          "score": 5340,
          "content": "While OP is totally NTA, I’m a therapist, and this is a super common superstition.  You would be surprised how superstitious people are in general, let alone when fear comes in.  It sounds like mom isn’t bummed her daughter won’t be there for cake, she’s afraid her daughter will die on her birthday.  People often avoid doing things in birthdays and holidays for this very reason.  I don’t think mom is immature, but she’s letting her emotions rule her.  Also, fwiw, it would be strange if mom wasn’t worried about her kid getting surgery!  My caseload is mostly moms and even something as simple as kid getting a wart removed with a local often causes anxiety.",
          "id": 3,
          "comments": [
            {
              "score": 624,
              "content": "\"super common superstition\" So immature then.\n\nThe mom has made it clear she cares more about the risk of a lasting memory of her child dying in surgery on her birthday, than the fact that this will improve her child's quality of life. That is EXTREMELY immature, superstition or not.\n\nOP, NTA. Birth mom, big AH.",
              "id": 4,
              "comments": [
                {
                  "score": 1514,
                  "content": "Superstition is much more complicated than that.  I think it’s also important to note that this is elective surgery and there are many other days this could be performed.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1033,
                      "content": "There are elective surgeries which are done for aesthetic purposes and elective surgeries which improve quality of life. This is obviously the latter and you can understand the daughter wanting it done sooner",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 134,
                      "content": "No, there isn't. The daughter chose this day in particular. I'd hazard a guess that it's because she realizes this may improve her health. As do her doctors hence the dates given her to choose from.\n\nEdit: to add that I'm replying to goldlion0806!",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 134,
                      "content": "Superstition is a load of bullshit.\n\nYou're not my therapist, so don't try giving me advice here..\n\nThe surgery is elective, but would increase quality of life. \"Superstition\" is the most horseshit reason I've ever heard to try and change someone's surgery date \n\nLike cmon man.\n\nEdit for clarity: changing your own surgery date because of superstition? Acceptable.\n\nForcing someone else to change their surgery date because of your own superstition? Massive asshole.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 62,
                      "content": "Does the person who is having the surgery get to have any input to when the surgery is? I think that is most important here. Patient first",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 44,
                      "content": "It's elective in the sense that it's not an emergency, not in the sense that it's unnecessary. \n\nTherapy is elective, but I assume you'd agree some people absolutely need it. When you give someone choices for an appointment and they hem and haw and decide to wait because of anxiety do you think it's healthy or something that is part of their problem? OP is doing what's best for the patient not what's best for mom, who is not his primary concern. If they go to court to get her to pay her half of the surgery, the judge is going to laugh their ass off that mom \"didn't want the surgery on my birthday\" as an excuse for not paying.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "You’re advocating for believing in make believe and fairy tails instead of actual medicine and science to relieve a child’s pain",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 36,
                      "content": "*\\*Qualified therapist offers informed opinion based on real-world experience on how this situation has more nuance to it than first appears**\n\n**”A WITCH! BURN THEM!”**\n\nMan, this site sometimes.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "The mom's reason being superstition is a speculation on your part. \n\nEven if her reason is based on superstition, the mom letting her superstitious beliefs take precedence over her child's well-being sounds like a clear example of immaturity as a parent. \n\nAlso, an elective surgery doesn't mean that the timing of it is not significant. Have you ever suffered an ear infection? It is very uncomfortable and often painful as well. And it is not like the daughter had 12 different dates to choose from. The daughter chose one of the two dates that she was given the fact that she already had a doctor's appointment on the earlier date. The second date sounds like the earliest next date available by the provider *and* feasible for the daughter to get the tonsillectomy and take care of the ear infection.\n \nThe mom throwing a fit for *any reason* is immature about matters like this where she really needs to put her own desires aside to focus on helping her daughter feel better. Throwing a fit and refusing to pay her share for the surgery because something may go wrong and that will taint her birthday is even more immature and selfish. \n\nOP, NTA.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "But when? She may have to wait months if she doesn't choose one of those two days.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "OP was given two dates and the daughter accepted the latter.\n\nThe mom needs to realize that more than her stakes are at play.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 106,
                  "content": "And hello, if the daughter dies in surgery 2 weeks before her birthday, she's still going to be miserable everytime her birthday rolls around.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 64,
                      "content": "That was my morbid thought too. Like pretty much whenever your kid dies your future birthdays are probably ruined.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "I don't think it implies she doesn't care about her child's health at all. She's not asking that the child doesn't have the surgery. She's just asking that the date be moved so it's not on her birthday. My grandmother died on my birthday and I can tell you it sucks because it never fails that when we have a gathering for my birthday, there's always someone that starts crying because they start reminiscing about grandma, usually my mom and sister. There is always a cloud hanging over my birthday now. It's a simple ask and it's not that big a deal to rearrange schedules. They could move the orthopedic appointment and do it that day, or put off the tonsillectomy for the next available opening. I guarantee they're not booked for the rest of the year. The two dates OP gave are just the first openings available.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Immaturity is dismissing a therapist and other peoples’ issues because it doesn’t bother you.\n\nThat being said, there doesn’t seem to be much OP can do about moving the date",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Also… the kid not wanting to reschedule due to it being mom’s birthday says a lot. \n\nNTA",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "It is not that deep. Just reschedule the non emergency surgery. Mom is being overdramatic but the dad does not need to choose this hill to die on. The mom is uncomfortable with the current date, just move it.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "It really has nothing to do with maturity. Superstitions are like religious beliefs for some, and they can get even stronger with age.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 6,
                      "content": "So it has to do with maturity and reasoning..",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "No, the mother is afraid her child will die. And if her child dies on her own birthday, that will be even worse. Her fear may not be rational, but it's hardly uncommon.",
                  "id": 24,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Sort of comes across as she'd be okay with her kid dying during surgery, just not if it's on her birthday.",
                  "id": 25,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "I think she's more scared but isn't articulating that she's worried that it will go wrong BECAUSE it's her birthday. Like \"of all days to go wrong, of course it would happen on my birthday\". Think the fact that it'd be much worse for her daughter to be hurt on her birthday makes it seem like she must prepare for it as the most likely scenario. \n \nAgain, it's still selfish, and she needs to be reexamining her superstitions and realize that it'll be the same on her birthday as it would any other day, and delaying it (or making it sooner) is much more unfair to her daughter. I can just empathize with the fear a little bit. I remember being so upset that my bf couldn't sit with me when I got my wisdom teeth pulled (i have a fear of anesthesia) and it almost felt like I'd die BECAUSE he wasn't there. I still didn't make him come at 6 am though.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 135,
              "content": "I understand her anxiety. It's really hard to hard to have a hard event cemented on your birthday. And they always say, even though there are routine surgeries...there is no 100% safe surgery.\n\nEmpathy is good here. I always hate how there can be two dates close offered, and the next day is months away.",
              "id": 27,
              "comments": [
                {
                  "score": 94,
                  "content": ">\tthere is no 100% safe surgery.\n\nExactly. My 7 y/o cousin died from a tonsillectomy. Complications can always arise. I don’t agree with the mom, but I can at least sympathize with the fear.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Same. I have empathy for her. I do understand.\n\nI think he should call just to see how close the next appointment is. Not cancel it though. And only reschedule if there is a date not too far, and if his daughter agrees.\n\nI know how asking what the next date is though...sometimes the next date is months away.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "NTA. \nMaybe the mom can view it as a positive. Her daughter’s life will have an improvement on her birthday. \n\nAlso, I’m confused as to why mom and her birthday are even a consideration. Forget your birthday, pay for the surgery, spend your birthday in the hospital waiting for your daughter to get out of surgery, learn from the surgeon that your daughter is doing amazingly well, receive the best news ever on your birthday, then thank you ex husband for handling everything. \n\nAlso, I’ve had that surgery as an adult. It’s a MUCH easier recovery for a child I hear. The recovery was difficult as an adult but did last about 2 weeks. \nIt definitely improved my quality of life since I was getting strep throat at least once a year and once was hospitalized because of it. \n\nI wish someone would want me to postpone ANY medical treatment for their birthday. HA!",
                  "id": 30,
                  "comments": [
                    {
                      "score": 22,
                      "content": "If you have ever had anyone die on the operation table during a \"routine\" procedure... you might understand.",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "> learn from the surgeon that your daughter is doing amazingly well, receive the best news ever on your birthday, then thank you ex husband for handling everything.\n\nAlternatively, learn from the surgeon that there were complications, and receive the worst news ever.",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -3,
                  "content": "[deleted]",
                  "id": 33,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Nothing in his statement says she's not worried about her daughter in general.",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 101,
              "content": "The thing that triggered me is that she threatened not to pay her half. I'm not saying her feelings are invalid, but that threat was uncalled for.  I know for me that would have solidified my decision not to change the date. You don't get what you want from me by threatening me.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "I'm not superstitious.  I'm a little stitious...",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "My step son's mom passed away on my birthday several years ago, and I woke up with contractions and bleeding on her birthday a few weeks back (was too early for little ones, doc was able to get him comfy again but is now ignoring his eviction notice). I am in no way a birthday person or generally superstitious but can't say I love the coincidences.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "As someone who had a tragedy occur on their birthday (father had a stroke), it sticks with you. I haven’t had a birthday that felt even remotely happy since then. Granted I’ve only had two since then and the most recent one I had COVID for. Still, I don’t know if I can be happy on my birthday or not anymore. Not giving a judgement for this one as I can’t give an unbiased opinion.",
              "id": 38,
              "comments": [
                {
                  "score": 14,
                  "content": "I usually have bad things happen on my birthday, or the days near my birthday. At 21, I had to put my childhood cat down. At 22, I was almost fired from my internship. At 23, I was in the quickcare for four hours having an asthma attack. At 25, I was broken up with. So on and so forth. At 28, I got ran over.\n\nI don't celebrate my birthday anymore except as a reason to go to dinner at my favorite mid-range fancy place because bad things will happen, and they seem to be getting worse as I get older, and I have no desire to die because whatever universal power at play has decided it hates seeing me have joy and be celebrated.\n\nThis is 100% superstitious of me, and I'm a rather diehard atheist.\n\nHowever, even though I am biased, I'm still gonna give my judgement. NAH",
                  "id": 39,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Hey, another bot replied to you;  /u/IntelligeChef is a scammer!  **It is stealing comments** to farm karma in an effort to \"legitimize\" its account for engaging in scams and spam elsewhere.  Please downvote their comment and click the `report` button, selecting `Spam` then `Harmful bots`.  \n\nPlease give your votes to [the original comment, found here.](/r/AmItheAsshole/comments/146s7ns/aita_for_not_rescheduling_daughters_surgery/jnru65m/?context=1)\n---\n\nWith enough reports, the reddit algorithm will suspend this scammer. \n\n^(*Karma farming? Scammer??*  Read the pins on my profile for more information.)",
                  "id": 40,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "I am an anxious/superstitious mum by nature, due to childhood trauma and long-term abuse & neglect by my own parents, so I can see your point.\n\nBut - and it’s a big but - my daughter does not need to know about, or be affected by, my worries and intrusive fears.  They are MY problem, and I’m working on them (EMDR is brilliant).  I never ever stop her doing things, and I absolutely would not stop her having a life-improving surgery on my birthday.  This is because I’m a mum first, and trauma-survivor second.  It’s my responsibility to deal with my anxiety/superstition/fears, and it’s not my daughter’s problem.\n\nOP u/cleansingchakra’s ex wife IS immature, and putting herself first, when she should be saying “Absolutely; we will have my birthday a day earlier.”\n\nNTA.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "it's still immature to prioritize your superstitions over your child's agency with regard to their own health.",
              "id": 42,
              "comments": [
                {
                  "score": 15,
                  "content": "That’s how fear works.  Also, another day was offered and dad rejected it.  He didn’t ask for any other options of which I’m sure there were many.  And we’re supposed to believe he didn’t know this was his ex’s birthday?  At least some of this is pre meditated to get a reaction out of mom.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Because he chose what his daughter wanted, not what he wanted. You missed out completely on the fact that the mother could have talked to her daughter about this. She instead points the father as the bad guy, which is something she likely does often.\n\nLet's also point out how widely uncommon it is for fathers to get custody in custody battles. This speaks plenty to the character of the mother.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "[removed]",
                  "id": 45,
                  "comments": [
                    {
                      "score": 1,
                      "content": "he absolutely should not reschedule surgery that *the person having the surgery* doesn't want rescheduled. that would make him an asshole.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Immaturity is common. Yeah.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I kind of understand this, but it's not always superstition. When my mom was dying, I did kind of mention that it would be appreciated if she didn't die on my birthday, Mother's Day or her birthday, as those days would be difficult enough going forward. She laughed, and said she didn't \"plan\" on any of those days and would avoid them. And yes, we were both aware it wasn't \"elective.\"  \n\nNonetheless, OP is NTA.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "Immature and a bit short sighted.  No idea what the custody and support arrangements are here, but I got quite a chuckle at the idea of Mom explaining to a judge that she refused to pay for half of her child's necessary surgical procedure because it was on Mom's birthday.  IDK if it would ever come to that, but it sure does show a solid lack of parenting.  NTA.",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "NAH. Dad is NTA, but really should be better about remembering important dates and checking before he commits to major healthcare decisions. Mom should have been consulted about the dates before scheduling. I don't think she should be making threats, but the easy fix here is better communication.",
          "id": 50,
          "comments": [
            {
              "score": 21,
              "content": "I agree with your take. People here are saying she shouldn’t be anxious, but she is. You can’t just tell someone to not be anxious. I agree that she shouldn’t threaten to not pay, but she did. I would just reschedule. It’s not emergency surgery. OP should consult mom on new date and both sign off on it.",
              "id": 51,
              "comments": [
                {
                  "score": 8,
                  "content": "I'm especially in this camp because of the specific surgery. It is an unpleasant and relatively lengthy recovery. A 13yo is going to need some help from each parent, so they all should have discussed the scheduling. I'd be upset in her position, and might make some reactive comments. That's why I give each of them a pass and go NAH, the dad was inconsiderate and the mom was a bit too spicy.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "And I sure hope the daughter wasn't privy to this conversation! A 13-year-old girl about to get surgery (even a simple procedure) needs all the support she can get, and this is the opposite of supportive. OP already says his daughter is scared; imagine how she's feel if she hears Mom saying stuff about \"something happening\" and creating a \"bad memory\" on this day!",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Hey, another bot replied to you;  /u/Brilliancdfange is a scammer!  **It is stealing comments** to farm karma in an effort to \"legitimize\" its account for engaging in scams and spam elsewhere.  Please downvote their comment and click the `report` button, selecting `Spam` then `Harmful bots`.  \n\nPlease give your votes to [the original comment, found here.](/r/AmItheAsshole/comments/146s7ns/aita_for_not_rescheduling_daughters_surgery/jnsi2c2/?context=1)\n---\n\nWith enough reports, the reddit algorithm will suspend this scammer. \n\n^(*Karma farming? Scammer??*  Read the pins on my profile for more information.)",
          "id": 54,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Somehow her birthday will be preserved if something goes wrong and her kid dies the week before.\n\nGuess we know why this one bucks the trend, with the father getting primary custody.",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "More than immature.  Mom is selfish as hell!  If my child needed a procedure to improve their quality of life, I wouldn’t care if it was scheduled on my birthday, anniversary or New Years Eve.  I can see why OP has custody, Mom doesn’t put their daughter first.",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "The mom should probably re-think her priorities. In what universe she thinks that her birthday is more important than health of her daughter?",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Is it too late to go to court and fight for full custody, anyone? Anyway NTA",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -6,
          "content": "Ever hear of Jahi McMath?",
          "id": 59,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2551,
      "content": "NTA. Mum needs to get over herself. Her daughter's health is more important than a birthday celebration.",
      "id": 60,
      "comments": [
        {
          "score": 179,
          "content": "Right? I am trying to think of a scenario where I would want someone to not get a surgery they need on the only available date. And not because they're worried about their child's health or life being negatively after, they'll worried that their \"special day\" may be negatively affected if something should happen. It just feels selfish. From what I know tonsils are taken out quite routinely and have a very high success rate.",
          "id": 61,
          "comments": [
            {
              "score": 15,
              "content": "The only situation I can imagine is a worse medical emergency where my participation was strictly required, i.e. I would expect to cancel my own non-urgent surgery if I were an only child and my dad had a stroke. Not a fuckin' birthday party.",
              "id": 62,
              "comments": [
                {
                  "score": 1,
                  "content": "I’ve been in horrible accidents with deaths, and just had horrible things happen to me on birthday, so personally I wouldn’t want my kids to go under anesthesia on birthday. This mom is totally doing it for a different reason.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -18,
              "content": "OP said it’s not an emergency and I’m sure the doctor’s office will still be open after mom’s birthday. Also not sure why you chose to put “special day” in quotations?? birthdays are special. Sorry you don’t get that",
              "id": 64,
              "comments": [
                {
                  "score": 10,
                  "content": "I'm using correct grammar and punctuation. However you're misinterpreting what I'm saying. I'm not saying that surgery is life-threatening, but someone's health comes before a birthday. The mom is overreacting and making it about her. A surgery of any kind is more important than someone's birthday. Someone's health should always come first. Also it's not as if she hasn't already planned to see her daughter. In the post it says they'll see each other the day before. To suggest she should postpone a surgery is just stupid. If it were a funeral, I could understand that.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "People don't die during a tonsillectomy either lol. Like 1 in 20,000 and those people already have other issues that complicate the surgery.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1224,
      "content": "NTA - the mom needs to grow up. Life doesn’t always allow for happy memories on our birthdays and honestly the likelihood that something will go wrong is low with that surgery…the mom is only gonna stress your daughter out more",
      "id": 67,
      "comments": [
        {
          "score": 233,
          "content": "She can just as easily flip in around and say to her daughter that her being healthy is the best present she could ask for.",
          "id": 68,
          "comments": [
            {
              "score": 69,
              "content": "That’s also a great point. The mom is being manipulative….this is a very minor surgery that should change her daughters future which sounds dramatic but being sick with ear infections and strep more often than others makes it hard to do things and she should want her daughter healthy.",
              "id": 69,
              "comments": [
                {
                  "score": 25,
                  "content": "Any time one goes under, there's a chance they won't wake up. It's a valid fear.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Yes it is, like I said in my original post the risk is low in this surgery though never said their was zero risk and did you miss the part where the daughter has had to convince HERSELF to overcome the fear and is accepting coming to terms with the surgery??? Which she is doing over the next few weeks…moving it up may make the daughter stress more…moving it back may make her change her mind on a surgery that utilmatlynmay be needed in a few years although selective now. A mom worrying about her child in surgery is natural….asking to reschedule so they don’t ruin the mothers birthday despite the child’s worries is not.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Right. I was still sitting shiva for my grandfather on my 14th bday. I was sick as a dog on my 18th. COVID stole my 21st. Birthdays are about what YOU make of them. Not about presents or people making you feel important.",
          "id": 72,
          "comments": [
            {
              "score": 8,
              "content": "Exactly this. My 23rd birthday I was working a 12-hour shift and my dad called me on my lunch break and made me cry. My 24th birthday one of my then best friends cancelled on me because there would be “too many LGBTs” (4) at my birthday dinner. My 25th I had COVID. My 28th I’s just been dumped by the love of my life, had COVID again and was quarantined with the person who had just dumped me & given me COVID. Bad things happen on birthdays, it’s part of life.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Right? It’s not like it’s heart surgery. And even if it was, health is more important than birthday memories. But this is a tonsillectomy: it’s going to suck for the daughter, but it’s not a risky surgery.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 562,
      "content": "NTA. Your daughter’s Mum should be more focused on preparing and supporting your child than coddling herself against worst case scenarios. What a dick.",
      "id": 75,
      "comments": [
        {
          "score": 57,
          "content": "Especially since the daughter is already nervous about it!!! You have a kid who is already worried and then you come in with this drama act like she’s going to die on the operating table? That is terrible parenting, lady!",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Side note: That kids going to feel soooo much better once this is over. Tonsillectomies are the best once healed.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 437,
      "content": "NAH.  Not remembering your exs birthday immediately is reasonable, and your daughters point was valid. As is your exs.\n\nThe solution is to contact the ENT and see if there is another date available.\n\nUnless it's urgent, there's always another date. \n\nAs someone who books appointments regularly in my career, it is fairly standard to book people in with 2 options for dates/times available, simply so the conversation doesn't extend indefinitely. Usually between two, there will be a preference that is easier to fit in, and the conversation ends immediately. It's not because they are the only options available until the end of time.",
      "id": 78,
      "comments": [
        {
          "score": 211,
          "content": "Yeah, I'd go for a 3rd date as well. So many people here misunderstanding and think the ex-wife wants the kid to be with her to celebrate her birthday, but it isn't about \"celebrating some other day/time\" it's about the fear that something may go wrong (however unlikely that may be) and she will forever have to think about something happening to her daughter on her birthday. My Mom buried her Mom on her birthday, and I know how much that affected her. I don't blame the ex for wanting to change to a different date, and like you said, that different date doesn't need to be the other of the 2 dates originally given. I feel like this is a situation that could have been handled easily from the start, but OP dug his heels in instead of being willing to work with the ex, and now ex has responded in kind.",
          "id": 79,
          "comments": [
            {
              "score": -2,
              "content": "I'm not sure how much better the mom would feel if her had some sort of injury (or died) in the surgery a week or so before or after her birthday as opposed to on her birthday. I think the memory would still haunt her. Especially if they end up rescheduling anyways shed remember how it was almost on her birthday.\n\nTo be clear, I'm not saying OP should disregard what the mother is saying or anything.\n\nPersonally I lean towards NTA because the mother threatened to not pay her half for the surgery over this and while yes, it is technically elective, it is to avoid problems later. It's not like it is cosmetic surgery.",
              "id": 80,
              "comments": [
                {
                  "score": 0,
                  "content": "Making assumptions here, but If you're desperate, that's the only leverage you have, you try anything. It could very well be an empty threat hoping to turn the tide in her favor",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 80,
          "content": "Voice of reason. I will say that I've plenty of experience with pediatric ENT & they tend to have \"squeezing you in\" down to an art. They will almost certainly accommodate this family with another date & time, if need be.",
          "id": 82,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "While the ex wife's point is very selfish, how she feels is valid, that's true. But threatening not to pay for her half due to a selfish reason makes her very much an asshole imo.",
          "id": 83,
          "comments": [
            {
              "score": 61,
              "content": "It's also very selfish of OP to not even contact the ENT to see if there's another resolution",
              "id": 84,
              "comments": [
                {
                  "score": -6,
                  "content": "Why? It'd only be selfish if the ex had an actual reason or if the daughter wanted him to",
                  "id": 85,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Coparenting comes with considerations and picking the battles. This is a dumb hill to die on.\n\nIf they were still together, during the initial phone call OP would have asked for a third date to choose from. They aren't together, so that isn't how that conversation played out.\n\nThe solution is easy. The fighting is pointless. A straightforward solution is available.\n\nOP is being petty by not trying to solve this. The ex is being petty by not wanting that date. In reality, there may be some cultural aspects, superstition aspects, or a history of something linking dates in her past that are driving her motivation. The threats about pay are potentially empty threats because OP is digging in his heels to avoid a simple phone call and she has limited ways to make this important to OP.",
                      "id": 86,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "\"I don't want my daughter to miss my birthday party\" and \"I don't want to spend my birthday worrying about my daughter while she's in surgery\" are both entirely valid reasons when it's something that can be easily rescheduled. It isn't like they've been trying to book this appointment for months and this is the only possible time that it can happen and OP has already exhausted all other possible options. If that were the case, then the mother would be being unreasonable, but \n\nThis feels like an ESH here. OP is being petty and lazy by refusing to make a single phone call to find out if there's another date available. The mother is being petty and overdramatic by saying she won't pay for half if it isn't rescheduled. The only person not at fault here is the daughter, and that's only because I wouldn't expect a 13-year-old to realize that you don't have to take the doctor's word as gospel and can just call them and ask if another time is available besides the two initial options.",
                      "id": 87,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 37,
          "content": "Exactly. There are more options than two.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 324,
      "content": "NTA.   Lol!  Your ex is being a bit selfish and making this about her.  I hope your daughter gets better soon.",
      "id": 89,
      "comments": [
        {
          "score": 103,
          "content": "A bit? Lol as a mom I guffawed at her behavior, definitely NTA and ignore the birthday weirdos on Reddit some people seem to think adult birthdays are more important than anything in the world.",
          "id": 90,
          "comments": [
            {
              "score": 15,
              "content": "Maybe it's because my grandmother died on my birthday and I've generally had bad luck with them ever since, but I have never understood this idea that adult birthdays are somehow sacred, special personal holidays. Treat yourself, sure! For everyone else... it's just Tuesday.",
              "id": 91,
              "comments": [
                {
                  "score": 0,
                  "content": "It’s nice and all but we can’t stop the world around us for a day that only means something to our closest loved ones. I think you get a few big milestones where you can ask people to pause their lives for you and even then you gotta relax about people who simply can’t. 30th, 40th, etc is fine. But do not get mad that I can’t come to your 42nd bday at Benihana like I have kids",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 213,
      "content": "INFO: Is there a reason you can't call back to inquire about a third date?",
      "id": 93,
      "comments": [
        {
          "score": 81,
          "content": "No because OP wants to pick this fight.",
          "id": 94,
          "comments": [
            {
              "score": 21,
              "content": "Seems the mom is picking the fight. She won't even pay unless the date is changed",
              "id": 95,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "Very good question! Are these the only short-time dates available?",
          "id": 96,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 165,
      "content": "NTA. It's not about your ex wanting to have a day about herself. It's about your daughter's health. Ear infections and strep suck. \n\nAt 7 years old I was able to accept that my birthday was not celebrated on the very day (week day) but a couple days later (Saturday). And it's tonsillectomy, not heart surgery. Your ex needs to get over herself.\n\nI wish a full recovery for your daughter, don't forget to stock up on ice cream!",
      "id": 97,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 109,
      "content": "YTA. It's not that complicated - call the ENT office back and ask for a third date. Or reschedule the ortho appointment. None of this is emergency surgery and shifting the date by a week or two isn't going to change the outcome in any significant way.",
      "id": 98,
      "comments": [
        {
          "score": 26,
          "content": "Agree with YTA.  No parent would want their child going into surgery on the birthday if they had the choice.   And they have a choice.   So yeah,  OP is 100% the AH for not even entertaining the option of rescheduling.",
          "id": 99,
          "comments": [
            {
              "score": 4,
              "content": "Why would I care if my son had a surgery on my birthday?  It’s just the day I was born.  That date doesn’t hold any true value to me.",
              "id": 100,
              "comments": [
                {
                  "score": 6,
                  "content": "Because there is a real chance they might die. Tonsillectomy hold a significant bleeding risk.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 0,
                      "content": "I don’t think you read my comment.  It’s just my birthday - that day doesn’t hold any value to me.  The reply I’m replying to talks about no parent would want their child to have a surgery on their birthday.\n\nI’m not talking about the complications and the risks possibly associated with the surgery. \n\nIf I were to lose my son, I don’t care what day it falls on.  I’ll always be devastated.",
                      "id": 102,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "right.. but you have to understand you're in the vast minority with stance.",
                  "id": 103,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Idk I think the mom needs to get over herself and make a sacrifice for her kid",
          "id": 104,
          "comments": [
            {
              "score": 1,
              "content": "Or u know do it 8 days earlier and reschedule the orthodontist.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 104,
      "content": "NTA. Your ex agreed to let your daughter make the decision about getting the surgery. Daughter decided she's OK with the surgery date so that's the surgery date. It would be a shit move for you to go back on letting your daughter lead this thing because your ex is irrationally treating a tonsillectomy like open heart surgery.",
      "id": 106,
      "comments": [
        {
          "score": 50,
          "content": "Every surgery has the potential for complications. My son almost died from t&a removal. He coded during recovery & the7 couldn't intubate bc of the surgery. They called the code & 10 people came running in. They immediately started bagging him & surrounded the bed, switching off every few minutes. All we could do is sit & watch and pray & cry.",
          "id": 107,
          "comments": [
            {
              "score": 15,
              "content": "My uncle died during a supposed \"low risk\" surgery due to an error with the anesthesia.",
              "id": 108,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "No, it's not open heart surgery, but every surgery can have unforeseen complications as 100% safe surgeries don't exist. This [user](https://www.reddit.com/r/AmItheAsshole/comments/146s7ns/comment/jns7nvy/?utm_source=share&utm_medium=web2x&context=3) wrote her 7yo cousin died because of a tonsillectomy.\n\nI don't think a parent worrying about their child's surgery is very irrational, even if it's a small risk. I think most parents worry about their children when they need surgery instead of shrugging it off.",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I second this. And clearly OP’s daughter is more mature than the ex wife…",
          "id": 110,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}