{
  "post content": "My husband and I just got into (another) fight because his best friend who comes over every Wednesday is (again) staying the night. \n\nMy husband and this friend have had a Wednesday night “date” where the guy comes over to our house to “jam” every week for the last two years, and I’m getting to the point that I want to hit the guy over the head with whatever is closest at hand every time he is around. \n\nBuckle up. This is probably going to be a long one.... if you make it through all of this you are my hero. \n\nAt first he was supposed to come over just for a few hours on Wednesday nights to play guitar with my husband while I was at work. Over time I have stopped working late Wednesday’s but the jam session continues. Which was fine. However, for the last year they have barely touched the guitars and instead the guy just comes over to get high (on pot). Neither my husband or I get high with him (I don’t enjoy pot and my husband isn’t much into it either, but we aren’t morally against it so we didn’t say anything early on when we should have). \n\nNow that he is always high here, he NEVER leaves at the end of the night. Just expects to sleep over. But he doesn’t have a regular sleep schedule so instead of sleeping while we are, he is wandering around our house all night (in his boxers) making noises, watching tv, getting nonstop text alerts from other friends and ect. This always wakes me up and I have to pass by him on the way to the bathroom. At these points he always has demands. Like: “I want to watch this random movie your husband said you had. Find it for me.” Or “you need to change your litter box right now, because your cat just pooped and I can’t stand the smell.” He always says he’ll leave when my husband goes for work at 8am, but then complains that he couldn’t sleep until 6am, so he ends up sleeping until mid day. At which point he just decides to stay until my husband gets home from work and then the whole thing starts over again. What’s supposed to be one night a week often turns into at least two every week. \n\nOn top of never leaving, he has started showing up HOURS before my husband gets off work on Wednesday’s. My husband has told him “my home is your home” so he just comes right in. This wouldn’t be a problem if he could self entertain. But no. He comes in and will just walk into our bedroom (where I’m hiding) sit down on the bed, take a hit of his shit, and start talking to me through whatever I’m doing/watching on tv. \n\nEvery time he is here he eats A LOT of our food (gets the munchies, plus regular meals) but never once has had the courtesy to bring anything of his own, or to share, or to replace what he is eating here. He just goes into our fridge and pantry and eats whatever he wants because my husband told him our home was his. \n\nMy husband is always begging me to be nice and not say anything while he is here because he is lonely and needs friends.... except he has his other best friend living with him, and is constantly going on weekend trips all over the country to visit his other friends.  Not to mention those nonstop text message alerts all night. \n\nDealing with this guy is like hanging out with a 17 year old stoner non stop. He farts and burps as loud as possible wherever. Whenever. Is demanding and needy, but completely rude at the same time. Saying things like “dude! You actually made your house look SORTA nice this week.” (As I was prepping for Christmas), and “so you do sometimes make an effort on your looks” (when I had gone somewhere nice and come home with makeup on). He also complains non stop about the food I make (yet eats it all anyway). \n\nThis year for my birthday we couldn’t afford to get any gifts, so I asked my husband instead to line up his days off so we could spend four days just us together...... then this guy broke up with his girlfriend and my husband begged me to let him come over just for a bit on the first evening. Que TWO full weeks of him not going home, and demanding all of my husband’s time. I spent “our time” and my birthday, holed up in our room alone. \n\nThen, Christmas comes. I had invited my whole family to our house and tried to make things extra special because it was the first time I got to see my parents on Christmas in more than ten years. This guy’s mom had just moved to another state BUT this guy has plenty of money and no job to work around so he could have easily made the trip to her for Christmas. But he didn’t. Then his other friend/housemate also went out of town and he threw a “woe is me, I’m all alone one Christmas Eve, no one loves me” tantrum until my husband invited him to our house. He shows up. Gets high. And is a complete ass to everyone. Then throws a fit when he decides to sleep over because he has to sleep on the couch in a sleeping bag (my family were in the other beds.) the next morning we sit down to breakfast and he lets out this HUGE stinky fart right at the table like it’s nothing, then proceeds to dish himself up 90% of the food and just generally be a douche. My family was flat out disgusted by him and his behavior and couldn’t wait to leave. He stayed for three days. \n\nI feel like an ass hole because he is my husband’s best friend and I don’t want to make them not hang out, and honestly he hasn’t done anything truly terrible. He’s just annoying as shit. I fucking dread every Wednesday, and then I’m super irritated the whole time he’s here. Which I hide from him, at my husband’s request, but then my husband and I always end up fighting over him not leaving at the end of the night. \n\nI’m honestly one or two Wednesday’s away from homicide with this guy, and all this I’ve told you is just the tip of the iceberg. \n\nIf you’ve made it this far, please tell me AITA for being upset at my husband for letting this guy stay over again tonight, and wanting a substantial break from his best friend? \n\n\n\nTL;DR My husband’s best friend is a rude stoner who never leaves. AITA for not wanting him to come over for a LONG time? \n\n\n\n\n\n\n\n\nThank you all for your overwhelming response!! I haven’t been able to reply to all of you, but I want you to know I’ve read every post and I appreciate all of your opinions (even the ones calling me a shrew) and your great advice! \n\nSome clarification and an update: In case you weren't already sick of reading all this >< \n\n\nClarification 1: As some have pointed out, there isn’t much of an action here for me to ask AITA about. I’m sorry I didn’t make it clearer originally. The question is am I unreasonable and being an Ass Hole for wanting a break from having this friend over. My husband and I fought over this last night and he feels I’m being overly upset and needlessly irritable at said friend. You’ve already read how I feel about it. \n\n\nClarification 2: This post, admittedly doesn't give much positive about the friend. His friend has been in my husband’s life since he was in grade school, and while the friend is over they do actively chat, watch movies, and generally hang out while I actively hide and feel irritated. All this stuff for sure could look like an exaggeration if it all happened in the last few days, but this is sorta my laundry list of the last two years of grievances which have been building up over time. On a regular Wednesday he is just stoned, flatulent, and childish, which while annoying, isn’t really actively douchy. He has done some very nice things for my husband, such as paying to take him to some very expensive concerts so that they could both nerd out over their favorite guitar players Live. I -clearly- don’t like the guy, but my husband gets a lot of enjoyment out of their friendship and I’m not saying that has to stop. Just that -I- need a break. Also, my husband DOES have other friends, they just have lives so he only gets to hang out once every few months with them. He is also in a band with other friends whom he sees regularly every Monday night. \n\nClarification 3: My husband doesn’t see a problem with how he speaks to me because according to him “the guy just has poor social skills, that comment about your makeup was a compliment.”\n\nClarification 4: He smokes a vape style pot pen, not a physical bud, which has less residual scent and is why my husband told him he could do it in the house. Before he started using I was ok with him. He still had poor manners, but he wasn’t nearly as bad as he is now, and he never spent the night (or longer). Back before the pot I even enjoyed hanging out with the two of them every so often. Oh and I KNOW my husband occasionally also imbibes with him, which isn’t something that makes me mad. He doesn’t go overboard like his friend. \n\nUPDATE: When I woke up this morning I noticed that my phone was buzzing…. And buzzing…. And buzzing…. As all these awesome comments kept pouring in. I have never really had much success on Reddit, so when I looked and saw how many comments there were I said “Oh My GoD!” Of course my husband asked what was wrong and I said “I told the internet the story of ***** and asked if I was the ass hole for what we fought over last night.” He said..”Oh” and that was it. BUT then on his way out of the bedroom he said “I’m going to get him up”, and by the time I was dressed and out of the room they guy was out of the house and driving away. Hallelujah!!! \n\nForty minutes later when he got to work I received a text message telling me how I was his best friend and that he loves me more than the world ect. Then we texted back and forth and he said “I really feel like we both contribute to it. I feel like you are overly grumpy on things pertaining to *****. But at the same time, I invite him to come up extra days, or stay the night without running it by you. I feel we could both do better and relieve a lot of stress and frustration. Do you agree?”  \n\nHe then called a few minutes later and I told him that I know I’m grumpy but I feel like it’s reasonably so. I also told him I didn’t want to force them not to be friends just that -I- needed a break from the friend. Then I gave him some possible solutions such as hanging out at his house every other week, or have a set time that the guy needs to stop smoking in order to drive home later (thanks guys! Great suggestions!) and he agreed to consider other arrangements with the hang out time so that I could have some time away from the friend, and we agreed to talk more about it when he is off work tonight. Although I can tell he STILL isn’t seeing a problem other than my attitude : / \n\nAgain thank you to everyone who has commented! \n\n\n\n\n\n\n\nTL;DR My husband’s best friend is a rude stoner who never leaves. AITA for not wanting him to come over for a LONG time? \n",
  "id": 1,
  "comments": [
    {
      "score": 5841,
      "content": "NTA! OMFG. \\*I\\* was ready to murder him and then you told us about the post-breakup two weeks. After Christmas I'd be ready to kill your SO as well as his friend! This is so incredibly over the line of OK I don't know how you can stand it. His behaviour is obnoxious and completely inexcusable - from what you've described he's dirty, rude, inconsiderate, demanding, and boorish... and he's there for (often) \\*2 nights a week\\* for the last \\*2 years\\*. Is your husband INSANE to allow this? Just the days that you've described here is \\*220 nights\\* in the last two years. **That is 30% of your LIVES over the last two years.**\n\n&#x200B;\n\nIf you were ok with it it would be incredibly weird, but fine.... but you're not. You're not happy, and your husband is prioritising the company this demanding, gross, creeper over his wife's happiness.  \n\n\nGet thee to r/justnoSO *immediately*.",
      "id": 2,
      "comments": [
        {
          "score": 1347,
          "content": "I just can’t see anything remotely redeeming about him. Is there a particular reason why he’s the husband’s best friend?",
          "id": 3,
          "comments": [
            {
              "score": 533,
              "content": "[deleted]",
              "id": 4,
              "comments": [
                {
                  "score": 485,
                  "content": "The two friends end up hooking up, making things worse for OP and her husband and never leaving their house.  Omg that could be a sitcom!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 163,
                      "content": "r/redditwritesseinfeld ",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 45,
                      "content": "Patent that shit dude. I'd watch",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 38,
                      "content": "OP has a social responsibility NOT to do this because we can't risk them breeding.\n\n&#x200B;",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "Thay sort of happened to me once. My (at the time) bf had an ex that was a \"model\" (was not a model in any way...) who wouldn't stop coming over once he told her about me... And I had a douchebag guy that wouldn't accept he'd never get out of the friend zone. We hooked them up and things were great until they started coming around together... I let that happen for a bit until I couldn't take it anymore. The next time he called her \"angel\" and she beamed, I let slip that how \"he's been dating angels for years\" and they got in a fight and never came back. ",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Holy shit, you’re right!!! Get thee to HBO stat!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 101,
                  "content": "Hire me. I'll talk at length about my bowel habits and attribute Eminem lyrics to the Dalai Lama.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 66,
                      "content": "[deleted]",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "So the Dali Lama says “Fuck you too bitch call the cops! Imma kill you and your loud ass motherfucking barking dogs.” ",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 32,
                  "content": "Not gonna lie, if I were her, I’d be so tempted to do that",
                  "id": 14,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "I’d be more than welcome to pop over with my guitar and a full brass band and start practicing whatever genre best friend detests at 6am??",
                  "id": 15,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Lmao the thought of this is absolutely hilarious",
                  "id": 16,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 179,
              "content": "I was wondering the same thing. The husband is the asshole for prioritizing this relationship over his wife, but I can’t help but wonder why? Is it just out of habit? Maybe he needs to see it on film to realize how bad it is? He knows it makes the wife unhappy and will cause a fight but does it anyway. Maybe he doesn’t realize how nasty the behavior is behind his back? Is it hidden camera time?",
              "id": 17,
              "comments": [
                {
                  "score": 71,
                  "content": "Some people just have no boundaries or no backbone ",
                  "id": 18,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Yup.  I love my husband with all my heart but if his family lived in our same state we would wind up divorced, I'm pretty sure.  He just cannot stand up to them.  I try to see the upside, in the sense that he's a kind hearted person who hates to hurt people's feelings but it really sucks when he throws \\*me\\* under the bus so as not to hurt \\*their\\* feelings - which FWIW is what I think is happening here.\n\nCan't speak to what OP should do, but I would make an ultimatum: either this changes or I'm out the door.  Nobody should feel like a hostage in their own home.\n\nSomething along the lines of: hanging out at the other guy's house every other week, as OP suggests... and a 1 day limit on visits.  Period.  ALSO OP's husband doesn't get to blame her or make her the bad guy as in \"/u/mmehex is coming down on me and making me do this and she's really being a \\[jerk\\].\"  It MUST be presented as \"WE (meaning /u/mmehex and spouse) have had a discussion and decided WE will no longer allow extended guests\" etc - it's not the friend's business whether other people come over or how long they stay.  If he tries to blame you OP, you have to nip it in the bud - it will absolutely poison your relationship with spouse's friend and then you'll have a real mess on your hands.  I speak from experience here sadly.\n\nDH and I used to fight on Christmas b/c I no longer want to go visit his family - his sisters are cliquish and hateful to me, partly because he blamed me when it was time to set boundaries, unfortunately.  So we compromise and most years he goes to see them a few days before Christmas, then comes home Christmas Day.  Not ideal but something we can both live with.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 131,
              "content": "I bet the husband is this guy’s *only* friend, who else would tolerate this crap? Also bet that he did not, in fact, “break up” with his girlfriend, he was dumped for similar behavior. The stoner is probably driving this “we’re bffs” narrative, because it doesn’t sound like there’s any real friendship to speak of. \n\nI’m sure he is lonely and a little pathetic, but the husband is a supreme asshat for asking OP to deal with him. And cook for him! And I’m sure clean up after him! Oh and please hide from him in your own house while he roams wherever he wants?? FFS ",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "Right?!",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Probably the POS convinced husband that \"I'm your best and only friend\" and took advantage of possibly pushover attitude. He figured if he can maintain that forced image onto the husband, he gets to freeload off food, housing, and a pothouse without a job as much as he wants. Imo wife should get a goddamn restraining order in this manipulative bucket of moldy toilet paper.",
              "id": 22,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "If it's anything like the company I used to keep, it's pity.  I have a \"buddy\" that just sits in his garage drinking beer and chain smoking cigarettes.  I used to drink and smoke like a fiend, but growing up taught me that I shouldn't be like that because it'll kill me.  But I hung out with him because I felt bad for him.  Nowadays, I just avoid him, he's not worth my time, and he's extremely boring to be around.  I should also mention that he would cheat on his girlfriend, All. The. Time. And that does not sit well with me at all...",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "[deleted]",
              "id": 24,
              "comments": [
                {
                  "score": 6,
                  "content": "People don’t despise people for no reason.",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 154,
          "content": "Dude is boorish for sure, but I am inclined to say that OP is a dumb asshole just for not asking for literally any boundaries for two whole years. I don't get it.",
          "id": 26,
          "comments": [
            {
              "score": 449,
              "content": "Wandering around someone’s home stoned in your underwear in the middle of the night is a tad past boorish m8.\n\nAnd I know that OP likely felt it was within her husband’s range to better establish normal boundaries with him being HIS friend, and didn’t want to swoop in and come off as a crazy controlling wife.\n\nIf you don’t have the spine to tell your friend to cut some of his shitty behavior, it does not make your partner a “dumb asshole”. ",
              "id": 27,
              "comments": [
                {
                  "score": 153,
                  "content": "I'm not going to defend the guy, you're right that some of the behavior is bad.  But let's also put some onus on OP.  \n  \nShe needs to speak up and set boundaries.  It's her house.  If TerribleToker is farting at the dinner table and acting like a 17 year old, she should send him away.  She could \"ground\" him!   If he's entering her bedroom and complaining to her, she should explain that while he's welcome to come over and wait for her SO, she needs her space and time.  No bedroom access for him.  \n  \nOP is not an asshole, but they are being very passive about an issue that is literally in her own home and affecting her relationship.    the SO already said \"“my home is your home” so that's not exactly a united front and SquatterStoner is acting on THAT instruction.  \n  \nPeople have a responsibility to handle their own problems, and not expect that others will simply \"know\" and fix the problem.  ",
                  "id": 28,
                  "comments": [
                    {
                      "score": 201,
                      "content": "Do we know the full story here? Maybe OP and her husband are fighting *because* OP wants to set boundaries, and the husband is asking her to bottle up her feelings.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 102,
                      "content": "What do you think all those arguments are about? They’re about OP trying to set the lovely boundaries you think should be so easy for her to get in place with just a snap of her fingers. If he keeps just fucking ignoring her what is she supposed to do? I know what I’d do, move out. \n",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "It’s OP’s husband’s house, too. She probably felt like it wasn’t her place to set boundaries until it got way out of hand. ",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 144,
              "content": "She said they've fought about this a lot. It sounds like she's been trying to establish boundaries.",
              "id": 32,
              "comments": [
                {
                  "score": 5,
                  "content": "Man, it's hard.  I honestly don't much care to be around my spouse's sisters but I do get why he's attached to them... probably the same deal here:  They've been friends for life, this guy is like family to OP's DH.   \n\n\nIt's really not on us to understand why our loved ones love particular people, but it IS within our purview to ask for boundaries when these folks are taking advantage of us.   \nIt's not always as easy to get spouses to comply as some people here seem to believe.  They're torn, you know?  I've had moments when I could just kill my spouse and have had to set pretty firm boundaries, but the upside, again, is usually these are soft hearted people who don't want to hurt others' feelings.  There are worse character flaws in life. ",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 33,
          "content": "Lady, you've got the patience of a fricking saint. Get rid of both!",
          "id": 34,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Asshole maths. Take my upvote this instant.",
          "id": 35,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "This was the best use of the word boorish ever. ",
          "id": 36,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I agree 100%. I could never imagine putting my SO through something like this. We respect each others boundaries and your husband should respect you enough to know this guy is bothering you and stop him from bothering you. If a friend of mine was this rude to my girlfriend, he wouldn't be a friend too much longer. My girl and I are introverted and we know what is and isn't okay as far as friends overstaying their welcome. Hope you get this worked out. Fuck that guy.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "NTA. At all. I have to agree with what others are saying. This is so beyond unacceptable. Your husband needs to start having their guy nights at the friend’s place so he can come home at the end of the night and leave the asshole where he belongs...in his own damn house!! Wtf",
          "id": 38,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "NTA .....husband needs to stop acting like a bitch and tell this Seth Rogan like character to straighten the fuck up.  Your husband sounds pretty immature as well to put his friends needs (I use the terms needs loosely) above his wife’s.  ",
          "id": 39,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5418,
      "content": "NTA but honestly? I think the biggest asshole here is actually your husband. Don't get me wrong, it's the friend's behaviour that is the main *problem*... but he's not the one who made promises to you to love and put you first or whatever vows you actually made. He's a dick, but your husband is enabling him and is reneging on his responsibilities to you.\n\nYou need to have a serious talk with your husband because this? This is not sustainable. If it continues you're going to end up hating him and your marriage is, in the end, likely to either suck because you hate your husband or end messily.",
      "id": 40,
      "comments": [
        {
          "score": 956,
          "content": "HONESTLY. What delusional world is he living in where this dude is at his house being an absolute tool for multiple days a week/two straight weeks/multiple days with his in-laws there and that’s just “whatever?”",
          "id": 41,
          "comments": [
            {
              "score": 253,
              "content": "The husband seems to be aware of it too, based on how OP says he begs her to let him stay. \n\nI think that maybe the husband feels he peaked whenever he met this “friend” and keeps the “friend” around as a reminder of that point in time.",
              "id": 42,
              "comments": [
                {
                  "score": 22,
                  "content": "I'm getting the sense that he feels bad for his friend, and is trying to take care of him in a way.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 504,
          "content": "[deleted]",
          "id": 44,
          "comments": [
            {
              "score": 286,
              "content": "Seriously. If that dude made a shitty comment to me IN MY OWN HOME about my makeup, he’d be out on the sidewalk in a heartbeat. ",
              "id": 45,
              "comments": [
                {
                  "score": 291,
                  "content": "Eating my food is what would've set me off. Don't come to my house and eat up all our food. And don't eat the food I cook while complaining about it the whole time.\n\nAnd the way he bosses her around in her own home. I couldn't imagine being a guest in someones home and ordering them around to get a movie for me or to clean their litter box.\n\nAnd I'd be chewing my husband the fuck out for letting all this happen. Husband has absolutely no respect for her. ",
                  "id": 46,
                  "comments": [
                    {
                      "score": 263,
                      "content": ">Husband has absolutely no respect for her. \n\nI think this is what it all boils down to honestly. \n\nHusband is catering to his best friend OVER his wife. If I allowed a fraction of this to occur- my girlfriend would throw us both out. ",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 64,
                      "content": "I’m totally with you on that. If he doesn’t like it, he doesn’t have to fucking eat it. ",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 45,
                      "content": "I agree. It's more about the husband then his friend. The husband treats her like a used kleenex. This marriage is in more trouble then OP thinks.  Get a. new husband - - get a better life. ",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Yeah, if you're treating it like it's your house, it's your litter box and you can scoop it, the scoop's right beside the box, have fun! XD",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 104,
                  "content": "That one really pissed me off too. I’m one of those people who looks like a sick hobo or do my hair and makeup like a pretend supermodel, and there’s no in between. And more often than not, I’m rocking the former. I would be comfortable around my bf’s longtime friends without makeup or a nice outfit, so if they had the audacity to say something to me about when I was actually dressed up I would flip my shit. Especially as a guest in my home? \n\nBut tbh all of that behavior was abhorrent. I just can’t believe he brought her looks into it. ",
                  "id": 51,
                  "comments": [
                    {
                      "score": 44,
                      "content": "Exactly. I am so over people policing women’s bodies. \n\nA guy on the subway the other day told me “you don’t need all that makeup, you’re beautiful without it”, & then was surprised when I told him to go to hell- I don’t need your opinion on my life, Mr. Man. \n\nProbably why this touched such a nerve for me. ",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I have actually kicked out one of my boyfriend’s friends for something like that:\n\nOne of my boyfriend’s best friends was at my house several years ago and he would say super misogynistic things about women and just generally be a self righteous ass. That night when we were having a discussion and he was talking down to me and acting like I was stupid. I fucking snapped and told him, “Don’t come into my fucking house and treat me like I’m an idiot. If you want to treat me like I’m beneath you then you can get the fuck out.” \n\nHe stormed out and I actually didn’t talk to him for about two years after that. My boyfriend would still hang out with him because even if I didn’t like him I wasn’t going to stop him from see his friend but he wasn’t welcome at our house. The friend and I have since made up and he has definitely grown as a person and is less of a misogynist. He still has his flaws but I think making it clear that he was unwelcome in my house because of **his** behavior was a bit of an eye-opener to him. ",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Seriously, I'd have flipped out the first time he made some fuckery comment like that. I mean, it may even have the desired effect of having the friend not even want to come over.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 164,
          "content": "Fully agree. Exactly what i was thinking while reading. You should tell your husband to go to his bf's house if he wants to hang out. Then, do not allow his bf to smoke at your house anymore. \nYou shouldn't feel bad in your own home. Your husband is the biggest asshole, he doesn't respect you. You should be on the 1st place for him, but you are not. I won't even talk about the manchild. \nAs a last resort, i would just tell the bf that he is being a rude asshole and if he won't respect you in your own home, he can just fuck off.",
          "id": 55,
          "comments": [
            {
              "score": 7,
              "content": "I was so mad reading this! And then OP was questioning if SHE was the a-hole because of a fight?! It’s her house to. Husband really needs to understand that. It is perfectly reasonable for her to say she doesn’t want someone like that in THERE space. ",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 115,
          "content": "Came for this. \nOP, your husband kind of sucks right now. There may be something else going on with your husband, because the obsession with pleasing this friend and keeping this friend “happy” is kind of odd. \nI would sit down and pick your husbands brain as to why this is happening. There might be something really bizarre happening with the friend that your husband wants to avoid/fix by being that outlet... \n\nTalk to your husband ASAP. Do not end that discussion until you get an answer. There’s something up and it’s also eating at your relationship with your husband. Put yourself first and figure out what the hell is going on. ",
          "id": 57,
          "comments": [
            {
              "score": 25,
              "content": "You have a point there... It could be that OP's husband feels responsibility and guilt towards his shitty friend and thus doesn't dare to put boundaries down. For all we know the asshat can say he is suicidal / has tried to take his life / is depressed /something else. And OP's husband could feel that \"because he is his only friend\" he has to look out for him. ",
              "id": 58,
              "comments": [
                {
                  "score": 20,
                  "content": "Alternate theory: the friend has some serious dirt on the husband.  The husband's endless accommodation is an attempt to buy his silence..",
                  "id": 59,
                  "comments": [
                    {
                      "score": 3,
                      "content": "The plot thickens... could be. Yikes.",
                      "id": 60,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "YES. Your husband is the asshole and this whole situation is his fault, not the friend’s. This is disgusting and you shouldn’t have to live like that.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "I can’t figure out why this leech would be *anybody’s* best friend, and I sure would be questioning my SO’s judgement if I were in this situation. OP’s husband allowing this guy to behave in this manner in their home would be a **huge** red flag for me. \n\nSome people just don’t know when to cut off toxic relationships unfortunately. Perhaps it wasn’t always toxic and maybe they shared that lifestyle back in younger days, but just because you’ve known somebody for __ number of years isn’t a good enough reason to keep them in your lives if they’re like this guy. Life changes, some of us grow up and others don’t, it happens, you just gotta recognize it and move on. We’re a product of the people we surround ourselves with—don’t let shitty people affect your life like this.",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "Couldn't have said it better myself. If the story in the OP is accurate then the husband is a complete asshole.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Seriously. 2 years is a long time to be dealing with this bullshit. The husband is a pussy and he cares more about his idiot friend than his wife. ",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "NTA, seriously this is on your husband. I smoke weed but I wouldn't be an ass about it in someone else's home. I'd also bring food, not rely on someone else's pantry and fridge. He's a jerk, I'm so sorry you have to deal with that. I think you should show hubby your post, he may not realize how bad it is, you never said anything awful about the guy in your post ( ok you want to kill him but that's frustration not malice). Hope you can get this worked out.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I would honestly be worried about your husband, because this points to a serious lack of boundaries routed in a lack of self esteem.  ",
          "id": 66,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1504,
      "content": "[deleted]",
      "id": 67,
      "comments": [
        {
          "score": 1085,
          "content": "Oh yes.... I’ve tried to get them to hang out at the guy’s house. This leads to my husband needing to run home to get a guitar or change of cloths or something... then the guy wants to tag along for the ride. As soon as they get to our house WHAM the guy gets high, and just CAN’T get off the couch for a few hours, and now it’s late let’s just stay here... \n\nOn top of all that the guy literally hangs out at my husband’s work for hours at a time almost every day! My husband is the general manager so he doesn’t get in trouble but still.... isn’t that enough!? (I guess he can’t get high there so...) ",
          "id": 68,
          "comments": [
            {
              "score": 975,
              "content": "He hangs out at your husband's work?! This is so weird and creepy. I saw r/justnoSO mentioned in a comment... You really should post there. I can't imagine what your husband gets out of this guy. ",
              "id": 69,
              "comments": [
                {
                  "score": 138,
                  "content": "A lotta guys lose hope of finding friends past college. Could be that.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 149,
                      "content": "This dude isn’t a friend. He’s a dick who takes advantage over OP’s husband. Friendship is a two-way street, and the husband needs to find someone who treats it that way. ",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "I was thinking the same exact thing! Why does this man have so much dedication to this stoner manchild??? Wtf?",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 180,
              "content": "Time to start acting towards the guy in an unfriendly way. You tried to talk to your husband in a civil manner about it but he is obviously ignoring you.  It is time to be forceful and tell the guy to get out. Start being assertive.  Start letting both men know what you think of the situation.  No more walking on egg shells.  If the husband tries to say you are unreasonable or making a scene, show him this reddit thread and tell him you most certainly are right in what you are doing.",
              "id": 73,
              "comments": [
                {
                  "score": 63,
                  "content": "Idk bout showing him the reddit thread. You don't need to turn real life discussions into popularity contests with internet strangers. ",
                  "id": 74,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Nah I agree with him . As long as you mention to your husband that it's anonymous and no one knows who you are . Then tell him it's no different than going to a therapist and discussing things with him. If he gets upset over it than this guy has more issues than just his bff. At least this way he not only sees how you feel but also how the majority of people see it.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 103,
              "content": "How much weed does this guy fucking smoke where he is permanently glued to the couch for hours and has to spend the night?\n\nI mean I smoke weed a lot and so do my friends. We smoke a joint, hang out for a few hours, and then drive home.\n\nIt sounds like this guy is abusing it (yes, it's possible) and stuffing down facing the facts of life behind his drug habit. And your husband is enabling it.",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 64,
              "content": "Your husband and this guy are basically Beavis and Butthead. I think at this point you need to give your husband an ultimatum; he's clearly ignoring your feelings.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "if you live somewhere where it is not legal, I would just say that a cop came by while you were home alone one day and said that they had received a complaint about a marijuana smell. Say that you don't want him smoking at or around the house anymore because of it. His stays should get a lot shorter. ",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "> On top of all that the guy literally hangs out at my husband’s work for hours at a time almost every day!\n\nIs this guy in love with your husband? Because that is abnormal as hell and he's really up your husband's ass too much.",
              "id": 79,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "Does he have a job? I really don’t understand this. ",
              "id": 80,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "Then this is where the issue well and truly becomes your husbands problem. Asking your husband not to bring an inconsiderate ass into your home every week for an extended period of time is very reasonable, and not at all impairing their friendship (hell, you shouldn't have to ask). Time for your hubby to be a grown ass adult who can pack appropriately for visiting a friend's house so that he doesn't have to come home for forgotten things, good grief. ",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "There's something going on. I don't necessarily mean between them, but this dude has some kind of issue. Maybe he has a crush on your husband? Or a reason he wants to stay, what is his own place like? \n\nYou're a better woman than I am, because I would have tossed him out on his ass by now. I'm all for my husband having a buddy, and I wouldn't mind a weekly slumber party, but this guy isn't even remotely conforming to guest etiquette, even taking into account that they're besties.  ",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Seems like this dude is important enough for your husband to tolerate him at work almost every day, and then want to hang out for a bro night once or twice a week.  Sounds like this dude has been apart of your husbands life for quite a while, possibly longer than you have?  Please correct me, I'm just assuming here.  Cause it would be a different story if this was a new friendship, but it kinda sounds like one of those friendships that you keep just because it's always been there, regardless of how things have changed.\n\nA talk still needs to be had about his behavior and comments, and if things don't change, then look to escalate it further.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1306,
      "content": "Omg.... THANK YOU for putting it that way. I hadn’t done the math on how much time that really is. I’ve just been feeling like a jerk for constantly feeling upset by him being over. Every time we fight my husband says “it’s just one night a week!!” But it isn’t! And thanks to your comment I see it’s a freaking THIRD of our lives. Ugh. I guess I have a better argument now though. Thanks! ",
      "id": 84,
      "comments": [
        {
          "score": 438,
          "content": "Honestly? You should just show your hubbie the comments. ",
          "id": 85,
          "comments": [
            {
              "score": 243,
              "content": "Yeah, if he starts to argue then don’t even bother explaining. You’ll get 100+ people confirming that his “friend” is an absolute shitbag. ",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 226,
              "content": "This is a horrible idea. There are literally zero ways a person will take having their grievance put into the public sphere this way AND having it brought up as an argument, well. We're internet strangers, and convincing anyone we're anything more than internet strangers is just trouble. ",
              "id": 87,
              "comments": [
                {
                  "score": 112,
                  "content": "Every time I see that tidbit of advice I just cringe. It’s not a good idea to see people anonymously dogpiling on them and their friend, despite those people being right lmao",
                  "id": 88,
                  "comments": [
                    {
                      "score": 78,
                      "content": "Yeah, speaking from experience, I had a GF try and bring up that they asked on r/relationships. I took it well in the moment, but I was basically checked out of the relationship at that point and was looking for a smooth transition to just being friends. \n\n\nThese types of subreddits are good for introspection and maybe hearing some arguments both for and against your side if you aren't really able to find or hear the words, but the moment they just whip it out like it's a case against you, it basically poisons every conversation. ",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "The only way I could see something like that working is if a couple agreed ahead of time to post their situation and let the internet decide. Then they'd have to write the post together to make sure it sounded accurate to both of them. Now that I think of it, wouldn't surprise me if there's a sub dedicated to this already. ",
                  "id": 90,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Possible /r/settlethisforme could fit that mold. \n\nIt's usually a bit more lighthearted, dunno if it would work for more serious arguments.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "That's a terrible idea. He'll feel ganged up on because none of us have heard his side of the story. He'll feel violated and exposed and embarrassed which is not how you solve problems in a marriage.",
              "id": 92,
              "comments": [
                {
                  "score": 4,
                  "content": "He's not listening to her very well already. Does it seem like he will this time? All I'm thinking is she could use some backup. ",
                  "id": 93,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yeah, the backup of a marriage counselor. Not a thousand angry redditors who have already made up their mind that the husband is a total asshole with no respect for his wife.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 150,
          "content": "A marriage is between 2 people, not 3 (unless you’re into that type of thing and agreed to it beforehand). You have the patience of a saint. Quite frankly, if I was in your situation, I would have told the guy to fuck off myself and if my husband didn’t support me I don’t think the marriage would last. That’s one of the things I love about my husband, we both hate being bothered by friends and family especially after work. We once moved an hour away from everyone because we had a friend who would show up to our house to hang out every day and his family dropped by whenever they felt like it. We drew solid boundaries when we moved and now that we’re back family and friends are respectful of our boundaries.",
          "id": 95,
          "comments": [
            {
              "score": 58,
              "content": "Marrying someone who doesn’t set boundaries like this is one of my greatest fears. I love my alone time and need my home to be a safe space. Even my current bf, he is super social, but once he’s home he wants to be left alone and just enjoy his alone time/time with me ",
              "id": 96,
              "comments": [
                {
                  "score": 22,
                  "content": "My husband and I are both social, he a bit more than I, but when it comes to being at home we are usually on the same page.  I know it sounds cheesy, but we were required to take classes before we got married (Catholic church) and one thing they said stayed with us.  They said something like people don't realize how much other people (including family and friends) interfere with a marriage because of their demands on your time.  After work and kids, if you have family and friends also demanding a large chunk of your time, then what time do married couples have for each other and themselves?  \n\nInviting someone into their home as often as OP's husband is is way too intimate.  I understand letting people crash every now and then, but this guy has basically moved in.  ",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "It's a lot more than 1/3 of your life, this guy is occupying A LOT MORE of your life, **mentally**.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "Honestly?  I think you're beyond arguing at this point.  You've put up with this shit wayyyy longer than I would have ever considered doing so.  Grow a spine and throw him out.  I'm not usually one for ultimatums, but you have officially reached \"him or me\" territory here.  SOMEBODY in your house needs to set some boundaries, and it obviously isn't going to be your husband.  You're NTA in this situation, but I think you're going to have to become one in order to solve it.  \n\n\nThink of it this way - if your husband was just a boyfriend, wouldn't this behavior be a dealbreaker for you?  His unwillingness to put his partner's needs before those of his stoner friend?  His inability to create healthy boundaries for himself and his home?  I would never date, much less marry, someone who obviously was more concerned for his rude friend than for me. ",
          "id": 99,
          "comments": [
            {
              "score": 15,
              "content": "100% agree with this. It's ultimatum time. ",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "I think you need to start having conversations with the friend! Especially after 2 years, he feels comfortable enough to fart, walk around in boxes and eat your food... you should feel comfortable enough to say shut the fuck up, turn ur phone on vibrate, bring dinner tonight if your spending the night. Man up ! Take control of your house! Put your Godamm foot down and tell your husband, if you dont do anything about it, I WILL!",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "This shouldn't be some kind of debate. Your argument, his argument, that's bullshit. It's past time for this live-in bromance to end, and, sorry, but you are the one gonna have to do it.\n\nThis 'discussion' should be he goes or I go. Then be prepared to get a hotel room for a few days to drive your point home.\n\n",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Reading your story I also wonder if your husband gives money to him, it wouldn't surprise me. I don't know what your fiance situation is but you should check that out.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "/u/AnimatronicAardvark OP responded to your comment here ^",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "One night a week alone would be too often to have people sleeping over. ",
          "id": 105,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 790,
      "content": "NTA. This dude is clearly taking advantage of your husband's good will and friendship. I understand wanting to help people you care for, but there comes a time when people are taking up too many resources and it starts to negatively impact the helpers.\n\nYou need to sit down and have a calm rational discussion with your husband and explain that this guy is a cause of strain on the relationship and his behavior isn't fair to any of you (himself included). Try to do it at a time when you are both calm and rational, i.e. not right after this guy has had contact with you. Explain that he is draining you emotionally and mentally. \n\nAnd if this guy is as bad off as he says he is, then he needs to get psychiatric care, and that you guys can't provide that. \n\nI think this guy will probably piss off as soon as his free ride is over.",
      "id": 106,
      "comments": [
        {
          "score": 413,
          "content": "I think your right that he’ll probably freak out over getting called out and stop coming over. That would be great for me...... but I worry that my husband would resent me for ruining his friendship. I have no idea how or why, but my husband does seem to truly like the friendship they have. He’s also one of my husband’s only friends that want to hang out regularly, and is willing to make the 40 minute drive to our house from the nearby city. ",
          "id": 107,
          "comments": [
            {
              "score": 338,
              "content": "As someone who lives an hour or more away from my friends, I 100% sympathize with that feeling. However I also know that my home is for me and my wife, everyone else is a guest and has to respect both of us.\n\nThat being said, your husband definitely needs to be the one to tell him the rules. He also needs to do it without putting the blame for it on you.\n\nTalk everything over with your husband as calmly as you can, and if it devolves into an argument take some space and walk away until you both calm down again. Just make it clear that this is an issue, and you need to find a solution that works and brings happiness to you and your husband.",
              "id": 108,
              "comments": [
                {
                  "score": 413,
                  "content": "You know what the husband is gonna say? “Man, my wife is really being difficult about this. Sorry man, the wife.” That’s what’s gonna happen because the husband doesn’t see a problem with this.\n\nShe needs to stop giving a fuck about their feelings on this particular matter (husband and friend) and take action. This is her house too. She deserves better and should not be afraid to advocate for herself. \n\nAdditionally, her husband’s complete unwillingness to listen to or empathize with her is pretty alarming, and may be indicative of other one-sided behaviors that could be adversely affecting her relationship. If he spends that much time with this guy, he could be trying to avoid her, for whatever reason. That’s worth looking into as well.",
                  "id": 109,
                  "comments": [
                    {
                      "score": 90,
                      "content": "Ding ding ding ",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 64,
                      "content": "I know if this was my situation I'd probably just refuse to let this guy inside anymore. \n\nThe minute he came into my room??! I'd be throwing things at his head, and yelling at him to GTFO. ",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 43,
                      "content": "I had a roommate who had a friend with some living troubles, apparently his roommate just left leaving him to pay full rent. Anyways I reluctantly agree to let him stay here for a few days until he can work out a new place to stay... three months later he’s still crashed on our couch bringing his old...like 45 yr old girlfriend over (I was 22 at the time) and just making our common area disgusting. He’d offer me pot and alcohol so I was easygoing for a while. And being terrible about confrontation I let it go. Finally I caved and said he could stay the rest of the semester but he’d need to start helping pay for utilities. \n\nLong story short a few days later he took my roommate’s car, and got arrested for breaking and entering, and beating the shit out of his 45 yr old gf and her “roommate”. He’s in jail now haha. The point is, mooching and overstaying ones welcome is toxic behavior and anyone with a sense of awareness understands that. He’s neither gracious or generous, and probably has a long list of underlying problems. Cut that dude out of your life.\n\nMy roommate later got a call asking him to be a character witness for the trial haha. He said no immediately.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 150,
              "content": "You don't have to *ruin* their friendship at all.  But this is ruining your life.  You can't even be comfortable in your own home.  Not sometimes, but almost all the time.  \n\nThey can absolutely remain friends.  He could still come over on Wednesdays and then go home.  If your husband wants to spend any additional time together, it's outside the house.  No one has to tell the guy how completely gross and unwelcome he is, but your husband is going to have to talk to him about some things.  If he can't or won't, he's lacking respect for you.  Right away, some things have to abruptly stop 1) Walking into your home unannounced.  You should feel like you have privacy in your own home.  2) Sleeping over.  This wouldn't be a big deal except he just can't do it right.  So no more.  3) He can't hang around the house unless you're husband is home.  This is just no good and there's no reason for it.  The rest of the stuff may fall into place when he's not around as much.  You may need to be the one to tell him to knock off the farting and burping.  That's completely disrespectful and your husband doesn't seem to mind.  So what if the guy thinks you're a nagging, negative bitch.  Do you care?  Your husband should understand if you have to go there since he didn't after you told him you won't live like that.  If he's around less, the food issue and some of the others will probably subside.  \n\nYour husband needs to choose who his primary concern is.  He can have you both, but he can't please you both.  It's his pick right now. ",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 103,
              "content": "If your husband reacts negatively to you putting your foot down, because seriously, this nonsense needs to stop, then you might need to suggest marriage counseling to help him figure out why he’s putting this dude’s fee-fees above YOUR MARRIAGE. \n\nYour husband has to recognize that dude’s behavior is beyond unacceptable. So maybe help your husband figure out what he’s really afraid of losing if this guy stops coming over. He won’t be losing a friend because this leech is not a friend. If he doesn’t have other friends who will drive out to your house, help him figure out how to make friends closer by. What are his interests/hobbies? Where can he plug in in your community?\n\nIf he’s not ready to cut the guy off, you have to have house rules that your husband enforces, not you. His “friend,” his problem. No sleepovers unless previously agreed upon by husband and you. So if you’re okay with him getting high at your house but not sleeping over, he needs to have a plan for getting home after getting high. Uber? If you’re okay with him sleeping over, you set rules for that. He doesn’t bother you for anything he needs. If you see him in the hall, you wake up your husband to deal with him. He doesn’t walk around in his boxers scratching and burping. If he’s staying overnight, he eats when you eat, no snacking. And he leaves when your husband leaves. Period. \n\nYou have been beyond patient, but this needs to end before it wrecks your marriage.\n\nOh, and NTA. Obviously.",
              "id": 114,
              "comments": [
                {
                  "score": 58,
                  "content": "Right? If be kicking his ass into an Uber if he \"gets too high to drive\". I put that in quotes because anyone who smokes that regularly should not be getting inebriated enough that quickly to be unable to sober up and drive at the end of the night. \n\nAnd I'd be making him pay for the Uber home AND the Uber to come pick his car back up. Also I'd be locking the door when I'm home alone. Hubby isn't there, he isn't coming in. It's OPs home too, not just her husband's, and she deserves to feel comfortable in her own home. ",
                  "id": 115,
                  "comments": [
                    {
                      "score": 27,
                      "content": "Your first point is dead on.\n\nIt's definitely just an excuse that you can't combat because they'll say it's unsafe, but I guarantee this dude would drive in other situations.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 95,
              "content": "That’s a possibility, yeah, but it sounds like this guy is pretty literally ruining your life. Your husband can be upset that he’s “losing” his friend or at least having to be the one who goes to see him instead. I think (hope, desperately) that he’d be a lot more upset to lose you though. The fact that you haven’t snapped and started slapping people in two years is absolutely amazing imo. ",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "Remind your husband:\n\n1. This guy is not your friend\n2. Not-your-friend walks up in your house when he’s not home\n3. He insults you, your cooking, your appearance, your home \n4. He mooches off you: your space, your food, your money, your time, and your peace\n5. He ran YOUR family off\n6. Not your friend will let himself into his BF wife’s BEDROOM and makes himself at home\n7 he’s not your friend, he TAKES TAKES TAKES from you, is rude and insulting, and you cannot get away from him, not even in your BEDROOM. Are you supposed to retreat AGAIN, to the bathroom, and hope he has enough couth to NOT barge in there, too? \n8 Brings a federally ILLEGAL substance in your home that you could get arrested for.\n\nHoney, how you have not lost your mind in a homicidal rage and kicked this guy out under threat of calling the police if he steps foot on your property again, I don’t know. I’m so angry, I want to do it for you. \n\nYour husband is an asshole and a moron. If the list above doesn’t jolt him back to reality, he has a serious problem. \n\nMarriage counseling. Stat. Fact is, husband is too lazy to seek out friends and company, and keeps this dude around because the only effort this dude will make is that he will come to your husband. No effort made anywhere else, not even to be a decent, civilized human being to you. And that’s garbage. Any friend that’s a good friend would be polite and respectful to their friend’s spouse, and this dude isn’t, in so many ways.\n\nHusband needs to decide who he wants to be married to, you or Stoner McLoser.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "I mean, think of it this way: your husband is prioritizing a shitty friendship—one which seems to consist mainly of providing a location for this guy to get stoned and pass out—over his relationship with you. Does he have self esteem issues or something? He could get better friends than this. You shouldn't have to invite people into your home who belittle and embarrass you. If your husband cares about you, he should be rushing to your aid, not coming up with a million excuses.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Um, it seems like he’s one of your husband’s only friends that wants to hang out regularly BECAUSE he has NOTHING ELSE GOING ON IN HIS LIFE. I’m assuming you and your husband are both at an age where a SO/careers are the priorities in your life, and I’m assuming most of your “normal” friends are also at that point. On the other hand, your husband’s “best friend” is basically a deadbeat; of COURSE he’ll drive 40 minutes to hang out. 40 minutes in his day is nothing when you don’t have a job, SO, finances, etc. to worry about. I think your husband needs to realize that friendships take work, and people aren’t going to make a long drive out to see him all the time because they have lives too. ",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "> but I worry that my husband would resent me for ruining his friendship\n\nHow much time does your husband spend worrying that you resent his asshole friend moving into your home multiple days a week and making you constantly uncomfortable? Because it sounds to me like he doesn't care much at all, and prioritizes the comfort of his friend over the well-being of his own wife.\n\nIf he won't prioritize you, YOU have to prioritize you. End this nonsense. From now on, his friend isn't welcome to stay the night. They can meet up somewhere outside of your house like normal adults, because he's no longer welcome to freeload at your place.\n\nI suspect that this \"friendship\" is mostly based on said freeloading, and that's going to become clear as soon as you halt the gravy train. ",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "You're worried he's gonna resent you, when you already resent him.  See the irony?  Time to be selfish.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Your husband is being quite unreasonable. If it was your girl friend acting this way, showing up before you’re even home, invading your husband’s space in the bedroom and overstaying her welcome when you’re not even around to hang out with her - he would be fine with this because you’re friends???\n\nYour husband doesn’t seem to understand boundaries. There’s nothing wrong with hanging out, outside the home, for a few hours and then excusing yourselves to go home. You don’t even have to have this guy in your home, especially not THAT often, just to maintain a friendship. \n\nDo other people, like his family members, stomp all over reasonable personal boundaries, too? I know it’s reddit’s extreme to always recommend therapy but a few short therapy sessions really helped me understand how to set reasonable boundaries with friends and family. ",
              "id": 123,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 461,
      "content": "NTA.  Holy shit.  This guy is a parasite.  I don’t even know what to tell you, other than you telling your husband he’s not welcome in your home at all anymore, but I don’t think it’s going to be that easy.  What a fuckaroo.",
      "id": 124,
      "comments": [
        {
          "score": 125,
          "content": "Yeah : / I wish it could be that easy!! ",
          "id": 125,
          "comments": [
            {
              "score": 302,
              "content": "My spidey senses say there's something bigger going on here.  If your husband was simply oblivious and a pushover, he'd be listening to what you're saying, and making more of an effort to make sure you're happy.  You're his wife- that trumps a best friend.  Something stinks here other than this guy's nasty farts.",
              "id": 126,
              "comments": [
                {
                  "score": 333,
                  "content": "Haha. Yeah. My husband’s reasoning is that if we drop him or make him feel unwelcome then the guy will have no one else. My husband doesn’t want to do that because he’s afraid the guy will commit suicide or something. \n\nIn fairness the guy’s life isn’t great. He lives off a malpractice lawsuit from when he was born. Basically the doctor used forceps wrong and caused him to have a lifelong problem with seizures. Most of the guy’s friends like him, but can’t handle it when he has one. He likes coming here because I have been trained to take care of people during that and have experience as a live in caregiver to a lady who also seizures. When it happens here, I care for him and make him feel like it’s no big deal (instead of freaking the fuck out like his other friends) because it isn’t a big deal. That’s honestly the one thing I DON’T resent doing for the guy (why it wasn’t in the main story). He smokes pot a lot because he says it helps with the seizures. Which is fine. But he was only getting four seizures a year before he started smoking and is down to three, so I think he is taking that excuse a bit too far. He just really likes being high.  ",
                  "id": 127,
                  "comments": [
                    {
                      "score": 398,
                      "content": "> My husband doesn’t want to do that because he’s afraid the guy will commit suicide or something.\n\nThat's not your husband's responsibility. ",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 197,
                      "content": "I knew he must be getting either a settlement or an inheritance.  I think the best plan of action, and it's going to suck, is first having a long talk with your husband, and then the three of you sitting down together to iron out some very firm boundaries and ground rules (when he can show up, how long he can stay, food, comments- *everything*),  and letting him know that if he violates those boundaries/rules *in any way*, he will no longer be welcome in your home.  Make him own his behavior.  Good luck.",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 79,
                      "content": "Oh my god. So this guy has ONE person in his life who can actually care for him properly, and who makes him feel like it isn't a big deal... and he shits all over her. \n\nWhat a guy.",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 72,
                      "content": "Is the anxiety over being alone and he’s really trying to be close to you, not husband, in the event of a seizure? \n\nAlso, how does he drive to get to you if he has seizures several times a year? Don’t you have to be six months free to drive? ",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 62,
                      "content": "> My husband doesn’t want to do that because he’s afraid the guy will commit suicide or something.\n\nIf anyone ever threatens suicide, you call 911 and let the professionals deal with it. Not your problem or responsibility. ",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 41,
                      "content": "Not that it makes him being a douche any better, but a seizure isn't just a \"whatever only a few times a year\" thing. One of my friends started having seizures when she was in her early 20s. Every time it happened she had to go to the hospital, and she was not allowed to drive for 6 months. 3x a year (if he has similar restrictions) means he's basically stuck doing Uber or public transit, assuming you live in a place that's good at that.\n\n&#x200B;\n\nAgain, not excusing, but I get why your husband feels sorry for the guy. I had a similar friend (somewhat less rude and minus seizures) and it took me years to stop making excuses and drop him. Things always start off fine, then bit by bit they boil the frog and become more entitled, more weird to your friends and significant others, etc. We would go out and then at the end he'd go \"oh I don't have my wallet can you spot me.\" And I'd agree. This would happen just about 80% of the times we ever went out for lunch, or dinner, or drinks, or coffee. I bankrolled his nights out for years. He'd come with my so I could get some biking gear, and then pick out the same thing, wait til we got to the counter and it was rung up, and then say \"oh man I don't have cash, can you cover me.\" And I would. Like a dunce. He once came into my bedroom where my GF was (pretending to be) asleep and just say on the edge of the bed, silently, waiting for me. Which creeped her the fuck out. And on and on, for years.\n\n&#x200B;\n\nEventually I realized that I couldn't \"fix\" him. I'd done all I could and it made no difference, and he was a grown-ass man to boot. Yes, he had redeeming qualities, we had fun together, but all the other shit just became a burden. I decided it just wasn't my responsibility anymore. It was only an impediment to *my* life and my relationships and I was tired of it. \n\n&#x200B;\n\nYour husband will probably get to the same point eventually, but it sounds like he's just plugging his ears and pretending everything is cool for now, like I did. If he legitimately wants to spend the rest of his life as this guy's caretaker, then that's a conversation y'all should have because that's exactly what will happen if he doesn't make an active decision to cut it off. \n\n&#x200B;\n\nHe also doesn't seem fully aware that in relationships, it's not always about what some friend or whoever *does.* It's about how your SO responds to it. It feels super shitty to have an SO fail to stick up for you. Maybe he doesn't get that yet, or is just blind to it in this case.\n\n&#x200B;\n\n&#x200B;",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "Your husband needs to know that not only can he not provide the help his friend needs, but also your family cannot support a dependent especially when you already have financial concerns.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "I am an epileptic and have dealt with suicidal friends. \n\nSeizures, and people freaking about them, sucks. But I’m an adult. I can communicate my needs, and communicate my problems to my friends. You and husband are not the only people in the world who won’t be assholes about seizures. Maybe if this guy didn’t chose other loser stoner friends, he’d have someone other than you and husband. But 3-4/year? Please. Excuse, excuse, excuse. Maybe if he had that many A DAY. He can miss me with that bullshit. Pot is not the only treatment for seizures, and the only “care” needed post seizure is a fucking nap. \n\nSuicide is handled by calling emergency services, period. You do not handle a suicidal person by enabling them and letting yourself be held hostage by a threat. A threat is vocalized, 911 is called. Yes, they’ll be mad. Happens to me every time. Every time, they got over it, and weren’t mad after release—sometimes not even before release. This is husband’s excuse, excuse, excuse. \n\nPlease stand up for yourself. Hubby can be mad. He can get the hell over it.",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Are you sure your husband isn't projecting his own fears? I've read through a few of the comment threads and you've mentioned that this guy is one of your husband's only friends. Also in your post you say the horrible guest guy has lots of friends and contacts and whatnot, but yet your husband claims his friend has no other friends.... I think your husband may really mean that he (husband) doesn't have many other friends.\n\nIf husband has trouble making friends or getting out or whatever, then having someone who likes you enough to hang around with you all the time is kinda great, even if they're a giant asshole.\n\nRegardless, you need to pick a Saturday to have a discussion about it all with your husband instead of fighting on Wednesday night while it's going down. Make a list (using this post for reference) of all the crap that happens and how it makes you feel uncomfortable in your own home. Focus on Christmas. Tell your husband that that is NOT how friends behave. Tbh I would've spritzed the slob with a water bottle every time he does something gross/demanding/out of line because clearly he's just never learned.",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "It sounds like your husband has codependency issues. None of this is normal or healthy. ",
                      "id": 137,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 412,
      "content": "> Just expects to sleep over. But he doesn’t have a regular sleep schedule so instead of sleeping while we are, he is wandering around our house all night (in his boxers) making noises, watching tv, getting nonstop text alerts from other friends and ect.\n\nI made it this far. WTF OP? Why are you even asking. Cut this shit out of your house.",
      "id": 138,
      "comments": [
        {
          "score": 75,
          "content": "Exactly that shit would not fly in my house. I would demand compromise or even divorce honestly. Because the husband is picking his friend over his wife. He knows the wife is uncomfortable about having him over and he begs too. Just no. Bye boy. Just bye. ",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Go back and read about christmas",
          "id": 140,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 317,
      "content": "SHP\n\nPosts like these make me mad at everyone who replied to this and didn't immediately call shitpost on this too. What in the hell was I supposed to read here and not side with you on? Where is the conflict? Why WOULD you be an asshole here? SERIOUSLY, where was the point where we got your husband's side of things, or his point of view? You asked the question \"Am I The Asshole?\" for what... YOU HAVEN'T EVEN DONE ANYTHING! You've committed no actions! You haven't said anything or done anything! All you've admitted to was hiding in your room when he's around and feeling angsty! \n\nIf you want to vent, there are other forums for this. ",
      "id": 141,
      "comments": [
        {
          "score": 333,
          "content": "When people are in a bad situation they lose perspective. I constantly felt like I was an asshole for setting boundaries or saying no. In the OPs case, she has a hard time knowing if she is the asshole because her husband is insisting that it is okay and to be a good friend. He has pressured her into this situation and clearly makes her feel bad when she wants to drop him. That guilt makes it hard to tell what is reasonable.",
          "id": 142,
          "comments": [
            {
              "score": 163,
              "content": "This is why we don't just delete every post that has someone screaming \"validation\" in it.   Yes, I recognize and respect u/hawsman2's objection to this as low value content.  But the OP here doesn't deserve to have this question deleted and get banned because, for the reasons you give, she had reasons to at least consider that she might be wrong.  The sub is here for the subscribers' entertainment, but there won't be anything to entertain them if we abuse every asshole and reject everyone else who posts.  I think the best course is to let this OP have her conversation and get validated, so the next OP feels safe telling his story...even if he turns out to be an asshole.",
              "id": 143,
              "comments": [
                {
                  "score": 23,
                  "content": "Agreed. I may have gone a bit far with the \"If you want to vent, there are other forums for this.\", but it's in there orignally, so I'll leave it up. Still think it's a total SHP though...\n\n",
                  "id": 144,
                  "comments": [
                    {
                      "score": 3,
                      "content": "No, you didn't go too far. I usually just lurk, but this sub never used to make it to the front page. Then when it regularly started appearing on popular, everyone that has the most minor grievance posts here asking if they're an asshole over something that any functional adult wouldn't question. And then someone will always say maybe they lost perspective, or they're not great at standing up for themselves or some nonsense. There's some stupid excuse for every post like this (which is every single post now). \"I just started to stand up for myself (you go girl!)\". \"This has been going on so long I'm not sure if its normal (you're obviously aware it's not normal if you're posting it to Reddit. And you managed to type sentences so you're not a moron)\". \"People upvoted it, and we can't delete posts (that's because most everyone here just wants to vent about something similar)\". Always an excuse.",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "I very much appreciate that. I am a mod on a different sub and it can be hard when some content is on the line. Giving people the benefit of the doubt can be really important. Thanks for keeping this place both entertaining and interesting :)",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "The husband has put up with his behavior for so long that he doesn’t actually understand how much of a hardship it actually is. ",
              "id": 147,
              "comments": [
                {
                  "score": 23,
                  "content": "I absolutely agree. I am 32 and it took me until May to cut out my abusive parents because I had normalized their craziness. It can be hard to see when you are in the center of it.",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 202,
          "content": "Lots of women are insecure about being the crazy, controlling wife stereotype that doesn’t like her husband’s friends. She probably feels guilty for having these feelings to begin with. ",
          "id": 149,
          "comments": [
            {
              "score": 11,
              "content": "I'd feel insecure about it. If I was being told I was the one with the attitude problem over and over again in this situation, being gaslit, I'd wonder if I was the asshole too, I think. You're quite right.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "Agreed this belongs in relationships or relationship_advice. ",
          "id": 151,
          "comments": [
            {
              "score": 11,
              "content": "Then instead of thoughtful answers it's just going to be \"divorce\". At least here people explain in greater detail WHY something is fucked up.",
              "id": 152,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "Stuck in a situation like this, I can see why she'd be worried she is the asshole. He insults her but she has a way of helping him others don't have (seizures she mentioned in another comment) and the threat of suicide is also looming over their heads. He is an asshole but I also often feel extremely obligated to drop everything and help people like this because they do genuinely need something from me or the consequences of giving up are too large (like suicide). It doesn't matter if they constantly undermine you when you're still being asked for help. ",
          "id": 153,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "I thought the same thing. From the story the guy is obviously an asshole but it's soooo one sided I really can't make a solid judgement. ",
          "id": 154,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Yeah, it's very obvious to strangers on the internet and OP's family who are removed from the situation, and you're correct that this is better suited for relationship advice subreddits. In fairness to OP the husband clearly suffers from self confidence issues to have a friend like this, which leads me to believe she is probably not used to standing up for herself either. This is probably why she posted here.",
          "id": 155,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I hate those validation posts just as much, I'm usually right there with you.. when the person knows they're right. She is obviously having a real moral dilemma for an action she is thinking about\n\nImo you can be an asshole for your feelings, and you can ask if you're an asshole for something you plan to do in the future.",
          "id": 156,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I dunno, by the title I was going to call YTA but with the explanation it went to NTA. I think the possibility of being an ass is here, but the situation changes it. The basic premise is kind of assholish but it's deeper than that and I think worth questioning. ",
          "id": 157,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 238,
      "content": "NTA. so so soooooo NTA.\n\nbump him off and bury him in the woods somewhere and you'd still be NTA\n\nedit: removed the first word so the acronym is counted",
      "id": 158,
      "comments": [
        {
          "score": 69,
          "content": "I’d upvote that ten more times if I could... thank you! ",
          "id": 159,
          "comments": [
            {
              "score": 95,
              "content": "Pro tip: make your SO dig two shallow graves and tell him the second is for him if he let's another friend get in the same situation",
              "id": 160,
              "comments": [
                {
                  "score": 41,
                  "content": "So much yessss ",
                  "id": 161,
                  "comments": [
                    {
                      "score": 26,
                      "content": "NTA - Who is doing the laundry, cooking, cleaning up after this \"friend?\" I'm going to guess not your husband. Stop cooking for the household the days he's there, stop preparing food for him to be there, tell your husband he's in charge of laundering the linen and bedding of his friend, cleaning up the living room, bathrooms, kitchen after him. Let your husband know this friend makes you feel unwelcome and anxious in your own home and this makes you feel unloved by your husband and will not only impact sexy time with you but us undermining your marriage in general. I'm not saying not to sleep with your husband, but until your husband is inconvenienced as much as you are, he won't do anything about the situation. Ask him who he'd rather be living with long term, you or his friend. ",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 116,
      "content": "NTA should I come and shoot him for you?\n\nNo, honestly, how did you manage to stay calm until now?",
      "id": 163,
      "comments": [
        {
          "score": 93,
          "content": "He’s too high off his rocker to notice when I’m snarky or about to strangle him. So I can’t say I’m always calm. ",
          "id": 164,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}