{
  "post content": "I  recently moved into a property that backs up to an HOA neighborhood, my  yard adjacent to about 4 of theirs. I am not part of the HOA. The road  to my house is a small private road and runs parallel to their private  road. \n\nSo when I first moved in the  county told me my trash pickup location was on their road, mine's not  got a good spot for a trash truck to turn around. After about 2 pickups I  find a note on my trashcan with the usual HOA BS, can't leave me can on  their road, etc. etc. Whatever, I take it to the end of my road and  that works fine.\n\nNext I try and  get hooked up with gas, because electric heating's expensive AF. Nearest  gas line runs down their road, the utility is cool with it but they  block the construction. Fine, I install a tank and shortly thereafter  get another note on my door saying the noise from the installation was  disturbing and the tank is an eyesore. It's a buried tank, and you can't  even see the cap from the HOA properties.\n\nThat was  that for around 6 months except a few complaints of me mowing outside of  HOA designated mowing hours (but within county hours), until a flat bed  with a backhoe backs into my driveway. I walk out to see what's going  on, apparently the sewer connection for the HOA runs under my property,  something's clogged and they need to tear the pipe up to get a look.\n\nLong  story short, apparently the builder had some handshake deal with the  previous owner about that sewer line and gave up a few bucks to let them  run it through the property. No easement on the deed, nothing in  writing. I sent backhoe guy off.\n\nNext  HOA President comes and knocks on my door, tells me the sewer is  causing backup in several of the houses and no one can use their  toilets, shower, run sinks, etc. until it's fixed and rerunning the  sewer down their road instead of across my property is going to cost  millions they don't have and take months. I said something like \"Man,  that sucks for you guys, hope you get it fixed soon. Sign says no  trespassing though, so if you could keep off the property I'd appreciate  it. Have a nice day.\" I got a letter from their lawyer with a lot of  threats a bit later but didn't see much to back them up legally, figure  they can take me to court if they want.\n\nThey've had some giant loud ass mobile poop tank stuck in someone's back yard for the past 3 months and I see no signs of new pipe. A few of the HOA  residents stopped by and said the houses were  basically unlivable with the pump, could only take 5 minutes showers, only flush #2, can't sleep from the noise, costs a lot, someone lost a house sale, etc. and they didn't have any part of the HOA stupidity other than living in it. I told them I feel for them but that HOA's been a pain in my rear since week 1 and I'm not inclined to let them go  driving construction equipment across and digging holes in a yard I  worked pretty hard on after the way they've been treating me. They told  me I was an asshole.\n\nSo, am I the asshole?",
  "id": 1,
  "comments": [
    {
      "score": 7663,
      "content": "NTA. You live in the county,  not the HOA. There is no easement on your deed so the sewer line is probably against code or illegal (I have no idea how these property things work). The residents need to take action against the HOA for the unlivable conditions they created by their shortcuts and under the table deals not you. Can't wait for this episode of The Peoples Court!\nI am also  not so secretly delighted by the karma over the gas line they denied you.",
      "id": 2,
      "comments": [
        {
          "score": 4554,
          "content": "I'd by lying if I said the hum of their mobile poop pump didn't make me feel all warm and fuzzy inside.",
          "id": 3,
          "comments": [
            {
              "score": 2441,
              "content": "Does it go off at all hours? Because most towns have noise ordnances over a certain decibel. You could report them...",
              "id": 4,
              "comments": [
                {
                  "score": 2950,
                  "content": "BAHAHAHA, oh that'd be rich. I might just do that!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 965,
                      "content": "That would be an asshole move, if that’s the only way these people get some limited plumbing happening. \n\nI’d send a note to the HOA instead noting that the sound is breaking bylaw, but in a show of neighbourly good faith you’re not going to report it to the county or officially complain. \n\nThe thing I’d do is call a real estate lawyer to see what the easement would do to your property value; then figure out the cost of a pro landscaper fixing your lawn twice a year over, say, 20 years (who knows how often they might have backups?). Add the two together, double or treble it for an asshole tax, and present it to the HOA as an offer for them to purchase the easement properly (with them paying all legal fees associated with the work).",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 143,
                      "content": "Hey man you should also see if it's legal for all the poop 💩 pipes to be out of commission. The county could force them to install new ones and issue fines possibly. Be funny to see",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Do eeeeeeeet",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "If you really want to stir up some shit pay zoning a visit to find out if that sewer line they ran under your property was done to code.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "Do it! You know they’d do it to you.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Noise ordinance in my town has a 10pm cutoff and 8am start. Have at it!",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Hahaha! report it all you can bro for disturbing your peace and quiet",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "My usual response would be \"calm down, satan\",  but not this time. DO IT. And please please post the results here.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 37,
              "content": "I will admit just the image of you waking up, hearing the hum and getting the biggest shit-eating grin just makes me laugh inside.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "The fact that their lawyer is not knocking on your door here is very telling. They should have been more neighborly.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Adding to /u/Maddie215 's comment, I would recommended getting a professional surveyor in to confirm the boundary lines.\n\nAlso get check with the county on the placement of the line, since if it's blocked and something bursts under or around you property it could causes lots of issues. I'd also contact you insurance company, so they are aware of a possible issue in the future and can research stuff before there is a burst and/or the HOA try and sue you.",
              "id": 16,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Now here's a comment i want to take out of context if there ever was one!",
              "id": 17,
              "comments": [
                {
                  "score": 5,
                  "content": "Haha I literally screenshot it and send to my boyfriend out of context 😂",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "I've had a really bad day and this comment made me laugh so much. Thank you. :)  \n\n\nETA Please keep us updated.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "NTA and I might've missed a comment, but now or in a while might be a good time to take the HOA for all they're worth (or whatever you want), if you're so inclined. You don't have to, I just hate to see such great leverage wasted.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Payback is a b!tch. NTA",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "They can’t have it both ways…fuck em…NTA….put a sign up offering use of your facilities for $5 a poop and $2 a pee…",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -1,
              "content": "You're not being an asshole but you are being kind of dumb. You have millions of dollars worth of negotiating power to get them to stop messing with you, to allow you to do all the things they blocked you from doing before.\n\nYou're really wasting this opportunity on some petty revenge.",
              "id": 23,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "NTA. But I'd go to an attorney. Maybe a cool 500k deal could be worked out that \"allows\" them to work on their pipe, and can pay you enough to fix back up the yard after they're done. I wouldn't just leave all those people in a bad situation. I'd work things out to your advantage.",
          "id": 24,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "NTA but what the hell is a HOA? i swear we don’t have those where i live",
          "id": 25,
          "comments": [
            {
              "score": 171,
              "content": "It stands for Home Owners Association. It's basically a group or a board that oversees a housing development or neighborhood. You pay dues to them and they enforce rules such as where people can park, what sort of decorations you can have outside, how long your grass can be. If you violate a rule they can fine you. Some are decent and pretty much leave you alone but a lot of them are run by people who let the little bit of power go to their heads and they make everyone miserable.",
              "id": 26,
              "comments": [
                {
                  "score": 118,
                  "content": "We had an HOA in a neighborhood my family lived in shortly. Mum has the biggest green thumb on the entire planet, she can get literally anything to grow (except succulents, oddly enough) and so she was transforming the outside of the house into something very lovely. She planted a Japanese maple that had moved with us to every house we'd lived in at that point and a burning bush and all these day lilies and had those hanging baskets that she swapped out for fresh ones each year. HOA had her dig up every flower she'd planted, take down every basket, and tried to get her to cut the Japanese maple but she told them to get fucked and replanted it over at my grandmum's house. The only thing they let stay was the burning bush and the stone decorations in our garden, which mum proceeded to promptly replace with a very heavy steer skull stone statue. HOA tried to come after us again for not having the basketball goal planted in the ground. We moved out of that neighborhood.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "They also maintain common areas like pools, hiking trails, tennis courts etc.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 59,
                      "content": "This. Bad ones are all about rule enforcement. Good ones actually do things to manage the neighborhood and provide common areas.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Follow-up: what gives them the authority to enforce these fines? Couldn't you just say fuck 'em? And also just not pay the dues?",
                  "id": 30,
                  "comments": [
                    {
                      "score": 45,
                      "content": "You can't buy the property without agreeing to the rules.",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 30,
                      "content": "They can actually [force a foreclosure](https://cedarmanagementgroup.com/hoa-foreclosure/) on your property. It's wild.\n\n\n>Generally speaking, an HOA can foreclose on your house, provided state laws and your HOA’s governing documents permit foreclosures. HOA foreclosures are usually triggered by a homeowner’s failure to pay assessments and fees. That means **even if you stay up-to-date on all your mortgage payments, you can still lose your home to the HOA if you stop paying assessments**.\n\n>You **don’t even need to be behind by much. Even if you are only a few hundred dollars in debt to your HOA, the association can still have the power to foreclose on your property**. This type of foreclosure typically undergoes the same process as a foreclosure brought on by your mortgage lender. \n\n\nIt's not the greatest source but was one of the first in a quick google search and I didn't look any further as I've seen this happen before to people I know as well as myself.",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "The original developer of a subdivision sets up the rules and restrictions, which are legally binding on all the lots in the subdivision. You buy property in that subdivision \"subject to\" those rules. You should know what the rules are before you buy. Those rules get recorded in the land records and apply to all the lots in the subdivision. Those rules include how the HOA is set up and what powers the HOA has. Usually it involves property owners elected for terms as the officers of the HOA. Where I live, the developer is usually in charge of the HOA until they've sold the last lot. Sometimes those rules are minimal, but sometimes they are extensive and obnoxious. It is a double edged sword. Sometimes the HOA gets obnoxious and controlling, but sometimes they protect you from neighbors doing bad things that effect your property value.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "HOAs are deed restrictions.  The membership into the HOA is physically written into your property deed.  It's, basically, a legally binding contract you enter into when you purchase the home.  If you say \"fuck you\" and don't pay the dies, the HOA can assess fines against you, put a lien on your property, and ultimatley foreclose your house and take it.  Since it's in your property deed, it's 100% within the HOAs authority to do so.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "Home Owner Association. I only know of them through Reddit and they sound like a right pain in the butt",
              "id": 35,
              "comments": [
                {
                  "score": 41,
                  "content": "They can be an extreme pita! I sat on the board of one for ten years and it was a shit show of fights between neighbors over things like putting the trash cans out too soon, or access to the swimming pool or party room.  When we moved down to Costa Rica the first thing I said to our realtor is \"No HOAs EVER!\" There are a lot of gated American communities here with HOAs with monthly service fees between 500 and a thousand bucks a month, and filled with the same childish adults threatening to bump each other off over putting those trashcans out too earlier. Nope, no, no, no!\n\nNTA",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "When they’re good, they can be amazing. When they’re bad, they make you hate life. My only experience is with a good one but I’ve heard enough stories to realize how rare it is.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 27,
                      "content": "I could tell you horror stories that would turn your hair white. The HOA of the condominium complex we lived in while I was in Jr High and High School was so corrupt that it is noted in anti-corruption textbooks now. Seriously. They didn’t hook up all the exterior drains at all, so the water would just pool up in the condo courtyards. The exterior siding was put on upside down and inside out. The drain from a private balcony was left free hanging inside a wall (which made the wall rot out). They threatened to sue families with kids who did anything the board members disapproved of. It got worse from there. Most of the board is now in jail for fraud, felony theft, embezzlement, and several other charges.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 34,
              "content": "An hour or two on r/FuckHOA (I recommend sorting by best of the last year) will tell you everything you need to know about the kind of HOA this poster is dealing with.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "It’s a homeowners association. Essentially you pay them to take care of the community and they tell you what you can and can’t do on your own property. They’re useless and annoying.",
              "id": 40,
              "comments": [
                {
                  "score": 3,
                  "content": "[removed]",
                  "id": 41,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I would prefer these two neighbors to living in an HOA, and I would barter for eggs and auto repairs.",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "NTA. HOAs are usually pretty crappy. \n\nIn Canada we call them strata councils. Basically a bunch of sourpuss homeowners with time on their  hands to do the cheapest or most shortsighted maintenance/repairs to an apartment building, condos or gated community.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Like the other commenters said, but they're not all bad. I had one in a small neighborhood and it was great because everyone was friends. The kids would all play together, we'd have neighborhood parties, etc. It was mostly to collectively take care of street lights, trash, and keep the sign looking nice. We didn't really care about yard decorations or grass or anything.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "It's a Home Owners Association. It's kind of a self-contained community with It's own set of rules and regulations that go outside/above/beyond normal city or county rules that all residents have to follow. They can dictate what color you can paint your house, what kinds of plants you're allowed to have, outside decor, all sorts of things.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "[removed]",
              "id": 46,
              "comments": [
                {
                  "score": -12,
                  "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
                  "id": 47,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "In addition to what the others are saying I would like to include that they often manage care of any shared areas and can even handle things like pool maintenance and snow removal. I hate overbearing associations but don't mind if they simply do as promised and then mind their own business",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "HOA is short for home owners association",
              "id": 49,
              "comments": [
                {
                  "score": 3,
                  "content": "no i know that part, i meant like what do they do and how do they have so much power? that's just wild",
                  "id": 50,
                  "comments": [
                    {
                      "score": 84,
                      "content": "We almost bought a house in an HOA.  Our realtor got a copy of it and we rescinded our offer because of it.  Just some of the sticking points that scared us:\n\n1. Only two cars per house. They must not be in the driveway more than 24 hours and be stored in a garage (we had 2 kids and knew at some point we would have at least 3 cars).\n2. No boats or RVs unless stored in the garage.\n3. HOA approval for all inside renovations... even new carpet had to be approved. \n4. HOA approval for any changes to outside landscaping. \n5. One garden - could be 12'x10'.  No plants over 4 foot high and no weeds.\n5. No signage on yards.\n6. If anyone works from home and someone complained about your work you could be forced to quit or move.\n7. No more than 2 pets in total of ANY kind.  We already had a dog, 3 cats, and a gecko at that time.\n8. No noise anyone might find offensive (my kids are in band and I was worried those first years we could be forced to move because my son was awful on his baritone).\n\nThose were just a few that made us decide there is no way in hell we would live there.   I can't imagine a bunch if angry old people deciding I had to quit my job because they didn't like it, or that I couldn't put a shrub in my yard.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Think a body corporate or strata board.  And yes they are.  \n\nMy aunt lives in a villa just outside of Sydney and the shit that goes on with her board not approving repairs or using the body corporate fees incorrectly and hiring their mates at triple rates horrifies me.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "When you move into a development you know it’s under an HOA and you should review the rules. It’s generally a nightmare and I would never live in a home governed by one.",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "Yeah, it sounds like they should get together and take legal action against the HOA. It seems like they really fucked up somewhere along the way.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "The residents are the HOA.  Something people don't seem to understand about HOAs is that taking action against an HOA is taking action against yourself.   They could sue the HOA, but the only result would be that the HOA would then be forced to install the sewer lines costing millions of dollars, which would need to be paid by the residents.",
          "id": 55,
          "comments": [
            {
              "score": 12,
              "content": "But OP isn’t part of the HOA, and that’s the point. His land borders the HOA, and they’ve made things difficult for him. Now they come wanting a favor, and OP says no.",
              "id": 56,
              "comments": [
                {
                  "score": 2,
                  "content": "I understand.  My response was to the statement about residents going after the HOA.  That really isn't an option.   If OP isn't willing to flex, then the residents are just going to have to pay for it.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "I have to disagree with you. This isn’t r/IsMyRevengeJustified or r/AmILegallyInTheRight, this is r/AmITheAsshole. And OP *is definitely* being an AH to their neighbors, regardless of how badly the HOA treated them in the past. \n\nHave you ever been unexpectedly without working water/sewer for a prolonged period of time? I’m not talking “I went camping/to a cabin and had a lovely time roughing it,” I’m talking “I couldn’t cook, clean, or wash anything including any part of myself; I had to pee in a bucket and drive to the supermarket to take a dump.” My family had our water go out for a week and it *sucked*. OP’s neighbors have been dealing with this for **over 3 months**. No sewer function at all for some undefined period of time, then only the bare minimum with the sewage truck for *3 fucking months.* 3 months of 5 minute showers, not being able to flush when you use the toilet, probably no running the dishwasher, minimal washing the dishes, having to drive to the laundromat to wash clothes and linens. 3 months of *sleep deprivation* from constant, horribly loud noise.\n\nThis is clearly ESH to me. The HOA are AHs, any of the neighbors who are on the HOA’s board of directors are AHs, but for letting their neighbors suffer like this for over 3 months and feeling smug about it, OP is *definitely* also an AH.",
          "id": 58,
          "comments": [
            {
              "score": 2,
              "content": "Disagreement is OK. Facts are facts. He is not part of the HOA and he is not responsible for the sewage issues caused by past short cuts. He is the owner of his property and solved his gas line problem without involving the HOA or the neighbors. He is e titled to protect his property.",
              "id": 59,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2446,
      "content": "NTA\n\n&#x200B;\n\nTell them if they pay for the unnecessary gas tank they caused, AND let you connect to the gas line  where you need it AND let you have a designated space on their road for your trash day, AND pay for a professional remake of your garden after the work they need, you will consider it.",
      "id": 60,
      "comments": [
        {
          "score": 945,
          "content": "Get it ALL in writing and have your lawyer review.\n\nyou are NTA\n\nHOA management all assholes",
          "id": 61,
          "comments": [
            {
              "score": 115,
              "content": "AND cash payment for an official recorded easement for the sewer line",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 786,
          "content": "And an in writing agreement to no longer contact you for violating HOA rules of a HOA you don’t belong to, with a $100 fine for every individual infraction, payable to OP.",
          "id": 63,
          "comments": [
            {
              "score": 45,
              "content": "[removed]",
              "id": 64,
              "comments": [
                {
                  "score": 188,
                  "content": "To be fair, HOA's are always made up of residents. So they aren't all blameless.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 108,
                      "content": "This. There are two types of people in a HOA - the ones involved in running the fiefdom and the ones who ignore it and let the others make shitty decisions. If the neighbours want to fix the problem, they can elect a new committee that will properly address the issues. Or they can live with a poop pumper running 24/7 and not being able to use their plumbing properly. \n\nOP did nothing wrong, they matched the energy that they received. A perfect example of fuck around and find out. They screwed OP over re the gas line, now they screwed themselves over the plumbing line.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "This isn’t true. We bought into a new build community a couple of years ago and the HOA was run by the developer and the company they hired to manage the HOA. They claimed that not enough of the lots has been sold for the homeowners to have a say. Over a hundred lots had been sold and inhabited by residents at that point",
                      "id": 67,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "The exception to this could be if this is a new development. My neighborhood HOA won’t turn over to resident control till 85% of the entire development is inhabited. Until then the developer and the builders make up the board.",
                      "id": 68,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Sounds like the HOA is headed for a special assessment anyways given their only option is to completely redo the sewer line in a new location. \n\nIf the home owners were smart they’d have special coverage for assessments on their insurance. \n\nI have it on my policy and it’s something like $8/mo for me to have $50k worth of assessment coverage. \n\nIf the HOA was smart they would have recommended this to homeowners already and also wouldn’t have gotten in this pissing match with OP.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": ">They had nothing to do with the HOA's bullshit\n\nThey bought a house in the HOA and didn't do anything to correct the shitty board.  Actions have consequences, including inaction.\n\nMaybe next time they won't buy in an HOA.",
                  "id": 70,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Yes yes, and the HOA members have the choice to disband the HOA. If they're content to throw money at it, then they have to deal with the consequences, and that means paying people when mistakes are made.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 147,
          "content": "I still wouldn't give them a permanent easement for their pipe. It's huge leverage to have over real pain in the ass neighbors. Get everything you need in exchange for temporary access to the pipe.",
          "id": 72,
          "comments": [
            {
              "score": 38,
              "content": "A permanent easment for the pipe is a fair trade for a permanent easement for his gas line.",
              "id": 73,
              "comments": [
                {
                  "score": 69,
                  "content": "Having 2 easements (at the front and back of my house lot), I respectfully disagree.  For one, you cannot have any kind of permanent structure in the easement area in most areas.  We also saw the gas company digging up a neighbor’s yard recently because they could not find a gas leak.  Absolutely wrecked the lawn.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 9,
                      "content": "That goes both ways. - his gas line causes as much trouble for them as their pipe for him.",
                      "id": 75,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Other people are advocating going scorched earth with the HOA, which I highly disagree with. You still have to live next door to these people. But, considering their past behavior, I think holding onto access to the pipe as a guarantee of future good behavior makes a lot of sense.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "No, it isn't. He already put in a tank. I would ask for reimbursement of the gas tank, permanent hookup for gas, allowable garbage placement, repair and lawn maintanence, and enough to pay off your home, with a time limit on their easement, if they bother you in any way.",
                  "id": 77,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "He doesn't need an easement for the gas pipe now that he put a tank in. No way should be be tied to that HOA by letting them have any easement whatsoever, that's asking for trouble long term. They can fix their problem and leave his property out of it.",
                  "id": 78,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "Temporary access is called a license, it isn’t permanent and is revokable by the homeowner.",
              "id": 79,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "How about a locked sewage valve that only OP has access to and can shut at any time if they deem HOA to be a pain in their ass?",
              "id": 80,
              "comments": [
                {
                  "score": 5,
                  "content": "Eh, I don't imagine any lawyer would tell you that's a good idea. You're putting yourself in the position of denying crucial utilities to an entire neighborhood because you feel like it. It would be pretty hard to argue that position. You might fuck around and find out... about eminent domain or some other action taken against your property.\nThere's a huge difference between not letting somebody tear up your property, and shutting off their utilities just because you feel like it",
                  "id": 81,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "And a temporary license to fix the pipe, so you can remove the license when you want, if you need leverage in the future.",
          "id": 82,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "This is the one - you have the power in this deal now.",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Agreed. Don't just not allow them on your property because they were inflexible with you. You hold all the cards - get everyone what they want.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "And pay a nice hefty price for the easement that doesn't currently exist.  And release him from liability.  And stop coming to his door for bullshit things because he isn't part of their HOA.\n\nThis, OP, is what is known as leverage.  Use it!\n\nNTA.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 885,
      "content": "Cross post  this over on prorevenge. :) \n\nYou have those people over at the HOA over a barrel. Now, go get a lawyer and work out a nice fat deal very much in your favor. Whatever they end up settling with you will be better than people moving out, losing property valves, or the “millions” it will cost them to fix things.",
      "id": 86,
      "comments": [
        {
          "score": 178,
          "content": "Yes! Figure out what you want from them and get a lawyer to draft it. Make his fees part of your settlement. Make it permanent with the property so it transfers if you sell. NTA but don't be short sighted. You have a gold mine waiting to be dug up there.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 89,
          "content": "It reminds me of this [HOA story](https://reddit.com/r/NuclearRevenge/comments/q452ux/president_of_hoa_wants_me_to_join_ends_up_wanting/)from r/NuclearRevenge\n\nI think there are some good ideas for terms of settlement.",
          "id": 88,
          "comments": [
            {
              "score": 20,
              "content": "Quite the read :)",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "That guy! Great story.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "One of my favorites!",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I'm Partial to [THIS](https://www.reddit.com/r/fuckHOA/comments/diw9bl/got_a_not_really_an_hoa_disbanded/) Saga of the (Not) HOA President",
              "id": 92,
              "comments": [
                {
                  "score": 3,
                  "content": "Just found Part 8 (needed to go to the poster's account and search back for \"parts 5-8\").  Thanks for reminding me.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Can you give a summary of part 8? I tried to go back and find it and couldn’t find it, every post was removed :(",
                      "id": 94,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Arguably, that is a great one as well. I actually reread it when I was searching this morning. \n\nThe one I mentioned had good bits on concessions and terms of use on non-HOA properties.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Oh that was fun, hahaha",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Read it before, and read it again. 10/10 worth it. Thanks for that!",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "r/fuckhoa as well",
          "id": 98,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -8,
          "content": "Ok, but consider this: if you get a cash settlement out of the HOA, that will likely have to come from a mandatory assessment from all the residents. They had nothing to do with the HOA's bullshit (and probably hate them, too), and you have to live next to them. You might start a war with people you live next to.",
          "id": 99,
          "comments": [
            {
              "score": 73,
              "content": "Alternative, more correct take: the harder you punish the HOA, the more likely the members will vote to disband it. They're not innocent victims here, they are keeping the thing running",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Literally not his problem. The HOA tried to bully him. The residents can take over the HOA if they have a problem.\n\nNTA",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I don’t think OP *cares*, and I think the war started the first week OP moved in with the trash pickup disagreement.\n\nOP faces having his landscaping dug up-now, and probably in the future. Whatever the HOA ends up paying, it will be a *bargain* compared to running the sewer line on their own property like should have been done in the first place.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "They have voting rights there. As much as it sux for them, they need to organize ize and take control of the situation. The pricey deal is just logical consequence of HOA behavior.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Could OP write into the contract that the HOA leaders must step down and cannot ever be in the HOA leadership again?",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 563,
      "content": "This seems like the time to go to a mediator and be very clear on your need for the gas line (that they will pay for in return for the septic line easement) and the location of your trash can to be at your convenience, in perpetuity.\n\n#Use your leverage.",
      "id": 105,
      "comments": [
        {
          "score": 106,
          "content": "He already took care of the gas by having a buried tank.",
          "id": 106,
          "comments": [
            {
              "score": 122,
              "content": "Have them pay for the tank, the removal of said tank, new gas line, furnace upgrade, as well as any yard work associated with this and their sewer work.\nAlso permanent injunction that allows you access as needed when doing any repairs or upgrades to your home. Your attorney fees. And an inconvenience fee for the problems they've already caused you. \n\nI'd also make them have to call you \"your royal wonderfulness, undisputed overlord and all around amazing guy\" in all correspondence enforcable by a significant fine.",
              "id": 107,
              "comments": [
                {
                  "score": 23,
                  "content": "[deleted]",
                  "id": 108,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Around here all underground tanks have to be removed upon sale of the residence as eventually they start leaking and contaminate the groundwater.",
                      "id": 109,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 20,
          "content": "Why would OP devalue their property with an easement they don't need or want?  The HOA didn't go through the correct process of installing the sewer line, that's their problem.  OP owes them nothing and has nothing to gain.",
          "id": 110,
          "comments": [
            {
              "score": 2,
              "content": "Money.  Lots of money.  Possibly more than OP's property is worth, and OP still keeps the property.",
              "id": 111,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "That sort of solution is so win-win that you can be 100% sure the HOA will never agree to it. Neighbor disputes like this suuuuck.",
          "id": 112,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "You would be a fool to go to a mediator when you are holding all the cards. I think Colo-rectal Surgeon (38) works for that particular homeowner's association. Get a good real estate attorney and squeeze them dry. Remember, they would have to \"pay millions\" to go the other way. Let them pay off your home loan, to start. Make it renewable every 5 years. Include post digging lawn care and their lawn care can also take care of your property for free, gas pipeline with reimbursement, etc. Have them also pay a monthly fee. (Keep the gas tank). Deal from strength. They have already shown you that they are not nice.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 274,
      "content": "NTA - They need to completely revamp their sewage system in a manner that does not infringe upon your property, or they need to negotiate a deal with you that you are okay with. If they can't, well, the phrase *tough shit* has never been so apt.",
      "id": 114,
      "comments": [
        {
          "score": 33,
          "content": "I wouldn’t allow someone to destroy my property after their short sightedness for sure. They thought they were saving money in the long run and that’s what they get for not doing things right. Screw bullying the OP, OP is NTA.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "This seems like the best way forward. Keep it about legal facts and find a solution (most likely In OPs favor) to this shit storm.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 215,
      "content": "NTA HOAs are awful. They treated you like crap. I’d do the same thing. \n\nAnyone complains tell them their HOA caused this. \n\nHope you have cameras up. Document everything.\n\ntalk to a lawyer asap, pretty sure having the pipe etc under your property is illegal… So that’s why you should talk to a lawyer about suing them or making a deal and forcing them to pay for the removal of the pipe and everything and then putting your yard back to how it was. \n\nTell the homeowners they should talk to a lawyer because what their HOA did was illegal and after how they treated you, you can’t believe they have the audacity to expect you to destroy your yard!",
      "id": 117,
      "comments": [
        {
          "score": 36,
          "content": "The pipes aren’t illegal, because the developer had the permission of the previous owner.  The screw up is they didn’t buy the easement to record on the deed.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "HOAs are the worst combination of “democracy” and capitalism.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 149,
      "content": "In your shoes I think I'd be tempted to let the HOA buy me out for a tidy sum over market value. It would be cheaper for them than rerouting all their sewer, you wouldn't have to live near people who now hate you, and you can use that profit to buy a new place not near an HOA.",
      "id": 120,
      "comments": [
        {
          "score": 7,
          "content": "This is the answer.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Yup. Triple the market rate",
          "id": 122,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 93,
      "content": "NTA. They played stupid games and have now won the stupid prize.",
      "id": 123,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 53,
      "content": "NTA \n\nAgree with earlier posters this could be worth your while to invest in a visit with an attorney with experience in dealing with both private property and HOA to put together an offer that benefits both parties but most importantly protects you. \n\nThey pay for your gas tank installation, one time access to your property to address their sewer line issue where they cover everything being put back as it was and if you still want the gas line access they allow that as well. \n\nThe lawyer would know if the HOA could be forced to establish a new hookup to the sewer that only is on their property.  The concern being there could be a future blockage caused by that many people that then erupts so to speak on your property that they stick you with fixing.",
      "id": 124,
      "comments": [
        {
          "score": 32,
          "content": ">they cover everything being put back as it was\n\nI'd make sure it was worded something like \"To the homeowner's full satisfaction\", so you get to decide when it's done, not just yahoo they sent out to do the work.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 51,
      "content": "NTA, but the HOA sure is.",
      "id": 126,
      "comments": [],
      "relation": "Support"
    }
  ]
}