{
  "post content": "So I (F35) have been with my fiancé (M41) for quite a while now, more than 6 years. \n\nWe both come with some emotional baggage. I am an anxious person and I am still dealing with some trauma. He had an abusive family member and spent a lot of his youth very poor. Still, over the years, we have worked on our issues and our relationship has become stronger for it. I have done my best to learn some coping skills from free resources on the Internet to manage better. However, my fiancé acknowledges that his past messed him up but is against any sort of professional help. Even talking to me was hard at first. I am saying this because while therapy is available in my country, it's still taboo, you're considered \"crazy\" if you go to therapy. I'm no professional so I mess up and I think I made things worse here, so I am wondering if I am the AH.\n\nTonight was date night. I went out to walk our dog and he set out to clean the bathroom and get ready. I got home and as soon as I entered, I heard this horrible keening from the bathroom. It was my fiancé crying. I called for him and all I heard was more sobbing. I went there to see what was up and I found him standing next to the shower, crying his eyes out, various tools strewn across the bathroom floor. He was holding his hands out like they were contaminated and they really were covered in some foul-smelling substance.\n\nI tried to do my best to calm him down enough to learn what happened. Between sobs, he told me how he went to take a shower but realized that there was an issue with the shower handle for the cold water tap. So he tried to disassemble it and fix it. He used a screwdriver, then pliers, one thing led to another, and he ended up *using a hammer to try and put a bolt back in*. He missed and managed to make several holes in the tiles on the wall. So he panicked and tried to fill the holes with silicone caulk, didn't use any gloves, and got it all over his hands and most of his tools. This sent him into the state in which I found him – alone, crying and wailing about how he ruins everything.\n\nI didn't blame him or get mad. I cleaned his hands with acetone and we cleaned the tools and the bath. There are holes in the wall and we need to use pliers to turn the cold water tap but I am honestly worried about him, not the wall. This isn't the first time he's tried to fix things, failed, made it worse, then got upset. So I sat him down to talk and suggested that there is a deeper issue here and that he needs to maybe talk to a professional about it (and actually learn how to fix the things he wants to fix instead of just doing stuff). I reminded him that if I had the same approach to cooking, we wouldn't have nice meals. I keep telling him that it's a pattern and that he needs help. This has distressed him even more and now he's gone to bed early, sad and blaming himself. So, AITA?",
  "id": 1,
  "comments": [
    {
      "score": 30,
      "content": "NAH. Stigma is real. Can make you feel like a broken person. There are other ways people develop self esteem and coping mechanisms outside of therapy (though I still think therapy would help). That might be a good starting point to investigate.",
      "id": 2,
      "comments": [
        {
          "score": 3,
          "content": "There are a lot of therapists that do online sessions",
          "id": 3,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Is there anything you can recommend? I honestly don't know how to navigate such resources for him, especially since he seems to be against any sort of mental help right now. I also don't want to go against his wishes.",
          "id": 4,
          "comments": [
            {
              "score": 3,
              "content": "Not sure if making direct recommendations is allowed, but here goes - Better Help serves clients internationally. They're not without problems (please Google and check them out and then make a decision about whether you're comfortable with them). But a good friend of mine is a licensed therapist and works on that platform, and has told me that many of his clients are men from countries where seeking mental health care is very stigmatized.",
              "id": 5,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 24,
      "content": "NTA. Your intentions are clearly good, and it sounds like you did a great job suggesting it in a non-threatening way, but he's kind of a minefield, especially when he's barely out of a shame attack.\n\nIf anything I'd say next time give him time to recover before bringing up that topic when he is more together (like the next day or later) since it might be hard for him to see your true intent when he's in the middle of hating himself so much.",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 13,
      "content": "Check out “The Body keeps the Score” it’s for people, just like him and maybe help him recognize why he needs help.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "I'm a technician, so I know the feeling he had. It mostly happens when you don't really know what you are doing...\n\nIt goes bad so you go into a \"continuation bias\" rather than stopping you continue and screw up upon your screw-up.\n\nIt feels so bad... I can understand it drives him mad. But that mad? if he overreacts often, he should indeed get help.\n\nAnd yes he should look up how to fix stuff! I hate it when people think technical stuff is so easy they'll just figure it out...\n\nNAH",
      "id": 8,
      "comments": [
        {
          "score": 5,
          "content": "Smashing the tiles with a hammer while trying to fix the shower handle?\n\n&#x200B;\n\nThis is NOT incompetence, this is wanton destuction. this is anger issues, and mental health problems.",
          "id": 9,
          "comments": [
            {
              "score": 2,
              "content": "Sorry if I didn't make myself clear, it wasn't destruction, he had clearly used the hammer to put a bolt in the handle and missed, the holes in the wall are tiny, smaller than my pinky's fingernail, all around the handle. You can see where he was trying to aim. I honestly think his hands were just shaking and he slipped.",
              "id": 10,
              "comments": [
                {
                  "score": 2,
                  "content": "He never saw any mental health professional right?\n\nMaybe he has some learning disabilities or something else on top of the trauma of his youth... \n\nHe should just give it a shot, a psychologist isn't for \"crazy\" people... but you can't drag him there....",
                  "id": 11,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Wow, you're sharp. He's dyslexic, at least that's what one of his university professors suggested. He's never seen any mental health professional in his life, so we have no actual diagnosis. \n\nHe's had a bad experience with the healthcare system so I think he's just very distrustful of all medical professionals on top of this whole issue he has with going to a stranger with personal emotional stuff.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "NAH. All you're doing is trying to help him.",
      "id": 13,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "NAH.",
      "id": 14,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "Is your husband by chance Tim Allen?",
      "id": 15,
      "comments": [
        {
          "score": 1,
          "content": "mine is",
          "id": 16,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "😂",
          "id": 17,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "NAH - he is obviously dealing with some painful things. It sounds like you were trying to be supportive and he's just not in the head space right now to embrace that. Whatever is bothering him is triggered whenever he fails and that's something he really should address with a therapist. Just keep loving him and encourage counseling.",
      "id": 18,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH but, omg lots of red flags.",
      "id": 19,
      "comments": [
        {
          "score": 2,
          "content": "They've been together 6 years, it's not a first tinder date.",
          "id": 20,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "nah",
      "id": 21,
      "comments": [],
      "relation": "No"
    }
  ]
}