{
  "post content": "Last weekend was my (26Μ) birthday. Me and my GF of 2 years Kenzie (26F) had plans to get dinner. She came to pick me up from work and her car was packed and my best friend/his wife were in the backseat. To my surprise she planned a whole weekend away to my favorite lake, rented a sick house on the water and invited all our friends. Her sister/husband, my friends/their SO’s and a few of Kenzie’s friends all arrived Thursday night. It was an awesome and I was stoked for the weekend. We met thru my best childhood friend Grace (26F). Grace and kenzie were college friends and I never thought I had a chance. Kenzie is beautiful and while I’m not ugly, I’ve always felt like we weren’t in the same league. No idea how I got her and I still don’t. \n\nThursday night went well. Friday we swam and hung out at the house most of the day. We started drinking and playing games at night. Kenzie’s sister broke out this couples game. Basically you pick one person in the relationship that fits the description or it has prompts to engage in debates between couples. Kenzie was pretty drunk by now because she’s a lightweight and was drinking most of the night. \n\nIt was fun till a question of “What originally attracted you to your SO”. Kenzie blurted out “he was safe. And I knew he wouldn’t cheat or leave me.” I looked at her with a face and was like “huh”. She then says “yeah you seemed nice enough and after my abusive ex I wanted a safer option”. Things got really awakened and her sister quickly read a different card. I was really embarrassed and flustered so I said I had to pee and walked outside. I called Grace to tell her what happened (she was working and couldn’t come) and she got upset. I told her I wanted to leave. She said I didn’t need to take that and she would be there in the morning to get me. The night died down and kenzie tried talking to me in front of everyone but I told her we’d talk about it another time. I decided to pack my bags and sleep on the couch. And before anyone woke up I left. I texted Kenzie and told her that I didn’t want to fight about what happened and ruin everyones trip. So I was going home for the weekend and we could talk whenever she got home. \n\nShe blew my phone up all Saturday as did a few of my friends. I decided to go golfing and just turn my phone off. I just didn’t want to talk to anyone. When Kenzie showed up at my place Sunday she was fuming. Saying that me leaving early ruined the whole trip. It was all anyone could talk about. And the whole vibe felt off because the birthday boy was gone. That she felt like a POS and I didn’t give her a chance to explain. And she hardly even remembers what she said to begin with. She rented a boat (I love boating) and felt like I disrespected her efforts/money to put together the trip. I told her that I didn’t feel like arguing so I went home to avoid the drama. Some said that it was an AH move to just bail and I should have stayed because she did put a done of effort into the trip. AITA?\n\n8am edit: I’ve had some time to cool off and we are finally gonna sit down and talk out in person what happened. I’m gonna get clarity hopefully and see if this is a salvageable relationship. For everyone saying it was just the “safe” comment. I implore you to read the entirety of what she said. Being called “safe” and a “safer option” are two totally different things. Also the “seemed nice enough” comment bothered the hell out of me. She tried to speak to me immediately afterwards in front of everyone while still drunk which is why I didn’t want to talk. Will provide updates when possible.",
  "id": 1,
  "comments": [
    {
      "score": 21792,
      "content": "YTA.  This seems like a wild overreaction.  She had an abusive ex and thought you were a good guy who would treat her well and value her.  What's the problem?  You were waiting to hear that she's discovered that your the 2020s version of Fabio?  \n\nSo, you make a huge scene, likely turn her friends against you (which can do some real long term damage) and they were probably talking the whole weekend about how actually she was wrong about her first impressions and you're actually a shitty guy (I'm not saying you are--but I bet they were).  \n\nYou say in your post \n\n>No idea how I got her and I still don’t.\n\nKeep this up and she'll correct that.  If that ship hasn't sailed already.",
      "id": 2,
      "comments": [
        {
          "score": 5337,
          "content": "\"I knew he wouldn't cheat or leave me\" \n\nHow did she \"know\"?\n\nBecause she was attractive compared to him. That's my take of how OP took it. I've literally heard people say this for exactly this reason. \n\nHe'll be so happy to be dating \"up\"!\n\nEdit: like I said here. This is how *OP* took it (which is pretty clear from context)\n\nI don't think that it was *totally absent* from her actual reasoning, but I'd wager her friend vouching for him, and having met him/believed him to be a stand up guy before is probably more of it.",
          "id": 3,
          "comments": [
            {
              "score": 6297,
              "content": ">Because she was attractive compared to him.\n\nSo people who are less attractive than their partners can't cheat? She just thought he was a good guy lol. You people just love to overreact.",
              "id": 4,
              "comments": [
                {
                  "score": 5304,
                  "content": "Right - it could have been because she met him through a friend, Grace, who vouched for his character.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2409,
                      "content": "And on top of that she was drunk. My friends tell me all the time I talk so much shit when I'm drunk.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1527,
                      "content": "I love the fact that my husband is \"safe.\" What I mean by \"safe\" is that I would trust him with my life, and I literally have. He's got my back and I've got his.\n\nHe's got integrity, honesty, and what's important is his word. I *know* he won't cheat.\n\nI won't cheat because I will not, *in anyway*, fuck up what a GREAT relationship I have with an AMAZING man.\n\n\"Safe\" to me means security. I did not have an abusive ex, but I did have an abusive mother. My husband has shown me that there are people I can trust, so far mostly just him, but still.\n\n\"Safe\" means that I was able to learn a secure attachment style. I can tell him my secrets, my desires, my concerns, even my past traumas - he'll listen and, ***most importantly:*** *he won't throw my past traumas in my face as a means to hurt me*. Sure, we have areas in our relationship that we need to work on, but that's with any relationship.\n\nOP, YTA. You have zero idea just *how important* it is for people who have endured abuse to find \"safe\" people in their lives. When we say our partners are safe, that is a HUGE compliment. It should be cherished, OP. I'm dead serious.\n\nI suggest you apologize to her for over reacting and leaving the weekend that she meticulously planned and paid for. Acknowledge that you took her comments the wrong way and that leaving not only hurt her, but wasted her time and money. It's obvious she loves you.\n\nI honestly have no idea how you could make it up to her, OP, but I suggest you do. At minimum pay her back.\n\nEdit: one thing that occurred to me, OP. When she said she knows you wouldn't cheat, she's saying you're an upstanding man with integrity, and that you wouldn't do such a disrespectful and shitty thing.\n\nHer comments, while I get may not have come off well, were actually a great compliment to your character.\n\n**Edit:** thanks for the award kind redditor! Also, I see OP isn't learning a darn thing here.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 250,
                      "content": "I'm kind of peeved at Grace, too who actually exacerbated the problem.  She's probably one of those \"best friends\" who wants her bff all to herself.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 43,
                      "content": "Exactly this. I was completely over dating and trying to find someone after a few hard knocks from awful people. I decided it was better to just carve out the best life I could on my own. My current bf of 4 years met me in a pub with mutual friends and kept asking me out. I kept saying no. Turns out my best friend has known him all her life and when I mentioned him to her, she went out of her way to vouch for him. I trust this friend more than the others and it actually meant something coming from her when she explained how kind and trustworthy he was. \n\nI changed my mind, dated him, fell in love. \n\nIf I answered honestly, what attracted me to him first was knowing his character and that made me feel safer.\nI do fancy the pants off him, but it’s not the first thing that attracted me to him and it’s also not the thing that actually got me to say yes. He wasn’t really my type. However turns out my “type” is respectful, emotionally healthy, reliable, loving, kind, trustworthy men”",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "That's how I read it. Nothing that OP quoted Kenzie saying had anything to do with his looks, unless she said something that's missing he brought that up. Being safe and nice not about being less attractive than your partner.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "this is what i was thinking, but OP probably took it how killbot0224 said. grace probably told her about having a friend who was loyal and kind, and that made her attracted to OP. his gf might not even think she’s out of his league or anything, he 100% took her comment in the worst, out of pocket, way possible. he wanted to hear some “omg i saw him and my panties dropped to the floor” comment, and he took her “he made me feel safe” and turned it into “she thinks i’m ugly”. and i think a lot of people, who especially had terrible exes, have deeper attraction to people who make them feel safe and happy, rather than the hottest person in the world. her response to the question was actually very sweet, he just took it as a hit to an insecurity of his\n\nbut if i were her, and i paid for a surprise weekend away with boating and drinking and games and stuff, and my bf took what was meant to be a compliment on his character as me calling him ugly, and he left and turned off his phone to refuse to talk about it, all while claiming he “didn’t want to fight about it”, i would be *pissed beyond belief*. he knew all the effort put into the weekend, and couldn’t bother to stick around or hear her out? not the night of, not the morning after, he just *had to* get away asap because he was so offended? \n\ni’m all for not sticking around when you’re being mistreated, but she was trying to say she felt safe and knew he was a good guy, but once she saw he was upset by that she tried to explain and talk to him and he didn’t give her the chance, and then left and cut off communication. that is not being mistreated, it was completely out of line for him to leave. if i were her, i would definitely be reconsidering the relationship. the amount of disregard for all the effort and money put into this weekend and refusing to communicate about any of it, it’s showing that he was set out to be the wronged party. he had it set in his mind that his gf meant something terrible with her comment and did not want to be corrected or comforted whatsoever, he would rather make a huge deal about it. and you don’t leave your surprise birthday weekend and turn off your phone thinking no one will mind, you do it knowing that you are killing the vibe, ending the celebration, and drawing attention to someone unreachable. his “i wanna be the victim so badly” energy is gross, along with the disrespect of everyone else’s time and money\n\nYTA OP",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 30,
                      "content": "Right? When I met my husband, what attracted me to him was his great personality and the good things our mutual friend had to say about him. We met online, and when I finally saw a photo a couple of months later, he wasn't physically my type, but by that time I was already head over heels. He wasn't UNattractive to me, just not what I'd usually go for.\n\nOnce I met him in person, it was a total non-issue. We just clicked instantly, he proposed the next day, and eight years in I find him adorable and relentlessly sexy. Because when you really love someone, they become beautiful to you no matter what they look like.\n\nPhysical chemistry matters, and certainly someone *can* be too physically repulsive for you to overcome it, but that's clearly not the case here. And I don't know about you, but I'd rather be loved for who I am (which is forever) than what I look like (which isn't).\n\nYTA.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Exactly.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1288,
                  "content": "[removed]",
                  "id": 14,
                  "comments": [
                    {
                      "score": 789,
                      "content": "My ex was an abusive cheater and he looks like a thumb.",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 19,
                      "content": "Yeah the issue is his insecurity, not her finally finding a good man and knowing it.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "How dare you insult potatoes.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "Absolutely! I have a theory that potato-looking dudes cheat more often because they’re grateful that someone is paying them attention and seems to find them attractive, whereas better looking guys are better at staying loyal because they’re not as excited by someone being interested because it happens more often. (Especially if it’s a guy who grew up thinking he was unattractive as a kid/teen.) \n\nThat’s just the experience in my life anyways. I dated a dude who was 250lbs and balding at 23 and he was the worst of them all with cheating and being overall every kind of abusive. The more attractive guys have been better to me.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I actually think ugly guys cheat more than good-looking guys. It’s Little Dog Syndrome. They think they have something to prove.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "Yeah look at Prince Charles. Looks like a horse and still managed to cheat.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Yeah this. One of the most abusive person in my life also was ugly af",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Yup. In my experience, it’s people insecure about their looks who will never turn down a chance at sex, because they take it where they can get it.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "Like no offense to Jay-Z but look at Beyoncé... yeah looks mean shit when someone wants to cheat, but is undeniably common for the \"hotter\" partner have a sense of security cause liking or not pretty privilege is a very real thing. Good looking people have insecurities, but their life is nowhere near as affected negatively for their looks.",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "So many potatoes out there cheating. It's almost like cheating is a behavior and not based on looks. But no, for OP it must mean she finds him repulsive and therefore won't cheat. I'm sorry but I'm not paying for a vacation and a chartered boat for someone I secretly find repulsive.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 616,
                  "content": "the most unattractive guy i knew in high school cheated on his gf. looks dont always decide that. it is personality, like you say",
                  "id": 25,
                  "comments": [
                    {
                      "score": 322,
                      "content": "Loyality doesn't have anything to do with looks. My friend had girlfriends like hell of a lot more attractive than him, he cheated on every one of them. He had a relationship of 1,5 year he frequently went to the red lights district, he talked to another girl for 3 months and eventually left his gf for the other girl. And he was like 120 kg when he did this. That guy looked worse than a watermelon.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "JayZ cheated on Beyoncé. That's all I have to say",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 230,
                  "content": "yeah exactly, like my ex was less attractive than me and he still cheated… with a girl also less attractive than me. made me a bit sad, that",
                  "id": 28,
                  "comments": [
                    {
                      "score": 38,
                      "content": "I'm so sorry you went through that, it's awful. My ex cheated on me too, but I found out about it after we broke up so it really didn't do anything to me lol. But because of reddit I'm scared I'll be cheated on in the future.💀",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "People don’t cheat with better, they cheat with easy",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Yes!! I have a friend who is literally a model who got cheated on multiple times by unattractive men with unattractive ladies. Looks have nothing to do with it",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I had an ex like that.\n\nCheated on me with a girl who basically looked like a turtle.\n\nPS.  She completely lost interest in him the second I was out of the picture.  The SECOND.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "My thought is that she never would have planned this awesome weekend if she didn't love the guy. She put a weekend together with all of his favorite things. Whatever she thought of him when they met (which was in no way negative), doesn't matter now anyway.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 15,
                      "content": "True af, she planned it perfectly: all his friends he loves, the activities he enjoys, probably spend so much money on the boat trip, etc and she still is the asshole, that's just sad for her. And he just leaves because she thought that he was kind and a safe person to date.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I bet that exact insecurity that he has is why he immediately took it the worst way possible and reacted as strongly as he did. In his mind, all his fears were validated. He couldn't take it the nice way where she was attracted to the sweet, shy guy that made her feel safe and admired (i.e. without a wandering eye)...to him it only confirmed what he always thought anyway, that she was out of his league but it hurt him more that *she* would think that she was out of his league. Definitely, YTA, but I think acknowledging your feelings, apologizing for your reaction but also saying you just needed space to sort out your feelings (which is reasonable but should have been communicated that that's what you need cuz it's hard to talk reasonably about the problem while you're all up in your feelings still) and apologize that it killed the mood but that you did appreciate the effort she put into your birthday (which should show you she really cares about you). Looks aren't everything either, if you're upset that her main attraction to you is your personality rather than your looks, should she be equally upset if you were more attracted to her looks than her personality? She obviously likes *you* for who you are and if she found you physically *unattractive* she probably wouldn't be with you. You let your own insecurities blow this up in your head. But if it's that important to you then I suggest dating someone who's the same level of attractiveness you are to make you feel better...then you can tell *her* that you were attracted to her because she made you feel safe because she wasn't out of your league.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Personally I think the only reason things got quiet and awkward is because either her friends don't like OP, the abusive ex was mentioned or bc OP didn't respond well. Personally if I was told someone was attracted to me because they felt safe with me and knew I wouldn't cheat especially with a woman i would be thrilled, to me thats a huge compliment.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "That's what I thought. Now others are bringing up it's because he is supposedly less attractive than his gf. Well, he acknowledged that himself, what did he think, no one else had thought the same thing? Or was just hearing it said out aloud that upset him? I am reserving an opinion. He needs to talk to Kenzie and discuss what upset him.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "We're not talking facts or logic here, we're talking emotional reactions.\n\nIt's very common for someone who thinks their SO is out of their league to view their SO's statements through that lens.\n\n\"safe\" \"won't cheat or leave\" can definitely be interpreted as \"safe because he's not attractive enough to land someone hotter than me\" when viewed as OP projecting his own insecurities into his gf's words.\n\nEdit: For me her follow up that \"he seemed nice enough\" and especially wanting someone who gave safe vibes after an abusive relationship makes it clear that her intent WASN'T to belittle him or flaunt that she's way more attractive than him, but that logic struggled to reach OP when he'd already emotionally responded to the first part and was stuck in that mindset.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "This^ the fact that he took it that way was 100% insecurities surfacing. If I say your safe won't cheat and are nice that means I'm saying your a ketch dummy.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1228,
              "content": "Or…it could simply mean that based off knowing him he didn’t seem like a guy that would cheat. There are definitely guys who are “players” and chronically cheat and there are guys who are the settle-down time and are looking for a monogamous relationship. She easily could have just been saying that he seemed like type of guy. Clearly she cares for him as she planned this great vacation for him. When her actions demonstrate that she really cares for OP, I don’t understand why you immediately jump to the worst possible interpretation of her words when there is an easily explainable innocent interpretation.\n\nAlso, if he was that upset he could have used his words and actually talked with her about it to understand what she means instead of immediately running away.",
              "id": 40,
              "comments": [
                {
                  "score": 1033,
                  "content": ">Or…it could simply mean that based off knowing him he didn’t seem like a guy that would cheat\n\nOr more importantly I think, he didn't seem like a violent guy or somebody who would abuse her.\n\n&#x200B;\n\nShe probably expressed herself poorly I think and OOP was overly insecure about it.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 1317,
                      "content": ">My borderline blacked out GF was less than articulate when she was put on the spot so I threw a tantrum and then left entirely sober the next day.\n\n\n--OOP",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 802,
                      "content": "Bingo! There it is - he was, and still is, insecure about having her, doesn't think he deserves her and gosh, she was attracted to me because I was 'just' safe. Gosh what a loser? And to show you what a loser she thinks you are, she planned this great birthday weekend, cause you know, people often to go to great lengths to please someone that's just ahem, safe. You are so dumb OP,.who cares why she was initially attracted to you, she's obviously crazy about you now - unless of course you just blew it. And boo on Grace for not slapping some sense into you. YTA.\n\nEdit to add: Cool, an award! Also after reading OP's comments, he's doubling down on being the  injured party here. I hope Kenzie dumps him and she learns a lesson: safe does not equate with being a decent adult (as opposed to acting like a petulant child). Hopefully next time she finds someone safe AND decent. And she also may want to re-evaluate her friendship with Grace.",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "Agreed, and I don't think men understand that a guy who seems \"safe\" doesn't always have to mean \" being out of their league\". Some people just give off 'safe' vibes. And honestly, that's attractive. Someone that makes me feel relaxed and safe when I'm around them is something I'd take every day of the week over model looks. Jmo. But I do think she may have thought the first option at the time. Which, if she didn't know you, is at least an in for you. A bit narcissistic of one for sure. But this was a huge overreaction.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "It's extra sad bc she was probably trying to brag about how great he seemed from the start.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 198,
                  "content": "[deleted]",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Agreed on pretty much everything there, including using his words.\n\nBut I'd also point out that the question was what **originally** attracted her to her SO.  What originally attracted me to my partner was his hair, but then we started talking and I got to know him and very much like him -- it was mutual, and we wouldn't have started dating otherwise, let alone still be together.  Especially as he's since lost a fair amount of his hair.  ;)",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "He jumped to the worst possible interpretation, because he is insecure in the relationship. He thinks she is \"out of his league\" and doesn't know how he \"got\" her; aka why she chooses to be in a relationship with him.\n\nInsecurity can make us reactive by nature.\n\nPlus, due to his Insecurity in the relationship, he feels like she has all the power. Which is why he left the party, eventhough, he was the guest of honor. \n\nLeaving the party was a power move. Turning his phone off and refusing to speak to her was also a power move. Allowing her to explain herself to see if this relationship is salvageable......all power moves. These actions are all done to make him feel powerful in a relationship where he feels like he doesn't have any.\n\nThese actions were most definitely an over reaction to the situation at hand and very immature.\n\n\nOp, YTA. Not because you had feelings about what your girlfriend said. We all have feelings about things that are said and done to us that need to be unpacked and processed to understand why we felt a certain way.\n\nYTA, because you let those feelings take over and not only disrespected your girlfriend's energy, time, and money; you disrepected everyone who came to celebrate you. IMO - you need to apologize to everyone who showed up for you. \n\nYou also need to do some inner work to realize that you bring attributes to any relationship that are valuable. Safety being one of those attributes; you may not understand why someone being safe could be very attractive to a person that is not yourself. You should, however, understand that your girlfriend was just answering a question from a couples' game as honesty as she could; even if that answer was something you couldn't understand or felt good about. \n\nYour overreaction to your girlfriends honesty makes you a huge AH.",
                  "id": 48,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 912,
              "content": "I was thinking the same. But after 2 years of dating, I think she really loves him, not everyone would go their way to plan a surprise weekend, doing stuff that she knows he will love. \n\n\nOfc it hurts to hear that, but he should have at least tried talking to her in the morning. The thing is, she was probably used to date \"hot\" guys, but always being cheated on, so she tried to go for a nicer guy not as perfect as those hot / fuck guys. She did break her habit and maybe just has really fallen in love. \n\n\nI'm gonna go with YTA, I get that you were hurt but communication is key, and if she doesn't even remember what she said, she doesn't even know why you left and why you didn't even respond to her. You two need to talk if you still want your relationship to work.\n\n\nAnd for me, beauty isn't a look, some people are not really hot until you get to know them and they become hot bc of their personality ( Yeh okay might sound cheesy but that's just me ).",
              "id": 49,
              "comments": [
                {
                  "score": 694,
                  "content": "This is the right direction.  After two years she isn't worried about safe, she fell in love and he is ruining that. Orignal Op YTA. \nLooks didn't invite your friends to the lake and rent a boat, love did that.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 511,
                      "content": "I don't even understand how \"safe\" became a bad word! A huge part of why my boyfriend is my favorite person is because of how secure and calm he makes me feel. He is my safe place. I consider that a massive honor because the only other people I feel that safe with are my mom and my best friend.\n\nI'm also ridiculously attracted to him and frankly he's objectively hot but that's not the first thing I think of when I think about what I value about him because he's so much more than his looks. I do think she phrased this poorly, but I seriously don't understand why the idea of feeling safe with your partner has become so vilified.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 85,
                      "content": "Yep totally agree, they just need to talk about their feelings. I think OP just put his insecurities first, as he said he didn't know how he got her, and that's sad bc she genuinely seems to care.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 232,
                  "content": "You're on the money here.  She does love him, but what she said was a drunk mess that sounded like she only had any interest in him because he wouldn't abuse her.  Like that's a very very low bar to set for someone and he, rightfully, feels like he brought a lot more to the table than just that.\n\nHe overreacted, sure, but I doubt it's going to much more than a bump in the road for them.  She was drunk and chose her words poorly and he flipped out harder than he should have (like wait until she's sobered up and just say \"hey, is that what you think I bring to the table?\").\n\nIt's not too late yet to fix it by having some proper communication.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 381,
                      "content": "And the question was \"what FIRST attracted you\" not \"what attracts you now\" - which are different questions.",
                      "id": 54,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 176,
                      "content": "I agree that her wording was very bad, but having lived a similar situation with my ex, when you learn that someone has been lying to your face, was agressive and manipulative, I think it's a normal behavior to set a bar to find someone who would not do the same. It IS a low bar but imo understandable. And obviously you don't love someone just because they don't cheat or abuse you. \n\nBut yeh talking is key.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": ">sounded like she only had any interest in him because he wouldn't abuse her.\n\nNo, the question wasn’t “what’s the only reason you started dating your partner”… it was “what *initially* attracted you?” The very first thing that attracts you to someone is almost never the only reason you have any interest in them.\n\nIf OP had answered the same question with “she’s beautiful” would that mean he’s only with her for her looks? I hope not! But I bet it was the very first thing he noticed. \n\nThe first thing she noticed was that he seemed like a decent guy. How fucking terrible, right.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "I mean, let's address the fact that *not being abused* is not, in fact, a mythical low bar. Men are, and have been, one of, if not the top cause of non-accidental deaths of women since the dawn of time. 1 in 5 women have been raped or rape was attempted. \n\nThis is a huge issue for women and a top concern.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Very importantly, the question wasn't \"Why do you love your partner now?\" but \"What first attracted you?\" If you've had some bad experiences, a sense that someone is trustworthy can absolutely being attractive af. I can see how someone getting out of an abusive would want first and foremost a non-abusive partner... making meeting that low standard one of the first things that attracted you to them. \n\nOP, listen to this advice\\^ about having an actual conversation with her. And don't discount the fact that things like trustworthy and safe are things about your CHARACTER, not just how you look.  And just because she commented on your character doesn't mean she doesn't also - and didn't then - like the way you look. I think you're projecting your insecurities about your physical attractiveness onto a drunk comment that likely actually means something other than what believe it does. \n\nFWIW, once I got in a relationship after having some not-so-great experiences, and one of the first things that really got my attention about this person was the fact that they also sailed over a low bar. But meeting that low bar was important to me, and a lot of other people didn't meet that low bar. And when we were still at the stage of being very new to each other, the fact that they had a certain degree of emotional togetherness and consideration for others was one of only a few things I knew about them then. It was part of what made me want to know them more, to risk investing my time and energy to see where things might got. It was what made me appreciating so much more about them possible in the first place. 'Safeness' doesn't have to mean 'I can rely on them because they can't do better.' It can mean 'this guy seems like a good guy in areas where it really counts that I can feel excited about getting to know him more and pursuing a potential relationship despite the fact that dating has been a scary/painful/dangerous thing for me.'\n\nI mean, you're certainly not obligated to continue the relationship if you don't want to, but the fact that she knows you and cares enough to arrange for a weekend like that for you makes it seem to me like it could be worth communicating about first.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Also, I have noticed that some people who seem very attractive that once their true personality comes out, they just become less attractive and sometimes just flat out ugly. It's like my brain kinda morphs their personality and looks where I cannot figure out why I ever thought they were attractive to begin with. Is it just me?",
                  "id": 59,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Nope not just  you. For me too, shitty people get increasingly utterly unappealing as they reveal their shittiness. Neat people get more and more beautiful.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "100% YES. For me it's just the same thing happening, looks don't stay, personality does. People may be hot af from their looks but if they start being shitty people, my mind goes from 100 to 0. I think it's just being attracted to good people in general. I mean nobody wants to live with a partner at 80 that is shitty and is not even pretty anymore ( meaning we are all going to get ugly one day, might as well spend time with people you actually enjoy and love ).",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "> she was probably used to date \"hot\" guys, but always being cheated on, so she tried to go for a nicer guy not as perfect as those hot / fuck guys.\n\nThere's no reason to even say that this is about looks. OP is insecure so he *assumes* he was \"safe\" because of his looks.\n\nWhat's being overlooked is that they met through a mutual friend. That means someone who knows OP vouched for him - and *that* is a very good reason for her to have said she thought he was a good guy and a safe person to date.\n\nOP never even bothered to give her a chance to explain why she thought he was safe. He just assumed the worst and treated her like shit.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 394,
              "content": "You, and OP, are assuming based on your own insecurities. She didn't say this, and it wasn't implied.",
              "id": 63,
              "comments": [
                {
                  "score": 341,
                  "content": "Yup. And/or they are wildly projecting their *own* belief that safe=ugly.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 134,
                      "content": "Lmao right? I've dated some really ugly men because I thought they were v nice and they were interested in me, so I should give them a chance. And I got treated very poorly. Road to emotional/verbal abuse at the very least.\n\nMy current (and last if i have any say!) bf is actually v good looking. Verified by just about everyone who's interested in men. This is the first man to stay with me and treat me well, even during the worst period of my life just this past Christmas. He has helped me heal, and he just genuinely is such a wonderful person, I start getting teary eyed when I think about it too much.\n\nAll of this to say - the first reason I was attracted to him was because he came across as \"safe.\" We were friends before dating. He showed me he was kind. That was the most important thing for me. It certainly does not mean I ever thought he was ugly.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Ugly people defo cheat. She probably thought he was a safe option because one of her close friends was his best friend and would obviously vouch that he’s a decent guy. OP just seems insecure",
                      "id": 66,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 324,
              "content": "Rofl if you think ugly people don't cheat, you would be wrong.  The audacity to think only 10s have affairs or cheat 🤦‍♀️🤦‍♀️🤦‍♀️\n\nHe made this scenario about looks not her. She said safety and security. He won't cheat or abandon her.. ALL AMAZING QUALITIES! Holy crap the arrogance of people.",
              "id": 67,
              "comments": [
                {
                  "score": 18,
                  "content": "I just can't get over the irony of her saying \"he won't abandon me\", which prompted him to immediately abandon her. And he's still here asking if he's TA!  \n\n\nDude, she said you were stable and trustworthy. Those are GOOD qualities! But since your ears don't work and you heard \"ugly\" instead, you decided to punish your GF for something that's completely on you. Of course YTA!",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 290,
              "content": ">How did she \"know\"?\n\nPossibly because she got to know him, felt good about his character and had a mutual friend that could vouch for him as a good man that she could trust with her heart?  Too bad it didn't go better for her with that....",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 275,
              "content": "Or because her friend who had known him since they were kids told her that he was a wonderful, honest guy.",
              "id": 70,
              "comments": [
                {
                  "score": 124,
                  "content": "Right, she literally had more background info on him than most do going into a new relationship.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Yeah, but if I acknowledge that then I can’t project my own insecurities and give shitty advice because I’m an incel.",
                      "id": 72,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 103,
                  "content": "And said friend probably told her the Op was really into her. So she knew he was interested and wouldn’t play games. There was no “does he like me/hard to get” and she didn’t question if he was interested.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 222,
              "content": "> How did she \"know\"?\n\n> Because she was attractive compared to him.\n\nIronically, I’ve heard a hell of a lot of stories where someone who has a complex about being less attractive than their partner ends up cheating to feel validated.\n\nThinking that dating someone who feels less attractive than you is the best way to end up with a faithful partner seems like a dangerous road…",
              "id": 74,
              "comments": [
                {
                  "score": 24,
                  "content": "As someone who hooked up with a lot of hot single guys and had a lot of other hot female friends that hooked up with hot single guys, and generally got hit on by a lot of guys:\n\n9/10 it was not the hot taken guys trying to cheat. They were not sliding into DMs or taking up the girls hitting on them in bars. If they wanted to sleep around they easily could, so when they got into relationships it was because they genuinely liked the person they were dating. Sure there was the occasional egotistical hot asshole that was down to cheat, but those were more of an exception.\n\nThe the ones that got hit on because it was last call and after 6 tequila shots they looked ok enough? Those were the guys that jumped on the chance and then pulled the “oops, did I forget to mention I have a girlfriend?” Move pretty much without fail. Because they never actually stopped to consider if they cared about the person they were dating, they just saw a girlfriend as the most convenient way to have consistent access to sex, and were happy to jump at the chance for outside validation or sex the moment it was offered. \n\nThe chance to sleep with someone will always come along, in some way, shape, or form. Someone who is only faithful because they’ve so far lacked the opportunity is far more likely to end up cheating than someone who always had the opportunity and willingly set it aside.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Oof I meet an unfortunate amount of men who literally just want a relationship for regular access to sex and because they kinda like that person. My bar is so high compared to that and I wouldn't want to be in a relationship with that kind of person lol",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 199,
              "content": "No way man. My ex was ugly AF and he cheated on me. He had that douchey-jackass confidence. My husband is way hotter and I knew he was a ‘safe bet’ because he made me *feel safe*! He’s humble and honest and caring and when he says something he means it. It has nothing to do with looks.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 173,
              "content": "It was 2 years ago and even if that's EXACTLY what she thought at the time clearly she has grown to care for OP in other ways since then... as exibited by her planning what sounds like a fucking amazing birthday weekend. \n\nAnd nothing excuses running away from a 2 year relationship. \n\nOP isn't really acting like an AH, they're acting like an immature child. Adults use their words to communicate with each other. \n\nWhat she said hurt OP. They are allowed and justified in being hurt by that. You can't control how you feel but you can control how you react to those feelings. The correct, adult response is to explain to your gf why what she said hurt you and to have a conversation and grow as a couple.",
              "id": 78,
              "comments": [
                {
                  "score": 22,
                  "content": "And also give *her* a chance to explain rather than running away.\n\nYTA op - if you don't learn to communicate with your partner, you're going to have quite a tumultuous life romance-wise. Communication is the cornerstone of any successful relationship. When I first met my partner, I loved that he felt \"safe\" and made me feel protected. We've been together for nearly 11 years and I love him to pieces. Safe doesn't mean you're unattractive!!",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 964,
          "content": "This. I met my now-husband after a terrible roller coaster ride of a relationship, and honestly “safe” was the sexiest thing to me. It wasn’t because he was less attractive (at all); it was because he was a really good human who I knew I could trust and depend upon and that was the hottest thing ever. Early in that relationship I frequently described him as “safe” and I meant it in the best way possible — he had all the qualities that other guys I’d dated had PLUS the platinum quality of being a good guy that knew how to make a woman feel secure and safe. That platinum quality was always the first thing I mentioned. We’ve been married 25 years now.",
          "id": 80,
          "comments": [
            {
              "score": 687,
              "content": "I was thinking something like this. \n\nI would have thought \"safe\" is one of the highest compliments a woman can pay a man in this day and age, especially since so many women are now finding their partners don't make them feel safe anymore in light of everything about Roe v Wade. \n\nAnd she felt safe with him from day 1. She didn't need to \"get to know him\", or educate him on some of the shit women go through, she decided to be with him because he immediately made her feel safe, *after an experience where, by all rights, she would be forgiven for not trusting* ***anyone.*** \n\nNot to pull the 'toxic masculinity' card, but being insecure about being judged as someone who's safe to be around feels a lot like toxic masculinity. \n\nWhat would OP rather she said? She was only attracted to him for his looks? That he was 'mysterious' and 'dangerous'? That's fantasy 50 shades of grey bullshit. Most real people don't want dangerous, they want a good, decent partner who'll have their back and genuinely respect them.",
              "id": 81,
              "comments": [
                {
                  "score": 341,
                  "content": "Everything you just said. Yes. “Safety” is a massive acknowledgment of something that too often feels scarce. And there’s absolutely a disturbing strain of toxic masculinity in the comments here that insist that “safe” = “weak” and that “won’t cheat” = “too ugly to cheat” / “not alpha enough to cheat.” No, fellas — “won’t cheat” usually means “strong, emotionally mature human who knows how to commit,” which is hot af.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 162,
                      "content": "Spot on. I'm horrified by people's comments in here right now. Burn the patriarchy, y'all. That shit needs to go on the bonfire, STAT.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Yeah. I shouldn’t be surprised, but I was definitely surprised to see that anyone thought otherwise. As a guy who dates women, “I feel safe with you” is about the biggest compliment I can get.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Yeah, honestly as someone who’s had some bad experiences with dating it’s like, warning flags (for me, because of past trauma) are sexually aggressive dates, guys who tell you everything you want to hear but don’t act the same way, guys who want to jump into sex really fast and guys who don’t enjoy spending time with me outside of potentially hookups. So when I met my partner as a friend first it was nice because he’s a bit softer, sweet and quiet and he likes cuddling, holding hands and spending time together just playing a game or watching movies. He definitely feels safe. And that doesn’t mean like, “he’s a safe bet” or a judgement on his appearance. It’s more about how he’s respectful and sweet. He was present and supportive when I was struggling the most and he never took advantage. He checks in on how I’m feeling and if I’m feeling kind of numb or if I’m quiet he asks if I’m okay. Consent matters a lot to him, and not just in a “checkboxes” kinda way. *He’s safe.*\n\n\nNot only that, but I would literally not date him (or anyone) if I don’t deem him safe. It’s the most important feeling for me. So idk, my first thought is that it’s a great compliment and totally normal to have it as a description. Lots of women value this feeling over appearance or any other dating parameters because it’s way sexier to have someone who is safe and supportive and considerate. It adds a lot to their attractiveness.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Thissss and isn’t it weird his friend Grace got upset too? Like girl what??? If she introduced them she would UNDERSTAND what Kenzie meant right? Why is she all mad out of the sudden?",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 187,
              "content": "Same with my fiancee!  I had a lot of high drama relationships and the sexiest thing about her is that she's a very kind, reasonable, even tempered person who always does her best, is scrupulously fair and in the rare instances where she isn't, is very quick to do her best and make it right.\n\nShe also happens to be a gorgeous former pro ballerina with the body of a pro athlete.  If I had to pick her character or her looks, I'd pick the character. But it's pretty damn nice having both.",
              "id": 87,
              "comments": [
                {
                  "score": 95,
                  "content": "Yep. Objectively speaking my husband is better looking than any of my exes, but his looks have never ever been the most top of mind quality for me when people ask what first drew me or what I fell in love with. It’s how he made me feel — safe, secure, at ease. To your point — his character. When I was young I probably said the exact words that OP’s girlfriend did, many times; I’m apparently lucky (judging from some of the comments here) that my now-husband was secure enough to understand that those were GOOD words.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 166,
              "content": "My husband was \"safe\" and it's why I pursued him. Safe is an incredibly sexy quality. Safe meant I can give this man my heart, and trust that he will value and protect it. Knowing someone won't cheat on you or hurt you is a powerful thing, and it comes from feeling safe. \n\nI would much rather be with someone that values my character over my looks, because only one of those two creates the foundation needed for a healthy longterm relationship. I've been with my husband just shy of 10 years now. We have had to face some serious challenges from outside the relationship. People have said that the way we have always supported each other, no matter how ugly things around us got, is amazing. It makes me grateful I found someone \"safe.\" \n\nOP has no idea how wonderfully sexy \"safe\" can be. Only a woman that truly loves and values him would know him well enough to create such a perfect weekend for him. He couldn't even bother to communicate with her.",
              "id": 89,
              "comments": [
                {
                  "score": 20,
                  "content": "“Safe meant I can give this man my heart”<—— yesssssss this exactly",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Also! “Only one of those two creates the foundation needed for a healthy long term relationship” — exactly this too! Long term relationships are build on character, trust, that sense of safety. They’re the rock-solid foundation that you build upon.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 102,
              "content": "When I met my husband, I had just gotten out of a long term relationship with someone who was immature and irresponsible and selfish.  When my now husband asked me out, I really wasn't interested but figured what the heck.  I really wasn't all that physically attracted to him...at first.  But what did attract me was that he was mature and responsible and funny and smart and I enjoyed being with him.  And within about 3 months, I knew I would marry him and I had never felt that way about anyone else before.",
              "id": 92,
              "comments": [
                {
                  "score": 9,
                  "content": "Me too. I knew that I wanted to marry mine a few months in for exactly that reason. It was the thing that I’d never experienced before and knew that I wanted to have for always.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "Saaaaaaame. I got out of a TERRIBLE relationship and started.... idk how to describe it, kind of flirting/courting my now wife a few months later. Like we knew each other beforehand through friends, but we started talking on Twitter and she asked if she could flirt with me (which was freaking adorable), and my first thought was, \"Okay, this is safe, we're being casual\", and then it started turning into Real Feelings and I freaked out a little but she'd proven that she was a safe person to be with. I *needed* that reassurance after my last relationship. But I didn't date and marry her *just* because she was safe. She's also funny, cute, witty, kind, sort of ridiculous sometimes, loving....",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 910,
          "content": "Right!  Guys constantly complain women only go for assholes and never give the nice guys a chance. But when we actually go for a guy because he seems like a good dude, we get hate for choosing them because they are decent?  What kind of fucked up logic is this?\n\nI see NOTHING wrong with what she said. OP was such a whiny asshole, and couldn’t even just go for a private walk with his gf to have a conversation?  \n\nGF absolutely deserves better!  I hope she finds it.",
          "id": 95,
          "comments": [
            {
              "score": 227,
              "content": ">Right!  Guys constantly complain women only go for assholes and never give the nice guys a chance. But when we actually go for a guy because he seems like a good dude, we get hate for choosing them because they are decent?  What kind of fucked up logic is this?\n\nMagnificently said.  Enjoy your award.  You deserve to be the top comment, not me.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 113,
              "content": "It also reveals how these kind of guys think about relationships because if it were the other way around they would TOTALLY cheat. They can't imagine she likes (liked) him because he just seems safer because if it were *them* they would be using him because \"he's too ugly too be capable of cheating\".",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 561,
          "content": "If this is how OP handles conflict - by not bothering to have a sober conversation before bailing - then Kenzie is better off without him.  There are plenty of nice guys who won't cheat who are also not drama queens.\n\nYTA",
          "id": 98,
          "comments": [
            {
              "score": 217,
              "content": "\"I didn't want to deal with any drama, so i dumped it all in my girlfriend's lap.\"",
              "id": 99,
              "comments": [
                {
                  "score": 14,
                  "content": "\"My insecurities should be her problem, not mine.\"",
                  "id": 100,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 342,
          "content": "It's so amazing.\n\nIncels and nice guysTM go on and on about how women don't want to date nice guys and prefer (handsome) jerks \\[not saying OP is any of those things, just that it's a prevalent sexist stereotype\\].\n\nYet apparently being told you were attractive because you looked nice and trustworthy is an insult worthy of making the atmosphere awkward and leaving your own birthday weekend.\n\nBoggles the mind, really.",
          "id": 101,
          "comments": [
            {
              "score": 28,
              "content": "Many of these NiceGuysTM don't **actually** want women to like nice guys. They *want* to be hot, not be liked despite being unattractive. To them, it's the only standard that matters.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 321,
          "content": "THIS! OP, you overreacted big time. She said nothing wrong. Your own insecurities will ruin this relationship for you. YTA",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 280,
          "content": "Well, if he wanted to show he was a big man who could leave and hurt her, mission accomplished.",
          "id": 104,
          "comments": [
            {
              "score": 281,
              "content": "It's pretty special.  She says what attracted her to him and OP is like \"Oooo!! Let me undo that!!!\"  \n\nI foresee a future where OP gets dumped, compares every future GF to Kenzie where he is disappointed that they aren't as good as her and goes on for years being salty stalking her social media as she goes off to date, marry and have children with another man.  While he's still telling himself that he showed her.",
              "id": 105,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 213,
          "content": "Op apparently thinks that a person could still be running away from their ex after a 2-year relationship. If you're still in a relationship with someone after 2 years I'm going to be honest there's a slight possibility that they actually like you dummy. She might not like you anymore but that's your own damn fault. The biggest issue here is you failed to communicate after the fact. You had your feelings hurt that's understandable but then you run away and act like a child having a tantrum? F*** that noise.\n\nYTA",
          "id": 106,
          "comments": [
            {
              "score": 21,
              "content": "Also the fact that OP's girlfriend organised and paid for an amazing weekend house party should have a been a pretty big clue to OP that she was genuinely  into him.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "> If you're still in a relationship with someone after 2 years I'm going to be honest there's a slight possibility that they actually like you dummy. She might not like you anymore but that's your own damn fault. \n\n100%!!!",
              "id": 108,
              "comments": [
                {
                  "score": 18,
                  "content": "If I was Kenzie’s friend, I would have spent the time she was alone encouraging her to very seriously think about whether or not it was a good idea to continue with this.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 147,
          "content": "Thank you. I get being a little hurt or surprised or taken aback but look at the weekend she put together FOR HIM. It’s not the insult he thinks it is. The answer is just a little surprising but worth discussing.",
          "id": 110,
          "comments": [
            {
              "score": 9,
              "content": "Yeah I think she just happen to kick him in the insecurity and it always hits a little hard when that happens where the person meant it to or not.  Which, you have to learn to recognize and adjust for until you learn to overcome that particular thing.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 137,
          "content": "Hi-jacking the top comment because people need to know that stupid games like these can end in tears, especially when you pour booze on everyone.   Stupid game, stupid question and gf said something insensitive but not horrible while OP admits she was tanked.  OP, get it together YTA",
          "id": 112,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9891,
      "content": "Feels like you massively over reacted. That may be the truth for the beginning but NO one stays for that reason for two years and certainly wouldn’t splash all that cash and spend all that time and effort organising such a lovely weekend for you unless the emotions were true and deep. You are not the rebound after an abusive relationship; the rebound would have lasted a couple of weeks. That’s not to say it was hurtful, but if you care about her work to put it right",
      "id": 113,
      "comments": [
        {
          "score": 2922,
          "content": "Yup. You overreacted OP. YTA and possibly into the drama based on how you handled it all.",
          "id": 114,
          "comments": [
            {
              "score": 1284,
              "content": "> possibly into the drama based on how you handled it all.\n\nSomething tells me that OP felt some kind of way (insecure maybe?) about how much effort she put in. If you think your partner is out of your league physically, and then they show how amazing they are in terms of being thoughtful, etc.... I can see how someone insecure would decide to nuke things to feel less bad.",
              "id": 115,
              "comments": [
                {
                  "score": 312,
                  "content": "As insecure as OP seems, I can see how he interprets her words as a insult, some thing like he is not good enough, attractive enough to even think of trying to betray her, who he miraculosly ends up with.",
                  "id": 116,
                  "comments": [
                    {
                      "score": 415,
                      "content": "I honestly can't really even see how being seen as safe is an insult. I'd be flattered and honored if a prospective partner who had recently been abused found me to be safe, trusting, and caring enough for them to open their heart to me :P Maybe her drunk tone was really awful though which would change the meaning",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1055,
          "content": "I’m also failing to see how he took literally any of this offensively?? He like entirely projected his own self reflection onto what she said. She literally said only nice things about him 1) he’s not a cheater 2) he’s not abusive 3) he’s nice. Where on earth was the insulting part??? That’s like 1-3 of the ideal man???",
          "id": 118,
          "comments": [
            {
              "score": 466,
              "content": "If that’s an honest question, I can see how it’s possible to interpret it as “I’m the person in the couple who’s the catch, OP is lucky to have me and can’t do better while I can. Therefore they won’t leave me for someone better, because they literally can’t”. \n\nIt’s not a healthy interpretation or really how relationships work but it’s also a trope and exists in media.",
              "id": 119,
              "comments": [
                {
                  "score": 414,
                  "content": "Yeah that's where the projection comes into play. HE thinks that, because he values looks over personal characteristics. She thinks he's a catch, because up until now he has been safe and nice and reliable. But he just showed her he is a shallow and insecure AH",
                  "id": 120,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Not for OP specifically, but I’ve seen relationships and had friendships where the other person is just a extraverted, charismatic, funny af person and I think this could also apply to relationships with those people. But I suspect that dynamic is the minority and not really relevant to the OP’s case.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "I mean, I've definitely known relationships (and been in ones) where one partner thinks that. It's definitely not healthy, but it *does* exist.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Also, what's wrong with being nice and safe?\n\nShe knew he was a good person and had the integrity to stay that way, she basically admitted he became a rock to her during a difficult and fragile time.\n\nHe did great cause he's, at least prior to this, a good man and he took that as an insult.\n\nWould it have been better if she said he was reckless? Mysterious? Just handsome?",
          "id": 123,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8350,
      "content": "YTA. You'd seriously bail on a birthday weekend in front of all your mutual friends because 2 years earlier she felt you were a \"safe\" option? It seemed to work out. She went all out for you for your birthday. If you bailed over something so seemingly ridiculous, what will you do when you face actual tough times together? You won't discuss it, you'll just run away?",
      "id": 124,
      "comments": [
        {
          "score": 4554,
          "content": "Seriously wondering what his end goal is.\n\nLike congrats OP, now you’re ugly (if his own self assessment is to be believed) and unstable.\n\nGood luck finding hot women that put a lot of time, money, and thought into you now.",
          "id": 125,
          "comments": [
            {
              "score": 1086,
              "content": "I legit laughed out loud at this comment. And in public too!!! Omg I look nuts. Take my poor woman’s gold 🥇🥇🥇🥇\n\nOh and OP: YTA.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 958,
              "content": "I’m really curious what he thought she’d say. “Oh, he has a rockin’ bod and I wanted to hit that” ??? His insecurity is playing too large a role here.",
              "id": 127,
              "comments": [
                {
                  "score": 310,
                  "content": "“He seemed so kind and like he’s a really great person!” \nKinda gives the same message but without the hurt. I def agree he WAY overreacted and it could have easily been fixed if she simply apologized then and he listened to her side. \n\nI’d probably be hurt too if I was described as “safe and unlikely to cheat” rather than “a kindhearted person who is genuinely good”. These kinds of questions while lacking inhibitions can definitely be a recipe for misunderstandings and disaster 🤦‍♀️",
                  "id": 128,
                  "comments": [
                    {
                      "score": 569,
                      "content": "He didn't explain anything to her, he bailed before she was sober and awake. How can she listen when he runs away because he's insecure about his looks?",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "Some of us think safe and not like to cheat the exact type of person we were looking for. Like what are we supposed to say if that's our top concern in a partner especially if you've been unsafe and cheated on before. Sometimes it means you are the perfect man.\n\nSo, seriously, do we have to lie about this now like how we lie about the best sex ever, baby, only with you?\n\nChrist, you guys just can't take a win.\n\nOP: YTA and probably just showed your GF how wrong she was thinking you wouldn't hurt her.",
                      "id": 130,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "How logical are you when you're drunk? :P",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "She was trashed and he gave her zero chance to explain when sober. Pretty childish of him to just dip.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Drunk people aren't the best at explaining things either. He could have waited until she was sober and told her his feelings were hurt and give her a chance to clarify.",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 125,
                  "content": "I told my husband that at first I thought he was cute enough for a weekend 😅",
                  "id": 134,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Yeah, exactly. I think the key part he missed was \"what FIRST attracted you?\" No one stays for 2 years for \"safer option.\" You heal, then you go back to the assholes if that's all it is. Poor Kenzie.",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": ">“Oh, he has a rockin’ bod and I wanted to hit that” ???\n\nYeah, apparently. \"Would fuck\" is not really a compliment, either. And \"So attractive\" is shallow. \n\nI don't think the GF could have said anything that would have pleased OP. Because his insecurities are running the show, and they can not be satisfied with anything.",
                  "id": 136,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "I'm pretty sure his end goal is a depressive spiral of self-destruction.",
              "id": 137,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "OP is so deeply insecure that he feels undeserving of his hot, thoughtful gf. So he blows up the relationship instead of going to therapy.",
              "id": 138,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "YTA. \n\nHe was a genuine nice guy right up to the point he threw a tantrum and humiliated a woman he thinks is out of his league for saying he was a nice \"safe\" guy, which translates into \"someone I'd spend my life with\". Come on dude, you f\\*\\*\\*ed yourself.  \n\n\nI get the impression now he is going to forever blame her for this.",
              "id": 139,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 552,
          "content": "And he bailed scatter grace said he doesn’t have to take that… I would be eying Grace if I was the GF. She seems a little messy",
          "id": 140,
          "comments": [
            {
              "score": 295,
              "content": "I'm not sure that Grace necessarily did anything wrong, depending on how OP recounted the story and the fact that her friend was really upset, she might have just been trying to be supportive and protect his feelings. she might be messy but I'd probably go into support mode if my friend called me upset too",
              "id": 141,
              "comments": [
                {
                  "score": 387,
                  "content": "If one of my guy friends called me and told me this tale, and I knew the girl and had even set them up, I would obviously support him but would absolutely try to talk him off a ledge and try to think about this rationally. She didn’t even make an attempt to talk through the plethora of other possibilities of what she might’ve meant, and as a woman with experience and knowing other women with experiences like this, plenty could’ve been said other than feeding into his likely misinterpretation of this. I find it super sketchy that Grace did zero to try to talk him down off the ledge here. A good friend doesn’t just blindly feed into your upset, a good friend gives you other perspectives and tries to help you see all sides of a thing.",
                  "id": 142,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Also, as if Grace didn't already know this! She set them up and knew Kenzie before OP, there's no way on earth they didn't chat about how thing's were going early on.\n\nHas Kenzie and Grace never gone out for drinks and chatted about their mutual friend that one is Dating? After an abusive relationship?!\n\n\nOP either really poorly explained it or Grace is a parasite and enabler",
                      "id": 143,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 21,
                      "content": "We also don't know how often OP overreacts or how long Grace has been putting up with it. I know I've gotten burnt out on friends who constantly are leaning on you for support because of their fuck ups.",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 150,
          "content": "His self depreciating suggests he likes to feel sorry for himself or to get attention. I’ve met both types in my life and ones you they’re both tiring. And she will tire of it too. He needs to figure out his issue and probably should seek help for his low self esteem and need for drama.",
          "id": 145,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "She was also drunk, and being honest. And here she went to all these lengths to plan such a special weekend for him. And instead of talking it out like fucking adults once the alcohol’s worn off, he just bails. And then continues to shut down conversation and avoid her when she gets home. What’s your problem, OP? So she was attracted to you because she felt safe with you after leaving an abusive relationship. That’s a GOOD thing. Way to prove her wrong. Life is full of difficult moments. When you love each other, you stick around and work through them. You threw away what could have been a really amazing weekend together with friends. And for what? Get over yourself. Communicate and resolve conflict like a mature adult.",
          "id": 146,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Agreed. He should have waited till the morning and spoke to her about it. Let her explain what she ment while sober. Cause hell seems like she likes you man, not alot of women would go to that much effort and money to rent a boat and a cabin for someone they were just with for convenience.\n\nTalk first and then if things go south you can leave. Ruined a whole trip over a dumb drunk comment.",
          "id": 147,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "He also didn't just bail in a \"mature\" way to get his head together, he basically made a point with his actions and lack of actions (willingness to talk or communicate when asked) to throw a public tantrum for days.",
          "id": 148,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "This is the vibe I get. I don’t think OP really knows what she was saying. It goes far beyond looks.",
          "id": 149,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5319,
      "content": "YTA\n\nWhat is wrong with being safe? Safe is the person you trust, the one you expect to be there when you really need them, the one that makes you relax, want to stay, make plans with and find ways to grow close to. Considering her history, that is most likely a very precious thing to her.\n\nSadly, you overreacted, and now this girl who felt safe with you has learned that no, she can't trust you to be there for her when the going gets uncomfortable after all.",
      "id": 150,
      "comments": [
        {
          "score": 2131,
          "content": "Hilarious too that he did it to 'not start any drama'.\n\nLmao why do the people that proactively say they try to avoid drama are the ones always starting it?\n\nCongrats cuz now you've got drama!",
          "id": 151,
          "comments": [
            {
              "score": 463,
              "content": "@ anyone who doesn't get it: you don't forgot in front of others. You ask your partner if you can go on a walk to talk because you were hurt by what the said last night.",
              "id": 152,
              "comments": [
                {
                  "score": 785,
                  "content": "He was entitled to his feelings and to need some space (to not discuss it right then and there) but waiting till the next morning, sneaking out and blowing up the whole weekend was a crazy overreaction. \n\nBut I forgot...he did it to avoid drama...*rolls eyes*",
                  "id": 153,
                  "comments": [
                    {
                      "score": 688,
                      "content": "It wasn’t even like it was just her, or just her and *her* friends there, *his own friends* were also there, and woke up to him just splitting without a word, then shutting off his phone the whole next day to “golf”. This was the most dramatic “I don’t want drama” move I’ve ever heard of, and I’d lose respect for one of my friends if they bailed in the middle of the night without a word in a trip I went on for *their* birthday, and they couldn’t be bothered to reply to me at all the whole next day. He didn’t just “punish” his girlfriend, he punished all of his own friends that were there too, and I guarantee this changes how every single person there views him. This was *not* a thing to just abandon this whole trip over, without a conversation with anyone except “Grace” who wasn’t even *there* who for some reason blindly supported this childish reaction.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Exactly. I meant like, next day. And it's also okay to pull your partner aside and say that you need to process a bit and need a little space. Tell your friends you're going to go read by the water, etc.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "That's not what he did though. When she tried to discuss it in front of the group (poor choice from her, because yeah, it should be done privately) he *should've* done what you said here - ask her to step outside or sit in the car to discuss it like adults.\n\nInstead he was like \"Don't wanna talk about it\", snuck off, and continued to \"not want to talk\" until she showed up at his apartment.",
                  "id": 156,
                  "comments": [
                    {
                      "score": 21,
                      "content": "I think she attempted to right herself immediately and because she was drunk, didn't think about the fact that everyone else was there. She wanted to panic apologize and try to make herself understood, but you know, drunken style.",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 216,
              "content": "I firmly believe that people who proactively or spontaneously insist that they don't like or want drama 99% of the time responsible for either instigating or amplifying any drama within a 10 mile radius.\n\nThat has been my experience every time.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "“I don’t do drama”…says the guy who sneaks out in the morning from the party that was solely for him, leaving friends and his partner that spent a bunch of money and time with the bag. Everyone feels embarrassed and now angry because he bailed on something they clearly have been planning forever, all because of his hurt feelings over a pretty harmless drunk comment. Sure OP, being an ungrateful ass and secretly bailing on people that were showing you love was clearly the least dramatic option…\n\nIt cracks me up that he thinks he gets to decide if they are breaking up, if I were his gf I would drop him like a sack of potatoes, and send him a bill for the weekend.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 431,
          "content": "Girlfriend in a moment of drunken vulnerability: \"From the beginning, I liked that I can feel safe and comfortable being vulnerable around you.\"\n\nOP: /Instantly proves her wrong, poisons that well forever and walks away.",
          "id": 160,
          "comments": [
            {
              "score": 7,
              "content": "She also added \"he'd never leave\". I read that as a pretty demeaning comment.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 38,
          "content": "As someone who also had an abusive ex, if I met someone who felt \"safe\" that would be truly the best compliment I could give. Being hurt by someone so intinately close to you fucks you up in so many ways and makes everything around feel unsafe.\n\nMeeting someone that can make you feel calm again and no longer like everything is a moment away from shattering is invaluable...\n\nBut as you said he has now absolutely fucked all that up.",
          "id": 162,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "[deleted]",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Yea if I had drunkenly admitted something embarrassing (like I had a bad, abusive relationship and thought a new potential partner was safe) and he’d shut down and left I don’t know how open I’d be in the future. \n\nBut on the other hand, we didn’t hear how OP’s girlfriend said it and I could see “he seemed safe” coming off as negative\n\nEither way this just solidifies my stance that couples drinking games are a terrible idea.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "I think it was the way she talked about being safe. That he wouldn't \"cheat or leave.\" That doesn't really sound about being trustworthy kind of safe. More like he would never be able to \"do better\" and so would never cheat or leave her.\nWhether or not that's what she meant, that's what I got from it and I bet OP got something pretty similar out of it too.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Right??\n\nI was playing some sort of couples card game with my bf and there was a question \"What would you miss the most if you were to break up?\".\nI said \"Safety. I feel safe with you.\"\n\nI was brought up in a home where alcohol and violence was the norm. Hiding silently in your room as not to get in the way. I thought it was normal. I found out in primary school that other people didn't grow up like this.\n\nThe disfunctionality followed me into relationships where I was mentally and emotionally abused, I was extremely unstable, depressed, very unhealthy. \n\nFinally, I met him. I feel safe. I know he won't hurt my feelings on purpose and won't ever hit me.\nAnd I'm no longer depressed.\n\nSafety is awesome.",
          "id": 166,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Good point. If I were the girlfriend, I’d be seriously rethinking this relationship right now.",
          "id": 167,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3013,
      "content": "NAH. \"What originally attracted you to your SO”. Kenzie blurted out “he was safe. And I knew he wouldn’t cheat or leave me.” You already feel like you were lucky to get her, and she confirmed your worst fears on your birthday. I get why you left, but you need to talk to her now you've cooled down. It's been two years, she may have started with you as a \"safe\" option after her volatile ex, but feelings grow. Talk with her, or this will end the relationship.",
      "id": 168,
      "comments": [
        {
          "score": 1475,
          "content": "This. Most of the commenters are trying to make it out like she meant this as a compliment. Being told you are the \"safe\" choice isn't a compliment, it means that you should be grateful that they chose to be with you and you will spend the rest of your life being grateful and dare not stray. \n\nNAH, but I don't blame OP for leaving. Not only did she confirm his worst fears she did it in front of all of his friends and I'm sure he's mortified.",
          "id": 169,
          "comments": [
            {
              "score": 1555,
              "content": "That is not what it means to every person who would say it.  It can mean settling, but I’ve said it about my husband many times, that I was first attracted to him being safe. He made me feel safe, I wasn’t afraid to be vulnerable with him. I trusted him not to violate my boundaries. It’s not about being able to do better because in my mind feeling safe with someone was the best thing. He has lots of other wonderful qualities, but if he hadn’t made me feel safe, I wouldn’t have given him the chance to show me everything else. But to me safe is absolutely a compliment. It means he feels like “home.” A haven from the stormy outside world. Maybe if you haven’t experienced the terror of feeling unsafe with someone, you can’t imagine the wonder and appreciation you feel when someone makes you feel safe.",
              "id": 170,
              "comments": [
                {
                  "score": 768,
                  "content": "Thank you. As someone who went from an abusive ex to my current partner who is a safe option, was also what attracted me to him too. It had nothing to do with looks; I found him very attractive and still do three years later. But I could tell immediately he was a good person, seemed safe and the complete opposite of my ex. We hit it off immediately, love at first sight type of thing. I think OP is just seriously insecure and assuming the worst. Obviously this girl loves him 2 years later and planning this awesome birthday weekend for him. OP needs to be able to communicate with her better and not just run off and hide when things get tough.",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 152,
                  "content": "Thos I have aniexty if I feel safe with you that is a complement there are like ....  4 maby 5 people I'd describe that with.",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 94,
                  "content": "This, he should've definitely waited to cool down more or talk even the next morning. He's entitled to his own feelings of insecurity, but it's unfair to project it onto her especially if that's not at all what she meant.",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "\"He makes me feel safe\" is a totally different sentence than \"he was safe; I knew he wouldn't leave me or cheat\"\n\nOne strongly implies what you are talking about and wouldn't include specifically calling out that \"he wouldn't leave\" - particularly in reference to FIRST attraction.\n\nThe other strongly implies she saw something in him (I agree perhaps the looks are his baggage speaking, but something) that she thought meant he was not capable of doing anything that might hurt her, even the things (like ending a relationship respectfully) that aren't wrong in any way. \n\nIt was the first thing she thought of him and it's still the first thing she thinks of to answer the question - she wanted above all a man she thought would have no option but to stay with her once she chose him.",
                  "id": 174,
                  "comments": [
                    {
                      "score": 27,
                      "content": "> \"He makes me feel safe\" is a totally different sentence than \"he was safe; I knew he wouldn't leave me or cheat\"\n> \n> \n\n\n\nYeah there's a huge difference. People are reaching too hard to try and frame her comment as a compliment.",
                      "id": 175,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "I think that there’s a difference between someone making you FEEL safe (which is wonderful) and BEING safe (which can be interpreted the way this guy interpreted it)\n\n*edited to close the bracket",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "\"Safe\" as in \"a person is a reassuring presence\" is **impossible** to determine in a short period, let alone be \"the first thing to attract you\". That only develops over time and exposure.\n\n\"Safe\" as in \"I don't have to try hard\" paired with a \"I know he won't cheat on  me\" (also far too early to tell) 100% gives a \"I'm out of his league, hes lucky to have me and we both know it\" vibe.\n\nTell me how these could in anyways be \"what's the *first* thing to attract you?\"",
                  "id": 177,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "\"He's safe\" vs \"He makes me feel safe\" are two very different things.",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "i agree but there's a difference between 'you made me feel safe' and 'you were a safe choice' and i got the vibe of the latter, could be wrong though",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "There is a difference from 'I feel save with you' to 'you where a save option' - i love being told that my girlfriend feels save with me. I would be destroyed if she told me 'you where a save option'",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "But she literally DID. Stop saying it DIDNT MEAN X when she literally says X. It's really fucking weird.",
                  "id": 181,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 433,
              "content": "She said \"he's safe.\" OP and many commenters interpret that as \"he's a safe choice\" (insulting) while others, and very likely OP's girlfriend, hear it as \"he's a safe person to be around\" (complementary). A miscommunication that OP chose to handle in an immature and dramatic way. YTA.",
              "id": 182,
              "comments": [
                {
                  "score": 244,
                  "content": "She also told him he was “nice enough” and a “safer option.”  I think it’s reasonable to read that in the insulting way.  I don’t vouch for everything OP has done, but I think it’s a bit much that people are insisting that he must be misinterpreting her.",
                  "id": 183,
                  "comments": [
                    {
                      "score": 53,
                      "content": "This!if she just said “He’s safe” I think the he absolutely would the AH here, but because she followed it up with half compliments like “nice /enough/“ and that everyone else in the room felt awkward afterwards tells me that the OP has a good reason to not take this comments as compliments.",
                      "id": 184,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 152,
                  "content": "If you read his post, everyone in the room interpreted it the way OP did and nowhere in his post does he say the GF explained to him later that she meant it as a compliment. You're making a huge and baseless leap that a statement the entire room interpreted as a pretty big insult was actually the opposite.",
                  "id": 185,
                  "comments": [
                    {
                      "score": 47,
                      "content": "Exactly. People are making assumptions based on their own feelings instead of what she actually said. Safe to never leave is not as complimentary as it supposed to sound.",
                      "id": 186,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "[deleted]",
                  "id": 187,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 199,
              "content": "Idk. One of the things I love most about my boyfriend is how safe he makes me feel - not physically, but emotionally. I can trust him and be entirely open with him. And considering my last relationship was also abusive, like with OP's gf, that seriously is a major factor.\n\nHe was gentle, and that gentleness told me he was different. He was safe. And after living feeling unsafe for so long, that was invaluable.\n\nI don't think she meant it as a compliment or an insult. Her first impression of him was that he wouldn't hurt her the way her ex did. That's all I think she meant.",
              "id": 188,
              "comments": [
                {
                  "score": 24,
                  "content": "That's not the way OP took it and its not the way anyone else in the room took it based on his descriptions of their reactions. He also doesn't mention anywhere in his post that his GF explained that she actually meant it in the way you seem to think she meant it. You'd think if OP was misunderstanding her, the first thing she'd do would be to tell him it was a misunderstanding. Instead she got mad that he reacted negatively to what she said. Sounds like OP got the right meaning to me.",
                  "id": 189,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Yeah but is that what “originally” attracted you to him?",
                  "id": 190,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "That is a key difference in what you said. \"He makes you feel safe\" Not \"He is just safe\" big difference.  \n\n\nBecause if she had worded it as \"he makes me feel safe\" it is a big difference because He makes you feel safe and has other good qualities too.   \n\n\nWhere as the way it is said here it comes off to OP as the only reason she likes him is he is safe and if she found someone who is safe and has other stuff she would take off.   \n\n\nIt may or may not have been an intended insult but it was insulting. This is the same as if a guy saying to a girl, well you look nerdy and I know no guys would be interested in you so I know you will stay with me.  \n\n\nNow he might like that she is nerdy, and he may also like that he knows she won't leave him, but the way it is said is still insulting. IMO he should have handled the party better but what she said was still insulting.",
                  "id": 191,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 182,
              "content": "I disagree. A man who makes me feel safe is the single most sexy attribute that someone can have. That is the thing I want the MOST in a relationship, above almost anything else. There is no greater compliment I could give a man, and no trait more attractive that they could possess.",
              "id": 192,
              "comments": [
                {
                  "score": 29,
                  "content": "But she didn’t say he made her feel safe she said he is safe as in a safe option. If she had said that I doubt op would’ve reacted this way",
                  "id": 193,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": ">There is no greater compliment I could give a man,\n\nBut the alot of men will not see that as a compliment. Its insulting.",
                  "id": 194,
                  "comments": [
                    {
                      "score": 7,
                      "content": "being told i make my wife feel safe  , feels great. Being told  my wife went out with me because I was safe. Not so much. They mean different things.",
                      "id": 195,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "Yeah people are dismissing the \"...and ya seemed nice enough\" finish of this comment as well. It was expressed very much as a \"I settled for you because I thought you were probably decent and unthreatening enough, and I needed that after being with abusive AHs before.\" way, which isn't a compliment. Her drunken blurted confession was not a compliment. But...\n\n...given the longevity of their relationship I think OP needs to address this with her, as I think she truly loves him now, even though it wasn't an enthusiastic start. Apologise for leaving, acknowledge your insecurities got the best of you, but tell her her comment was really hurtful and made you doubt she's actually attracted to you at all. You realise that's a bit silly now you've had time to think, considering you've been together 2 years, but it did make you feel less than. Hopefully she apologises too and forgives OPs for his insecurity driven actions.\n\nOP needs to realise that views of attraction change as you get to know the character and personality of people. Is their relationship happy, their sex life good, and they work will together? Because from her efforts for his birthday I'd think this is a yes. She knows what he likes, wants to make him happy, and will put in lots of time, effort and money to do so. Apologise for forgetting that and show her you'll do the same for her. Do something nice to make it up to her. She wouldn't still be with you if there weren't real feelings.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Reading a lot of the posts here trying to gaslight OP into thinking what his GF said was actually a positive makes me think there are a lot of dudes in denial about why their SOs are with them or women who have done something similar feeling called out.\n\nImagine if the genders were reversed and a male Kenzie had told a female OP that he started dating her because he thought she couldn't leave him. People would be screaming that he was an abusive asshole who was preying on her.\n\nEveryone in that room knew what she said wasn't a compliment. Their awkward reactions and the friend quickly trying to change the topic proves that. This sub's misandry is showing that they expect a man to take an insult like that (about something he was already insecure about) in front of all his friends and just shrug it off. Men have feelings too and having your GF tell everyone you know that she only dated you because she thought no other women would have you is incredibly hurtful.",
              "id": 197,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "There isn't anything in her comment about being attracted to OP, just about his personality. Which for me yikes. She basically admitted to settling for him. I dont know why people are calling him AH for getting upset over that.",
              "id": 198,
              "comments": [
                {
                  "score": 5,
                  "content": "This is 100% what I read from it as well.",
                  "id": 199,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Safe means to me that you’re not normally looks wise my type so you won’t cheat. I get why he’s mad.",
              "id": 200,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 177,
          "content": "Exactly, his feelings are his feelings. They were hurt and sometimes the adult thing to do is walk away until things can be discussed later rationally. She may not have intended to hurt him but intent isn't magic. And being drunk is not a good excuse.",
          "id": 201,
          "comments": [
            {
              "score": 35,
              "content": "The adult thing might be to walk away and talk about it later, but that would normally be saying \"I'm upset and can't talk about this right now,  I'm going to leave and we can talk about it after we've both cooled off a little bit\"\n\nOP left in the middle of the night without saying anything and turned off his phone.  That's not exactly the adult option.",
              "id": 202,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "I agree, tbh it seems like op interpreted it as her saying he was a rebound, which can mess with you if you think about it, also maybe he just wanted her to say she thought he was handsome, after all, having an insecurity can really effect your everyday life. I hope OP is okay tho  \n\n\nedit: I should mention I've only been in 2 relationships so i might not have the best say",
          "id": 203,
          "comments": [
            {
              "score": 41,
              "content": "Nope you're right on the money. OP wanted to believe that she found him attractive. Not just \"better than the last one\", which is a massive blow to the ego even if your ego isn't inflated.",
              "id": 204,
              "comments": [
                {
                  "score": 8,
                  "content": "thank you! I just wanted to make sure, tbh my current bf was sort of a rebound and we discussed it and now we're closer than ever",
                  "id": 205,
                  "comments": [
                    {
                      "score": 3,
                      "content": "It's definitely something that CAN work out, and for all we know that's what's happen for OP.",
                      "id": 206,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "I feel like a lot of men hear “safe” and think “the easy option who couldn’t get someone hotter than me”. But for most women “safe” means “someone who won’t beat or rape me”. This is something that *really* needs to be talked out.",
          "id": 207,
          "comments": [
            {
              "score": 9,
              "content": "Okay, but if that's your only criteria, then about 80% of men at least in the USA meet your criteria for attraction. So telling a man that is like saying, \"well you're part of the 4/5 of the country that I'm not repulsed by so you'll do\".",
              "id": 208,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Yeah, I can understand why OP was stung by the inferences he made from her words. I can even understand why he felt like he needed some space to process it.\n\nI do think that turning off his phone and ignoring everyone was a bad move though. Obviously Kenzie fell in love with him for more than thinking he was \"safe\" considering the plans she made for his birthday.",
          "id": 209,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "We all have insecurities, and sometimes something inadvertently plays on them. Fucking off and secretly leaving an awesome surprise weekend away with mutual friends because your SO put their foot in their mouth is a massive overreaction and an AH move. Not just to your partner but to all the people who took the time to be there so you can ditch them.",
          "id": 210,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "I agree - as a woman, if a guy described me as a 'safe option' and that I seemed 'nice enough', I wouldn't feel complimented.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I agree.\nI wonder if genders were reversed, would people's judgments be different or remain the same?",
          "id": 212,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "FINALLY!! A SANE PERSON!\n\nI wonder how many of the women here who insist the word ‘safe’ is the highest compliment would take it if someone called them a ‘hot piece of ass’ or ‘nice and quiet’ or anything else insulting. He meant it as a compliment! Why are you overreacting?? You’re going to ruin all of your relationships if you keep being so insecure! \n\nAnd as a woman, ‘safe’ is not a goddamn compliment. That is baseline. That is down there with ‘kind’, ‘knows hygiene’, and ‘doesn’t murder small animals’. Can you honestly not see how men - or many women for that matter - won’t swoon into your arms over such impassioned poetry? Christ.",
          "id": 213,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Agreed. If I turn this around in my head as a female, I would be very hurt if my SO said he was attracted to me because I was safe, wouldn’t cheat or leave.  I would feel like an unattractive loser.  It is likely that is not how Kenzie intended it. but the original reaction is understandable.  Did he over-react? Probably.   Hopefully communication can help work things out.",
          "id": 214,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1839,
      "content": "YTA - I understand that what anyone wants to hear is something about being attractive, and that it would hurt to hear that you were “safe”. But to me it just seems like very very poor phrasing, not an insult. This could be easily talked out and the weekend could’ve gone on as planned. She clearly loves you a LOT to have done all of this for you, and this is such a small and easily fixed issue.",
      "id": 215,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1789,
      "content": "INFO: Why was your instinct to call Grace?",
      "id": 216,
      "comments": [
        {
          "score": 1107,
          "content": "This right here. Gets butthurt, calls his backup GF to come get him. YTA and def not the safe guy your GF thought you were.",
          "id": 217,
          "comments": [
            {
              "score": 259,
              "content": "\"Best Childhood Friend\" according to OP. He has had his whole life to date her if he really wanted, and has chosen not to. This is a huge stretch to insinuate he's actually interested in her. Guys and gals can be platonic best friends, and I'd be pissed if I were ever in this situation and someone said my best friend is a \"backup GF\".\n\nThe real answer to u/Dear-Ambition-273 is easily \"Because she's been my best friend since childhood, and I needed to vent and get a ride back.\" *He already said that*. Who else do you call when you're pissed and need to vent besides your best friend? What more do you want?\n\nHe still overreacted IMO, but this isn't it.",
              "id": 218,
              "comments": [
                {
                  "score": 78,
                  "content": "Obviously Grace doesn’t want to date him because he’s ugly! /s",
                  "id": 219,
                  "comments": [
                    {
                      "score": 8,
                      "content": "funny thing is this could be true and we would never know",
                      "id": 220,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "Exactly, literally anytime a aita posts is made ppl will ALWAYS comment \"They're cheating!?!!\" or \"So your backup partner?\" ANYTIME the posts mentions that someone has a friend of the opposite gender. For some reason ppl in the comments can literally not fathom that two ppl of the opposite sex are FRIENDS\n\nI remember a post where a guy and his wife were fighting. And, in a sentence that wasn't even the main point he quickly mentioned that she hangs out with a mutual guy friend. 70% of the comments were claiming she was cheating and weren't even judging the main issue. The comments didn't stop still OP had to make an edit saying they're mutual friend is gay and to stop claiming his wife was cheating.\n\nIt's honestly so annoying to see ppl reciting the same thing over and over again. Ppl love to say \"Deconstruct gender stereotypes! Woman and men can be friends without any sex involved!\". But then anytime there ACTUALLY is a man and women that are friends, they're accused of cheating?? It's ridiculous",
                  "id": 221,
                  "comments": [
                    {
                      "score": 11,
                      "content": "my best friend grew i\\[ next to me who i met when I was 3 and she was just home from the hospital. I have never been attracted to her. I've seen her have her diaper change ,  she's seen me at some of my most embarrassing points too.   But we have been friends for almost 40 years.  Of course I'd call her if I needed advice or help .",
                      "id": 222,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "And it sounds like basically all his other friends were already part of the trip he wanted to escape... so she's a natural option.",
                  "id": 223,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 708,
          "content": "And why was her first response to encourage him to bail rather than encourage him to take a while to cool down and then discuss it with his gf like an adult?",
          "id": 224,
          "comments": [
            {
              "score": 482,
              "content": "I feel awful for Kenzie.  She thought she had a boyfriend and a friend and she has neither.  I hope she finds better people.  She doesn’t deserve their immaturity.",
              "id": 225,
              "comments": [
                {
                  "score": 541,
                  "content": "Looking at other comments from OP as well - ugh. In one he says \"we're both logical and talk things out and never fight\" but in another \"I had to leave because I knew we'd fight and the thought of spending 2 more days with her was too much\".\n\nHe clearly needs to get his own insecurities sorted and Grace is doing him a disservice feeding into it. But Kenzie really doesn't deserve all this malicious intent that he is projecting onto her.\n\nEven if she DID mean it in the unflattering \"he's not attractive enough to leave me\" kind of method - it's the FIRST ATTRACTED game. The first thought she had 2 years ago where she decided to give him a chance.\n\nNot why she went for a second date, or third, or 4th. Or why they've been together for 2 years. Or why she's still around planning a whole surprise birthday weekend getaway with his favorite things.\n\nKinda feels like he's let his own insecurities combined with putting Kenzie on the \"perfect hottie gf\" pedestal has had him waiting for other shoe to drop the whole time. Like, expecting it to be too good to be true and now he has the \"AHA! I KNEW IT!\" moment.\n\nSo instead of talking it out the next day, or even just discussing that her words hit a nerve and he would prefer to go home and have some space, he just ran away from the whole situation.\n\nAnd basically had a self-fulfilling prophecy of they are *definitely* now in a fight rather than just an awkward miscommunication.",
                  "id": 226,
                  "comments": [
                    {
                      "score": 41,
                      "content": "Absolutely correct. \n\nHis insecurities got the best of him and now he's in the dog house (and justifiably so) for it. He is not the a hole for feeling hurt, but he is the a hole for the way he decided to deal with it. \n\nTalk about self fulfilling prophecy as you say.",
                      "id": 227,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "This.\n\nI'd add that too many comments mention Kenzie's drinking and OP's quotes of what she said. OP was drunk too. Considering the time between her words and his posting them, they are a paraphrasing at best. I would concede that \"safe\" and \"wouldn't cheat on me\" are the only quotable words from his own drunken recollection.\n\nThey are his trigger words. Sadly, he just proved he could be just as abusive and unsafe when triggered.",
                      "id": 228,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "Frankly, most men aren't insecure enough about their position in their relationships. Every man I know is in a relationship with a woman who could do so much better in every way but bc the available stock of men is so terrible, most women choose the first man who isn't abusive and unstable and is willing to stay around. Women have to work twice as hard as men to gain half the ground, so most are better educated, well-rounded, community-minded, cultured, and dressed/groomed better compared to the men they attract. This guy is at least self aware enough to know that his girlfriend is way out of his league, but instead of feeling lucky that she chose him, he's mad that she doesn't think he's Captain America, when he's not in fact Captain America. Men will destroy their lives instead of going to therapy to work out their issues or work to become the men they want to be.",
                      "id": 229,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "It just reinforces to me that these kind of party games are bad news.",
                      "id": 230,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Exactly, Grace never wanted him to z'd up with Kenzie. And her having to work was because she didn't want to see them being together. Conveniently enough she can drive all the way over to support him, but not plan to attend a few days of that weekend.",
              "id": 231,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 284,
          "content": "As someone who went through a lot of awful relationshit, it is the most amazing feeling in the world to be with a partner who loves me and treats me with respect.  He makes me feel safe and secure.  That’s a f*ing gift.  It’s not a slight against any other aspect of his personality.  Your insecurity is toxic.",
          "id": 232,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 71,
          "content": "Took way too long for someone to point this out.",
          "id": 233,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Exactly. That sounds like the classic beta male who's in love with his best friend and then every relationship they have is ruined because they're in a pseudo relationship with each other, but aren't physically attracted enough to actually date.",
          "id": 234,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1120,
      "content": "Soft YTA. I understand why her comments hurt your feelings. She may have originally chosen you as a \"safe choice\" but you two have been together for two years now and she clearly goes out of her way to plan special events for you. She loves you. This all could have been managed with an apology and and adult discussion, two things she seemed willing to do. Again, I understand your hurt feelings, but immediately running off to tell your best friend so she could come rescue you and cutting off all communication was not a great move. The weekend could have been salvaged with a little one on one discussion with Kenzie.",
      "id": 235,
      "comments": [
        {
          "score": 588,
          "content": "There’s absolutely nothing wrong with being a safe person, especially a safe man.",
          "id": 236,
          "comments": [
            {
              "score": 252,
              "content": "I agree with you. I think OP has some confidence issues about this relationship and it stung to hear it out loud.",
              "id": 237,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 190,
              "content": "There’s a difference between being attracted to someone making you feel safe and thus being a safe person and being attracted to someone because they are a “safe option”",
              "id": 238,
              "comments": [
                {
                  "score": 41,
                  "content": "When you are drunk you aren't the most articulate. She probably hand waved that he was \"safe\" but it sounds like she trusted him easily. Which is huge.\n\nAnyways, that trust is probably gone...",
                  "id": 239,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Then why was safe followed by \"he won't cheat or leave me\". Not anything else, THAT sentence.",
                      "id": 240,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 259,
          "content": "Hope you know you lost your girlfriend. She went all out for your bday. Rented a sick house and a boat. She obviously loved you and you played her. She thought you were a good, safe guy. She obviously was clearly wrong. You bail like a little child. \n\nYTA \n\nNow she will find someone who is indeed worthy as you clearly arent. Ppssfff. Two years and you do this. There would be no coming back for me.",
          "id": 241,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 126,
          "content": "That’s the part that gets me is he runs to his best friend about it. His gf was drunk and we all choose our words poorly. I get why he took it the wrong way but after being in an abusive relationships, myself, going for the “safe” option has made me so happy. \n\nThis guy has a poor ego and needs to see the whole situation and talk to his partner… not run to his bff\n\nEdit for typos",
          "id": 242,
          "comments": [
            {
              "score": 36,
              "content": "I agree that running to BFF for rescue is a bad look.",
              "id": 243,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1080,
      "content": "I'm not sure I understand your reaction. Why is her being attracted to you because you weren't an a-hole seen as insulting? I'm assuming she was saying that you were a good guy, someone she can feel comfortable around to be herself, someone she can depend on, someone who wouldn't cheat on her not because you couldn't but because you had greater ethics than that. If this is how she said it, then YTA. I get getting caught up in your head, but it sounds like you've moved from insecurities into self-loathing. Be proud you aren't an a-hole and that she likes that about you, but don't become one to prove that you can.",
      "id": 244,
      "comments": [
        {
          "score": 342,
          "content": "This is how I read it.  She was comfortable around him and he was safe - a true good guy.  And that is attractive.",
          "id": 245,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 761,
      "content": "People need to stop with this \"let's drink to have fun and then play a game where you have to talk about your relationship\" it always ends up like this.",
      "id": 246,
      "comments": [
        {
          "score": 48,
          "content": "Right! If I’m ever at a party and someone pulls out a game like that, I’m hiding it.",
          "id": 247,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "For real! I was like yall play Never Have I Ever next? 😂😂😂",
          "id": 248,
          "comments": [
            {
              "score": 37,
              "content": "When Never Have I Ever feels like the safer decision, you know it is going to end terribly...",
              "id": 249,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Exactly! It never ends well... ever. \n\nAs for OP - he sounds really insecure. Alcohol and communication is usually a recipe for disaster. Everyone is different, but I don't understand the only two options being LEAVE OR ARGUE, or instantly inserting his female best friend into this equation (but, that's another thing entirely.)\n\nInstead of talking with his GF once sober, he decided to basically torpedo his own relationship.... OP may not like what his GF said while drunk, but a drunk person speaks a sober mind. It sounds like she was abused and mistreated, and just wanted a good guy who wouldn't mistreat her. OP instead let his own insecurities create a negative narrative and ignored that his GF clearly loves him, went out of her way to create a special celebration for him, and wanted to make him happy.....",
          "id": 250,
          "comments": [
            {
              "score": 11,
              "content": "Her comments of ‘safer option’ and ‘I know he wouldn’t cheat on me or leave me’ suggests she feels that OP is below her and she is the best OP can get, so he won’t cheat because she feels she’s out of his league and he couldn’t do better than her. If I heard these statements I would have broken up with her immediately.",
              "id": 251,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "YTA\n\nEdit: you’re a huge AH! You have no clue why she is with you?!?! Bc you’re a great person asshole. Or you were.",
          "id": 252,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    }
  ]
}