{
  "post content": "My best friend of 15+ years asked me to dog/Cat/house sit while she went on a 5 day 4 night  trip. While the act of doing this is not hard and I love her fur babies, I’m still giving up my time. I’m not saying that I need monetary compensation necessarily but when I got there there was no food, anything to drink, nor did she leave me any money. To me, it makes me feel like she doesn’t think that my time is valuable. I really want to say something because I don’t want to have resentment about it but I don’t know how to word it without sounding like an a hole if I do. I know she usually has family do it and prob doesn’t comp them but I am currently out of a job and she knows this, so even stocking the fridge with some food would’ve been nice so I didn’t have to spend money on that while I came out here. Help!!! Ty in advance :)",
  "id": 1,
  "comments": [
    {
      "score": 12,
      "content": "Nta. She should have supplied food and maybe a nice bottle or of wine or gift card to say thank you.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "NAH. It would be nice from her to give you a compensation, but she doesn't have to. She asked you a favour because you are friends",
      "id": 3,
      "comments": [
        {
          "score": 2,
          "content": "Exactly. I puppysit for my bff often and I've actually banned her from giving me a Thank You gift. OP should just not agree to puppysit again if they don't want to do it without being compensated in some way. Alternatively, they could say \"I'd love to but I'm useless at organising food to bring with me and last time I spent a heap on takeaway food. My budget was very sad for weeks lol \". This gives the friend the opportunity to offer to put a few pizzas in the freezer and make sure there is bread, milk and cereal in the house. Or ask the friend to bring the dog to her place.",
          "id": 4,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "NAH -- you absolutely deserve compensation but you should have talked to her about this.\n\nShe wasn't obliged to leave food and you are also not obliged to do this as a favour.\n\nSure it would have been nice if she'd thought about your current circumstances but also you could have said something.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "YTA - you need to talk about compensation BEFORE you agree to something.  Not get resentful because it doesn't come when you don't even ask for it.  A LOT of friends do favors for each other for free.  She may just assume you are that kind of friend and she'll get you back with a favor in the future.  It's definitely not out of line to ask to get paid, but you need to ask.",
      "id": 6,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > It would make me an asshole because I think she expects me to do it for free\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy best friend of 15+ years asked me to dog/Cat/house sit while she went on a 5 day 4 night  trip. While the act of doing this is not hard and I love her fur babies, I’m still giving up my time. I’m not saying that I need monetary compensation necessarily but when I got there there was no food, anything to drink, nor did she leave me any money. To me, it makes me feel like she doesn’t think that my time is valuable. I really want to say something because I don’t want to have resentment about it but I don’t know how to word it without sounding like an a hole if I do. I know she usually has family do it and prob doesn’t comp them but I am currently out of a job and she knows this, so even stocking the fridge with some food would’ve been nice so I didn’t have to spend money on that while I came out here. Help!!! Ty in advance :)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 8,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA, I would be less concerned with financial compensation as that might be an uncomfortable subject amongst friends. But it's basic manners to ensure that the there is food in the house for a guest. That makes her either an ah or clueless.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. My brother cat sat for my friend. Said friend asked me what kind of food he ate and stocked up, afterwards, he regifted several gift cards for decent restaurants. \n\nThe first round was a week, a month later he cat sat for a month, same situation.\n\nYour friend at least needed to have food for you and a nice bottle of wine or whatever you.like.\n\nI wouldn't do it again. I'd rethink this friendship as she's taking you for granted.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    }
  ]
}