{
  "post content": "My sister has just given birth about a month and a half ago and I went over to help her with the baby/house chores since her husband couldn't take a leave from work. \n\nThe problem is, my sister is an extremely outgoing person and loves going to places/trying out new things.\n\nMe on the other hand, I'm burnt out and all I'm thinking about for an outing is how I will be carrying the stroller across the long metro stairs, the baby needing a diaper change and us running to the nearest toilet, the heavy traffic, the loud noises, in short I see it as stress and a chore, not something I'd do out of enjoyment.\n\nFor several days in a row now, I've been holed up in my room and refusing to go out with her while she goes alone. Today, she told me we will just go to the nearest park and that it's unhealthy for me to stay cooped up in the house all the time.\n\nI declined again and she became upset and said she wasn't in the mood to go out anymore. She said why I was even over if all I wanted to do was to stay home, that she was depressed and I'm making her feel worse. I told her she can always go by herself and leave the baby with me but she said that defeats the point of having company.\n\nShe grumbled about no one caring about her and went into their bedroom and shut the door. I've been thinking maybe I should've just suck it up and just go with her but I don't know why she insists on me going out too when I said I'm exhausted.\n\nIdk, AITA?\n\nUPDATE: I tried to knock and talk to her but she still won't talk to me so I wrote her a letter and slipped it underneath the door. I'm on my way to the hotel until my flight is up (we live in two different countries so sorry, the kind suggestions for coming once a week...etc are impossible. Once I'm gone I'm gone for a good while.)\n\nEdit to add info:\nI'm doing all household maintenance and cooking except for folding their laundry, cleaning up their bedroom, or grocery shopping as her husband takes care of these. \n\nSome nights when I hear the baby crying and none of them woke up I go feed him and put him back to sleep. During the day, we can both be in the house and I'd be the one changing him up sometimes. When she's out I watch him. When she needs to go to her doctor appointments I go with her and watch him outside. When we went out on outings before, I'd take care of the stroller and carrying the bags.",
  "id": 1,
  "comments": [
    {
      "score": 17383,
      "content": "NTA. You don’t want to go out and you don’t have too. You gave her choices.  You are there to help with the baby. Not her going out.",
      "id": 2,
      "comments": [
        {
          "score": 4981,
          "content": "Thank you!! I can’t believe I had to scroll down this far to get to this comment! OP is helping out a lot around the house, why can’t new mom go for a walk with baby on her own? What is the plan for going out when OP isn’t there?!?",
          "id": 3,
          "comments": [
            {
              "score": 4393,
              "content": "Dude, it would have been a GODSEND when I was a new mom if someone took my newborn baby and told me: you have an hour to yourself to walk around.\n\nNTA and you don’t have to go out if you don’t want to. You are there to help with the baby. I would have been so happy for an extra pair of willing hands when I had just given birth.",
              "id": 4,
              "comments": [
                {
                  "score": 1312,
                  "content": "I have a 2 month old and a 22 month old, and I think I have been away from my newborn maybe twice since he was born and every now and again I wish I could have someone to have them both just to let me breath without having to give one of them attention.\nOP you are NTA, you are helping your sister, your not obligated to do everything all the time for her",
                  "id": 5,
                  "comments": [
                    {
                      "score": 879,
                      "content": "That reminds me of the first time my ex and I went to a movie leaving our newborn home with a babysitter.  I remember all of a sudden having a panic attack, got up and ran out yelling at my husband 'We left the baby at home'.  My ex kindly reminded me that yes, we did, but we left him with a babysitter.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "Agree 100%\n\nEvery bit helps immensely when you have a new kid, I would have tried to make OP as comfortable as I can if I were in the new moms position.\n\nIt's also disturbing neither parent is waking up to tend the baby when it cries at night. Wow.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "My daughter is 9 years old. I raise her alone and my few family don't care much about her. I haven't gone out other than to my job in ten years, yes a decade and while she's my love and my world. I would love even 20 mins to go skip through a forest or take a nap anything. So yes he is an angel helping how he is. He's NTA",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 141,
                  "content": "That was my understanding about new mothers, so the sister stand was super confusing to me",
                  "id": 9,
                  "comments": [
                    {
                      "score": 349,
                      "content": "Based on the limited information, sister wants that out time to be spent *with* someone whose company she enjoys.\n\n\nGuilting someone based on the pretext of health concerns isn't the way to go about it, though.\n\n\nSister's words indicate she's feeling unseen and unattended to as a person separate from her new motherhood.\n\n\nNot to excuse her behaviors, but to speculate on what she's got going on emotionally as far as unmet needs.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 124,
                      "content": "My sister basically desperately wanted company *for herself* in both of her post-partum phases. She liked taking care of her baby, but she was lonely as a grown up and wanted company.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 109,
                  "content": "My mom came over when my daughter was a newborn and told me to take a nap. I didn't even make it to my bedroom.. I passed out on the couch the second I laid down. Without a doubt the most helpful thing i could imagine.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 36,
                      "content": "That was nice of her. I would go over so my relative could shower. Her baby was on oxygen and she couldn’t hear the monitor in the bathroom",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Some moms really know how to take care of their babies, even when their  babies are having babies!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "My sister just gave birth and that is my plan for the next month once I get home from school",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "When i got to go to the store on my own sometimes i would sit in the car for an extra 20 mins just so i could get more time.\n\nMaybe the mom has some depression or all the hormones being crazy. She might be think ideally rather than realistically",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Yeah, the conventional advice I've heard for visiting someone with a newborn is go over, say hi to the baby, wash some dishes and leave.\n\nEither something else is going on or the sister is being really entitled.\n\nNTA",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Plus, doesn’t she have any other friends she might want to meet for lunch or something?  It’s asking a lot for OP to be both her maid and her social buddy.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Like why is a mother with a 6 week old baby taking the baby out everyday to new places? Babies don't have a good immune system until 6 months.  OP sounds normal, tired after taking care of the household and most baby cares all day.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I always offer my friends this.  I’ll watch the baby, go take a nap, long shower, a walk, get a pedicure - go do you for an hour to so - I’ll text if I have questions.  Or if they don’t want to leave the baby, sit and be while I clean the kitchen and living and do a load or two of laundry..  Best thing you can offer a new mom is time and an extra set of hands that are productive.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Mine are 3 and 6 and I’d take this now! \n\nOP should be charging as an Au Pair.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "NTA at all. Your there to help with the baby, not provide entertainment to your sister.\n\nWhen my son was a few weeks old I had to pop to the shop for some nappies. My Mum waited in the car with the boy whilst I had the most glorious stroll around the supermarket for 45 mins to buy one thing! It was the first time I had been on my own in 6 weeks and it was glorious!",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 61,
              "content": "TBH it sounds like OP's sister has plenty of bandwidth to pick things up.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "Does she have friends in the area? with or without kids?  If shes this pent up already, she is in for a long slog if not. \n\nIf you are doing all the grunt work on outings, maybe you need to make an 'emergency' trip home and leave outing to her. I wonder if she will be up to it if she doesnt have a free nanny tagging along.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "And treating her like a pack mule when they do go out. Your sister is the asshole. She doing none of the work that's making you so tired and, rather than appreciate it, she bullies you because you won't be her entertainment as well. She's using you, wearing you out and then complaining that you aren't doing enough. I see that you are leaving. Good. That would be my advice. I cannot imagine them just not getting up at night and leaving their baby to cry until you do it. The didn't hire a nanny and you aren't being paid. NTA",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yes I’m wondering what sister’s plan is once OP goes home. She’s in for a pretty rude shock when she doesn’t have a slave anymore.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1045,
          "content": "It's kind of scary how many people are berating OP for not doing ev-er-y-thing sister wants, and saying the chores and childcare aren't enough. How hard could it be for the gregarious sister to just call one of her many friends??? I hope OP doesn't burn out trying to make internet strangers happy",
          "id": 27,
          "comments": [
            {
              "score": 648,
              "content": "This is what gets me? OP is already staying at the those and doing a huge amount of domestic work to help out, if the sister is so outgoing, why doesn't she call one of her many friends? Or another family member? Or join a mother's group?\n\nThe entitlement is strong with the sister and honestly in the comments here. \n\nOP, NTA.",
              "id": 28,
              "comments": [
                {
                  "score": 137,
                  "content": "My best guesses are that either she doesn't have friends, or all her \"friends\" are only \"Party friends\" and nothing deeper than that.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 76,
                      "content": "Or maybe most of her friends are working and can’t go out with her during the day. \n\nI was the first one to have kid in my friend circle. It was lonely the first few months. When you text your friends, they replied with short message and you know they are working so you don’t want to bother them too. \n\nOP sister should look for mum’s group in FB. I didn’t know about them until I had my second child. They are great and often arrange outing and playdates. \n\nNTA for OP you already help her but it is good to get out the house though. Just walk to the nearest park or coffee shop to chat.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Or y’ know maybe they’re at work during the day? I didn’t hang out with any of my non-mum friends during mat leave\n\nI craved adult conservation and friendship as well as time alone, both were enormously helpful in that year",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 314,
              "content": "Seriously? People blame OP for being an exhausted, burntout mess wanting to just vibe in her room after helping to care for a baby?\n\nDid everyone forget how hard it is to care for a baby? And the fact *she is helping with house chores and the baby*?? So that her sister can have some time for herself? How is that not enough? \n\nIf this was flipped with the sister making a post about how her sister won't go out with her even though OP is there doing all the house chores and helping the baby, 100% people would call the sister an AH for demanding too much and tell her to leave her alone.",
              "id": 32,
              "comments": [
                {
                  "score": 96,
                  "content": "[deleted]",
                  "id": 33,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Yup, with the rise of people being sick, it's too risky for the baby or either of them to be going out constantly. \n\nBut even then, it's the sister's choice to go out but she doesn't need to drag OP with her whenever the sister wants to go out.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 27,
                  "content": "Right. I was thinking this too. Like OP is exhausted taking care of a house and child that isn’t even hers. Sister and  her BIL aren’t even waking up to take care of the babies needs, OP is. And OP is taking care of the baby even when both parents are home. Sounds like sister isn’t actually ready to give up her prebaby life, or she just is looking for a full time nanny.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "Gonna go out on a limb and guess that she doesn't have friends.",
              "id": 36,
              "comments": [
                {
                  "score": 41,
                  "content": "None that she can use for nanny and maid service.",
                  "id": 37,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "I’m also curious about the time frame of staying with yo do everything.  I get the first few weeks when mom is recovering from birth, but at what point does the nuclear family start being a nuclear family and OP go back to her life?  If sister has all this energy to go places, maybe she should be ready for OP to be an occasional social outlet versus constant presence?",
              "id": 38,
              "comments": [
                {
                  "score": 9,
                  "content": "Starting at week 6 the exhaustion truly kicks in. Help from 4-12 is the dream. Even if it is only small tasks.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "She should just go home. The new mother had help for 6 weeks and is rested enough to want to resume an active social lifestyle. The need for help is over.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Exactly. She even carries the bags and handles the stroller so what is the sister mom doing ? \n\nBeing a mom is hard. But that doesn't mean she should run op ragged.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 601,
          "content": "Hijacking the top-voted comment for visibility because while OP is certainly NTA, I'm worried based on the last two paragraphs that OP's sister is potentially showing signs/symptoms of postpartum depression and it might be a very good idea to gently broach the topic with OP's sister and see if she'd be willing to call her OB or primary care doctor for screening and, if necessary, a referral to someone that can help her find relief. It sounds like she's feeling lonely, perhaps isolated, she says she's depressed, and she feels like no one cares about her. This likely has little to do with OP or going on outings, and a lot to do with hormones and brain chemistry and might get significantly worse without diagnosis and treatment if it is indeed postpartum depression. OP, would you be willing to talk to your sister about these feelings and offer to accompany her to a doctor's appointment to see if they might be able to help your sister find relief?",
          "id": 42,
          "comments": [
            {
              "score": 38,
              "content": "Up with you! More visibility.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "THIS! I’m seriously concerned about OP’s sister. Postpartum is real and debilitating. It is often not diagnosed and thus the woman is just blamed for being “difficult” or “unnatural.” Sort of like all the folks on this thread making snarky comments about sister being ungrateful and/or not having any friends. \n\nNAH but it might be worth taking a quiet walk with your sister and making sure she is ok.",
              "id": 44,
              "comments": [
                {
                  "score": 2,
                  "content": "AGREEEEEEED",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Glad someone pointed this out.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Scrolled down to see if this was suggested, thank you Lostin1 der! Also just to reiterate, NTA.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I agree. I had postpartum depression and was not good to be around either. I also pushed people who tried to help me away. The rapid hormonal changes, and for me a traumatic birth set the stage for a depression that only lifted with medication.\n\nI do sympathize with OP though who is doing so much trying to help. She is definitely NTA, but this may not be an AH situation either",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "if I had an award I'd give it to you.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Updoot and freeward to help boost visibility from someone who *never* wants anymore children due in large part to the severity of my post partum",
              "id": 50,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 158,
          "content": "On top of that a newborn has no immune system and covid is still a thing. The baby shouldn't be drug around the city yet. My 6 mo niece is currently in the hospital with covid because her parents were taking her everywhere. \n\nMy daughter was born premature during the height of covid. She was in our family bubble and not taken in public until she was a year old besides doctor appointments. Protect your baby.",
          "id": 51,
          "comments": [
            {
              "score": 43,
              "content": "Babies need vitamin D, interaction, stimulation, fresh air. I get that during the height of covid and especially with a premature baby you’d want to be careful, but there is absolutely nothing wrong with taking babies out with you.",
              "id": 52,
              "comments": [
                {
                  "score": 92,
                  "content": "Yes we went outside in our yard or a park away from others but we didn't drag her all around town. From some of the things in the post it sounds like they are going into very crowded public places where who knows what they'll be exposed to. When we took my daughter out we did it in a way that minimized risk to her. \n\nThis was us personally. We waited a long time for her and had several complications along the way. I was willing to sacrifice some things I would have liked to have done to keep her safe. Now that she is 2 and vaccinated we are taking her to things with more people but still careful with her.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Hats off to you to be honest, I have said to a few people how incredibly glad I was not to have to deal with being a new parent during covid, I can’t imagine how much extra stress and pressure all that put on the already incredible stressful time in your life! And I totally understand why that was what you guys had to do. But if OPs sister wants to take her baby out I still think that’s ok.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "Even full term, healthy babies are at high risk for RSV and hospitalization, and not we have a critical medication shortage. Newborns should definitely not be running around the city right now",
                  "id": 55,
                  "comments": [
                    {
                      "score": 11,
                      "content": "And RSV in babies can cause permanent lifelong damage causing asthma",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 34,
              "content": "Right now?\n\nCOVID, RSV and influenza are all quite high in the US.  There is a measles outbreak in Minnesota.\n\nNow is not the time to be dragging anyone without a vigorous immune system and full vaccination around town.  Maybe in the spring, when weather is warm enough for outdoor activities with more fresh air and distancing.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Rsv is what's killing babies , not covid. My baby was in picu for rsv and it's going around like wildfire now",
              "id": 58,
              "comments": [
                {
                  "score": 5,
                  "content": "That too. Cold and flu season is hell to have a baby in.  Covid was our main concern when she was born because no one knew what it would do to babies, especially a preemie. \n\nAt almost 2-1/2 I'm less worried and hoping she gets a few easy colds that brother brings home from school to help strengthen her immune system but still worry about the bigger stuff. She's just getting over an URI that caused an ear infection to the point that she ran a fever for 7 days and didn't want to eat or drink. It can be scary.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 131,
          "content": "thankyou. the sister sounds exhausting to this introvert. imo OP should go home for the sake of her mental health.",
          "id": 60,
          "comments": [
            {
              "score": 30,
              "content": "My thoughts exactly. As an introvert I have struggled with my extroverted family members my whole life. OP needs to leave for her mental health. Introverts need time alone for their sanity not the other way around.",
              "id": 61,
              "comments": [
                {
                  "score": 4,
                  "content": "Because she doesn't say anything any other time for days but acted in a bad manner once?\n\nI don't think the post suggests that the sister doesn't let OP have alone time, either.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Oh it definitely does...sister is an extrovert that wants to go out....then go out and leave the introvert alone.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 129,
          "content": "Op is there to help with chores so mom can get some rest, not be sisters emotional support animal.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": ">but she said that defeats the point of having company.\n\nRight? OP is clearly stated she's there to help with chores/baby. OPs sister sounds ungrateful for the help.\n\nOP shouldn't have to change their personality as well.\n\nNTA at all.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "Tagging on to add, I didn’t even realize she’s not a single mother! Not only could she be reaching out to friend but she could wait for the weekend and plan a date night when he doesn’t work since OP is fine with babysitting. Insanely self centered logic with the sister.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Going outside to a park is healthy and supportive of everyone.  Caring for people is helping with what they need, not what is comfortable to provide.\n\nTo go way out of one's comfort zone is one thing, but going to a park would likely be good for everyone involved.",
          "id": 67,
          "comments": [
            {
              "score": 9,
              "content": "It's not supportive of people who DON'T WANT TO GO.\n\nShe's there for baby, not to be her pet. And there are boundaries. If sis demanded that she goes down on her bc ''comfort'' would that be ok too.",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "It sounds like OP is doing all the chores and even some overnight baby care. She is rightfully exhausted. Maybe mom and dad need to start taking over more regular household duties and then OP can go to the park.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "I wonder if OP still needs to be there in a full time role. If her sister values someone to hang out with over someone to help with the baby, then meeting up once a week or something should be sufficient.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3336,
      "content": "NTA - OP really should edit their post as their comments have shown they are definitely helping out in plenty of other ways. So as per my original comment, it's wonderful that you offered to help and you are clearly doing more than enough. \n\n~~YTA - it’s wonderful that you offered to help, but if you weren’t prepared to do so you shouldnt have agreed. Staying in your room the entire time isnt helping. Its adding another child to the house.~~",
      "id": 71,
      "comments": [
        {
          "score": 2707,
          "content": "Another child that's doing a bunch of cleaning and taking care of the baby? Okay. OP should go home and let sister do all that herself again. I'm sure after doing all the housework plus baby care with no help she'll have plenty of time and energy to go out.",
          "id": 72,
          "comments": [
            {
              "score": 350,
              "content": "Child?  OP owns her own home.",
              "id": 73,
              "comments": [
                {
                  "score": 538,
                  "content": "Right which is another reason it's ridiculous that the commenter above me is calling them childish.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "[deleted]",
              "id": 75,
              "comments": [
                {
                  "score": 237,
                  "content": "More of OP's words:\n\n>I'm doing all household maintenance and cooking except for folding their laundry, cleaning up their bedroom, or grocery shopping as her husband takes care of these. \n\n>Some nights when I hear the baby crying and none of them woke up I go feed him and put him back to sleep. During the day, we can both be in the house and I'd be the one changing him up sometimes. When she's out I watch him. When she needs to go to her doctor appointments I go with her and watch him outside. When we went out on outings before, I'd take care of the stroller and carrying the bags.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 117,
                      "content": "Wow. Shes a free babysitter.",
                      "id": 77,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 858,
          "content": "OP has commented that they have been cooking, cleaning, taking care of baby and getting up for night feedings and diaper changes. The being holed up is when they need down time, which as a human everyone needs. If OPs sister can't appreciate the help she is getting then let her deal with everything on her own.",
          "id": 78,
          "comments": [
            {
              "score": 122,
              "content": "Yes, and it sounds like Mom isn't doing much at all except planning outings.",
              "id": 79,
              "comments": [
                {
                  "score": 62,
                  "content": "Outings where OOP does all the work to enable them. Why isn’t the “mother” running to a restroom and changing the diapers, or carrying the stroller up/down the metro stairs?",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 430,
          "content": "She isn't staying her room the entire time though? Why does it seem like 1/2 this comment section didn't read the whole story? \n\nShe's entitled to spend her free time how she wishes. Being expected to go out EVERY SINGLE DAY after helping with the baby and household chores isn't shouldn't be expected. I don't think there are any AH here, just two burnt out people who have different needs. NAH",
          "id": 81,
          "comments": [
            {
              "score": 152,
              "content": "I have a hard time believing mom is burnt out tbh",
              "id": 82,
              "comments": [
                {
                  "score": 187,
                  "content": "You have to actually do things to be burnt out and it doesn’t sound like she’s doing shit, just letting OP do everything",
                  "id": 83,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 101,
              "content": "AND if sister had made that a prerequisite then OP would have likely declined. I would.\n\nI traveled abroad with someone. In the planning phases, I made it clear I would not spend all day sightseeing. I would do one thing, one meal out, then I needed downtime. They could leave me behind while they explored. I made this crystal clear that vacations were for relaxing and I did not need to see 25 things on my bucket list.\n\nIt worked great until a relative decided we needed to spend a 16-hour day dragging our luggage through one of the biggest cities in the world. We got lost, they refused to ask for directions, and we ended up walking around another hour when we were 20 feet from our destination.\n\nI finally broke down and cried. Then they berated me for being tired and overwhelmed. \n\nYou go at the slowest person’s comfort speed. If sister needs an outing, she can go alone.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 60,
              "content": "I think that there was an edit, and half of the comments are from before OP explained the help that she was giving. There is a huge disconnect between the befores and afters.",
              "id": 85,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 38,
              "content": "I think OP is doing too much for her sister.  I don't think sister would have all the energy to want to go out every day if she was taking care of her baby and home.  \n\nOP needs to stop helping and go home, so she isn't helping someone who is the ahole here - and that is the sister. Sister is getting all this help and then is demanding OP do more with her?",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 217,
          "content": "Read the comments. Op is only staying in their room when sister goes out - so is even being extra courteous not to violate privacy or take up resources.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 147,
          "content": "She's there helping with the baby and cleaning house. How is any of that being an AH?\nShe's entitled to rest.\n\nShe didn't come to haul baby gear on the metro so her sister can socialize outside the home. She even offered to stay with the baby at the house if that's what the sister wants.  What more should OP do?\n She has put *her* life on hold to help her sister adjust to being a new mom by taking on a lot of the household cleaning and helping care for the baby. If she's tired from cleaning her sister's house and cooking and caring for her sister's baby why would anyone expect her to haul a bunch of baby gear on public transport, and what kind of new mother puts a literal infant inside one of those germ infested tubes with a bunch of vital vectors? \n\nIf this were me I would pack my stuff and go back home to my life. If her sister has that much energy then clearly she can resume her housekeeping and take on tending to her own child.\n\nEdit frigging auto correct. I need thinner fingers when my typos of \"puts\" gets changed to *buys*",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 134,
          "content": "Disagree.\n\nShe is helping with the child and doing chores (I mean at least based on what we've got to go on).\n\nWhat she's not prepared to do is go out all day with mother and baby, which I think is fair enough",
          "id": 89,
          "comments": [
            {
              "score": 71,
              "content": "I agree with you. OP mentioned they are burnt out and taking time to spend with oneself is not selfish or anything that other commenters have mentioned. Also does anybody see how OP’s like a stand-in for their sister’s husband? Why is he not pitching in for childcare of his own child?? \nNTA OP, you deserve some personal downtime and you have to set boundaries with your sister",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 117,
          "content": "I’m sorry what? “If you weren’t prepared to do so you shouldn’t have agreed.” What kind of asshole response is that?? She’s already babysitting, cooking and basically a maid for free to help out her sister but just because she doesn’t want to spend time outside that makes her an asshole?? “Staying in your room the entire time isn’t helping” yeah it is, it’s getting the sister off her back. “It’s adding another child to the house” then she should go back home if she’s not even helping then, right? (Sarcasm) but if she does go back to her home then her sister can say “no one cares about her” and have it actually be true. OP is NTA.",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 116,
          "content": "> I went over to help her with the baby/house chores\n\nthis is not \"I went over to valet for madam while she takes the bebe out to the mall\".",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "That’s a really unfair judgement even without the additional info from the comments.",
          "id": 93,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 67,
          "content": "NTA - OP does everything, new mom does nothing (both inside and outside the home)",
          "id": 94,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3072,
      "content": "NTA. You're cleaning, cooking, and helping take care of the baby while struggling with your own mental health? Your sister sounds like an ungrateful brat. Most parents would kill to have someone take some of that work off their plate, not complain that you won't be their unpaid nanny during social excursions too.\n\nI'd go back home and dial your help down to cleaning/ delivering meals once or twice a week. Her husband or someone else can step up for the rest.",
      "id": 95,
      "comments": [
        {
          "score": 775,
          "content": "I mean, postpartum is wild. Yes having help is amazing and she’s not seeing the gift she’s been given, but she probably IS depressed and trying to fix it. She just needs to stop trying to drag her sibling out and see a therapist instead. No need to call her names",
          "id": 96,
          "comments": [
            {
              "score": 198,
              "content": "THIS. Sis should be grateful for OP's help. I'm not sure she understands how good she has it compared to other moms. NTA",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 134,
              "content": "Yes. \n\nThe sister needs to expand her village in other words. Not putting it all with OP.\n\n As a mom who went through bouts of post partum anxiety / depression, the sister is not realizing this because she’s only leaning on the support she knows - OP. I did not know this until other spelled it out for me…what I was going through and what I needed to do. \n\nTherapy would help. As well as joining moms club or stroller clubs. The social aspect is vital for moms in the newborn trenches. But it is not fair to put it all in OP…who needs her own time to recharge her batteries/decompress.",
              "id": 98,
              "comments": [
                {
                  "score": 14,
                  "content": "Absolutely all of this. Postpartum is a sneaky depression because you're having such highs and lows and melancholy. Its not OPs job to accommodate her mental health issues but it might help OP to understand her.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "For sure. I felt like a caged bird during the postpartum period, so I very much get the impulse to get out and participate in life.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "Ungrateful brat seems like a massive stretch. This is a new mom, likely going through massive postpartum hormonal changes, who also needs to check her mental health for everyone’s sake. The need to be around people after giving birth is a mental health issue, not one of being a selfish brat.",
          "id": 101,
          "comments": [
            {
              "score": 145,
              "content": "While I sort of agree, I also disagree. OP said no to outings so her sister instead whines about it and claims to be a victim of no one caring about her when her sis is literally there to help her in many other way. That's kind of manipulative for her to do, doesn't matter if she just gave birth or not.",
              "id": 102,
              "comments": [
                {
                  "score": 21,
                  "content": ">While I sort of agree, I also disagree. OP said no to outings so her sister instead whines about it and claims to be a victim of no one caring about her when her sis is literally there to help her in many other way. That's kind of manipulative for her to do, doesn't matter if she just gave birth or not.\n\nThat’s also very typical of a stressed out, first time mother going through post partum depression. I mean dear God there are moms that kill themselves over the degree of depression after pregnancy despite having a perfect home setup. I said nah and I stand by that",
                  "id": 103,
                  "comments": [
                    {
                      "score": 59,
                      "content": "It doesn't make her not a brat, though. This is her baby. The OP is there out of the goodness of her heart but it's not good enough for her. The mom can now feel what it's like to have no extra support, and it'll be her to blame. I'm sure she'll miss and appreciate what the OP has done, as people usually do once a good thing is gone.",
                      "id": 104,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 29,
                      "content": "I'm not going to try and convince you otherwise, I'm just going to point out that mental health issues don't excuse shitty behaviour. No one else is responsible for her mental health, that's up to her. Sure some people may choose to help out, but that doesn't make them responsible for her. And if she isn't coping, then it doesn't give her a pass to treat other people poorly. She's still a grown ass adult and is responsible for her actions.",
                      "id": 105,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "*\"The problem is, my sister is an extremely outgoing person and loves going to places/trying out new things.\"*  This is OP's sister's personality pre-baby, so I think it's a stretch to say she def has PPD, she does need screened though.",
                      "id": 106,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2379,
      "content": "NTA.\n\n\"Sis, I'm helping to the limits of what I can do, because I love you.  If you don't want my help that's OK, and I can go home. But please don't ask me to come here and keep insulting the fact that I don't like to go out as much as you do.\"",
      "id": 107,
      "comments": [
        {
          "score": 388,
          "content": "This, this needs to be higher. I do not get all the comments acting like the Sis is a queen needing bowing to. Having help is not an entitlement - either take what's offered or do it yourself.",
          "id": 108,
          "comments": [
            {
              "score": 280,
              "content": "\"OP is committing emotional terrorism by only being an unpaid nanny, and not also a social entourage.\"  -- the majority of commenters in this submission.",
              "id": 109,
              "comments": [
                {
                  "score": 49,
                  "content": "Yeah, it's wild. I had a pandemic baby very early in when it was cross my fingers my husband was going to be there - this level of help unfortunately wasn't an option even with family who would've loved to do it.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Honestly, it's part of why I think you should be required to make your own comment before you can read other comments on AITA.  Too much groupthink, and too many people respond to the top comment's spin on things, even if it's directly contradicted by the actual submission.",
                      "id": 111,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "Seriously, I don' t get why people are demanding that she meet the needs of her sister when she's there quite voluntarily.  I don't see any world where offering any kind of help at all to a family member who just had a baby is an AH move. Reddit really is weird sometimes.  Go home and recharge OP!",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1193,
      "content": "NTA She sounds needy and ungrateful. If helping out with the chores and baby isn't enough for her, I'd just leave.",
      "id": 113,
      "comments": [
        {
          "score": 283,
          "content": "Holy shit so glad to see a NTA verdict. It sounds like the OP is doing quite a bit judging from her comments. The one thing she can't do is public interaction but she seems to be pulling a lot of weight elsewhere and IMO that's absolutely fine. And I don't get the comments saying she's trying to make herself out to be a matyr. I agree with your solution 100% on this. If what OP is doing isn't enough just pack up and get out of there.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 180,
          "content": "Definitely don't understand all these other comments. Apparently helping out means enslave yourself to every whim. She's been cooking, cleaning, doing night feedings, all while still doing her freelance work. So she still has a job to do. I would definitely high tail it out of there.",
          "id": 115,
          "comments": [
            {
              "score": 33,
              "content": "No kidding! Sometimes the comments just get it really wrong, and this is one of those time.",
              "id": 116,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Same, I can’t believe so many people seem to think she should be her sisters maid, babysitter and play thing. Especially when she’s struggling with depression.\n\nJust go home op, take care of your mental health before your entitled sister sends you into a burn out.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 998,
      "content": "NAH. You’re both obviously stretched thin from a month and a half of infant care. You’re just reacting in different ways.  You’re self isolating, she needs more activity and social. Neither is wrong exactly, it’s just conflicting needs. Plus, both of you are exhausted and she’s full of postpartum hormones (4th trimester), which is turning this pretty small thing into a big thing. \n\nIt seems you’re not capable of being the person she wants you to be right now. Ok. So expectations need to get reset. You two need to talk about it and figure out where to go from here. You need more regular alone time to recover. That needs to be taken into account. She needs more time with people to thrive. You can’t be that person every single time. Help her find others to make up for it, while also making the effort to be that person SOMETIMES.",
      "id": 118,
      "comments": [
        {
          "score": 233,
          "content": "FINALLY a decent answer! People are calling the sis a selfish brat seem to be completely ignoring her hormonal changes. Both of these people need to deal with the stress of the situation and neither are wrong to be trying to work on it in their own way. While I suspect sis is probably right that OP could probably benefit from some outdoor exercise, OP is understandably in their right to decline. Definitely NAH",
          "id": 119,
          "comments": [
            {
              "score": 158,
              "content": "Walking in nature, as sister is suggesting, is STRONGLY recommended to fight depression. The body needs nature and sunlight to produce the hormones that keep us in good form. Without time in nature our hormonal balance can go haywire.\n\nI know this is the last thing depressed people want to hear but it really is the first thing they need to do. \n\nAnd go to a doctor and have their blood work done, 10 different nutritional deficiencies can cause depression, on top of iron deficiency, diabetes and hormonal problems that can really mess with the mood. I don't understand why it isn't standard to run these tests before people get diagnosed with depression but that's another rant.",
              "id": 120,
              "comments": [
                {
                  "score": 32,
                  "content": "Right. My OB told me the same. Sister would benefit from a moms group or stroller club. I swear those groups of moms and are walks and picnics were a life saver for me when I was in the newborn trenches.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Taking a walk definitely might help some or even most people. But the sister wasn't offering to take care of baby stuff while OP took a walk. Her suggestion meant that OP would be lugging around baby gear and still focusing on caregivering while sister enjoyed her time outside. It wouldn't have been a relaxing break, it would have just been more stress.",
                  "id": 122,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "My therapist tells me this, but they also recommend I be mindful of my boundaries, don't feel like I *have* to push myself too far, that it's okay that I need time to recharge. That I'm not failing anything by not even getting out of the bed in some days and that I'm struggling with something difficult.\n\nIt would be wonderful if everyone could just take the advice of 'going outside and taking walks', but brain chemistry doesn't work just like that. It's not a matter of, 'this is what you have to do, so just go and do it'. If it was, I'd be cured.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "the sis is the AH, I’m bipolar and if I act out because of it I’m still an AH. Hormonal changes are a valid explanation, not an excuse.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "Lovely answer. Communication, acknowledgment of where you both are and what you both need. It might be that OP’s presence is becoming more stressful than helpful to the new mom she’s been helping, and that’s okay. Better to acknowledge than to ignore.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Yes, this is beautiful! NAH, but that could change if you two don't have a private, civil chat and work out a compromise that works for both of you.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Agree. Extroverts get energy by going out. Introverts recharge by relaxing more quietly/subdued. Generally speaking.\nI’d hoped the sister was concerned for OPs mental health, but can see why she’s frazzled with her own postpartum. \n\nNAH",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Came here to say the same. Please take this advice. Your sister is absolutely not at 100%, and neither are you. Try to talk this through and recognize you both have different needs. Good luck",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yes! This is exactly my thoughts. Sister needs to get out of the house and have something that resembles normalcy after being isolated with these first 6 weeks. OP is beyond wanting to go out and socialize after being there for her sister and her new baby. Maybe the sister can call a friend and be her social connection while OP gets some alone time?",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Yes!!!!!!!!!",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I WAS SCROLLING FOR THIS COMMENT!",
          "id": 131,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 540,
      "content": "The real AH here is the dad’s job for not giving him paternity leave",
      "id": 132,
      "comments": [
        {
          "score": 65,
          "content": "Golden comment lmao this should be on top",
          "id": 133,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "It’s so common here in the States that I totally bypassed that part, but yeah, you’re right. Dude could have at the very least saved up some days off to help out his wife.",
          "id": 134,
          "comments": [
            {
              "score": 51,
              "content": "Even if you have days saved up the boss has to approve your time off request. Obviously a good boss would say yes of course take two weeks (even if it's unpaid, just so he can go and bond with the baby as well), but alas good bosses are not the norm.",
              "id": 135,
              "comments": [
                {
                  "score": 23,
                  "content": "Also, he may already have used his PTO to help out at other stages of the pregnancy. Depending on their financial situation, even if his boss would approve unpaid TO, he might not have the liberty to take it.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "My spouse had 2 months saved up over years from just not being able to take vacation for 6y. Upon leaving, the company had to hire a literal team. \n\nWe don’t know the story here. \n\n\nETA: USA has no federal minimum for paid vacations. Spouse didn’t plan to save up 2 months but literally was unable to get vacation time off in those 6 years.",
              "id": 137,
              "comments": [
                {
                  "score": 7,
                  "content": "2 months in 6 years? That doesn't seem much to my European brain",
                  "id": 138,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I think they mean that by saving up all of their vacation days over rhe course of 6 years, they were able to take 2 months off.  So they were getting about 7 business days off a year and just didn't take a vacation for years.  Unless you did the math and think that ~7 days pto a year is small, which you would be correct to think.",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "It was the most generous PTO he’d ever had. USA #1 amirite?",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Even in countries with parental leave by law, men usually only get two weeks. In the UK, maternity leave is paid until month 9 and you can take months 10-12 as unpaid plus any holiday before/after that you’ve accrued (usually a base of 28 days), and the first 2 weeks after birth is mandatory and you can start it up to 11 weeks before EWC. Paternity is 2 weeks paid and 40% of fathers don’t use it.\n\nIf you or baby requires more than a 24hr stay in hospital, paternity leave gets used up real fucking fast. UK also offers parental leave but it’s 50 weeks shared between parents so you’re never off at the same time. \n\n16 of OEDC countries that have paternity by law only mandate 2 weeks or less. Only 15 offer more than that, with the lowest being 4 (Lithuania) and the highest being 52 (S. Korea and Japan). 10 offer none whatsoever. ([source](https://assets.weforum.org/wp-content/uploads/2015/08/Paternity-leave.jpg) from WEF) Few fathers use up their entitlement in the more generous countries ([source](https://timetastic.co.uk/blog/paternity-leave-around-the-world-a-comparison/amp/). That last source also gives a rather depressing look at the state of maternity leave around the world. \n\nWe need to do better by families and we need to do better by our children. \n\nWe should not be abandoning birthing parents, first time or not, in the shaky fourth trimester. We should allow non birthing parents adequate time to bond and care for their partner and children. We should not have to require family and friends to sacrifice and pick up the slack. Most importantly, the leave should be *paid* at a sufficient amount to make it affordable for all. \n\nNote: these sources discuss the US at the federal level. It may differ at the state level. \n\nNAH. You’re both struggling in different ways, and you’re helping as much as you feasibly can OP.",
          "id": 141,
          "comments": [
            {
              "score": 5,
              "content": "My partner worked a lot leading up to our daughter's birth. He tried to save up every single minute of PTO and sick leave so he could stay home with us as long as possible. He ended up with about 5 weeks. I honestly don't know how I would have handled it without him, I had a c section and my mom may have been able to come help a couple days a week but I would have been alone with the baby most of the time. Him being able to stay home with us made a hellish time so much easier. \n\nWe are in the US and he has a union job, but no specific paternity leave in his contract. He just saved up as much time as he could and took FMLA leave so he wouldn't get fired. We were very fortunate he even had the ability to save up pto. My cousin just had her first baby and her partner could only take the time off that she was in the hospital, after they came home he went straight back to work.",
              "id": 142,
              "comments": [
                {
                  "score": 3,
                  "content": "We get a minimum of 28 days leave by law (sick pay/leave is different and anything over 7 days needs a doctors note for the period you’re absent aka being signed off sick). Unless the management agrees to override, you can usually only take 2 weeks at a time especially during periods where everyone wants leave like summer and the holidays. \n\nMy other half is planning on using a week or two added on to his paternity when our baby comes in late May, so the maximum he’s allowed. He works from home anyway and his job is pretty flexible, so I’m luckier than most. \n\nOTOH, his baby sister had her son this June by emergency c section because he wasn’t getting enough oxygen and movements decreased so she went to hospital for a check and was out in under 10 minutes. They couldn’t even hold him for the first week because HIE babies like him need to be in a cool tank for at least 72 hours. Her boyfriend didn’t qualify for paternity leave because he’d changed jobs around the 5 month mark and you need to be working for the same employer for 41 weeks before the expected due date. They *generously* gave him a week which all got used up when mum and baby were in hospital anyway. Poor girl was fucked when she came home. \n\nIt’s shite on everyone.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "> In the UK, maternity leave is paid until month 9 and you can take months 10-12 as unpaid plus any holiday before/after that you’ve accrued (usually a base of 28 days), and the first 2 weeks after birth is mandatory and you can start it up to 11 weeks before EWC. Paternity is 2 weeks paid and 40% of fathers don’t use it.\n\nWe have [shared parental leave](https://www.gov.uk/shared-parental-leave-and-pay), so you definitely can take more than 2 weeks, it's just split between the parents.",
              "id": 144,
              "comments": [
                {
                  "score": 2,
                  "content": "I did include that, it’s in the paragraph underneath. :)",
                  "id": 145,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Could not upvote this comment enough.",
          "id": 146,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 513,
      "content": "I'm going against the grain and saying NTA. If what you are doing is a favor, then it is your right to dictate the terms, not hers. If you aren't comfortable doing what she's asking, you have every right to back out because ultimately, you aren't obligate to help. OP is already being a volunteer maid/nanny, and to demand more is being a choosy beggar. If you really didn't care about her, them you would simply leave her to manage the household by herself",
      "id": 147,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 365,
      "content": "Wow, I can’t believe the majority of comments here…\n\nNTA by any means. If you don’t want to go out, you don’t have to go out. I have severe social anxiety so I completely understand not wanting to do any of those things. My sister is very outgoing too, but she’s gotten used to me being an introvert, and doesn’t push anymore.",
      "id": 148,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 342,
      "content": "NTA. I am not sure that it's the best idea to take a one month old on a crowded metro during flu and cold (and Covid and RSV) season. \n\nDoes she have any other friends she can go out with, while you stay home with the baby?",
      "id": 149,
      "comments": [
        {
          "score": 107,
          "content": "No kidding! Who would take a tiny baby that has no vaccine yet out in public when not absolutely necessary.  \n\nNTA",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "Agree with you completely and I don't understand why everyone who says NTA and gives reasonable comments is getting downvoted. OP does not need to be responsible for 100% of her sisters social life. Can't she meet up with friends or do other social things while OP watches the baby at home. Dragging a newborn around public transit and buildings is not ideal.",
          "id": 151,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I was waiting for this one. My 3 month old was just in the ER for respiratory distress from a literal cold. Like just a simple plain old cold not even RSV or COVID. Newborn days are not the time to be out and about.",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "That’s exactly what I was thinking while reading this post! There’s no way I’d be carting a new baby around during this season. \nAlso, the audacity if the sister to wail about how “No one cares for her,” after all OP is doing to help her and the baby. OP is NTA.",
          "id": 153,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}