{
  "post content": "Throwaway for obvious reasons.\n\nRecently I started browsing the web looking for women who were interested in helping me gain some sexual experience, as I'm still completely inexperienced (kissless virgin...) and feel like some experience might actually help me be more confident when it actually comes to making a first move around girls. I'm in the 18-21 year age range if that's relevant in any way.\n\nAnyways, I got a reply on an advertisement I put out and we started chatting. Turns out this woman is married, has three children and recently had ended an affair with a guy my age she knew personally. She says she's very happy with her husband, just not in the bedroom. \n\nI'm really conflicted and don't know whether I'd be an asshole for helping her have another affair. On the one hand one could argue that she's already ruined her marriage by cheating before or that it's her decision and thus fault entirely or even that I might be helping her keep her marriage and family-situation stable by offering her the one thing she misses in her marriage (complete BS probably), but on the other hand you could say I'd be enabling her to further sabotage her marriage and that I'm an even bigger asshole for doing it with the full knowledge that she has 3 kids that would probably go through a terrible divorce if her husband found out.\n\nIf it's of any relevance: as of now I'm not sure how old she is exactly, if I had to guess based on her pictures I'd say in her late 30s, she wasn't too keen on sharing her age. More importantly, I also don't know what age her children are.\n\nReddit, WIBTA?\n\nEDIT: to all the people suggesting I date somebody my age or somebody who's at the very least single: I wouldn't be on a site like this if that had worked at any point in my life. I tried tinder, it sucked, I have asked girls out before face-to-face resulting in either rejection or just one date with no chemistry, and currently just about every activity in my life happens within a heavily male-dominated group, so I don't know where I'd be supposed to meet somebody in the foreseeable future (I'm busy enough as it is, so I don't want to sign up for new things with the sole purpose of 'meeting new people')\n\nIf I get a response from a serious single woman at any point, I'll probably end this contact in a heartbeat. Also, I'm still studying and currently don't work so an escort is basically too expensive for me. So as of now: judge as if it's this hook-up or nothing at all",
  "id": 1,
  "comments": [
    {
      "score": 79,
      "content": "ESH. She sucks for cheating and you’d suck for cheating with her. Find someone single to screw.",
      "id": 2,
      "comments": [
        {
          "score": 13,
          "content": "Also if she's dissapointed in the bedroom, a kissless virgin probably isn't going to help out",
          "id": 3,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 34,
      "content": "It will be ESH, unless she is in an open arrangement with her husband. \n\nAssuming no open relationship then yes you would be an asshole for this. No doubt about it.\n\nThe question is not whether you would be an asshole  - you would be. The question is whether you are OK with being an asshole.",
      "id": 4,
      "comments": [
        {
          "score": -15,
          "content": "It's indeed not an open relationship - the husband isn't aware",
          "id": 5,
          "comments": [
            {
              "score": 11,
              "content": "ESH it is.",
              "id": 6,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 27,
      "content": "ESH. Don't involve your dick in someone else's marriage, that would suck. She ought not be cheating, so she sucks. If you're looking for an older woman to break you in, check out cougars n' cubs websites and pick someone who's *single*.\n\nJust curious, why are you stressing over the age of her children, what difference does that make?",
      "id": 7,
      "comments": [
        {
          "score": -17,
          "content": "If they are still reasonably young and thus live at home (which they probably are given my age estimate), a potential divorce as a result from getting caught would hit them too\n\nIf they were adults that already moved out, they'd probably still be fed up, but wouldn't have to go through a terrible custody case or whatever",
          "id": 8,
          "comments": [
            {
              "score": 16,
              "content": "If she's in her 30s, she doesn't have adult kids. \nAnd just take a look back over what you've written: getting caught, divorce, custody. If this was the last woman in your area with a functioning vagina it *might* make sense that you're considering these risks.\n\nOP, I promise you... SHE ISN'T.",
              "id": 9,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 13,
      "content": "ESH. Except for the husband. Do not do this!",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 10,
      "content": "ESH\n\nWhat a shitpost.",
      "id": 11,
      "comments": [
        {
          "score": 5,
          "content": "Right!? And it’s funny that she just cheats because her husband can’t satisfy her but OP can somehow??  This is bs",
          "id": 12,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "ESH - I don't think it's right at all for an 18 year old to sleep with a 40 year old married person. Make better choices and don't enable her poor ones.",
      "id": 13,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "ESH. You’d be an asshole for facilitating more cheating, she’s obviously an asshole for cheating. Find someone your age group to date, not just have sex with. They don’t care if you’re inexperienced if you’re in a relationship for each other as a person.",
      "id": 14,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "ESH. You have mentioned it in the post. And for pragmatic reasons, this affair would be much more messy for you than if you met up with a single girl around your age. Better avoid those that might have strings attached to you, be it intentional of not.",
      "id": 15,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "NTA.\n\nNot your job to keep her faithful.  If she's looking to cheat she's going to find someone.  At least she's being honest with you, and she may even have an arrangement with her husband about it (you should ask if you haven't).\n\nStill, it's a bad idea (unless he knows and it's OK with it) due to the potential fallout.  If he doesn't know then she's an asshole, but that's not your issue to deal with.",
      "id": 16,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "ESH. Don't get involved with this woman. You'd have a hand in not only ruining this woman's marriage but also adding to the mess her kids are most likely going to endure eventually if she doesn't stop cheating. There are plenty older, experienced and SINGLE women out there.",
      "id": 17,
      "comments": [],
      "relation": "Attack"
    }
  ]
}