{
  "post content": "Pre-Covid I (33M) would go on family vacations with my family (My Parents (late 50's), Brother (27) and Sister (29)), these occurred about every other year.  For a multitude of reasons we haven't done a trip since 2018.  I am married and we have an 18 month old.  My sister has a boyfriend, and my brother has some sort of terrier and no GF I know of.\n\nMy brother has morphed into a self described \"dog dad\" and based off social media seems to rarely do things without the dog.  We live in the same city, but different areas and we don't see him all that much.  The few times i've been around his dog it behaves fine.  Its too friendly for me and I can't speak to how it behaves over multiple days or around babies.\n\nMy parents have a Vrbo beach house in Florida booked.  In a few week the deadline for a full refund for canceling is coming up and my parents need to know if we are in.  We live in the west side of the USA so we'd be flying.  I found out my brother plans to bring his dog.  My parents aren't thrilled about it but \"it is what it is\", those are my parents words.\n\nI'm not a dog person, I despise them on airplanes.  I do not want to travel with the dog (tentatively we are on the same flight), I do not want to stay the week in the same house as the dog, I do not want activities based on being dog friendly, and I do not want the dog around my son.\n\nOur parents want to stay out of it and have us hash it out.  I broached the topic with my brother.  Essentially he isn't flexible on the dog, it is his family and it is a family vacation.  He says my 18 month old will be far more annoying and loud than his dog.  He seems firm on this and i'm ready to pull out of the trip.  If I don't go, the trip may fall apart.  WIBTA?",
  "id": 1,
  "comments": [
    {
      "score": 45469,
      "content": "YTA\n\nIt's a small dog and you said it was well behaved. It's fair to ask the dog is kept away from the baby. \n\nA baby is a far more inconvenience than a dog. You can leave a dog home alone for a few hours if people want to eat at a nice restaurant. It's rude to bring a baby to a nice restaurant, they have bed times and they scream at movies. Kids are awesome- but you're on a different planet if you think the vacation is going to revolve around the dog- it's going to revolve around your baby.",
      "id": 2,
      "comments": [
        {
          "score": 7875,
          "content": "this is the best take I’ve seen in a long time",
          "id": 3,
          "comments": [
            {
              "score": 2522,
              "content": "[removed]",
              "id": 4,
              "comments": [
                {
                  "score": 1454,
                  "content": "NTA.  If you don’t want to be around the dog, don’t go.  It is that simple.  Make plans to visit your parents another time when the dog will not be there.  Bail now, saying that this isn’t a good time.  Do not discuss it further.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2486,
                      "content": "[deleted]",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1444,
                      "content": "but NTA implies that the brother is the asshole? What has the brother done wrong? At best, NAH. However, OP is mocking his brother for preferring dogs over babies and making him out to be the bad guy when, by all acounts, the dog is harmless.\n\nAlso, his initial response was clearly to ask his brother to not bring his dog. Obviously, if op doesn't want to go that's good choice and right, but where does he get off telling his brother what to do?",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 322,
                      "content": "The whole trip could fall apart didn't OP say if he bails? Not great behavior. Very controlling over a *dog.*\n\nEdit: ruining everyone else's fun because of this.\n\nDoesn't want the vacation to revolve around dog friendly activities?\n\nGive me/Reddit a break OP, your vacation(s) revolve around kid-friendly activities now, and not *everyone* enjoys that as much as you presumably do now with your precious 18 month old. Sigh / smh simultaneously. Not everyone wants to do kid-friendly activities. You're not the only one OP involved in this vacation, act like a kind human and role model your (possibly screaming on airplane and at restaurants and other fun Floridian activities) 18 month old can look up to.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "I would say NAH. If OP doesn’t want to go on a vacation he should be allowed to say no, but that doesn’t make the brother the AH.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Animal lover here. Please note: we don't have info on whether the dog tolerates young children. My 2 year old suffered a traumatic facial injury from my in-laws' dog during a family barbecue.  They were playing with a ball and then suddenly....it was horrible. NTA for choosing a vacation without someone else's pet.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4235,
          "content": "As someone who absolutely loves being a mother more than anything in the world,. That dog will be way less of an issue than a baby.  He's absolutely right",
          "id": 11,
          "comments": [
            {
              "score": 1843,
              "content": "I'd much rather take my dog on holiday than my kids, lol",
              "id": 12,
              "comments": [
                {
                  "score": 1633,
                  "content": "I’d much rather be on a holiday with someone else’s well behaved dog than an 18 month old no matter how well behaved.    I am a mother and small dog owner who knows both can be a pain in the ass for varying reasons from time to time",
                  "id": 13,
                  "comments": [
                    {
                      "score": 279,
                      "content": "Yea even the best behaved 18 month old is still a toddler and will not be on their best behavior all the time. Plus they can be prone to crying and tantrums.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Yes. It changes the dynamic.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "As someone who has raised 2 children, and currently has 2 dogs, I would much rather have a well behaved dog on vacation than a toddler.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "The 18 month old ITA",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "This sounds like something my mom would say.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I am amazed that my sister and I didn't break our parents when we went on vacations. We were NIGHTMARES. I feel so bad for them.",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "I have three idiot dogs and almost a dozen cats. Still reckon taking all of them with me would be easier than the vacations we had when I was younger as the oldest of five kids 😂",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "The *only* reason I'd rather take my kids than my dog is because my dog is dumb as a box of rocks. My kids are at least slightly smarter than her, most of the time.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 6,
                      "content": "My child only recently made the change over to smarter than our dogs",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "😆 I can understand, I once had to stop my young nephews from feeding rocks to my dog whose dumbass was actually eating them! 🤦‍♂️😂",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I'd pay extra to sit next to a dog in an airplane.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": " I'm a mother and also work in childcare for many years! The dog is going to be a cake walk compared the the child.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "[removed]",
              "id": 26,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Yeah leave the baby at home with the house sitter, they only need to be fed and watered twice a day, right?",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Also a mom, and hard agree. Especially at that age. They still have the same level of need as a baby while being mobile like a toddler, and \"no\" is just a suggestion. This is that magical stage where they actively attempt to self-terminate in creative ways. No way in hell is the dog going to be more trouble than the kid.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2930,
          "content": "I also want to throw in that babies on airplanes are WAY, WAY worse than dogs.",
          "id": 29,
          "comments": [
            {
              "score": 833,
              "content": "[deleted]",
              "id": 30,
              "comments": [
                {
                  "score": 349,
                  "content": "If there's a medical reason for that, god bless.  (If there's not, goddamn! Why would you do that to  ~~her~~ \n us??)",
                  "id": 31,
                  "comments": [
                    {
                      "score": 345,
                      "content": "*sighs in Australian*\n\nYou wanna go anywhere, you fly.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I mean, people have to get places. I was on a plane yesterday with a baby about 6-12 months in the seat in front of me. Baby was a little fussy but usually babies settled down after takeoff. No big deal. \n\nWe were delayed **in the plane** for one hour due to a mechanical issue. Baby totally melted down after about 30 minutes. Parents were freaking out and doing everything possible but kid was just done and needed to go to sleep but the lights were on, parents couldn't walk with baby because we were already \"prepped for takeoff\". These were very good, prepared parents. Sometimes, it just is what it is. No one was mad at these parents.\n\nBaby was a-OK after we finally took off. And when he fussed, parents handled it. People just need to deal with the fact that babies will be in public.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Yike! I am super sensitive to noise and would love if all babies could be miraculously quiet on planes but this take isn't it.",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Always give drinks on the way up and down by to help with cabin pressure change. Pressure differences are VERY painful for young children and it doesn't equalise by itself as well as with adults. But I guess you know that.",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 637,
              "content": "18 month olds are just entitled assholes that are effectively allowed to be such cause they genuinely don't know any better. \n\nLove my kids, but ages 0 to 24 were tough for us and those around us.",
              "id": 36,
              "comments": [
                {
                  "score": 465,
                  "content": "… 0-24 months or years?",
                  "id": 37,
                  "comments": [
                    {
                      "score": 838,
                      "content": "> 0-24 months or years?\n\nUmm... both?",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 124,
                      "content": "Months. I mean 24-48 months are also rough, but the first 24 suck the life of you.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I'm at mother to an 18yr old m & 21yr old m...  they definitely meant 0-24 YEARS",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Yes.",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Considering my boys are 5 & 4 and can still be little shits I’m resigned to believe the answer is 24 years.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "The dog will probably be in a crate in baggage.  If only infants could be put there too....",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Exactly. We have twins, going to be 4 soon. And we have a dog. The dog is the best behaved child we have.\n\nOp most definitely YTA. He doesn’t like dogs? Fine. But the way he goes about and describes his brother in a way that looks down on him makes him an AH.",
                  "id": 44,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "I love that this can mean 0 to 24 years and still be correct.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 3,
                      "content": "It probably will apply to us, but our kids aren't even 10 yet. There are days I want to ask for a warranty exchange though.\n\nHowever, my parents probably would apply years to that statement. lol",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 242,
              "content": "I was on an international flight yesterday,  baby and toddler both would cry and cry. Parents did nothing.  I thought I was safe on my connection.  Nope. Same family and the toddler wore itself out having a 10-minute fit.  What AH parents.",
              "id": 47,
              "comments": [
                {
                  "score": 309,
                  "content": "Honestly there’s not a lot you can do on flights when littles are having meltdowns. I use to feel the same way as you till I had my own and we went on our first flight. \n\nThey don’t understand why they can’t move, why their ears hurt, etc etc. you can try toys and songs and snacks but sometimes they just cry no matter what you do. It sucks and I bet money that the parents hated it more than you did. \n\nMy second flight was one of the worst experiences ever. Nothing consoled him.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 251,
                      "content": "I was on a flight once with a baby and toddler two rows ahead, and another baby and toddler directly behind (h.e.l.l.). The people behind us were straight-up ignoring their kids, and they were dramatically worse than the kids in the family in front of us, who would talk to their kids, hold them, try to distract them, etc. when they had a tantrum. And yeah, everyone was tantrum-ing regardless, but the kids of parents who were actually *trying* to engage with them were so much better.\n\nBesides, people appreciate the performative effort, even if shushing or whatever doesn’t actually work.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 121,
                      "content": "This might be a controversial approach but the strategy that worked for us was: 1. Dose of Tylenol or Advil to prevent the ear pain. 2. Giving them little toys or activities they had never seen over the course of the flight. 3. Lots of snacks and a little bit of candy for bribery.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Nobody is blaming the babies. It’s the parents who choose to torment hundreds of people as well as their own child, needlessly.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Most people don't get mad if you are legitimately trying with your toddler or baby.\n\nTalk to your pediatrician though, they may give you some advice on giving her something to make her sleepy to help.  My friend had to do that with her toddler and it worked like a charm.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Run their assess ragged before getting on the plane. There are long walkways. Do Not Get on the plane first. Not enough room for baggage? It goes below! Give the baby a bottle or breast feed during take offs and landings. Toddler’s feed them snacks to help their little ears adjust. I took a long flight with my four month old.  One of the stewardess held her for an hour and shooed me back to my seat when I checked in on her. I finally relaxed for a bit and it helped all of us. Thinking about how stressful flying has gotten, I am super grateful for her generosity.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Total non-parent question here: can’t you just drug the kids? Get some sort of sedative from your family doctor specifically to help the tyke get through the flight without issue? Hell when I was young doc used to give my mom a sedative to give me before going to dentists because of how much a AH I was without. 🤷‍♂️\n\nI’m sure uptight mums everywhere would want to report such, but if it’s from your kids doctor then those people can fk right off!\n\nHell I had an aunt who would give her kids, and me, a spoonful of NyQuil at bedtime so we’d go tf to sleep, no harm was done and everyone had a restful night!",
                      "id": 54,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I don’t necessarily see it as the parents being assholes, because sometimes, flying is the only reasonable way to get somewhere. It’s unreasonable to expect someone to drive from California to Maine to see their dying grandma because they have a baby, for example. (Not to mention, it’s a lot more dangerous.) When you go in public, you’re in public, and the public includes babies. Babies cry, it’s what they do, and their only way to communicate. Someone’s baby crying doesn’t make anyone an asshole.",
                  "id": 55,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "I flew for HOURS with a dog at the feet of the person beside me before I noticed it just because she reached down to pet the dog. I don’t actually mind babies/kids on planes but dogs are definitely easier.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Imagine how embarrassing it would be if they were on the same flight and the dog slept while the baby screamed. \n\nThe last flight I was one a woman boarded with her small dog. It was very cute. We were standing next to each other at the baggage claim and we’re chatting. The dog apparently got anxious on flight so the vet prescribed  a mild sedative. She also made sure to remove water an food before the flight so it wouldn’t have to go. \n\nMeanwhile there was a toddler several rows back whose screams were heard throughout the plane. I’d given the choice I’d rather be sat next to a pet than a kid.",
              "id": 57,
              "comments": [
                {
                  "score": 11,
                  "content": "I fly with my service dog. She just lays at my feet and sleeps…. Unless there’s a screaming kid, which keeps her awake. Lol",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "This is very, very true.  Some people are excited to see a dog on a flight.  But a baby … nope.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Just flew today with my two young kids, and I can confirm that my dog would have been much more pleasant",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "My mom still doesn’t let me live it down that I threw up on some woman’s expensive ass shoes the first time I flew as a baby. \n\nMeanwhile most of the time that I fly with my dog, half the people around me say “I didn’t realize there was a dog was right there!” as we’re deplaning.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Just throwing in here here that hating children on a plane got their song, dogs hasn’t https://youtu.be/GbfeH6Q8PzY.",
              "id": 62,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "There is a reason why I have my noise cancelling headphones always charged for flights. I do not want to hear crying babies anywhere near me.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1104,
          "content": "“It’s too friendly for me” got me, like what? And he doesn’t want the dog around his kid, for what reason exactly? YTA",
          "id": 64,
          "comments": [
            {
              "score": 654,
              "content": "That sentence gave off dog hater  vibes and 🚩🚩🚩",
              "id": 65,
              "comments": [
                {
                  "score": 356,
                  "content": "I have a really hard time trusting people who don't like dogs. I have most often found them to be incredibly self centered, and just yucky in general, lol.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 230,
                      "content": "i used to think that then one day it clicked that most of my friends who \"dont mind/like dogs but...\" are neurodivergent. the issue is sensory. i asked each person when i made the connection, most of them said they don't want to be licked, or don't like when dogs jump at them (even if friendly, non-aggressive) or some other reason which was pretty sensible. im nd as well but ive loved dogs all my life so it's not a generalisation i can make, i mean i have other weird sensory issues so 🤷‍♀️ it does help me understand that not all people who don't like dogs are mean/uncaring/etc.\n\ni wanna say Y T A about OP but I'm biased. as the dog mum person who would bring my dog anywhere im allowed. don't think i can make an objective judgement here 😂",
                      "id": 67,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 170,
                      "content": "> I have most often found them to be incredibly self centred and just yucky in general \n\n\nLol imagine saying that about other people because they don’t share your taste in pets. Sounds like a lot of projection.",
                      "id": 68,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 39,
                      "content": "It's okay, non-dog people see dog people the exact same way. Most people I meet who actually say shit like \"I don't trust people who don't like dogs\" are dog-obsessed misanthropists who would forsake their fellow human for a dog in a burning building. Creeps me the fuck out. So rest assured, us \"self-centered\" and \"yucky\" non-dog people don't like you either.",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 27,
                      "content": "Should we say the same about people who say they don't like kids? Should we call them selfish too?",
                      "id": 70,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "I am not dog person because idiots like my brother gets one, and never trains or disciplines hm to the point he becomes a menance. Who gave you the right  to judge? Many People shouldn''t own one.",
                      "id": 71,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "Dogs can be scary, ESPECIALLY if you don't know them. \n\nI love dogs once I know they are approachable and the owner agrees to me petting them, but I go solo hiking a lot - and the amount of times an off leash dog stops and stares at me, and maybe even barks (maybe I give off a weird vibe... maybe they know I'm scared of dogs that I don't know?)... it's really uncomfortable. I stop hiking immediately and wait for the dog owner to come into view, so that the dog doesn't think I am trying to approach/attack them. [I'm not a tall guy, I'm an average-height woman]\n\nI grew up a dog person. But after I got into being more outdoorsy, I am much more of a cat person than a dog person, solely from all the shitty dogs [basically shitty dog-owners] that are out there. Dogs can be trained to not be terrible, but dog-lovers sometimes forget that when they decide to own a dog.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Glad to see you would have trusted hitler.",
                      "id": 73,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "Yeah, this thread was in desperate need of a genuine AH, and as if by magic you made yourself known.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "\"I have a hard time trusting people who don't like reptiles and cats, because I love reptiles and cats so everyone should. If you don't like them, you're literally Hitler.\"  /s\n\nDo you see how ridiculous that sounds?\n\nReptile people and cat people in general, it seems, don't care much if someone doesn't like their preferred pets. To each their own. As long as they're not harming animals, what's the big deal? We certainly aren't going around slamming people if they prefer dogs.",
                      "id": 75,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "When I was 5, I was chased up a tree by 3 dobermans. I was stuck there for 3 hours until police and animal control were able to capture them. I don't like big dogs now. I have this fear of being bitten or attacked. I had a bad experience with my neighbors dog 2 years ago as well. Why does this make me self-centered and yucky?",
                      "id": 76,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 133,
              "content": "“ Too friendly for me” means the dog is always in your face, begging for food and/or attention, and has no respect for boundaries. Not everyone likes interacting with dogs, some people just can’t comprehend that. That said, they should be able to compromise, they don’t have to be around each other 24/7 the whole time, and maybe the brother can keep his dog from being a nuisance. The same for the sister with the child, keep her child occupied and close by. NTA for not wanting to deal with a dog tho. If they can’t compromise, then they’re both being TA.",
              "id": 77,
              "comments": [
                {
                  "score": 37,
                  "content": "OP specified that the dog is well behaved.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "I am curious what OP meant by that. I dated someone before my husband that had a Yorkie mix at their family home. I couldn't stand it because it would constantly be in your face, trying to lick your face. Or, it would be constantly licking your hands. I would try to correct it, ignore it, move places and this thing would not give up. The family just said, \"Oh, he just wuvs you and is super friendly\" when in reality it was a small dog that could barely do the sit command. A good chunk of people seem to have different standards for training (or lack thereof) for small dogs.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Their is such a thing as too friendly. Licking, jumping on people etc.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I can see where he's coming from if the too friendly dog jumps on every human it comes into contact with, then his brother does nothing about it, assuming everyone must love his dog. Or jumps on the couch to lay right up against anyone, pushes it's snout under people's hands in effort to get said person to pet them. Or the worst - The dogs who sniff everyone's crotch... My in laws have 3 standard poodles, one of whom always does that & it makes me crazy. I'm not an animal person, but tolerate my sister bringing her dog when both of our families come to visit our mom, all staying in the same house. Her dog has the most obnoxious high pitched bark, barks constantly, pees on the floor, begs by the table non-stop...you all know the type I'm sure. With that being said, while I would need more info about the dogs behaviors, particularly towards young children, I get where he's coming from about dogs being too friendly.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I interpret that as the dog is constantly wanting attention from anyone and everyone and gets all up in your business.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Kid gets scared, swats dog, dog bites...\n\nI adore my westie, but small kids, yeah, I'd be really careful with that.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I took “friendly” here as licking and jumping. For a small child, this can be very scary because they don’t understand why it’s happening, they don’t have any control and they might be the same size or bigger than them. \n\nMy kid avoided my aunts dogs and refused to visit my aunt bc she was so scared. When she got a bit older, she was able to tell the dogs NO, OFF to stop the behavior.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "It always amazes me how people will say things like don't ever touch a baby without asking, wash your hands before touching baby, etc. But then have no problem with an overly friendly dog who could get excited and lick babies face or jump on the baby while sleeping, etc.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "People are allowed to not like dogs being in their face which is likely what OP meant kindly when he said he was too friendly. And kids are small. Even a small, well behaved dog who is “friendly” can be very overwhelming for a small child. And the kiddo is 18 months so walking. \n\nKiddo and dog should be supervised yes. But that means extra work for the parents cuz bro is likely going to assume his dog has the right to walk around wherever. And he does, but so does the kid within reason. \n\nIt’s a big ask honestly. I like dogs, I LOVE my dog. But I very much understand that isn’t universal. I have a really hard time with my neighbors dog and my 2 year old. She’s fine with all dogs but this one because dog is small and friendly ie right at her level and in her face. \n\nIt’s not a nice visit when I have to spend the whole time with her in my arms instead of letting her walk around. \n\nI think this post will devolve into “kids or dogs” but at the end of the day, this is a family vacation. The dog is bro’s family; but no one else’s. The kid is everyone’s family. It doesn’t matter *what* you like more. Sometimes there is a hierarchy.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 694,
          "content": "Yup.  Usually when someone, like the OP, has such strong opinions against something, it's hard to take it a bit seriously and without thinking they are TA if they don't have at least one option offering some sort of compromise for the other person or parties involved.",
          "id": 87,
          "comments": [
            {
              "score": 10,
              "content": "They have a compromise.  They are choosing not to go.  Not forcing anybody else to cancel.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 347,
          "content": "And that's why he doesn't want the dog to come along.  He wants the baby to have all the attention.\n\nEdit:  Gender fixed.",
          "id": 89,
          "comments": [
            {
              "score": 86,
              "content": "I think you hit the nail on the head!",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "OP is a man.",
              "id": 91,
              "comments": [
                {
                  "score": 12,
                  "content": "So *he* wants the kid to have all the attention.",
                  "id": 92,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Nothing in his post suggests that, sometimes it really is as simple as not liking dogs.",
              "id": 93,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "He.  It's a dude",
              "id": 94,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Really don't think that's the case. It's a new dad who's probably already overwhelmed with parenthood and doesn't want to spend a whole week trying to parent with someones barking dog",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 216,
          "content": "As a parent, your brother is right. Kids are more annoying than dogs. Lol",
          "id": 96,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 171,
          "content": "As both a dog and kid haver - The accuracy is right on.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 128,
          "content": "But the dog is TOO FRIENDLY for OP! /s",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 105,
          "content": "There it is. Perfect answer. We can close the topic.",
          "id": 99,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 13910,
      "content": "YTA - and his statement \"He says my 18 month old will be far more annoying and loud than his dog.\" Is ABSOLUTELY true. \n\nPerhaps an unpopular opinion, but 'family' isn't defined solely by squirting out an infant or having shared the same space pre-birth. He has told you that his dog is a non-negotiable, and I assume that your toddler is a non-negotiable. You hate dogs, he might hate kids. Neither is more or less valid. \n\nYour ideas are not compatible - but I'm calling you the a-hole because you believe your position is superior rather than just different.",
      "id": 100,
      "comments": [
        {
          "score": 3005,
          "content": "This. Having a kid doesn’t make someone more important, or their reasons more valid.   Family is what a person decides it is for themselves. \n\nI’ve been on holidays with family/ friends with both dogs and kids of all ages and sizes, and the brother’s statement is correct. The dogs were 100% better behaved, quieter, and easier to deal with than any of the kids.",
          "id": 101,
          "comments": [
            {
              "score": 2103,
              "content": "Uccchhh, imagine going on \"vacation\" with an 18 month old baby. No thank you.",
              "id": 102,
              "comments": [
                {
                  "score": 1102,
                  "content": "Vacation with a toddler (or pre schooler) is just parenting in a different location, without access to their normal things, without access to your normal help (daycare, baby sitters, whatever), on a blown up routine that makes them miserable. In short, it is hell on earth.\n\nSource: I’ve tried multiple vacations with my now 4 year old and have hated it by day 4. Love her, but I don’t wanna vacation with her.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 278,
                      "content": "My niece's third birthday was held at a water park and I played with her for two hours while her exhausted mom did cannonballs and her dad entertained the rest of the family. Toddlers are a LOT. I handed her over to Grandma after I did my fair share (which was very fun because I love my niece) and said \"I'm tapping out and joining Mom on the diving board.\" You can't \"vacation\" with a youngster.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "My eldest was…a lot as a toddler. I didn’t even attempt to take a “family vacation” until my kids were well into their teens. It worked out well, they were psyched because they had never been on a proper vacation, they got to help choose where to go, and they planned a few of their own activities to do while the husband and I did things they had no interest in. Kids are in their late 20’s now, one lives 14 hours away, and we still happily get together once a year to go somewhere and have fun.",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "All of this!   \nI spent 2 miserable weeks on \"vacation\" with my unmedicated ADHD 4 year old (he was tested, evaluated and they were reviewing all of that data while we were on vacation. 3 days after we got back we had the results and medication.) It was hell. I wanted to literally drown myself in the ocean. I called the psych that did his eval WHILE SITTING NEXT TO THE BEACH BASICALLY IN TEARS to let them know what had been going on. \n\nparenting in a different zip code fucking sucks.\n\nWe are going on vacation in a week and honestly im nervous as hell. I want him to have a good time but i seriously am scared it will be a repeat of last year.\n\nI did take him at 12 mos old to florida. that was cake. we just had shaded areas to nap and just created a schedule based on his. for a non parent its definitely an inconvenience if they tag along to whatever youre doing but id personally expect them to go do their own thing.\n\nYTA for thinking the kid will be better than a dog. \n\n\\-signed a not dog person.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I moved overseas when my child was 4 and went on a ton of \"vacations\" with her and without her around that age as a result. You're absolutely right.\n\nBut it does get better. I promise.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Lol we just went on a 4 day trip with our almost 3 year old and I'm still recovering a week later. He's great fun but it was certainly not a vacation for us.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 6,
                      "content": "They are certainly a handful! Not relaxing at all!",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "My friends with kids always say that traveling with young kids is never a vacation. It’s a trip, but not a vacation.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Worst decision I've made in the past few years was taking my then 18-month-old twins to Disneyland. It will be free for them and they'll have fun, thought this particular idiot. We managed to get them one ride in two days, they screamed for over an hour at nighttime because the hotel room was unfamiliar, and they were constantly trying to wander off into the massive crowds in the parks. Absolute nightmare for me and their mom, the kids, and the folks around us.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I went to a restaurant with family that had an 18 month old baby and even that was a chore.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "[deleted]",
              "id": 113,
              "comments": [
                {
                  "score": 3,
                  "content": "Bring back these times! There are so many kid friendly places these days, there should be protected adult places. \nI remember kids not being allowed in bars, some restaurants or certain spaces in hotels.  \n\nI was in a coffee shop (not set up for kids) with friends the other day and two women with 3 kids under 4 came in, there’s a kid friendly place two minutes away, but they didn’t want to deal with other screaming kids! Well, their kids were screaming, climbing under people’s tables, running around - just a nightmare.  They weren’t happy to be told their kids had to sit down & be quiet!",
                  "id": 114,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 404,
          "content": "I am particularly confused about OP's apparent loathing for dogs on planes. I mean, I absolutely understand having a problem with badly-behaved dogs (or other animals) on planes (and I adore dogs, most especially my three pups), but it's pretty rare for a dog to spend an entire flight howling and barking, whereas babies... are perhaps rather less likely to be quiet on a plane. Infants, in fact, are probably the least disruptive on a plane; they can't move about under their own steam, don't kick seats, and sleep a lot. Toddlers (which is what OP has) *can* move around *and will want to*, will probably protest (vocally, and possibly loudly) at being restricted to a seat the whole time, and are likely to do things like kick the seat in front of them. \n\nAlso, OP complains about \"tentatively\" taking the same flight. How is that even worth complaining about? Schedule yourselves on different flights – or book tickets on the same flights, but just don't sit next to each other.",
          "id": 115,
          "comments": [
            {
              "score": 315,
              "content": "does OP realize there might be a dog on the plane regardless of his brother's presence? you dont get to control everyone on the plane lol",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 164,
              "content": "[deleted]",
              "id": 117,
              "comments": [
                {
                  "score": 20,
                  "content": "For real. Any time I fly if I see an animal it makes me smile and I want to meet it. If I see toddlers I know we’re all in for a rough flight.",
                  "id": 118,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "Most pets get put in cargo.",
                  "id": 119,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "I've heard a couple cats meow towards the end of long flights.  One got loose.  That said I have lost track of how many babies have made entire flights miserable.\n\nPets tend to get drugged before they go on planes.  Babies not so much.",
                  "id": 120,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "I heard a cat softly yowling intermittently one time. I didn’t know there was or could be a cat on the plane. I was struggling with panic at the time (bad flyer) and I was so confused.",
                  "id": 121,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Exactly, I was so confused over why he despises dogs on planes; usually I don’t even realize there WAS an animal on the plane until I see them as I’m de-boarding! (Then I’m sad I didn’t get to doggie talk at them and admire lol)",
                  "id": 122,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Right? Also, no one’s asking him to take the dog. The dog will be with his brother. He has to do literally zero for this dog. It’s his brothers luggage. I’m so so so confused.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "I cant tell if \"Squirting out a baby\" is more gross of funny.",
          "id": 124,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Translation: “I’m afraid the dog will divert attention away from me and my kid”",
          "id": 125,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7888,
      "content": "NAH though I think this is a really weird hill to die on since the dog is admittedly small, well behaved, and non-aggressive. \n\nAlso as others have pointed out: this vacation is 100% going to revolve around your toddler, not the dog. Honestly, I'd rather vacation with a small dog in the house than an 18-month-old  (and no, I don't hate kids, I have one, which is why I know a \"vacation\" with a toddler isn't particularly easy or relaxing).",
      "id": 126,
      "comments": [
        {
          "score": 1998,
          "content": "Friend once said it’s a trip with the kids and only a vacation without them. Been using that ever since.",
          "id": 127,
          "comments": [
            {
              "score": 761,
              "content": "I call it “parenting in a different location.”",
              "id": 128,
              "comments": [
                {
                  "score": 191,
                  "content": "Later this month we're trying a wolf lodge place with good friends whose child is the same age as, and good friends with, our child. The kids are 4 and the goal is to take turns baby sitting for each other so the other couple can actually enjoy themselves some of the time. Wish us luck!",
                  "id": 129,
                  "comments": [
                    {
                      "score": 32,
                      "content": "We did the same thing with some friends and their kids last summer. It mostly worked out well!",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I *just* did the wolf lodge with my 3.5 year old! He absolutely loved the water park! I. was. drained. Thank god my husband was willing to continue the water park with him when I wanted to tap out. Magic Quest is cute- we just did the light up/noise and not the full quest since he’s not really old enough.",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Good luck!  I hope it works out and that you all get some vacation time in with your trip!",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "My parents started taking my nephew (their grandsons) when they both turned four. They're cousins who are three months apart in age. My brothers were not invited, even if they paid for themselves, because these were trips to bond with their grandsons. My parents took me along to be the babysitter so they could go out for a couple of nights without their grandsons. This worked great. Preschoolers and babies are exhausting and it isn't appropriate to take them to some restaurants where grown-ups go. When we were all older, the whole family took a couple of trips together. My brothers, both divorced by then, wanted to do things that weren't age appropriate for my nephews. Think cliff-diving, etc. They assumed my parents or I would take care of their sons. My parents informed them that parents get a vacation from work and home, but not from parenting. A dog can be left at home at a doggie hotel or with a petsitter but it's nuts to think the dog is going to be harder to care for than a baby. They're likely to find more restaurants that are dog friendly than kid friendly. \n\nOP, YTA.",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "\"parenting in a different zip code\" \n\ni came back from my 2 weeks on vaca last year and said that in an exhausted voice and my coworkers all understood lol",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Obli-cation versus vacation (obligation - get it 😉)",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Oh man that’s spot on, I’ll be stealing that thanks",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 189,
          "content": "I love my cousin's kids to death but yeah, vacation with them is not a vacation. Maybe in a few years when they're in their early teens, yeah, it'll be relaxing, but right now? It's not, and I'm not even in the same house when we're on vacation together! I'd much rather a small friendly dog (and I'm allergic to dogs!).",
          "id": 137,
          "comments": [
            {
              "score": 3,
              "content": "Them being in their young teens won’t be enough either, because at that point their hormones will be on 110% and the attitudes will be atrocious lmao late teens you might start getting to a sense of relaxation lmao",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "This is the answer. OP isn't an AH for not going, he can draw that boundary of he wants. \n\nHe _is_ being incredibly annoying IMO. The brother is definitely not TA.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I'm gonna cast my vote for the NAH camp. I truly do not understand the objection to the dog. A young child would suck up the time and attention far more than a dog. And I think your brother is correctly perceiving that you do not value or respect his attachment to his dog. \n\nHowever you are not demanding the dog not come or taking actions to jeopardize anyone else's vacation. It seems reasonable to decline to go if you feel this strongly about this.\n\n If there is still time, however , you might want to reconsider why you feel so strongly about this and if a more generous and tolerant attitude would be better for all concerned,  including yourself.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Same though.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Man not that I was ever naive enough to think parenting was easy, but now being in the age bracket where a lot of friends are starting families... I just have respect for new parents if they can act anywhere above nodding off heroin addict and under crackhead.    If they can act normal whatsoever, they have my utmost respect.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "We complain about well behaved dogs on trips, it’s acceptable. But when we complain about absolute dinosaur-toddlers in their terrible twos, we’ll definitely be the AHs. 😂\n\nDon’t get me wrong, I also said NTA, I just find the comparison funny.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3847,
      "content": "NAH.\n\nYou don't want to spend time with a dog. Your brother doesn't want to go on vacation without his dog. Neither of you is wrong, but your vacation desires aren't compatible. Sounds like your \"family vacation\" plans don't really work any more.",
      "id": 144,
      "comments": [
        {
          "score": 569,
          "content": "I agree may be time to have separate accommodations. What worked when everyone was child and dog free doesn’t work anymore.",
          "id": 145,
          "comments": [
            {
              "score": 35,
              "content": "I feel like this should just be more common in general. I'm super tight with my family...and after a certain amount of time, a separate house (or hotel room, whatnot) still sounds way better",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 242,
          "content": "Agree, NAH. Different priorities for you all and bro now. If you’re not going to enjoy yourself, don’t go. End of story. This is your line in the sand.",
          "id": 147,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "I'm surprised this comment is so far down. It's not wrong for the brother to want to bring his dog, but also, some people just don't like dogs and don't want to stay in a house with one. They just have incompatible needs/desires, and the only solution that make sense are to either not go on the vacation or to stay in different places. Which is exactly what OP is doing. Do people think he should force himself to go on a vacation he won't enjoy?",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "This. It's probably too late, but how about two separate but closeby places on the beach?",
          "id": 149,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "Completely agree with this NAH",
          "id": 150,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3004,
      "content": "**YTA.**\n\nTake a step back and look at the situation. You're considering pulling out of a cross-country family vacation because your brother is bringing a small dog. Your brother is most likely correct in that your child will probably be more of a hassle than his dog. Your Brother is your brother and your parents are in their 50s. Going every other year, how many more of these vacations do you think you all have left together? But, I will relinquish that it is your family and your vacation so you have every right to do whatever you want.",
      "id": 151,
      "comments": [
        {
          "score": 1912,
          "content": "And lets be honest id rather have a dog on plane than a kid.",
          "id": 152,
          "comments": [
            {
              "score": 1217,
              "content": "Yep. Dog > kids\n\nI have a 5 year old and a 18 month old. I would even go as far to say I would rather travel with a random dog instead of my children.",
              "id": 153,
              "comments": [
                {
                  "score": 152,
                  "content": "I thought a red eye to the east coast would be easier with my 4 year old. \n\nI was wrong.",
                  "id": 154,
                  "comments": [
                    {
                      "score": 178,
                      "content": "Yeah dude. I’ve had offers to go to Tahoe, Costa Rica, freaking Cabo, hell no. I am not traveling with these twats until they are at least 4 years older. \n\nAnnnd they aren’t that bad either. But I know they will be when confined to a seat.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Lol. We all think that until we do it. And learn the hard way.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Same!  Definitely wasn’t one of my better ideas.",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I would pay extra to travel with a random dog",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Yep! I love my son to the end of the world and back, but traveling with him? It's work, NOT a vacation!",
                  "id": 159,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I joke to my friends with kids that, hey! There’s always Benadryl!",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 209,
              "content": "Literally 100%",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 100,
              "content": "Definitely 100%, no contest.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 97,
              "content": "Piggybacking to say I also would way more prefer a dog on a plane to a baby. I like keeping my eardrums intact.",
              "id": 163,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "Yeah, dogs usually fly in cargo- pretty sure it’s frowned on to put the kid in there…",
              "id": 164,
              "comments": [
                {
                  "score": 28,
                  "content": "Small dogs can fly in cabin. Yes, larger dogs can fly in cargo but there are nightmare stories of dogs being lost or dying. I'm moving abroad this summer and have a German Shepherd. I'm actually going with a group of people who also don't want their dog fly cargo and we come together to rent a private jet. Win/win.",
                  "id": 165,
                  "comments": [
                    {
                      "score": 5,
                      "content": "That’s a really great way to do it!  Hope you have a safe trip.",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Which is very unfortunate if you ask me",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "OMG, so true! If I were seated next to a little terrier on a flight, I’d have the best flight ever. But whenever I get seated next to a baby I wonder what I did to deserve such a cruel fate. \n\nNo joke, a dad once tried to hand me a dirty diaper on a plane!",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I once brought my 25 lb dog on the plane and after we shut the doors there was a conversation between flight attendants at the front and they were like “does a passenger have a dog on this plane and can you hit the button?” And everyone acted like I portaled him in when he’s just so chill that they didn’t look down to see him come on and he was already half asleep under the seat. Even the passengers across the aisle and behind me were surprised. If she flies semi regularly she’s 100% also been on a flight with a dog. Does she think they get loose and spend the whole flight tearing around the plane while Benny Hill music plays? (Adding that they asked because I checked him in at the special services counter so there must’ve been a note, I’m not as asshole sneaking dogs on planes LOL)",
              "id": 169,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "That’s what made me double take here. OP states difficulties in traveling on a plane with a dog… when he is going to be traveling on a plane with a baby!! \n\nI don’t understand how unaware OP is at this point. Can’t compute.\n\n (YTA OP because everyone is willing to put up with your kid without a word but you can’t grow up about the admittedly well-behaved dog).",
              "id": 170,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "I’ve definitely seen my share of terribly trained dogs in public, but it does seem that on planes the vast majority of pets are better behaved than kids (and that’s not the kid’s fault per se - the baby didn’t ask to go on the flight, and it’s probably no happier than the passengers who have to deal with it).",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Lol for sure. Op says 'i despise dogs on planes\". Ok...why? I've never been on a plane where a dog simply wouldn't stop barking. Never even heard of that issue. Babies crying though? All the god damn time. \n\nShe's trying to send a message that she doesn't approve of the brother being happy with his dog and she wants to get others on her side by threatening not to come. Real sad shit on ops part.",
              "id": 172,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 118,
          "content": "Didn't realize that 50 was knocking on heaven's door.",
          "id": 173,
          "comments": [
            {
              "score": 29,
              "content": ">your parents are in their 50s. Going every other year, how many more of these vacations do you think you all have left together?\n\nI don't think they were saying late 50s is next to death.  But doing the math for my family I would have gotten 5 more trips, max.  I'd deal with 100 rowdy dogs and babies to take another vacation with my mom.\n\nOur time with loved ones is limited and we never know how much we have.  If OP doesn't want to deal with a dog fine, but it's fair to point out what they're giving up.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I have a morbid habit of calculating the amount of remaining “moments” I have with family. Nothing is guaranteed, and as parents age you have obviously less and less time with them. What a stupid hill to die on.",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "See I agree with you completely, but i think that makes this NAH. Is it the hill he wants to die on? Probably shouldn't be that hill. But if it is, then I can't say he's bad for pulling out.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "He should step back and read his post out loud.",
          "id": 177,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1909,
      "content": "[deleted]",
      "id": 178,
      "comments": [
        {
          "score": 913,
          "content": "I do not know why you’re in the minority with this. We’ve had countless threads where people are in agreement with you about dogs and babies in terms of safety! \n\n18mo is prime mobile tornado in child time and this will be an unfamiliar dog in an unfamiliar environment. I’m frankly unsure what choice I’d personally make but as OP is *choosing not to go* and not, IDK, demanding anyone else do anything? NAH.",
          "id": 179,
          "comments": [
            {
              "score": 242,
              "content": ">I do not know why you’re in the minority with this.\n\nIt's just reddit, who hate children for some unfathomable reason. \n\nAlso, OP is NTA.",
              "id": 180,
              "comments": [
                {
                  "score": 4,
                  "content": "And because \"dog people\" are practically a cult. I love dogs, but they are not the same thing as a child and don't get to go everywhere you do.",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 190,
              "content": "Because 99% of the time, this sub is pro-dog and anti-child.",
              "id": 182,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Reddit hates children and mothers. \n\nThe people harping on the fact that it's a \"small\" dog as if it makes it harmless are idiots. The child is small too, and at an age where they're walking and getting into things. Recipe for disaster imo",
              "id": 183,
              "comments": [
                {
                  "score": 3,
                  "content": "Totally agree. Some small dogs can be VERY bitey. I’m not saying this one is because I don’t know either way, but I’m saying I understand the concern.\nFWIW, my grandfather got bit in the face by a “small” terrier as a child. \n\nIt also sounds like a ton of folks here straight up don’t like people who aren’t dog people. (I love dogs but if you’re not a dog person you’re not.)",
                  "id": 184,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 675,
          "content": "My eyes are bugging out of my head reading some of these comments saying this is a great opportunity for toddler and dog to get used to each other. Sounds like a prime time for that child to get bitten by a stressed-out dog to me.",
          "id": 185,
          "comments": [
            {
              "score": 251,
              "content": "[removed]",
              "id": 186,
              "comments": [
                {
                  "score": 177,
                  "content": "Some of these people here genuinely sound unhinged. It's great OPs brother has a dog he loves but that dog is not a person.",
                  "id": 187,
                  "comments": [
                    {
                      "score": 130,
                      "content": "I was going into this thread fully expecting popcorn because of the animal=angel and child=devil attitude everyone seems to have on Reddit. You can't leave a child behind, especially that age. That would be SO difficult to get a sitter to accurately meet their needs. They're a human being and ARE family. I do not understand people saying \"they aren't family just cause you squeezed them out\" wtf. This is a safety concern for absolute sure with a dog out of its element and a baby. And yes OP is 100% nta for opting out of the trip instead of making demands about what the brother does.",
                      "id": 188,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 92,
                      "content": "Why is this so hard for some people to understand? Yes I get people treating their pets as family, but an animal does not nor should it, trump a person. This 18 month old might be a nibbling, so not the same as having your own child, but they should still take precedence over a dog . A dog that for all intents and purposes the owner CANNOT vouch for, in term of a lengthy stay in a foreign environment, nor temperament around young children.",
                      "id": 189,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Yeah I’m just confused as to how people are missing the basic logic. \n\nThe kid is family to everyone on this family vacation. \n\nThe dog is family only to bro. \n\nDogs don’t go everywhere. That’s a fact you accept when you get a dog. \n\nWhen you have a child you accept that they must be integrated into society. There are few places they shouldn’t go.",
                      "id": 190,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "I'm literally childfree and I still can't stand almost anyone in this thread. In what universe is OP the asshole? He's literally just choosing not to put himself in a situation he's not comfortable in.",
                  "id": 191,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I also bet that the grandparents would be a lot more bummed out about not seeing their grandkid over not seeing their son’s dog lol. Literally no sane grandparents think the two are on the same level. If having both could be unsafe FOR BOTH of them, most families would pick the baby. God knows how long the grandparents still have with them, on their death bed they’re never gonna think « Dan I’m sure glad I saw more of that dog than of my grandchild lol ». I bet they’re not pick sides simply cause they don’t want to upset the brother.",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "The other thing is that- the only thing that's worse than your child getting injured, is your child getting injured in an unfamiliar place. Aka at home we have our pediatrician, we know where the hospital is, where the urgent care is. Being on a vacation and scrambling to find Healthcare sounds like a nightmare",
              "id": 193,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 332,
          "content": "I wish more dog trainers were like you. \n\nI loved my dogs for the 16 years they were in my life, but 100%, dogs are not to be left with young kids unsupervised, and nobody should ever assume they are friendly with kids - especially in stressful environments. It sets the dog up to fail and puts the child at risk of injury or death.",
          "id": 194,
          "comments": [
            {
              "score": 3,
              "content": "Especially since kids don't know how to interact with animals- they might step on their tail or pull their hair or something, not something the dog is used to putting up with",
              "id": 195,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 237,
          "content": "I really thought I was losing it going through this thread and reading the replies here",
          "id": 196,
          "comments": [
            {
              "score": 108,
              "content": "I cannot even with AITA these days. This thread is bonkers.",
              "id": 197,
              "comments": [
                {
                  "score": 62,
                  "content": "You say one tiny thing agianst dogs and the entirety of aita will get ready to slaughter you",
                  "id": 198,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Sometimes I wonder if these people have ever interacted with another human being outside their parents basement",
                      "id": 199,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "I’m with you on this one. Feels like I’m taking crazy pills.",
              "id": 200,
              "comments": [
                {
                  "score": 2,
                  "content": "It’s a dog on vacation! No not your dog…yes there are perfectly wonderful places to put your dog up for a week, no it doesn’t know your toddler but who cares! \n\nAlso I WILL say that the brother has a point, toddlers are annoying on vacation but no your dog and your nibbling are not the same thing FFS. \n\nBut I do think it’s a valid choice for either of them to bow out - don’t want to deal with the dog, don’t go! Don’t want to vacation with a toddler, also a perfectly reasonable choice.",
                  "id": 201,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 200,
          "content": "This needs more upvotes.",
          "id": 202,
          "comments": [
            {
              "score": 261,
              "content": "Yeah this should be the top comment, not one from the child haters who decided to come out in droves for this post.",
              "id": 203,
              "comments": [
                {
                  "score": 180,
                  "content": "Truly.\n\nI am both an animal lover and a parent. The immaturity on this thread is a reminder that Reddit is full of youngsters.",
                  "id": 204,
                  "comments": [
                    {
                      "score": 3,
                      "content": "They’re immature youngsters because they disagree with your views? \n\nReal mature.",
                      "id": 205,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 21,
                  "content": "I am both a child hater and dog hater. Both are fine for a couple of hours, but I could not live with either. The invasion of my personal space is not cute.\n\nBut, I'm not surprised most dog people care about the dog more than anything. Glad the dog trainer is very cognizant of how dogs can behave and doesn't force their dogs on people who might be uncomfortable.",
                  "id": 206,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I’ve been trying to upvote it repeatedly and it keeps failing. Any advice? (I’m old)",
              "id": 207,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 129,
          "content": "Finally, some fucking sanity.",
          "id": 208,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 126,
          "content": "> Also, your brother has no idea how his terrier will interact with your child when in a new environment for a week. Any change in routine is stressful for a dog. BABIES can especially be stressful for a dog. It’s a recipe for disaster. \n\nYep, the first thing I thought of. My mother was a HS biology teacher and had a lot of \"fun\" facts about dogs & cats to get her students to pay attention. Dogs are *VERY* unpredictable around children: **they only trust ADULTS.** Babies & kids smell different, they move different, they sound different and every effing organism on this effing planet has evolved to be wary of *different.* All it takes is for one odd move or sudden sound to trigger a dog's survival instincts and OP is rushing her infant to the ER. \n\nI think OP should give her parents a very simple test hypothetical: \"If that dog bites, snaps, barks or growls at my child, will you ask him to remove it from the rental house?\" Any answer other than \"Of course\" should be grounds to tell them: \"I'm sorry, but apparently my brother's weird relationship with this animal is more important than my effing child's *safety.* Have fun without us.\"\n\nThis needs to be nipped in the bud, pun entirely a happy accident. There will be future family gatherings and if boundaries aren't set now, OP is in for *years* of anxiety about it.",
          "id": 209,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 121,
          "content": "This 1000%. I’m a dog groomer and a mom to an 18 month old and who also has a dog, and even with my dog being pretty chill I’d never want to go cross country with him and my toddler, and he knows her and is comfortable with her. Travel is a lot on either of them and not worth the possible anxiety. Dogs even in their normal environment can have moments they snap, you never know what will set it off and I don’t blame OP at all.",
          "id": 210,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": "We had a dog that did not like kids at all. We also have the most loving tolerant old lab who just leaves when she’s done and the kids know to leave her alone when she does that. If this dog has never been around kids for an extended stressful time I would not trust it.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "You're the best dog person I've ever come across. Thank you for being a voice of reason.",
          "id": 212,
          "comments": [
            {
              "score": 55,
              "content": "If all dog people were like this I wouldn’t mind them so much.",
              "id": 213,
              "comments": [
                {
                  "score": 3,
                  "content": "Same.\nAnd i'm a dog owner.\n\n\nEdit to say that my small dog is a rescue and she just hates small children (and old men) with a passion. \nI don't have children and i don't live with children so of course that's not an issue when she's in, but you bet that i never leave her unsupervised and without a leash outside.\n\nI asked trainers and vets about how i could better her behaviour in the past years, but everyone is on the agreement that was/is too late for that (i rescued her when she was almost 7) because she's very emotional and she 100% hates them because of abuse spanned in years, which i later confirmed with one of the previous owners/monsters.\nTherefore I won't risk a child's life for social experiment, like i saw some other people do because \"it's not that big of a deal, my dog is a good boy/girl with everyone\".\n\nI'm okay with how we are, she's now 15 and she's living her best life.\n\nSome people really don't understand that you can't treat dogs like humans and you have to also follow rules to a dot to not have or cause problems. And that is okay to not be comfortable around dogs.",
                  "id": 214,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1070,
      "content": "NAH. \n>\nBut your brother is correct about a toddler being more “annoying” than a well behaved dog. \n>\nQ: Why don’t you want your toddler around a dog?",
      "id": 215,
      "comments": [
        {
          "score": 390,
          "content": "Brother shouldn’t want the toddler around his dog- kids are notoriously unpredictable and can get into a dog’s space while ignoring/not understanding the dog’s language.  I’ve seen kids go up to dogs and full on smack them.  It’s not cool, and parents usually laugh it off and think it’s no big deal until the dog decides to advocate for itself because it’s sick of the kid’s antics- and then suddenly the dog is vicious!",
          "id": 216,
          "comments": [
            {
              "score": 22,
              "content": "I second this.\n\nMy 2-year-old twins love our cat, they KNOW how we act around her, know what they are allowed to do and what they aren't, and still, being toddlers, one of them recently ran up to her and hugged her butt out of nowhere, the other kicked her when the cat came running because she heard her food being opened and my daughter got scared (yes, I scolded her, but picture the cat being half your size and think how you would react when she comes running towards you).\n\nThese are well-behaved children (my cat sits still for them to pet her, usually), and it's a rather calm cat. I'd still never leave either the cat with strange children without supervision and slow introduction, or the children with a strange cat or dog without the owner there!",
              "id": 217,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": ">Why don’t you want your toddler around a dog?\n\nHey, did you know dogs can be dangerous?",
          "id": 218,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "some dogs literally do not trust kids. in a lot of adoption descriptions it will say “not a good dog for families”. he has no idea how this small dog will react in a new environment, after a stressful plane ride and around his child who is almost eye level with the dog. there are TONS of horror stories of well loved, well behaved, good natured dogs suddenly snapping and brutally attacking children due to multiple factors. he might want his child to meet the dog eventually, but this absolutely does not seem to be the right setting for this.",
          "id": 219,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Because kids and dogs shouldn't be left unsupervised especially after traveling a dog can be overstimulated and a kid might just be too much.",
          "id": 220,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "18 months old may want to forever chase dog, pull tail, lock dog, squeeze dog, drink the dog's water, eat the dog's snacks, etc. In the case of my toddler I try to avoid little, cute, well-behaved dogs for the sake of the dog, not my kid ;) \n\nMany dogs are traumatized by small kids and in general the owners I have met are glad I keep my kid away xD\n\nNow, holidays with toddlers are stressful add to that having to keep the kid away from the dog all the time x____x sounds like hell to me.\n\nEdit: typo (wrote years old instead of month)",
          "id": 221,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1017,
      "content": "NAH. You have a baby, he has a dog. Dogs can be annoying on planes, babies can be annoying on planes. You don't want to do dog friendly activities, others may not want to do baby friendly activities. If he wants to bring his dog, that's fine. Lots of people take dogs to beach vacations. If you don't want to go, that's your choice. But sounds like a shame for what appears to have been a nice family tradition",
      "id": 222,
      "comments": [
        {
          "score": 195,
          "content": "Agree with this NAH judgment. I'm usually team baby when it comes to baby vs dog fights, but based on the info in this post, I'm inclined to believe the baby and the dog will be equally likely to be disruptive or a fun addition. My only caveat is don't trust the baby and the dog to interact without close supervision... but I'd say the same for baby + baby or dog + dog.",
          "id": 223,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Agree with the NAH judgement, although I'm not so sure that it's a shame to leave this particular family tradition in the past. It WAS a nice family tradition, four years ago when there was no baby, no dog, possibly the sister had no boyfriend or a different boyfriend, and so forth. The family makeup has changed considerably since the last family tradition vacation, and at this point no one really knows how the new dynamics will play out. Families change, dynamics change, and sometimes traditions have to give way to new ways of being together. I'm not sure a pricey VRBO on a beach, a plane ride from everyone's home, is the best way to find out whether the new dynamic will work as well as the old one did. Maybe a different get-together, closer to home, to test the waters first. Were I OP that's probably what I'd want to do, anyway.",
          "id": 224,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I literally have never in a platinum amount of annual miles been annoyed by a dog. A baby? Or a child? Yes.",
          "id": 225,
          "comments": [
            {
              "score": 6,
              "content": "Right? I'm confused about what experiences OP has had that made him \"hate dogs on planes.\" I rarely even notice when people have pets on planes because they have to keep them in their carriers.",
              "id": 226,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 726,
      "content": "NAH. It’s a fundamental incompatibility. If the trip isn’t what you want, you are not an asshole for not going.",
      "id": 227,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 721,
      "content": "NAH, you're allowed to dislike dogs, you're allowed to decide you don't want to be around them. But I do feel you need to look at this from a more varied angle. You're expecting your brother to make sacrifices and cater to you, but would never consider it the other way around. I love dogs, I love children! I have 2 dogs and am pregnant, I can understand the limitations that comes with both. That said, knowing the limitations both present to not only myself but other people on vacation with me. I can tell you that you're being judgemental and not acknowledging what people are giving up for you and your family, while getting annoyed at just the idea of the dog coming. Because vacationing with an 18 month old is much more restrictive and possibly stressful than a dog- especially to those that aren't responsible for them, as long as the dog is well behaved. Babies cannot be left alone, their only method of communication is crying, they  rely even more so on a schedule- and object loudly when it is broken. I would much rather be on an airplane with a dog than a baby, and honestly you're the first person I have ever heard say differently... Also if the dog is well behaved it's actually healthier for your child to occasionally be exposed to animals.",
      "id": 228,
      "comments": [
        {
          "score": 69,
          "content": "I’ve always kept my cats away from babies because of the way that babies and toddlers behave. They are loud, unpredictable and want to pull their tails. I protect my cats and I won’t let babies or toddlers in my house.",
          "id": 229,
          "comments": [
            {
              "score": 8,
              "content": "It takes trust and good parenting but whenever I have been around babies/toddlers/dogs the parents always remind the kids/dogs to be gentle.  Have never had issues with kids and dogs interacting but again. Both dog parent and baby parent make sure both sides understand to be gentle and they reiterate if anyone starts getting too excited.  The cats always just avoid and leave the room.",
              "id": 230,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I keep my dog away from children. Because I know if some kid gets too handsy with her and she ends up snapping at them, she'll be the one in trouble. So it's more for her protection.",
              "id": 231,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}