{
  "post content": "Hi, first time poster here. I (37F) lost my husband in 2014, it was very unexpected. We were together since high school and had a daughter (15F). \n\nIt took a long time to accept his death and move on but I did and I’ve been in a new relationship for three years now. My boyfriend (38M) is amazing and I love him, he gets along with my daughter super well which is obviously important to me. The drama is, we’ve recently been arguing about the fact I have a few photos of my late husband around the house. He said it makes him uncomfortable to constantly see the man I was married to. I have a table in the living room where I have a small memorial type thing, it has a bunch of photo frames of my late husband as well as candles. I came home from work two weeks ago and saw that my boyfriend took all of the photos off the table and stashed them in a drawer. It caused a massive argument. He told me he did it because it made him feel like a guest in his own home. I told him it’s fucked up to be insecure over a man who isn’t even alive but he believes his feelings are completely valid.\n\nMy late husband’s birthday is the 14th of February and every year I go to visit his grave with my daughter. But this year my boyfriend got irritated over it. He told me he wanted to spend the entire day with me but instead I went to “look at a gravestone.” Apparently I ruined Valentine’s day. I was FURIOUS. I asked him why suddenly has an issue with my late husband and he said it’s because he was planning on proposing to me but he can’t anymore because he believes I’m still caught up on my husband. I ended up calling him a c*nt and and he angrily left the house and hasn’t been back since. \n\nAm I the A-hole?",
  "id": 1,
  "comments": [
    {
      "score": 11736,
      "content": "NTA\n\nBut this boyfriend may not be the right person for you.\n\nToo many people treat a late spouse/partner as an \"ex.\"  And expect the survivor to \"move on\" as if they'd broken up with the late partner.\n\nYour late spouse will always have a place in your heart, and you need and deserve a new partner who can respect and honor that part of you.  \n\nAfter my parents divorced, my father, eventually, remarried, to a widow his own age, who had lost her first husband to cancer.  They wound up living together, in the house she and her first husband had bought and raised their children in, until my father could no longer live at home due to advancing dementia.  \n\nMy father always honored and respected her late husband's memory.  His family pictures, and newer pictures of the two of them and our blended families, were added to the pictures in her home, they never replaced or displaced the pictures she had with her first husband, and their children growing up.  My father chose a sapphire ring to propose with, so as not to seem to compete with the (very nice) diamond her first husband had proposed with. \n\nIf your boyfriend cannot live comfortably with your memories and connection to your late husband, he's not the right one.",
      "id": 2,
      "comments": [
        {
          "score": 1950,
          "content": "You put it so much more eloquently than I could’ve. Very much agreed on all points.\n\nNTA",
          "id": 3,
          "comments": [
            {
              "score": 1072,
              "content": "Same! NTA! And, he’s your daughter’s father, for crying out loud. He’s dead, what’s to be jealous of? I’m so sorry you’re going through this. You didn’t ruin anything. Sounds like BF can’t accept you and your daughter had a life before him.",
              "id": 4,
              "comments": [
                {
                  "score": 786,
                  "content": "It would be extremely damaging to OP's daughter if OP went along with BF's request to treat her first husband like an ex. My father effectively rewrote history for my stepmother, suddenly bringing up that if my mother hadn't died of cancer, they would have gotten divorced. It sounded like BS when he said it, because that did not reflect my memories of their marriage. He brought this up the first (and only) time they took me to a psychologist (severe depression, anxiety, and PTSD from my father and stepmother's emotional and verbal abuse). For some reason, he felt it was necessary for the psychologist to know this. She died a month after I turned 9, and he told the psychologist he thought I never really \"dealt with her death.\" This was all brand new information to me, although we had very little of my mom's things around the house. No photos, but they did display her doll collection (despite my stepmother \"parring it down\").\n\nI later brought this up with my uncle, who clarified that they were having problems related to the constant moving because my father was in the military. He also said that my mom and dad didn't fight because my father was not the type of person you could fight with (which I experienced myself and ended up leaving at 16 and have been estranged for the last 20 years). My older half-sister told me about my mom, who had always been an amazing stepmother to her, started treating her poorly the last year of her life due to the impact of the metastatic cancer on her brain. Putting these two things together, I believe that their marital issues were primarily due to the impact of her cancer.\n\nAnyway, the point of this impromptu therapy prompt is that it was so painful how my mother was erased. I do have a hagiographic view of her, which may be in part due to how awful my father became after marrying my stepmother. I don't want OP's poor daughter to go through anything like that and lose the connection with her deceased father. I cling to that connection now, with my only family being my mother's extended family.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 89,
                      "content": "When my auntie (who was like a second mom to me) passed away at 37, she left behind a terrible husband, a 13 year old girl and an 11 year old son. \n\nShe had been sick for a very, very long time. We don't even know what disease she had that ultimately ended her life, but they were treating it like leukemia. \n\nWell, her husband remarried without consulting his children and they were never, ever allowed to talk about their mother because it made his new wife \"uncomfortable\". \nAll of her photos were gone. \nShe collected Precious Moments figurines in this beautiful glass curio cabinet... The figurines are I don't even know where and the curio cabinet was shoved the the restaurant (which is attached to his gas station) bathroom. Cousin (maybe 23-24 at the time? Eldest daughter) asked her dad for the cabinet since none of us wanted it in the fucking bathroom. \nHe delivered it. \nSmashed to fucking pieces. \nDad and new wife are also collecting the social security that came from my aunt to go to the kids, and kept it, because according to new wife \"they have no right to their mothers social security\" (but, y'know, she does 😒). \nSo many other fucked up instances of their mom just being... Erased. Just gone. \n\nEldest daughter now lives in UK with her husband as far away from dad as she could get, and even when she lived in the states only visited to see younger brother. \n\nYounger brother was diagnosed with undifferentiated schizophrenia and we're all pretty convinced it's because they basically watched their mom die a terrible death, and didn't even get time to mourn. She passed on a Saturday, they were back in school on Monday. Since youngest brother was pretty young and never got any therapy and was never allowed to talk about his mom except to us, we're pretty sure that fucked him up *a lot*\n\n\n\nOP you're NTA, don't ever let anyone convince you to erase your late husband. He'll always be a part of your life and a place in your heart. If your current boyfriend doesn't understand this, he's not the one.\n\nEta: changing word-- fixed it mods, thank you for not deleting my comment",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 108,
                  "content": "Absolutely NTA and totally support all the above points! I’m sorry your BF is treating you and your daughter this way. It’s incredible offensive to try to erase the memories of your late husband just because he is jealous that you loved someone that isn’t him. This speaks to a level of emotional insecurity that’s concerning for a developing relationship.",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 98,
                  "content": "NTA.\nThink it's notable that bf said he was going to propose to OP on Valentine's Day (besides trite, was he really going to propose or just using it as a wedge?) knowing OP's tradition of visiting his grave with her daughter.  The late husband's birthday as well as Valentine's Day. Bf wants to wipe out all of this dead man's places in OP's and her daughter's heart. Plus what a weak-ass move shoving the late husband's pictures in a drawer.     He obviously thinks he must compete with a dead man instead of being who he is.  Unless OP thinks down deep she's not letting bf completely into her heart (only she knows), it looks like bf may not be as perfect as she thought he was.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "This kind of post is exactly why, though. He expresses his feelings in a very shitty way, but he's allowed to have feelings. It sounds like he does accept they had a life before him: but he isn't a fan of it overshadowing the life that's still going on. People tend to idealize the dead, you can't compete with the perfect now dead spouse. When the house you live in with your partner is filled with images of the dead partner and even special occasions are consumed by them and your flailing attempts to voice your own feelings are called invalid, what's left for you?\n\nThat's not to say OP is in the wrong, either. It's a pretty basic incompatibility. Everyone likes to feel special and wanted in a relationship, and OP's boyfriend doesn't seem to. And if he can't handle the way she chooses to respect her past then he should probably just move on, sucks but that's life sometimes.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -15,
                  "content": "From what I’ve seen in these situations the dead are idolized and the new are always compared to them and it just takes a toll on them mentally.  It seems like he has just hit his limit and that’s valid to feel that way",
                  "id": 10,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Not at all!\n\nMy dad's second wife valued both her first husband and my father.  They were quite different people.  \n\nHer first husband, who was a firefighter and worked in construction, was very handy, had done a lot of the renovations to their house, and was very much a meat-and-potatoes type of guy.  \n\nMy father was very different.  A scientist, a musician, he loved food and introduced her to a wide variety of ethnic cuisines, he would step in and do things like cooking which her first husband wasn't really good at (while not doing things like home repairs, because he knew he didn't know what he was doing - but was quite willing to pay an expert well to do the job properly.) \n\n\"Moving on\" when you lost a beloved to death looks *entirely different* from moving on from breaking up with someone. They're still someone you love and admire.  Part of the reason that you want to have a new relationship is that you valued the intimacy of your old relationship, and still want that intimacy in your life.  \n\nWhen her first husband died, my stepmother bought a double plot, so she could be buried by him.  My father, later bought a plot in the same cemetery quite close to their shared plot.  At my father's funeral, after it was over, my stepmother went to her first husband's grave for a few minutes.  I don't see any problem with her doing this.  Being double-widowed had to bring back all of the loss of her first husband, as well.  And I know my father would have understood and respected that.  \n\nMy stepmother didn't idealized her first husband - but she didn't stop loving him, either.  And she did love and value my father for who he was, which was someone quite different from her first husband - he wasn't some sort of substitute.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Definitely. Also NTA",
              "id": 12,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 425,
          "content": "This is beautifully written. Also OP's boyfriend needs to recognise the 15yo daughter should have a space to keep her father's memory alive. The boyfriend is struggling, it's clear, but he shouldn't be pandered to.",
          "id": 13,
          "comments": [
            {
              "score": 251,
              "content": "Not only that, but this guy is behaving like his feelings about it are more important than her daughter's feelings!\n\nOP, ask yourself this: is it more important that your daughter feels like it's okay to honor her father's memory, or is it more important that your (probably-soon-to-be-ex) boyfriend isn't forced to think about the fact that you loved anyone before him? \n\nWho is more important? A grieving child who lost her father, or a grown man who made a choice to get involved with a widow?\n\nI won't even get into the whole \"I was going to propose but YOU ruined everything\" argument. So juvenile. I'm sorry this isn't the relationship you thought it was, OP.",
              "id": 14,
              "comments": [
                {
                  "score": 18,
                  "content": "I know you avoided comment on the proposal, but I can’t overlook it. The whole proposal thing bothered me on a different level.  It was clearly controlling and blaming to throw the ruined proposal out there like his insecurities are OP‘s fault. This was a manipulation. But it seems to go deeper than that. I get it was Valentines Day so romantic proposals abound. But this was former husband’s birthday. This seems less like a romantic gesture and yet one more attempt to erase the first husband by conflating memories of this day. It is no longer a day of memorial, AH boyfriend wanted to co-opt it into his day and probably wave it around like a stick in the future.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 378,
          "content": "I have a story like this. \n\nMy aunt passed away around 15 years ago, and was a sufferer of early dementia. She had long since not been herself. She eventually went to live in an assisted care facility when her husband could no longer care for her. She passed away of lung cancer (not related) not long after.\n\nHe eventually met a lovely lady who was so kind and understanding. While he was not my blood relative, as his deceased wife was my aunt, he still continued to come to family get-togethers and holidays. And eventually his new lady came as well.\n\nShe was accepted as part of his deceased wife's family, as she was a sweet lady who made my uncle happy, as well as respected my late aunt's memory.\n\nShe was also an amazing artist and painted my grandmother a portrait of my deceased aunt (her daughter).",
          "id": 16,
          "comments": [
            {
              "score": 69,
              "content": "That is so lovely ❤️",
              "id": 17,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "This is such a beautiful story. I so wish this is how my father was after my lol died. He started dating soon after my mom died of lung cancer when I was 11 and cut my sister and I off from most of her family (after we turned 18 we reconnected with them and found out about the lies we were told by my dad about my mom’s family). He remarried when I was 14 and basically pretended like my mom didn’t exist. My mom’s urn was moved to the garage and there was only one family picture left up including her.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Slightly off topic, but my dad's side of the family has all passed.  My uncle was accepted by my mum's side of the family when dad died in 2015 since he was the last surviving member of dad's side that we still speak to.  Mum's brother and dad's brother spent lots of time together and became great friends and wish they'd met and become good friends earlier in life.  Eventually my mum moved interstate and they still kept in touch.  It became especially important when covid hit and my dad's brother was diagnosed with terminal cancer in July 2020 and Australia's lockdowns meant mum (also my sister and I) could not travel to visit him.\n\nWe eventually got to visit him (to add salt to the wound my cat very unexpectedly died while in the cattery on the day we were going up to see him for the last time) so it wasn't so bad, but many others weren't so lucky.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Oh I love this. 😍",
              "id": 20,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 171,
          "content": "This. You dodged a bullet here. I met a wonderful widowed woman and we just fell for each other hard. There are still photos of her late husband around, because that was part of her life and it was ended too soon. They had a boy who I treat as my own son at this point. \n\nPoint is, you don’t have to walk away from the past to have a future. Anyone telling you differently isn’t for you. \n\n\nNTA\n\nEdit - clarification. Wound up marrying her!",
          "id": 21,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "Your dad sounds like an absolute delight! \n\nThat being said, you are right! Focus on creating new menories to add instead of trying to replace or remove past memories. OP is NTA.",
          "id": 22,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "I had a similar situation, but sort of from the opposite position. \n\nMy mom died of cancer when I was 11. Her urn and a family picture sat on our mantle until my dad started dating my step mom. Now my mom’s urn sits in our garage and the family picture is kind of on the outskirts of a wall of a bunch of random other pictures and is the only picture we have up that includes my mom. It breaks my heart that my mom isn’t really shown as a part of our family any more and I feel like her memory isn’t honored. My dad almost never speaks about her and doesn’t ever acknowledge the day she died or her birthday. It’s been 10 years and it still hurts that he’s done this and it’s greatly strained my relationship with him and my step mom. \n\nOP, as someone who can speak a little to your daughter’s perspective, I really don’t think this is the man for you. Unless he agrees to some therapy and shows he has drastically changed his point of view, marrying this man will severely impact your daughter and her relationship to you and your boyfriend. She may not know how to voice her thoughts now, but I am sure she sees the way your boyfriend feels about her father and I’m sure she is hurt by his words and actions.",
          "id": 23,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "> If your boyfriend cannot live comfortably with your memories and connection to your late husband, he's not the right one.\n\nJust like you see people way too immature to be dating someone with a kid, there are people that lack the maturity to date a widow. Those people have no understanding or respect for other's feelings or the reality of situations. OP didn't break up with anyone. She lost a loved one and the father of her child. Even if they were divorced, I would expect *some* mourning over losing your child's father.",
          "id": 24,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "This is so beautifully stated. My mother had a similar experience.\n\nMy father passed away from lung cancer over a decade ago and her second husband was more than considerate of the fact that my dad was the father of her children and that part of her would always love him. They lived together with my dad's ashes and photo on the mantle, and he never would have disturbed them or hidden them away. He knew that she had enough love for both of them, and that was what mattered \n\nOP, you deserve someone that will be careful with your heart and can respect your history. I wish you luck  NTA.",
          "id": 25,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Your father sounds like an incredible man and the world needs more men of his caliber. What a truly noble and humble man to be so secure in himself and the love of his wife. Wow I’m simply floored. What a truly amazing man. I’d like to raise a toast to your father! What a honorable and compassionate man, may the world be fortunate enough to have more like him.",
          "id": 26,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Fuck. That's bittersweet and beautiful. Now I'm crying with only a few minutes left in my lunch break, thanks /s\n\nSeriously now, if he followed that example in his life in general he sounds like a wonderful father. I'm sure you're proud of him",
          "id": 27,
          "comments": [
            {
              "score": 77,
              "content": "My father was wonderful. (He died, Jan 2021, in his nursing home, from COVID.  Vaccines had been approved, and he was eligible, but the horrible initial rollout of the vaccine meant he didn't get his shot in time...)\n\nI will tell you the story of the car and our breakfasts, from when I was in high school.\n\nHe worked as a research chemist, at Kodak. (You probably used film he worked on.)  So he needed to get to and from work, but didn't use his car during the day.\n\nOnce me, and later, my brother, were old enough to drive, he'd let us use the car during the day.  With a few rules, of course.  \n\nWe had to drop him off at work, before school (and before our before-school activities.)  We had to pick him up, on time.\n\nAnd he got to take us out to breakfast, on the way to work!  If we wanted to give rides to friends during the day, they had to be up, and join us for breakfast, too. \n\nHis treat.\n\nWe'd be at a little local diner, just after 6 am, for eggs and toast and coffee, before getting on with the day. We'd sit and talk, and just have a nice time.  \n\nThese breakfasts meant that he knew us, and our friends, well.  He was someone you could trust and confide in.  It was abundantly clear that he liked us, and our friends, and spending time with us was a joy for him. \n\nTo anyone with kids in this age range, I highly recommend how he shared his car, and the breakfasts as a way to spend time with and keep open communication with your kids and their friends.  And I hope you find as much joy in your children as I remember my father finding joy in us.",
              "id": 28,
              "comments": [
                {
                  "score": 16,
                  "content": "So one if my brother-in-laws who is married to my oldest sister does something similar with his kids, but with a twist. He and my sister have three kids. Each kid gets one meal one-on-one every two weeks or so with their Dad. It can be a Monday night dinner after baseball practice or a Friday lunch in-between a class for his college-student daughter or a Saturday night pizza pick-up with a stop by McDonald's for a special Sunday with his youngest daughter. Every two weeks he finds a meal to spend with each of kids one-on-one. His kids love him (he's a great guy) and as a family they makes these incredible, everyday memories.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 4,
                      "content": "My dad did this with me and my sister (but with a weekend breakfast), and I fondly remember it 30+ years later. One of many reasons why he’s a wonderful dad ❤️.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1342,
      "content": "NTA\n\nEspecially since you had a child together, your late husband will always be a part of your family.\n\nMy spouse and I were introduced by a late, beloved mutual friend who was also a past partner of mine. His photo has pride of place in our wall of family pix, by mutual agreement. My kids’ dad isn’t featured, because the kids have gone low contact with him. So it’s all about who dude was to you and your daughter.\n\nETA Dude might consider that in order to be with him, you had to endure brutal heartbreak and get your kid through that. He might consider being thankful to your late husband his part in making you who you are today. He might try honouring whatever you brought away from your loss that became part of what he loves about you. If he can’t explore these thoughts with you, he may not be ready for you.",
      "id": 31,
      "comments": [
        {
          "score": 355,
          "content": "Dude is starting with the pictures, moving on to the annual remembrance, and next will attack the living reminder: OP's child. \n\n\nHe is not the one. He is so fragile that he can't respect that all a family has left of a beloved member is pictures, memories, and a grave side birthday. This dude is small and petty and insecure. He is trying to now punish OP with a silent treatment manipulation, and the promise(threat) of a proposal that may not have even been actually planned. He could be revoking a future-fake. Dodge the bullet, OP.\n\n\nIt took three years for the mask to slip. He thought it was long enough and that he fooled OP enough to tolerate the unmasked version, but he was wrong. Move on.",
          "id": 32,
          "comments": [
            {
              "score": 4,
              "content": "NTA.\n\nSounds like the trash took itself out.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "How do people on this sub so consistently come up with such barely-substantiated reaches",
              "id": 34,
              "comments": [
                {
                  "score": 3,
                  "content": "70% of them are below the age of 23 and have never been in a relationship.\n\nTheyre teenagers that love drama and they get it in spades from r/aita, as well as tiktok and plenty of other social media.",
                  "id": 35,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": -7,
              "content": "I respectfully disagree . But let me explain.  As the new man in her life, I am sure he may not like moving into a monument to the previous husband, and would like to make it his own place too.  The request to remove the pictures is not clear. He should have asked her to move them from the lounge to a more appropriate place. Personally, I would be ok with them hanging in the passage, together with new pictures of our new life together. You don't erase the history, but rather build forward. It sounds like the place in the lounge is more of a shrine.\n\nThe assumption you make that he is manipulative is not substantiated in OP's post. Also, what makes you think the proposal may have been fake?  He maybe wanted to, but the entire argument may have given him second thoughts and he needed to postpone it until he has clarity on the way forward.\n\nThe fact he wanted to propose on valentines day is good, but considering the day has negative links for OP, which he may or may not know about, he really should pick a different day.  It is not a romantic day for her.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 658,
      "content": "NTA. Your boyfriend is extremely insecure. How is he going to be jealous over someone not even alive anymore? You want to honor and remember your late husband. You are not gushing over him or whatever of the sort. He needs to get over it.",
      "id": 37,
      "comments": [
        {
          "score": -204,
          "content": "[deleted]",
          "id": 38,
          "comments": [
            {
              "score": 52,
              "content": "Lmao found the boyfriend’s account! Op and her late husband didn’t break up. He isn’t an ex partner, he passed away while still in a relationship. They have a child together and he’s still part of their family and deserves to be remembered. If the boyfriend can’t get over his jealousy of a deceased person then he needs to get help, OP has every right to cherish his memory.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -204,
          "content": "I think it is fair to be insecure considering that you are only with him because someone died. I would feel weird knowing that I was a second choice\n\nEDIT: no she should not be single forever. She should absolutely remarry and definitely deserves to. She did nothing wrong; I just can empathize with that insecurity that the boyfriend has. He has no business dating her, though, because his feelings shouldn't hurt her when she didn't do anything wrong.",
          "id": 40,
          "comments": [
            {
              "score": 164,
              "content": "He’s not even a second choice though, he is simply the person she chose to commit to once she spent her time grieving her late husband. Acting like you’re a second option or second best because you come after someone else in your partners dating life is TOXIC.",
              "id": 41,
              "comments": [
                {
                  "score": 80,
                  "content": "Saying he's second choice is like saying they are second choice after being dumped and no choice but to move on. Not comparable at all! OPs boyfriend is the first choice after something awful happened to her. He should be grateful he chose her and wanted to move forward with her life.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "That is true; she likely changed as a person after having to grieve the loss of her husband. \n\nWith that considered I would probably only feel insecure if my partner would choose to go back to her husband if he came back to life.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": ">I would feel weird knowing that I was a second choice\n\nSo you could never date someone who's ex broke up with them?",
              "id": 44,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 39,
              "content": "Is she supposed to be single forever simply because her husband died young?\n\nIf someone can't handle being with OP, that's one thing. But to try and act like her love for a new person can't be sincere just because she lost her husband is terrible.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "If he sees it that way, he is not ready for an adult relationship.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "You sound too immature to ever be in an adult relationship.",
              "id": 47,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Then you shouldn't date widow(er)s.",
              "id": 48,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "So then you aren't mature enough to ever date a widow. Good you know that now so that you don't bother them with your insecurity",
              "id": 49,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 624,
      "content": "NTA. Your boyfriend sounds very insecure, to be jealous of a man who passed away years before. Also, presumably he knew that the 14th is your late husband's birthday. I think it's reasonable to expect that you'd want to mark the occasion by visiting his grave. It's telling that he planned to propose on your late husband's birthday. He could have easily picked any other day, and yet he chose that day to propose, knowing the significance of that day to you.  Between that and hiding the photos, it's like he's trying to erase your late husband from your life.  He doesn't respect your feelings about your late husband at all, and that is not okay.  If you do plan on staying with him, perhaps seeking couples therapy would be a good idea. That way you can work on getting him to understand that just because you still mourn your late husband, that doesn't mean that you can't love your boyfriend also.",
      "id": 50,
      "comments": [
        {
          "score": 336,
          "content": "That's a very good point about his supposed proposal, although my read on it was that he probably didn't even have plans to propose. \n\n>he said it’s because he was planning on proposing to me but he can’t anymore because he believes I’m still caught up on my husband. \n\nThe whole \"I was *going* to do this thing for you, but now I'm not, and it's *all your fault*\" declaration is a manipulation tactic to make them look magnanimous and you the villain. I don't know if it has a name, but it seems pretty common. I even saw it when I worked retail. \"You won't honor my expired coupon for a different product at a different store? Well, I was going to buy $1000 worth of goods here this weekend, but now I'm not!\"",
          "id": 51,
          "comments": [
            {
              "score": 78,
              "content": "I keep coming back to this myself… the motives seem less than pure and even more so every time I come back to this and his reaction: “op ruined it!”",
              "id": 52,
              "comments": [
                {
                  "score": 35,
                  "content": "It's a really manipulative tactic. The \"I would have done something nice for you if only you had kept in line\" tactic. \n\n\"If only you acted in the way I wanted you to, we could have nice things\" kind of behavior. \n\nThe motives aren't pure at all. When gifts are used against you, they aren't gifts.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Exactly. He won't be happy until he's manipulated her into erasing every trace of her 1st husband. To be honest, when I read\n\n>he angrily left the house and hasn’t been back since. \n\nI was like, whew. Good riddance. Now change the locks so this insecure, manipulative jerk can't try to weasel his way back in.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "It sounds like gaslighting to me.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I couldn't get over this either. If he was planning to propose he chose her late hubby's birthday? Out of 365 days of the year there are 3 that would be bad for OP, her wedding day, his death day, and his birthday.",
          "id": 56,
          "comments": [
            {
              "score": 5,
              "content": "Yes this is the most glaring part in my mind. Her boyfriend does not respect her or her late husband, to want to propose on such an important date. Is he trying to take over the days that would be part of an important memory for her? It feels icky and tacky and downright disrespectful.",
              "id": 57,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 289,
      "content": "NTA.\n\nHe's your daughters father. You still love him. Death doesn't stop love! Your boyfriend is jealous of a dead man, and petty and resentful.",
      "id": 58,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 182,
      "content": "NTA- your boyfriend is insecure over a ghost. Unless you are constantly talking about him and comparing your current partner to the decedent. It doesn’t sound like that is the case. I see no issue with a nice photo memorial and visiting a grave stone on his birthday. It unfortunately falls on the “holiday of love” but your late husband had no choice in that. \n\nYour partner needs a reality check. His behavior is abhorrent.",
      "id": 59,
      "comments": [
        {
          "score": -98,
          "content": "The photos in the house are kinda not great. But the grave, cmom, it's his birthday of course that's ok.\n\nIt's just an unfortunate coincidence",
          "id": 60,
          "comments": [
            {
              "score": 88,
              "content": "It’s “not great” for her daughter to live in a house where there are photos of her dead father?",
              "id": 61,
              "comments": [
                {
                  "score": -47,
                  "content": "We don’t have any context for OP’s cultural or religious beliefs but I believe that if the photo display was part of that, they’d have said so since it would really tilt opinions one way or the other.\n\nIt sounds as if there’s a shrine of sorts to the deceased and I can see how that would be unsettling. Of course OP’s daughter (and OP herself) should be able honor the memory of their loved one. However, that doesn’t mean there isn’t room for compromise: maybe it’s time to put the candles away unless it’s a significant date in the life they lived together. Perhaps spread the photos throughout the home rather than have them congregated to one specific tribute area.\n\nI too would feel somewhat second best if every time I sat down to watch TV or whatever with my SO and just had this glowing memorial staring me down from the coffee table.\n\nScrubbing the deceased from the house entirely isn’t right; I just think there’s probably room to meet in the middle and address everyone’s feelings on the topic.",
                  "id": 62,
                  "comments": [
                    {
                      "score": -36,
                      "content": "Agreed.  Photos here and there, especially for the daughter, are totally fine.  Visiting the grave on his BD, of course.  \nBut a shrine of sorts.  No, that's not ok.  Sounds like OP is not really ready to move on.  Boyfriend is still an AH.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 49,
              "content": "I disagree. She has a daughter with her late husband. They didn’t divorce. She loved him and a terrible occurrence happened and she lost him. OP never got the chance to grow old with the man she loved and married and had a family with. \n\nThis is not some petty “ex” she can’t get over. This was her partner. She’s allowed to have photos of them being happy together in her home. Her new boyfriend is not a replacement, but he is also jealous over competing with a dead man and being altogether unfair.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 131,
      "content": "ESH.... he's definitely AH, but having a bit of a shrine to your late husband does seem a bit much when you have committed to this man and it sounds like you were on the verge of marriage.  I know another couple where the wife's husband died young and if she still had pictures/shrine to him it would be super weird.\n\nJust to clarify....a picture or two is one thing, but this part got my 'ESH' vote - *\" I have a table in the living room where I have a small memorial type thing, it has a bunch of photo frames of my late husband as well as candles. \"*   \n\nThere's a piece of furniture in the most lived in room of house that's basically a shrine.",
      "id": 65,
      "comments": [
        {
          "score": 218,
          "content": ">but having a bit of a shrine to your late husband does seem a bit much\n\nThis is very much an opinion thing, one I have to disagree with, as in many cultures, shrines in the house dedicated to gamily that has passed is very normal. The point behind it is simply to memorialize and never forget their loved ones; shrines are basically an outward expression of inward love and remembrance. \n\nIt's not a matter of moving on, either: surely the bf would have no problem if the daughter had died instead and OP kept a shrine for her even if they got another kid, so why be so upset about a shrine for a dead husband? Like it or not, OP loved someone who happened to die; she wouldn't even *be* with the bf if that hadn't happened. If he can't accept that some part of her is always going to love him, than he's not capable of dating a widower.",
          "id": 66,
          "comments": [
            {
              "score": 44,
              "content": ">surely the bf would have no problem if the daughter had died instead and OP kept a shrine for her even if they got another kid, \n\nOh no \n\nThere are multiple posts on here about how the kids of grieving parents feel some type of way about things like this. \n\nAll in all grief is complicated. It's not a straight timeline. Nor is it always something that new partners and family members can work around. \n\nI vote NTA because he removed the photos but I do think his feelings are valid. \n\nA lot of people say he's treating her husband like an ex but a deceased husband is worse. A dead man makes no mistakes, never says the wrong thing and can sit on a pedestal of perfection for all eternity. \n\nIt's a lot to stand next to. \n\nNow I'm not saying OP has to change but I would also understand if her current partner felt like he couldn't do it anymore.",
              "id": 67,
              "comments": [
                {
                  "score": 54,
                  "content": ">but I do think his feelings are valid. \n\nIf it was just the shrine, I could maybe agree; for some ppl, especially if that's not how they grieve/memoralize the dead, that could be too much. But OP says he doesn't even like the few photos around the house, which I'm assuming is separate from the shrine given how she writes; according to her, it makes him \"uncomfortable to constantly see the man she was married to.\" \n\nMeaning, even if she *did* remove the shrine and kept the photos up, he'd still be upset. And that's where his feelings about the situation cross the line. He's dating a widower. She was married and had a kid with someone before him. If he cannot accept that and is uncomfortable with the reminder of that, than he is not equipped to date a widower. Pictures or not, there will *always* be some reminder that she was married to someone else. \n\nThis isn't a competition; she also doesn't need to prove she's \"over\" her dead husband by removing all traces of him, which sounds like what bf wants. \n\n>A lot of people say he's treating her husband like an ex but a deceased husband is worse. A dead man makes no mistakes, never says the wrong thing and can sit on a pedestal of perfection for all eternity. \n\n>It's a lot to stand next to.\n\nThis is all down to where you're at in your grief and your respective partner's insecurity. Not every widow/er is always going to view their dead spouse as this perfect partner who no one else can measure up to. Maybe in the beginning of the grieving process this is the case, but eventually, as they heal, they're going to let go of that perfect image. Holding onto an idealized image is not healthy, and you can't sustain a healthy relationship if you do so. \n\nLikewise, a widow/er's partner may initially be very insecure and compare themselves to the dead spouse, but ideally, their confidence in themself and their relationship will grow. Hopefully, the relationship will progress to the point that self-doubt only comes up every once in a while. A mindset of \"how can I ever compete with a dead spouse,\" while natural, is not healthy.\n\nBoth mindsets *need* to be overcome otherwise the relationship will never last. Both parties are responsible for reaching a place where they can approach the relationship from a healthy standpoint. And 3 years is plenty of time for their relationship to have come to the point of bf being secure in his position as OP's partner. To still not like the husband's photos on the wall and claim it makes him uncomfortable to be reminded she was married before 3 years in shows that he still has some major insecurities that have to be dealt with. And it's not on OP to remove all traces of her husband to appease him.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 49,
                      "content": "You know I could be wrong, but I think there was a study or something that said a lot of widow/ers wind up dating or remarrying people who knew their deceased spouse for this exact reason. Since they also knew and loved the person, they understand the grief and they're more willing to accept and work with it.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "There’s no indication that OP ever compared her BF to her late husband. So it would just be his own insecurity that lead him to think he was competing with a perfect dead person. I can understand people finding a shrine uncomfortable. But it seems he is the AH because he removed it without talking with OP for a compromise. Then not allowing her to visit the grave on the late husbands birthday is also an AH move. Compromise could have been quick visit and then celebrate Valentines later.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "That could be a cultural thing too, though. I know many families that do this.",
          "id": 71,
          "comments": [
            {
              "score": 21,
              "content": "It totally could be cultural. I have a shrine in my home that holds photos of those who have passed. It's normal for every home in my culture to have one.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 41,
          "content": "I agree. It sounds like OP isn't ready to let go and move on in a new relationship.",
          "id": 73,
          "comments": [
            {
              "score": 132,
              "content": "She had a child with the late husband so of course she would have pictures up of him for her and her dd. He is the AH for his lack of maturity.",
              "id": 74,
              "comments": [
                {
                  "score": 82,
                  "content": "Agree the BF is an AH for the way he handled himself, but there's a big difference between a few photos and a shrine with candles. No one is suggesting there shouldn't be ANY photos of the husband/Dad.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 73,
                      "content": "His daughter won't be ready to move on, and she lives there, too. If OP erases her child's dad's memory from the house, she'd be a huge asshole. It sounds like you're qualifying grief, or setting a timetable. There is no timeline, and if OP and her kid need these reminders, shrine-like or otherwise, then that's fine. The BF doesn't have to like it, but he can leave -- he just can't tell her and her kid how to mourn.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "If she or her child are religious photos with candles could be religious. Or the daughters way of morning.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "How many photos are ok? Please share the wisdom.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "It's not a shrine it's a memorial hospital table which is quite common.",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -5,
                      "content": "The OP’s boyfriend is.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "There's a significant difference between pictures and a literal shrine.",
                  "id": 81,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "And he's not suited for a relationship with a widow.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "I agree ESH.\n\nThis got me too, “..but he believes his feelings are completely valid”. Blowing off his feelings as not valid because she doesn’t like them.",
          "id": 83,
          "comments": [
            {
              "score": 26,
              "content": "That strikes me as a bit pedantic. His feelings are valid, sure, but his expression of them is inappropriate. I think it was pretty clear it was his continued voicing of disapproval, invalidating her own feelings, and coming after the way she remembers her late husband that she takes issue with.",
              "id": 84,
              "comments": [
                {
                  "score": 17,
                  "content": "Yes, but her calling him a cunt, and dismissing his feelings entirely is never going to end well. He's shit at communicating, but she's also not a saint. \n\nIf she's compares the two a lot, or openly talks about the dead husband a bunch to him, while not showing him the love he needs then she's def TA. Right now it just sounds like a communication problem.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Not sure if this was caught, but at the end of the post she calls her previous husband, \"my husband\", which made it sound like she is still married to him and committed to him. \n\nI don't think there are any AHs here, just a lot of hurt and trouble communicating. The way this is written though, it seems that she's still not over her previous husband and hasn't fully moved on yet. There's a lot of grief in the post. I hope they can both move forward with what's best for them as individuals.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 35,
          "content": "She said there are photos of him all around the house, and the shrine with candles in the living room has a bunch of photos. He isn't demanding all memories get erased, he just wants to feel like she will be able to love him back, and feels she will always love this other guy more.\n\nAnd then she called him a \"insecure\" and a \"cunt\". Ridiculous that top replies are all N T A and insulting him on top. The bias is so anti-male on this sub. Repost the same story with genders swapped and see what happens if you call a woman \"insecure\" and a \"cunt\" ffs...\n\nIt could have all been resolved if she went to the cemetary in the morning, warned her BF in advance she was going, planned some romantic stuff *for him*, and maybe had the shrine anywhere not front-and-center in the main room of the house.",
          "id": 87,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": "It’s her kid’s father though and not just her former husband. It’s her responsibility to keep his memory alive for the daughter, not force her to forget him by hiding everything.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "She lives with her daughter and that's his father. What's she going to say? Oh, I need to put your dad's pictures away because BF is jealous?",
          "id": 89,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "People in Japan have shrines such as these for deceased family, yes even husbands and wives and they have remarried.  It’s respectful to their lost loved one, not weird.  The boyfriend is insecure.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I get what you're saying, and I can see how that might be off-putting for some/many. \n\n&#x200B;\n\nWhat I'll also say, however, is that grief is ridiculously complicated. I would have 5000% agreed with you before my husband passed away. I'd think it was weird, or that the person w/the \"shrine\" needs to work on moving on. Now, I'd say it's a maybe-ESH, depending on the degree of \"shrine\" this is (as you noted in your edit) and how OP is participating in the current relationship.\n\n&#x200B;\n\nIf OP is fully engaged in her current relationship, and not comparing BF to deceased husband, obsessing about deceased husband, refusing to make new memories, etc, then NTA. If she's making it a competition for her affection/attention, being disengaged from the current relationship, then I'd say she's not ready to be in a serious relationship again (which is perfectly *normal* and okay), and that her lack of preparedness for that relationship definitely might put her in a ESH situation.",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Agreed, ESH. There are some real communication issues here. Nothing wrong with keeping the memory of your deceased spouse and kid’s parent alive, but you have to make room for the very much ALIVE person in your life, today. It’s good to show respect on an important day (even if it’s Valentines Day), but to be ignorant of what this day means for your current flame is just… weird. The current partner should talk it out and realize the importance of the deceased spouse, but still… meh. \n\nAlmost makes me think this post is completely fake, actually.",
          "id": 92,
          "comments": [
            {
              "score": 20,
              "content": "Hard disagree. OP has communicated clearly. BF just doesn't like what he's hearing. \n\nAnd miss me with \"even if it's Valentine's Day.\" OP and her daughter honor daughter's father on his birthday. Doesn't matter if that day happens to fall on labor day, July 4, Passover, Christmas, or a fake holiday created by greeting card companies, it's a significant date for their family. BF could step up and take part. Instead he'd rather they bury it in a drawer.",
              "id": 93,
              "comments": [
                {
                  "score": 14,
                  "content": "Yeah, you’re a bit reactionary to my comments. This woman is tenderly maintaining a positive memory. That should be absolutely applauded. You can’t put a timeline on grief - but is she being an AH because it doesn’t appear that she’s making any space for her current partner. I find it hard to process that someone who can be so attentive to her deceased husbands memory would be so dismissive and invalidating of her current partners feelings. There is clearly room for both “loves” in her life, but is she really communicating that with her actions? I, too, would be wary of someone who kept a literal shrine to their previous spouse versus just some photos. Was it really necessary for the current BF to be so petulant and not recognize that this is a woman who is still grieving and he needed to be more communicative and understanding of certain days? If he had asked in advance, I’m sure his Hallmark Holiday could have been rescheduled for a different day that is special to just them. \n\nSo, I still “strongly” stand by ESH. ESH doesn’t need to be this death knell opinion - this couple obviously care for each other, I just think they need to really work some difficult conversations.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 16,
                      "content": "All of this is fine. I disagreed with your stating that she is not communicating. How she feels is 100% clear.\n\n&#x200B;\n\n>I, too, would be wary of someone who kept a literal shrine to their previous spouse versus just some photos.\n\nThat is fine. He's entitled to his feelings. He can bounce if he can't get past it. But dismantling their photos is gross and calling their visit \"looking at a gravestone\" is out of line.\n\nOP's question asks if she's the AH for, specifically: visiting her dead husband's grave - with her daughter, as has been their tradition since he passed - on his birthday.\n\nIf you feel like she 'sucks' for doing that, what can I say? We disagree.",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "What you say here makes a lot of sense.",
              "id": 96,
              "comments": [
                {
                  "score": 8,
                  "content": "Thank you. But I’m getting downvoted for encouraging communication, so…",
                  "id": 97,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yeah, that squares with how reddit works sometimes. Reasonable, well thought out responses aren't as sexy as all caps and trash talk.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 106,
      "content": "NTA AT ALL \n\nYour boyfriend needs to get with the program. Your first husband will forever be a part of who you are and your story, and he needs to stop looking at your mourning and remembrance as if it takes anything away from him and his place in your life.  \n\nIt makes zero sense to be threatened by someone who is deceased, and to guilt you for loving your memories of him makes bf an asshole tbh. \n\nI mean; if he actually loves you, he should be grateful for your first husbands role in your life as he helped you be who you are today.\n\n\nHonestly, unless he’s willing to get some sort of counseling with or without you, his controlling ways that are surfacing are a huge red flag. He’s manipulating you by waving marriage at you. It’s disgusting that he thinks you should just forget someone who was, (and is), such an important part of yours and your daughters life. \n\nStep carefully.",
      "id": 99,
      "comments": [
        {
          "score": 55,
          "content": ">should be grateful for your first husbands role in your life as he helped you be who you are today.\n\nNot to mention he helped to create OP's daughter, who the new boyfriend supposedly loves and cares for!\n\nI agree entirely with the above poster, NTA",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "> *his* place in *your* life.\n\nOops you said the quiet part out loud...",
          "id": 101,
          "comments": [
            {
              "score": 1,
              "content": "?",
              "id": 102,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "> Your boyfriend needs to get with the program. \n\nNo he doesn't, he's entitled to his feelings as well. I don't think I could deal with a partner who does all of the things OP does as well, so I wouldn't be in a relationship with someone like that. \n\nThey're just an incompatible couple and that's OK, they just shouldn't be dating.",
          "id": 103,
          "comments": [
            {
              "score": 8,
              "content": "Having a memorial for her husband and the father of her child and visiting his grave on his birthday would be “too much” for you? \n\nSo what would you find acceptable? \n\nHe’s entitled to his feelings, yes. He is NOT entitled to manipulate and guilt OP, or put away the pictures of her first husband. \n\nThey’re definitely incompatible.",
              "id": 104,
              "comments": [
                {
                  "score": 0,
                  "content": "I'm not neurotypical, so yes it would be too much.\n\nYou're right, he is not entitled to manipulate or guilt OP, let alone put away her stuff. I'm not disputing that he's a jerk.",
                  "id": 105,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 103,
      "content": "Actual widow here. I have also repartnered. I know that my late husband would have wanted me to move on. Of course I will never forget him, he was the love of my life and father of my children. However: It’s a fine line being sensitive to your current partner while still honouring your husband’s memory. We all grieve differently, but to me, a few photos in your home are ok, but an actual shrine is way too much. Although I assume when you first met your partner the shrine already existed, so I wonder why it didn’t bother him then? Visiting your husband’s grave on Valentines Day does drive home the message that your late husband is the one you consider to be your Valentine and not your current partner. I’m sorry but if you can’t prioritise the living over the dead then perhaps you aren’t ready to move on. NAH though.",
      "id": 106,
      "comments": [
        {
          "score": 32,
          "content": "She's not visiting his grave on Valentine's Day though. She's going with their teenage daughter to visit on his birthday, which just happens to be V Day.",
          "id": 107,
          "comments": [
            {
              "score": 22,
              "content": "Oh my bad, I didn’t see that. That’s quite different. Still I can see why her partner feels hurt.",
              "id": 108,
              "comments": [
                {
                  "score": -1,
                  "content": "I didn't see it until just now and I commented hours ago. OP really buried that part (literally mentioned it in a one off sentence) despite it adding important context to her decision to visit her late husband's grave on Valentine's Day",
                  "id": 109,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Oh it’s at the very top of the second paragraph to be fair. I just missed it.",
                      "id": 110,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 90,
      "content": "NTA, and possibly dodged most of a bullet there. \n\nYou are not \"hung up\" on your husband. You are living with grief for someone who was a huge part of your life, and who is your daughter's father. Keeping some memorial photos, and visiting a grave every once in a while, aren't unreasonable ways to do that.\n\nI'm sorry it didn't work out with your boyfriend, but it seems like he was slightly bad news.",
      "id": 111,
      "comments": [],
      "relation": "Support"
    }
  ]
}