{
  "post content": "Hi, first time poster, on mobile, all that stuff :)\nSorry, it's going to be a bit long. Summary at the end.\n\nSome background, I have pretty severe anxiety and a history of doing more than my fair share of group projects since I worry about them not getting done otherwise.\n\nI'm currently at Uni and working on a project  with three other students. I should start by mentioning that this project is divided in 2 parts, one group-assignment/report and one individual report. \n\nAs per usual my anxiety is acting up and I estimate that I've done about 70% of the group-assignment so far. Despite this I have no problems with two of the three members of my group, they always show up and do their best. The work so far is based on our discussions and ideas so they still do work.\nBut this third student... \n\nShe skipped the first couple of lessons were we laid down the rules in the group (respect,being on time, critique is welcome but not negativity, etc.) Which means that she wanted us all to write separately in a shared document even though the rest of us already agreed that we'd work better together, continuously developing our ideas.\n\nIn our almost 17 page long shared document she has written less than a page and only because we told her what to type.\n\nShe missed an important meeting were we ended up making some major changes, however I summarised the whole thing and put it in the aforementioned document for her to read - she didn't. \n\nShe skipped out on both a seminar and a work shop aimed at getting dead back from other groups so we can make changes before the presentation. SO THAT SHE COULD WORK ON HER OWN ASSIGNMENT.\nShe also doesn't want to meet up this week to fix the changes even though the presentation is only a week away (again - anxiety).\n\nSo today I finally did it. I sent my teacher an email and abandoned the group. I will be doing my own report on the project (Which I came up with by the way).\nI even left them with the document and all the work I've done so far.\n\nNow here's the kicker: she told ME that I was being unfair for calling her out on not doing any work and now she's pissed at me. She thought I was being rude for assuming she didn't do any work because she spent that time \"on her individual report\".\n\nI feel sorry for the other girls but as mentioned that still have access to all my work and notes leading up to this point.\n\nHelp me see this from her POV.\nAm I the asshole?\n\nSummary: I do 70% of a group project while another girl skips meetings to work on her own assignments so I leave the group with a week left to deadline.\n\nEdit: Clarification. I did not want to kick her out because with only a week left she would not make it. I left them with all the work and notes I had done up until this point so we are just working on the same project with the same resources, I'm just doing my report separately.\nThey still have my 70% of work and get to take credit for it as long as they paraphrase it",
  "id": 1,
  "comments": [
    {
      "score": 23,
      "content": "ESH. She should have done more work. But abandoning the group a week before it is due reflects poorly on you. You both ended up being unreliable group members. ",
      "id": 2,
      "comments": [
        {
          "score": -5,
          "content": "It was only a 4 week project though and there is only the writing the report part left of it aside from the presentation. I did apologise profusely to the other girls and they were very understanding ",
          "id": 3,
          "comments": [
            {
              "score": 8,
              "content": "It's good that you apologized but just because they were understanding doesn't change my judgment. Another user commented that group projects are a way to learn how to work in a group and they are absolutely right. ",
              "id": 4,
              "comments": [
                {
                  "score": 2,
                  "content": "I understand. \nI have never left a group project before and don't like doing it now either but I did leave them with all the work I've done so far so I don't feel guilty. That's not true, I do, but more than that I'm tired of being used and enableing free rides",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I get it. Here's a different way of looking at it: you still gave her a free ride. You left your work and your name won't even be on the report. Unless the other two members kick her out she is going to earn a grade she doesn't deserve. Honestly, that's true of the other two members as well. ",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "They may have been \"very understanding\" because there's a week left and what else are they supposed to say? You left them all in a bit of a bind.",
              "id": 7,
              "comments": [
                {
                  "score": -1,
                  "content": "They still have all the work I did up until now so they have as much information as I have and they are not doing it alone.",
                  "id": 8,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 15,
      "content": "ESH. You’re in college, part of that is learning to work with shitty people and not run with your tail tucked. ",
      "id": 9,
      "comments": [
        {
          "score": -1,
          "content": "I know it's a part of college but I'm tired of people doing nothing and getting free rides because they expect other people to do their work for them",
          "id": 10,
          "comments": [
            {
              "score": 5,
              "content": "Consider this your primer on how a typical workcenter operates. ",
              "id": 11,
              "comments": [
                {
                  "score": 1,
                  "content": "Well it depends on where you work then I guess. But I generally have no problem doing more work as long as the other people at least try to do their part. She didn't even know what the project was at the beginning of the week even though all the info is in the shared document",
                  "id": 12,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Wait until you're in an office of 6 people, doing 95% of the work. :)  It happens. Get used to dealing with shitty people.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9,
      "content": "ESH\n\nThat girl is TA for slacking.\n\nYTA for abandoning the 2 other group members you said you have no problem with.  Your anxiety is your own issue and you made it a problem for those two people.  There was the option to talk to them and then collectively kick out the 4th member.",
      "id": 14,
      "comments": [
        {
          "score": -2,
          "content": "I told them all about my anxiety at the beginning of the project and even though i left I also left them my notes and work done so far. I did not want to kick the girl out because then she just wouldn't make it so I chose to remove myself instead",
          "id": 15,
          "comments": [
            {
              "score": 3,
              "content": "I have a groupmate right now that has shown up for all of two classes and has repeatedly made excuse after excuse for missing group meetings and not contributing any work. Her reason is she has depression, which she was more than willing to share with me one on one, and has a hard time getting out of bed. I understand and sympathize but that doesn’t excuse kind of fucking the rest of us. Mental illness sucks and can be very difficult to live with, but it’s not an excuse to be an asshole. ",
              "id": 16,
              "comments": [
                {
                  "score": 1,
                  "content": "Well my group mate only showed up for about 2 or maybe 3 lessons as well and she hasn't even provided a reason for skipping other than her wanting to work on her other assignment instead. I on the other hand has been to all our seminars, work shops and meet ups despite struggling with my mental health issues",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "ESH. Group projects are something just about everyone has to learn how to handle in college. This invariably happens in The Real World, and you can't just ditch a project at work because you don't like who you're paired with. ",
      "id": 18,
      "comments": [
        {
          "score": -1,
          "content": "The purpose of group projects is to work together. She has done no work in 3 weeks.\nBelieve me, if this was at a workplace she'd been in trouble a long time ago.",
          "id": 19,
          "comments": [
            {
              "score": 1,
              "content": "Um no. You're gonna find out you'll never be free from freeloaders. They exist in office environments and at times, it seems like they are some of the most likely people there as well. Groups assignments in college exist so we learn to work with these types of people as well as all of the other of Dynamics of work place weirdness.",
              "id": 20,
              "comments": [
                {
                  "score": 1,
                  "content": "I've had a few part time jobs so far and never had a problem with co-workers not doing their part, at least not to this extent",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "ESH- I cant believe you left the group a week before it was due....you’re almost a bigger a-hole than the other girl was. You screwed over your other team members. ",
      "id": 22,
      "comments": [
        {
          "score": -1,
          "content": "It was only a 4 week project and I left them with all the work and notes so far so they can still use it. I did not leave and take my work with me so ATM we have the same resources at our disposal",
          "id": 23,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "I'm sure your anxiety played a huge role in not wanting to rock the boat by talking to anyone else about her participation, but, it does not excuse you bailing on the project you were almost done with. In the end you may have done yourself a disservice by adding to your own workload. In the future have these discussions with your entire group, less chance of being an asshole, or at least a lone asshole then. But honestly don't beat yourself up over it. Like you said it was a four week project. There's a whole lot more school ahead of you.",
      "id": 24,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "You abandoned the *whole group* because one person wasn’t putting in the work?\n\nYTA.\n\nLike, I could understand you guys cutting her out for not doing shit, but you ditched your whole group, including people who were actually putting in a bit of effort? Maybe not as much effort as you, but you were apparently okay with this before so you did leave those two in the dark.",
      "id": 25,
      "comments": [
        {
          "score": 1,
          "content": "Clarification. I did not want to kick her out because with only a week left she would not make it. I left them with all the work and notes I had done up until this point so we are just working on the same project with the same resources, I'm just doing my report separately.",
          "id": 26,
          "comments": [
            {
              "score": 2,
              "content": "Is the report something that was meant to be done in a group? In other words, did the other group members believe that you would be completing this report together? If so, YTA still.\n\nThere’s ways you could’ve trimmed the fat without throwing away the whole cow. Group projects aren’t just for making sure everyone can do their fair share. You also need to learn how to navigate situations where some group members are not cooperative. Cutting off the whole group was not a good move, but talking to the other two and agreeing to cut off the slacker would’ve been okay.\n\nAs for the fact that the other two participated somewhat but you still did most of the work? I’m gonna say that’s on you. That’s another expectation that you have to communicate early on with the group. If you’re okay taking on more responsibility that’s perfectly fine, but you can’t just do 70% of the project without discussing expectations and then getting upset that you did more work.",
              "id": 27,
              "comments": [
                {
                  "score": 1,
                  "content": "There are two parts of the project - group and individual. All this time she has only been working on her individual part while I did most of the ground work and research for the group part. \nThey still have access to all that work and my notes, I did not take those with me.\n\nI tried talking to her about her being absent a lot and made it a point to ask her to read up on the document because she obviously hadn't. Our deadline is Wednesday next week and she refuses to meet until Monday. I don't want the rest of this week to go to waste because she doesn't want to work.\n\nAnd we did discuss workload early on. I have no problem doing more than my share as long as the other people still tries their best and don't just expect a free ride.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***This is a copy of the above post. It is a record of the post as originally written, in case the post is deleted or edited.***\n\nHi, first time poster, on mobile, all that stuff :)\nSorry, it's going to be a bit long. Summary at the end.\n\nSome background, I have pretty severe anxiety and a history of doing more than my fair share of group projects since I worry about them not getting done otherwise.\n\nI'm currently at Uni and working on a project  with three other students. I should start by mentioning that this project is divided in 2 parts, one group-assignment/report and one individual report. \n\nAs per usual my anxiety is acting up and I estimate that I've done about 70% of the group-assignment so far. Despite this I have no problems with two of the three members of my group, they always show up and do their best. The work so far is based on our discussions and ideas so they still do work.\nBut this third student... \n\nShe skipped the first couple of lessons were we laid down the rules in the group (respect,being on time, critique is welcome but not negativity, etc.) Which means that she wanted us all to write separately in a shared document even though the rest of us already agreed that we'd work better together, continuously developing our ideas.\n\nIn our almost 17 page long shared document she has written less than a page and only because we told her what to type.\n\nShe missed an important meeting were we ended up making some major changes, however I summarised the whole thing and put it in the aforementioned document for her to read - she didn't. \n\nShe skipped out on both a seminar and a work shop aimed at getting dead back from other groups so we can make changes before the presentation. SO THAT SHE COULD WORK ON HER OWN ASSIGNMENT.\nShe also doesn't want to meet up this week to fix the changes even though the presentation is only a week away (again - anxiety).\n\nSo today I finally did it. I sent my teacher an email and abandoned the group. I will be doing my own report on the project (Which I came up with by the way).\nI even left them with the document and all the work I've done so far.\n\nNow here's the kicker: she told ME that I was being unfair for calling her out on not doing any work and now she's pissed at me. She thought I was being rude for assuming she didn't do any work because she spent that time \"on her individual report\".\n\nI feel sorry for the other girls but as mentioned that still have access to all my work and notes leading up to this point.\n\nHelp me see this from her POV.\nAm I the asshole?\n\nSummary: I do 70% of a group project while another girl skips meetings to work on her own assignments so I leave the group with a week left to deadline.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 29,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, put one of the following abbreviations in your comment. Include ONLY ONE of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 30,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "ESH, you shouldn't have overreacted n jumped ship, she should have put some fuckimg effort in. Not that I can't sympathise with either party.",
      "id": 31,
      "comments": [
        {
          "score": 1,
          "content": "I didn't immediately \"jump ship\". I tried to talk to her about it but she just said I was rude and unfair and that she did not wish to talk to me anymore",
          "id": 32,
          "comments": [
            {
              "score": 1,
              "content": "Do you have a system for group participation rating? All I'm saying is you should have waited until the project was finished and say how much you really did to your teacher rather than leave behind the other 2",
              "id": 33,
              "comments": [
                {
                  "score": 1,
                  "content": "There isn't really a way to check who did what once it's over and done with. Except from the girl who set the document up the rest of us are just under the tag \"anonymous\".\nI left them with all my notes and work up until the point I left so they have the same resources I do",
                  "id": 34,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}