{
  "post content": "Hey everyone! My girlfriend and I both recently turned 22, and we've been together for five years now. She had a taste of living on her own during a college program a few years ago, and ever since she got back, she's been ready to move out and start her life.\n\nWe've been going back and forth about moving out since. She wants to move out, and I don't. I say I'm not ready because I still feel like 22 is relatively young, and I can save up for at least another year! I just don't see the big rush. I think it would benefit us both to wait.\n\nI also bring up that I shouldn't be pressured into something huge like this. If I say no, then it should mean no. She says that that's not fair to her because I'm not taking what she says into consideration .. but that's a really big decision. I would never go through with something she's not comfortable with! She thinks I'm holding her back, and today I told her that I'm not stopping her from moving out. If she wants to, go ahead, but I'm not coming. That's why I don't feel like I'm not holding her back or anything.\n\nTo her point though, we both work full time with solid jobs, and we both know we want to get married. Honestly, she's the perfect girl for me! I look forward to starting a life with her! When we fight about this, she brings up those two points, and all I can really say that I want to save up and I'm not ready yet. I understand where she is coming from, that's why I'm not sure if I'm the a-hole in this situation.\n\nHowever today, this argument was a lot different. We started talking about the same stuff I wrote above, but the conversation shifted. She then said that she's been waiting for me to propose to her for a long time now. We have a vacation booked, and she was expecting me to propose to her then.\n\nThis came out of nowhere, we were talking about moving out! She started getting really emotional and said that it would make her happy if I \"at least\" proposed to her on the trip. When I said I'm not doing that, she got angry with me. She said that I could make her happy if she had something to plan and think about until we move out. And all this didn't really make sense to me.\n\nShe ended up giving me an ultimatum without saying it. Either I move out with her, or propose to her. That way she can be happy moved out, or she can be happy because she knows she's getting married soon. And I don't want to do either thing (yet).\n\nI was very upset at this point, but I kept my cool. I explained to her that I really am excited to start my life with her, and she really is the best thing that's ever happened to me! I really want to do all these things, but I just feel it's too early. Why not save up? What's the rush? We can make life so much easier if we just wait another year!\n\nI then looked at the time and realized I was almost late for work, so I left, and I'm still here now. She's very upset with me, and I'm just sad. All this came out of nowhere. \n\nI'm not sure if I'm the a-hole here. So any feedback would be appreciated.",
  "id": 1,
  "comments": [
    {
      "score": 6,
      "content": "NAH you have different priorities (saving vs having your own place) and timelines (now vs in the future). Neither of you is wrong to want what you do.",
      "id": 2,
      "comments": [
        {
          "score": 2,
          "content": "Honestly, after I posted this I started to think the same. Thank you for the response!",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "NAH, but I think there is a high likelihood you're going to get dumped.\n\nI think waiting a year to move in together so you can save money is a smart compromise.  But you don't seem to see it as a compromise.  You see it as entirely about what you want.  \n\nI think 22 is young to get engaged and it is strange that she's expecting a proposal when you haven't talked about it.  But I think the real rift here is that she wants a life partner and you don't see the relationship that way.   If you did, the decision to move into together would be joint, not \"If I say no, it means no.\"\n\nI think couple's counselling would be a good idea for you two.  At this point, you two have to either agree on a timelines or break up.  You can't ignore this issue or brush it off with \"What's the rush?\"",
      "id": 4,
      "comments": [
        {
          "score": 1,
          "content": "Thank you for the response! Yeah I'm worried about getting dumped. I really hope that doesn't happen, because she's the perfect girl for me. I actually do see her as a life partner though, that's where I disagree.",
          "id": 5,
          "comments": [
            {
              "score": 1,
              "content": "You need to suggest therapy to help you guys work out a timeline.",
              "id": 6,
              "comments": [
                {
                  "score": 1,
                  "content": "What would a therapist do to help?",
                  "id": 7,
                  "comments": [
                    {
                      "score": 1,
                      "content": "They can help you talk through the situation and create a plan.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH. Sounds like you’re both at different places despite being the same age. She got a taste of freedom and living alone while you like where you’re at and have the ability to save some more money before that step. She’s ready to start the future now and you’re okay with it remaining the future. Sounds like you both need to think about what you want, what the other wants and go from there. The ultimatum of ‘move out or propose’ doesn’t sound like much of a compromise.",
      "id": 9,
      "comments": [
        {
          "score": 1,
          "content": "Thank you for the response! Yeah I didn't think either of us were wrong, the ultimatum was what really got me. That's not a compromise at all in my eyes.",
          "id": 10,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "The vibe here was gonna be n a h until she pulled that ultimatum thing. \n\nNTA - You're doing what you can to communicate and I'm glad that you're maintaining your position. It sounds like you understand where she's coming from and why she wants what she wants, and that's good. You also have a right to not change your mind unless something genuine in your circumstances sways you. \n\nIt's manipulative at best that she wants to rope in the idea of marriage as a means of having this moving-out conversation-- because she's not *really* talking about marriage itself when she frames it that way. That's taking your very real feelings of commitment to her and using them as a tool to push you into moving out with her. \n\nYou're young, you're trying to be responsible and not take risks you don't think you're ready for. And dude, you're not married to her yet. It might suck for her that her partner doesn't want to move yet, but at the end of the day y'all just aren't beholden to each other in that way. \n\nI would be very wary of the way she's acting. It's not fun in the least to hear this, and probably even less so from a stranger on Reddit, but take it from someone who just got out of a toxic relationship: those are manipulation tactics. That's really unhealthy. \n\nThe best you can do is to keep communicating clearly and not make sacrifices you aren't 110% okay with making.",
      "id": 11,
      "comments": [
        {
          "score": 2,
          "content": "I appreciate the response, thank you very much! I am being wary of the way she's acting, and I realize that it's manipulative. I'm just lost because she's never done something like that before. I think that's very wrong.",
          "id": 12,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH - You guys seem like you both want different things, which doesn't make anyone an asshole.  \n\n\nYou are both still pretty young. I think you are being wise trying to be cautious about rushing to move out on your own. It's very expensive.\n\nShe seems to want some sort of guarantee that your relationship is committed, and she seems to feel anxious about your hesitance to commit to living together or getting engaged. \n\nIt might be time to have a serious, honest conversation about what you both want out of the future. My advice to people so young; life is long and the world is big. You two both have been dating since high school, and it can be hard to transition into an independent adult life if you never let go of the familiar comforts of the past. There is a LOT of growing and maturing you'll do in your 20's, and starting your adult life with a committed partner means you deprive yourself of a lot of opportunities to grow.",
      "id": 13,
      "comments": [
        {
          "score": 1,
          "content": "I really appreciate your answer. Thank you for the insight! I never thought of her wanting a guarantee that the relationship is committed. I can say it is for sure! But she might not see it that way.",
          "id": 14,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. You have the right to not be ready to live with your girlfriend yet and also have the right to not be ready to propose. She has the right to be ready for those things but she doesn't get to push you into doing something you aren't ready for. Why would she even want a proposal she has to force you into doing? I would tell her that you love her but aren't ready to take either of those steps, so if she feels she needs to break up with you over it then you wish she wouldn't but you understand.",
      "id": 15,
      "comments": [
        {
          "score": 1,
          "content": "Thank you for the response! You have my thoughts spot on, I think you worded it a bit better than I did. I would understand if she would want to break up over this, but that's the last thing I want.",
          "id": 16,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH - It sounds like she's ready to take the next step and you aren't. I don't think that either of you are wrong, but this may be a crossroads in the relationship. I think that you both have to decide whether you're willing to walk away over this if there isn't a compromise that you both can love with.",
      "id": 17,
      "comments": [
        {
          "score": 1,
          "content": "Thank you for the response! Yeah this seems like it's a biggie. Hopefully we can reach something, although I'm not sure that'll happen.",
          "id": 18,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHey everyone! My girlfriend and I both recently turned 22, and we've been together for five years now. She had a taste of living on her own during a college program a few years ago, and ever since she got back, she's been ready to move out and start her life.\n\nWe've been going back and forth about moving out since. She wants to move out, and I don't. I say I'm not ready because I still feel like 22 is relatively young, and I can save up for at least another year! I just don't see the big rush. I think it would benefit us both to wait.\n\nI also bring up that I shouldn't be pressured into something huge like this. If I say no, then it should mean no. She says that that's not fair to her because I'm not taking what she says into consideration .. but that's a really big decision. I would never go through with something she's not comfortable with! She thinks I'm holding her back, and today I told her that I'm not stopping her from moving out. If she wants to, go ahead, but I'm not coming. That's why I don't feel like I'm not holding her back or anything.\n\nTo her point though, we both work full time with solid jobs, and we both know we want to get married. Honestly, she's the perfect girl for me! I look forward to starting a life with her! When we fight about this, she brings up those two points, and all I can really say that I want to save up and I'm not ready yet. I understand where she is coming from, that's why I'm not sure if I'm the a-hole in this situation.\n\nHowever today, this argument was a lot different. We started talking about the same stuff I wrote above, but the conversation shifted. She then said that she's been waiting for me to propose to her for a long time now. We have a vacation booked, and she was expecting me to propose to her then.\n\nThis came out of nowhere, we were talking about moving out! She started getting really emotional and said that it would make her happy if I \"at least\" proposed to her on the trip. When I said I'm not doing that, she got angry with me. She said that I could make her happy if she had something to plan and think about until we move out. And all this didn't really make sense to me.\n\nShe ended up giving me an ultimatum without saying it. Either I move out with her, or propose to her. That way she can be happy moved out, or she can be happy because she knows she's getting married soon. And I don't want to do either thing (yet).\n\nI was very upset at this point, but I kept my cool. I explained to her that I really am excited to start my life with her, and she really is the best thing that's ever happened to me! I really want to do all these things, but I just feel it's too early. Why not save up? What's the rush? We can make life so much easier if we just wait another year!\n\nI then looked at the time and realized I was almost late for work, so I left, and I'm still here now. She's very upset with me, and I'm just sad. All this came out of nowhere. \n\nI'm not sure if I'm the a-hole here. So any feedback would be appreciated.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 19,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 20,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA not sure why everyone is giving his gf a free pass on giving ultimatums. You don’t get to rush a relationship forward. She can accept he isn’t at either of those milestones yet or she can move on.",
      "id": 21,
      "comments": [
        {
          "score": 3,
          "content": "I'm not a fan of ultimatums, but they are a way of expressing your needs before you walk away.  They're not a gun to the head, the only force they hold is \"I'll leave.\"",
          "id": 22,
          "comments": [
            {
              "score": 2,
              "content": "I think it would have been a lot easier if she would have said that. Because after reading everyone's response, I feel like she might end up leaving me.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "I mean fair, but she also could’ve said, “I need some reassurance that you’re serious about taking this relationship to the next level.”\n\nAn ultimatum is not a healthy way of communicating with someone.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Thank you for bringing that up, and thank you for the response.",
          "id": 25,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}