{
  "post content": "\nEversince my brother passed away at the age of 17 on his birthday, My family decided to never celebrate birthdays ever again. It was mom & dad's decision; but because of how much the family loved my brother, extended family decided to do the same and stand in agreement with this decision.\n\n\nMy husband would refuse to follow this decision, and kept celebrating his birthday. Me and the family didn't say a thing about it since he's not blood family. But when I first got pregnant, the argument about celebrating our daughter's birthdays occured. My family adviced me to just not celebrate her birthday since she's a baby and won't even remember anyway. I agreed but my husband threw a fit and insisted that we celebrate our daughter's 1st birthday. I caved in eventually but told him we'd have a small, secret celebration so that my family wouldn't find out. He agreed.\n\nThe next day, I got a call from mom and she was so upset saying that my word meant nothing and that I have no respect for my brother's memory nor the family. I asked what she meant and she told me she saw the birthday party pics my husband posted on social media. I was to shocked to even argue. I hung up and went straight to my husband to confront him about it. He got defensive and said that he didn't need my permission to post pics, and that he wanted to show his family the birthday celebration pics since I \"insisted\" we have a small, secret party and \"exclude\" them. I explained to him how this made me look bad and a liar to my family but he said \"they can get over it\" and called my mom \"snooby\". I blew up at him and we had a huge fight about it. He started sulking later and said I ruined the memory of our daughter's first birthday for him and \"verbally abused\" him with how I lashed out. But I solely did it out of frusrtation knowing that what happened caused a massive problem between me and family.\n\n\nNow he's expecting an apology from me.\n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 51045,
      "content": "YTA, and your family. This is out of control. That is an insane thing to agree to concerning people who weren't even BORN at the time. Your children and husband did not consent to this.\n\nIt honestly sounds like your family might need some therapy all around. It is sad someone died but the living should not have to pay a price for it every year. Birthdays are about celebrating the LIFE of the person BORN THAT DAY, not about the death of a person born a different day. ETA: I bet your brother would be appalled this was his legacy - telling everyone that their life isn't as important as his.\n\nYou do look bad, and you are a liar. You should have stood up and said \"We celebrating the life of my daughter\" to your family. Go apologize to your husband.",
      "id": 2,
      "comments": [
        {
          "score": 24811,
          "content": "I feel like this would make a child resent the memory of their uncle more than anything.",
          "id": 3,
          "comments": [
            {
              "score": 12804,
              "content": "Right? This is so disrespectful to that young man who passed away. If I found out my memory was being used an excuse to deprive my family (and literal babies) of joy and celebrations and birthdays I would haunt the fuck out of everyone.",
              "id": 4,
              "comments": [
                {
                  "score": 6932,
                  "content": "I’m sorry son, but we cannot celebrate your birthday because someone that you never knew died on their birthday.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3637,
                      "content": "My head is spinning. What a wild decision to make and force it on generations to follow. Wow. \n\nOP, I’m so sorry for your loss but come on. This is over the top.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 409,
                      "content": "This is the same excuse Jehovah's Witnesses use to not celebrate birthdays. John the Baptist was supposedly executed during a birthday celebration for King Herod, so in turn, JWs don't celebrate birthdays out of respect for him. Interesting thing to explain to your kindergarten classmates when the teacher tries to get them to sing  \"Happy Birthday\" to you.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 108,
                      "content": "I'm sorry son, but your parents, your grandparents and all the relatives care more about remembering your dead uncle than about being happy for you.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 25,
                      "content": "It’s insane, and unfair to other family especially this little girl. It’s tragic and sad that the brother died at 17 on his birthday. But to basically ban birthdays? The wife and her family are YTA. And the fact that she continues this ridiculous tradition with her daughter, it’s cruel. And I’m guessing the brother would think this is ridiculous.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Let's be real this was gonna blow up sooner than later. The whole thing is unhinged. It was only matter of time before someone in the family realized that. If they haven't already and where just doing parties anyway just not inviting OP and her parents.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Also just imagine that child growing up and going to school surrounded by peers who get to celebrate their birthdays.  Like, explain that to a small child who probably just wants a cupcake and to feel celebrated the same way their friends are.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Literally how Jehovas witnesses happened",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "Do they also not celebrate Christmas, I wonder? It is Jesus's birthday.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "I had a come to Jesus with my mother over this.  My daughter was born on the day we held my grandmother's funeral... but 4 years later.  It was XX date 2002 for the funeral, and XX date 2006 that my daughter was born.  It wasn't even the day of Grandma's death... most people remember the date of death not the date of the funeral, so I didn't even get why she wanted to make a deal of it to start with.\n\nShe'd made a few offhand comments about it right after the baby was born and I'd tell her, \"Well now we have a happy memory for tht day, and you know Grandma would have been the first one to say we need to focus on the living not the dead because they're already gone to their rest.\"\n\nI thought it was settled until about 3 weeks before my daughter's 1st birthday and she started up on the whole, \"Don't have her party ON her birthday, that's the day we buried Mommy!\" and I kind of lost it.  I told her I'd better NEVER hear her bring that up in front of my daughter because she didn't need to be made to feel guilty about being born.  I reminded her the whole family made it a tradition to go to the cemetery on the date of Grandma's death to clean her headstone and bring tons of flowers and plants and spend a couple of hours beautifying the spot and remembering her... And that if she couldn't get it out of her system then so she could show up to the party and focus on her grandchild instead of moaning and wailing then she could just not come. \n\nI still to this day don't know why this ever had to be a thing.  IDK if it was an unresolved grief thing, if it was a wanting attention thing... honestly don't know.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "When mom was a kid her family learned on New Year's Eve that her father committed suicide while on deployment. So I grew up absolutely hating NYE because it was always dark and depressing for my family. As an adult, it's been difficult to pull out of that even though I really don't want to feel that way. Don't put your kids and future family through that.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 611,
                  "content": "Yup. Wanna get haunted? Use my death as an excuse to deprive joy in life from others.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 532,
                      "content": "My grandma told us that she would haunt us if A) we showed any pictures at her funeral where she looked old or B) it was a sad funeral all day long. \n\nSaid she lived a good life, she had done a lot of things, and should be celebrated. \n\nSo we had a funeral and then told fun stories about her life for the rest of the day",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 340,
                      "content": "“You are using me to deprive people of cake. I’m going to bang on this radiator til that is corrected”",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 281,
                  "content": "Same for me. I would FORCE myself to come back from the dead just to bake a cake for the birthday kid and celebrate their birthday with them. I’d be fucking furious at everyone for using me to deprive others (especially literal CHILDREN) of fun and joy.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 124,
                      "content": "I am loving this image of ghost you floating around the kitchen making a cake. \n\nAnd I would help you.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "The funnest poltergeist ever.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 97,
                  "content": "Lol so much this, be a ghost telling all the kitties psstpssstpssst and driving everyone nuts with random happy birthday 🥳 ghostly singing 👻 random birthday cakes and balloons 🎈 \n\nOk I had a lot of coffee today lol",
                  "id": 22,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Make sure you pspspspsps from ceilings and dark corners for extra spookiness.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "teach the kitties to meow-sing \"Happy Birthday\" that's definitely not on-tune but recognizable as such.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Thanks for this take u/abortionleftovers (no shade I just thought your username was funny)",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3536,
              "content": "100%! OP - you are trying to please your parents at the EXPENSE of your husband and child? GROW UP! Tell your family you are not going to punish your child for being born, and that going forward you will celebrate birthdays!!!! HOLY CRAP!\n\nALSO - apologize to your husband!!! How dare you tell him he can't give his daughter a birthday, and that he can't share pictures. Your family made an awful rule - and you're literally forcing your husband to do the same! You yelled at a man that was wanting to celebrate his daughter because you haven't cut the umbilical cord attached to your mom!\n\nGROW A SPINE AND STAND UP FOR YOUR FAMILY! I would see your wanting to please your parents over your daughter as a red flag if I were your husband. He is absolutely right and you are terribly wrong.",
              "id": 26,
              "comments": [
                {
                  "score": 190,
                  "content": "Agree 100%",
                  "id": 27,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Imagine letting yourself go so far into your own grief that you are deeply, personally insulted by a one year old’s birthday party. Don’t just grow a spine, actively encourage the rest of the family to seek help.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 169,
                  "content": "OP is mad because her lie, where she agreed to follow their bizarre tradition of not celebrating birthdays, was found out by her parents when a birthday party was held for her daughter.  \n\nYou should have told your parents that you were not going to follow their “no birthday celebrations” tradition.  Instead, you lied and were found out.  That’s on you OP, not your husband.  YTA.",
                  "id": 29,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "Seriously, she hasn’t dealt with her grief and is now taking it out on her baby daughter in a completely immature way. She should not have had kids before dealing with this. I said what I said.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "The way she worded it sounds like that since he's \"not a part of the family\" (they're literally fucking married so this is disgusting by itself) that she had less or a problem \"allowing\" him to celibate his own birthday.. but receives zero recognition of said birthday from her- no gifts, no cake, no love..\n\nThis is truly disgusting on so many levels.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "her husband & her baby deserve an apology. not just from OP, from her whole AH family.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "This is definitely screaming red flags all over the place. It’s incredibly unfortunate that OP’s family has gone thru such a tragedy and everyone absolutely grieves differently. But, if I was OP’s partner, I would wonder what else their family could force upon them, me, and our child. When you get married and start your own family, it should be your priority to protect them in all ways. It sounds like OP is not protecting their partner and child emotionally because they are not allowing them to be happy on their birthdays at the request of the grandparents.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "And to say you only lashed out because you’re frustrated? Your frustration doesn’t excuse verbally abusing people in your life..absolutely agree that you need to apologize ASAP and get some therapy to help regulate your emotional responses and deal with the loss of your sibling.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 634,
              "content": "I was the kid in a very similar situation with my family. I didn't resent my uncle at all, but was definitely deeply hurt by my family. It took until I was in my 30s to say, hey this is aweful that this has been done to me. Everyone still had so much unresolved trauma around it that they hadn't even thought about what it did me. \n\nWe celebrated birthdays but the death anniversary was the day before my birthday so the unresolved trauma and morning came every year along with my birthday.\n\nEdit: please don't do this to your daughter.",
              "id": 35,
              "comments": [
                {
                  "score": 120,
                  "content": "My birthday is 9/12. I grew up with someone who is 9/11. In 2002 it was hard. But ALL of them would want to celebrate the living. \n\nAs Rocket said [everybody's got dead people](https://youtu.be/VvINs7iXeWM)",
                  "id": 36,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Whew yeah that's a humdinger. And yeah exactly! Couldn't agree with you more. \n\nSomeone on here suggested my family should have celebrated my birthday at a different time, like a week before/after or on my half birthday. I know they meant well but damn that would have been so much worse. So I'd also not be ALLOWED to celebrate my birthday on my birthday. On top of everything else? \n\n(Also side note: even if you think it's ridiculous I've got to say, love me some Virgos. Y'all tend to rock)",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Ive seen someone get grief for having a wedding on 9/11 recently… in Canada.",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 348,
              "content": "Yep. And their entire maternal side of the family who not only ignores them on their birthday, but chastises them to dare to celebrate it. This is one of the most bizarre grief responses I've ever seen and it's something about the lack of insight the entire family has about this. I can't imagine the brother would have wanted no one in the entire family, including future generations, to ever celebrate birthdays again. This family is like the Footloose of birthdays.",
              "id": 39,
              "comments": [
                {
                  "score": 74,
                  "content": "Given the extremeness of the response, I'm wondering if it's a superstitious thing? Maybe the brother died in some way that was directly linked to the celebrations, and the family have now decided that birthdays are unlucky.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Right like is there some kind of cultural or religious aspect that led to this decision that the whole family agreed upon and tries to enforce? I can’t understand it otherwise.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 201,
              "content": "EXACTLY wait until this child is old enough to see how other kids get celebrated and LOVED on their birthdays and she gets ignored.  I'm sure when it's explained to her that she's missing out on amazing childhood memories because of an uncle she never met she'll cherish his memory (not).",
              "id": 42,
              "comments": [
                {
                  "score": 26,
                  "content": "Right! And how far does this go?  Is the daughter not going to be allowed to attend birthday celebrations for other kids either?  Or is she the only kid she will know who is not worth celebrating? Because that's how a child will view this \"I am not worthy\"",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 125,
              "content": "Right? Like once this child is in elementary school, and sees their classmates having birthday celebrations, this is coming to a head no matter what.",
              "id": 44,
              "comments": [
                {
                  "score": 18,
                  "content": "> My family adviced me to just not celebrate her birthday since she's a baby and won't even remember anyway.\n\n\nThat's exactly what I was thinking while reading this, seems like OP and her relatives are all about run away from problems or difficult situations til you can no longer get out of it by throwing a tantrum.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 96,
              "content": "they would hate the the uncle they never met and the rest of the family for coming up with the idea of never celebrating ANYONES birthday.",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 70,
              "content": "Good point. I doubt the uncle would have wanted for his niece to never celebrate her birthday because of him either.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "Exactly. They never get celebrated bc of something that happened that had nothing to do with them before they were born. This child is going to hate not only the uncle but the mother",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "\"My friends all got cake and presents and parties on their birthdays but I never got anything because my stupid uncle died before I was even born.\" More or less.",
              "id": 49,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1308,
          "content": "Yeah my cousin died in a horrific crash just before his life was about to get really fun and interesting…. We all drink coors light (his beer brand) on his birthday and anniversary and post pictures wherever we are. It’s been going on for 20 years and I don’t see it stopping anytime soon….. never celebrating birthdays again is abusive to their other children. Abusing their daughter bc she allowed a birthday party for their grandchild is absolutely unhinged. \n\nOP, you only made that promise under duress. They were emotionally manipulating you and are continuing to do so.\n\nYou and your family need therapy. \n\nYou and your husband need couples counseling bc you absolutely are harming not just your relationship with your husband but also potentially, your daughters development and growth. \n\nThe grown up ex-JWs that I know all harbor a lot of resentment over never being allowed to celebrate, let alone get celebrated by their family. \n\nAlso, have you thought about what will happen when your daughter is in daycare/school and other kids have birthdays and parties and presents and cupcakes. \n\nDo you seriously expect a child to understand why a long dead relative means she can’t have a normal childhood? What does she tell her friends? “I don’t have birthday parties bc my uncle died.”\nEVERYONE has uncles pass away. Granted your family has suffered an incredible loss but your parents will absolutely harm your child if allowed contact without prior professional intervention.",
          "id": 50,
          "comments": [
            {
              "score": 248,
              "content": "My family always has a lobster dinner on my departed grandma and aunt’s birthdays because that’s what both of them always wanted for their birthday dinners. It’s a nice way to remember them once every year. My aunt even died the day after her birthday, so I can get the weirdness of someone dying on or very close to their birthday. You can’t focus on the death part. I try to forget death dates even though it’s hard sometimes. My dad’s beloved uncle died on my dad’s birthday, should he never celebrate his birthday again because his uncle died on it 20 years ago? This family needs counseling very badly.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 197,
              "content": "My husband’s family goes to the same lake resort every year (going on 50+ years), when his grandma finally passed away, to celebrate her life every year on Thursday during the vacation week (the one day she would go to the bar at the resort) everyone gets a banana banshee cuz that was her drink of choice. When his uncle died, a Coors was added to the option list for that night because that was his drink of choice. \n\nStuff like THIS is how you remember someone. \n\nIt makes me think of movies like Coco or Moana where something gets banned because something bad happens ONCE and all it does is cause pain and misery for everyone instead of actually helping. \n\nOP needs some serious help",
              "id": 52,
              "comments": [
                {
                  "score": 13,
                  "content": "i dated someone who struggled with addiction for 2.5 years, until he died. for his first birthday after he was gone i got a large single slice of cake and a 0 candle, sang happy birthday in my head and blew out the candle. call it morbid but i found it funny and comforting, a more approachable way to grieve and still find joy in the life he lived. imho i think that’s how it should be done",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "You just hate to see people passing so young, before they can really enjoy life. Having children, traveling around the world, enjoying beer other than Coors Light...\n\nIn all seriousness, I think it's great you found a simple yet highly symbolic way to honour your cousin's memory, and turned it into a great tradition. Death is tragic, but life needs to go on for everybody else.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "My grandmother broke her hip about 2 minutes before her 90th birthday party, wasn't in a lot of pain so we had the party anyway, she ate a bunch of cake and was surprised about 10 times in a row by a card that played banjo music, and then the ambulance came and she went to the hospital and was never really lucid again, died within the week. 10/10, perfect exit, good job Grandma. And so we eat big slices of chocolate cake in her honor. \n\nAlso for a while, there were also the Grandma S Memorial Kahlua Shooters, in honor of the time she had one, licked all the booze and whipped cream out of the chocolate shot glass, and demanded refills. You can get stuck in grief, or you can move through it and with it and find joy where joy can be found. \n\nI hope OPs family gets the help they need.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "See this is a wonderful wholesome celebration of his life. It is not something that will build resentment",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "APPLAUDS!!!",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 565,
          "content": "Seriously weird behaviour.  My uncle hung himself Christmas morning but we didn't stop celebrating Christmas, you can't live your life mourning the dead.",
          "id": 58,
          "comments": [
            {
              "score": 230,
              "content": "Buried my father in law on Christmas Eve one year when we had four of his grandchildren under five years old. My mother in law insisted on coming home from the funeral and having the kids open their presents. So we did. Kids were happy, too young to understand anything, really, except it was Christmas.",
              "id": 59,
              "comments": [
                {
                  "score": 111,
                  "content": "Cannot imagine the pain y'all were at that moment, but I applaud the grace your MIL had and how you didn't let the kids have a bad memory for the day. I imagine that's what their grandpa would have wanted as well.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 6,
                      "content": "It probably helped her feel better. Kids are the best reminder that life goes on. \n\nMy mom died the day before Thanksgiving years ago and someone from her church hooked us up with one of those take and bake full Thanksgiving dinners, like from a grocery store or Cracker Barrel or something. It just showed up at our door and I don’t know who did it. But it gave us a wonderful sense of normalcy on a very not normal day. And we did have a lot to be thankful for. \n\nI still definitely think about that time of my life every Thanksgiving, but I wouldn’t consider not celebrating Thanksgiving.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "My mother died on tax day, but I still pay my taxes every year. \n\n(This may sound like a joke, but it’s actually true.)",
                  "id": 62,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 176,
              "content": "That must have been hard to celebrate at first. Glad your family could recover and continue Christmas.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Agreed. My husband's father died on his 30th birthday. Sure he's a bit sad now when his birthday comes around, but that doesnt stop us from celebrating his birthday anyway. Who in their right mind would WANT their loved ones to dwell on sadness?",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "One can live their life mourning the dead, in fact, we all have to at some point. But they aren’t moving through the stages of grief. They aren’t moving beyond the mourning. Thats the issue.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I'm so sorry about your brother!!",
              "id": 66,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 297,
          "content": "Imagine what it's gonna be like for the kid when she's older.\n\n''Mommy, why don't I get to have a birthday party like my friends?''\n\n'Sorry, kiddo, but someone in the family died, and we decided to never have birthdays ever again. How old are you again?''",
          "id": 67,
          "comments": [
            {
              "score": 19,
              "content": "It sounds like some lame plot point from a bad sitcom - friend of the main character has a family that never celebrates birthdays due to some tragedy, so the friends all rally together to throw their poor deprived friend the BEST BIRTHDAY EVER!  (Freeze frame-cue credit music)",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 278,
          "content": "They're literally punishing this child for daring to be given life while OP's brother is dead.",
          "id": 69,
          "comments": [
            {
              "score": 23,
              "content": "Right? OP must have never even considered the path this would lead them down. What about when the kids go to school and see other kids celebrating their birthdays? What about when the kids become adults and start celebrating their own or other's birthdays? Will OP shit on their adult children too?\n\nDon't even get me started on OP's mother *calling to condemn celebrating their grandchild's first birthday.* And OP taking that side?\n\nLike, what did I just read...",
              "id": 70,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 203,
          "content": "Agreed. This\n\nThe OP. YTA\n\nDo they expect you to never celebrate the birth of your child ever because they can not deal with the grief of losing your brother?  They need counseling and you need to apologize to your husband. Wow",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 149,
          "content": "Imagine thinking this is normal? Holy shit... \n\nI feel bad that the husband married into this and the daughter was born into it.",
          "id": 72,
          "comments": [
            {
              "score": 5,
              "content": "\"Imagine thinking this is normal? Holy shit...\"\n\nwell, this sort of bat shit stuff doesn't occur in a vacum, I'd hazard that OP's family are in some sort of fundie cult type religious community or something else weird is going on in the wider context that is normalising that behaviour.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 126,
          "content": "YTA. \n\nThis. We lost someone tragically on Christmas Day. Christmas Day. While we are sad every year when Christmas comes we don’t tell everyone to not celebrate because we had a tragedy on that day. \n\nAlso the mother of the child does let everyone celebrate Christmas and decorate even though she says she can’t do it. She doesn’t stand in anyones way if they want to celebrate Christmas. \n\nAlso wtf with no one allowed to celebrate a birthday?! I could see if it was one day like in my family but to have NO ONE celebrate their birthdays?! That’s nuts. I suggest counseling for everyone.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 108,
          "content": "This is honestly a very deep trauma and I think all of the people in her family need to go to therapy. How do they think these kids will feel when they turn milestone ages and they can’t celebrate because of somebody they never met? It would be devastating.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "They don't need some therapy. \n\nThey ALL NEED LOTS of therapy.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16332,
      "content": "YTA SO HARD 😂 so any kids you have are never ever allowed birthdays because your brother died? Your family all need counselling.",
      "id": 77,
      "comments": [
        {
          "score": 3333,
          "content": "Reminds me of a political dictator’s dying wish. It’s absurd.",
          "id": 78,
          "comments": [
            {
              "score": 2025,
              "content": "Except I strongly doubt the brother would want this. Imagine knowing your family and their future families never celebrated another birthday?",
              "id": 79,
              "comments": [
                {
                  "score": 649,
                  "content": "Yes, that’s why I think it’s absurd! Only a crazy narcissist would be pleased no child ever celebrated a birthday again in their honor.\n\nI hope this isn’t what he wanted, but tbf, I didn’t know him.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 110,
                      "content": "Ok I’m case it wasn’t clear I guess I will proudly state I don’t want anyone to use my death to become a self flagellating perpetual funeral dirge",
                      "id": 81,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 190,
                  "content": "I think that’s what gets me the most. I don’t know a single person that would want this after they pass away",
                  "id": 82,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I would be like wow wtf. I would be touched if my parents threw a memorial on my birthday every year. I would be touched if my siblings kept it up. \n\nBut being an anti party? Ohhh man. What a terrible legacy.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I wonder if it's not just an honor thing and more of a superstition at this point? Since he died on his birthday. Like it'll be bad luck to celebrate any more.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 191,
              "content": "The Kim Jong birthday party package - you don’t get a party.  FOREVER.",
              "id": 85,
              "comments": [
                {
                  "score": 14,
                  "content": "Yep. NK is what immediately came to mind.",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Things like this really help me understand why we keep falling into fascism. People think appeasing the most bombastic members of society to “keep the peace” is the right course of action. Crazy.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 922,
          "content": "Do you want generational trauma? Because this is how you get generational trauma.",
          "id": 88,
          "comments": [
            {
              "score": 145,
              "content": "THIS post is one that everybody needs to read a few times and deeply ponder which things they are doing that promotes generational trauma.   Obviously not celebrating anybody’s birthday forever more is causing generational trauma.  But there are so many things being done today amongst our own families that it is a cause for great concern.  Just saying.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I didn’t make the connection until I read your comment but WOW you’re right, literally watching it happen in real time that’s crazy",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 272,
          "content": "Seriously this is so odd lol. Like idk how old the cousins are (if any) or were when it happened but can you imagine being told you won’t be celebrated your bday over something you have no control over??? Can they go to their friends bdays???? Like what a childhood.",
          "id": 91,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 252,
          "content": "It reminds me of Coco. No one is allowed to play music per the mom’s edict until Coco brings music back to the family. This sounds like some kind of movie plot and the daughter will bring birthdays back. Mom will scream “No birthdays!!!” and throw a cake. Daughter runs out of the room crying. She comes back with a wrapped gift and a cupcake. “I got this for your birthday,” she says through sniffles. Mom takes a bite of the cupcake and her whole face glows. Yada yada the end.",
          "id": 92,
          "comments": [
            {
              "score": 69,
              "content": "It made me think of Footloose. A bunch of kids died, so the entire town was no longer allowed to dance",
              "id": 93,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "10/10 plot, can’t wait for Pixar to make it their next movie",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 205,
          "content": "Will she never let this little girl attend someone else’s party?",
          "id": 95,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 66,
          "content": "No kidding! And would this have been OPs brother's wish that no one in the family ever ever celebrate a birthday?",
          "id": 96,
          "comments": [
            {
              "score": 10,
              "content": "For real. The kids never knew him, but they're going to hate his memory. Poor guy.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Yeah and when does it end? Future generations?",
          "id": 98,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "This is straight up the plot of Disney movie\nLike not a joke this is almost the plot of the third little mermaid movie",
          "id": 99,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10197,
      "content": "YTA, and so is your birth family. Whole generations should not be made to mourn someone they've never seen, and neither should it be binding on the decedent's brother-in-law or niece.\n\nI'd suggest you tell your family you're finally done mourning your brother.\n\nYour daughter is entitled to have her birthdays celebrated. I can just picture in 5 years the lovely conversation you'll have: \"I know your schoolmates have birthday parties, birthday cakes, and birthday gifts, and you can't have one. That's because your uncle's dead.\" Jesus Christ on a Triscuit!\n\nIt's time to stop the madness.",
      "id": 100,
      "comments": [
        {
          "score": 1151,
          "content": "I am now going to start saying ‘Jesus Christ on a Triscuit’ when I am deeply frustrated. Thank you friend lol",
          "id": 101,
          "comments": [
            {
              "score": 507,
              "content": "I find \"Christ on a cracker\" has more brevity",
              "id": 102,
              "comments": [
                {
                  "score": 201,
                  "content": "I love the one from Outlander \"Jesus H. Roosevelt Christ\".",
                  "id": 103,
                  "comments": [
                    {
                      "score": 85,
                      "content": "I'm a fan of \"jumping jesus on a pogo stick\"",
                      "id": 104,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "I stick to what my Mom would say, ‘Jesus, Joseph and Mary!’ Sure on text it is boring. It the  big emphasis for the beginning of each name really sends it.",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Mine is “Elvis Fucking Christ”",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "And yet still not as delicious as Cheesus Christ on a Triscuit",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 619,
          "content": "You don’t even have to be done mourning your brother - if you don’t want to celebrate your birthday, you don’t have to.\n\nBut don’t put the onus of grief on your daughter. She might not know initially, but she will start to see other children get birthday parties and begin to resent your brother, which is the opposite of what you want. Let your child be celebrated. She is her own person.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 247,
          "content": "This post reminded me of my sister last year; our dad died about 2mo and a half before her son's first birthday, and she asked my brother and I what we thought; I told her it wasn't like it was the month after, there was enough distance that dad would actually be *pissed* if she passed on the opportunity to celebrate because of him.\n\nOP's brother died young, but I would hope he loved his family (even the ones he would never meet) enough to want them to be happy rather than sad, especially when it comes to something like birthdays.",
          "id": 109,
          "comments": [
            {
              "score": 5,
              "content": "Exactly! If I was in your situation and decided not to celebrate I'd wake up to a damn ghost decorating my house by my dad with \"wtf idiot\" written on the mirror haha",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "That’s my thought as well. I understand that her family is mourning, and I’m trying to be sympathetic, I really am. And to their point, a one year-old won’t remember THAT birthday. But what happens next year? Is this little girl never supposed to have a birthday party in her life?",
          "id": 111,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Mourning can last a lifetime. Sacrificing your children's  birthdays is not part of mourning.",
          "id": 112,
          "comments": [
            {
              "score": 10,
              "content": "Absolutely, but there are stages of mourning, and at some point, you gotta get to \"I'll always miss him, but he wouldn't want MY life to be over because his is.\"",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "“neither should it be binding on the decedent's brother-in-law or niece.”\n\nTell me you’re a lawyer without telling me you’re a lawyer 🤣",
          "id": 114,
          "comments": [
            {
              "score": 8,
              "content": "Heh. Three semesters of junior college and 36 years of truck driving...",
              "id": 115,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Right?!? If OP can’t let this go and dies on this hill, I hope dad will at least try to provide some normalcy for this poor child!",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "> I'd suggest you tell your family you're finally done mourning your brother.\n\nHonestly, it's okay to never stop mourning. The grief of losing a loved one often ends up being a part of you for the rest of your life. But that doesn't mean you have to let it destroy the good parts of your life.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "This is a good point. OP's grandchildren aren't allowed to have birthdays because their great-uncle died? Where does it end, or rather, start again? When OP's parents die? Who among this 'old guard' needs to die before this family can start celebrating the living again? This is insanity and the whole family needs grief counseling.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Seriously, how many generations are expected to follow this?",
          "id": 119,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6138,
      "content": "YTA. Your family is a bunch of AHs too. Instead of grief counseling they took away birthdays for everyone. That’s BS. \n\nYour daughter deserves to be celebrated and your family -and you- need to deal with it.",
      "id": 120,
      "comments": [
        {
          "score": 1590,
          "content": "If the family doesn’t want to celebrate their birthdays, that’s fine. But deciding it for everyone? Yta \n\nThat lil baby never even met the brother and is expected to join in not celebrating their birthday? The husband is so good for defending his daughter and celebrating her birthday.",
          "id": 121,
          "comments": [
            {
              "score": 508,
              "content": "I bet the extended family does celebrate birthdays, they just don’t tell them about it.",
              "id": 122,
              "comments": [
                {
                  "score": 346,
                  "content": "They probably just stopped inviting them so they figured the extended family stopped celebrating all together",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 160,
                  "content": "They probably walk on eggshells around OPs family. I would not be surprised if OPs family has already disliked this tradition for years on end and saw this coming from miles away. I’m surprised Husband didn’t see this coming miles away and nip it in the bud before their daughter was even born",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "I can imagine the mother doing the rounds, full of indignation about this granddaughter’s birthday celebration and everyone else realising that actually “the Emperor has no clothes”, and they decide or have already decided to stop this crazy ban on birthday celebrations.  It gets easier if one person takes the lead.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 222,
              "content": "If I was the husband/dad, this is absolutely a hill I would die on for my kid.",
              "id": 126,
              "comments": [
                {
                  "score": 36,
                  "content": "OP should be willing to die on this same hill, WITH her husband, FOR her child.",
                  "id": 127,
                  "comments": [
                    {
                      "score": 22,
                      "content": "It's weird that she's ready to kill her husband and child on this hill.",
                      "id": 128,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 87,
              "content": "Imagine thinking they can take away her husbands birthday too. Thats batshit crazy",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "The husband is a hero.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Her husband's family wasn't even allowed to celebrate with them!!!",
              "id": 131,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "She obviously expected her husband to follow suit! Get some grief counseling and stop fixating on birthdays. YTA.",
              "id": 132,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Dollars to donuts, everyone else, other than the parents, are having secret celebrations, too.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I picture them like a couple of old grinches, sneaking in and stealing joy from that poor baby.",
          "id": 134,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4508,
      "content": "YTA.\n\nYour brothers memory is being kept alive by conflict and resentment. Is that really what he might have wanted? That his remaining family would never again celebrate a birthday, and that they would shame people for doing so?\n\nI would be asking Zeus to loan me some lightning bolts if I were sitting up on the clouds and watching this unfold.\n\nI'm sure the memory is painful for all of you, but insisting that nobody in your family ever celebrates birthdays again is deranged. Cultures around the globe have been celebrating birthdays for millennia.\n\nAnd now you're being shitty to your husband who didn't really do anything wrong, other than not being willing to capitulate to insane demands from his in laws.",
      "id": 135,
      "comments": [
        {
          "score": 757,
          "content": "I couldn't have put this better! \n\nThe idea of never celebrating birthdays is ridiculous and so cruel to a child.  At 1, she won't notice.  What about when she's school-aged and she never has a party with her friends? Will your family have the same stance? What will this do to your daughter's psyche when she never has a special day? \n\nYour family is in dire need of therapy to move on from your brother's death.  Expecting everyone to cease celebrating birthdays is so misguided.  I much prefer the Jewish tradition of lighting a candle on the anniversary of a loved ones death. \n\nYTA, and you should apologize to your husband.",
          "id": 136,
          "comments": [
            {
              "score": 332,
              "content": "I worked at a daycare where 2 siblings were Jehovahs Witnesses (well, at least their parents were) and they had to leave the room for very birthday and holiday. It was so sad. They didn’t understand why, only that they were being separated and couldn’t have fun. FFS they weren’t allowed to decorate a snowman outline with cotton balls cause it was associated with Christmas.",
              "id": 137,
              "comments": [
                {
                  "score": 235,
                  "content": "I worked with a Jehovah’s Witness once. I was young and very big on giving out Valentine’s Day cards, birthday cards, etc. I would just hand her a card that had nothing to do with the holiday and it would just say have a great day inside of it. She seem to appreciate me, trying to include her how I could",
                  "id": 138,
                  "comments": [
                    {
                      "score": 56,
                      "content": "My friends and I used to do this for one our middle school friends on her birthday. We would wish her a happy Tuesday and buy cupcakes to celebrate whatever day of the week her birthday fell on that year lol. I had totally forgot we did that!",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "That's  very sweet of you to do. I think they get so used to being excluded they have nowhere to turn but the church. I'll try to keep that in mind as a suggestion for anyone who may have a similar dilemma  <3",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "I grew up JW from age 5 on. It sucked pretty hard to not share in birthday and holiday celebrations at school. Luckily for me I guess, my birthday was always over a school break.",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "My family didn't celebrate Christmas but they recognized that it was a big part of all my friend's lives in school. So, during my school years, they made an effort to do both. All so I wouldn't feel left out.\n\nThey didn't believe in pushing their religion on their kids and neither do I.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Family logic now is, \"she won't remember her birthday this year so why bother?\", but 5 years from now, it will be \"well she never had a birthday to remember, so why start now?\"",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 147,
          "content": "I would be unimaginably, deeply hurt that someone used me as an excuse to refuse to celebrate something so important to each new child in the family. Birthdays are nothing to the people who have had dozens of them, but that baby isn’t at that point yet. Like beat somebody with a baseball bat in the afterlife hurt. \n\nAlso have they even *seen* all those super sad posts about kids who never get birthday parties or their parents forgot? Kid would have hit class party age and been so confused and heartbroken.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": ">|cultures around the globe have been celebrating birthdays for a millennia\n\nHell, People in other cultures celebrate FUNERALS more than what OP and her family does. I won’t pretend to know what it’s like to lose a brother, but I’ve seen a couple lose their first child on her 21st birthday. Know what they did? They had a celebration of life and are getting by with the love and support of the family.\n\nIt is painful, but death does not have to be a total halt to living life. OP, You and your family are creating your own grief at this point solely by not moving forward.\n\nYou are addicted to your grief.",
          "id": 145,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "\\*rolls up ethereal sleeves\\* lemme down there, I'm gonna haunt some fools!",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "It's an extreme control situation where no one is ever allowed to have fun on their birthday so that they are all punished for his death. I'd bet money this isn't the only thing they're controlling about. For her to completely lose it on him is ridiculous. HER family caused the problem, and HE doesn't have to live by their decision. OP sounds not only controlling but has a completely unhinged anger management problem. YTA",
          "id": 147,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3681,
      "content": "YTA. This is incredibly unhealthy and your entire family needs professional help.",
      "id": 148,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 2903,
      "content": "[deleted]",
      "id": 149,
      "comments": [
        {
          "score": 469,
          "content": "Agreed. With this kind of thinking, the daughter will be living in OP’s brother’s shadow forever. That little girl deserves a chance to celebrate/appreciate the life she was given without feeling guilty about it.\n\nI’d suggest OP (and the entire family) seek some healing for the loss of your brother. Please find a better coping mechanism than ignoring birthdays forever.",
          "id": 150,
          "comments": [
            {
              "score": 143,
              "content": "Plus the daughter could end up hating someone she doesn't even know because of the family she was born into. Husband should celebrate his daughter with his family. OP should really ask herself what is most important to her. Because sadly, it sounds like its her parents vs her husband and child.",
              "id": 151,
              "comments": [
                {
                  "score": 12,
                  "content": "No just resent her dead uncle but OP and OP's family too for forever going along with bs reason to stop celebrating birthdays. She's a baby now but she'll notice when she's older that other kids get birthday parties and no one is making a fuss about not honoring a dead person.",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "He should also like get a divorce",
                  "id": 153,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "And even if one believes the dead can still perceive the  living world, would your brother really want everyone to give up their birthdays for him?\n\nI can't imagine any decent person who would want that.",
          "id": 154,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Agreed!\nIf it’s that big of an issue then the husband should take daughter for the day to do a party with his family. Just because she doesn’t want to celebrate doesn’t mean her kid gets to be robbed of that childhood experience\n\nThat’s a last resort though. Obviously they all need therapy and should try that.",
          "id": 155,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1396,
      "content": "Yta - and yes, you should apologize. This \"tradition\" is ridiculous. What's going to happen when she's 5? Why after all that time would it suddenly be okay to celebrate birthdays again? Frankly, I wouldn't have had a child with you in the first place but since he did... you can tell your family to get over it, or you can expect for your daughter to spend her birthday without you.",
      "id": 156,
      "comments": [
        {
          "score": 409,
          "content": "Imagine when she's old enough to get invited to her friends birthdays. Or people at school wish her happy birthday. It's a huge social thing. They're really going to keep her from that? Goodness gracious.",
          "id": 157,
          "comments": [
            {
              "score": 133,
              "content": "She probably won’t get invited when other parents find out the family doesn’t celebrate birthdays. If you’re offended by birthdays, people aren’t going to risk drama by inviting your kid.",
              "id": 158,
              "comments": [
                {
                  "score": 32,
                  "content": "My kid is 3. Invites just go to the entire class a lot of the time. And birthday treats come into class all the time too. Birthdays are unavoidable and OP is setting this kid up to feel neglected when they see how classmates get to celebrate their birthdays.",
                  "id": 159,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I agree completely, but I think the person you're responding to meant birthdays generally -- even past elementary school. As in -- she won't get as many invites, and will lose out on valuable friendships, etc. Socializing children is extremely important and OP is setting their child up to lose out on possibilities.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Yeah she'll get treated like Jehovah's Witness kids. Excluded, sent out into the hallway during class parties.",
                  "id": 161,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "My daughter is 4 and goes to preschool. All they ever talk about is birthdays. Everyone is excited about the upcoming birthdays. It’s the biggest thing in their lives. It would crush that kid’s heart to not have birthdays. What a fucked up “tradition”.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I guess he didn’t think she would try and ban her infant daughter from having birthdays because someone she never met died.",
          "id": 163,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1260,
      "content": "YTA\n\nGrief is one thing, but this is control. What is wrong with your family and why are you humoring it? I'm disgusted.",
      "id": 164,
      "comments": [
        {
          "score": 174,
          "content": "The family probably thinks that anyone who celebrates their birthday is going to die 😱😱. It's ok for the parents (and anyone else) to grieve how they see fit, but they don't get to tell others to stop life and living on their own birthdays (and in this case) the birthday of a child. \n\nOP YTA!! Don't bend to your parents!! Have a united front with your husband, you know! The person you sleep with and created a child with. Tell your parents you understand their grief but you have a child now and you will not stop celebrating birthdays and THEY don't have to attend. You will instead say a remembrance prayer or light a candle or remember your brother some other way on the day of his birth/death.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 893,
      "content": "YTA\n\nYou can't just unilaterally decide your kids don't get birthdays if your husband doesn't agree. He doesn't agree.\n\nDraw boundaries with your family. They can do what they want, it doesn't obligate your husband to deprive his own child of celebrating birthdays.",
      "id": 166,
      "comments": [
        {
          "score": 180,
          "content": "She's going to be very disappointed when they end up divorced, he throws their daughter a big blowout birthday party, she runs to the court asking the judge to rule that husband can't do this any more, and she gets laughed out of court.",
          "id": 167,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": ">You can't just unilaterally decide your kids don't get birthdays if your husband doesn't agree.\n\nThis. If birthdays (or lack thereof) are so important to you OP, shouldn't this have been discussed before children? Before *marriage*? It's not like you had no idea there would be some birthdays on the way.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}