{
  "post content": "I share a hallway with my neighbor, and this morning around 3am, I was awoken by a HUGE crash which was obviously someone falling down the stairs.  I went into the hallway to find my neighbor half dressed (her pants were pulled down around her upper thighs exposing her butt) and moaning.  She was obviously drunk, but she has also obviously fallen down a flight of stairs.  \n\nShe didn’t seem injured, but she was disoriented, and at first she was okay with me calling the ambulance, but by the time the EMTs got there a few minutes later, she had started to not want them to come.  She decided to go back upstairs.  I led them to her and got out of the way.  They did assess her and I heard her complaining that I was “in her business.”  They convinced her to go to the hospital I guess just to be checked out since she had been drinking.\n\nNow this was a fall on my landlords property, so I thought he should be aware.  I sent him a text telling him that she had fallen and that I called the EMTs and they took her for assessment.  I also mentioned that she wasn’t happy with me calling, but I didn’t mention that she was drunk or half naked… only that she had been disoriented. I was thinking of liability and that he should be aware.\n\nWhen she came home, I am pretty sure I heard her complaining that I “called everyone.”\n\nSo… AITA?\n\nEDIT:  let’s start by saying I am TA for contacting the landlord. That’s the general consensus, although it’s not unanimous. I accept that judgment.\n\nHowever, I don’t accept the motives people are ascribing to it.\n\nNow that I’ve had time to process the whole thing, I feel like I need to respond in general to the idea that I said anything with a motive of either getting her in trouble or spreading gossip.\n\nIf I had wanted to get her in trouble, she’s done other things that I could’ve complained about reasonably. I haven’t because that’s not actually my goal. I have no desire to get her in trouble. The sense that she does that annoy me or in frequent enough that I can let them go.  Some of them are just annoyances like noise complaints, and one is more serious that I don’t feel comfortable putting on here. It hasn’t affected me directly, but other neighbors have also complained about the same thing to me.  That problem involves a boyfriend that she appears to no longer be with, so it’s not really an issue.\n\nI know the stairs are a little bit shady. I think they’re in code, I don’t feel comfortable climbing on myself, my previous neighbor fell down them once but not as seriously. I think the main problem that I see with them is that you have to stand on the top step and lean back to unlock the door. So is it possible that the fall was caused by the configuration of the stairs? Yes.\n\nFalling down the stairs is not an annoyance. It’s an emergency.  So let me explain a little bit where my mind was last night.  \n\nI was very sound asleep when I was woken up. It was a loud stumbling crash followed by very weak moaning.  I was scared. It took me probably two minutes to get up the nerve to open the door because I don’t have a peek hole and I had no idea who or what I would find, but I did that someone was probably hurt.  there was no light shining under the door so The hurt person had to be leaning against the door.  I remember being afraid that whoever it was would fall in to my home, and since I didn’t know who it was or what was happening, that concept scared me.\n\nI also recognize that the likelihood was high that it was my neighbor, and that she was probably hurt.\n\nI open the door and found what you know: a crumpled up half naked unconscious (I’m not sure if I should be saying semi conscious because she was moaning) girl.\n\nI was not thinking “Oh cool! What a great story.“ What I was thinking was “oh shit. What do I do?“\n\nI was scared and trying to do the right thing. So yes… I am TA for making a bad decision to contact the landlord, but I did not make that decision because I wanted to hurt anyone. And it really bothered me that so many people said that’s why I did it. So if I appeared to be arguing against that judgment, that’s why.  I wasn’t arguing against the judgment itself, but rather the motives people have ascribed to my decision.\n\nI accept my judgement, though.",
  "id": 1,
  "comments": [
    {
      "score": 2719,
      "content": "NAH but you didn’t need to call the landlord. She would have contacted him if she needed to file a liability suit. She is borderline an AH to herself for being so drunk and not accepting help from someone. But she does deserve some privacy.",
      "id": 2,
      "comments": [
        {
          "score": 732,
          "content": "That’s A good point. I didn’t think of that… I was pretty groggy. But that really is a very good point.",
          "id": 3,
          "comments": [
            {
              "score": 151,
              "content": "Jumping in to say in Australia the insurance broker or company would appreciate being notified. This means the landlord is able to write up an incident report and note she was taken to the hospital and was drunk. If she decides to take make a claim it is easier for the landlord because he has doesn't have to find out the facts afterwards.",
              "id": 4,
              "comments": [
                {
                  "score": 43,
                  "content": "Yeah, where I live as well you are supposed to notify insurance asap of any incidents like this.",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Also at least here in the US, even if someone is trespassing illegal on your property, if someone is on your property and gets hurt, you’re responsible. Since she/you rent, I’m not 100% how this plays in with the landlord however.",
                  "id": 6,
                  "comments": [
                    {
                      "score": 8,
                      "content": "You are responsible if they get hurt on/doing something that a regular guest or EMT would be likely to get into. Sure they can *sue* for any reason but you aren't paying a burglar who smashes a window or a trespasser falling off your roof. You're paying if someone falls down stairs or a deck breaks or you left a pit in your backyard.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Sounds like the stairs are completely dodgy since you can’t open the door without leaving back over the stairs! Wouldn’t fly in Australia",
                  "id": 8,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Honestly, hindsight is 20/20. I don't blame you and would probably have done the same. From your post and comments it seems that your gut reaction was \"how can help my neighbor.\" Even if it wasn't the perfect response, we're all human and make mistakes, especially at that time of night. It's laudable that you chose to help when many in this world choose apathy.",
              "id": 9,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 453,
          "content": ">you didn’t need to call the landlord\n\nSeriously.  I mean, sure, look out for the medical well-being of the woman, but don't trouble yourself over the landlord's liability issues.  None of that shit is your concern, OP.  Above and beyond the ambulance piece, just mind your own business.",
          "id": 10,
          "comments": [
            {
              "score": 64,
              "content": "It stopped being the neighbor's private business the second she got so irresponsibly wasted that she was loud enough to wake OP up.\n\nCalling the landlord is entirely appropriate.",
              "id": 11,
              "comments": [
                {
                  "score": 132,
                  "content": "I'm a landlord.  She didn't die there.  There's not reason alert the landlord, unless this is a frequent event.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Seriously curious, not asking a Gotcha: \n\nOP said the configuration of the stairs is wonky - having to lean back on the top step to unlock the door? That does sound like it might be a legit liability for the landlord. \n\nDoes that affect whether or not you think the landlord should be contacted? \n\nIt almost sounds like a converted residence, and maybe this is a common enough event that the landlord should be notified every time, so they can figure out a way to mitigate the problem.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 68,
                  "content": "I'm a landlord.  No, it's not.",
                  "id": 14,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 112,
          "content": "[removed]",
          "id": 15,
          "comments": [
            {
              "score": 49,
              "content": "Umm.. Wouldn't it be a good think that he called the ambulance and the landlord then? I mean OP did not call her a drunk, just said she looked looked drunk at the time. Also, if you have your pants down and fell down the stairs while being disoriented I'm pretty sure the landlord was gonna find out eventually anyways. That is the least of the neighbor's problem, whether she is a drunk or someone who got roofied (especially the latter).",
              "id": 16,
              "comments": [
                {
                  "score": 35,
                  "content": "Ambulance sure. Though don't tell dispatch that the person is drunk, that lessens the chance of anyone coming in a timely manner or at all. Just say they're disoriented and not entirely coherent after a fall down the stairs. That can be due to a lot of things such as head trauma and will get the EMTs there fast-ish.\n\nLandlord? Eh, next morning maybe. Unless there's an obvious need to for a clean up.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 19,
                      "content": "I don't know where people get the idea that an ambulance will delay just because of the context.. like at times if multiple calls come in at once, they will be sent to the most acute sounding, but mutual aid/other units will be activated as soon as that decision is made. \n\nContext is everything to dispatch/EMTs. providing as much info as the caller has is important to assure proper resources. \n\nIf you suspect a service is neglecting to respond when available to a call (regardless of type) they need to be reported to the governing agency of EMS in your area/ medical director. That is inexcusable.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "I was thinking more because the landlord could get sued because of the stairs. And also because her pants were down. That can mean a lot of things, like she peed somewhere in the lobby (sadly not unheard of since drunk people do not make the best choices) or worse she was attacked (though hopefully not since she was not acting like she was running away). Also there could be complaints due to exposure (especially since a kid could have reasonably see her with her butt out) and the landlord may want to cover their OWN butt by filing a complaint. \n\nDid OP HAVE to call the landlord? No. Was it nice that they did? It was nice to the landlord. I would choose making my landlord happy over some rando neighbor.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "If my neighbor falls and possibly damages an area I share with that neighbour you bet your ass I'm letting the landlord know. I don't want to end up possibly being held responsible for that crap.",
          "id": 20,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Yeah, not the A for calling an ambulance, drunk people can be terrible at assessing their injuries.\n\nYTA for calling the landlord. That sort of thing can put her tenancy at jeopardy depending on where you live. In some places, it's not uncommon to have a \"no cops\" stipulation in the rental agreement, and at least where I live, cops always show up with EMTs.",
          "id": 21,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -4,
          "content": "If she wanted privacy she should have kept her naked, dunk ass home instead of flashing in public. A stairway in an apartment building is public. Also what if she had been hurt and lied to the landlord about what happened? Even with the medical records she could have caused trouble.",
          "id": 22,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -79,
          "content": "An ambulance ride can cost 1500 dollars and not covered by insurance if the emergency room does not admit you. Calling an ambulance for a person who seems Ok is a bit excessive. if you are in UK or Canada call away. But calling the landlord was just malicious. YTA.",
          "id": 23,
          "comments": [
            {
              "score": 100,
              "content": "jellyfish combative muddle detail include fine illegal disagreeable depend recognise\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
              "id": 24,
              "comments": [
                {
                  "score": 32,
                  "content": "I had a crushed T10 vertebrae after a rollover accident.  Adrenaline was pumping, and I had **NO IDEA** my back was broken at the time.  I even tried to *climb up out of the ravine* that my car was in.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I also broke my T10 after rolling a car 6 times. Adrenaline is still my favorite drug because even with the broken back, a partially collapsed lung, and brain bleeds, I crawled out of my window and walked away from the car. No clue how fucked up I actually was.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "When I was 13 I was hit by a car. I got up, no idea that I'd broken several bones and my ear was dangling, and I was horribly upset that I couldn't find my glasses. Several adults had to make me sit down until the ambulance arrived. \nMy glasses turned out to be in my hand the entire time.",
                  "id": 27,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "About two months ago I accidentally whacked my head on a concrete wall at work, it stunned me but I didn’t fall or pass out. I tried calling my supervisor and when I couldn’t get a hold of her I just went about my work until I could, I wasn’t in any pain at the time and I wasn’t dizzy. My supervisor kept asking if I wanted to go home, but I kept telling her no because if I had gone home and passed out no one would know until later in the day and going to the hospital never crossed my mind though it should have. After the adrenaline wore off I had a sharp pain for like five minutes then everything was fine again, it did bruise a little and didn’t seem to swell much. \n\nTwo weeks after that I started getting bad migraines that wouldn’t go away, like I’d have it all day, go to bed with it and wake up with it, it was interfering with work. My doctor suspected a concussion and prescribed me some stuff that didn’t really help, so I’ve been riding it out and thankfully the migraines are not as bad and don’t last as long, but they still are a daily occurrence.\n\nIn all of my 31 years of life I’ve never had migraines and now I think I’ll be living with them daily because I didn’t get the proper help when I needed to because at the time of the accident I felt fine. I do plan on getting some scans done just to make sure everything is fine up there.",
                  "id": 28,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 58,
              "content": ".... Falling down a flight of stairs is a \"seems OK\" situation??? 😳 That's. So depressing.",
              "id": 29,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "Unless you're a trained medical professional, you can't be the judge of whether someone who has just falled down a flight of stairs \"seems ok\" or not. They could have a concussion, spinal injuries, internal bleeding etc. OP did the right thing calling for an ambulance and paramedics who ARE trained for this stuff. NTA",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "[deleted]",
              "id": 31,
              "comments": [
                {
                  "score": 23,
                  "content": "Yup.\n\nMy 1 year old was rushed to the ER via ambulance from a doctor’s office and spent 5 days in the hospital’s pediatric unit.  Still got a damn bill and insurance wouldn’t cover it because… fuck us, I guess?\n\nOP is NTA for calling though.  Unless OP is a trained medical professional, OP has no business triaging someone who could have sustained internal or other injuries from a fall down the stairs.  That’s why you call.  If they decide to take her, that’s based on her medical presentation.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Yeah - I took an ambulance, going into septic shock, got a week in ICU and thought the ambulance would be a simple co-pay. Nope - $1500, which thank goodness didn't break us.",
                  "id": 33,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Canadian here. Ambulance not necessarily covered.",
              "id": 34,
              "comments": [
                {
                  "score": 1,
                  "content": "I heard it's super expensive in Saskabush.\n$80 in BC if you get a bill.",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "This is not true - inpatient admission is not a criteria for an ambulance transport to be a covered service. If a reasonable person believes that the situation was an emergency, the transport is a covered service. If the transport is denied, the patient can appeal in writing. \n\nIf the transport is a covered, out of network service, the patient may owe the difference between the insurance paid amount & the billed charge. Again, you can appeal the insurance company’s decision and request (in writing) that the transport be treated as in network because a reasonable person believed it was an emergent situation. \n\nSome insurance companies will deny emergency department visits if the patient is not admitted but this too can be appealed in writing.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 948,
      "content": "NTA for calling an ambulance but YTA for calling the landlord; their liability is not your business.",
      "id": 37,
      "comments": [
        {
          "score": 167,
          "content": "That’s fair. I wasn’t considering my business as much as considering it… Polite? But I see your point.",
          "id": 38,
          "comments": [
            {
              "score": 306,
              "content": "It's polite to let your landlord know that their tenant fell and broke their leg, if tenant asked you to do so. Otherwise it's just you telling someone else's business to others.",
              "id": 39,
              "comments": [
                {
                  "score": -184,
                  "content": "No… I don’t even know if she was injured myself. I didn’t let him know anything that happened. Except that there was an incident on his property.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 165,
                      "content": "The point is still that the faller didn't ask you to reach out to anyone.",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "I don't see anything wrong with calling the landlord.   \n\n\nWhat if Drunken Neighbor decides to sue the landlord for negligence (instead of her own drunkenness) causing her fall? The phone call ensures that the landlord now has\n\n* a witness\n* a reasonable defense in case of a frivolous lawsuit from Drunken Neighbor.",
              "id": 42,
              "comments": [
                {
                  "score": 65,
                  "content": "OP isn’t actually a useful witness, because OP didn’t witness the fall. Drunk people can still be harmed by negligence.",
                  "id": 43,
                  "comments": [
                    {
                      "score": -1,
                      "content": "True. I figure OP is still a useful witness as Drunken Neighbor did not blame the condition of the building for her fall at that time and that she also decided she did not want/need medical assistance.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Polite to tell other ppl’s business?",
              "id": 45,
              "comments": [
                {
                  "score": -3,
                  "content": "Again… The fact that she fell down his stairs is his business as well as far as I was concerned. What I didn’t tell him was that she was half naked and drunk.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Do you text your landlord every time you fall? Absolutely weird, man.",
                      "id": 47,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "[removed]",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Nope. The landlord should be advised if there is an issue with a material defect which could lead to injuries, property damage, or security issues. Not embarrassing info about residents.\n\nThey are the property owner. Not their parents",
                      "id": 49,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "[removed]",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Don't listen to these people OP. You did good. An accident happened on the landlords property. It's not unreasonable to assume this lady might sue . Giving the landlord a heads up that an accident happened and that the person was intoxicated is just being a decent person.\n\nDo you owe it to them, no. Is it your business, no. It's still the decent thing to do. \n\nThis sub is full of miserable people who are all about \"mind your own business\". Don't let them bring you to their level. Keep being a good person.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "It's not polite. You gave the landlord a reason not to renew her lease. It also gives the landlord ammo to charge her for any damage done to the stairs even if it wasn't her fault (maybe they needed maintainance anyway). Sharing someone's health scares is not polite. It's very rude.",
              "id": 52,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Yeah YTA. You should not disclose someone else’s medical information to anyone unless given specific permission.\n\nIt’s not polite. You’re either a people\nPleaser or a busybody.",
              "id": 53,
              "comments": [
                {
                  "score": 19,
                  "content": "This is I think with the disconnect is. Many of you seem to think that someone falling constitutes medical information. I would say that the cause of the fall and the results of the fall with both constitute medical information, but not the fall itself. Like a car accident. If the person was drunk and caused the accident, that’s medical information. If they are in serious but stable condition, that’s medical information. The fact that they had a car accident is not medical information.  \n\nSo I get that I was TA in saying something to the landlord, but I don’t think that I was TA for Disclosing medical information because I don’t think any medical information was actually disclosed.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Yeah, the hospital or her insurance will gladly reach out to the landlord to let him know about the incident and expect him to pay. \n\nMy son fell at my parents house running around and my medical insurance tried to get my parents homeowners insurance to pay the bills... 🤦",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I'd agree it's unnecessary and maybe a bit weird, but it makes them an asshole? Really?",
          "id": 56,
          "comments": [
            {
              "score": 6,
              "content": "Partial asshole because it was unnecessary to call the landlord.",
              "id": 57,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 0,
          "content": "[removed]",
          "id": 58,
          "comments": [
            {
              "score": 13,
              "content": "Here's the link to the comment you're ripping off in order to karma farm.\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/qon6y1/comment/hjo35ly/",
              "id": 59,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 421,
      "content": "[deleted]",
      "id": 60,
      "comments": [
        {
          "score": 108,
          "content": "That seems to be where the controversy is. I did it because my thought was that there was an incident directly related to his property. It wasn’t like she had a seizure… She fell down the stairs, and that Is something he’s responsible for in someway. It’s not a big corporation… It’s just a guy. I thought he should know  there was an incident.  The judgment seems to be that I was wrong there though.",
          "id": 61,
          "comments": [
            {
              "score": 178,
              "content": "[deleted]",
              "id": 62,
              "comments": [
                {
                  "score": 38,
                  "content": "Well, in the text, I just said “I figured you should know since it was a fall on your property.” That’s all.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 67,
                      "content": "If the fall was caused by some property defect or maintenance issue, and you’re concerned for your own safety or that of others, then yes, you could alert the landlord to an ongoing safety issue with the property that is his obligation to fix. But by your own account it seems the fall was because your neighbour was drunk. So there is zero the landlord can do and no need to inform him. It just comes across as dobbing on your neighbour and potentially makes the landlord see her in a negative light.",
                      "id": 64,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 50,
              "content": "The only way he would be responsible is if he had neglected to fix the stairs or if they weren't up to code.",
              "id": 65,
              "comments": [
                {
                  "score": 23,
                  "content": "I don’t know if they were up to code or not. It’s possible they aren’t. It’s an old building.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Often older buildings are grandfathered in, and aren't required to rebuild as codes change unless it is a clear and direct safety issue.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 0,
                  "content": "[deleted]",
                  "id": 68,
                  "comments": [
                    {
                      "score": 1,
                      "content": "There are insurance reasons that would hurt the landlord because of the neighbor's alcohol intake?",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Every place I've rented has had a specific rule about notifying management if you call emergency services for any reason, idk why but I never questioned it until now. Maybe it's a US thing?",
              "id": 70,
              "comments": [
                {
                  "score": 16,
                  "content": "I’m also in the US.\n\nSomeone told me that I said very clearly that I’m not from the US. I am, but I use voice to text, and I think somewhere in here I might’ve said I’m an American and it recorded as I am not American… But I can’t find it. But I am an American.",
                  "id": 71,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I’m an insurance defense attorney and I handle a lot of slip and falls. You’re not even a little bit the AH for calling the landlord, although you certainly weren’t obligated to do so. NTA for any of this.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "if she didnt fall because of the handrail breaking, bannister cracking, step giving way, trip hazards or other negligence or improper maintenance of the building its not really his concern, especially at 3-4am and adding to that saying shes not happy with you is getting him involved in drama his not a part of. \n\nYou could have at least left it until a reasonable hour the next day if you really felt you need to tell them as more of a \"just letting you know, someone fell down the stairs while disorientated and was taken to hospital last night. If anybody contacts you about it i witnessed what happened\"",
              "id": 73,
              "comments": [
                {
                  "score": 6,
                  "content": "I didn’t call… I sent a text. The nice thing about texts is people can answer them when they feel like it.",
                  "id": 74,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 167,
      "content": "NTA for calling EMTs,  YTA for alerting the landlord.  This wasn’t anything they could have done at the time. This might have been a one time thing with the neighbor being that drunk and you embarrassed her for no reason.",
      "id": 75,
      "comments": [
        {
          "score": 12,
          "content": "I can say it’s not a one time thing. I have had a number of reasons to complain about her and never have.  I still haven’t.",
          "id": 76,
          "comments": [
            {
              "score": 131,
              "content": "Then stop being passive aggressive and tell your landlord your legitimate complaints about her.",
              "id": 77,
              "comments": [
                {
                  "score": 31,
                  "content": "This wasn’t a complaint. I haven’t complained about her. She tends to fight with people loudly at three in the morning, which I don’t love, but it’s infrequent enough that I can usually catch up on my lost sleep the next day. So it’s not the end of the world.  You said it might have been a one time thing, I’m saying it isn’t.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 51,
                      "content": "I got that it wasn’t  a one time thing when You said that you have plenty of things to complain about, but that you don’t complain.\n\nTHEN I said that you SHOULD complain about legitimate issues - like noise problems. \n\nInstead you let it fester. Just be honest with your landlord about an ongoing issue rather than pretending you are just neutrally “reporting” an event. \n\nList the dates/times she has disrupted the building with noise and give them to the landlord. Not complaining about legitimate things is no badge of honor.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": ">This might have been a one time thing with the neighbor being that drunk and you embarrassed her for no reason\n\nShe didn't tell the landlord that the neighbor was drunk, only \"disoriented.\"  That's nothing to be embarrassed about.  Also, from your replies to OP I have to ask..  What is your problem?  It's clear to me that OP was only trying to be a dutiful neighbor and has no ill intent towards her drunk neighbor despite the issues her neighbor causes.  Chill out some and accept that people can do things without there being some evil ulterior motive as the reason.",
          "id": 80,
          "comments": [
            {
              "score": 1,
              "content": "the same problem a few hundred other people making comments have.",
              "id": 81,
              "comments": [
                {
                  "score": 0,
                  "content": "I think you are missing the point.  You are filled with hostility towards her instead of trying to carry on a civilized conversation.  It's like you're foaming at the mouth and ready to kill with no way of being calmed down, all because you seem to WANT to think the worst of her and won't accept anything unless it confirms what you've already decided about her.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I actually think you are missing something and are being pretty aggressive yourself. OP has a series of rightful grievances against the neighbor and i was encouraging her (thought it was a he) to bring it up in a professional manner rather than seeming to pride  herself on putting up with bullshit behavior. \n\nBut thanks for your judgment. I didn’t know my comment was it’s own AITA. you have a good day.",
                      "id": 83,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 89,
      "content": "NTA for calling the ambulance.  YTA for calling the landlord.",
      "id": 84,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 70,
      "content": "YTA for calling the landlord. You're really overstepping at that point. If she contacted the landlord then you definitely could have stepped in as a witness but otherwise it none of your business. She agreed to the ambulance initially so no AH there.",
      "id": 85,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 44,
      "content": "NTA. You were looking out for her safety and well being and alerted the landlord to a possible safety hazard.\n\nAbsolutely NTA.",
      "id": 86,
      "comments": [
        {
          "score": 24,
          "content": "Thanks. That’s certainly what my intention was.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I also agree NTA. If there is a potential safety issue on the stairs or even damage from the tenant's fall, then the landlord should be informed.  Maybe some rubber treads could be installed or a better safety rail, or better hallway lighting etc.  Yes, it sounds like inebriation was the main cause of this incident, but, all the more reason for the landlord to double ensure all safety standards are being met.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "NTA.  I agree with this.  I know you are getting some flack about contacting the landlord, but I think that was the right thing to do.  You didn't do that to get your neighbor in trouble and didn't say anything bad about her.\n\nI own a few rental properties and this is something I would have wanted to know.  It would give me an opportunity to make sure the stairs are in good condition and weren't damaged by her fall.\n\nEdited:  I think this is one of those cases where, deep down, your neighbor isn't actually upset with you.  But she's embarrassed by her own actions, so she's aiming her anger at herself at you.  You didn't do anything wrong.  You were trying to help her!",
          "id": 89,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 37,
      "content": "Nta. Calling ambulance was the right thing to do. I would have skipped calling the landlord.",
      "id": 90,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 30,
      "content": "YTA for telling the landlord. I can't imagine being an adult living in an apartment and having a neighbor who wants to play college RA and tell the landlord whenever I drop a dish in my kitchen because it might \"affect his property.\" Don't be a narc.",
      "id": 91,
      "comments": [
        {
          "score": 3,
          "content": "Do you think dropping additional kitchen is the same thing as falling down a flight of stairs rendering yourself unconscious? Do you think the landlord’s going to punish her in someway for falling? I don’t understand what do you think it’s going to happen here.",
          "id": 92,
          "comments": [
            {
              "score": 27,
              "content": "You seem really unwilling to accept any judgements in which you are the AH. You were being a tattletale. But hey, I'm sure the landlord is happy to have a free building manager to keep an eye on his assets",
              "id": 93,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "I know landlords who have punished tenants for injuries or complaints about property hazards. It can result in losing the place. \n\nBringing a tenant to the attention of the landlord \"because he should know\" or \"because it could be related to a hazard on the property/his liability\" does not help the tenant. If the tenant wants to do that she can do that. \n\nAll you know is she fell down and passed out or passed out and fell down. That is her medical business, not her landlord's. He can be informed if she has a safety concern she wants to raise.",
              "id": 94,
              "comments": [
                {
                  "score": -1,
                  "content": "Except I know the guy. That’s not what he’s like. It’s not just some faceless corporation.",
                  "id": 95,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Ma’am you are being the building manager for free, stop doing that.",
              "id": 96,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "I think the only time to involve the landlord was if her fall on the stairs was due to an issue he is responsible for maintaining (the banister breaks, a protruding nail, etc) you telling him after the fact is just embarassing and acting like he’s her dad or yeah college RA was a good comparison",
              "id": 97,
              "comments": [
                {
                  "score": 2,
                  "content": "But that’s the thing… I don’t know why she felt. Yes, I think it’s because she was drunk, But you’ll notice I didn’t say that to him. I don’t know why it happened.\n\nI also noticed that the EMTs weren’t really comfortable climbing up the stairs. I’m sure part of that reasoning was that there’s not somewhere at the top where they could have her seated and assess her.  I don’t know if they’re to code or not.  Honestly, I kind of thought they weren’t, but a quick Google search, such as that is, suggests that they are. I don’t know.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 18,
                      "content": "you’re not her keeper nor are you a property manager, let the EMTs do their job, I doubt they were uncomfortable climbing stairs, sounds like you could use a hobby, make amends with her if needed",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Your comment(s) violate [rule 3](https://www.reddit.com/r/AmItheAsshole/wiki/index#wiki_3._accept_your_judgement). Please review this rule, and be aware that further violations will result in you no longer being able to participate in your thread.\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
              "id": 100,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 30,
      "content": "Yta mind your fucking business what was the landlord supposed to do? How was the landlord going to help in any fashion? You could of helped her to her apartment and made sure she was safe and called it a day. What did you really think calling the landlord was going to do? What incentive was there other than gossip?? Did you want her to get evicted? Do you have an issue with this neighbor?",
      "id": 101,
      "comments": [
        {
          "score": 10,
          "content": "Well, my incentive was to keep him apprised of something potentially hazardous at his property. I thought a serious incident on his property concerned him. Apparently it doesn’t.",
          "id": 102,
          "comments": [
            {
              "score": 23,
              "content": "Even in your initial post you said she didn't look injured just disoriented.....so.....what major hazard again? What serious incident? A drunk girl falling down but otherwise uninjured is a serious incident?",
              "id": 103,
              "comments": [
                {
                  "score": 14,
                  "content": "A head injury? She wasn’t bleeding is what I meant. But she wasn’t conscious when I first found her. She came around, by the time they got there she was walking, but she wasn’t coherent. That’s what seemed serious. I’m not a professional and can’t assess whether or not she was hurt. The professionals put her on the phone with the doctor said she should come to the hospital.\n\nShe was moaning a bit… So semi conscious?",
                  "id": 104,
                  "comments": [
                    {
                      "score": 6,
                      "content": "She was well enough to go upstairs to her apartment on her until you let eat to her door though right? Not like she was laying there till they came right? But the bigger question is what was the landlord gonna do? The emt thing is iffy but you ass hole starts to show the second you called the landlord. Are you neighborhood watch or something?",
                      "id": 105,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}