{
  "post content": "So, to start, I have 50/50 custody of my daughter Claire (12f) with my ex-wife Jessica. Jessica is married to Chris (40m), who has two kids; Addie (7f) and Luke (10m). Claire spends one week at my place, one week with her mom. Sunday is the ‘swap day’. \n\nTwo weeks ago, Claire had a huge fight with her stepsiblings. Apparently they snuck into her room when she was away and went through her stuff, breaking some of her important items in the process, and Claire screamed at them when she found out. Jessica and Chris wrote off Addie and Luke’s behavior as “kids will be kids” (I disagree, I think that Addie and Luke need a reality check for their behavior and that they shouldn’t get away with it). However, they said that Claire’s reaction was “over the top” and “a sign that there’s something wrong with her”. \n\nJessica decided that she needed to “find out what’s in Claire’s head” and so she confiscated Claire’s sketchbook (which Claire uses to get her feelings out) and went through it. Apparently, what she found was “disturbing” (Claire has showed me her sketchbook before and no it isn’t) and took Claire to a psychologist for evaluation. \n\nSpoiler alert: they didn’t find anything. My daughter is completely mentally healthy, save for (surprise surprise) stress from her step-siblings. \n\nAnyway, I got Claire last Sunday, and she spent her first few hours with me holed up in her room (sketching I think). At dinner, she told me what happened, and I surprised her with pancake breakfast the next morning to make her feel better. \n\nBefore I gave her back to Jessica, Claire asked me to keep her sketchbook at my house so her mom wouldn’t look through it. I said yes, and she went over to her mom’s place without it. \n\nYesterday, I got a text from Jessica. She said that she was “worried that Claire forgot her sketchbook” because when she went to confiscate it, it wasn’t where Claire usually keeps it. She then asked me to arrange a time and place for her to pick it up. I said that the sketchbook was with me, and that I decided to keep it because I didn’t want it confiscated again (I didn’t want to throw Claire under the bus here, in hindsight lying probably wasn’t the best idea). She said that I was being an AH because she “has a right to her daughter’s mind”. I said that i was worried because of how she handled it last time she went through it. She restated her previous point, and I did not respond. \n\nIt’s been about a day since that conversation, and I’m starting to question my choice. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 13144,
      "content": "NTA and your ex has lost her marbles. OP, document **everything**. *Everything.* Their response to your daughter's very normal behavior and sibling stress is disturbing and suggests she's being scapegoated in that home. (especially as they are excusing their other children's behavior as 'normal', which means that they are excusing other harmful behaviors too. Where will it end?)  \n\n\nI would encourage you to consult a lawyer and petition for full custody. You don't want to let this abuse continue. Making your daughter out to be the villian in all of this and this 'right to her mind' nonsense is screaming 'mental health issues' with your ex -- I grew up in a house like this and wish someone had rescued me from this blame and erratic adult behavior. Your daughter needs you to step up for her now-- be the parent she is needing.",
      "id": 2,
      "comments": [
        {
          "score": 5669,
          "content": "YES THANK YOU!\n\n>she “has a right to her daughter’s mind”. \n\nThis is actually incredibly alarming.\n\nNTA and she is lucky to have you.",
          "id": 3,
          "comments": [
            {
              "score": 2386,
              "content": "I can’t imagine what the daughter had to go through... Being called mentally ill for a sketchbook  is insane. No one has a “right” to ANYONES mind. Parents need to understand that kids need privacy too",
              "id": 4,
              "comments": [
                {
                  "score": 1859,
                  "content": "For real! When I was in high school, my parents put keyloggers on my PC and would sit back and read all my AOL messenger posts to my friends (god I'm old). They would then scream at me and/or punish me for what I said if they didn't like it. I am a writer, I've been writing since I was in pre-K, though luckily I have improved since then, but I NEVER kept a journal because I knew they would read it. Privacy was non-existent for me. It was honestly hell. In 8th grade, I learned to read and write in Anglo-Saxon runes, and I taught all my friends so we could pass notes and write to each other and no one would understand.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 735,
                      "content": "I’ve been sketching my whole life and I think I’d die if anyone saw my middle school sketchbook lmao. That’s just a phase to experiment creatively and you can’t do that freely if you feel like parents are hovering over",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 336,
                      "content": "I hear you. In the early 90s we lived in a house with a built-in intercom system. When my responsible and hard-working sister had a sleepover with other classmates around age 12 my stepmother used the intercom system to secretly spy on their private conversations about boys and so on. She claimed it was her absolute right as step parent to understand everything going on in these young girls lives but I could tell at age 10 that this was a serious violation of privacy and I lost respect for that kind of thinking. If I had a choice between a parent like op versus the mum I would choose op every time.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 125,
                      "content": "Thats a bit much. My daughter is 10 i told her id give her privacy and trust her until she givea me a reason not to",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 79,
                      "content": "I swear I had the same experience. To the point I couldn’t write anymore for years and now if I do, it’s password locked and I hide it as the fifth layer in a pdf with the font colour set to white so even if they get the password (my father used to just smash the electronic if I refused to give the password) they would just see one of my textbooks. \n\nI’m 28 and haven’t lived with them for 9 years. We have a healthy relationship now but they aren’t allowed in my house alone, snd we sweep anything they give us for bugs. \n\nI was published a few years ago and they interrogated me about it because “first works are autobiographical.” The themes were about controlling and intolerant parents, which had very little to do with them actually. If I ever actually become a published author (I don’t count my currently published works) they won’t be aware.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 52,
                      "content": "Similar situation, I'm 17 now, and up until two months before my 17th birthday I had never had a bedroom door (because they didn't think I needed privacy until I was 17) and my parents monitored everything I did on my phone (which I didn't get until my 15th birthday) via our wifi setup. Now they're surprised that I don't want to be home or around them anymore.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 51,
                      "content": "That runes idea is next-level! I hated your situation (had my journals read too) but loved your work-around.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "I started writing in pig pen code recently. My parents thought it was some child gibberish and they never bothered me again.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "You know, I grew up kinda the opposite... but not a complete 180. Here's the thing, all of us had our rooms that were private. You knocked on anyone else's before entering, etc. My parents didn't go through our shit. \n\nIf there had been a reason to, they 100% would have. I mean that in like, all the sudden our grades went from A's to F's, we started completely withdrawing, wearing long sleeves/pants even in the middle of summer, significantly dropping weight with no explanation....things like that. My brother got really fit during junior year of high school but he was working with our schools nutritionist and kinesiology teacher (who personally trained his kids who went to the olympics), so him getting fit, made perfect sense.\n\nDoing something like going emo, they would have been like, \"Meh, that's fine, let them dress how they want.\" They were always around, though. They gave us privacy, but they were involved parents. They knew their kids, so they were well attuned to us. Dinner time was my dad standing at the bottom of the stairs and yelling \"DINNER,\" and 6 doors would open and close. \n\nWe also went to them with our problems bc they didn't get mad, so that knocked out 99% of their worries about us needing privacy bc us having a problem wasn't an issue. We just wanted some things kept private. \n\nBoth my parents have certain things we have never been allowed to go into, for the same reason, and we never have. None of us wanna know what my mom keeps in her bedside drawer. We don't even speculate on it. I'm pretty sure we are all aware it would traumatize us more than her.\n\nETA: After re-reading what I wrote, this actually makes more of the point of how \"not having privacy\" is more about control. My parents weren't controlling. PITA, sometimes, sure, but they weren't controlling. We heard about this rope swing when we were teenagers and told our parents we were gonna go find it and my dad said \"check for rocks before you do anything crazy\" and my mom said, \"I just washed some towels\", and \"take my minivan instead of your car, that way everyome will have a seatbelt\" and threw me her keys.... my bad y'all.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "To be fair....those AOL chat Rooms were the wild fucking west.  Lest we forget the classic \"A/S/L\"",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Okay I’m really sorry you had to go through that but omg that is SUCH an awesome fix for such a crappy situation.\n\nLike oh I just casually learned an ancient language and taught my friends so we could talk privately.\n\nYou are awesome!",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Notice dad already saw the sketchbook because his daughter chose to show him but mom has to confiscate it by force.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Did that claim make anyone else think of the novel 1984?",
                  "id": 17,
                  "comments": [
                    {
                      "score": 4,
                      "content": "This is the 3rd reference to this novel 1984 I have seen today. I guess I'm off to the library!",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Omg. Teenage kids drawings and paintings are pretty wide ranged. The things going on in their life and head are new and scary and exciting. \n\nI did a massive painting full of so many random things. Lol.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I actually think that it IS the parents’ job to keep an eye on their kid’s life – who they hang out with, what media they consume, what they produce – and if necessary talk to them. \nYou want to know, NEED to know if your kid is suicidal, inappropriately sexual, falling into a far-right rabbit hole etc. Youtube (and I hear TikTok) algorithms being what they are, kids can easily access disturbing and inappropriate content. _Manipulative_ content. \n\nThat needs to be balanced with a kid’s need for privacy, and the opportunity to learn about the world and become their own personality. \nHere, mom is very obviously wrong, in particular ’I want this thing so I can confiscate it’ and not talking to OP what she finds disturbing enough to involve a psychiatrist. This does not surprise me, given she’s ok with her step kids destroying her daughter’s possessions.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "EXACTLY! And the mom has no clue what a violation it is. Stick to your guns, OP. Claire needs you.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Add to that, kids must have bodily autonomy (obv unless it’s something harmful or dangerous). They need to be able to tell anyone- adult or kid- that no one owns their body except them. And the parents need to not just respect that, but advocate for it.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "The \"right\" she has, is to Talk/Communicate with Claire. She doesn't have the \"right\" to go through her personal items, sketchbook, diary, etc. That totally breaks the trust that the daughter has in her mother and may not ever be forgiven. It sounds like the mother is taking sides with the stepchildren which is probably devastating to Claire, feeling that she is alone \"against\" the rest.",
              "id": 23,
              "comments": [
                {
                  "score": 39,
                  "content": "This is what makes the post both funny and sad. The mom was TOLD what Claire's issues were by Claire - the fact her stepsiblings invaded her room and destroyed her stuff - yet mom refuses to acknowledge that and somehow has turned it around to Claire is the one with the issue. \n\nAnd I bet if one of the stepsibilings went into the other's room and did the same, they would be called out on it but because it happened to Claire, it was \"kids will be kids\".",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "I could not agree more. I mean they broke into her room and destroyed her private possessions and in response her mom reads her private journal containing her most private and innermost thoughts that she would likely never even verbalise in a million years and just put in there to get them out of her head so that she can actually process them healthily and then took her to a therapist likely to desperately try and get her diagnosed with something just to (in her mind) actually justify the horrifying violation of trust and privacy of her daughter. I mean she literally went that far to avoid being a parent to her other kids and actually hold them accountable for their behaviour! That is not normal. Op please get your kid out of there as soon as possible. Good luck.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "That’s Disney villain vibes right there.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "Literally! No, daughter is a PERSON and has a right to privacy!",
              "id": 27,
              "comments": [
                {
                  "score": 29,
                  "content": "Yes!! OP’s ex doesn’t seem to know the difference between *privacy* and *secrets*. OP is such a good dad for not only realizing this, but also for taking the heat for poor Claire.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "So much this. Lady, you don't own your daughter.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "Thank God that was in a text message, easy to document",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Yeah, parents who say that sort of stuff later wonder why their children haven't spoken to them in 10 years. This is controlling and deranged.\n\nOP, NTA and you are 100% right to keep that sketchbook safe for your daughter.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I read something that torture survivors said the only way they kept their sanity was by being able to retreat to their minds - the one thing their abusers couldn't access. \n\njust saying, OP",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "It sounds like something my narcissistic mother would say. 😧",
              "id": 33,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 359,
          "content": ">I would encourage you to consult a lawyer and petition for full custody.\n\nYup, pronto. I wouldn't want to imagine what this woman is gonna do to what she calls her daughter now that she knows she gave dad her sketchbook for safe keeping.",
          "id": 34,
          "comments": [
            {
              "score": 55,
              "content": "Perhaps it would be easier since they're in the same state, but when my stepdaughter was beaten with a belt at the age of 16, the lawyer we consulted told us she would have to testify to abuse in open court, and even then we would have about a 5% chance of winning. I suspect that the (corrupt) judges didn't want the (high, $600+/month) child support money to leave the state. This was in 2012, so not that long ago. \n\nTurns out the offense was committed by the stepfather, but when he saw how unhinged his wife was he let the kids (SD and her 8yo half brother) take the blame.",
              "id": 35,
              "comments": [
                {
                  "score": 36,
                  "content": "I don’t quite understand what you’re saying about leaving state - why would a judge care about $600pcm going anywhere?",
                  "id": 36,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Let me see how to say this. \n\nI live in a deep south red state, where my husband, his ex, and my stepdaughter grew up. Judges are elected, so they can get political donations. DCF in a lot of states gets a percentage of child support, so there's pressure to keep the $ amount high. Also this state is perpetually broke, and child support which leaves the state doesn't get spent in state and doesn't generate revenue through sales tax and other vehicles. Only 44% of children in this state get child support paid in full, so there's a lot of \"deadbeats.\" Add in \"Christians\" and conservatives who dominate politics and believe \"children need their mothers full time\" well, men don't get their kids here unless the mother can't be found.\n\nGiven the perfect storm of an out-of-state father (military) who made double the median income, who had a perfect record of payment going back a decade, (because the military makes sure you support your kids, by force if necessary) no way would a judge down here hand over custody. While my husband's case might have generated less than $1000/year in state revenue, multiple that by the thousands of military members stationed here who married a local girl and got divorced, and that starts to be a pretty good chunk of change that stays in state to be spent on the local economy rather than a smaller amount leaving the state and being spent elsewhere. \n\nLuckily for him/us, her lawyer was unfamiliar with federal law and believed the 10-year myth, so didn't go after his pension.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 213,
          "content": "THIS.\nScapegoating and, I would add, gaslighting the daughter. And it's working. Indeed, she hasn't instantly called her dad for protection, but waited a week and an entire half-day to open up, which can be a sign she's not sure she's right/he wouldn't have blamed her again.\n\nOut of personal experience: when your younger siblings do something very wrong and violate your space and you get extremely upset, being told what the girl has been told is one of the biggest \"am I mentally ill?\" situations. And the mother enforced it with this \"access to your mini\" and bringing her to a therapist (which proved then a luck, because now the poor girl has at least a professional opinion about her not being ill, but this surely was not the mother's intention as she was clearly looking for a reason to scapegoat and control her).\n\nAlso: this is the kind of age where super controlling moms feel they're losing their \"babies,\" so their abusive behavior can get worse.\n\nI join the suggestion to document it all, and hope you'll consider to ask the full custody",
          "id": 38,
          "comments": [
            {
              "score": 71,
              "content": "OP, please give us an update at some point. I'm honestly worried for your girl. <3",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -2,
              "content": "Honestly, at this point I wish people would just stop using the term 'gaslighting'.  In my mind I just try to figure out if it's actually gaslighting, and miss the person's point.  Similar to \"ironic\".\n\nIt'd be easier for my brain if people just said \"she's lying to your daughter about the journal being 'wrong'\" or whatever you meant.\n\nIn this case, I don't even really understand what you were implying with 'gaslighting'.",
              "id": 40,
              "comments": [
                {
                  "score": 12,
                  "content": "I think they're using the term because gaslighting also involves making the victim question their mental faculties - not just \"you're wrong\" but \"You must have forgotten\" or \"You misheard me\". This does very much qualify, because while not a direct invalidation of a direct statement, it's invalidating *everything* that's going on in her head. \"Your stepsiblings are fine; *you're* the problem\", and \"These things you drew aren't you finding a natural outlet; *you're mentally ill*\". I know this one from personal experience - not a sketchbook, but a diary. My mother used to read mine, which I found out when she cornered me one night and told me that nothing I wrote was actually what had happened, and that I wasn't allowed to write or even *think* bad things about her, or that she was anything other than a perfect parent. This after years of mostly emotional but occasionally physical abuse. If someone tells you that everything you've experienced is invalid and wrong, and threatens or forces you into psychiatric care if you don't immediately back down? That's probably where the gaslighting comment comes in. I honestly don't know whether it's right or wrong, but I know how much you can question your own head when a parent pulls what OP's ex pulled on Claire.\n\nJudgement: NTA, OP. I wish I'd had a parent like you when I was growing up.",
                  "id": 41,
                  "comments": [
                    {
                      "score": -4,
                      "content": "You're trying to explain to me what your own interpretation of 'gaslighting' is.  \n\nIt's different from other people's interpretations.\n\n  \nThat's the big problem with using the word \"gaslighting\".  It means nothing at the moment.  \n\n  \nYou could use almost any other description and be more precise.",
                      "id": 42,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Gaslighting is a specific form of lying that is meant to make the victim doubt their own memories and feelings. \n\nTelling someone else that you didn’t eat the last cupcake when you did, but they didn’t see you do it. It could have been someone else = lying.\n\nTelling someone that it’s concerning that they think you ate the cupcake (after they just watched you do it) because you actually watched them eat it. Are they feeling ok? = gaslighting",
                  "id": 43,
                  "comments": [
                    {
                      "score": -4,
                      "content": "You're trying to explain to me what your own interpretation of 'gaslighting' is.  It's different from other people's interpretations.\n\nThat's the big problem with using the word \"gaslighting\".  It means nothing at the moment.  \n\nYou could use almost any other description and be more precise.",
                      "id": 44,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "When a person is scapegoated, they are repeatedly, ad nauseum, told that their needs don't exist, don't matter, they are over reacting to real offenses, that they are the sole problem of the family when in actuality, the parents are the problem. Gaslighting is convincing the victim that they are, in this case, the perpetrator, the cause of the problems in the household. Gaslighting is employed to make the victim question their own judgment or not reach out for fear that their horrible situation isn't just 'normal' behavior from the rest of the family, but that it's her fault entirely. I believe that's what's being referenced. It doesn't have to mean that you drive someone crazy by deliberate, duplicitous means, it can be gaslighting when narcissistic parents exploit their scapegoat, even when it's done subconsciously due to mental illness.",
                  "id": 45,
                  "comments": [
                    {
                      "score": -6,
                      "content": "You're trying to explain to me what your own interpretation of 'gaslighting' is.  \n\nIt's different from other people's interpretations.\n\n  \nThat's the big problem with using the word \"gaslighting\".  It means nothing at the moment.  \n\n  \nYou could use almost any other description and be more precise.",
                      "id": 46,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 102,
          "content": "This, especially since his daughter is now 12, which is the age most courts start to really consider the kid's desires in custody.",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 80,
          "content": "I also grew up with a parent that would go through my sketchbooks. It's the most devastating feeling ever for someone you thought you trusted to violate your personal space like that.I was a horny teen that grew up on neon DeviantArt furries and vampires so you can imagine the weird shit I used to draw. Now I get paid to draw weird shit for other weird people on the internet so obviously the shaming didn't work lol.",
          "id": 48,
          "comments": [
            {
              "score": 49,
              "content": ">obviously the shaming didn't work lol\n\nGlad it didn't! I got criticized for some of my poetry in high school after my mom looked through that too. Funny thing, I'm no contact with her, and met my husband 22 years ago at an open mike he was hosting! For anyone else who is currently dealing with this-- don't give up on your art/writing/craft just because someone tried to use it against you. It only means you are stronger than they know what to do with.",
              "id": 49,
              "comments": [
                {
                  "score": 21,
                  "content": "[deleted]",
                  "id": 50,
                  "comments": [
                    {
                      "score": 20,
                      "content": "My son, when he was in high school, shared a collection of poetry with me that he wrote in 8/9th grade. I was so honored and humbled that he chose to share that part of himself with me. I knew then that I had broken my mom’s shitty patterns of emotional abuse. He’s 32 now and we have a great relationship, while I’ve been zero contact with my own mother for more than four years. You reap what you sow.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "My mother would hunt through my things to find anything that I might have written down that she could use against me. Passwords, personal feelings, shopping lists, anything. To this day, anytime I journal or make a vent page in my sketchbook I block it out with a paint pen and wrap it in duct tape so that if anyone tries to peel it it'll pull up the paper and destroy whatever is on the page.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "The Red Flags coming from ex wife, her husband and her stepkids are HUGE. OP NTA - please take appropriate action as mentioned above. You are a great father!",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "No one has a right to their kids mind. \n\nShe isn’t property. \n\nShe’s a human with emotions and feeling and wants and needs",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "Sounds like ex and her family might have made daughter the \"identified patient\" of their family unit - the problem child that needs to be \"fixed\" so everything will be sunshine and rainbows. Ex wants so hard to be a part of her new family that she's throwing her daughter under the bus and turning her into the identified patient - including unnecessary therapy for a mental illness that doesn't exist.",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Right?!\nI feel so bad for this girl- those sketches are basically her diary and her mom went through it- thinks she has the RIGHT to go through it (has the right to her daughters Mind? Wtf does that even mean?).\n\nDocument everything- talk to your daughter see how she feels there. I couldn’t imagine her feeling safe there. Talk to your daughter and find out what she wants *this is very important- I know people are gonna be saying you should push for more custody- and you 100% should- but make sure she’s included* clearly with her mom she doesn’t get this and she deserves to feel safe and feel\nHeard.\n\nIt’s clear she trusts you as she in-trusted her sketchbook to you. That’s a good start. I feel so bad for her I’m glad she has one good parent who sees her as an actual human being rather than property at best and a complication at worst.\n\nHer siblings broke her things- likely took some things and her mom and mom’s husband do nothing.\n\nThen they proceed to violate her trust and act like she’s some problem child.\n\nSeriously this girl really needs to get out of that house. She may not have issues yet but If she stays in that house she’s definitely gonna need some serious therapy in the future.\n\nNTA",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "This, all of this.",
          "id": 57,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2787,
      "content": "NTA. \n\nThis is the equivalent of reading your child’s diary. It is a boundary that should not be crossed in the absence of absolutely dire circumstances (which you stated do not seem to be present). \n\nKeep being your child’s advocate. They need an adult they can trust to confide in them and keep them safe. You obviously have your daughter’s trust. Do what you need to do to keep it.",
      "id": 58,
      "comments": [
        {
          "score": 669,
          "content": "Agreed. NTA. It is her version of a diary and is super creepy mom wants access to her daughter’s “mind”. \n\nIf mom keeps this up her daughter will go no contact the minute she is able to. \n\nKeep being a great dad, Dad!",
          "id": 59,
          "comments": [
            {
              "score": 237,
              "content": "I think the fact that she willingly showed him her sketch's speaks volumes of their relationship. Because sketches are like a writers rough drafts they can be private and sharing means they trust you. It's such a show of trust.",
              "id": 60,
              "comments": [
                {
                  "score": 102,
                  "content": "That’s part of why I can tell he’s a great dad because her mom had to sneak her sketch book to get a look but the daughter was happy to freely show her dad. She clearly trusts her dad and they have a great relationship. 😊",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 124,
              "content": "The mom's thought process seems so illogical. She states she needs to see the sketchbook to \"read her daughter's mind\" yet when Claire TOLD HER outright the issue was stepsiblings going into her room uninvited, invading her privacy, and destroying her stuff, the mom blew it off. So mom KNOWS what is on Claire's mind; she just doesn't want to deal with it. Much much easier to make Claire the problem.",
              "id": 62,
              "comments": [
                {
                  "score": 35,
                  "content": "Claire's mum: ignores her daughter when valid concerns are raised\n\nAlso Claire's mum: oH nO wHatS WroNg witH my DaUghTer??",
                  "id": 63,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "It's a sign of narcissism. The mom likely feels that Claire should be her little puppet and whatever she says/does belongs to the mom. And if she speaks out or has a legitimate concern, it gets ignored/gaslit. Poor Claire.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "If mom wants to know what's in her daughter's mind, she can *listen* to her when she says what's bothering her.   Instead, she dismisses things out of hand.   If she can't listen in a one on one,  *she* can talk to a therapist about how to do that.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I believe, when it comes to custody rights, that she is technically at the age she can make that decision now. Past a certain age kids can say who they which parent they want to stay with.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 126,
          "content": "I'm pretty sure crazy lady would feel perfectly entitled to read the daughter's diary too. NTA. Good on you for providing a safe space for your kid.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "When I left the parental house I had little space and moved often. I left boxes containing journals and other stuff sealed in the basement \n\nWhen my parent came to visit me the first time at my permanent, settled home, they informed me, within minutes of their leaving, that they had opened and read all the journals because “I wouldn’t have left them if I didn’t want them to read them”\n\nAlmost 30 years ago. I am still so hurt",
          "id": 68,
          "comments": [
            {
              "score": 10,
              "content": "My mum read my diary when I was a teenager. I’m now in my early thirties and still feel uncomfortable writing my thoughts, even though I moved out ten years ago.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I’m sorry your parents did that to you.  My son has had boxes stored in my basement.  I have never even moved them much less look in them,  with the exception of one box, that one I had to take the item in it and pulled the greatest prank with it.",
              "id": 70,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1275,
      "content": "NTA\n\nYour ex is plain wrong. She does not have the right to her daughter’s mind, especially with how downright abusive she acted the last time. You should be thankful, with the psychologist stunt, she handed you the perfect reason to get more custody.",
      "id": 71,
      "comments": [
        {
          "score": 111,
          "content": "Yes!! She doesn’t have a right to her daughter’s mind when she clearly doesn’t care about how it’s being affected",
          "id": 72,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 912,
      "content": "NTA. Mom overstepped. She also brought her to a psychologist? Why is she pathologizing her daughter over a normal reaction to a breach of privacy? The mom sounds like she's taking out any lingering resentment towards you on her daughter and projecting onto her. Ex wife is definitely TA and should have some respect for her own daughter in this blended family scenario.\n\nEx does not have a right to her daughter's mind. That's lunacy. She can talk to her daughter like a normal human if she wants to know something. She's acting entitled and not allowing her daughter any autonomy, which is going to breed resentment.",
      "id": 73,
      "comments": [
        {
          "score": 344,
          "content": "Also, why is mom prioritizing the step-kids over her own daughter?  Why wouldn't the step kids be evaluated for breaking into her daughters room and breaking her stuff?",
          "id": 74,
          "comments": [
            {
              "score": 250,
              "content": "Might be because some moms will do any thing to keep their spouse happy even to the detriment of their own children. They feel like they have to prioritize their spouse and their spouse's children to keep their spouse from leaving. Its sickening when this happens.",
              "id": 75,
              "comments": [
                {
                  "score": 67,
                  "content": "Sadly very true, especially when their child is the ‘easier’ e.g. quieter, well behaved kid who either reaches a breaking point or has a completely valid response to something upsetting while the new kids aka spoiled brats must be praised and accommodated",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Indeed.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Ikr, at 7 and 10 they’re definitely old enough to know better.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": ">She can talk to her daughter like a normal human if she wants to know something\n\nNo she can't. Because if she talks to the daughter, daughter will say the straight truth and point out all mom's shortcomings. Way easier to snatch the sketchbook and give a dishonest interpretation of its contents to think anything she wants about the daughter.",
          "id": 79,
          "comments": [
            {
              "score": 11,
              "content": "This is why I couldnt talk to my mom. All moms see it as \"calling them bad parents\" when in reality, its just how their parenting affects us. I was called ungrateful and selfish when I brought up how her actions/comments made me feel. I could only imagine what this mom would say or do",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 475,
      "content": "NTA\n\nI think it's great that Claire has the support of at least one of her parent's..",
      "id": 81,
      "comments": [
        {
          "score": 119,
          "content": "Absolutely!  And OP keep looking out for your daughter. Kids NEED privacy and a safe place to get their emotions out. It sounds like your daughter is doing this with art. \n\nYour ex is potentially doing incredible damage to the kid, and so are the step siblings/parent. I say this as a kid that never, ever, under any circumstance had any privacy. You know what that makes kids?  Fantastic liars and very bitter/angry.",
          "id": 82,
          "comments": [
            {
              "score": 24,
              "content": "Growing up with no privacy, i can tell you it sucked. Being told “i had no right to privacy” no lock on door, parents knew phone password. Now I have full freedom and good lord its so nice to have privacy",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 409,
      "content": "NTA. \n\nNo one has a \"right\" to someone's mind. \n\nBe the safe place your daughter needs you to be. \n\nKeep up the good work. \n\nMake more pancakes.",
      "id": 84,
      "comments": [
        {
          "score": 77,
          "content": "Yeah that's a fucking crazy thing to say. I hate parents like that.\n\nThey're an individual person whether they're your child or not. You don't \"own\" them like property.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "NTA and now I want pancakes!!! Reminds me of the post the other day about an OP who moved all their important things to Dad's cuz step sibling damaged stuff. That child also did 50/50 and each time she went from mom's to dad she took more stuff. I guess art will be Claire's hobby at Dad's house. Hopefully OP can get more custody of Claire.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 281,
      "content": "NTA\n\nSounds like Claire would be better off keeping all of her personal and important possessions at your place. You are Claire's parent. You have joint custody of her. Well done for defending her against Jessica.",
      "id": 87,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 207,
      "content": "NTA. No reason there can't be a sketchbook that stays at your house. If your daughter wants one at her mom's that's fine as well. Or not. Diaries and journals should be private unless in fear of health or safety. This does not qualify.",
      "id": 88,
      "comments": [
        {
          "score": 39,
          "content": "OP can get Claire another sketchbook to take to her mom's house (while she keeps her original one at his), so she can write/draw some legit disturbing stuff for the sole purpose of freaking mom out.",
          "id": 89,
          "comments": [
            {
              "score": 109,
              "content": "Im afraid if she did this mom would try to have her admited.",
              "id": 90,
              "comments": [
                {
                  "score": 63,
                  "content": "Yeah, let's not make Claire more of a target . . .",
                  "id": 91,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I agree but I do like the idea of the disturbing sketch book at Mom's.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 75,
              "content": "another sketchbook to take to mom's house with only perfectly benign things in it (flowers, puppies) may be the best way to end this episode, honestly.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "Lol I did this! Not a sketch book but my mom kept telling me I was on drugs, selling drugs, etc- that's how I had so much money.  (In reality, dad gave us $20/week for school lunch, but I never ate lunch. In a months time, I almost had $100... keep saving and after a few months, that's a few hundred).\n\nSo I did what any \"normal\" teenager does when their parent is saying they're doing drugs-- I stole the chalk from my school, diced it up on a piece of paper, folded the paper and left it out for my mom to \"accidentally\" find. \n\nAnd what did she do when she found the \"evidence\"? Absolutely nothing. Didn't even take me to the doctors to talk about how bad drugs were for a teenager (or anyone, but I was like 13/14 at the time). Freaked her out though.",
              "id": 94,
              "comments": [
                {
                  "score": 35,
                  "content": "My father gave me an allowance at age 10, and said \"don't tell Mom, she doesn't think you're mature enough for it yet.\" so I didn't. It was two bucks a week.\n\nCue mother snooping under my bed, in a box. Finding 40 bucks. And throttling me for \"theft\". \n\nI went to Dad later that night, and asked him if he could tell her that I wasn't a thief and to get the money back.\n\nHe was horrified, but also way impressed that I had saved that much up and was proud of me. Went to her and explained where the money came from, got yelled at. Yelled back at her for hurting me when I wouldn't narc on him. And got the money supposedly put in my education savings. \n\nMom never said sorry for any of her part lol.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I wouldn't have bothered getting chalk, just get a little bit of flour.\n\nAnd when she freaks out you can show it's just flour by adding water.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "She should keep a decoy sketchbook at mom's that's all flowers, kittens and rainbows.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 174,
      "content": "You're a great dad for showing Claire that you have her back and will support her. Reassure her that she has a safe space in her room at your place, that she can keep her treasured possessions there in the safe knowledge that nobody will go poking through them without her permission.\n\nJessica needs to learn that the really good way to \"find out what's in someone's head\" is to talk to them. If they want you to know, they'll tell you. If they don't, it's a good hint you don't deserve to know.\n\nOn a point of information, I can't help but wonder whether taking Claire to a psychologist is something that should be agreed by both parents, rather than just randomly done by one because she's pissy that her blended family isn't living up to her fantasy image and assuming that the fault lies with her daughter.\n\nCongratulations on not being petty and escalating things by buying a second, identical book, and writing in clear block capitals on the first page \"Claire has a right to privacy\". ;)\n\nNo, seriously - you're doing good stuff here. While I'd shy away from advocating the idea to Claire (for fear of kicking up some huge blow-out fight with the ex), I'd definitely leave yourself open to the idea of her asking to move more full time with you as she gets older. Let it be her idea - and let her know she has a parent who loves, supports, and accepts her.\n\nNTA. \"Has a right to nosey through someone else's personal effects\", my arse.",
      "id": 98,
      "comments": [
        {
          "score": 72,
          "content": "I agree with nearly all of this, but I'd like to point out that a lot of parents refuse to allow their kids therapy, because they don't believe in it, or they don't want their child talking about what happens at home. I wish kids did not need permission to see a therapist at all.",
          "id": 99,
          "comments": [
            {
              "score": 36,
              "content": "Agreed on the therapy front (and had it been called that, I'd not have kvetched at all) - it's the way it was phrased made it feel very much like \"I think something is wrong with her and I want it diagnosed\", rather than \"I understand she is not happy and I would like help understanding why\". :/",
              "id": 100,
              "comments": [
                {
                  "score": 9,
                  "content": "Oh, I completely get that! I just kind of panicked at the idea that both parents should agree... that sort of thing could do as much (or more) damage.\n\nI think that OP should talk to his daughter and look at getting more custody.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "As a kid who needed therapy but my mom didn't want me in therapy, and now I am able to get the help I need as an adult but at least I'm getting help, I wish my mom would have helped me get the help I needed sooner.",
              "id": 102,
              "comments": [
                {
                  "score": 6,
                  "content": "Who knows what was going on for your mother, but your experience is an example of medical neglect.  Good for you for getting what you need as an adult (plus, you get to choose your therapist, not your mom!).\n\nI have done periodic therapy throughout my life, but I'm doing it much more seriously now that I'm retired.  It's never too late!",
                  "id": 103,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yeah i have been going to therapy for 3 years and it is really helping me. I'm mostly sad that kid me wasn't able to be her true self for so long, so I kinda feel like I'm still discovering my authentic self since I'm able to express myself without permission. It is a good feeling.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 128,
      "content": ">She said that I was being an AH because she “has a right to her daughter’s mind”.\n\nJesus H Christ. If anyone needs psychological intervention, it's this woman right here. NTA.",
      "id": 105,
      "comments": [
        {
          "score": 16,
          "content": "I know. Its so creepy. Can you imagine that sort of invasion of privacy in a child?",
          "id": 106,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}