{
  "post content": "As a special favor, I babysat my coworker’s 8 year old son the other evening. The kid asked for pasta and red sauce for dinner, so I made a really great tomato/red wine/sausage sauce recipe I know. He absolutely loved it.\n\nA couple days later, my coworker told me that her son hasn’t stopped raving about the pasta dish I served him, and asked for the recipe, which I gladly gave her. Upon reading it, she got really angry, and said that it was totally inappropriate for me to serve a child wine sauce. I told her that the alcohol almost entirely boils off when the sauce simmers, but she said that she does not want her kid consuming any amount of alcohol, and that I was really irresponsible for not asking her permission first. Before babysitting, I asked if her son had any food allergies/dietary restrictions, and she said no. When I mentioned this to her after she got upset at me, she said that it’s common sense to not feed someone else’s kid something with alcohol in it without asking permission.\n\nWhen I was little (I’m in my early 30s, so I’m not that old), all of us kids grew up eating red wine tomato sauce, penne alla vodka, meats with wine sauce, tiramisu, fruitcake, etc., and nobody would have ever thought to ask parents’ permission before serving such dishes to someone else’s kid. I don’t think this is a generational thing, none of my friends with kids would have a problem with it either. Is my coworker being weird, or was I the a-hole?\n\n(BTW, the coworker isn’t of a religion that prohibits alcohol — I have had drinks with her on several occasions.)",
  "id": 1,
  "comments": [
    {
      "score": 10482,
      "content": "NTA.I think your coworker needs to do some research on how alcohol is used in cooking for flavor. There's literally no alcohol in the food anymore whatsoever and is not harmful. It's basically grape juice at that point.",
      "id": 2,
      "comments": [
        {
          "score": 4387,
          "content": "> It's basically grape juice at that point.\n\nAnd it may be worth pointing out that grape juice (and apple, orange, etc. juice) does contain small amounts of alcohol. Possibly even more than OP's pasta sauce.",
          "id": 3,
          "comments": [
            {
              "score": 2498,
              "content": "You're right, my mom is a cook and she always said open a bottle of apple juice, drink it the next day and you will consume more alcohol than a sauce that is made with wine. Also alcohol is a part in a lot of foods and drinks that kids consume, it's just not obvious.",
              "id": 4,
              "comments": [
                {
                  "score": 554,
                  "content": "I genuinely thought that was a joke that Arrested Development invented",
                  "id": 5,
                  "comments": [
                    {
                      "score": 542,
                      "content": "That's where I learned that vodka starts to spoil as soon as it's opened! So much good info in that show",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "r/suddenlyarrested",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I did too! I'm watching it now, it's so bloody funny!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "Oh my god. Is this why I don't like apple juice when the container is first opened? I literally will open another container before the one I'm on is done so that it can \"aerate\"",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Bread and ripe bananas also have alcohol. As long as the percentage is under 1% (or 0.5%?) your stomach handles it and you don’t get drunk.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Hell, I recently made chocolate chip cookies flavored with rum. For anyone who's curious, the recipe came from this book:\n\n[https://www.amazon.com/Death-Chocolate-Cookies-Marcel-Desaulniers/dp/068483197X](https://www.amazon.com/Death-Chocolate-Cookies-Marcel-Desaulniers/dp/068483197X)",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 156,
              "content": "So does cough syrup, unless it specifically says \"alcohol free.\"",
              "id": 12,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 127,
              "content": "I get half gallon jugs of apple juice for my daughter, but she doesn't always finish them within a week. At that point I always have to do the sniff test before I get her more apple juice, to make sure it's more juice and less wine. I'm pretty sure when my daughter was a toddler she got more accidental juice alcohol in her sippy cup then the eight year old did with his pasta.",
              "id": 13,
              "comments": [
                {
                  "score": 87,
                  "content": "I have been drinking apple juice my whole life and I have never once experienced it having turned into alcohol. Is this when the juice sits in the fridge for a really long time?",
                  "id": 14,
                  "comments": [
                    {
                      "score": 42,
                      "content": "Yeah, that's when it happens. I don't know that it's actually turning into alcohol. I don't have it tested. But I know it starts to smell and taste more like alcohol and less like child-friendly juice.",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "There are preservatives in apple juice to keep it from turning. Apple cider, on the other hand, may ferment.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "When I was a kid, we had some orange juice that had been in the container for a while. It smelled like alcohol, and when we drank it, it was slightly carbonated.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "I have to do the sniff test with my nephew and his apple juice sometimes, I've thrown out a few half empty jugs 😂",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I remember a juice box I had at school was fermented. My father was a teacher there so I took it to him as it tasted funny. \n\nHe tried it, yup very alcoholic. Then proceeded to drink the lot",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Toss some bread yeast in there, put a rubber glove over the top, and stick it in a closet for 2 weeks and you'll have some pretty drinkable hooch.  Even more so if you get unfiltered organic cider.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Ask them if they’ve ever used vanilla essence - it has a very high alcohol content. \n\nAs does the human body - most people have a BAC greater than 0.00 as a baseline.",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "And, OPs friend better not be feeding her son any bread, either. Similar trace amounts of alcohol there, too.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Vanilla essence too.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1161,
          "content": "Unless OP cooked the sauce for >3 hours, it's simply [not true](https://www.craftybaking.com/howto/alcohol-burn-chart) that there's no alcohol left. After 30 minutes of cooking time, there's still about 1/3 of the alcohol present. Less alcohol cooks off than people think. \n\nOP is still NTA - whatever alcohol was left was not enough to hurt the kid, and it's pretty common to use wine in pasta sauces - but people should know there is *some* alcohol left unless you cook it a really long time.",
          "id": 24,
          "comments": [
            {
              "score": 743,
              "content": "Plus, one meal isn't enough to hurt anything, unless he ate gallons of sauce. If the mom had a problem with it, she could have easily just said \"ooh...maybe I'll leave the wine out when I make it. I don't really like the idea of serving my kid alcohol. I'll let you know how it turns out!\". The harm's already been done by that point, so there's no need to freak out and be rude.",
              "id": 25,
              "comments": [
                {
                  "score": 217,
                  "content": "Agreed, the mom's freakout was unjustified, and the sauce was perfectly fine to serve. The mom should have handled this much better.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 1,
                      "content": "It was if the mom didnt know it boils off",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This is literally the most reasonable rational response",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 257,
              "content": "I always simmer my sauce for >6 hours. The acids in the tomatoes are even more stubborn than the alcohol and it takes a long time to break them down and get a nice mellow taste to your sauce. Not sure if OP is the same but I know it’s quite common",
              "id": 29,
              "comments": [
                {
                  "score": 124,
                  "content": "Same here. Cringe when I see people cook a tin of tomatoes for 5 minutes and call it done.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 515,
                      "content": "Both the “brighter” taste of an uncomplicated sauce cooked for a short amount of time and the proper, more layered flavors of a long cooked sauce are good. Each has their place. Fight me.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "The acidity is the best part. Keeps the meal tasting fresh and bright.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Order spaghetti and they bring you egg noodles and ketchup...",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 65,
                  "content": "Yeah, a lot of red sauces are cooked for a long time - I really more wanted to make the point about alcohol cooking off more generally. You can make a good red sauce in half an hour though if you use canned tomatoes and/or tomato paste, but I agree red sauce generally is better the longer it's cooked.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 22,
                      "content": "I personally find that with a good dosing of cayenne and cumin, brighter and more simple red sauces get a deeper flavor. I use both canned tomatoes and paste as well, fwiw.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I mean, in this case, a kid was hungry so OP probably didn't simmer for hours. That's definitely better though.",
                  "id": 36,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 213,
              "content": "I just wanna point out that most sauce recipes call for 1/3-1/2 a cup of wine. Even if she only simmered it for 30 minutes (which as a cook who frequently does red sauce, it’s never 30 minutes from the time the wine goes in to when everything else is done, but let’s go with it), that’s less than 3 tablespoons of 15% alcohol in a pot of sauce that certainly serves more than just an 8 year old child. That means at most, even if he ate half, he consumed less than a teaspoon of alcohol. Are you really going to try to say less than a teaspoon of alcohol is going to do any kind of harm or have any impact on him?",
              "id": 37,
              "comments": [
                {
                  "score": 57,
                  "content": ">whatever alcohol was left was not enough to hurt the kid\n\nDirectly from the comment you replied to. Whatever amount of alcohol the kid could have consumed was miniscule and not worth worrying about.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 56,
                      "content": "There’s *some* alcohol in tons of things, and at this amount it’s not alcoholic, by definition of what’s required to be labeled as alcoholic.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "I'm a recovering alcoholic, so I don't drink at all and avoid things with a lot of alcohol. \n\nThat said, I'll still have something like some brandy custard at Chrissy, wine in pasta sauce or beer in stew. There's so little actual alcohol in it that I feel safe eating these things. \n\nI'd straight out avoid a tiramisu made with Tia Maria, but red wine in Italian? It's fine.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Wildly off topic but TIL 'Tia Maria' is a real drink. \n\nMy name is Tia, and growing up I had a friend who would call me, and I quote, \"Tia Maria, my little alcoholic drink.\" I thought it was a nonsense phrase created by, you know, a child. I'm kinda shook now to know it's real.",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Thank you for the math. Such a small amount!",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "For starters, wine is only about 14% ABV. Add that to the fact that a recipe usually calls for maybe a cup (8 oz) and produces several servings, there’s still a negligible amount of alcohol that makes it into a child size serving. There’s literally zero chance of impairment from alcohol whatsoever. If the kid took a breath or blood test he’d register 0.0.",
              "id": 43,
              "comments": [
                {
                  "score": 24,
                  "content": ">whatever alcohol was left was not enough to hurt the kid\n\nYeah, I said OP was NTA. There was nothing wrong with serving the sauce to the kid. It's just not true that there's literally no alcohol left, like the person I replied to was saying.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "When I make chicken noodle soup, my entire base is a red wine, there is no water added at all, just wine. I can confirm that there is more alcohol left then one thinks with a 30 minute cook time. Fortunately, my kids are grown so it’s not a worry. When they get sick, I drop off a few containers of soup I’ve frozen and they suck it down. One of two things happen: they either feel better after eating it or they need longer care that they feel like shit. Makes it a good remedy either way.",
              "id": 45,
              "comments": [
                {
                  "score": 9,
                  "content": "I've never heard of a chicken noodle soup that uses a red wine base! That sounds amazing. Do you by any chance have a recipe you'd be willing to share?",
                  "id": 46,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I’ll send what I do in a message :)\n\nBecause I had no idea this was going to sound good to so many people edit:\n\nI have no actual recipe, I’m one of those haphazard “throw ingredients into a pot and don’t actually ever measure anything” type people. But, basically:\n6-7 chicken thighs\n1 stick butter\n1-2 onions chopped\n3-5 stalk celery chopped\nChicken bouillon or base\n1-2 bottles red wine (I’m partial to plum)\nRosemary\nSage\nCayenne pepper\nSalt\nPepper\nLemon juice\nEgg noodles\n\nMelt butter in large stock pan, add onions and celery, cook until celery softens. Add chicken and cook until cooked through. Debone chicken, add it back in pot, throw in the wine, bouillon or base, and 3-4 tbs of lemon juice. Bring to boil, add spices and carrots and cook until carrots are soft. Add noodles and cook until they’re all floppy. Lower heat and let simmer for 10-15 minutes. Adjust spices to taste. And it’s done!\n\nIf you’re trying to be health conscious and use olive oil in place of butter and/or chicken breasts instead of the fattier thighs, you might want to switch it to a white. The extra fat keeps the wine flavor from being too overwhelming. \n\nYou could probably use any soup recipe and just substitute the water or chicken stock with the wine and bouillon/base. I used to use white wine when doing this, but my husband is one of those “red wine goes with red meat white wine goes with white meat” type people and I’m a rebel so I switched to red to annoy the hell out of him.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I would love this recipe as well!",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "glad some sad this, sometimes upto 70% of the alcohol content can be preserved depending on the dish",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "But it *is* important to keep in mind if you're cooking for Muslims, Mormons, or anyone else who cannot consume any alcohol for religious reasons.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Let along how many foods have natural alcohols in them... bread has a level of alcohol, as does anything with yeast. Extracts are almost always made with alcohol. Hell our body can produce alcohol naturally.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I would love to see the original data, the rate of burn off in this table makes no sense. Not linear, not exponential, nothing. I would have expected an exponential process, which is perfectly in line with the 35% after 30, but 25 after 1h then makes no sense.",
              "id": 52,
              "comments": [
                {
                  "score": 2,
                  "content": "It fits pretty well (R^(2) of 0.94) to an exponential decay function if you plot it (if you count t=0 as 100%, the fit goes up if you don't). The [phase diagram](http://www.ddbst.com/en/EED/VLE/VLE%20Ethanol%3BWater.php) for ethanol-water equilibrium is also a mess, but it acts more reasonable since we're staying in such low ethanol content.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Wait, it does fit? Guess I'll plot it tomorrow.\n\nIs your R^2 the same as χ^2 ? Assuming your value rates how well the fit fits, might be just a naming convention.\n\nActually. The decrease per 30 min is not monotonous. So it can not be a function of the form e^t. Because the derivative, also e^t, would have to be monotonous. So it is not possible to get 10% for one, 5% for the next, and 10% for the next 30 minute interval.",
                      "id": 54,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 286,
          "content": "Alcohol burning off is a myth. It doesn't burn off completely. It depends on how long OP had the sauce simmering. \n\nFor simmering, 15 minutes has 40% remaining. 1 hour has 25% remaining. \n\nIt still wouldn't have much alcohol in it, but it's more than zero. It certainly isn't \"grape juice\".",
          "id": 55,
          "comments": [
            {
              "score": 97,
              "content": "Depends on how they made the sauce.  When I braise I add wine to deglaze, then add more to get the volume of wine I want, then boil vigorously until I can’t ignite the fumes.  Then I add the stock, bring it to a boil, add the meat, then let it simmer.  Driving off the alcohol improves the meat flavor a lot.  \n\nBut even you just add it to the sauce and simmer for half an hour, you’ve still removed at least half the alcohol, and with the wine making up, what, 1/4 of the sauce in the first place there wouldn’t be enough to get tipsy from anyway.  You’re talking 1.5% or less alcohol by that point.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 69,
              "content": "Thanks for posting this, and others have as well.  Some more facts/times in this web post for anyone interested:  [https://www.foodnetwork.com/how-to/packages/food-network-essentials/cooking-wine-does-alcohol-burn-off](https://www.foodnetwork.com/how-to/packages/food-network-essentials/cooking-wine-does-alcohol-burn-off)\n\nI cannot imagine a red sauce that's not simmered for at least 2.5 hours, at which point 5% of the alcohol is remains.  Also worth bearing in mind how much alcohol we are talking about here in the first place.  I'm guessing for a small batch, you're talking about 1/2 cup of wine or in that neighborhood,  and let's say that's \\~12% alcohol by volume, mixed into a whole pot of sauce.  Now I was told there would be no math here, but 5% of that initially small amount spread through that whole sauce is such a small amount that it's kooky to even consider IMO.  Hell, the Italians who inspired that red sauce are probably wondering why your 8 YO isn't getting a little nip of red to go with it!",
              "id": 57,
              "comments": [
                {
                  "score": 15,
                  "content": "According to the original post, the child requested pasta so the original poster made the sauce. I doubt that the eight year old waited two and a half hours for the sauce to simmer.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 2,
                      "content": "She could have had a container of sauce in the freezer.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "A good red sauce should simmer for more than a few hours",
              "id": 60,
              "comments": [
                {
                  "score": 12,
                  "content": "She baby sat him for an evening, she's not simmering a sauce for hours.",
                  "id": 61,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": ">It still wouldn't have much alcohol in it, but it's more than zero. It certainly isn't \"grape juice\".\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC5421578/#:~:text=We%20found%20ethanol%20levels%20between,a%20relatively%20high%20alcohol%20content.\n\nLooks like the average grape juice would have a roughly equivalent alcohol content, by volume, to a red sauce cooked for an hour with a cup of wine, assuming the wine was no more than 20% of the sauce.\n\n15% in the original wine, 1/5th of the sauce, 25% after cooking = 0.75% alcohol\n\nAnd these are generous assumptions.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 224,
          "content": "Also there’s alcohol in extracts, like vanilla extract. I guess her son can’t eat cakes or cookies either.",
          "id": 63,
          "comments": [
            {
              "score": 64,
              "content": "Exactly! I make my own vanilla extract (vodka + split vanilla bean) and make things with it all the time. My 9 year old nephew eats them up.",
              "id": 64,
              "comments": [
                {
                  "score": 35,
                  "content": "Yes!!!  This deserves it's own thread.  I never knew this but am currently \"brewing\" my own vanilla extracts for the first time myself.  For those who don't know this, if you like good vanilla extract and have seen the incredible rise in prices over the last year or so, look into this.  It is SO easy, and just requires patience.  Buy some vanilla beans and some glass jars with good stoppers.  Fill them most of the way with vodka (or bourbon, I'm trying that as well, and I think rum will work too).  Split some vanilla beans and put them in.  And then wait (and gently shake them now and again).  Did my first batch in November.  Best to wait 6 - 12 mos, but I've read you can use as soon as 2 - 3 mos.  I made several bottles, because the real beauty is that as you use the bottles, you can just add more vodka and over time more beans and let it sit again.  So I have a rotation now.  Can't wait.  \n\nTL; DR:  there's not SOME alcohol in extracts, it's pretty much ALL there is!  So your chocolate chip cookies and french toast are alcohol bombs!!",
                  "id": 65,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I've just done this for the first time! One base of vodka and one of dark rum. I really need to make some buttercream to test them out as I'm at about 7 months.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 166,
          "content": "Vanilla extract is high proof alcohol.  I wonder if coworker ever serves her son baked goods made with vanilla extract?",
          "id": 67,
          "comments": [
            {
              "score": 86,
              "content": "The last time I went to Trader Joe's they asked me for ID to buy vanilla extract because recently some kids came in to buy a ton of it to get drunk off of.",
              "id": 68,
              "comments": [
                {
                  "score": 94,
                  "content": "Oof, that sounds very unpleasant.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 60,
                      "content": "And expensive!",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Barf!! Vanilla tastes horrible by itself.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Which is funny given how heavenly the aroma is. But the very thought of trying to drink it makes my stomach turn.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Dared my cousin to drink a shot of it once when we were kids. I didn't think he'd actually do it but that kid would eat/drink ANYTHING. It was gross to watch though, and he didn't feel great afterwards.",
                      "id": 73,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "All I can think is ‘how rich are these kids?’ Because vanilla extract is so damned expensive per ounce due to the original cost of the vanilla and the amount of time it takes to infuse in alcohol. So that is like drinking the spendiest cognac cost wise which kind of makes me laugh at how kids will adapt anything to get drunk.\n\nWhat we used to do was pour small amounts of spirits off the bottles at home (like a shot glass worth) so it wasn’t missed and then mix it with codeine based cough syrup which was very cheap and easily available. So a bunch of 14 year old Northern Irish kids mixing booze and opiates at a bus stop in the 90s and running from the police or army foot patrols was our high for a while.\n\nI graduated up to supermarket own brand white vermouth which at the time was about £2.69 for a litre. Fortified wine is about 14%. Chuck in some lemonade and you felt fancypants compared to necking cough syrup and vodka.\n\nVery tortured relationship with booze across Ireland but in hindsight I was also an addict when I was younger. So vanilla extract is either self regulating by cost or already into desperate territory.\n\nNow I keep vermouth in the house for cooking. It lasts much better than white wine so if you want wine for cooking but not always drink it, it’s a brilliant inexpensive way to do that if you keep it in the fridge. I do often look at the bottle and think ‘fuck, I am glad my boozehound days are behind me....’",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "🤮🤮🤮🤮🤮🤮🤮🤮🤮",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "When I was 14 or so I tagged along with my uncle to meet with some friends after his AA meeting.  One of them shared a story of when he was younger than I was going to the grocery store to buy vanilla to get his fix.\n\nThere were a handful of stories shared that night, but that one always stuck out to me.  I'd heard plenty of worse stories from people with the disease before, and have heard plenty since then.  But there was just something about that such simple level of desperation that hit me.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I also had a teacher in middle school that drank mouthwash during class, because of the alcohol. Vanilla extract on its own is nasty, so that's pretty bad.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Not too surprising!  I have read about plenty of cases where hardcore alcoholics drink mouthwash for a cheap alcohol fix.  Extracts are less common since they cost a lot more, but they still are subject to abuse.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "I never knew that vanilla extract was alcoholic.  Who says Reddit isn’t educational?  \n\nNo one screams bloody murder when quite young children take communion in the Catholic and Anglican churches. The wine may be watered down, but it’s still wine (or the blood of Christ, if that’s your belief, which sounds worse than a bit of alcohol). Wine in a pasta sauce is probably not going to harm a child even if they are genetically predisposed to alcoholism and it teaches them that alcohol is not just for getting drunk on, which is a good thing.",
              "id": 79,
              "comments": [
                {
                  "score": 11,
                  "content": "[deleted]",
                  "id": 80,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "Church wine can be pretty boozy tasting, which is fine, most people don't guzzle it. I let my kids drink communion wine ( well, in the before times anyway)",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Years ago I made some vanilla extract, an entire vodka bottle's worth and since you really don't use all that much when you bake, I still have a ton left. One day my sister and her kids were over and we were baking cookies and when she saw my vanilla extract in a vodka bottle, she got very uncomfortable with the idea of using it in something that her toddlers were going to eat.\n\nI personally thought she was crazy but I had some imitation extract left over from who knows when and used that instead. It didn't feel right to argue over it in front the kids and ultimately, I think she has the right to decide what she's comfortable letting her kids consume. I still think it's a non-issue though.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I think the coworker over reacted but you add a teaspoon or two of vanilla extract in a recipe usually, I'm guessing OP uses a lot more wine than that in the sauce.",
              "id": 83,
              "comments": [
                {
                  "score": 6,
                  "content": "A recipe will usually call for about the same amount of wine per serving. You don't want to use a lot because it overwhelms the flavor. (Source: I use wine in everything)",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 34,
          "content": "I agree. NTA at all. The alcohol burns off and won’t get anyone intoxicated, it just adds to the flavor. If OP’s coworker can’t be grateful for minding and feeding her child, she can go ‘wine’ to somebody else!",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Hey! Chef and biochemist here\n\nYou’re wrong. Mostly in a technical way; but occasionally it’s actually important:\n\nMost of the alcohol boils off - but as long as you have alcohol in a water solution, you cannot remove 100% of the alcohol by boiling. Not unless you  boil it completely dry (as in, completely, no moisture left)\n\nIn practical terms, there’s no difference in OP’s case. There’s so small amounts of alcohol left that it doesn’t matter at all - and OP’s colleague is being silly.\n\nIn cases where people are on medication it can actually matter - a red wine sc. can easily be strong enough to trigger an antibuse reaction.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yeah this is wrong and the reason why this myth gets thrown around so much. \n\n\"the U.S. Department of Agriculture's Nutrient Data lab confirmed this and added that food baked or simmered in alcohol for 15 minutes still retains 40 percent of the alcohol.\"\n\nDid YOU look do any research before posting this?",
          "id": 87,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "That's absolutely not true, most of it will burn off but definitely not all of it.",
          "id": 88,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Also vanilla extract. If this mom gives her kid chocolate chip cookies it’s the same concept.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3127,
      "content": "NTA. Your coworker is totally overreacting. I’m sure her kid has also eaten stuff with vanilla extract in it, which is like 35% ABV.  It's not like you served her kid a glass of Merlot with dinner lmao.",
      "id": 90,
      "comments": [
        {
          "score": 569,
          "content": "Right? Better cut out all of those cookies! There goes ice cream during the summer months! And good luck telling little Timmy that he won’t be getting a birthday cake this year.",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 386,
          "content": "\\*starts eyeing the shot-glass-sized vanilla extract bottle in the cabinet\\*",
          "id": 92,
          "comments": [
            {
              "score": 256,
              "content": "Vanilla extract is not potable as an alcoholic beverage- it will make you sick long before you'd get drunk.  It's done intentionally during the manufacturing process.  Sorry to harsh your buzz!",
              "id": 93,
              "comments": [
                {
                  "score": 111,
                  "content": "You underestimate how quickly I feel the buzz!\n\nprobably wise to abstain, tho, you're right. Thanks for the warning, I hadn't actually considered drinking straight vanilla extract but it's good to know that's a bad idea regardless. lol",
                  "id": 94,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Awesome thing about real vanilla extract is that it's awesome for tooth pains. Tastes a hell of a lot better than ora-jel, red cross, etc",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "Where where you 31 years ago when 7 year old me thought the vanilla would be a nice sweet treat...and it was not. And I didn’t even get a buzz.",
                  "id": 96,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "I know for a fact here in Australia it's not. You can drink it and get drunk off it if you can tolerate the vanilla. It's why here the law says it can only be sold retail in 50 or 100ml bottles Larger bottles can only sold through companies orientated towards commercial kitchens/wholesale.\n\nI'm also going to go ahead and doubt your claim they denature it in other countries. The only thing they normally use for that is methanol, and methanol is really poisonous and is not going to be added to food. There are many places vanilla is used without cooking so you can't claim methanol boils off. Every other denaturant. works on taste which is not acceptable for a food product.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yes, this is for the US only. And I never said the word denature- I said non-potable. Cooking wine in the US is made non-potable by adding salt to it.",
                      "id": 98,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 45,
              "content": "DIY with some cheap vodka and vanilla beans. Slofoodgroup has some that are reasonably affordable (for vanilla beans) and still really good",
              "id": 99,
              "comments": [
                {
                  "score": 37,
                  "content": "If you join vanilla bean co-op on facebook they get vanilla beans directly from the growers for less than $20/oz! I have vanilla extract that I started in 2018 with beans from papua new guinea and it's so good.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I looked into it, but sadly no such thing here as cheap.  Cheapest is about 3x the price of Costco in the States.  I can buy good real vanilla for less than I can make it.  I don't think I have enough friends that would use an ounce even in a year.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I split an order with some coworkers, I think we got 4 oz of mixed origin grade b beans (currently $55) and we each ended up with 9 or so beans. It doesn't take much to make some good vanilla, I've got about a bean and a half (pulp scraped out for other uses) in about 6oz of vodka and when I run it down enough I'll refill it a few times and add another split bean if it gets weak. ¯\\_(ツ)_/¯ vanilla extract (the real stuff) is still like, $8 a small bottle at kroger, so I figure $5 of beans and $9/liter vodka is at least a fun experiment. The beans'll keep (well wrapped) in the freezer for a good while too",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "That’s because vanilla extract makers pay $1/gallon in alcohol taxes while when you buy vodka at costco, $13.50/gallon was paid in taxes.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I sense regret in your future",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Don't do it. Vanilla extract tastes terrible!",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "My parents have been cooking with wine since I was very young. I never even thought this would be an issue!",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Came here to say this.   Almost all extracts are high ABV.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2228,
      "content": "Ok, at first I thought you accidentally served a sauce that was 8 years old. Then I thought you might have accidentally used an 8 year old bottle of wine for your pasta recipe (presumably being saved for something more special). \n\nThe thought of a kid eating a sauce with wine in it being bad was so far off my radar I did brain gymnastics to figure out what else the problem could have been 😂. NTA.",
      "id": 108,
      "comments": [
        {
          "score": 320,
          "content": "LOL that’s what I thought too!!  An old bottle of sauce was a much more interesting ethical dilemma!!",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 78,
          "content": "Yep! I was reading it and waiting for her to have a glass of wine with dinner and give the kid some to drink either from hers or his/her own and then got through it like wait what? Reread. Still don’t get it.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "As a mother as well as someone who has a serious hobby of cooking, I went through the same gymnastics! You have to contort pretty seriously to get there.",
          "id": 111,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "LOL. I, on the other hand, thought that OP served the kid pasta sauce that expired 8 years ago and the mother called and told OP of the kid's food poisoning.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "lmao yep, I though the second one and was like \"damn, don't use a nice bottle in cooking\"",
          "id": 113,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "My first thought was the 8 year old bottle of wine as well! That's not particularly old for reds, per se, but for something I'm combining with tomato and spices? I'd be offended too!",
          "id": 114,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 779,
      "content": "[removed]",
      "id": 115,
      "comments": [
        {
          "score": 179,
          "content": "There is still actual alcohol in the dish. You can't completely boil out the alcohol, but it's a negligible amount.",
          "id": 116,
          "comments": [
            {
              "score": 78,
              "content": "I was going to say this. The alcohol doesn't boil out, but the actual amount of alcohol in the dish is not enough to harm anyone.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 58,
          "content": "This is what I think too. If you grew up with parents who didn't cook a ton, didn't have much money for extra ingredients, or just had a different set of family recipes, alcohol in food is totally a foreign concept.",
          "id": 118,
          "comments": [
            {
              "score": 3,
              "content": "not from a place where this is common and im horrified by this thread ngl",
              "id": 119,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 497,
      "content": "INFO: Pasta sauce recipe\n\nIn all seriousness, NTA",
      "id": 120,
      "comments": [
        {
          "score": 50,
          "content": "I’m not OP but I made a red wine sausage pasta dish all the time that’s a household favorite. It’s from Ella Bridgeland’s Midnight Chicken recipe book and is called Marital Harmony Sausage Pasta. \n\nI can never find it online but it goes like this:\n3 red onions cut into half moons, fry on medium heat in butter and olive oil till caramelized.\n\nAdd sausage meat (I skin three large salsiccia and use fingers to pull apart into mince) and brown with the onions.\n\nAdd black pepper and a generous sprig of fresh rosemary (I go ham on the rosemary because I love it. I chop it up finely whereas the recipe leaves the sprig whole and removes it at the end).\n\nAdd a can of tomatos, refill the can halfway with red wine (or more to taste) to rinse out the tomato scraps and add to sausage and onions.\n\nLet simmer for as long as you want. Grate some Parmesan. If you have an old Parmesan rind that can go in the sauce for flavour. \n\nBoil your pasta. When it’s 3 minutes from al dente, add your grated Parmesan (generous handful) and a good glug of double cream. Lower the heat. \nDrain the pasta and add to sauce and stir vigorously. \n\nEat with the rest of the red wine and some garlic bread if you fancy. \n\nCan’t recommend this dish highly enough.",
          "id": 121,
          "comments": [
            {
              "score": 4,
              "content": "\"Add a can of tomatos, refill the can halfway with red wine (or more to taste) to rinse out the tomato scraps \"\n\nI do this whenever I cook with tomato sauce.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "yes!! I'd really like to try it",
          "id": 123,
          "comments": [
            {
              "score": 19,
              "content": "Are you over 8 years old?",
              "id": 124,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Yes lol let’s make this top comment",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Lol came here to ask for it also! \n\nBut agree, NTA",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Agree I really want to try it as well.",
          "id": 127,
          "comments": [
            {
              "score": 10,
              "content": "Me too please share the recipe u/wine_aita",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Me too please",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I’m pretty proud of my beef red sauce/bolognese, so I’ll shamelessly give it here even though I’m not OP. The instructions look really long but are fairly simple, I just hate recipes that don’t give enough detail. Serves 4-6.\n\nGrate a couple of carrots and finely dice an onion, cook on low for about 10 mins in a broad based pan in around a tablespoon of olive oil. Include finely sliced celery if you don’t hate the stuff.\n \nAdd 400g beef mince, minimum 10% fat ideally, and turn the heat to medium. Press the mince down to brown and then turn it over and do the same on the other side. (You can use low fat beef or turkey mince, but the sauce won’t be as smooth.)\n\nAdd dried herbs and/or garlic. I use marjoram and basil.\n\nAdd about 200ml red wine and stir it well into the mince, breaking it up. You want something acidic to help tenderise the meat at this stage, so it goes in now, not later. Some people use milk for the same purpose.\n\nAdd 1-2tbsp tomato purée and cook it on low for about 3 minutes, stirring so the mince is completely breaking up. At this point the meat should develop a glossy sheen. \n\nSnip a rasher of bacon into tiny pieces, stir it in and let it cook for a couple of minutes. Smoked bacon is best. If you don’t want to add bacon, add a good shake of salt at this point.\nIf you want to use the sauce as a vegetable-hiding mechanism, add some very finely diced mushrooms too.\n\nAdd a 400g tin of plum tomatoes or passata (chopped tomatoes aren’t as nice in my experience, and the tinned plum toms break up easily with cooking and a bit of stirring).\n\nFill the tin about two thirds with water and pour the liquid into the pan, swilling it around to get all the tomato bits out. If using a slow cooker, only fill the tin one-third.\n\nGive it a good stir for about 3 minutes on high heat, so that it’s bubbling (this is a hygiene thing more than anything). Break up those tomatoes and any lumps of mince.\n\nCover and cook really low for as long as you can bear to. Some people turn the heat off for a bit, then on, for ultra low cooking. Or slow cooker.\n\nWhen ready to serve, start cooking the pasta and take the cover off the sauce pan. While the pasta is cooking, heat the sauce so it bubbles and steams, to reduce the sauce down to whatever consistency you prefer. Stir it regularly so it doesn’t stick to the pan.\n\nAdd any chopped fresh herbs you want at this point, such as basil or parsley. \n\nTaste the sauce and if it’s lacking a certain something, add a few drops of soy sauce.\n\nOr turn it into a pasta bake. Don’t reduce the sauce, cook penne or similar pasta for three or four minutes less than normal and drain it. Layer sauce, pasta, sauce, pasta in an oven dish, put a load of grated mozzarella on top, and bake it at 200 degrees C for half an hour, until the liquid is bubbling furiously and the top is brown.",
          "id": 130,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Was looking for this comment!",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Scrolled through all the comments looking for the recipe.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "It might be similar to what I do... Brown meat in pan over high heat with a tablespoon or two of olive oil, a diced brown onion, 1 large carrot finely diced, 3-4 cloves garlic, and red chili if you want spicy.  When meat is brown and onions transparent, add 1/4 - 1/3 cup red wine, usually like a cab sav or shiraz, not merlot as it's too sweet (but makes a great sangria or mulled wine!).  \n\nKeep the heat on high to burn off some of the wine, then add a couple cans of tinned tomatoes, two tablespoons tomato paste, some oregano (and basil if you like it), and salt and pepper to taste. Keep that simmering over a low heat until it reduces in the pan and then top up with two cups water and a stock cube if you prefer more flavour (but in that case watch the salt you add). It'll be done in about 30 minutes, but if you can keep it on a low simmer for a couple of hours the flavour will be pretty good!",
          "id": 133,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 430,
      "content": "NAH\n\nBut FYI:\n\n>  I told her that the alcohol almost entirely boils off when the sauce simmers\n\nThat is **not true**.\n\nhttps://www.foodnetwork.com/how-to/packages/food-network-essentials/cooking-wine-does-alcohol-burn-off",
      "id": 134,
      "comments": [
        {
          "score": 572,
          "content": "I'm just playing a loose math game, I know it's some assumptions but it gives a possible ball park, \n\nA cup of wine in a red sauce.  At an average of 10 percent alcohol content.  Over 15 minutes simmer under an hour an a large sauce pan.  Down to around 5% alcohol content.  \n\nThere's 16 tablespoons of wine in that original cup.  Let's say the kid packs away a quarter of that sauce.  That's roughly at 4 tablespoons of 5% alcohol wine in it.  Legally orange juice can have nearly 1% alcohol in it and still be run off the mill non alcoholic orange juice.  2 cups of orange juice could have nearly the same alcohol content and I'm guessing she's not shitting herself in hysterics if he drinks a few cups of orange juice.\n\nYeah, I know I'm playing looseygoosey with the numbers but made me laugh.",
          "id": 135,
          "comments": [
            {
              "score": 176,
              "content": "Orange juice, huh? This Muslim really needs to get off this thread 😬",
              "id": 136,
              "comments": [
                {
                  "score": 169,
                  "content": "water + sugar likes to ferment and make alcohol.  It's not just orange juice.  Yeasted bread dough is an odd example that comes to mind.",
                  "id": 137,
                  "comments": [
                    {
                      "score": 118,
                      "content": "I was doing something that involved soaking potato peelings recently, put the jar away, forgot about it, came back and found I’d made vodka. \n\nNow I can go to prison with a skill.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "I remember looking into this some years back and concluding that bread was fine-- and we bake with yeast too-- but I don't remember why I concluded that..\n\nVanilla extract and soy sauce are also annoying examples of things with unexpected alcohol content... But some brands of them don't have alcohol so we just have to search hard enough.",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 37,
                  "content": "Lol orange juice is just or of the worst, as far as I know, for rapid fermenting lol other commenter is correct, it's all of them to some degree.  IKEA juice is non alcoholic but also lists its, very low, alcohol content.  \n\nMy last self left some orange juice in the fridge too long and it ended up smelling like a vodka + oj screw driver.  Did not taste verify however.  But time and sugar is the method for home fermenter wines",
                  "id": 140,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I remember once making a smoothie for my wife, she drank half and I stored it in the fridge. A month later after forgetting it, I opened it and smelled it. I thought for a moment I was a distillery.",
                      "id": 141,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Ah, one of the main ingredients of pruno, aka prison hooch.  Any fruit can be turned into alcohol...even on the [tree](https://www.msn.com/en-us/lifestyle/pets/drunk-birds-swarms-of-cedar-waxwings-which-eat-fermented-berries-spotted-in-north-texas/ar-BB1dilp2).",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "What?",
                  "id": 143,
                  "comments": [
                    {
                      "score": 121,
                      "content": "They’re joking about how the Quran says Muslims shouldn’t drink alcohol in order to stay halal—if orange juice has alcohol, it isn’t halal. HOWEVER, I’m fairly sure there’s an exception if they don’t know something isn’t halal. \n\nBasically the joke is “I need to get off this thread to avoid finding out other things that I consume regularly have alcohol, so when I consume them it doesn’t count as haram”\n\nETA: this is all moot though, bc the rule is *technically* based on whether it’s an intoxicant, and according to [IslamQA](https://islamqa.info/en/answers/33763/ruling-on-drinking-beer) even sauce with wine could be halal, because you cannot possibly become drunk from it.",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 164,
          "content": "[deleted]",
          "id": 145,
          "comments": [
            {
              "score": 3,
              "content": "I think to the mother the point still stands that 'virtually no alcohol' is not 'no alcohol at all'.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 89,
          "content": "OP says “almost” entirely.  I don’t know the recipe, but I’m guessing the wine is used to deglaze (thus, boils violently, boiling off much of the alcohol), and then simmered for quite some time.",
          "id": 147,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "Well they said it almost entirely burns off, not that it entirely burns off. Which is still accurate.",
          "id": 148,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 357,
      "content": "NAH.\n\nIf she's not used to using alcohol in cooking,  i can understand why it shocked her and made her upset.  She needs to do a little thought rearranging so she understands that it isn't a horrible thing you did. \n\nI use alcohol regularly in my cooking..  from gammon cooked in fruit cider (makes it beautifully moist and gives it a slight sweetness, while cutting the salty taste a little),  to red wine in tomato sauces..  to guiness in my steak and ale stew (can be used as pie filling,  but i don't eat pastry much).  \n\nMy kids have grown up with that being the norm,  but it sounds like your coworker isn't used to anything like that. \n\nIn future,  it's always best to ask the parent if their kids can have foods that might contain a little bit of alcohol.  Yes most of it boils off,  but there will still be a small amount in there.",
      "id": 149,
      "comments": [
        {
          "score": 64,
          "content": "This is what I was thinking! I bet she just was feeling protective of her kid, I can understand that, especially as a knee jerk reaction.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": ">In future, it's always best to ask the parent if their kids can have foods that might contain a little bit of alcohol. Yes most of it boils off, but there will still be a small amount in there. \n\nRemember though, if they say no, that also means no fruit or fruit juices, no extracts, no soy sauce, no wine or cider vinegar, and nothing made with yeasted dough of any kind (yes, this means basically all bread is out), among other things.\n\nAll of these things have alcohol, many in larger quantities than remains in a serving of wine sauce after simmering.",
          "id": 151,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 201,
      "content": "While I definitely think you're coworker is being very weird, I'm gonna go unpopular and say NAH. \n\nYou're right that simmering off the red wine does burn off most (but not all!) the alcohol, and most wine used in cooking is for flavour and taste purposes. My mum uses red wine in her bolognese sauce as well, and when I worked as a dishwasher we actually had these giant box wine caskets that specifically said \"White Cooking Wine\" and \"Red Cooking Wine\" on them, for the purposes of, you guessed it, cooking with.\n\nBut I can kinda get the coworker's side. You have a child in your care and gave them a recipe with alcohol in it, and not tell the parent. Again, I get it, it was for cooking and to give it taste. But a parent, especially one not used to cooking with alcohol, may not see it that way. All they saw was that you gave their young child red wine, and didn't tell them beforehand.\n\nKeep using your red wine in you sauce, but next time you babysit, maybe give a heads up to them that you use red wine for flavour in your sauce and would they be ok with it. Even if it's an overreaction, a parent does have a right to know what their child is being fed especially if it contains alcohol.",
      "id": 152,
      "comments": [
        {
          "score": 17,
          "content": "I agree.",
          "id": 153,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -4,
          "content": "I agree. The optics of OP making a dish with alcohol for this child specifically aren’t great. \n\nThis kid wasn’t invited over with their parents or was fed something from the fridge that OP forgot had alcohol. This was a choice OP made to prepare the sauce for the child. \n\nPasta sauce doesn’t have to have red wine in it. Even if it might be better, if you’re specifically making the meal for a child who isn’t yours, you don’t get to decide to feed them alcohol. \n\nYTA OP.",
          "id": 154,
          "comments": [
            {
              "score": -4,
              "content": "Yeah, this. Soft YTA from me - I get that OP probably didn't think about it and just made their favourite sauce on autopilot, but I don't think \"don't give my eight-year-old child food with alcohol in it\" falls into the category of \"dietary restrictions\", as so many people on this thread are insisting, and the people trying to rules-lawyer how much alcohol might be in slightly fermented orange juice or vanilla extract are missing the point. \n\nIt's not about whether any specific individual would allow their kids to have alcohol - that's a decision for each parent to make themselves, no judgement either way. But a large enough proportion of parents would not allow their kids to have alcohol, or to only have it under their own supervision, that you shouldn't give kids that aren't yours food with alcohol in it. \n\nOP made a bad call here and should have taken the social stigma against kids having alcohol into account.",
              "id": 155,
              "comments": [
                {
                  "score": 8,
                  "content": "Not giving kids alcohol isn't about social stigma, it's about their health - so pointing out that the amount of alcohol is too low to have any health impact isn't \"rules lawyering\", it's absolutely the crux of the matter.",
                  "id": 156,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I disagree that it's about the health impact. Explaining the respective amounts of alcohol in wine vs. fermented orange juice vs. vanilla extract is helpful for explaining why a child should or shouldn't be allowed those things, but we're not debating whether it's okay for a kid to have alcohol. The crux of the matter here is whether it was okay for OP to make that decision/assumption for someone else's child.",
                      "id": 157,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 161,
      "content": "NTA. Although I’m sure she really is offended that in her eyes you “gave her child alcohol”, I also think she is a bit jealous that you made something her son hasn’t quit raving about.",
      "id": 158,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 151,
      "content": "[deleted]",
      "id": 159,
      "comments": [
        {
          "score": 43,
          "content": "If you’re comfortable with your kid drinking fruit juices you can’t complain about alcohol in cooking (as it’s very similar strengths).\n\nI don’t know if she does like her kid drink fruit juice but it really be normal to check a parent is ok with your giving their kid fruit juice?",
          "id": 160,
          "comments": [
            {
              "score": 26,
              "content": "I think a lot of people wouldn’t even think about it. People watching other people’s kids should be told about allergies and serious reactions. If you’re picky about sugar, ingredients, dyes, etc. it might be best to not have babysitters or find one that can abide by your very specific rules.",
              "id": 161,
              "comments": [
                {
                  "score": 17,
                  "content": "Or send a meal with them.",
                  "id": 162,
                  "comments": [
                    {
                      "score": 4,
                      "content": "This generally works, unless the child asks for what they see others eating wherever they are.",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 13,
          "content": "It is the same principle as not giving someone else's kid sugary treats. You don't know how they view it or if the kid is allowed sugar outside of special occasions.",
          "id": 164,
          "comments": [
            {
              "score": 44,
              "content": "> kid is allowed sugar\n\nSure, just serve 'em up a PBJ because that apple has too much sugar in it?! More succinctly put: If you allow people to watch your children and you don't provide meals/snacks for them, your child may eat differently than if they were under your supervision. Bring snacks if you don't want them to eat 'be allowed sugar' or whatever.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "To be fair, the OP did ask her coworker if the kid had allergies or dietary restrictions.  Mom should have mentioned she didn't want her kid eating anything cooked with alcohol if it is such an issue to her.  When this question pops up about my kids, I point out that my daughter doesn't like anything with red sauce, and nothing spicy.  So if they are getting pizza, to just get her cheese sticks, or if they're having pizza to give her plain noodles, or that she'll only eat cheesy roll ups from Taco Bell made with cheddar cheese instead of the 3 cheese blend.  That way they're prepared to make or order something that isn't going to result in my kid refusing to eat (or when she was younger, a tantrum) whatever they served.  It's my job as the parent to inform whomever will be watching her what is, and is not, okay to give my kids.",
          "id": 166,
          "comments": [
            {
              "score": 4,
              "content": "How was the coworker supposed to know that somebody would serve her kid something with alcohol in it, when people typically don't do that?",
              "id": 167,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "And how was OP to know thks wasn't okay? Like is she supposed to read minds? If you don't want your kid to have something tell whoever is sitting or minding them that, otherwise you can take that as a lesson of remembering to communicate next time instead of bitching about someone feeding your kid.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}