{
  "post content": "My daughter has recently turned 16 and, for a couple of months now, has been constantly asking for a lock to be put on her door.  She says it’s to keep her brother out - who barges into her room every now and then to bother her - but I’m not sure if the benefit is worth having the lock in place.\n\nI don’t like the secrecy of her locking herself in her room and I’m worried she’s trying to hide something from me or that she’ll take the opportunity to lock me out. I admit that I’ve forgotten to knock sometimes but other than that I see no reason as to why she’d need a lock. \n\nThe way I see it, it’s my house and I am simply unwilling to have any locks put in anywhere. She’s young, and doesn’t really know what’s she’s asking for.\n\nSo, WIBTA if i don’t let her get the lock installed?",
  "id": 1,
  "comments": [
    {
      "score": 37388,
      "content": "YTA, kids need privacy. keep a spare key in case of emergency's (don't use it for grabbing clothes for a wash) \n\nIf you are not gonna let her have secrets in her own room she is gonna have them outside where your control is 0.0%",
      "id": 2,
      "comments": [
        {
          "score": 15063,
          "content": ">If you are not gonna let her have secrets in her own room she is gonna have them outside where your control is 0.0%\n\nThis 100%. YTA",
          "id": 3,
          "comments": [
            {
              "score": 3599,
              "content": "Yeah!! That’s right!!! Op,  YTA! kids needs privacy and confidence!",
              "id": 4,
              "comments": [
                {
                  "score": 1279,
                  "content": "is this sarcasm, as all the !!! make it seem as such",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1000,
                      "content": "No!!!",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 34,
                      "content": "The ambiguity is what makes it worthy of an upvote.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "No sarcasm, sorry for putting too much !\nIm not very good in english but my comment was serious",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "This. Unless she's given you a reason not to trust her, give her the benefit of the doubt. Teens NEED privacy.   \nFor hiding weed or cigarettes? No.  \nFor making sure nobody barges in on them changing or masturbating? Yes.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "And OP admits to barging in and admits the brother barges in.\n\nMy brother and I both had locks on our bedroom doors. So did my parents room. Just the simple knob lock like bathrooms usually have.\n\nI never really used it until I was a teenager and I wasn’t “hiding” anything except my body; something I didn’t feel private about until puberty. I would usually only lock the door when I was changing my clothes or doing other private girl stuff like attempting a makeover. Mostly I didn’t want any of my brother’s goofy friends to barge in and see me naked. Another private thing is lip syncing while dancing in the mirror. Sometimes you have to derp and that’s private.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2178,
              "content": "My mom was like this and now she has a sneaky kid who doesn't trust her all the way!",
              "id": 11,
              "comments": [
                {
                  "score": 1664,
                  "content": "This thread is like therapy for me.\n\nMy mom wasn't that bad, but I still figured out that my best course of action was to do all my stupid teenager shit away from home and pretend to be a model child while in it.\n\nI was even the guy that the other parents trusted. As long as they were with me, their kid *definitely* wasn't up to no good. \n\nThen we'd go and get tattooed.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 681,
                      "content": "My friend got in trouble for drinking alcohol with some other friend. Her parents said I was the only one she was allowed to hang out with. \n\nWe proceeded to get drunk.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 86,
                      "content": "My mom was an ultra nutbag, didnt allow a door lock for most of my teen years, or any privacy what so ever.  I found ways that made me seem like a total sociopath because of how different I was from home/adults and out in the world, and had zero remorse of the stupidly bad crap I, as a teenager, pulled off without a single question. \n\nI was also the kid everyone wanted their kids around because I was 'responsible' and 'knew better' and 'a great influence'. I was in fact the worst person to have their impressionable teenagers around and were always in deep.\n\nI also moved out the day I turned 18 without telling my mom.\n\nAs an adult I've had to rewire my brain and not be 'sneaky' and sometimes I find myself doing benign sneaky things in my own home and have to stop myself and have a talk about what the eff I'm even doing. \n\nIt's not a good thing to be controlling of a teenager's privacy, it doesnt do what you want it to do.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "See I went the other way and didn't do any typical teenage stuff terrified that I'd get caught and get lectured. Now I'm no longer a teenager but has no life experience and is playing catch-up. This has lead to self-confidence issues since other people seem more sure of who they are",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1212,
                  "content": "My parents are absolute saints, but they always barged in without knocking or telling me anything. they weren’t crazy or trying to be jerks, they were just overly concerned with what I did behind closed doors because I was growing up and they felt less included in my life. Also they were very paranoid about what I did online because they fed into the paranoia that hackers were going to find me and abduct me or some other equally implausible situation.\n\nThat taught me to be extra sneaky. I felt like I could never trust them with secrets because they were always trying to see what I was doing, and I would always feel like I had to hide it. It wasn’t even bad stuff, just me watching a YouTube video, or playing video games. Whenever they came in I would instinctually pause my game and turn the screen off or tab out of some music video, or put down the book I was reading because I didn’t want to explain every minute detail of what I was doing to them to show them I wasn’t trying to hack the planet or download anything illegally, etc. \n\nThis fed into my adult life, too, even when my wife and I were first married she would come in while I was playing video games or anything like that and I would stop the game or turn the TV off to talk to her until she left. Eventually she mentioned how weird I was acting and it clicked together that I had been Pavlov’d into acting like that unintentionally by my parents.\n\nTl;dr trust your kids and let them have alone time without you feeling the need to barge in and check on them every 20 minutes.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 294,
                      "content": "That stuff about instantly pausing YT and tabbing out, that's me. I immediately pause whatever I'm doing the instant another person enters the room, even if it's just a cat video.\n\nThe amount of internet monitoring I went through when I was younger has directly fed into my complete unwillingness to share anything about my online activity with my family now. And since I'm a shut in and most of my life is online, that basically means I don't talk to my family about myself.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Wow, you put it into words, well done. I got teased so much as a kid for the games I like or what I watched on YouTube by friends and parents. And while it was always meant as a joke it got to me so much that I never told friends what games I play, or my parents what I'm always watching on my phone. I just always come up with some boring excuse or change the subject. \n\nEven now, With my coworkers they'll ask me what I'm doing on the weekend, and I'll say \"ah I dunno, whatever I guess\" when I full well know in my head its \"I'm gonna play some vidja gamez and listen to some zelda music and watch Minecraft videos :D\" but the idea of the look they'd give me makes me just continue being a blank slate to everybody.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Kids who grow up without privacy don't turn out to be little Angels, they just get good at lying. Don't make a rift between you and your kid, OP.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yta. Yup. My mom refused to allow me to have a lock on my door. I couldn’t even have a door knob. There was a hole in the door and my brother would peep on me well into my teens (he was also in his teens and old enough to know better) I thought it was a reasonable request until my mom said “why can’t your brother look at you? What are you hiding?” So I started hiding things at my friends houses. Not even bad things like drugs. I would keep favorite books and clothes at their house and have them bring them to school and then take them back to their house. It was the sense of having something that was just mine that was important. Eventually I did hide bigger things from her (like my first boyfriend and several sexual encounters) I didn’t tell her when I went on the pill, I didn’t tell her when I would get sick. Once I had gotten a very small travel size bottle of (whiskey?) bc I had read it helped with a sore throat. I hid it behind my curtain bc for some reason it felt important and right to do so. She would tell me not to close the door when I went to the bathroom or showered and my brother would stand and stare at me. Later she wasn’t told when I went into labor at age 30 or when I got married or when I had my second kid. Let your kids have some privacy\n\nEdit I figured out pretty quick I could shimmy out my window and pee in the bushes. I would do this to avoid going to the toilet so he couldn’t watch me\n\nEdit two to answer some questions: my mom and brother actually walked out of my life, Ghosted I believe is the word, when I was three months pregnant with my son. Second pregnancy in my thirties. Yes they knew I was pregnant, no they have never seen him. I have slowly found some peace knowing they can’t hurt my kids since they don’t know where we are and changed my number. I still have a lot of issues to work out but I’m not self harming anymore (yeah that was an issue and oh boy the shit storm that caused) so I am doing a bit better and am happier at least. \n\nYes I did tell my mother. Most I got was “well pull your pants over your knees so he can’t see anything or wear a towel.” I don’t know what he’s doing now, tbh.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4200,
          "content": "Yep, give her some privacy now and save yourself years of resentment. \n\nOP, she’s 16, not 6. She knows what she is asking for. \nMaybe you should also start teaching and demonstrating basic respect before your son turns out disrespectful of others like you.",
          "id": 21,
          "comments": [
            {
              "score": 3977,
              "content": "Exactly, she will be a legal adult in *two years*. Saying she's too young to know what she's asking for when she wants to be afforded some very basic privacy, when in two years she'll be legally able to sign contracts, is ridiculous.\n\nEdit: Also, OP needs to realize they are not just interacting with their 16-year-old daughter; they are interacting with the memories of the future adult their daughter will become. OP, do you want a frosty relationship with your 25-year-old daughter? Do you want her to keep you at arms-length from her own kids (your grandkids) some day? Because this is the kind of petty, controlling behavior that people *remember* from their parents as they age, that causes them to go low- or no-contact when they gain independence.\n\nOne more edit: I just saw in a comment from OP that they also don't let their daughter have locks on her bathroom door, so I think maybe this OP is beyond reason. I hope the poor girl can make a quick escape at 18. She has a long two years ahead of her.",
              "id": 22,
              "comments": [
                {
                  "score": 1627,
                  "content": "Lol, my parents hated it when I even just *closed* my door. Anyway, I now live on literally the other side of the planet from them.\n\nOP: Privacy is a *need*. Being comfortable in your own space is *incredibly important* for growing up. I didn't get my own space until college, and even then I had a roommate; only in the past few months have I had more than 10 square feet of area to express myself. And it's like breathing for the first time.\n\nYes, your daughter wants you to not know 100% of the things in her life. I'm sure your mother doesn't know everything about yours.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 538,
                      "content": "[deleted]",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "Saaaame, jeez I thought I was weird for feeling intruded-upon all the time. It's cathartic that people have had similar experiences.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "My dad had a problem with me closing the door too. I don’t talk to him now at all. There was a lot more fucked up stuff but this was one of it.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Yeah... Today I learned that not giving your kids privacy was not the norm. Privacy for me was having my laptop screen pointed away from other people or being up past when my mom was.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "My mother would always barge into my room unannounced, and I knew for a fact she would go through my stuff while I was away. When I asked for a lock for my door she laughed in my face and told me I could do that if I have my own house. I love my mother, and she loves me, but she is way too controlling. I'm moving (back) to the other side of the world in 4 months, because god damn I love the feeling of freedom and not being checked all the time. I even have to lie to her about small things because I know she will worry too much. Back when I was 15-16 I had to lie because otherwise she wouldn't even let me do certain things. Thanks to this I'm a pro at lying and keeping things secret. I'd let my friends stash my weed, tobacco, booze, and when I wanted to do shit with girls I would just do it outside at a random park or whatever. Yeah, OP you don't want to force your kid to be secretive/lying to you, because it can go wrong one time, and I'm a recovering pathological liar because of my mother.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Wow I shuddered when I read this bc that’s the case with me and my mother. She was super controlling and restricting my privacy was a huge part of that. She constantly went through my things, read everything I wrote down, threw out magazines and books she didn’t like me reading. If I tried to lock the door she would try to break it apart or remove the handle. \n\nI have not seen her in 15 years. We communicate through email (rarely) and she lives in Europe. I keep her as far away from me as humanly possible.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 358,
                  "content": ">OP needs to realize they are not just interacting with their 16-year-old daughter; they are interacting with the memories of the future adult their daughter will become. OP, do you want a frosty relationship with your 25-year-old daughter?\n\nYeah this whole thing literally sounds like  something my mom could have written about our family 9 years ago. We live less than 20 minutes apart and barely talk now.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 18,
                      "content": "If you'd said 15 years instead of 9, I'd wonder if you were my sibling. Lol.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I moved to another state to avoid my dad. \nI don’t hate him, I just don’t want to interact.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 306,
                  "content": "I like the future memories part, good one.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 645,
                      "content": "I grew up with a mother who I now keep a healthy distance from as an adult, and who always denies the kind-of fucked up things she did or said when I was a kid. Now that I'm an adult, she'll also try to impress me, which just makes me feel worse. I just always find myself thinking: did she not realize I would remember my childhood? Did she not understand that, just because she had 100% control over me at the time, she wouldn't always, and I would have access to my memories forever? If she cares about impressing me now, why didn't she care about building a good, healthy relationship with me when I was younger so I would have a good impression of her as an adult?",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 235,
                  "content": "Agreed 100% that this is the kind of thing that breeds resentment later \n\n\"When I was in my late teens I asked my parents if I could have a lock put on my door for \\[variety of reasonable reasons\\] and my father refused because it was 'his house'\" doesn't look so good",
                  "id": 35,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Yep that’s me. My father didn’t even like me to close my door and because I closed it a lot, too much for his liking, he removed the doorknob. I had to stick a sock in the hole for privacy. He is 75, I am 53 and I still resent him to this day. I had tried over the years to let bygones be bygones but when I started seeing him treat my kids the way he treated me I couldn’t do it anymore.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Thing is, she probably wouldn't even be able to pinpoint this incident as why she has a frosty relationship with her parent (not sure if this is mom or dad). The distance will happen, and if OP is like this with the door, they are probably doing other controlling things that disrespects their daughter's independence.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "We were not allowed to put anything on the walls of my room. No change of wallpaper/paint, wall art. The bedding was always picked out by my mother. \n\nShe said it would depreciate the value of the home. To which I always wondered, it would be pretty easy to slap some basic paint up if we decided to move. Furthermore, who other than myself, brother, parents, and possibly extended family would see my room (or my brother's; these rules applied to him too)? Nobody from Yankee magazine is coming to do a story on my mother's eclectic taste in furnishings, so why disallow our creativity with our bedrooms? \n\nIt felt like a poor judgement call about what things are really important in life.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Side note: your name is fantastic.",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "It breeds lots of resentment right now.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "The way my mother treated me at 16 led to me, currently at 24, never calling her, never visiting her, moving to a new continent and completely shutting her out. She doesn’t know anything about my life and I cut off people who go behind my back and tell her anyway.\n\nMy story with her is on the extreme side, but keep this in mind; I wasn’t any more mature the day after my 18th birthday than I was the day before. I was just legally allowed to never answer the phone again when she called. \n\nMaturity is a thing that develops slowly, but develops faster when integrated with the loving support, respect, and consideration of your parents. She might not have the life experiences to quickly and efficiently get what she wants, or articulate her goals, or even be 100% certain of her goals- but neither have/are your average 19 year old. I changed my college major at 22, a semester before graduation. I wish my mom or dad had been a sane resource I could have trusted and gone to asking for advice, but I had to balance that against their likelihood of being controlling, dismissive, and straight up mean. At 24, I fight with my father because I haven’t told him I’ve gone into a field paralleling his. When he found out from a friend, he resented that I hadn’t told him. I told him that the few times I mentioned my interest in that field, he mocked and dismissed me out of hand as “not being sure enough”- so it hadn’t been a priority to let him know when I started planning my transition, as I already knew his position. He said he could have helped me; \n\nI said I knew he wouldn’t have, and I didn’t need another obstacle to get around.\n\nShe’ll remember whether you were loving, supportive, focused on giving her increasing freedom at the same time as increased responsibility, and kind, for the rest of her life. Make sure you take that into consideration.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Second this. I am the 22 year old daughter that won't let my mom's controlling behavior anywhere near my kids.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "My mom read my diary and threw it on the table in front of me to call out my lie about kissing my then boyfriend when I was 17 (gasp). My diary was incredible therapeutic for me, and I haven't written in one since. \n\nShe'd also barge into my room at 2/3 a.m. to prove I was trying to sneak out. So that was always terrifying to wake up to. \n\nOP: you probably don't intend to come off super controlling but that's definitely how it feels to a 16 year old.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "This OP. I keep an entire country between me and my mother. Beware.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Definitely this. The way my mom treats me (I’m 16) is really starting to drive a wedge between us. She is so controlling that she tried her hardest to stop me from getting in to my dream university so that I’d stay with her forever (I’d like to add that our family is very well off and my dad put together a savings fund that will cover my entire tuition, so money isn’t the issue) Luckily though, I got early acceptance and I managed to make enough money working to pay for the registration fee. I’m happy to report that in a year, I’ll be 500km away from her with my boyfriend and my best friend. I’m looking forward to never coming back",
                  "id": 45,
                  "comments": [
                    {
                      "score": 8,
                      "content": "That’s disturbing. Is that fund somewhere your mother can’t touch? If she can get her hands on it, no doubt she’d grab control of it and use it as leverage.\n\nEDIT:  Also, congrats on getting in!",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Also, does OP really want to walk in on his daughter masturbating? I had a lock on my door and could lock it whenever. Only time I couldn't was when I had guy friends over.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1046,
              "content": "[deleted]",
              "id": 48,
              "comments": [
                {
                  "score": 234,
                  "content": "Seriously, she's 16, of course she has secrets and that's part of growing up. OP allow your daughter to become an adult under your wing because she won't grow towards you if she's under your thumb. YTA.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 50,
                      "content": "Remember getting a posh diary for Xmas age 14. I kept it for 6 months. Until the day my parents broke the lock and started quizzing me on the entries - which were innocent and innocuous. Never kept a diary since.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Yeah especially when her brother is being an asshole by barging in on her. \n\nIf she’s asking for a lock it’s because her verbal requests for respect of her privacy from her are being ignored. \n\nOPs silence on that part is deafening.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "It's also super infantilizing of her to do to her daughter, I wouldn't be surprised if she was employing other emotional abusive and controlling tactics on her poor daughter",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Yeah, what a huge red flag. \"My 16 year old doesn't understand what a lock is.\" \"I can't fathom why a near-adult would want privacy or personal space.\" Spare me and stop infantilizing your daughter.",
                  "id": 53,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "My parents never let me lock my door when i was a kid. They always said \"we are a family and that means not locking each other out\" They respected my privacy as a teenager, however now my mom doesn't knock when coming into my room when I visit. OP sees his little baby girl not the 16 year old young woman she is. She has agency and a brain in her head and she knows full well what shes asking for. Not respecting your children's boundaries can cause a lot of resentment and the development of bad sneaky habits. My parents still (I'm well into my 20s) use the \"you're young, mom knows best\" routine on me and it can be so hard to say no especially if you respect and look up to them.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Yeah, OP is talking like she’s barely two and just learned object permanence.",
                  "id": 55,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 670,
              "content": "Can't trust 16 year olds with a lock.\n\nGive 16 year olds keys to a car.",
              "id": 56,
              "comments": [
                {
                  "score": 211,
                  "content": "As long as the car also has no locks",
                  "id": 57,
                  "comments": [
                    {
                      "score": 167,
                      "content": "“How many times did I tell you we needed locking mechanisms on the vehicle doors‽”\n\n– Robert Muldoon, *Jurassic Park*",
                      "id": 58,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "Hijacking your comment with hopes this doesn’t get lost, and to chime in with a similar POV.\n\nThis will probably get lost in the thousand+ comments but you are undoubtedly unequivocally the asshole. YTA, OP. \n\nAs many others have said if you don’t give her space and safety in her own home, she’ll pursue whatever she wants to outside as well. I remember being 14 and my parents being crazy about locked doors. We just had to leave them ajar otherwise they WILL come in and look. Which can be VERY uncomfortable, especially with milking the wood and all.\n\nI asserted my right to privacy in my teen angst and through an absolute madlad power move, by masturbating with the door ajar and almost closed. Naturally my mother walks in, freaks out, and walks back out. I know she will expect me to make myself decent and promptly walk back in to give me a talking, so I keep masturbating until she returns, freaks out again, and walks out - closing the door this time.\n\nIt ended with my dad giving me the talk about how I should lock my door (even though they get had a problem with it initially) and with months of awkward conversation with my mother. I completely blame them and feel I needed to go through that to get my personal space.\n\nSave yourself and your daughter the same embarrassment. She’s a grown up who needs space - give her that. Thank you and goodbye.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "yeah, how about fix the son's barging in",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1349,
          "content": "I disagreed until OP said the bit about \"it's my house.\"\n\nAnd what, it's your privacy? Kids get a lot of shit for saying \"I'm basically an adult now\" but a lot of the times they fucking are and they say that because they're getting treated like they're 12 - old enough to walk, talk, and eat but not make their own decisions.\n\nThis leads to two things. First, resentment. My own mother basically admitted to me she started seeing me as an adult after my first year in college. This led to a lot of arguing and fighting in the years leading up to that moment, and now I'm minimal contact with her. Second, underdevelopment. Just because they're your children forever doesn't mean they're kids forever. Treating them as such sets them up to be flung into the \"real\" world severely lacking in personal and interpersonal skills like self-discipline and conflict resolution.\n\nYour kid deserves privacy on the grounds of she's a human, same as you and me. It's one of the more basic human needs. If you need the ability to barge in on her to ensure she isn't keeping secrets, you have deeper issues to figure out than whether your property rights trump her human needs.",
          "id": 61,
          "comments": [
            {
              "score": 393,
              "content": "> My own mother basically admitted to me she started seeing me as an adult after my first year in college.\n\nLucky you! My mother didn't regard me as an adult until I retired and bought her a car. Now, she'll let my little lapses in the use of vulgar language slide from time to time. FFS.",
              "id": 62,
              "comments": [
                {
                  "score": 344,
                  "content": "My mother tried that as recently as when I was 33. So I took away granddaughter visits until she began interacting with me like an adult and recognizing my authority as the parent of my children. She was also undermining me like fucking mad by reversing decisions I had made whenever my daughter was with her.\n\nNope.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 50,
                      "content": "My mother-in-law basically doesn't take anything my wife says serious.  She'll question or ignore all of it.  So we've gotten to the point where I basically have to make all the declarations and statements.  We don't know if it's because she's so old school she doesn't take women seriously (her family was super patriarchal) or if she keeps viewing her daughter as a child, or both.\n\nWe've basically have to plan ahead to know if I need to be present for something to get her to do stuff and it's super frustrating because she should just listen to her fucking daughter!",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "Yup yup yup. All this. Had the exact same experience.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "\"But...but... I've got more *experience* raising children than you do! I know what's best for my grandkids because you don't know what you're doing!\"\n\n\"Look, I'm only trying to *hellllp*!\"\n\n/r/raisedbynarcissists/",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Yeah my DH and I are late twenties, home owners with a child. MIL still refers to us as the \"kids\" and also enters our bedroom when she stays without knocking because \"well DH is my kid, it's nothing I haven't seen before\". One day just walks in on me while I am in the shirtless, attempting to breastfeed, engorged newborn stage and I flipped and it is, \"well I am practically your mother anyway\". \nRegularly interferes anytime a financial decision has to be made (we are very sensible). Demanded we give her our household income so she could come up with a budget for us. Sends us jobs/events/things she thinks we should be doing. \nNow wants to retire, move in with us and have us support her while she is our housekeeper/nanny (fucking no). \nBasically DH does not confide in or generally gel well with her and tells her the bare minimum he has to because she is too overly involved and he also moved out ASAP because of lack of life privacy.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "It's so sad to me when people have to do this in order to get their parents to act right. A lot of the time it's the only way to get them to do right though.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I hope and wish you told her things like, 'you're not mature enough to babysit your granddaughter, I'll let you have alone time with her once you're a little older' that would be the only thing to make this even better <3",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 228,
                  "content": "I'm 45 fucking years old, and my mother still treats me like a child. Absolute insanity.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 105,
                      "content": "Great, thanks. 28 and I was hoping my mom would stop soon. Fuck.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I'm 48 and I'm treated like a petulant child. I really don't know why I didn't cut her out of my life. And she never respected my privacy. Not even when I was using the bathrooms. She'd unlock and barge in. I'll ALWAYS resent her.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 123,
              "content": "[deleted]",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "As a mom it is unbelievably difficult to make the transition in your mind from little kid to adult kid. It’s so bittersweet. I remember how exhilarating it was to drive away from the house with my parents in the rear view mirror. I want my guys to have that. At the same time I see two little faces looking at me asking me if they can go play in the park, and my heart breaks a little. But... that is what is supposed to happen! As parents my husband and I have given them the tools and resources to set them up for success. They are 18 now and we are merely guides on their journey. I pop in little bits of motherly advice here and there when asked, but it is a battle in my brain every day.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1326,
          "content": "If he needs to snoop so bad he can always knock the door and yell “Hey daughter, I respect your privacy by knocking on the door, but I assert my authority as your dad by entering anyway” and proceed to take down the door with a battering ram",
          "id": 75,
          "comments": [
            {
              "score": 161,
              "content": "Ow man, i know i have top comment but this should really be up there under mine. Love it, have my upvote!",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 120,
              "content": "Timmy's dad is the best character in that show honestly",
              "id": 77,
              "comments": [
                {
                  "score": 21,
                  "content": "D i n k l e b r u g 😡",
                  "id": 78,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 873,
          "content": "Yep, have fun walking in on your daughter masturbating or something.",
          "id": 79,
          "comments": [
            {
              "score": 770,
              "content": "Happened to me several times, my dad can be an intrusive, controlling bastard at times. \n\nFirst time his reaction was volatile and violent  ‘You filthy fucking girl! How dare you! FILTHY FILTHY GIRL!! ’ and went to slap me out of the chair I was sitting in before he snapped out of it and stopped just short. And then just didn’t speak to me for days. Iced me out like a mean girl.\n\nSecond time he walked in on me he mocked me mercilessly-like went to my family in the lounge room and physically imitated me.\n\nJesus, the more time I spend on reddit, the more I realised how fucked some of my personal experiences have been.\n\nEdit-woah to the volume of comments. Yes, sadly it is my real life experience and it’s just the tip of the weird iceberg.  \n\nThough if you asked me, I’d still characterise my childhood as happy. It’s only in realising how fucked up it was that I realise how our family dynamic was distorted around our parents constantly competing, arguing and power tripping.\n\nAs for violating my dad’s privacy, retaliating and playing dirty has never worked with them because I *really*!don’t enjoy their tactics and also I usually just get name called, etc for being vulgar, rude, etc etc. \n\nAdditionally, my folks were near to nudists when we were young so there was no shaming to be had.  \n\nAnd yeah, my brother was and is treated completely differently as the golden child. \n\nI have definitely discovered the concept of narcissists (thank you for the suggestion 🙂) after some therapy for an unrelated traumatic event.\n\nStrangely, getting some outside perspective from that therapist was really beneficial so that’s kind of the silver lining of the trauma imo.\n\nAnd yes on the Stockholm thing. Every time I think I’m out, they pull me back in. It has so deeply impacted my perceptions of everything. Just when I think I’m done working through something, I realise there is more faulty thinking to address. I’ll get there.\n\nTLDR infantilising your child whilst discounting and violating their personal boundaries 1) leads nowhere good for your child and 2) means you have some bigger issues you need to work on to parent in a responsible and compassionate way. \n\nListen up your daughter OP.  If she cannot expect and rely on *her father* to respect her agency, why would she expect any other man in the world to?",
              "id": 80,
              "comments": [
                {
                  "score": 268,
                  "content": "Holy crap. I'm sorry you've had to deal with that!",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 226,
                  "content": "Your father is an asshole.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 236,
                      "content": "An asshole? He's a monster. \n\n>he mocked me mercilessly-like went to my family in the lounge room and physically imitated me.\n\nthis kind of shit leaves people with scars forever",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 200,
                  "content": "Holy shit that's straight abuse wtf, get out of that house",
                  "id": 84,
                  "comments": [
                    {
                      "score": 27,
                      "content": "You get Stockholm Syndrome from a family like that, and it fucks up all future relationships. Speaking from experience. Your old age will be spent with thoughts wishing you'd bailed on that crazy family completely.",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "I'm so sorry you had to go through that. I wonder if your dad and my mom are long lost siblings.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Hah! Noooooo thankfully. \nAlthough dad did grow up really poor in a single room with his younger brothers and parents so he never had privacy himself and almost certainly was in the same room when his folks were sexual. \n\nThe really odd thing was all the hypocrisy. They were hypersexual with each other but I was supposed to be an entirely non sexual entity and was shamed when people found me attractive. I guess that’s pretty much the way his dad viewed him. \nHmm, a lot of head scratching thoughts today.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "[deleted]",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 21,
                  "content": "Not as volatile a reaction, but I did get spanked with a leather belt after getting caught. \n\nBefore my husband and I knew the gender of our kid, I sat him down and explained how I felt if we had a daughter since he didn’t fully know what puberty feels like for girls. Luckily, he’s awesome and totally got it. It sucks that it’s just a cultural norm that teen boys are just gross but girls are supposed to be asexual angels until adulthood or even marriage.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "You. are. not! filthy.    \n\nYou are a human being with natural needs and feelings.   \n\nYou are not filthy.   \n\nPlease know that.    \n\nI'm sitting here at a diner, trying not to full-on ugly cry, after reading your comment. I'm gonna be a new dad soon and this just breaks my fucking heart. I can't even imagine.   \n\nYou are a normal, intelligent human being. I really hope you know that. It was not your fault. You are NOT filthy!",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Insane bastard.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Holy crap. Yes that is totally messed up. Thank you for posting this.  I’m going to talk to my daughter about privacy/ ok to masturbate right now and give her a door lock.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "holy fuck that reminds me of when I brought my friend over and my dad was drunk outside in the front with his friend and while we tried to pass them my dad started making weird sexual comments about us and acting out them out.\n\n“oh look, geoffersonstarship, brought her friend over. probably for a sleepover and get all up on each other to make out and be all hot” and he proceeded to then make out and rub “the body” of the air\n\nI stared at him in horror and he just continued, but he was mainly talking to his friend about it (who was actually one of my old classmates so made it 1000x worse). I was... maybe 20 at the time that happened.\n\ngod, I hate him. I try to have a relationship with him though and when I try to bring up the fucked up shit he did he denies it.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "What the fuck...",
                  "id": 94,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Thank you for saying this. Have considered that maybe a 16 year old wants to masturbate without her brother running in on her???",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 697,
          "content": "I think OP is also an asshole for not putting a stop to the son's behavior and also allowing disrespect towards women by allowing that kind of behavior.",
          "id": 96,
          "comments": [
            {
              "score": 382,
              "content": "Exactly this! OP has fostered an unbalanced power dynamic in the house where the son is allowed to do whatever he wants at the daughter's expense. He doesn't question why his son is pushing the boundaries of her comfort, instead putting blame on his daughter for being secretive for something as simple as wanting a modicum of privacy in her own home.",
              "id": 97,
              "comments": [
                {
                  "score": 87,
                  "content": "Based on the \"it's my house\" comment I'd say op is gender biased and doesn't realize it.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Can we say toxic masculinity",
                      "id": 99,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "Dude yeah, highcharity has a great point.  As the girl child I was constantly being told that my basic needs were provided for only at the whim of my mother, who owed me nothing, and it (housing and food) could and would stop at anytime if she didn’t feel like I was earning it right or appreciative enough.  She was definitely also shitty to my brother in different ways, but from birth she like, respected him and felt responsible to him.   She was always saying shit like “you have rules that your brother didn’t have because you are far worse behaved!” But with the perspective and memories of someone 32 now, fucking horse shit mom.  I was just kept in a WAY smaller cage then him so I was constantly in hot water for crap that wouldn’t have ever been scrutinized for him. It’s funny because my parents both consider themselves really progressive but they’re far more sexist than they realize.  Like, really pretty conservative actually 😹",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 282,
          "content": "Absolutely, but OP must make sure the lock can be unlocked from the outside EVEN IF the other key is in the lock on the inside, without needing to push the inside key out of the lock. If said inside key is turned, it would be impossible to push out.\n\nGods that's a mess of a sentence. Does it make sense",
          "id": 101,
          "comments": [
            {
              "score": 485,
              "content": "Dunno where you are from but most bedroom door locks are not 2 key deadbolts. Most are non keyed inside locking and can be unlocked from the outside with a flathead screwdriver, a coin, or even a fingernail.",
              "id": 102,
              "comments": [
                {
                  "score": 80,
                  "content": "Wouldn't that lock be kind of redundant since the brother can still barge in by just unlocking the door with whatever's on hand? The locks I have are similar but you need a key to open it from the outside",
                  "id": 103,
                  "comments": [
                    {
                      "score": 240,
                      "content": "[deleted]",
                      "id": 104,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 186,
                      "content": "It takes a kid a surprisingly long time to figure out how to defeat a keyless bedroom lock in my experience.",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 107,
                      "content": "[deleted]",
                      "id": 106,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "In that case, the brother barging in takes conscious effort. He can't claim he forgot if he needs to actively unlock the door. And then he needs to face consequences for deliberately invading his sister's privacy.\n\nBut in an emergency, it is still possible for someone to get in the room.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 151,
          "content": "The only acceptable alternative here is to start seriously enforcing that no one enters their bedrooms without knocking and waiting for permission to enter.",
          "id": 108,
          "comments": [
            {
              "score": 18,
              "content": "Yeah. They have to do one or the other or it's just not fair to their children.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Reading this shit makes me so grateful for my parents.  I shared a room, and everyone knew to knock before entering regardless.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 97,
          "content": "This, especially don't do the \"well I needed to fill a whole load of laundry so I unlocked your door and dug through all of your drawers, under your matress, and inside your book case.\"",
          "id": 111,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "Totally agree. It's gonna happen anyway, so where would you rather it be, in your house, or outside and totally out of your control.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 22795,
      "content": "YTA lol. Let her fap without having to worry about anyone coming in\n\nEdit: Holy shit this blew up. Thanks for the silver and gold <3",
      "id": 113,
      "comments": [
        {
          "score": 13005,
          "content": "This needs to be top comment.\n\nOthers have said this is insensitive to say to her dad, but honestly grab a cup of concrete and harden the fuck up.\n\nThe girl is at the age where she needs to have the privacy to explore her body if she wishes. Or would you rather she finds out what she likes at the hands of Johnny down the road instead of herself in a safe space?\n\nEdit : Wow my first gold! Thanks a lot, had no idea people would like this so much!",
          "id": 114,
          "comments": [
            {
              "score": 1581,
              "content": "You own dude",
              "id": 115,
              "comments": [
                {
                  "score": 70,
                  "content": "Or rent (if he/she is a millenial, we don’t know yet)",
                  "id": 116,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1424,
              "content": "‘It’s insensitive to say to her dad’ I reckon he’d prefer the heads up rather than walking in without knocking and having to claw his own eyes out at some point...",
              "id": 117,
              "comments": [
                {
                  "score": 267,
                  "content": "Lol, I'm sure at this point it's happened. I don't think you'd want to claw your eyes out tho, raising kids kinda inures you against the weird shit youre bound to see.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 290,
                      "content": "I dunno, my mom flipped out when she found out I was writing gay porn in highschool. My dad was more along the lines of 'be safe' but my mom was pissed",
                      "id": 119,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "Yeah, it sounds like shes been walked in on and her dad just cant let go of his daughter.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1138,
              "content": ">Or would you rather she finds out what she likes at the hands of Johnny\n\nWow, so well stated!\n\nPeople are really saying there's something wrong with telling a parent their adolescent child is likely to masturbate?!\nThat's fucking stupid.\n\nWhat kind of assholes would not WANT their adult child to have a healthy sex life? I mean, I don't want to see it, or think about it in detail! But sexuality is a wonderful part of life. A part I wouldn't want my children to go without (again, once they're grown up of course!)",
              "id": 121,
              "comments": [
                {
                  "score": 811,
                  "content": "[deleted]",
                  "id": 122,
                  "comments": [
                    {
                      "score": 229,
                      "content": "This. My dad was very weird about me dating etc. Tried to keep me on a short leash. All it did was make me good at sneaking around.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "So many people don't.  \"That sounds so over the top that it can't possibly be very common.\"\n\nOh, but it is.  It really is.",
                      "id": 124,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 23,
                      "content": "Also happens north, east, west...\n\nMormons have a thing or two to teach old Baptists about shaming kids for being curious.",
                      "id": 125,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 172,
                  "content": "The kind who wear “D.A.D.D.” shirts and joke about polishing shotguns.",
                  "id": 126,
                  "comments": [
                    {
                      "score": 9,
                      "content": "> D.A.D.D.\n\nDo I want to ask?",
                      "id": 127,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 124,
                  "content": "The kind who doesn't even want their kid to have a lock on their door.",
                  "id": 128,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 394,
              "content": "Not even that, what if you just want to be undisturbed listening to music or napping without the fear of any pranking asshole waking you up.\n\nTeens are just smaller adults who need good guidance, not belittlement.",
              "id": 129,
              "comments": [
                {
                  "score": 26,
                  "content": ">Teens are just smaller adults who need good guidance, not belittlement\n\nI've never heard it put quite this way, but God almighty it's so true. Here's a gold from my fake money that I wish I made 🏅",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "honestly!! im 14 and not allowed my door closed cuz my dad feels the need to check on me in the night (its semi-necessary). I've been waiting to be allowed to, but it didnt happen, so I've been sleeping topless. it took one night for my dad to stop checking on me as i slept. like bro, just let your daughter do her thing that you dont wanna see, and she doesnt want you to see either",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Yep. I installed a lock on my door when I was a teenager. I didn't even ask. I didn't do it because I wanted to masturbate (though it certainly came in handy when I did), but because my father would always just burst into my room with no warning. I liked to read quietly or listen to music or just be undisturbed to sit with my thoughts and he'd fling open my door just to see what I was up to. It made me feel constantly on edge because I knew no matter what I was doing, at some point he'd come through the doorway like the damned Kool-Aid man. So I installed a lock, and I kept my door locked whenever I was in my bedroom regardless of what I was doing.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Or sleeping nude! That’s around the time that I started sleeping nude. So comfy. She’s two years away from being able to legally do whatever she wants. She NEEDS privacy and the security of that privacy  to explore her body. Wether it’s masturbating, or just using a mirror to have a look around. Both are very healthy, normal activities for a 16 year old girl.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 389,
              "content": "100% this. I had my dad walk in on me as a teenager with a hairbrush inside me....I can't tell you how traumatic that was as a young person trying to discover their body for the first time. I still cringe to this day.",
              "id": 134,
              "comments": [
                {
                  "score": 238,
                  "content": "Now you’ve made the rest of us cringe.",
                  "id": 135,
                  "comments": [
                    {
                      "score": 220,
                      "content": "I live to disappoint",
                      "id": 136,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 47,
                  "content": "This user has moved their online activity to the threadiverse/fediverse and will not respond to comments or DMs after 7/1/2023. Please see kbin.social or lemmy.world for more information on the decentralized ad-free alternative to reddit built by the users, for the users, to keep corporations and greed away from our social media.",
                  "id": 137,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 31,
                  "content": "You poor thing. That’s traumatic indeed. :(",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "I feel your pain, my dad found a home made \"toy\" of mine, and confronted me about it HOLDING it, made me take it from him so he could watch me throw it away. I was 15. I was mortified. As you can probably guess, we have NEVER been close. I still feel nauseous remembering it.",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "The cringing was primarily the discovery that people usually use the handle of the hairbrush and not the bristled end",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yeah. I donno know I am going to deal with this when my daughter gets older.I mean, I am ok with this... but when my daughter gets to this age, I would rather she did it with something safe and clean, and not any of the strange shit that can get stuck, hurt or poison her. It seems like a much harder conversation than the whole \"I dont care if you beat it, but dont jackoff and keep wiping it in the same place\" conversation with the boy.  \nalso he needs the  \"your bed makes noise when shaking, move it from the wall\" one, but I am not there yet.",
                  "id": 141,
                  "comments": [
                    {
                      "score": 20,
                      "content": "I actually had to get something surgically removed, after taking a long ass time waiting to get up the courage of admitting I needed help and trying many times to remove it myself. If I hadn't admitted it I actually would have died at one point from what I put up there. Get your daughter something or give her some money for online shopping or a gift card to somewhere that can be used online. If she thinks it's creepy mention my story. Cause it is creepy without the backstory of why you are giving your daughter an adult item. Or have mom (or mom figure) do it if you aren't mom. Slightly less creepy.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "That's rough. Thanksgiving and the holidays must be the worst if that memory comes up.",
                  "id": 143,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Thankfully I haven't thought of it in a long time, and I've done enough other dumb shit that it's probably low on the list for him too at this point",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 275,
              "content": "> grab a cup of concrete and harden the fuck up\n\nI have never heard this, and I don't know if you just made it up but I'm totally stealing it",
              "id": 145,
              "comments": [
                {
                  "score": 32,
                  "content": "Yeah, it's great *and* gender neutral! I'm stealing it for sure.",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 756,
          "content": "Especially since he doesn't knock and her brother walks on it whenever he wants. \n\nNone of the bedrooms in our house have locks. I always figured we would put them in whenever the kids asked but they never did. My son rarely is ever in his room. He has friends over a lot and they usually hang out in the backyard, family room, or the bonus room. On the rare occasion he is in his room other than to sleep the door is almost always open. If it isn't, which does happen sometimes now that he's 14, I knock. My daughter spends more time in her room and I always knock before entering. She is normally just building something with Lego or watching YouTube but I still always knock. My kids are close but my son would never just walk in on his sister without knocking. There is too much of a risk on walking in on something you don't want to see with teenagers. If my kids wanted a lock I wouldn't have a problem with it but they probably don't see the need for one because we respect their space.",
          "id": 147,
          "comments": [
            {
              "score": 25,
              "content": "I've noted that no lock households go one of two ways: 1) super well mannered kids that are very polite or 2) the no boundaries family (possibly also controlling). \n\nI agree that the request is being fueled because her space is not being respected. Respected children (by parents and siblings) may not feel the need for a lock.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I wish there was knocking in my house. Everyone just straight up barges in on me and I know someday I’ll get caught beating off and have an extremely awkward moment but I know if I ask for people to knock my parents will try to start trying to have a conversation about “wHy dO yOu NeEd uS tO kNoCk?”.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "This is exactly how my parents raised us. It always felt like I could ask for a lock but me and my sister never had too. If the door was closed you knocked and waited for an answer, or you’d wait a minute and if you didn’t get an answer you knock again, then quietly peek in to see if we were sleeping. \n\nAnd do I really believe my parents raised me right.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 717,
          "content": "ikr - she's going to do it anyway, just give her *and you* the peace of mind to know that you will never walk in on her. \n\nI have had a lock on my bedroom door since I was 11 (the lock already existed when we moved into the house) and I never abused the privilege because my family weren't rude assholes who burst into my room unannounced all the time.",
          "id": 151,
          "comments": [
            {
              "score": 183,
              "content": ">I never abused the privilege because\n\nRight! It is a privilege, and one that I would rescind if need be. \neven though he's only 11, I've told my son repeatedly that if you act responsibly, you will have freedoms.\nContinue to show me that you are trustworthy and I will trust you to make good decisions.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "God, the bursting in unannounced shit pisses me off. Especially if they sneak in to try and catch you doing something \"bad.\" Like, fuck, you'd hate it if the kids bursted in on you having sex, right? Why do you feel the need to do that to us?",
              "id": 153,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 438,
          "content": "YTA\n\n>Let her fap without having to worry\n\nRight. OP, are you okay with her masturbating? I hope you are not some religious nut who thinks it is sinful. if you have a healthy, rational outlook on sexuality, I hope you will realize it is perfectly healthy for masturbation to be a normal part of her life. Honestly, how could you not think of it?\n\nmy son hasn't yet hit puberty, but he's getting close to that age, and I've already started knocking before opening the door, and telling him to use the lock if he wants to make sure he has privacy. I have not explicitly said \"dude if you're going to jerk off, lock your door,\" but I'm pretty sure he gets the implication!",
          "id": 154,
          "comments": [
            {
              "score": 170,
              "content": "I wasn't going to *go there*, but isn't that another thing you wouldn't want your son barging in on?  I'm going to go with YTA, as some sort of control over when the door freely opens is a reasonable request from a teenage girl. She should get a latch at least. If you really need to bust down the door, they'll give way easy enough.",
              "id": 155,
              "comments": [
                {
                  "score": 18,
                  "content": "Oh god, the prospect of this happening gives me anxiety and I'm not even remotely close to the situation",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Maybe OP is less of the \"it's sinful!\" and more of the \"girls don't do that!\" type.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Why would she need to masturbate if she's getting married at 19 like most good Christian kids? \n\nSeriously, the number of \"waiting until marriage\" people I know that marry their highschool girlfriends just so they can fuck is too high.",
              "id": 158,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 123,
          "content": "[deleted]",
          "id": 159,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 24,
          "content": "Frankly I got the impression OP barges in on his daughter, and is averse to her having a lock, specifically to prevent her masturbating.",
          "id": 160,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "Oh god this reminds me of something I really did not want to remember. So my brother got into fiddling with himself way before I did and I hadn’t been taught the uh need to do those things and being raised jehovah witness, touching yourself was a no-no. So when I caught my brother doing that, of course I blabbed to mom he was doing “something bad “ I told her he was touching his private parts and my mom made me lay on the bed and act out what he was doing on myself (as best as I could since I’m a female and don’t have a penis) holy shit was that messed up!",
          "id": 161,
          "comments": [
            {
              "score": 14,
              "content": "Lmao why even",
              "id": 162,
              "comments": [
                {
                  "score": 10,
                  "content": "Apparently she didn’t believe me or is some sick freak that wanted to see her naked daughter (yeah she made me strip) act out masterbating. \n\nEventually my mom ghosted out of my life. She’s never seen my son and my daughter has no memory of her. It’s for the best.",
                  "id": 163,
                  "comments": [
                    {
                      "score": 10,
                      "content": ".... Wtf? I hope you got away from that.",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "Yep.. I think some people forget that’s girls masturbate.. idk how it’s widely accepted and even joked about the fact that boys masturbate but people don’t want to acknowledge that girls do it. She’s very much at an age where she wants to explore her body without her family barging in.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 12162,
      "content": "YTA and this is a massive part of the reason that I moved out of my parents house as soon as I could. I'm not being crude but your daughter needs her privacy, she could be doing anything in there, or changing clothes, and does not want anyone barging in on her. \n\nEspecially with a brother who barges in and probably roots through her things. I can assure you she wants that lock NOT because shes up to no good, but because she needs her space.\n\nThere is nothing more mentally depreciating than not being allowed privacy in your own home.\n\n\n-----‐ \n\n\n\n**EDIT** Thanks for the silver! I'm overwhelmed with all the comments on this from people who had a really shitty time with privacy growing up. I'm so sorry to hear a lot of your stories and super extreme sounding parents. I dont personally want kids myself, but I always think if I had them I would do so many things differently to how I was raised.",
      "id": 166,
      "comments": [
        {
          "score": 2497,
          "content": "Yes exactly! This made me so angry. I was never allowed to lock anything in my parents house, not even the bathroom door. Mostly because of my stepdad, he'd come in as soon as possible and take the key away. I hated them so much.\n\n\nShe's 16 OP, whether you like it or not she's pissed at you and everything and her mother \"sometimes\" forgetting to knock and her brother not even trying is not going to make it better.\nMaybe she doesn't want anyone to barge in and confront her when she's not in the mood to interact with anyone? Ever thought about that? She doesn't have to be available to you at all times. YTA",
          "id": 167,
          "comments": [
            {
              "score": 546,
              "content": "Shit man I didn't even have a door on my room growing up - I was young when we moved into the house, like 5, but as my brother tells it \\[10 years older\\] my dad went around and removed the doors from **all** of the kids bedrooms when we first moved in. Their room got a door and the room that would eventually become my sisters room got a door, though it was vacant at the time this all went down. Our upstairs was 2 bedrooms with just a hallway between and I remember my brother and I in the summers would put up a sheet to keep the AC in, eventually we started just keeping the sheet on full year round.",
              "id": 168,
              "comments": [
                {
                  "score": 367,
                  "content": "Ever tried to ask the logic behind that? No doors?? Or did you get the ol'reliable \"it's my house I pay the bills I do whatever I want\"",
                  "id": 169,
                  "comments": [
                    {
                      "score": 202,
                      "content": "Honestly as a kid it was just normal for me - I never really even thought too much about it until I was older. And I just dealt with it.",
                      "id": 170,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "My sister went through a very moody phase where she, among other things, slammed doors when she stomped off angry. \n\nMy dad told her if she slammed one of his doors one more time, she'd lose the privilege of having a door. Within a week she'd done it again, and my dad went to the garage, grabbed a screwdriver and had the door off the hinges and in storage within three minutes. It was gone for about two weeks, I think? My mom thought it was a bridge too far, and I'm guessing my dad agreed, but didn't want to back down from his threat that easily.",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Control. The idea that their kids could hold any kind of power over them, even just the power to stop them looking into their room when they walk by, makes these kinds of parents angry. It’s bordering abuse.",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Year without a door sharing a room with 2 younger sisters. If I had been a little younger, it would have been fine, but 13...well, I was hormonal to say the least. Very frustrated and constantly anxious about changing. Lived in that house 8 years, never got any privacy. Not allowed in the bathroom more than 5 minutes unless getting ready for school or bath time, people bursted in whenever they wanted, little kids around all the time...I feel for you.",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 520,
          "content": "I  left home as soon as I could also and this was one reason.  No privacy, no locks. You could be in the bathroom and someone always walked in. My siblings stole from each other all the time, clothes, toys, money. Nothing you owned was safe.  Now if I put something down, it's going to be in the same place when I go to look for it.",
          "id": 174,
          "comments": [
            {
              "score": 42,
              "content": ">Now if I put something down, it's going to be in the same place when I go to look for it.\n\nStill isn't true for me, but at least now if something goes missing I know the only thieving assholes in the house are cats.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 519,
          "content": "YTA so much. My parents were the same (they still kinda are when I visit) and it drove me crazy. Of course, they caught me masturbating but apparently didn't care. And every time I was changing clothes and my mom barged in and I started screaming, it was somehow my fault.  Because obviously, I want to start a fight and I don't want my mom to see me naked because I'm hiding something bad. That's the only possible reason.",
          "id": 176,
          "comments": [
            {
              "score": 388,
              "content": "I hated this so much, whenever I was changing and didn't want my mother to see me she would think I had done something wrong and would \"inspect me\" she thought she had the right to see me naked because I was her daughter, otherwise I could leave. And i left as soon as i was 18, went back to visit and she expected me to be comfortable with her watching me while I was taking a shower. Now we are no contact and it was the best decision I ever made.\n\n\n\nEdit: Her excuse was that I use to self harm or that I was hiding a hickie, still it had been a long time since I had harmed myself, I was no able to have secrets, i couldn't have secret diaries, password on my phone, she had to be by me if I wanted to use my Facebook account, she would look into every single notebook I had. I was also not allowed to shave or even go out. And still I got pregnant as a teen. And no she was not religious, my grandmother was like that with her. I also lived my teen years in Mexico, before that she was a normal mother.\n\nIt has been a hard year realizing that what she did to me was abuse, I moved out when I was 18 I'm currently 22 and went no contact 1 year ago when I got pregnant with my second child, I have kids to and can't imagine doing the same things to them. Now I have to fix my own traumas and the ones she did to my oldest daughter. Life is better now without her and being a whole country away from her.",
              "id": 177,
              "comments": [
                {
                  "score": 129,
                  "content": "Jesus fucking christ. I thought I had it bad.",
                  "id": 178,
                  "comments": [
                    {
                      "score": 39,
                      "content": "you did have it bad. Others may have gone through some more stuff but don’t think that just because they did, that what happened with you is invalid",
                      "id": 179,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 116,
                  "content": "That is literally sexual abuse wether she meant it as such or not. I honestly do not know what to say to this. \n\nWith my sisters kids we encourage them to be open about their bodies and are comfortable being naked around them in situations like showering or changing, but I don’t go into any room they may be undressed without knocking and asking to come in. They always say yes but as soon as they start saying no we’ll respect their privacy.\n\nHell my sisters son doesn’t even like to be kissed and we respect that. I always ask him and he says no he doesn’t like it so I hug him instead!\n\nEdit: Also just for clarification, since someone’s calling me a pedo. I’m a woman and it’s mostly for my niece who’s 9 and her body image (not that gender should matter). She is completely comfortable with it and we often have to tell her to put clothes on cause she walks around the house naked. The boys are 5 and still think talking about their winkeys is the most hilarious thing in the world. \n\nGrowing up me and my sisters were embarrassed of our bodies cause our mum would shame us and be embarrassed herself. My sister decided she didn’t want that for her daughter. Her father doesn’t do it but that’s his decision cause he feels uncomfortable being nude around the kids.\n\nNot everyone’s a pedophile, grow up.",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "My mom also got intrusive if I tried to not be seen naked. Also, even into my adult years, would do things like pull up or down my shirt to see my bra, things like that. When I would protest, she'd say \"I made you, I can touch you any time I please\".",
                  "id": 181,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Oh god that’s horrible",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I shaved my privates once (before I discovered waxing) bc my hairs would poke through my bathing suit. I got out of the shower and my mom was standing there staring at me and said “ only sluts shave their pussies.” No joke.",
                  "id": 183,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Reply with \"So do you shave with or against the grain?\"",
                      "id": 184,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Yeah, best move. She either doesn't realize how inappropriate and frankly perverted that is - or she doesn't want you to realize. That's beyond helicopter parenting and into abuse territory.",
                  "id": 185,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 316,
          "content": "This 100%, I know brothers barging in and going through stuff is considered “boys will be boys” but I honestly had to bring that shit up in therapy. Imagine going through puberty knowing your brother can freely walk in any moment, no matter what you are doing, and that he’s doing this with the intention of bullying you for his own amusement. Parents need to teach their kids boundaries and that includes giving the the option to lock their siblings out of their room. Otherwise their own home and bedroom won’t even feel like a safe space.",
          "id": 186,
          "comments": [
            {
              "score": 42,
              "content": "> Imagine going through puberty knowing your brother can freely walk in any moment, no matter what you are doing, and that he’s doing this with the intention of bullying you for his own amusement.\n\nI'm so sorry. I read this and was horrified and heartbroken. I hope all is well now.",
              "id": 187,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "Jesus christ why are people so incompetent. Like if my son did that to my daughter even twice i'd be livid and punished severely",
              "id": 188,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 137,
          "content": "I'm still living with my parents and siblings, and they have refused to let me have a lock (even though everyone else has one).\n\nI've resorted to a chest of drawers Infront of the door as I'm pretty skinny, and when in the right place, I'm the only one who can slip through the gap.\n\nIt honestly is terrible not having a lock, and I'm constantly having people barge in for no reason.",
          "id": 189,
          "comments": [
            {
              "score": 39,
              "content": "If you want a little easier solution try 4-8 rubber stoppers under the door when your inside, its more or less impossible to force open without damaging the door",
              "id": 190,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I can't think of a single reason that could be behind this that wouldn't be incredibly depressing. I hope you get out soon.",
              "id": 191,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 117,
          "content": "Ugh. My parents punished me for slamming my door(which yes, I know, asshole move on my end), by physically removing my door for like 6 months. Fucking awful. Parents reading this, NEVER EVER do this. Seriously.",
          "id": 192,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 105,
          "content": "Yeah, same for me. I remember growing up without a lock. I always \"had my own room\" until my father wanted to argue. At that point I was \"under his roof\". Meaning: If he wants to continue to argue with me he could follow me through the whole apartment and I couldnt go anywhere for my mental peace.\n\n\"You are right. I am sorry.\" and going to my room. I usually counted the minutes until he follows and starts to argue about the same crap again. It was fucking exhausting to have no room just for myself.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "YTA, I'm 22 and whenever I'm in my parents' home, I'm still not given this privacy, my parents mock me when I ask for it. It feels suffocating and especially because there are triggers around, which makes me anxious to be around all of them all the fucking time. It's not even like I want to do anything in particular, but we need some space to ourselves.",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "If she had a lock he would 100% SUCCEED in not walking in on her or forgetting to knock, because he would be forced to.\n\nI can't imagine having been 16 an not having had a lock on my door, I would have been mortified. Having to change quickly and never allowed to just hang around naked without thinking someone is gonna burst in would have stressed me OUT.",
          "id": 195,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Wife had brothers that constantly ate her food, used her toiletries (deodorant, toothbrush) and had zero privacy in her home and basically could not have \"alone time\" without someone deciding they needed to come in to have a conversation at literally any time. It was to the point she felt she needed to \"trap\" her room so she would know when someone's been in there while she was gone (think piece of paper trapped in the door that would fall when opened). This absolutely caused issues as an adult later on down the line.  \n\n\nI'm not saying a lock is the answer, and most indoor locking doorknobs come with an easy to defeat mechanism by use of a pin or coin that a brother may not be deterred by, but ultimately privacy = respect and if only as a reminder to think twice before entering without knocking, or making sure you have consent to enter will mean the world, and if a lock is the only way you and brother can be taught to give that respect then so be it.",
          "id": 196,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 11555,
      "content": ">doesn't really know what she's asking for\n\nShe wants a lock on her door. That is what she is asking for.\n\nYTA",
      "id": 197,
      "comments": [
        {
          "score": 3782,
          "content": "Yeah this bit also struck me as weird..  Yes she knows exactly what she’s asking for: privacy.",
          "id": 198,
          "comments": [
            {
              "score": 2028,
              "content": "ah, but with great privacy comes great responsibility! \n\nis she even capable of dealing with the pressure involved with... not being walked in on by her brother? \n\n&#x200B;\n\nOP is weird af, she's asking for a lock on her door not a car jfc",
              "id": 199,
              "comments": [
                {
                  "score": 479,
                  "content": "Who's gonna feed the lock, clean up after it, take it out for walks?",
                  "id": 200,
                  "comments": [
                    {
                      "score": 314,
                      "content": "what if, god forbid, the lock gets sick? can she afford to pay for the trip to the locksmith? *didn't think of that did you, OP's daughter.*",
                      "id": 201,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 400,
                  "content": "deleted  ^^^^^^^^^^^^^^^^0.8496  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/64673)",
                  "id": 202,
                  "comments": [
                    {
                      "score": 100,
                      "content": "[removed]",
                      "id": 203,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "*what if she hides a meth lab from me and gets our family mixed up with a cartel?*",
                      "id": 204,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": "She's asking him to admit he doesn't own everything in the house including his children, and that's currently well beyond his capabilities.\nEdit: thanks for the silver!",
              "id": 205,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "OP in a few weeks: \"Just decided to remove all the doors in the house so nobody gets locks! AITA?\"",
              "id": 206,
              "comments": [
                {
                  "score": 10,
                  "content": "He said in a comment that the only lock is in the bathroom he uses (I assume ensuite) and that even the bathroom his daughter uses doesn't have a lock. This guy is a controlling hypocrite.",
                  "id": 207,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 917,
          "content": "Yeah, this is just the weirdest shit. OP is not only TA, but fucking weird. Who needs to be under constant surveillance of their 16 year old? She’s very close to being an adult, would you want your parents still having total access to your house/room/zero privacy whatsoever? No? Then quit being a fucking asshole.",
          "id": 208,
          "comments": [
            {
              "score": 267,
              "content": "I bet OP will make her put a GPS tracker app on her phone when she turns 18 and moves out.",
              "id": 209,
              "comments": [
                {
                  "score": 44,
                  "content": "I keep telling my dad he can do that if he pays my phone bill. Well, begging really\n\nEven when I was a teen, 99% of the time I was exactly where I said I was....doing drugs",
                  "id": 210,
                  "comments": [
                    {
                      "score": 36,
                      "content": "I was moved out and in my first year of college. I couldn't leave my own fucking apartment, that I paid for, anytime after 730-8pm without my mother blowing up my phone asking where the fuck I was going. I told her the grocery store because I had a long day of class, I'm fucking hangry, and literally had no time earlier to go food shopping. She didn't believe me, even when she saw I was 3 blocks away AT THE GROCERY STORE. she was always like that, so I got fed up and started fucking with her. I told her things like, \"Oh hey, I gotta go my ride is here\" she woukd ask where, and I'd tell her to a friend's. She'd ask more, and I eventually told her it was a big white coup de ville /Cadillac with my older black guy friends who turned me on to weed. I said all of this heavily sarcastically and she never caught on it was a joke.",
                      "id": 211,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "My dad did that to me without my knowledge for years. I ended up choosing to be homeless for a while than deal with all the baggage that comes with a parent-child relationship like that.",
                  "id": 212,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 164,
              "content": "OPs post reads like something my very narcissistic mother would say. Did say actually, as I had the same argument as OPs daughter only in my case I was asking to be able to just close my bedroom door. My mother would also say she \"occasionally\" came into my room without knocking, which in reality meant frequently and at very inappropriate times.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "> Who needs to be under constant surveillance of their 16 year old?\n\nI very specifically want *not* that. Yeah, a 16 year old needs supervision and can get into some real trouble without it, but they also do a lot of other stuff that isn't bad but that I definitely don't want to know about.\n\nWas OP never 16? Are they the mythical being that every teenager thinks their parents are?",
              "id": 214,
              "comments": [
                {
                  "score": 9,
                  "content": "Also, if your 16 year old needs _constant_ supervision or surveillance, you gotta be asking yourself where you screwed up. By 16, kids should be pretty independent and just need guidance and high-level supervision for most things.",
                  "id": 215,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 609,
          "content": "\"She doesn't understand that this will diminish my control over the house, and make my peepee feel small.\"",
          "id": 216,
          "comments": [
            {
              "score": 376,
              "content": "To add to what you’re saying “because I know I’m about to lose control in 2 years I’m gonna be ultra controlling up to that point and then do shocked pikachu face when they no longer talk to me”",
              "id": 217,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 194,
          "content": "[deleted]",
          "id": 218,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 168,
          "content": "> I see no reason as to why she’d need a lock.\n\nOP is denser than a door",
          "id": 219,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 131,
          "content": "This line was so odd and jarring that it made me wonder if this was a troll post.",
          "id": 220,
          "comments": [
            {
              "score": 8,
              "content": "So did I! This is either one VERY dense motherfucker who can't comprehend a teenage girl's need for privacy, or a troll, so in either case, an asshole.",
              "id": 221,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 56,
          "content": "Seriously. She's 16, not 3.",
          "id": 222,
          "comments": [
            {
              "score": 14,
              "content": "My 3 year old wants a lock on his door because he likes the sound it makes when you push the lock button.  \n\nI think that's a perfectly valid reason.",
              "id": 223,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "I was wondering if anyone else caught that!",
          "id": 224,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 22,
          "content": "\"She's young and doesn't know what she's asking for\"\n\nShe's 16. You must have such little opinion of your daughter. At some point you need to trust that you raised your children well enough and trust them",
          "id": 225,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Yeah at 16 you know exactly what's going on, and you sure as hell know what a lock does lmao.\n\nI love my privacy, and when I had a lock on my door in uni it was a godsend. Just need uninterrupted space to so stuff? Lock the door. People try to come in but they know you locked the door, therefore they get the emssage that you need alone time for a while. Unlocked? Come right in.",
          "id": 226,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8220,
      "content": "\\>   I admit that I’ve forgotten to knock sometimes but other than that I see no reason as to why she’d need a lock. \n\n\\>   She says it’s to keep her brother out - who barges into her room every now and then to bother her \n\nYou're a bit dense. \n\n\\>  She’s young, and doesn’t really know what’s she’s asking for. \n\nAnd you think your child is an idiot. 16 year olds aren't as stupid as you think. \n\nYTA. You aren't legally required to give your daughter that much privacy but you're simply telling her that her privacy isn't important to you. And you think she's an idiot.",
      "id": 227,
      "comments": [
        {
          "score": 2385,
          "content": "I can almost guarantee that even when OP knocks, it’s one of those *knock knock OPEN* situations. Not waiting for a response, not making sure that they’re welcome, just giving a heads up that the door WILL be open in .3 seconds. My mother in law does this and it drives me up the wall. The amount of times she has walked in on her son being on top of me and between my legs is way more than the average person, yet she still continues to just walk in like the only thing we could possibly be doing behind a closed door is play monopoly. (Mind you we’ve been together for almost 4 years and are in our early twenties yet still no lock. His parents legit leave their door open 24/7 and so does his sister. Zero privacy for anyone ever. It’s a nightmare)\n\nETA: Since I’ve gotten a lot of replies telling me I need to move out and that I have problems since I live with his parents, I will clarify here. I do not live with them, this happens when I visit. I’m usually there for a few days up to a week when I’m there.",
          "id": 228,
          "comments": [
            {
              "score": 813,
              "content": "Start spraying her with a water bottle if she doesn't get the memo.",
              "id": 229,
              "comments": [
                {
                  "score": 470,
                  "content": "If she keeps walking in on them having sex, they may not need to water bottle to spray her.",
                  "id": 230,
                  "comments": [
                    {
                      "score": 40,
                      "content": "That made me laugh, thank you.",
                      "id": 231,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Honestly it’s a great method.",
                  "id": 232,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 416,
              "content": "My mother always did the two-handed approach; knock with 1 hand and open with the other. Why even bother?",
              "id": 233,
              "comments": [
                {
                  "score": 306,
                  "content": "It's the pretense if being polite. That way she can say \"why are you so mad.. I knocked\".",
                  "id": 234,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Urgh. I always had this too. Like wtf.",
                      "id": 235,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "\"I'm respecting your autonomy by knocking but asserting my authority as your parent by coming in anyway!\"",
                  "id": 236,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "At that point you're just asking to walk in on your kid strumming themself...",
                  "id": 237,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 293,
              "content": "Get a rubber doorstop wedge. You can't set it and leave the room like a lock, but it'll at least prevent anyone from being able to open the door while you are in there.\n\nEdit: left out a word",
              "id": 238,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 236,
              "content": "\"Timmy... I'm respecting your privacy by knocking, but asserting my authority as your father by coming in anyway.\"",
              "id": 239,
              "comments": [
                {
                  "score": 22,
                  "content": "This could only be the work of...",
                  "id": 240,
                  "comments": [
                    {
                      "score": 18,
                      "content": "FAIRIES!\n\n( - Crocker, Fairly OddParents )",
                      "id": 241,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Timmy's dad gave him more than enough time to hide the porn with that line. He was being a great dad.",
                  "id": 242,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "hahahaha i used to love that show and reading this now when im much older is hilarious",
                  "id": 243,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 43,
              "content": "Get a door stop!",
              "id": 244,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I may have read too much r/JUSTNOMIL but the fact that she continually walks in on you having sex is creeping me tf out.",
              "id": 245,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Do you live there or is this when you visit? I know not everyone can afford to live on their own but I would get out ASAP",
              "id": 246,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I’m respecting your privacy by knocking but asserting my authority as your parent by coming in anyway!",
              "id": 247,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 367,
          "content": "For some reason the forgetting to knock thing annoyed me the most. To me it’s pretty common courtesy to knock when you see a closed door, whether you’re in public or at home. No wonder the poor girl wants a lock, she’s got people barging into her room constantly which would be annoying as hell.",
          "id": 248,
          "comments": [
            {
              "score": 114,
              "content": "Yeah. my mother never learned to knock, used to piss me off no end. I'm the son. My dad would always knock. I now have a 16 year old daughter. She hasn't asked for a lock because if the doors closed I knock. Aaaaaand wait....then knock again for a salty \"Yes, what? Come in.",
              "id": 249,
              "comments": [
                {
                  "score": 41,
                  "content": "The most annoying part about knocking is that people don't always get that you wait for a response before just barging in.",
                  "id": 250,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Yeah, if you're just going to barge in there isn't much point in knocking. I always appreciated that my father would knock. I tried to explain it to my mother but nothing worked. Felt like a bug in jar till I left home.",
                      "id": 251,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Christ, I knock before going into my girlfriends home-office....in the house I own",
              "id": 252,
              "comments": [
                {
                  "score": 19,
                  "content": "It's just common sense honestly. It's not that you expect or want them to be doing something private all the time, you just want them to give them the space to do so for the times they do need to do something private. And it's just an indicator of human respect honestly.",
                  "id": 253,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 138,
          "content": "Lol, yes.  Your reply is perfect.",
          "id": 254,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 128,
          "content": "> 16 year olds aren’t as stupid as you think\n\nTrue. Yet at the same time they are stupider than you think. I call it quantum adolescence.",
          "id": 255,
          "comments": [
            {
              "score": 26,
              "content": "I kinda disagree about them being stupid. Its just that school is so far removed from the real world that they have no chance at understanding how to behave in it properly. I mean shit man, I cant believe I used to have to raise my hand and ask for permission to go for a piss, or get a bollocking because I'm wearing my coat indoors despite the fact that it's winter and the building's heating doesn't work.\n\nSchool prepares you for life... In the 1920s, not for the modern day.",
              "id": 256,
              "comments": [
                {
                  "score": 14,
                  "content": "They don’t even prepare you for life in the 1920s. More like a master/servant sexless relationship.",
                  "id": 257,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Adolescent brains are so high on hormones they are simultaneously Einstein smart in one field but dumb as a rock in others. For example, having enough brain power to learn a language during one summer but being stupid enough to not see that the dramatic cry womit wall of text you're going to post is really cringy and not a smart thing to do.",
              "id": 258,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "Everything in this reply is spot on.   \n\n\nAlso - happy cake day!",
          "id": 259,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Best reply here for the use of ’dense’",
          "id": 260,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4717,
      "content": "YTA\n\nShe's 16, old enough for privacy. Or would you prefer that her little brother finds her sex toys or that you walk in on her masturbating?",
      "id": 261,
      "comments": [
        {
          "score": 2015,
          "content": "It's not nice to think about your 16 year old daughter doing this OP, but this is the reality. Let. Her. Have. Her. Space.",
          "id": 262,
          "comments": [
            {
              "score": 604,
              "content": "It’s certainly not nice to think about, but if he doesn’t get her a lock and keeps ‘forgetting’ to knock, he may end up in a MUCH more uncomfortable situation for everyone involved",
              "id": 263,
              "comments": [
                {
                  "score": 25,
                  "content": "> a MUCH more uncomfortable situation for everyone involved\n\nyou mean like her being in trouble for having sex toys?",
                  "id": 264,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Well once when I was a teen my little brother (he was 5-6 probably) found my vibrator, and went to show it to our mother because he wanted to know why this bottle's so strange and what it's for. She had to come up with some explanation and I really do not envy her.",
                      "id": 265,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 250,
              "content": "[deleted]",
              "id": 266,
              "comments": [
                {
                  "score": 99,
                  "content": "I have a 14 year old son and it's DEFINITELY something I don't want to think about. I'm a veeeery careful knocker.",
                  "id": 267,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 29,
                  "content": "Right. My (f) brother and I used to share a room and my grandfather was devastated the boy didn’t have his own place. So he kept pushing for me to be with my sister 🙄 because a 15 year old girl doesn’t need privacy like a 10 year old boy would, right?",
                  "id": 268,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 473,
          "content": "Came here to say this. Yeah of course she's trying to hide something from you! Teens at that age need privacy. \n\nShe's not gonna go and tell you that she wants privacy 'cause she's rubbing one out every now and then, but I assure you that's big part of the reason. That's just a part of being a teen.\n\nYTA",
          "id": 269,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 334,
          "content": "My siblings found my vibrator and left it on the bed with a note telling me how disgusting I was. Ah, the joys of growing up in a conservative household.",
          "id": 270,
          "comments": [
            {
              "score": 123,
              "content": "Name checks out",
              "id": 271,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 47,
              "content": "My sister found mine and tossed it into the hallway in front of my parents. In glad my parents have a healthy view of sexuality and I ended up with a more secure lock, but if I had OPs parents I probably would have been shamed to oblivion.",
              "id": 272,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "That's shitty for so many reasons. Damn. Sorry you had to go through that.",
              "id": 273,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "My twin went through all my sex toys told my mom about them, I rehid them and she found them again and said I still have them, my mom just told me to hide them better. When we lived together at school she rummaged through my sex toys with her boyfriend then they both confronted me about why I had them. I dislike my twin a lot.",
          "id": 274,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "He’d rather his daughter stick it to jimmy down the block where they’d have privacy. \n\n1,000% YTA OP. Doesn’t matter if she wants to masturbate, nap, change clothes, lay on the ground face down, read a book - if she wants to do something in private or I disturbed, you should give her that right or let your daughter rip away that right from you.",
          "id": 275,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3505,
      "content": "YTA- you admit yourself you don’t knock and her brother goes in too, give her a lock. She might not even use it, but knowing she has the possibility of using it can make all the difference.",
      "id": 276,
      "comments": [
        {
          "score": 1392,
          "content": "If OP is like this about a silly lock situation I can’t imagine what kind of a helicopter parent they are on a daily basis. Yikes.",
          "id": 277,
          "comments": [
            {
              "score": 425,
              "content": "I can only imagine what liberties this girl lives without and thinks is normal or \"just how it is\" \n\nOr on the flip side she could be playing this whole system, sneaking out and getting better at it because of the helicopter parenting!",
              "id": 278,
              "comments": [
                {
                  "score": 100,
                  "content": "Shit I feel like if there’s anything I got good at because of helicopter parents it would be hiding shit from them and lying",
                  "id": 279,
                  "comments": [
                    {
                      "score": 19,
                      "content": "I got good at telling little white lies to cover up what I was doing. Nothing big, like saying I was with X instead of where I really was, with Y, or that I was going to the mall when I was really going to the zoo. \n\nI'm still having trouble getting rid of that. I'll embellish something here or there, or I'll just straight up lie about something. And I'm trying my hardest to get rid of it.",
                      "id": 280,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Yep. My parents weren't helicopter parents and it was great. It allowed to to get closer to my parents and I didn't have to lie to them. If I was stuck at a party and didn't want to drive with drunk drivers I would call my mom and she would pick me up.\n\nBeing a helicopter parent is going to cause your kid to get in more danger.",
                  "id": 281,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Sounds like my dad, who I avoid like the plague because he avoided my emotions like the plague growing up. You've got one chance to not fuck your daughter up for life, and all I see is that you are refusing to acknowledge anything other than \"I'm in charge I make the decisions\" right up until you aren't and can't.",
              "id": 282,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Honestly easy solution. She has a lock on the door, parents have a copy of the key. They can access room if needed (after knocking) or in emergency, and she gets privacy she wants.",
          "id": 283,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2699,
      "content": "YTA.\n\n1. She's a sixteen-year-old girl whose brother is barging in on her. That IS a reason. How the hell would you like it if a family member you didn't like - especially a male family member - got to barge in on you at random moments when you might be getting dressed or anything, and you had no right to stop her?\n\n2. Not old enough? She's 16! Who doesn't understand what a lock is at 16?\n\n3. Here's the hardest part... Yes, as your children get older they sometimes will have things that they don't want to talk about with you. That's a NORMAL part of growing up and differentiating yourselves from your parents. I was pretty much a model 16-year-old - working at school, well-behaved, wasn't even dating - and I *still* did not want to tell my parents everything about my life, and I certainly wanted my privacy! That is normal!\n\nIt sounds as though you're having a very hard time accepting that your daughter is growing up and starting to have parts of her life separate from yours. And that *is* difficult; I'm a parent and I also struggle with it. But, I repeat... this stage is *necessary*. \n\nA good parent will accept it and will work on maintaining a good relationship so that their child will feel comfortable talking to them about stuff going on in their lives. Those are the parents whose children are *more* likely to be able to talk to them. Some parents are too controlling to handle this stage well; they try to stop their children going through this normal part of growing up. Apart from this being a rotten way to treat someone, it also backfires; it means they have children who don't feel safe or comfortable talking to them when there's a problem, and who are more likely to keep secrets and get into trouble.\n\nSo, the choice is yours; which type of parent are you going to be?\n\n(Books I can recommend: 'Parenting Without Power Struggles' by Stiffelman, and 'How To Talk So Teens Will Listen And Listen So Teens Will Talk' by Faber and Mazlish.)",
      "id": 284,
      "comments": [
        {
          "score": 564,
          "content": "3 - so true. Too many people in the comments focus on masturbation (which might make op even more opposing, idk) while there is so much more to having a key. I got a lock to my room very late and felt much more comfortable when I knew nobody can barge in anytime they want, even if I was just studying - not something I'd try to hide and pretend I don't do",
          "id": 285,
          "comments": [
            {
              "score": 190,
              "content": "Exactly! It's a way of saying \"Your feelings and your privacy matter\".",
              "id": 286,
              "comments": [
                {
                  "score": 36,
                  "content": "Its like people that say \"nothing to hide nothing to fear\" like just because i dont have a gun hidden up my ass doesn't mean I'd let anyone shove a finger up there. Op needs to grow up. Privacy is important.",
                  "id": 287,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "My wife was a perfect teenager. She was a straight A student, did extracurriculars, had a job and paid for her own car insurance and gas, had 1 boyfriend from her junior year on (spoiler alert, that’s me), and was just fucking perfect all around.\n\nBUT\n\nShe argued with her mom constantly because her mom viewed her as if she was still 8, was constantly snooping through her room, wouldn’t let her go out on the rare nights she wasn’t studying, took her car keys away randomly and made her ride the bus, and just could not accept that her daughter, my now wife, wasn’t hiding shit and wasn’t up to anything, she was just a normal teenager.\n\nMy now MIL recently yelled at my wife, about my daughter, “I hope she is JUST LIKE YOU!” I said “me too! I hope she is a straight A student who works hard, never asks for money, and becomes a doctor! That would make her the greatest daughter ever!” MIL of course just talked about how difficult my wife was, because it has never occurred to her that my wife was difficult because her mother still treated her like a 5 year old when she was 16.\n\nMy MIL and wife don’t have the greatest relationship now (and personally I fucking hate my MIL), so hopefully OP can look into his future and see he is damaging his relationship with his kid. She’s growing up. If you don’t learn to accept that now, it’ll only get worse when she is in her 20s or 30s and you’re still treating her like your “you’re too young to know anything” daughter and not a fully functional adult.",
              "id": 288,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "[deleted]",
              "id": 289,
              "comments": [
                {
                  "score": 12,
                  "content": "I was thinking pretty much the same thing. I like having privacy, and I always have. I valued privacy as a teen (and now) just to be in my own element. It wasn’t about wanting to do things I didn’t think my parents would want me to do, I just wanted to be doing my own thing. Even if all you’re doing is reading a book in a space that’s all your own, privacy is valuable, and showing your child that you’re not going to allow them to have privacy at home is just a good way to teach them that the only way they’ll be able to get it is by sneaking around and getting into potentially dangerous situations away from home.",
                  "id": 290,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 135,
          "content": "You forgot that often it backfires way worse than your kids just not feeling comfortable to talk to you. Alienate your child enough and get really to die in a dank cheap nursing home all alone.",
          "id": 291,
          "comments": [
            {
              "score": 12,
              "content": "My friend works in a nursing home. He says he hears some awful comments from parents to children. Lots of them eventually stop visiting and don’t come back until the last days, which is sometimes years down the road. It’s sad to think that so many people are spending their last years alone because they won’t do things as easy as respecting and listening to their children",
              "id": 292,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "deleted  ^^^^^^^^^^^^^^^^0.4927  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/26428)",
          "id": 293,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 45,
          "content": "My mom had a hard time giving my sister privacy, so my sister’s therapist suggested my mom read Boundaries for Teens. I never read it myself, but it seemed to help my mom understand why my sister needed more freedom and privacy.",
          "id": 294,
          "comments": [
            {
              "score": 13,
              "content": "Thay makes zero sense to me. Was your mother never a teenager? Im 20 so im not that far removed from it, but its difficult for me to understand why these parents dont understand how their kids think.",
              "id": 295,
              "comments": [
                {
                  "score": 13,
                  "content": "My mom was raised in an incredibly conservative household, and she had no privacy as a kid. Even now that she's in her 50s, her dad asserts he has authority over her. She's chilled out a lot, though.",
                  "id": 296,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1599,
      "content": "YTA - my brother use to barge into my room when I was 16 and he was 4ish. I hated it so much, but because he broke the frame, the door only needed to be pushed hard for it to open. The lock was useless. My mom and his dad thought it was hilarious and so did he because he would do it constantly. I hated taking showers at home because he would open and close the door multiple times until I would snap and yell at him. Then, of course, I would get into trouble for yelling. It was all very humiliating.\n\nGet your kid a lock on her door. Don't be an asshole.",
      "id": 297,
      "comments": [
        {
          "score": 404,
          "content": "Jeez that sucks!! Parents don't understand what they're doing when they laugh at these things. My brother and his wife once gave their 2 year old son a light saber toy and found it hilarious when he would knock things over, hit our dog and once he decided it was so funny to hit me in the face with it! It wasn't a huge deal, I had a nosebleed but there wasn't a bruise or anything. But fuck it hurt and they were just laughing and found it so cute that he had broken things and hurt me and my dog. Now he's 6 and they don't know where he got it from that he'll get violent during an arguement or tantrum or laugh when he accidentally knocks someone over (younger kids)",
          "id": 298,
          "comments": [
            {
              "score": 191,
              "content": "But god forbid you ever tell a parent how to parent they all know exactly how to raise them. Well all know a manual comes out with the baby.",
              "id": 299,
              "comments": [
                {
                  "score": 36,
                  "content": "You'd think berating your kid for causing a mess or hurting other people/animals wouldn't require a \"manual\"...",
                  "id": 300,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": ">It takes more effort to order a pizza than it does to have a child... Has anyone ever ordered a pizza by accident?\n\n>Here's the thing, you can't just say 'well you haven't had any kids so you don't know anything about kids.' I've never flown a helicopter. But if I saw one in a tree, I could still be like, 'Dude fucked up. It's not supposed to be up there. That's pilot error.'\n\n-Steve Hofstetter",
                  "id": 301,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I can relate. For a whole year when I was like...13, my sisters royally pissed my stepdad off, and he took away the door for a whole year.\n\nEdit: They pissed him off because they broke it off the hinge and instead of fixing it, he just took it off and wouldn't let us have it back.",
          "id": 302,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1420,
      "content": "YTA if you don't install a lock AND don't also consistently enforce privacy rules in your house. I never had a lock on my door, but that's because my parents a) let me keep my door shut, b) ALWAYS knocked, c) waited until I actually said \"come in\" or opened the door for them before they walked in, and d) enforced these rules for everyone in the household. If one of my brothers had insisted on barging into my room regularly, I wouldn't feel safe, and I would have needed a lock. So, if you can't prevent your son (and yourself) from entering her room without her express permission, get her a lock so she can get changed in peace.",
      "id": 303,
      "comments": [
        {
          "score": 235,
          "content": "[deleted]",
          "id": 304,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 96,
          "content": "Same, dad always knocked, and would have disciplined my brothers had they been so disrespectful to me",
          "id": 305,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "I had a door at home with a lock, the lock was so bad 90% of the time just giving a quick turn on the outside the lock would pop open. If it didnt the first time, just go back and forwards a few times and it would. I hated that door. I hated that my sister would randomly show up for nothing. I switched the lock out with another in the house. No more random barging in, but my sister did scratch the living hell out of my door cause it was locked.... So people just dont get why privacy or your own space is important. \n\nHonestly as long as the kid doesnt do something to deserve there not to be a lock than when old enough it should have a lock. \n\nThings that would warrant not having a lock: In an argument, the child storms off and locks them selves in the room. Taking a SO into the room and locking the door. Hiding in the room to avoid responsibility. All things that warrant time without a lock, not a permanent removal.",
          "id": 306,
          "comments": [
            {
              "score": 12,
              "content": "Is your sister a dog dude",
              "id": 307,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "Yeah, exactly. My parents were never the controlling type so they always let me have a lock growing up, but one of our moves was into a house that had a bedroom without a lock. It had double doors that clicked together so a normal locking doorknob couldn't be fit into it (after I moved out and my brother moved into my old room they found a way to lock it, but I digress). Still, it was never a huge deal, because people always knocked **and waited until I said \"come in.\"** \n\nOne time my grandmother was visiting us (this is rare, we see her for maybe a couple days a year), and she just barged into my room (as she has a habit of doing) while I was changing. What. the. fuck. Not allowing a lock or at least not consistently enforcing privacy rules makes a person feel unsafe in their own home. My grandmother was always like OP and that's part of the reason my parents went minimal contact. Now she's essentially a stranger to me, and her visits are something everyone in my family actively bemoans when she's not here.\n\nNot allowing people to have any private space is, I maintain, a mild type of psychological torture. It's used in both cults and boot camp for the military to break people down so they can be more easily controlled. \n\nYour daughter needs a space where she can just cry. In peace. Without constant anxiety about whether she's going to get barged in on and embarrassed more than she already is. Forget masturbating, and I don't really like that everyone's explanations took that route. She just needs somewhere she can turn off the anxiety in the back of her head and just. have. peace of mind. Somewhere she can be alone.",
          "id": 308,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}